{
    "title": "My Love Tank is Low: Building the Foundation to a Lasting SR",
    "post_id": "ent911",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ent911/my_love_tank_is_low_building_the_foundation_to_a/",
    "author": null,
    "body": "Nothing is ever easy, sugar relationships included. Yes, we all hear the words spoken on SLF: sugar should be effortless and easy. No fights, no missed dates, no time where things are not absolutely awesome. But let’s be real, unless we are all walking robots this isn’t possible in any relationship. \n\n If, as an SB, you find yourself doing a multitude of things you don’t want to do, you find yourself unhappy some of the time, or you are choking down spicy lamb meat as a spice intolerant gal, I’d go out on a limb to say you aren’t in a mutually beneficial *sugar relationship*.\n\nIf, as an SD, you find yourself struggling to hold a conversation with your partner, are dealing with multiple cancelled dates, or are watching your SB text for hours with their friends while sitting across from you, I’d also say you aren’t in a mutually beneficial *sugar relationship*. \n\nYes, we all know that every sugar relationship includes sex. Any healthy relationship, for that matter, includes sex. If you’re thinking about the queen of England every time you have sex (unless, of course, the queen of England does it for you) I would strongly suggest you stop reading right now. Because I’m writing this post with the expectation that you all are out there getting your freaky on and enjoying the fuck out of it. \n\nYes, we all know that every sugar relationship includes money too. Whether it’s exchanged in cash or whether it’s exchanged in experiences, every relationship includes some form of monetary support. \n\nSex and Money are just one aspect of a multi-faceted sugar *relationship*. They are the soil upon which you build a foundation for a mutually beneficial relationship. Sure, if you don’t want to build a foundation you can opt to roll around in the mud for awhile, but in the end, for this to be a *relationship* you’ll need to put in a little elbow grease to build that foundation to support the walls and roof. \n\nMy SD and I have disagreements sometimes. He’s a poor communicator and I’m an emotional wreck at times. When he’s dealing with something internally he clams up and when I’m dealing with something I tend to smother someone. We don’t always want to talk about exactly what is bothering us. This happens in relationships of all kinds, but especially in sugar ones because they are supposed to be *easy*. \n\nWhy do we feel that sugar relationships are so short lived? Because many of us don’t put in the work to build the foundation for a lasting relationship because we’re too afraid to tell someone what we need or want.\n\nI see people post here all the time about how their partner wants them to do something they don’t want to do. So why do they do it? Because they don’t feel they have enough of a voice in the relationship to communicate how they feel without getting left in the dust. And sure, if you spend the majority of your relationship just rolling in the mud, I’d imagine you probably don’t have much of a leg to stand on when it comes to speaking up. But for everyone else? Communicate heartily and often. \n\nUnfortunately voicing ones desires in an SR is the trickiest mountain to climb. How do we tell our partner we don’t want to do that thing they want? How do we communicate that we’re feeling less-so without seeming drama filled or a Debbie Downer? \n\nMy guy and I recently had a disagreement. The details are irrelevant but I started to feel as if he wasn’t paying attention to me. I couldn’t put my finger on why or how, just that it was. Of course, I felt stupid bringing this up and he might well have his own stuff he was dealing with. So I kept it locked away until one day he tried to discuss something and I just cracked. There was tears and snot and a stony silence drive home. Nearing his drop off point the SD looks over and says: ‘Your gas tank is low. Pull in here so I can fill it.’ \n\nWe’re in the middle of a rough patch and he wants to fill my gas tank. We could very well never see each other again and he’s thinking about the fact that I’ll have to stop on the way home and he’d rather do it for me now, spend a few extra minutes with me, instead of run-fleeing from the car because I’m upset. Even if I’m angry he wants to help. \n\nAnd so, we came up with the term: My Love Tank is Low. \n\nWhen one of us states our love tank is low the other is to show extra affection and attention without requiring or pressing to know what is really wrong or requiring something in return. Sometimes we do not want to talk about it, or sometimes we cannot articulate it. Sometimes we just don’t want to shatter the illusion of the SR that is supposed to be perfect. Sometimes we just need a little extra love.\n\nMutually beneficial relationships aren’t exchanging money for sex. It’s about communicating with your partner about what is beneficial to you at that moment. Maybe that means you don’t eat spicy lamb meat, or maybe that means you refuse to see the Trans-Siberian Orchestra, or maybe that means you just show a little extra love when someone is feeling down. \n\nMy partner and I are nearing five months. We aren’t perfect, but I can tell you we are as perfectly happy as the day we first met. And that’s because we communicate with each other. Or, sometimes, we just cuddle it out. \n\nYes, sometimes, some people just aren’t meant to be. If you can’t come to an agreement then by all means move on. But why do we let otherwise good SR’s go sour over something that can be prevented? \n\nWhatever your thing is, communicate it. It’s okay to have needs. Put your baggage out there if you want, or just tell someone you’re feeling out of sorts. Suggest a different date if you don’t want to attend that nightclub. Build the foundation for a lasting mutually beneficial relationship. And fill up your partners love tank if it’s low.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ent911/my_love_tank_is_low_building_the_foundation_to_a/",
    "score": 128,
    "upvote_ratio": 0.95,
    "created_utc": 1578862350.0,
    "num_comments": 25,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "“We’re too afraid to tell someone what we want or need”😭\n\nThis is so true where we try to adhere to a certain standard we have to live up to be a good SD/SB while stifling what we really want or need. \n\nThank you AB for putting words to myriad of struggles we go through as a member of this lifestyle.",
            "author": null,
            "id": "fe5105p",
            "parent_id": "t3_ent911",
            "score": 20,
            "created_utc": 1578864646.0,
            "replies": []
        },
        {
            "body": "Thank you for sharing! I love “my love tank is low.” I’m going to share this with my SD. We’ve been together 2 years now but are always working to make things better. I think this is the perfect next thing to add.",
            "author": null,
            "id": "fe4wcp8",
            "parent_id": "t3_ent911",
            "score": 6,
            "created_utc": 1578863406.0,
            "replies": []
        },
        {
            "body": "This the the best post I’ve read this week! Thank you! Very insightful xo",
            "author": null,
            "id": "fe4tqzd",
            "parent_id": "t3_ent911",
            "score": 10,
            "created_utc": 1578862704.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fe4vx3s",
                    "parent_id": "t1_fe4tqzd",
                    "score": 8,
                    "created_utc": 1578863288.0,
                    "replies": [
                        {
                            "body": "I second this!  If there isnt a book coming i am going to be sorely disappointed",
                            "author": "OliviaWildflower2332",
                            "id": "fe55279",
                            "parent_id": "t1_fe4vx3s",
                            "score": 4,
                            "created_utc": 1578865730.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Communicating what we want/need can be difficult for a lot of us - whether in friendships or in modern dating. We want to be seen as “fun” or “drama free” or “easy-going.”It’s why when someone asks how we’re really doing we are programmed to say “fine.”\n\nThere are too many of us that cut off relationships because of a (minor) difficulty/disagreement. If we can learn to communicate what we feel and why and the other can hear and accept it, it’s a really beautiful thing.\n\nThank you for another wonderful post AB ♥️",
            "author": "affectionateSB",
            "id": "fe5fcms",
            "parent_id": "t3_ent911",
            "score": 6,
            "created_utc": 1578868817.0,
            "replies": []
        },
        {
            "body": "Points well taken but it must not be missed there are some severe fundamental issues that  make up for many SRs. \n\nFirst is the age gap. My SB is 13 yrs my junior. Well we do ok. But I have seen the normal age gaps tend to be 20, 30, 40 years. Second is marital status of the SD. It’s no secret that 70 - 80% of SDs are married and would rather not put much emotional investment in an SR. Third, SBs are looking at SR as a gig and not a romantic relationship. For romance there is tinder and vanilla. Sugar is just something where you put up an act and pretend to like a guy 30 years your senior. \n\nThese are just a few big ones. There are many more and hence perfection is not an expectation.",
            "author": null,
            "id": "fe6b91q",
            "parent_id": "t3_ent911",
            "score": 4,
            "created_utc": 1578886027.0,
            "replies": [
                {
                    "body": "agree with your points.",
                    "author": "JaneJigarSD",
                    "id": "fe8jkvm",
                    "parent_id": "t1_fe6b91q",
                    "score": 1,
                    "created_utc": 1578926848.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I might be in Internet love ❤️ with AB 😏.   So sweet and so thoughtful.",
            "author": "SlfFng",
            "id": "fe4uxb4",
            "parent_id": "t3_ent911",
            "score": 3,
            "created_utc": 1578863040.0,
            "replies": [
                {
                    "body": "And I’m going to internet murder you. 🤣",
                    "author": "InitialD-86",
                    "id": "fe4ydj9",
                    "parent_id": "t1_fe4uxb4",
                    "score": 5,
                    "created_utc": 1578863965.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The book the “5 Love Languages” uses that same terminology as well as their app.",
            "author": "Philip89820",
            "id": "fe5u1qz",
            "parent_id": "t3_ent911",
            "score": 4,
            "created_utc": 1578874936.0,
            "replies": []
        },
        {
            "body": "This was such a good read AB. I've heard the \"love tank is low\" phrase but never used it. However seeing how you use it to communicate with your SD makes me want to incorporate it into mine. Thank you.",
            "author": null,
            "id": "fe52325",
            "parent_id": "t3_ent911",
            "score": 3,
            "created_utc": 1578865003.0,
            "replies": []
        },
        {
            "body": "This is so fantastic! I just ❤ you!",
            "author": "OliviaWildflower2332",
            "id": "fe55e1r",
            "parent_id": "t3_ent911",
            "score": 3,
            "created_utc": 1578865772.0,
            "replies": []
        },
        {
            "body": "What an awesome post!",
            "author": "ksmith33672",
            "id": "fe52ubm",
            "parent_id": "t3_ent911",
            "score": 2,
            "created_utc": 1578865160.0,
            "replies": []
        },
        {
            "body": "What a lovely post. Love the \"love tank\" analogy. Feels similar to \"can't pour from and empty cup\". Can't love from an empty tank!",
            "author": "ms_moogle",
            "id": "fe56aa7",
            "parent_id": "t3_ent911",
            "score": 2,
            "created_utc": 1578866028.0,
            "replies": []
        },
        {
            "body": "I really loved the “cuddle it out” part.  😊 It’s always great reading your posts, thanks OP!",
            "author": "why_so_sexy_",
            "id": "fe5gwkv",
            "parent_id": "t3_ent911",
            "score": 2,
            "created_utc": 1578869287.0,
            "replies": []
        },
        {
            "body": "This is a beautiful post, and it’s obvious that the two of you have set things up to be a relationship. It’s just that not all mutually beneficial arrangements ARE meant to be romantic relationships... the majority of them are probably not. Most serve a purpose for each person in that they simply enjoy each other‘s company and reap the benefits. Only one of mine ever turned into one, and the others were all great, but I’d rarely consider an SD BF material, for various reasons. It’s one thing to enjoy his company, and another entirely to be a “significant other”... and I’d never put the majority of my arrangements into the latter category.",
            "author": "RealEarthAngel",
            "id": "fe5zw1z",
            "parent_id": "t3_ent911",
            "score": 2,
            "created_utc": 1578878651.0,
            "replies": []
        },
        {
            "body": "I love this post. I’ve used a plant when referencing my relationship. My equivalent is ‘plant is dehydrated’/‘plant needs some water’",
            "author": null,
            "id": "fe60za7",
            "parent_id": "t3_ent911",
            "score": 2,
            "created_utc": 1578879350.0,
            "replies": []
        },
        {
            "body": "> And that’s because we communicate with each other\n\nThis would solve a *great many* problems in a variety of different types of relationships.",
            "author": "Ranger3752",
            "id": "fe63kyp",
            "parent_id": "t3_ent911",
            "score": 2,
            "created_utc": 1578881011.0,
            "replies": []
        },
        {
            "body": "In sugar relationships, sex and money create the road between two people.  But it's only trust, emotional honesty, and a connection that keeps that road well paved. \n\nI've been working on that one^ a while, lol",
            "author": "Gemini-Fox",
            "id": "fe930co",
            "parent_id": "t3_ent911",
            "score": 2,
            "created_utc": 1578933676.0,
            "replies": []
        },
        {
            "body": "Love this!!!",
            "author": "sugarbarbarella",
            "id": "fe5to1n",
            "parent_id": "t3_ent911",
            "score": 1,
            "created_utc": 1578874695.0,
            "replies": []
        },
        {
            "body": "Beautifully written. + 1 to arrangements with chemistry, connection, and understanding.",
            "author": "dade_murphy1",
            "id": "fe6k0u6",
            "parent_id": "t3_ent911",
            "score": 1,
            "created_utc": 1578893423.0,
            "replies": []
        },
        {
            "body": "My SB starts with “ I hate to keep asking but my $ are a bit low...” she never asks for anything unreasonable",
            "author": "Jamesthesage",
            "id": "fe6klsl",
            "parent_id": "t3_ent911",
            "score": 1,
            "created_utc": 1578893999.0,
            "replies": []
        },
        {
            "body": "Ab, the new brook urick, except actually good at this.",
            "author": "Gemini-Fox",
            "id": "fe91trp",
            "parent_id": "t3_ent911",
            "score": 1,
            "created_utc": 1578933281.0,
            "replies": []
        },
        {
            "body": "This could be a title of a book itself:\n“My love tank is low”",
            "author": "badmonopoly",
            "id": "fe69431",
            "parent_id": "t3_ent911",
            "score": 1,
            "created_utc": 1578884501.0,
            "replies": []
        },
        {
            "body": "Girlfriend! I think everyone fell in love with you a little today, bae. 😻😘🖤 You’re intelligent, thoughtful and this post was raw and needed. #goals",
            "author": "luckylvbaby",
            "id": "fe6f6nk",
            "parent_id": "t3_ent911",
            "score": 1,
            "created_utc": 1578889082.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fe4vx3s",
            "parent_id": "t1_fe4tqzd",
            "score": 8,
            "created_utc": 1578863288.0,
            "replies": [
                {
                    "body": "I second this!  If there isnt a book coming i am going to be sorely disappointed",
                    "author": "OliviaWildflower2332",
                    "id": "fe55279",
                    "parent_id": "t1_fe4vx3s",
                    "score": 4,
                    "created_utc": 1578865730.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "agree with your points.",
            "author": "JaneJigarSD",
            "id": "fe8jkvm",
            "parent_id": "t1_fe6b91q",
            "score": 1,
            "created_utc": 1578926848.0,
            "replies": []
        },
        {
            "body": "And I’m going to internet murder you. 🤣",
            "author": "InitialD-86",
            "id": "fe4ydj9",
            "parent_id": "t1_fe4uxb4",
            "score": 5,
            "created_utc": 1578863965.0,
            "replies": []
        },
        {
            "body": "I second this!  If there isnt a book coming i am going to be sorely disappointed",
            "author": "OliviaWildflower2332",
            "id": "fe55279",
            "parent_id": "t1_fe4vx3s",
            "score": 4,
            "created_utc": 1578865730.0,
            "replies": []
        }
    ]
}