{
    "title": "Hair growth progress 5/6 months",
    "post_id": "jexoc8",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/jexoc8/hair_growth_progress_56_months/",
    "author": "edaviestuggy",
    "body": "",
    "url": "https://i.redd.it/9uns0tqi5bu51.jpg",
    "score": 384,
    "upvote_ratio": 0.96,
    "created_utc": 1603225001.0,
    "num_comments": 37,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "If you want to speed it up\n\n- Take a daily hair and nails vitamin and Keratin supplement along with a general men's multivitamin\n\n- Use sulfate free shampoo and a good conditioner and massage your scalp while the conditioner is in (to stimulate blood flow)",
            "author": "drunky_crowette",
            "id": "g9i13ig",
            "parent_id": "t3_jexoc8",
            "score": 45,
            "created_utc": 1603245597.0,
            "replies": [
                {
                    "body": "Ah nice, I already take a biotin tablet and condition my hair every day which I think has definitely helped. I'll look into what you said too thank you 🙏",
                    "author": "edaviestuggy",
                    "id": "g9icx2y",
                    "parent_id": "t1_g9i13ig",
                    "score": 17,
                    "created_utc": 1603253137.0,
                    "replies": []
                },
                {
                    "body": "what do you consider a 'good' conditioner?",
                    "author": "stiicky",
                    "id": "g9ib3ey",
                    "parent_id": "t1_g9i13ig",
                    "score": 7,
                    "created_utc": 1603251856.0,
                    "replies": [
                        {
                            "body": "One without silicone. It's not always logical because you can get an expensive one that has silicone and a cheap one that doesn't, so just be aware.\n\nBasically you need to get one without silicone because only sulphates clean silicone, so if you get silicone conditioner and a sulphate free shampoo then you're building up silicone and your hair will get greasy. Also sulphates are what dries out your hair and damages it so it's all-round bad.\n\nBut to be honest if you are getting conditioner without silicone then you don't need the shampoo, you can just co-wash.",
                            "author": "tibetan-sand-fox",
                            "id": "g9ih7bl",
                            "parent_id": "t1_g9ib3ey",
                            "score": 11,
                            "created_utc": 1603256391.0,
                            "replies": [
                                {
                                    "body": "I have a follow up question that might be silly. How can I tell if my conditioner is silicone free? It doesn’t have the word silicone anywhere on the label, not on any of the ingredients but it also doesn’t say silicone free anywhere. \n\nIt does say paraben free, are silicones included in that? Google left me a bit confused...",
                                    "author": "lupe_the_jedi",
                                    "id": "g9k9sei",
                                    "parent_id": "t1_g9ih7bl",
                                    "score": 1,
                                    "created_utc": 1603302710.0,
                                    "replies": [
                                        {
                                            "body": "There is a link somewhere that will let you enter the conditioner and it will check if it has silicone but I don't have the time to find it right now. If I remember then I'll edit and link it. I found it on the curly girl method subreddit. It's immensely important for people with curly hair since their hair is my susceptible to drying out.\n\nEdit: This wasn't the link I used but it does the job. [Here it is.](https://docs.google.com/document/d/1Dlc52yoWdMo4p7RWcVERJS_Lo5NSeDCtV2gWyTBllAw/mobilebasic) It's a link from r/curlyhair and lists products that are green-lit in terms of ingredients. \n\nIf you don't have curly hair, then this is still probably a good routine to follow but if you do have curly hair then this will really help.",
                                            "author": "tibetan-sand-fox",
                                            "id": "g9m7h1t",
                                            "parent_id": "t1_g9k9sei",
                                            "score": 1,
                                            "created_utc": 1603340089.0,
                                            "replies": [
                                                {
                                                    "body": "Wow thank you!!",
                                                    "author": "lupe_the_jedi",
                                                    "id": "g9masmt",
                                                    "parent_id": "t1_g9m7h1t",
                                                    "score": 1,
                                                    "created_utc": 1603342641.0,
                                                    "replies": [
                                                        {
                                                            "body": "You might have a better time using [this tool](https://www.curlsbot.com) I also found on r/curlyhair where you just copy/paste the ingredients from the product’s website\n\nEdit: I know it says it’s for curly hair but it’s helpful for checking the ingredients regardless of hair type",
                                                            "author": "-JALization-",
                                                            "id": "g9mcckd",
                                                            "parent_id": "t1_g9masmt",
                                                            "score": 1,
                                                            "created_utc": 1603343907.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Here's a sneak peek of /r/curlyhair using the [top posts](https://np.reddit.com/r/curlyhair/top/?sort=top&t=year) of the year!\n\n\\#1: [Some child with cancer is about to have a FABULOUS head of curly hair!](https://i.redd.it/ifs38oxbxj051.jpg) | [478 comments](https://np.reddit.com/r/curlyhair/comments/gp93zi/some_child_with_cancer_is_about_to_have_a/)  \n\\#2: [Goodbye for now, Curly Hair Reddit! My hair started falling out due to chemo treatment for lymphoma so I decided to shave it! I'll see you in a few months when it starts growing back, possibly curlier!](https://i.redd.it/0wd9eyp81gb41.jpg) | [688 comments](https://np.reddit.com/r/curlyhair/comments/eqa5j4/goodbye_for_now_curly_hair_reddit_my_hair_started/)  \n\\#3: [3 years of hair growth later (plus some other changes 😉)](https://i.redd.it/od8j7oeak3n41.jpg) | [1506 comments](https://np.reddit.com/r/curlyhair/comments/fjs3g2/3_years_of_hair_growth_later_plus_some_other/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/fpi5i6/blacklist_vii/)",
                                                                    "author": "sneakpeekbot",
                                                                    "id": "g9mcdi9",
                                                                    "parent_id": "t1_g9mcckd",
                                                                    "score": 1,
                                                                    "created_utc": 1603343929.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Just wanted to drop by to say thank you! Turned out my conditioner did have silicone, so I’ll be making a switch!",
                                                                    "author": "lupe_the_jedi",
                                                                    "id": "g9so20x",
                                                                    "parent_id": "t1_g9mcckd",
                                                                    "score": 1,
                                                                    "created_utc": 1603485552.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "how can i tell if a conditioner is silicone free?\n\nalso, can you elaborate? what does it mean for sulphates to clean silicone? basicalyl what type of shampoo and conditioner should i get and what ingredients should be in both / not be in both?\n\nmy hair is really greasy right now, do you know why? i condition like 3x a week and shampoo once a week",
                                    "author": null,
                                    "id": "g9kp99p",
                                    "parent_id": "t1_g9ih7bl",
                                    "score": 1,
                                    "created_utc": 1603310069.0,
                                    "replies": [
                                        {
                                            "body": "Your hair is either greasy because you just changed your routine and it's getting used to it or you are using products, or you're not using the right shampoo/conditioner.\n\nIf the conditioner has silicone and the shampoo is sulphate free, it'll get greasy.",
                                            "author": "tibetan-sand-fox",
                                            "id": "g9m7lkb",
                                            "parent_id": "t1_g9kp99p",
                                            "score": 1,
                                            "created_utc": 1603340182.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": ">ecause only sulphates clean silicone\n\nhow would sulphates clean silicon if i'm using a sulphate free shampoo? also are you saying i need a shampoo with sulphate in it?\n\nif shampoo goes before conditioner how would sulphate clean the silicon if the conditioner goes last?",
                                    "author": null,
                                    "id": "g9kpfq7",
                                    "parent_id": "t1_g9ih7bl",
                                    "score": 1,
                                    "created_utc": 1603310155.0,
                                    "replies": [
                                        {
                                            "body": "No, you want a shampoo without sulphates. Sulphates will dry out your hair. \n\nShampoo goes in and then conditioner becayse the job of the shampoo is the cleanse and reset your hair. So you're washing out the last week's conditioner (if it has silicone) and natural grease and then reapplying conditioner. \n\nBasically silicone is put into some conditioner because it helps smoothen the hair (afaik) but if it's not removed by sulphates it will build up over time. So if your conditioner has silicone you are forced to use sulphate shampoo at some point or another.\n\nI don't use shampoo, I just wash my hair in silicone free conditioner and then reapply the same conditioner. This 100% cleans my hair, which blew my mind at first.",
                                            "author": "tibetan-sand-fox",
                                            "id": "g9m7vbm",
                                            "parent_id": "t1_g9kpfq7",
                                            "score": 1,
                                            "created_utc": 1603340381.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "What’s a good conditioner?",
                    "author": "NameThatHasDerpInIt",
                    "id": "g9iekx4",
                    "parent_id": "t1_g9i13ig",
                    "score": 2,
                    "created_utc": 1603254360.0,
                    "replies": [
                        {
                            "body": "Not OP but a good conditioner is basically anything that doesn’t contain silicones because silicones built up in your hair without the use of sulfates (sulfates are damaging to hair so it’s best to not use either)",
                            "author": "-JALization-",
                            "id": "g9igb93",
                            "parent_id": "t1_g9iekx4",
                            "score": 5,
                            "created_utc": 1603255682.0,
                            "replies": [
                                {
                                    "body": "i'm confused, so what ingredients SHOULD be in my shampoo or conditioner and what ingredients should not?\n\ni have like super dandruffy greasy ass hair. i use some korean shampoo and conditioner so i don't know what's in it. i shampoo once every two weeks (i forget to do that shit im lazy lol) and condition twice (or thrice/3x) a week. do you know what could cause my hair to be so greasy?\n\nalso i have hard/thick hair, i'm indian/bengali so i have that type of shitty thick dry hair. except it feels greasy.\n\nwhat type of conditioner and shampoo should i buy and what ingredients should it not have?",
                                    "author": null,
                                    "id": "g9kpqap",
                                    "parent_id": "t1_g9igb93",
                                    "score": 1,
                                    "created_utc": 1603310297.0,
                                    "replies": [
                                        {
                                            "body": "No silicones, no sulfates, you should be mostly fine after that. It’s good that you’re not shampooing too often and instead using only conditioner in between, as excessive shampooing tends to cause hair to get brittle and damaged. A lot of the time greasy hair is the result of over-shampooing but you obviously aren’t doing that, it could also be a transition to using less shampoo since your scalp hasn’t “realized” you aren’t shampooing as often anymore. About the dandruff though I don’t know, in fact I’m currently struggling with it myself, if it’s getting severe you could try visiting a dermatologist. I hope I helped, and remember, no silicones, no sulfates",
                                            "author": "-JALization-",
                                            "id": "g9mbzbr",
                                            "parent_id": "t1_g9kpqap",
                                            "score": 1,
                                            "created_utc": 1603343608.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What it only takes me a month to go from left to right 😭",
            "author": "Romanista3",
            "id": "g9h56g6",
            "parent_id": "t3_jexoc8",
            "score": 28,
            "created_utc": 1603228597.0,
            "replies": [
                {
                    "body": "That's from a 1 grade or even a 0.5 to about 3/4 inches 😔 I guess my hair grows kinda slow",
                    "author": "edaviestuggy",
                    "id": "g9ibke3",
                    "parent_id": "t1_g9h56g6",
                    "score": 8,
                    "created_utc": 1603252183.0,
                    "replies": []
                },
                {
                    "body": "No way",
                    "author": "NoScopeJustMe",
                    "id": "g9imcjd",
                    "parent_id": "t1_g9h56g6",
                    "score": 6,
                    "created_utc": 1603260869.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nice, looks fantastic.  Do you have a goal style you are going for?",
            "author": "PJlong",
            "id": "g9hd8tj",
            "parent_id": "t3_jexoc8",
            "score": 6,
            "created_utc": 1603232067.0,
            "replies": [
                {
                    "body": "Well originally I was going for a Leonardo DiCaprio / Brad Pitt but that was more of a transition style. Once my hair gets much longer I'll try and get it more like professional skater Dylan Rieder 🙏",
                    "author": "edaviestuggy",
                    "id": "g9idrst",
                    "parent_id": "t1_g9hd8tj",
                    "score": 5,
                    "created_utc": 1603253757.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "From young soldier to Kpop star. Nice",
            "author": "TrumpIsMyGodAndDad",
            "id": "g9icgrh",
            "parent_id": "t3_jexoc8",
            "score": 6,
            "created_utc": 1603252809.0,
            "replies": [
                {
                    "body": "Haha thank you! If you would like to see what it looks like from the front I've got more all down my profile on here 👍",
                    "author": "edaviestuggy",
                    "id": "g9iek4e",
                    "parent_id": "t1_g9icgrh",
                    "score": 3,
                    "created_utc": 1603254343.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lookin good! How many times have u got it cut?",
            "author": "h-GOAT",
            "id": "g9iuoti",
            "parent_id": "t3_jexoc8",
            "score": 1,
            "created_utc": 1603269557.0,
            "replies": [
                {
                    "body": "... 0 times 😂",
                    "author": "edaviestuggy",
                    "id": "g9iupgu",
                    "parent_id": "t1_g9iuoti",
                    "score": 1,
                    "created_utc": 1603269577.0,
                    "replies": [
                        {
                            "body": "LMAO looked trimmed at first look, fair enough",
                            "author": "h-GOAT",
                            "id": "g9iurrh",
                            "parent_id": "t1_g9iupgu",
                            "score": 3,
                            "created_utc": 1603269651.0,
                            "replies": [
                                {
                                    "body": "I'm just trying to get all that length first and then I can get it cut to the final style 🙏",
                                    "author": "edaviestuggy",
                                    "id": "g9iuvge",
                                    "parent_id": "t1_g9iurrh",
                                    "score": 1,
                                    "created_utc": 1603269768.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "There’s absolutely no way you haven’t had a trim lol. The hair at the back would be much longer if that were the case.",
                            "author": "pistachionose",
                            "id": "g9iwe76",
                            "parent_id": "t1_g9iupgu",
                            "score": 1,
                            "created_utc": 1603271528.0,
                            "replies": [
                                {
                                    "body": "I genuinely haven't tho, they haven't touched my hair in months. Like I started this during lockdown and after it was lifted, I just kept going",
                                    "author": "edaviestuggy",
                                    "id": "g9iwh9s",
                                    "parent_id": "t1_g9iwe76",
                                    "score": 0,
                                    "created_utc": 1603271626.0,
                                    "replies": [
                                        {
                                            "body": "Why does your neck line look so tidy when there should be a mullet developing?",
                                            "author": "pistachionose",
                                            "id": "g9ix8lf",
                                            "parent_id": "t1_g9iwh9s",
                                            "score": 1,
                                            "created_utc": 1603272492.0,
                                            "replies": [
                                                {
                                                    "body": "Cause I had a very tight fade from the bottom going up and those hairs just aren't growing as fast",
                                                    "author": "edaviestuggy",
                                                    "id": "g9iz5vo",
                                                    "parent_id": "t1_g9ix8lf",
                                                    "score": 1,
                                                    "created_utc": 1603274640.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Please update at 1/1 month",
            "author": null,
            "id": "g9jb315",
            "parent_id": "t3_jexoc8",
            "score": 1,
            "created_utc": 1603284901.0,
            "replies": [
                {
                    "body": "?? The 5/6 is supposed to be like 5 or 6 months cause I haven't kept track properly 😂",
                    "author": "edaviestuggy",
                    "id": "g9jbb39",
                    "parent_id": "t1_g9jb315",
                    "score": 1,
                    "created_utc": 1603285047.0,
                    "replies": [
                        {
                            "body": "I know. I tried to make a joke. Didn't work. AS USUAL BECAUSE I'M NOT FUNNY. FUCK.",
                            "author": null,
                            "id": "g9jbgyz",
                            "parent_id": "t1_g9jbb39",
                            "score": 2,
                            "created_utc": 1603285151.0,
                            "replies": [
                                {
                                    "body": "No worries I'm probably just dumb 🙃",
                                    "author": "edaviestuggy",
                                    "id": "g9jbjh9",
                                    "parent_id": "t1_g9jbgyz",
                                    "score": 2,
                                    "created_utc": 1603285196.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ah nice, I already take a biotin tablet and condition my hair every day which I think has definitely helped. I'll look into what you said too thank you 🙏",
            "author": "edaviestuggy",
            "id": "g9icx2y",
            "parent_id": "t1_g9i13ig",
            "score": 17,
            "created_utc": 1603253137.0,
            "replies": []
        },
        {
            "body": "what do you consider a 'good' conditioner?",
            "author": "stiicky",
            "id": "g9ib3ey",
            "parent_id": "t1_g9i13ig",
            "score": 7,
            "created_utc": 1603251856.0,
            "replies": [
                {
                    "body": "One without silicone. It's not always logical because you can get an expensive one that has silicone and a cheap one that doesn't, so just be aware.\n\nBasically you need to get one without silicone because only sulphates clean silicone, so if you get silicone conditioner and a sulphate free shampoo then you're building up silicone and your hair will get greasy. Also sulphates are what dries out your hair and damages it so it's all-round bad.\n\nBut to be honest if you are getting conditioner without silicone then you don't need the shampoo, you can just co-wash.",
                    "author": "tibetan-sand-fox",
                    "id": "g9ih7bl",
                    "parent_id": "t1_g9ib3ey",
                    "score": 11,
                    "created_utc": 1603256391.0,
                    "replies": [
                        {
                            "body": "I have a follow up question that might be silly. How can I tell if my conditioner is silicone free? It doesn’t have the word silicone anywhere on the label, not on any of the ingredients but it also doesn’t say silicone free anywhere. \n\nIt does say paraben free, are silicones included in that? Google left me a bit confused...",
                            "author": "lupe_the_jedi",
                            "id": "g9k9sei",
                            "parent_id": "t1_g9ih7bl",
                            "score": 1,
                            "created_utc": 1603302710.0,
                            "replies": [
                                {
                                    "body": "There is a link somewhere that will let you enter the conditioner and it will check if it has silicone but I don't have the time to find it right now. If I remember then I'll edit and link it. I found it on the curly girl method subreddit. It's immensely important for people with curly hair since their hair is my susceptible to drying out.\n\nEdit: This wasn't the link I used but it does the job. [Here it is.](https://docs.google.com/document/d/1Dlc52yoWdMo4p7RWcVERJS_Lo5NSeDCtV2gWyTBllAw/mobilebasic) It's a link from r/curlyhair and lists products that are green-lit in terms of ingredients. \n\nIf you don't have curly hair, then this is still probably a good routine to follow but if you do have curly hair then this will really help.",
                                    "author": "tibetan-sand-fox",
                                    "id": "g9m7h1t",
                                    "parent_id": "t1_g9k9sei",
                                    "score": 1,
                                    "created_utc": 1603340089.0,
                                    "replies": [
                                        {
                                            "body": "Wow thank you!!",
                                            "author": "lupe_the_jedi",
                                            "id": "g9masmt",
                                            "parent_id": "t1_g9m7h1t",
                                            "score": 1,
                                            "created_utc": 1603342641.0,
                                            "replies": [
                                                {
                                                    "body": "You might have a better time using [this tool](https://www.curlsbot.com) I also found on r/curlyhair where you just copy/paste the ingredients from the product’s website\n\nEdit: I know it says it’s for curly hair but it’s helpful for checking the ingredients regardless of hair type",
                                                    "author": "-JALization-",
                                                    "id": "g9mcckd",
                                                    "parent_id": "t1_g9masmt",
                                                    "score": 1,
                                                    "created_utc": 1603343907.0,
                                                    "replies": [
                                                        {
                                                            "body": "Here's a sneak peek of /r/curlyhair using the [top posts](https://np.reddit.com/r/curlyhair/top/?sort=top&t=year) of the year!\n\n\\#1: [Some child with cancer is about to have a FABULOUS head of curly hair!](https://i.redd.it/ifs38oxbxj051.jpg) | [478 comments](https://np.reddit.com/r/curlyhair/comments/gp93zi/some_child_with_cancer_is_about_to_have_a/)  \n\\#2: [Goodbye for now, Curly Hair Reddit! My hair started falling out due to chemo treatment for lymphoma so I decided to shave it! I'll see you in a few months when it starts growing back, possibly curlier!](https://i.redd.it/0wd9eyp81gb41.jpg) | [688 comments](https://np.reddit.com/r/curlyhair/comments/eqa5j4/goodbye_for_now_curly_hair_reddit_my_hair_started/)  \n\\#3: [3 years of hair growth later (plus some other changes 😉)](https://i.redd.it/od8j7oeak3n41.jpg) | [1506 comments](https://np.reddit.com/r/curlyhair/comments/fjs3g2/3_years_of_hair_growth_later_plus_some_other/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/fpi5i6/blacklist_vii/)",
                                                            "author": "sneakpeekbot",
                                                            "id": "g9mcdi9",
                                                            "parent_id": "t1_g9mcckd",
                                                            "score": 1,
                                                            "created_utc": 1603343929.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Just wanted to drop by to say thank you! Turned out my conditioner did have silicone, so I’ll be making a switch!",
                                                            "author": "lupe_the_jedi",
                                                            "id": "g9so20x",
                                                            "parent_id": "t1_g9mcckd",
                                                            "score": 1,
                                                            "created_utc": 1603485552.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "how can i tell if a conditioner is silicone free?\n\nalso, can you elaborate? what does it mean for sulphates to clean silicone? basicalyl what type of shampoo and conditioner should i get and what ingredients should be in both / not be in both?\n\nmy hair is really greasy right now, do you know why? i condition like 3x a week and shampoo once a week",
                            "author": null,
                            "id": "g9kp99p",
                            "parent_id": "t1_g9ih7bl",
                            "score": 1,
                            "created_utc": 1603310069.0,
                            "replies": [
                                {
                                    "body": "Your hair is either greasy because you just changed your routine and it's getting used to it or you are using products, or you're not using the right shampoo/conditioner.\n\nIf the conditioner has silicone and the shampoo is sulphate free, it'll get greasy.",
                                    "author": "tibetan-sand-fox",
                                    "id": "g9m7lkb",
                                    "parent_id": "t1_g9kp99p",
                                    "score": 1,
                                    "created_utc": 1603340182.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">ecause only sulphates clean silicone\n\nhow would sulphates clean silicon if i'm using a sulphate free shampoo? also are you saying i need a shampoo with sulphate in it?\n\nif shampoo goes before conditioner how would sulphate clean the silicon if the conditioner goes last?",
                            "author": null,
                            "id": "g9kpfq7",
                            "parent_id": "t1_g9ih7bl",
                            "score": 1,
                            "created_utc": 1603310155.0,
                            "replies": [
                                {
                                    "body": "No, you want a shampoo without sulphates. Sulphates will dry out your hair. \n\nShampoo goes in and then conditioner becayse the job of the shampoo is the cleanse and reset your hair. So you're washing out the last week's conditioner (if it has silicone) and natural grease and then reapplying conditioner. \n\nBasically silicone is put into some conditioner because it helps smoothen the hair (afaik) but if it's not removed by sulphates it will build up over time. So if your conditioner has silicone you are forced to use sulphate shampoo at some point or another.\n\nI don't use shampoo, I just wash my hair in silicone free conditioner and then reapply the same conditioner. This 100% cleans my hair, which blew my mind at first.",
                                    "author": "tibetan-sand-fox",
                                    "id": "g9m7vbm",
                                    "parent_id": "t1_g9kpfq7",
                                    "score": 1,
                                    "created_utc": 1603340381.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What’s a good conditioner?",
            "author": "NameThatHasDerpInIt",
            "id": "g9iekx4",
            "parent_id": "t1_g9i13ig",
            "score": 2,
            "created_utc": 1603254360.0,
            "replies": [
                {
                    "body": "Not OP but a good conditioner is basically anything that doesn’t contain silicones because silicones built up in your hair without the use of sulfates (sulfates are damaging to hair so it’s best to not use either)",
                    "author": "-JALization-",
                    "id": "g9igb93",
                    "parent_id": "t1_g9iekx4",
                    "score": 5,
                    "created_utc": 1603255682.0,
                    "replies": [
                        {
                            "body": "i'm confused, so what ingredients SHOULD be in my shampoo or conditioner and what ingredients should not?\n\ni have like super dandruffy greasy ass hair. i use some korean shampoo and conditioner so i don't know what's in it. i shampoo once every two weeks (i forget to do that shit im lazy lol) and condition twice (or thrice/3x) a week. do you know what could cause my hair to be so greasy?\n\nalso i have hard/thick hair, i'm indian/bengali so i have that type of shitty thick dry hair. except it feels greasy.\n\nwhat type of conditioner and shampoo should i buy and what ingredients should it not have?",
                            "author": null,
                            "id": "g9kpqap",
                            "parent_id": "t1_g9igb93",
                            "score": 1,
                            "created_utc": 1603310297.0,
                            "replies": [
                                {
                                    "body": "No silicones, no sulfates, you should be mostly fine after that. It’s good that you’re not shampooing too often and instead using only conditioner in between, as excessive shampooing tends to cause hair to get brittle and damaged. A lot of the time greasy hair is the result of over-shampooing but you obviously aren’t doing that, it could also be a transition to using less shampoo since your scalp hasn’t “realized” you aren’t shampooing as often anymore. About the dandruff though I don’t know, in fact I’m currently struggling with it myself, if it’s getting severe you could try visiting a dermatologist. I hope I helped, and remember, no silicones, no sulfates",
                                    "author": "-JALization-",
                                    "id": "g9mbzbr",
                                    "parent_id": "t1_g9kpqap",
                                    "score": 1,
                                    "created_utc": 1603343608.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's from a 1 grade or even a 0.5 to about 3/4 inches 😔 I guess my hair grows kinda slow",
            "author": "edaviestuggy",
            "id": "g9ibke3",
            "parent_id": "t1_g9h56g6",
            "score": 8,
            "created_utc": 1603252183.0,
            "replies": []
        },
        {
            "body": "No way",
            "author": "NoScopeJustMe",
            "id": "g9imcjd",
            "parent_id": "t1_g9h56g6",
            "score": 6,
            "created_utc": 1603260869.0,
            "replies": []
        },
        {
            "body": "Well originally I was going for a Leonardo DiCaprio / Brad Pitt but that was more of a transition style. Once my hair gets much longer I'll try and get it more like professional skater Dylan Rieder 🙏",
            "author": "edaviestuggy",
            "id": "g9idrst",
            "parent_id": "t1_g9hd8tj",
            "score": 5,
            "created_utc": 1603253757.0,
            "replies": []
        },
        {
            "body": "Haha thank you! If you would like to see what it looks like from the front I've got more all down my profile on here 👍",
            "author": "edaviestuggy",
            "id": "g9iek4e",
            "parent_id": "t1_g9icgrh",
            "score": 3,
            "created_utc": 1603254343.0,
            "replies": []
        },
        {
            "body": "... 0 times 😂",
            "author": "edaviestuggy",
            "id": "g9iupgu",
            "parent_id": "t1_g9iuoti",
            "score": 1,
            "created_utc": 1603269577.0,
            "replies": [
                {
                    "body": "LMAO looked trimmed at first look, fair enough",
                    "author": "h-GOAT",
                    "id": "g9iurrh",
                    "parent_id": "t1_g9iupgu",
                    "score": 3,
                    "created_utc": 1603269651.0,
                    "replies": [
                        {
                            "body": "I'm just trying to get all that length first and then I can get it cut to the final style 🙏",
                            "author": "edaviestuggy",
                            "id": "g9iuvge",
                            "parent_id": "t1_g9iurrh",
                            "score": 1,
                            "created_utc": 1603269768.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "There’s absolutely no way you haven’t had a trim lol. The hair at the back would be much longer if that were the case.",
                    "author": "pistachionose",
                    "id": "g9iwe76",
                    "parent_id": "t1_g9iupgu",
                    "score": 1,
                    "created_utc": 1603271528.0,
                    "replies": [
                        {
                            "body": "I genuinely haven't tho, they haven't touched my hair in months. Like I started this during lockdown and after it was lifted, I just kept going",
                            "author": "edaviestuggy",
                            "id": "g9iwh9s",
                            "parent_id": "t1_g9iwe76",
                            "score": 0,
                            "created_utc": 1603271626.0,
                            "replies": [
                                {
                                    "body": "Why does your neck line look so tidy when there should be a mullet developing?",
                                    "author": "pistachionose",
                                    "id": "g9ix8lf",
                                    "parent_id": "t1_g9iwh9s",
                                    "score": 1,
                                    "created_utc": 1603272492.0,
                                    "replies": [
                                        {
                                            "body": "Cause I had a very tight fade from the bottom going up and those hairs just aren't growing as fast",
                                            "author": "edaviestuggy",
                                            "id": "g9iz5vo",
                                            "parent_id": "t1_g9ix8lf",
                                            "score": 1,
                                            "created_utc": 1603274640.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "?? The 5/6 is supposed to be like 5 or 6 months cause I haven't kept track properly 😂",
            "author": "edaviestuggy",
            "id": "g9jbb39",
            "parent_id": "t1_g9jb315",
            "score": 1,
            "created_utc": 1603285047.0,
            "replies": [
                {
                    "body": "I know. I tried to make a joke. Didn't work. AS USUAL BECAUSE I'M NOT FUNNY. FUCK.",
                    "author": null,
                    "id": "g9jbgyz",
                    "parent_id": "t1_g9jbb39",
                    "score": 2,
                    "created_utc": 1603285151.0,
                    "replies": [
                        {
                            "body": "No worries I'm probably just dumb 🙃",
                            "author": "edaviestuggy",
                            "id": "g9jbjh9",
                            "parent_id": "t1_g9jbgyz",
                            "score": 2,
                            "created_utc": 1603285196.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "One without silicone. It's not always logical because you can get an expensive one that has silicone and a cheap one that doesn't, so just be aware.\n\nBasically you need to get one without silicone because only sulphates clean silicone, so if you get silicone conditioner and a sulphate free shampoo then you're building up silicone and your hair will get greasy. Also sulphates are what dries out your hair and damages it so it's all-round bad.\n\nBut to be honest if you are getting conditioner without silicone then you don't need the shampoo, you can just co-wash.",
            "author": "tibetan-sand-fox",
            "id": "g9ih7bl",
            "parent_id": "t1_g9ib3ey",
            "score": 11,
            "created_utc": 1603256391.0,
            "replies": [
                {
                    "body": "I have a follow up question that might be silly. How can I tell if my conditioner is silicone free? It doesn’t have the word silicone anywhere on the label, not on any of the ingredients but it also doesn’t say silicone free anywhere. \n\nIt does say paraben free, are silicones included in that? Google left me a bit confused...",
                    "author": "lupe_the_jedi",
                    "id": "g9k9sei",
                    "parent_id": "t1_g9ih7bl",
                    "score": 1,
                    "created_utc": 1603302710.0,
                    "replies": [
                        {
                            "body": "There is a link somewhere that will let you enter the conditioner and it will check if it has silicone but I don't have the time to find it right now. If I remember then I'll edit and link it. I found it on the curly girl method subreddit. It's immensely important for people with curly hair since their hair is my susceptible to drying out.\n\nEdit: This wasn't the link I used but it does the job. [Here it is.](https://docs.google.com/document/d/1Dlc52yoWdMo4p7RWcVERJS_Lo5NSeDCtV2gWyTBllAw/mobilebasic) It's a link from r/curlyhair and lists products that are green-lit in terms of ingredients. \n\nIf you don't have curly hair, then this is still probably a good routine to follow but if you do have curly hair then this will really help.",
                            "author": "tibetan-sand-fox",
                            "id": "g9m7h1t",
                            "parent_id": "t1_g9k9sei",
                            "score": 1,
                            "created_utc": 1603340089.0,
                            "replies": [
                                {
                                    "body": "Wow thank you!!",
                                    "author": "lupe_the_jedi",
                                    "id": "g9masmt",
                                    "parent_id": "t1_g9m7h1t",
                                    "score": 1,
                                    "created_utc": 1603342641.0,
                                    "replies": [
                                        {
                                            "body": "You might have a better time using [this tool](https://www.curlsbot.com) I also found on r/curlyhair where you just copy/paste the ingredients from the product’s website\n\nEdit: I know it says it’s for curly hair but it’s helpful for checking the ingredients regardless of hair type",
                                            "author": "-JALization-",
                                            "id": "g9mcckd",
                                            "parent_id": "t1_g9masmt",
                                            "score": 1,
                                            "created_utc": 1603343907.0,
                                            "replies": [
                                                {
                                                    "body": "Here's a sneak peek of /r/curlyhair using the [top posts](https://np.reddit.com/r/curlyhair/top/?sort=top&t=year) of the year!\n\n\\#1: [Some child with cancer is about to have a FABULOUS head of curly hair!](https://i.redd.it/ifs38oxbxj051.jpg) | [478 comments](https://np.reddit.com/r/curlyhair/comments/gp93zi/some_child_with_cancer_is_about_to_have_a/)  \n\\#2: [Goodbye for now, Curly Hair Reddit! My hair started falling out due to chemo treatment for lymphoma so I decided to shave it! I'll see you in a few months when it starts growing back, possibly curlier!](https://i.redd.it/0wd9eyp81gb41.jpg) | [688 comments](https://np.reddit.com/r/curlyhair/comments/eqa5j4/goodbye_for_now_curly_hair_reddit_my_hair_started/)  \n\\#3: [3 years of hair growth later (plus some other changes 😉)](https://i.redd.it/od8j7oeak3n41.jpg) | [1506 comments](https://np.reddit.com/r/curlyhair/comments/fjs3g2/3_years_of_hair_growth_later_plus_some_other/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/fpi5i6/blacklist_vii/)",
                                                    "author": "sneakpeekbot",
                                                    "id": "g9mcdi9",
                                                    "parent_id": "t1_g9mcckd",
                                                    "score": 1,
                                                    "created_utc": 1603343929.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Just wanted to drop by to say thank you! Turned out my conditioner did have silicone, so I’ll be making a switch!",
                                                    "author": "lupe_the_jedi",
                                                    "id": "g9so20x",
                                                    "parent_id": "t1_g9mcckd",
                                                    "score": 1,
                                                    "created_utc": 1603485552.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "how can i tell if a conditioner is silicone free?\n\nalso, can you elaborate? what does it mean for sulphates to clean silicone? basicalyl what type of shampoo and conditioner should i get and what ingredients should be in both / not be in both?\n\nmy hair is really greasy right now, do you know why? i condition like 3x a week and shampoo once a week",
                    "author": null,
                    "id": "g9kp99p",
                    "parent_id": "t1_g9ih7bl",
                    "score": 1,
                    "created_utc": 1603310069.0,
                    "replies": [
                        {
                            "body": "Your hair is either greasy because you just changed your routine and it's getting used to it or you are using products, or you're not using the right shampoo/conditioner.\n\nIf the conditioner has silicone and the shampoo is sulphate free, it'll get greasy.",
                            "author": "tibetan-sand-fox",
                            "id": "g9m7lkb",
                            "parent_id": "t1_g9kp99p",
                            "score": 1,
                            "created_utc": 1603340182.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">ecause only sulphates clean silicone\n\nhow would sulphates clean silicon if i'm using a sulphate free shampoo? also are you saying i need a shampoo with sulphate in it?\n\nif shampoo goes before conditioner how would sulphate clean the silicon if the conditioner goes last?",
                    "author": null,
                    "id": "g9kpfq7",
                    "parent_id": "t1_g9ih7bl",
                    "score": 1,
                    "created_utc": 1603310155.0,
                    "replies": [
                        {
                            "body": "No, you want a shampoo without sulphates. Sulphates will dry out your hair. \n\nShampoo goes in and then conditioner becayse the job of the shampoo is the cleanse and reset your hair. So you're washing out the last week's conditioner (if it has silicone) and natural grease and then reapplying conditioner. \n\nBasically silicone is put into some conditioner because it helps smoothen the hair (afaik) but if it's not removed by sulphates it will build up over time. So if your conditioner has silicone you are forced to use sulphate shampoo at some point or another.\n\nI don't use shampoo, I just wash my hair in silicone free conditioner and then reapply the same conditioner. This 100% cleans my hair, which blew my mind at first.",
                            "author": "tibetan-sand-fox",
                            "id": "g9m7vbm",
                            "parent_id": "t1_g9kpfq7",
                            "score": 1,
                            "created_utc": 1603340381.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not OP but a good conditioner is basically anything that doesn’t contain silicones because silicones built up in your hair without the use of sulfates (sulfates are damaging to hair so it’s best to not use either)",
            "author": "-JALization-",
            "id": "g9igb93",
            "parent_id": "t1_g9iekx4",
            "score": 5,
            "created_utc": 1603255682.0,
            "replies": [
                {
                    "body": "i'm confused, so what ingredients SHOULD be in my shampoo or conditioner and what ingredients should not?\n\ni have like super dandruffy greasy ass hair. i use some korean shampoo and conditioner so i don't know what's in it. i shampoo once every two weeks (i forget to do that shit im lazy lol) and condition twice (or thrice/3x) a week. do you know what could cause my hair to be so greasy?\n\nalso i have hard/thick hair, i'm indian/bengali so i have that type of shitty thick dry hair. except it feels greasy.\n\nwhat type of conditioner and shampoo should i buy and what ingredients should it not have?",
                    "author": null,
                    "id": "g9kpqap",
                    "parent_id": "t1_g9igb93",
                    "score": 1,
                    "created_utc": 1603310297.0,
                    "replies": [
                        {
                            "body": "No silicones, no sulfates, you should be mostly fine after that. It’s good that you’re not shampooing too often and instead using only conditioner in between, as excessive shampooing tends to cause hair to get brittle and damaged. A lot of the time greasy hair is the result of over-shampooing but you obviously aren’t doing that, it could also be a transition to using less shampoo since your scalp hasn’t “realized” you aren’t shampooing as often anymore. About the dandruff though I don’t know, in fact I’m currently struggling with it myself, if it’s getting severe you could try visiting a dermatologist. I hope I helped, and remember, no silicones, no sulfates",
                            "author": "-JALization-",
                            "id": "g9mbzbr",
                            "parent_id": "t1_g9kpqap",
                            "score": 1,
                            "created_utc": 1603343608.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "LMAO looked trimmed at first look, fair enough",
            "author": "h-GOAT",
            "id": "g9iurrh",
            "parent_id": "t1_g9iupgu",
            "score": 3,
            "created_utc": 1603269651.0,
            "replies": [
                {
                    "body": "I'm just trying to get all that length first and then I can get it cut to the final style 🙏",
                    "author": "edaviestuggy",
                    "id": "g9iuvge",
                    "parent_id": "t1_g9iurrh",
                    "score": 1,
                    "created_utc": 1603269768.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There’s absolutely no way you haven’t had a trim lol. The hair at the back would be much longer if that were the case.",
            "author": "pistachionose",
            "id": "g9iwe76",
            "parent_id": "t1_g9iupgu",
            "score": 1,
            "created_utc": 1603271528.0,
            "replies": [
                {
                    "body": "I genuinely haven't tho, they haven't touched my hair in months. Like I started this during lockdown and after it was lifted, I just kept going",
                    "author": "edaviestuggy",
                    "id": "g9iwh9s",
                    "parent_id": "t1_g9iwe76",
                    "score": 0,
                    "created_utc": 1603271626.0,
                    "replies": [
                        {
                            "body": "Why does your neck line look so tidy when there should be a mullet developing?",
                            "author": "pistachionose",
                            "id": "g9ix8lf",
                            "parent_id": "t1_g9iwh9s",
                            "score": 1,
                            "created_utc": 1603272492.0,
                            "replies": [
                                {
                                    "body": "Cause I had a very tight fade from the bottom going up and those hairs just aren't growing as fast",
                                    "author": "edaviestuggy",
                                    "id": "g9iz5vo",
                                    "parent_id": "t1_g9ix8lf",
                                    "score": 1,
                                    "created_utc": 1603274640.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I know. I tried to make a joke. Didn't work. AS USUAL BECAUSE I'M NOT FUNNY. FUCK.",
            "author": null,
            "id": "g9jbgyz",
            "parent_id": "t1_g9jbb39",
            "score": 2,
            "created_utc": 1603285151.0,
            "replies": [
                {
                    "body": "No worries I'm probably just dumb 🙃",
                    "author": "edaviestuggy",
                    "id": "g9jbjh9",
                    "parent_id": "t1_g9jbgyz",
                    "score": 2,
                    "created_utc": 1603285196.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have a follow up question that might be silly. How can I tell if my conditioner is silicone free? It doesn’t have the word silicone anywhere on the label, not on any of the ingredients but it also doesn’t say silicone free anywhere. \n\nIt does say paraben free, are silicones included in that? Google left me a bit confused...",
            "author": "lupe_the_jedi",
            "id": "g9k9sei",
            "parent_id": "t1_g9ih7bl",
            "score": 1,
            "created_utc": 1603302710.0,
            "replies": [
                {
                    "body": "There is a link somewhere that will let you enter the conditioner and it will check if it has silicone but I don't have the time to find it right now. If I remember then I'll edit and link it. I found it on the curly girl method subreddit. It's immensely important for people with curly hair since their hair is my susceptible to drying out.\n\nEdit: This wasn't the link I used but it does the job. [Here it is.](https://docs.google.com/document/d/1Dlc52yoWdMo4p7RWcVERJS_Lo5NSeDCtV2gWyTBllAw/mobilebasic) It's a link from r/curlyhair and lists products that are green-lit in terms of ingredients. \n\nIf you don't have curly hair, then this is still probably a good routine to follow but if you do have curly hair then this will really help.",
                    "author": "tibetan-sand-fox",
                    "id": "g9m7h1t",
                    "parent_id": "t1_g9k9sei",
                    "score": 1,
                    "created_utc": 1603340089.0,
                    "replies": [
                        {
                            "body": "Wow thank you!!",
                            "author": "lupe_the_jedi",
                            "id": "g9masmt",
                            "parent_id": "t1_g9m7h1t",
                            "score": 1,
                            "created_utc": 1603342641.0,
                            "replies": [
                                {
                                    "body": "You might have a better time using [this tool](https://www.curlsbot.com) I also found on r/curlyhair where you just copy/paste the ingredients from the product’s website\n\nEdit: I know it says it’s for curly hair but it’s helpful for checking the ingredients regardless of hair type",
                                    "author": "-JALization-",
                                    "id": "g9mcckd",
                                    "parent_id": "t1_g9masmt",
                                    "score": 1,
                                    "created_utc": 1603343907.0,
                                    "replies": [
                                        {
                                            "body": "Here's a sneak peek of /r/curlyhair using the [top posts](https://np.reddit.com/r/curlyhair/top/?sort=top&t=year) of the year!\n\n\\#1: [Some child with cancer is about to have a FABULOUS head of curly hair!](https://i.redd.it/ifs38oxbxj051.jpg) | [478 comments](https://np.reddit.com/r/curlyhair/comments/gp93zi/some_child_with_cancer_is_about_to_have_a/)  \n\\#2: [Goodbye for now, Curly Hair Reddit! My hair started falling out due to chemo treatment for lymphoma so I decided to shave it! I'll see you in a few months when it starts growing back, possibly curlier!](https://i.redd.it/0wd9eyp81gb41.jpg) | [688 comments](https://np.reddit.com/r/curlyhair/comments/eqa5j4/goodbye_for_now_curly_hair_reddit_my_hair_started/)  \n\\#3: [3 years of hair growth later (plus some other changes 😉)](https://i.redd.it/od8j7oeak3n41.jpg) | [1506 comments](https://np.reddit.com/r/curlyhair/comments/fjs3g2/3_years_of_hair_growth_later_plus_some_other/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/fpi5i6/blacklist_vii/)",
                                            "author": "sneakpeekbot",
                                            "id": "g9mcdi9",
                                            "parent_id": "t1_g9mcckd",
                                            "score": 1,
                                            "created_utc": 1603343929.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Just wanted to drop by to say thank you! Turned out my conditioner did have silicone, so I’ll be making a switch!",
                                            "author": "lupe_the_jedi",
                                            "id": "g9so20x",
                                            "parent_id": "t1_g9mcckd",
                                            "score": 1,
                                            "created_utc": 1603485552.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "how can i tell if a conditioner is silicone free?\n\nalso, can you elaborate? what does it mean for sulphates to clean silicone? basicalyl what type of shampoo and conditioner should i get and what ingredients should be in both / not be in both?\n\nmy hair is really greasy right now, do you know why? i condition like 3x a week and shampoo once a week",
            "author": null,
            "id": "g9kp99p",
            "parent_id": "t1_g9ih7bl",
            "score": 1,
            "created_utc": 1603310069.0,
            "replies": [
                {
                    "body": "Your hair is either greasy because you just changed your routine and it's getting used to it or you are using products, or you're not using the right shampoo/conditioner.\n\nIf the conditioner has silicone and the shampoo is sulphate free, it'll get greasy.",
                    "author": "tibetan-sand-fox",
                    "id": "g9m7lkb",
                    "parent_id": "t1_g9kp99p",
                    "score": 1,
                    "created_utc": 1603340182.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">ecause only sulphates clean silicone\n\nhow would sulphates clean silicon if i'm using a sulphate free shampoo? also are you saying i need a shampoo with sulphate in it?\n\nif shampoo goes before conditioner how would sulphate clean the silicon if the conditioner goes last?",
            "author": null,
            "id": "g9kpfq7",
            "parent_id": "t1_g9ih7bl",
            "score": 1,
            "created_utc": 1603310155.0,
            "replies": [
                {
                    "body": "No, you want a shampoo without sulphates. Sulphates will dry out your hair. \n\nShampoo goes in and then conditioner becayse the job of the shampoo is the cleanse and reset your hair. So you're washing out the last week's conditioner (if it has silicone) and natural grease and then reapplying conditioner. \n\nBasically silicone is put into some conditioner because it helps smoothen the hair (afaik) but if it's not removed by sulphates it will build up over time. So if your conditioner has silicone you are forced to use sulphate shampoo at some point or another.\n\nI don't use shampoo, I just wash my hair in silicone free conditioner and then reapply the same conditioner. This 100% cleans my hair, which blew my mind at first.",
                    "author": "tibetan-sand-fox",
                    "id": "g9m7vbm",
                    "parent_id": "t1_g9kpfq7",
                    "score": 1,
                    "created_utc": 1603340381.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "i'm confused, so what ingredients SHOULD be in my shampoo or conditioner and what ingredients should not?\n\ni have like super dandruffy greasy ass hair. i use some korean shampoo and conditioner so i don't know what's in it. i shampoo once every two weeks (i forget to do that shit im lazy lol) and condition twice (or thrice/3x) a week. do you know what could cause my hair to be so greasy?\n\nalso i have hard/thick hair, i'm indian/bengali so i have that type of shitty thick dry hair. except it feels greasy.\n\nwhat type of conditioner and shampoo should i buy and what ingredients should it not have?",
            "author": null,
            "id": "g9kpqap",
            "parent_id": "t1_g9igb93",
            "score": 1,
            "created_utc": 1603310297.0,
            "replies": [
                {
                    "body": "No silicones, no sulfates, you should be mostly fine after that. It’s good that you’re not shampooing too often and instead using only conditioner in between, as excessive shampooing tends to cause hair to get brittle and damaged. A lot of the time greasy hair is the result of over-shampooing but you obviously aren’t doing that, it could also be a transition to using less shampoo since your scalp hasn’t “realized” you aren’t shampooing as often anymore. About the dandruff though I don’t know, in fact I’m currently struggling with it myself, if it’s getting severe you could try visiting a dermatologist. I hope I helped, and remember, no silicones, no sulfates",
                    "author": "-JALization-",
                    "id": "g9mbzbr",
                    "parent_id": "t1_g9kpqap",
                    "score": 1,
                    "created_utc": 1603343608.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm just trying to get all that length first and then I can get it cut to the final style 🙏",
            "author": "edaviestuggy",
            "id": "g9iuvge",
            "parent_id": "t1_g9iurrh",
            "score": 1,
            "created_utc": 1603269768.0,
            "replies": []
        },
        {
            "body": "I genuinely haven't tho, they haven't touched my hair in months. Like I started this during lockdown and after it was lifted, I just kept going",
            "author": "edaviestuggy",
            "id": "g9iwh9s",
            "parent_id": "t1_g9iwe76",
            "score": 0,
            "created_utc": 1603271626.0,
            "replies": [
                {
                    "body": "Why does your neck line look so tidy when there should be a mullet developing?",
                    "author": "pistachionose",
                    "id": "g9ix8lf",
                    "parent_id": "t1_g9iwh9s",
                    "score": 1,
                    "created_utc": 1603272492.0,
                    "replies": [
                        {
                            "body": "Cause I had a very tight fade from the bottom going up and those hairs just aren't growing as fast",
                            "author": "edaviestuggy",
                            "id": "g9iz5vo",
                            "parent_id": "t1_g9ix8lf",
                            "score": 1,
                            "created_utc": 1603274640.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No worries I'm probably just dumb 🙃",
            "author": "edaviestuggy",
            "id": "g9jbjh9",
            "parent_id": "t1_g9jbgyz",
            "score": 2,
            "created_utc": 1603285196.0,
            "replies": []
        },
        {
            "body": "There is a link somewhere that will let you enter the conditioner and it will check if it has silicone but I don't have the time to find it right now. If I remember then I'll edit and link it. I found it on the curly girl method subreddit. It's immensely important for people with curly hair since their hair is my susceptible to drying out.\n\nEdit: This wasn't the link I used but it does the job. [Here it is.](https://docs.google.com/document/d/1Dlc52yoWdMo4p7RWcVERJS_Lo5NSeDCtV2gWyTBllAw/mobilebasic) It's a link from r/curlyhair and lists products that are green-lit in terms of ingredients. \n\nIf you don't have curly hair, then this is still probably a good routine to follow but if you do have curly hair then this will really help.",
            "author": "tibetan-sand-fox",
            "id": "g9m7h1t",
            "parent_id": "t1_g9k9sei",
            "score": 1,
            "created_utc": 1603340089.0,
            "replies": [
                {
                    "body": "Wow thank you!!",
                    "author": "lupe_the_jedi",
                    "id": "g9masmt",
                    "parent_id": "t1_g9m7h1t",
                    "score": 1,
                    "created_utc": 1603342641.0,
                    "replies": [
                        {
                            "body": "You might have a better time using [this tool](https://www.curlsbot.com) I also found on r/curlyhair where you just copy/paste the ingredients from the product’s website\n\nEdit: I know it says it’s for curly hair but it’s helpful for checking the ingredients regardless of hair type",
                            "author": "-JALization-",
                            "id": "g9mcckd",
                            "parent_id": "t1_g9masmt",
                            "score": 1,
                            "created_utc": 1603343907.0,
                            "replies": [
                                {
                                    "body": "Here's a sneak peek of /r/curlyhair using the [top posts](https://np.reddit.com/r/curlyhair/top/?sort=top&t=year) of the year!\n\n\\#1: [Some child with cancer is about to have a FABULOUS head of curly hair!](https://i.redd.it/ifs38oxbxj051.jpg) | [478 comments](https://np.reddit.com/r/curlyhair/comments/gp93zi/some_child_with_cancer_is_about_to_have_a/)  \n\\#2: [Goodbye for now, Curly Hair Reddit! My hair started falling out due to chemo treatment for lymphoma so I decided to shave it! I'll see you in a few months when it starts growing back, possibly curlier!](https://i.redd.it/0wd9eyp81gb41.jpg) | [688 comments](https://np.reddit.com/r/curlyhair/comments/eqa5j4/goodbye_for_now_curly_hair_reddit_my_hair_started/)  \n\\#3: [3 years of hair growth later (plus some other changes 😉)](https://i.redd.it/od8j7oeak3n41.jpg) | [1506 comments](https://np.reddit.com/r/curlyhair/comments/fjs3g2/3_years_of_hair_growth_later_plus_some_other/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/fpi5i6/blacklist_vii/)",
                                    "author": "sneakpeekbot",
                                    "id": "g9mcdi9",
                                    "parent_id": "t1_g9mcckd",
                                    "score": 1,
                                    "created_utc": 1603343929.0,
                                    "replies": []
                                },
                                {
                                    "body": "Just wanted to drop by to say thank you! Turned out my conditioner did have silicone, so I’ll be making a switch!",
                                    "author": "lupe_the_jedi",
                                    "id": "g9so20x",
                                    "parent_id": "t1_g9mcckd",
                                    "score": 1,
                                    "created_utc": 1603485552.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Your hair is either greasy because you just changed your routine and it's getting used to it or you are using products, or you're not using the right shampoo/conditioner.\n\nIf the conditioner has silicone and the shampoo is sulphate free, it'll get greasy.",
            "author": "tibetan-sand-fox",
            "id": "g9m7lkb",
            "parent_id": "t1_g9kp99p",
            "score": 1,
            "created_utc": 1603340182.0,
            "replies": []
        },
        {
            "body": "No, you want a shampoo without sulphates. Sulphates will dry out your hair. \n\nShampoo goes in and then conditioner becayse the job of the shampoo is the cleanse and reset your hair. So you're washing out the last week's conditioner (if it has silicone) and natural grease and then reapplying conditioner. \n\nBasically silicone is put into some conditioner because it helps smoothen the hair (afaik) but if it's not removed by sulphates it will build up over time. So if your conditioner has silicone you are forced to use sulphate shampoo at some point or another.\n\nI don't use shampoo, I just wash my hair in silicone free conditioner and then reapply the same conditioner. This 100% cleans my hair, which blew my mind at first.",
            "author": "tibetan-sand-fox",
            "id": "g9m7vbm",
            "parent_id": "t1_g9kpfq7",
            "score": 1,
            "created_utc": 1603340381.0,
            "replies": []
        },
        {
            "body": "No silicones, no sulfates, you should be mostly fine after that. It’s good that you’re not shampooing too often and instead using only conditioner in between, as excessive shampooing tends to cause hair to get brittle and damaged. A lot of the time greasy hair is the result of over-shampooing but you obviously aren’t doing that, it could also be a transition to using less shampoo since your scalp hasn’t “realized” you aren’t shampooing as often anymore. About the dandruff though I don’t know, in fact I’m currently struggling with it myself, if it’s getting severe you could try visiting a dermatologist. I hope I helped, and remember, no silicones, no sulfates",
            "author": "-JALization-",
            "id": "g9mbzbr",
            "parent_id": "t1_g9kpqap",
            "score": 1,
            "created_utc": 1603343608.0,
            "replies": []
        },
        {
            "body": "Why does your neck line look so tidy when there should be a mullet developing?",
            "author": "pistachionose",
            "id": "g9ix8lf",
            "parent_id": "t1_g9iwh9s",
            "score": 1,
            "created_utc": 1603272492.0,
            "replies": [
                {
                    "body": "Cause I had a very tight fade from the bottom going up and those hairs just aren't growing as fast",
                    "author": "edaviestuggy",
                    "id": "g9iz5vo",
                    "parent_id": "t1_g9ix8lf",
                    "score": 1,
                    "created_utc": 1603274640.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow thank you!!",
            "author": "lupe_the_jedi",
            "id": "g9masmt",
            "parent_id": "t1_g9m7h1t",
            "score": 1,
            "created_utc": 1603342641.0,
            "replies": [
                {
                    "body": "You might have a better time using [this tool](https://www.curlsbot.com) I also found on r/curlyhair where you just copy/paste the ingredients from the product’s website\n\nEdit: I know it says it’s for curly hair but it’s helpful for checking the ingredients regardless of hair type",
                    "author": "-JALization-",
                    "id": "g9mcckd",
                    "parent_id": "t1_g9masmt",
                    "score": 1,
                    "created_utc": 1603343907.0,
                    "replies": [
                        {
                            "body": "Here's a sneak peek of /r/curlyhair using the [top posts](https://np.reddit.com/r/curlyhair/top/?sort=top&t=year) of the year!\n\n\\#1: [Some child with cancer is about to have a FABULOUS head of curly hair!](https://i.redd.it/ifs38oxbxj051.jpg) | [478 comments](https://np.reddit.com/r/curlyhair/comments/gp93zi/some_child_with_cancer_is_about_to_have_a/)  \n\\#2: [Goodbye for now, Curly Hair Reddit! My hair started falling out due to chemo treatment for lymphoma so I decided to shave it! I'll see you in a few months when it starts growing back, possibly curlier!](https://i.redd.it/0wd9eyp81gb41.jpg) | [688 comments](https://np.reddit.com/r/curlyhair/comments/eqa5j4/goodbye_for_now_curly_hair_reddit_my_hair_started/)  \n\\#3: [3 years of hair growth later (plus some other changes 😉)](https://i.redd.it/od8j7oeak3n41.jpg) | [1506 comments](https://np.reddit.com/r/curlyhair/comments/fjs3g2/3_years_of_hair_growth_later_plus_some_other/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/fpi5i6/blacklist_vii/)",
                            "author": "sneakpeekbot",
                            "id": "g9mcdi9",
                            "parent_id": "t1_g9mcckd",
                            "score": 1,
                            "created_utc": 1603343929.0,
                            "replies": []
                        },
                        {
                            "body": "Just wanted to drop by to say thank you! Turned out my conditioner did have silicone, so I’ll be making a switch!",
                            "author": "lupe_the_jedi",
                            "id": "g9so20x",
                            "parent_id": "t1_g9mcckd",
                            "score": 1,
                            "created_utc": 1603485552.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Cause I had a very tight fade from the bottom going up and those hairs just aren't growing as fast",
            "author": "edaviestuggy",
            "id": "g9iz5vo",
            "parent_id": "t1_g9ix8lf",
            "score": 1,
            "created_utc": 1603274640.0,
            "replies": []
        },
        {
            "body": "You might have a better time using [this tool](https://www.curlsbot.com) I also found on r/curlyhair where you just copy/paste the ingredients from the product’s website\n\nEdit: I know it says it’s for curly hair but it’s helpful for checking the ingredients regardless of hair type",
            "author": "-JALization-",
            "id": "g9mcckd",
            "parent_id": "t1_g9masmt",
            "score": 1,
            "created_utc": 1603343907.0,
            "replies": [
                {
                    "body": "Here's a sneak peek of /r/curlyhair using the [top posts](https://np.reddit.com/r/curlyhair/top/?sort=top&t=year) of the year!\n\n\\#1: [Some child with cancer is about to have a FABULOUS head of curly hair!](https://i.redd.it/ifs38oxbxj051.jpg) | [478 comments](https://np.reddit.com/r/curlyhair/comments/gp93zi/some_child_with_cancer_is_about_to_have_a/)  \n\\#2: [Goodbye for now, Curly Hair Reddit! My hair started falling out due to chemo treatment for lymphoma so I decided to shave it! I'll see you in a few months when it starts growing back, possibly curlier!](https://i.redd.it/0wd9eyp81gb41.jpg) | [688 comments](https://np.reddit.com/r/curlyhair/comments/eqa5j4/goodbye_for_now_curly_hair_reddit_my_hair_started/)  \n\\#3: [3 years of hair growth later (plus some other changes 😉)](https://i.redd.it/od8j7oeak3n41.jpg) | [1506 comments](https://np.reddit.com/r/curlyhair/comments/fjs3g2/3_years_of_hair_growth_later_plus_some_other/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/fpi5i6/blacklist_vii/)",
                    "author": "sneakpeekbot",
                    "id": "g9mcdi9",
                    "parent_id": "t1_g9mcckd",
                    "score": 1,
                    "created_utc": 1603343929.0,
                    "replies": []
                },
                {
                    "body": "Just wanted to drop by to say thank you! Turned out my conditioner did have silicone, so I’ll be making a switch!",
                    "author": "lupe_the_jedi",
                    "id": "g9so20x",
                    "parent_id": "t1_g9mcckd",
                    "score": 1,
                    "created_utc": 1603485552.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Here's a sneak peek of /r/curlyhair using the [top posts](https://np.reddit.com/r/curlyhair/top/?sort=top&t=year) of the year!\n\n\\#1: [Some child with cancer is about to have a FABULOUS head of curly hair!](https://i.redd.it/ifs38oxbxj051.jpg) | [478 comments](https://np.reddit.com/r/curlyhair/comments/gp93zi/some_child_with_cancer_is_about_to_have_a/)  \n\\#2: [Goodbye for now, Curly Hair Reddit! My hair started falling out due to chemo treatment for lymphoma so I decided to shave it! I'll see you in a few months when it starts growing back, possibly curlier!](https://i.redd.it/0wd9eyp81gb41.jpg) | [688 comments](https://np.reddit.com/r/curlyhair/comments/eqa5j4/goodbye_for_now_curly_hair_reddit_my_hair_started/)  \n\\#3: [3 years of hair growth later (plus some other changes 😉)](https://i.redd.it/od8j7oeak3n41.jpg) | [1506 comments](https://np.reddit.com/r/curlyhair/comments/fjs3g2/3_years_of_hair_growth_later_plus_some_other/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/fpi5i6/blacklist_vii/)",
            "author": "sneakpeekbot",
            "id": "g9mcdi9",
            "parent_id": "t1_g9mcckd",
            "score": 1,
            "created_utc": 1603343929.0,
            "replies": []
        },
        {
            "body": "Just wanted to drop by to say thank you! Turned out my conditioner did have silicone, so I’ll be making a switch!",
            "author": "lupe_the_jedi",
            "id": "g9so20x",
            "parent_id": "t1_g9mcckd",
            "score": 1,
            "created_utc": 1603485552.0,
            "replies": []
        }
    ]
}