{
    "title": "I wish someone could warn him at least",
    "post_id": "x53w53",
    "post_url": "https://www.reddit.com/r/dankruto/comments/x53w53/i_wish_someone_could_warn_him_at_least/",
    "author": "V4POR97",
    "body": "",
    "url": "https://i.redd.it/3yw3v7xjdpl91.jpg",
    "score": 3611,
    "upvote_ratio": 0.97,
    "created_utc": 1662236685.0,
    "num_comments": 75,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I miss dosu fr",
            "author": "Garutoku",
            "id": "imz7e1s",
            "parent_id": "t3_x53w53",
            "score": 163,
            "created_utc": 1662240915.0,
            "replies": [
                {
                    "body": "Me too. Dosu, Orochimaru and Gaara were something special, they were such unsettling characters back then at the Chuunin exams.",
                    "author": "V4POR97",
                    "id": "imz7w6z",
                    "parent_id": "t1_imz7e1s",
                    "score": 116,
                    "created_utc": 1662241134.0,
                    "replies": []
                },
                {
                    "body": "I miss zaku too tbh",
                    "author": "sw2bh",
                    "id": "in1ouhn",
                    "parent_id": "t1_imz7e1s",
                    "score": 17,
                    "created_utc": 1662294642.0,
                    "replies": [
                        {
                            "body": "Yeah I felt the entire team had potential that got wasted. Dodu crushed, and the other two used as sacrifices to reincarnate the first two Hokage.",
                            "author": "ElderDark",
                            "id": "in1veku",
                            "parent_id": "t1_in1ouhn",
                            "score": 14,
                            "created_utc": 1662298111.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No he doesn’t. If he didn’t die here Orochimaru would have used him for his reanimation jutsu, just look at his other two teammates who had that exact fate.",
            "author": null,
            "id": "imz02rc",
            "parent_id": "t3_x53w53",
            "score": 285,
            "created_utc": 1662237794.0,
            "replies": [
                {
                    "body": "Dosu was way smarter than his teammates. He already realized that he is just a tool for Orochimaru to test Sasuke's Curse Mark. \nI don't think they could just get him that easily, he saw through Orochimaru's plans.",
                    "author": "V4POR97",
                    "id": "imz1m9l",
                    "parent_id": "t1_imz02rc",
                    "score": 181,
                    "created_utc": 1662238451.0,
                    "replies": [
                        {
                            "body": "Also, sacrificing his own genin team doesn't make sense, they were somewhat valuable. He could've just used some of his prisoners.",
                            "author": "V4POR97",
                            "id": "imz1wfh",
                            "parent_id": "t1_imz1m9l",
                            "score": 80,
                            "created_utc": 1662238570.0,
                            "replies": [
                                {
                                    "body": "What do you mean? He did sacrifice them. Watch the 3rd hokage vs orochimaru fight. It reveals their faces/bodies after the third hokage seals the 1st and 2nd hokages spirits during the fight",
                                    "author": null,
                                    "id": "imz2d6u",
                                    "parent_id": "t1_imz1wfh",
                                    "score": 49,
                                    "created_utc": 1662238765.0,
                                    "replies": [
                                        {
                                            "body": "I saw that fight and I know he sacrificed them, but I wanted to point out that he had a group of prisoners to sacrifice, instead of them who were literally kids.",
                                            "author": "V4POR97",
                                            "id": "imz3sbs",
                                            "parent_id": "t1_imz2d6u",
                                            "score": 32,
                                            "created_utc": 1662239355.0,
                                            "replies": [
                                                {
                                                    "body": "Orochimaru doesn’t care if someone is a child, he will still use them and or sacrifice them. Even if they are useful, he still will. He tried to murder naruto, who arguably is the most useful of all the children in the entire series, since he’s a jinchuriki",
                                                    "author": null,
                                                    "id": "imz42hv",
                                                    "parent_id": "t1_imz3sbs",
                                                    "score": 34,
                                                    "created_utc": 1662239476.0,
                                                    "replies": [
                                                        {
                                                            "body": "Then what was the point of taking Zaku from the streets and promise that if Zaku will join him, he could get power? He even took the time to modify Zaku's arms.\nI mean, he could easily find other people to sacrifice, other than investing effort to a kid just to be a dummy for Edo-tensei.",
                                                            "author": "V4POR97",
                                                            "id": "imz4rq6",
                                                            "parent_id": "t1_imz42hv",
                                                            "score": -5,
                                                            "created_utc": 1662239779.0,
                                                            "replies": [
                                                                {
                                                                    "body": "To use him, then when he is no longer relevant, sacrifice him. Which is exactly what he did.",
                                                                    "author": null,
                                                                    "id": "imz53br",
                                                                    "parent_id": "t1_imz4rq6",
                                                                    "score": 36,
                                                                    "created_utc": 1662239917.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Okay, I admit that you have valid points. The problem is that these 3 ninjas (especially Dosu and Zaku) could have been decent characters, because their jutsu was unique, and Dosu actually had talent and high intelligence. And they were far more memorable than the other characters Kishimito gave the \"fodder\" faith to. For example the Demon Brothers, the other 2 ninjas from Kabuto's team and Team Shigure weren't memorable, their jutsu just wasn't that special (unlike Dosu's Echo Drill).\nI know that Kishimoto created them to be fodder, but he just made them too memorable. Especially Dosu. \nAnd I'm not the only one who would want to see him continue his plot.",
                                                                            "author": "V4POR97",
                                                                            "id": "imz7gm3",
                                                                            "parent_id": "t1_imz53br",
                                                                            "score": 14,
                                                                            "created_utc": 1662240945.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Oh yeah definitely, they were extremely unique. I wish they had more screen time, I’m just pointing out the sociopathic tendencies of Orochimaru and also the fate a lot of supporting characters have in anime.",
                                                                                    "author": null,
                                                                                    "id": "imzdn3f",
                                                                                    "parent_id": "t1_imz7gm3",
                                                                                    "score": 11,
                                                                                    "created_utc": 1662243640.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "He used them because they had served their purpose, was injured and no one from the leaf would search for them if they disappeared and they were closer than his prisoners.",
                                    "author": "WillSmisk",
                                    "id": "imzg6iz",
                                    "parent_id": "t1_imz1wfh",
                                    "score": 8,
                                    "created_utc": 1662244786.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "So smart that he charged at gaara without knowing much about him.",
                            "author": "1_dont_care",
                            "id": "in3841a",
                            "parent_id": "t1_imz1m9l",
                            "score": 3,
                            "created_utc": 1662317880.0,
                            "replies": []
                        },
                        {
                            "body": "Smarter than his teammates, but still not on Orochimaru’s level. If Orochimaru wants to use Dosu for whatever he wants, he will. Dosu can’t stand up to Orochimaru",
                            "author": "whalemix",
                            "id": "in2qha3",
                            "parent_id": "t1_imz1m9l",
                            "score": 1,
                            "created_utc": 1662310812.0,
                            "replies": [
                                {
                                    "body": "tbf, he easily could've asked Konoha for asylum",
                                    "author": "BobbyYukitsuki",
                                    "id": "in2w5pb",
                                    "parent_id": "t1_in2qha3",
                                    "score": 2,
                                    "created_utc": 1662313002.0,
                                    "replies": [
                                        {
                                            "body": "He could’ve, but I doubt he would. He’s a sound ninja, they’re arrogant and hate the Leaf. I think even faced with death, Dosu wouldn’t have begged Konoha for help",
                                            "author": "whalemix",
                                            "id": "in4108d",
                                            "parent_id": "t1_in2w5pb",
                                            "score": 1,
                                            "created_utc": 1662330307.0,
                                            "replies": [
                                                {
                                                    "body": "That's a good point actually, though I think the possibility isn't completely out of the question in part because a: he was able to recognize that Sasuke was more than he could handle and swallowed his pride in the forest, and b: it felt like much of the Sound Village's arrogance stemmed from their loyalty to Orochimaru, which Dosu had discarded.\n\nIf anything it would make for an interesting development seeing him ponder over it",
                                                    "author": "BobbyYukitsuki",
                                                    "id": "in4a0nq",
                                                    "parent_id": "t1_in4108d",
                                                    "score": 1,
                                                    "created_utc": 1662334580.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Dosu most likely was used to reanimate Minato but we all saw how that turned out.",
                    "author": "jkid3000",
                    "id": "in2cdsy",
                    "parent_id": "t1_imz02rc",
                    "score": 4,
                    "created_utc": 1662305293.0,
                    "replies": [
                        {
                            "body": "But they couldn't use Dosu for that, because he died after he was facing Gaara.",
                            "author": "V4POR97",
                            "id": "in3g2e7",
                            "parent_id": "t1_in2cdsy",
                            "score": 3,
                            "created_utc": 1662321249.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "There's nothing to say he would've easily gone along with it.\n\nEven if he was doomed to die he could've gone out in a better way. If he actively tried to run away or rebel against Orochimaru only for him to hunt him down and toy with him before offing him, it would've amped up Oro's fear factor while simultaneously showing us what Oro does when his people try to cut their ties with him—which would also enhance a later core element of the show as it demonstrates that Sasuke's later decision to join up with Orochimaru is a permanent commitment (at least, until Shippuden when he overpowers him). This would've let Dosu go out with a bang hopefully looking less like a chump, rather than being killed for a plot point which is literally never mentioned again (the full moon thing).",
                    "author": "BobbyYukitsuki",
                    "id": "in2wn1f",
                    "parent_id": "t1_imz02rc",
                    "score": 4,
                    "created_utc": 1662313195.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“Wow! Sound based Ninjustu and Genjitsu is really cool! I can’t wait to see what they do with it!”",
            "author": "MirrahPaladin",
            "id": "imz8ho3",
            "parent_id": "t3_x53w53",
            "score": 108,
            "created_utc": 1662241392.0,
            "replies": [
                {
                    "body": "Right? I think Kishimoto realized that he made it too OP upon introduction, then was like, “well, can’t ever use this again.”",
                    "author": "XishengTheUltimate",
                    "id": "imzh30a",
                    "parent_id": "t1_imz8ho3",
                    "score": 39,
                    "created_utc": 1662245191.0,
                    "replies": [
                        {
                            "body": "I thought he kinda solved it during the Sauske retrieval arc when Temari used Wind Style to blow it back? It’s a shame it wasn’t used more since it had really good potential and seems like it would’ve been a good counter to the Sharingan",
                            "author": "SeductivePillowcase",
                            "id": "imzwwtj",
                            "parent_id": "t1_imzh30a",
                            "score": 19,
                            "created_utc": 1662252640.0,
                            "replies": [
                                {
                                    "body": "God that was such a good fight. Shikamaru vs Tayuya is easily top 10 material for pre-Shippuden.",
                                    "author": "LaughingGaster666",
                                    "id": "in0b79a",
                                    "parent_id": "t1_imzwwtj",
                                    "score": 14,
                                    "created_utc": 1662259565.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "That's what happened with Kotoamatsukami but way worse which is why it never got used in any meaningful way.\n\nHad Shisui used his brain though, he wouldn't have needed to try to brainwash the entire clan.",
                            "author": "SmallerBork",
                            "id": "in0ok34",
                            "parent_id": "t1_imzh30a",
                            "score": 6,
                            "created_utc": 1662267178.0,
                            "replies": []
                        },
                        {
                            "body": "It was clearly supposed to be a counter to sharingan  (see obitos noise cancel headphones). They wouldn't have shippuden if these guys survived part 1",
                            "author": "waster1993",
                            "id": "in385wx",
                            "parent_id": "t1_imzh30a",
                            "score": 1,
                            "created_utc": 1662317902.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "YES thank you! Once the prelims ended he realized Orochimaru didn't care for him. Dosu def would've ditched him, it would be cool to see a plotline for him.",
            "author": "Fourth_Sin",
            "id": "imzh9pu",
            "parent_id": "t3_x53w53",
            "score": 19,
            "created_utc": 1662245276.0,
            "replies": []
        },
        {
            "body": "Atleast he wasn't the dude with bootyholes on his hands 💀💀💀\n\nThat mf deadass had the ability to fart from his hands",
            "author": "Sussy_Dora",
            "id": "imyxvn2",
            "parent_id": "t3_x53w53",
            "score": 99,
            "created_utc": 1662236892.0,
            "replies": [
                {
                    "body": "Tf is wrong with you?😂😂",
                    "author": "V4POR97",
                    "id": "imyy10j",
                    "parent_id": "t1_imyxvn2",
                    "score": 66,
                    "created_utc": 1662236953.0,
                    "replies": [
                        {
                            "body": "Bros drunk 😭",
                            "author": "hsg4mer1",
                            "id": "imz3blb",
                            "parent_id": "t1_imyy10j",
                            "score": 28,
                            "created_utc": 1662239160.0,
                            "replies": []
                        },
                        {
                            "body": "It all started when he picked his username",
                            "author": "SmallerBork",
                            "id": "in0ocq4",
                            "parent_id": "t1_imyy10j",
                            "score": 8,
                            "created_utc": 1662267043.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly though Dosu deserved better man, like he was such a cool design and the sound related ninijutsu were so cool, really unfortunate how wasted litteraly everyone from the sound village was",
            "author": "Practical_Door_1934",
            "id": "imzxbhu",
            "parent_id": "t3_x53w53",
            "score": 15,
            "created_utc": 1662252835.0,
            "replies": []
        },
        {
            "body": "Dosu was like 30 years old and still a genin lmao",
            "author": "Garutoku",
            "id": "imzbdui",
            "parent_id": "t3_x53w53",
            "score": 39,
            "created_utc": 1662242655.0,
            "replies": [
                {
                    "body": "He was 14 yo actually, but yeah he looked older than that.",
                    "author": "V4POR97",
                    "id": "imzc18w",
                    "parent_id": "t1_imzbdui",
                    "score": 57,
                    "created_utc": 1662242940.0,
                    "replies": [
                        {
                            "body": "He also has the voice of a 40 year old smoker",
                            "author": "Garutoku",
                            "id": "imzfkwh",
                            "parent_id": "t1_imzc18w",
                            "score": 40,
                            "created_utc": 1662244512.0,
                            "replies": [
                                {
                                    "body": "English dubs in the 2000's be like",
                                    "author": "yenjhin",
                                    "id": "in10hva",
                                    "parent_id": "t1_imzfkwh",
                                    "score": 9,
                                    "created_utc": 1662275881.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "The day that I learned that Dosu and his team, and the Sound 4, were only teenagers threw me for a loop.",
                            "author": "Proto-Omega",
                            "id": "imzr3ck",
                            "parent_id": "t1_imzc18w",
                            "score": 16,
                            "created_utc": 1662249861.0,
                            "replies": [
                                {
                                    "body": "Right? The sound four even called Sasuke “kid”. Imo they should’ve been shown to be like 18-20 years old.",
                                    "author": "Neat_Biscotti8950",
                                    "id": "in1fo5f",
                                    "parent_id": "t1_imzr3ck",
                                    "score": 2,
                                    "created_utc": 1662288461.0,
                                    "replies": [
                                        {
                                            "body": "The average life of a ninja outside of the Leaf is probably like 16 or so.",
                                            "author": "DisneyPrincessDVorah",
                                            "id": "in1vq9j",
                                            "parent_id": "t1_in1fo5f",
                                            "score": 2,
                                            "created_utc": 1662298268.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dosu wouldve probably killed you lol",
            "author": "Corniferus",
            "id": "imz98ya",
            "parent_id": "t3_x53w53",
            "score": 17,
            "created_utc": 1662241716.0,
            "replies": []
        },
        {
            "body": "I would’ve stopped Jiraiya from going to the rain",
            "author": "QuaBotPrime",
            "id": "in04nqk",
            "parent_id": "t3_x53w53",
            "score": 7,
            "created_utc": 1662256352.0,
            "replies": [
                {
                    "body": "Could have just let Orochimaru kill the kids in Rain and a lot more things would have been fixed.",
                    "author": "DisneyPrincessDVorah",
                    "id": "in1vvji",
                    "parent_id": "t1_in04nqk",
                    "score": 2,
                    "created_utc": 1662298338.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dosu would have been a great anti-hero in Ship.",
            "author": "smithdamien310",
            "id": "in0p8m2",
            "parent_id": "t3_x53w53",
            "score": 5,
            "created_utc": 1662267627.0,
            "replies": [
                {
                    "body": "Definitely. There is a possibility that he would became a rogue ninja, and the Akatsuki could recruit him, for exhcange he can avenge Orochimaru, the guy who betrayed both Akatsuki and Dosu.",
                    "author": "V4POR97",
                    "id": "in5pkxv",
                    "parent_id": "t1_in0p8m2",
                    "score": 1,
                    "created_utc": 1662362829.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Me a girl: *why are we here just to suffer..*",
            "author": "some_SUS-BXLLa-",
            "id": "in0vhie",
            "parent_id": "t3_x53w53",
            "score": 5,
            "created_utc": 1662272008.0,
            "replies": []
        },
        {
            "body": "Dosu was just a one off villain, why are people so passionate about him when he’s basically the same as the Sound 5",
            "author": "D3ATHSTR0KE_",
            "id": "imzj9nk",
            "parent_id": "t3_x53w53",
            "score": 15,
            "created_utc": 1662246184.0,
            "replies": [
                {
                    "body": "because a villainous minion prioritizing their self-preservation over blindly sacrificing themself for their master makes for interesting power shifts in the story and could've theoretically made said villain's plans go in a vastly different direction",
                    "author": "BobbyYukitsuki",
                    "id": "in2x0rp",
                    "parent_id": "t1_imzj9nk",
                    "score": 8,
                    "created_utc": 1662313345.0,
                    "replies": []
                },
                {
                    "body": "Because the sound 5 is definitely missed potential, they were truly interesting",
                    "author": "WillSmisk",
                    "id": "imzm473",
                    "parent_id": "t1_imzj9nk",
                    "score": 9,
                    "created_utc": 1662247504.0,
                    "replies": [
                        {
                            "body": "I just feel like it’s way more important for characters like Neji and Rock Lee to have screentime but then again that still doesn’t mean there was wasted potential with some of the smaller villains",
                            "author": "D3ATHSTR0KE_",
                            "id": "imzm870",
                            "parent_id": "t1_imzm473",
                            "score": -1,
                            "created_utc": 1662247556.0,
                            "replies": [
                                {
                                    "body": "Those two are definitely bigger priorities, just sad to see the world building and characters not fleshed out more",
                                    "author": "WillSmisk",
                                    "id": "imzon67",
                                    "parent_id": "t1_imzm870",
                                    "score": 5,
                                    "created_utc": 1662248701.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Orochimaru actually having a real village would have been awesome, the pawn thing was ok, seeing dosu take on everyone else would be have been kool",
            "author": "Acceptable-Bad8416",
            "id": "in0jx6m",
            "parent_id": "t3_x53w53",
            "score": 3,
            "created_utc": 1662264304.0,
            "replies": []
        },
        {
            "body": "Yes",
            "author": "theamazingspiderstan",
            "id": "imzjzs2",
            "parent_id": "t3_x53w53",
            "score": 2,
            "created_utc": 1662246516.0,
            "replies": []
        },
        {
            "body": "This is what I basically feel except it's for Tayuya",
            "author": "raver1601",
            "id": "in34mzd",
            "parent_id": "t3_x53w53",
            "score": 2,
            "created_utc": 1662316437.0,
            "replies": [
                {
                    "body": "Yeah, in my opinion Tayuya is stronger than Temari.",
                    "author": "V4POR97",
                    "id": "in3gyd4",
                    "parent_id": "t1_in34mzd",
                    "score": 1,
                    "created_utc": 1662321625.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Seemed outa character for dosu. I felt like he was realizing they’re pawns",
            "author": "Censorstinyd",
            "id": "in3cpnp",
            "parent_id": "t3_x53w53",
            "score": 2,
            "created_utc": 1662319817.0,
            "replies": []
        },
        {
            "body": "Haha girls lame boys quirky \n\nAre y'all actually 12",
            "author": "IwishIwasGoku",
            "id": "in0ra19",
            "parent_id": "t3_x53w53",
            "score": 6,
            "created_utc": 1662268986.0,
            "replies": [
                {
                    "body": "its the meme format honey if you dont like it make an meme format that catches on",
                    "author": "Pixelated_Fudge",
                    "id": "in2fs2q",
                    "parent_id": "t1_in0ra19",
                    "score": 5,
                    "created_utc": 1662306627.0,
                    "replies": []
                },
                {
                    "body": "Not reddit if someone doesn’t get their panties in a twist over something so small.",
                    "author": "Kill_Frosty",
                    "id": "in2jk1z",
                    "parent_id": "t1_in0ra19",
                    "score": 2,
                    "created_utc": 1662308105.0,
                    "replies": []
                },
                {
                    "body": "Its a meme chill",
                    "author": "noohshab",
                    "id": "in0x224",
                    "parent_id": "t1_in0ra19",
                    "score": 4,
                    "created_utc": 1662273203.0,
                    "replies": []
                },
                {
                    "body": "It’s a joke 💀",
                    "author": "SniperIsAlien",
                    "id": "in12zga",
                    "parent_id": "t1_in0ra19",
                    "score": 2,
                    "created_utc": 1662277894.0,
                    "replies": [
                        {
                            "body": "I know that. It's a dumb joke that reinforces negative stereotypes that basically only 12 year old boys find funny",
                            "author": "IwishIwasGoku",
                            "id": "in2arcf",
                            "parent_id": "t1_in12zga",
                            "score": -1,
                            "created_utc": 1662304639.0,
                            "replies": [
                                {
                                    "body": "Or maybe that’s supposed to be the joke",
                                    "author": "SniperIsAlien",
                                    "id": "in39w6j",
                                    "parent_id": "t1_in2arcf",
                                    "score": 2,
                                    "created_utc": 1662318627.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I fucking hate these formats. Please find something new that might actually be funny.",
            "author": "TheDemonPants",
            "id": "imzm5ha",
            "parent_id": "t3_x53w53",
            "score": 11,
            "created_utc": 1662247521.0,
            "replies": [
                {
                    "body": "Memes stopped being funny a long time ago.",
                    "author": "CompleteQuiet5170",
                    "id": "in0nv94",
                    "parent_id": "t1_imzm5ha",
                    "score": 1,
                    "created_utc": 1662266727.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "unironically my favorite character ngl",
            "author": "BobbyYukitsuki",
            "id": "in2x4ap",
            "parent_id": "t3_x53w53",
            "score": 1,
            "created_utc": 1662313383.0,
            "replies": []
        },
        {
            "body": "I want so badly to worm him, crazy cause he could have been so strong",
            "author": null,
            "id": "in2xdta",
            "parent_id": "t3_x53w53",
            "score": 1,
            "created_utc": 1662313490.0,
            "replies": []
        },
        {
            "body": "Of ALL the side characters that never got enough screen time and proper development,\n\nNeji, Shino, Lee...\n\n...yall think DOSU was undercut? 😭 yall sometimes side characters need to be just side characters",
            "author": "aa821",
            "id": "in3fk6k",
            "parent_id": "t3_x53w53",
            "score": 1,
            "created_utc": 1662321034.0,
            "replies": [
                {
                    "body": "The problem is, Dosu actually had pretty much screentime during the Chuunin exams, so it give us the impression that his character has a bigger role or at least a character with later development.",
                    "author": "V4POR97",
                    "id": "in3gu1a",
                    "parent_id": "t1_in3fk6k",
                    "score": 1,
                    "created_utc": 1662321575.0,
                    "replies": [
                        {
                            "body": "Kind of how Zabuza and Haku got a full arc to themselves and ended up dying for the purpose of plot advancement and the overall narrative? It's fine for a character to get time in the lime light but when it's over it doesn't always mean they have to stay involved",
                            "author": "aa821",
                            "id": "in3h54x",
                            "parent_id": "t1_in3gu1a",
                            "score": 1,
                            "created_utc": 1662321703.0,
                            "replies": [
                                {
                                    "body": "At least they could have their final fight, meanwhile Dosu didn't even have a proper fight against Gaara.\nAnd like many of others said, it would be cool to see him betraying Orochimaru. I would like to see someone doing other than Sasuke. That plot wasn't even surprising because his main goal was to avenge Itachi, and only used Orochimaru to train him. After Sasuke became stronger, Orochimaru was at his way, so he had to get rid of him.\nBut unlike Sasuke, Dosu's plot was something unexpected.",
                                    "author": "V4POR97",
                                    "id": "in3i3c5",
                                    "parent_id": "t1_in3h54x",
                                    "score": 2,
                                    "created_utc": 1662322109.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It's not a contest... just because there are more blatant cases doesn't invalidate the lost potential in Dosu. Character potential and screentime shouldn't correlate\n\nalso it's naruto, literally everyone can be called lost potential",
                    "author": "BobbyYukitsuki",
                    "id": "in49rcm",
                    "parent_id": "t1_in3fk6k",
                    "score": 1,
                    "created_utc": 1662334456.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So I was hella into naruto exclusively throughout middle and high school. Hated the ending and around that time I got super into one piece. Years later, I’m revisiting naruto in a positive light and I find it hilarious how Oda will destroy his worlds’ consistency to keep even the most random character alive, meanwhile kishimoto was offing kids like it was nothing lol. I’m still heavy into one piece but his handling of death is the worst thing about the series, so it’s refreshing to see reminders like this lol",
            "author": "Rykno23",
            "id": "in3kp4w",
            "parent_id": "t3_x53w53",
            "score": 1,
            "created_utc": 1662323226.0,
            "replies": []
        },
        {
            "body": "Me too. Dosu, Orochimaru and Gaara were something special, they were such unsettling characters back then at the Chuunin exams.",
            "author": "V4POR97",
            "id": "imz7w6z",
            "parent_id": "t1_imz7e1s",
            "score": 116,
            "created_utc": 1662241134.0,
            "replies": []
        },
        {
            "body": "I miss zaku too tbh",
            "author": "sw2bh",
            "id": "in1ouhn",
            "parent_id": "t1_imz7e1s",
            "score": 17,
            "created_utc": 1662294642.0,
            "replies": [
                {
                    "body": "Yeah I felt the entire team had potential that got wasted. Dodu crushed, and the other two used as sacrifices to reincarnate the first two Hokage.",
                    "author": "ElderDark",
                    "id": "in1veku",
                    "parent_id": "t1_in1ouhn",
                    "score": 14,
                    "created_utc": 1662298111.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dosu was way smarter than his teammates. He already realized that he is just a tool for Orochimaru to test Sasuke's Curse Mark. \nI don't think they could just get him that easily, he saw through Orochimaru's plans.",
            "author": "V4POR97",
            "id": "imz1m9l",
            "parent_id": "t1_imz02rc",
            "score": 181,
            "created_utc": 1662238451.0,
            "replies": [
                {
                    "body": "Also, sacrificing his own genin team doesn't make sense, they were somewhat valuable. He could've just used some of his prisoners.",
                    "author": "V4POR97",
                    "id": "imz1wfh",
                    "parent_id": "t1_imz1m9l",
                    "score": 80,
                    "created_utc": 1662238570.0,
                    "replies": [
                        {
                            "body": "What do you mean? He did sacrifice them. Watch the 3rd hokage vs orochimaru fight. It reveals their faces/bodies after the third hokage seals the 1st and 2nd hokages spirits during the fight",
                            "author": null,
                            "id": "imz2d6u",
                            "parent_id": "t1_imz1wfh",
                            "score": 49,
                            "created_utc": 1662238765.0,
                            "replies": [
                                {
                                    "body": "I saw that fight and I know he sacrificed them, but I wanted to point out that he had a group of prisoners to sacrifice, instead of them who were literally kids.",
                                    "author": "V4POR97",
                                    "id": "imz3sbs",
                                    "parent_id": "t1_imz2d6u",
                                    "score": 32,
                                    "created_utc": 1662239355.0,
                                    "replies": [
                                        {
                                            "body": "Orochimaru doesn’t care if someone is a child, he will still use them and or sacrifice them. Even if they are useful, he still will. He tried to murder naruto, who arguably is the most useful of all the children in the entire series, since he’s a jinchuriki",
                                            "author": null,
                                            "id": "imz42hv",
                                            "parent_id": "t1_imz3sbs",
                                            "score": 34,
                                            "created_utc": 1662239476.0,
                                            "replies": [
                                                {
                                                    "body": "Then what was the point of taking Zaku from the streets and promise that if Zaku will join him, he could get power? He even took the time to modify Zaku's arms.\nI mean, he could easily find other people to sacrifice, other than investing effort to a kid just to be a dummy for Edo-tensei.",
                                                    "author": "V4POR97",
                                                    "id": "imz4rq6",
                                                    "parent_id": "t1_imz42hv",
                                                    "score": -5,
                                                    "created_utc": 1662239779.0,
                                                    "replies": [
                                                        {
                                                            "body": "To use him, then when he is no longer relevant, sacrifice him. Which is exactly what he did.",
                                                            "author": null,
                                                            "id": "imz53br",
                                                            "parent_id": "t1_imz4rq6",
                                                            "score": 36,
                                                            "created_utc": 1662239917.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Okay, I admit that you have valid points. The problem is that these 3 ninjas (especially Dosu and Zaku) could have been decent characters, because their jutsu was unique, and Dosu actually had talent and high intelligence. And they were far more memorable than the other characters Kishimito gave the \"fodder\" faith to. For example the Demon Brothers, the other 2 ninjas from Kabuto's team and Team Shigure weren't memorable, their jutsu just wasn't that special (unlike Dosu's Echo Drill).\nI know that Kishimoto created them to be fodder, but he just made them too memorable. Especially Dosu. \nAnd I'm not the only one who would want to see him continue his plot.",
                                                                    "author": "V4POR97",
                                                                    "id": "imz7gm3",
                                                                    "parent_id": "t1_imz53br",
                                                                    "score": 14,
                                                                    "created_utc": 1662240945.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Oh yeah definitely, they were extremely unique. I wish they had more screen time, I’m just pointing out the sociopathic tendencies of Orochimaru and also the fate a lot of supporting characters have in anime.",
                                                                            "author": null,
                                                                            "id": "imzdn3f",
                                                                            "parent_id": "t1_imz7gm3",
                                                                            "score": 11,
                                                                            "created_utc": 1662243640.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "He used them because they had served their purpose, was injured and no one from the leaf would search for them if they disappeared and they were closer than his prisoners.",
                            "author": "WillSmisk",
                            "id": "imzg6iz",
                            "parent_id": "t1_imz1wfh",
                            "score": 8,
                            "created_utc": 1662244786.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "So smart that he charged at gaara without knowing much about him.",
                    "author": "1_dont_care",
                    "id": "in3841a",
                    "parent_id": "t1_imz1m9l",
                    "score": 3,
                    "created_utc": 1662317880.0,
                    "replies": []
                },
                {
                    "body": "Smarter than his teammates, but still not on Orochimaru’s level. If Orochimaru wants to use Dosu for whatever he wants, he will. Dosu can’t stand up to Orochimaru",
                    "author": "whalemix",
                    "id": "in2qha3",
                    "parent_id": "t1_imz1m9l",
                    "score": 1,
                    "created_utc": 1662310812.0,
                    "replies": [
                        {
                            "body": "tbf, he easily could've asked Konoha for asylum",
                            "author": "BobbyYukitsuki",
                            "id": "in2w5pb",
                            "parent_id": "t1_in2qha3",
                            "score": 2,
                            "created_utc": 1662313002.0,
                            "replies": [
                                {
                                    "body": "He could’ve, but I doubt he would. He’s a sound ninja, they’re arrogant and hate the Leaf. I think even faced with death, Dosu wouldn’t have begged Konoha for help",
                                    "author": "whalemix",
                                    "id": "in4108d",
                                    "parent_id": "t1_in2w5pb",
                                    "score": 1,
                                    "created_utc": 1662330307.0,
                                    "replies": [
                                        {
                                            "body": "That's a good point actually, though I think the possibility isn't completely out of the question in part because a: he was able to recognize that Sasuke was more than he could handle and swallowed his pride in the forest, and b: it felt like much of the Sound Village's arrogance stemmed from their loyalty to Orochimaru, which Dosu had discarded.\n\nIf anything it would make for an interesting development seeing him ponder over it",
                                            "author": "BobbyYukitsuki",
                                            "id": "in4a0nq",
                                            "parent_id": "t1_in4108d",
                                            "score": 1,
                                            "created_utc": 1662334580.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dosu most likely was used to reanimate Minato but we all saw how that turned out.",
            "author": "jkid3000",
            "id": "in2cdsy",
            "parent_id": "t1_imz02rc",
            "score": 4,
            "created_utc": 1662305293.0,
            "replies": [
                {
                    "body": "But they couldn't use Dosu for that, because he died after he was facing Gaara.",
                    "author": "V4POR97",
                    "id": "in3g2e7",
                    "parent_id": "t1_in2cdsy",
                    "score": 3,
                    "created_utc": 1662321249.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There's nothing to say he would've easily gone along with it.\n\nEven if he was doomed to die he could've gone out in a better way. If he actively tried to run away or rebel against Orochimaru only for him to hunt him down and toy with him before offing him, it would've amped up Oro's fear factor while simultaneously showing us what Oro does when his people try to cut their ties with him—which would also enhance a later core element of the show as it demonstrates that Sasuke's later decision to join up with Orochimaru is a permanent commitment (at least, until Shippuden when he overpowers him). This would've let Dosu go out with a bang hopefully looking less like a chump, rather than being killed for a plot point which is literally never mentioned again (the full moon thing).",
            "author": "BobbyYukitsuki",
            "id": "in2wn1f",
            "parent_id": "t1_imz02rc",
            "score": 4,
            "created_utc": 1662313195.0,
            "replies": []
        },
        {
            "body": "Right? I think Kishimoto realized that he made it too OP upon introduction, then was like, “well, can’t ever use this again.”",
            "author": "XishengTheUltimate",
            "id": "imzh30a",
            "parent_id": "t1_imz8ho3",
            "score": 39,
            "created_utc": 1662245191.0,
            "replies": [
                {
                    "body": "I thought he kinda solved it during the Sauske retrieval arc when Temari used Wind Style to blow it back? It’s a shame it wasn’t used more since it had really good potential and seems like it would’ve been a good counter to the Sharingan",
                    "author": "SeductivePillowcase",
                    "id": "imzwwtj",
                    "parent_id": "t1_imzh30a",
                    "score": 19,
                    "created_utc": 1662252640.0,
                    "replies": [
                        {
                            "body": "God that was such a good fight. Shikamaru vs Tayuya is easily top 10 material for pre-Shippuden.",
                            "author": "LaughingGaster666",
                            "id": "in0b79a",
                            "parent_id": "t1_imzwwtj",
                            "score": 14,
                            "created_utc": 1662259565.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That's what happened with Kotoamatsukami but way worse which is why it never got used in any meaningful way.\n\nHad Shisui used his brain though, he wouldn't have needed to try to brainwash the entire clan.",
                    "author": "SmallerBork",
                    "id": "in0ok34",
                    "parent_id": "t1_imzh30a",
                    "score": 6,
                    "created_utc": 1662267178.0,
                    "replies": []
                },
                {
                    "body": "It was clearly supposed to be a counter to sharingan  (see obitos noise cancel headphones). They wouldn't have shippuden if these guys survived part 1",
                    "author": "waster1993",
                    "id": "in385wx",
                    "parent_id": "t1_imzh30a",
                    "score": 1,
                    "created_utc": 1662317902.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tf is wrong with you?😂😂",
            "author": "V4POR97",
            "id": "imyy10j",
            "parent_id": "t1_imyxvn2",
            "score": 66,
            "created_utc": 1662236953.0,
            "replies": [
                {
                    "body": "Bros drunk 😭",
                    "author": "hsg4mer1",
                    "id": "imz3blb",
                    "parent_id": "t1_imyy10j",
                    "score": 28,
                    "created_utc": 1662239160.0,
                    "replies": []
                },
                {
                    "body": "It all started when he picked his username",
                    "author": "SmallerBork",
                    "id": "in0ocq4",
                    "parent_id": "t1_imyy10j",
                    "score": 8,
                    "created_utc": 1662267043.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He was 14 yo actually, but yeah he looked older than that.",
            "author": "V4POR97",
            "id": "imzc18w",
            "parent_id": "t1_imzbdui",
            "score": 57,
            "created_utc": 1662242940.0,
            "replies": [
                {
                    "body": "He also has the voice of a 40 year old smoker",
                    "author": "Garutoku",
                    "id": "imzfkwh",
                    "parent_id": "t1_imzc18w",
                    "score": 40,
                    "created_utc": 1662244512.0,
                    "replies": [
                        {
                            "body": "English dubs in the 2000's be like",
                            "author": "yenjhin",
                            "id": "in10hva",
                            "parent_id": "t1_imzfkwh",
                            "score": 9,
                            "created_utc": 1662275881.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "The day that I learned that Dosu and his team, and the Sound 4, were only teenagers threw me for a loop.",
                    "author": "Proto-Omega",
                    "id": "imzr3ck",
                    "parent_id": "t1_imzc18w",
                    "score": 16,
                    "created_utc": 1662249861.0,
                    "replies": [
                        {
                            "body": "Right? The sound four even called Sasuke “kid”. Imo they should’ve been shown to be like 18-20 years old.",
                            "author": "Neat_Biscotti8950",
                            "id": "in1fo5f",
                            "parent_id": "t1_imzr3ck",
                            "score": 2,
                            "created_utc": 1662288461.0,
                            "replies": [
                                {
                                    "body": "The average life of a ninja outside of the Leaf is probably like 16 or so.",
                                    "author": "DisneyPrincessDVorah",
                                    "id": "in1vq9j",
                                    "parent_id": "t1_in1fo5f",
                                    "score": 2,
                                    "created_utc": 1662298268.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Could have just let Orochimaru kill the kids in Rain and a lot more things would have been fixed.",
            "author": "DisneyPrincessDVorah",
            "id": "in1vvji",
            "parent_id": "t1_in04nqk",
            "score": 2,
            "created_utc": 1662298338.0,
            "replies": []
        },
        {
            "body": "Definitely. There is a possibility that he would became a rogue ninja, and the Akatsuki could recruit him, for exhcange he can avenge Orochimaru, the guy who betrayed both Akatsuki and Dosu.",
            "author": "V4POR97",
            "id": "in5pkxv",
            "parent_id": "t1_in0p8m2",
            "score": 1,
            "created_utc": 1662362829.0,
            "replies": []
        },
        {
            "body": "because a villainous minion prioritizing their self-preservation over blindly sacrificing themself for their master makes for interesting power shifts in the story and could've theoretically made said villain's plans go in a vastly different direction",
            "author": "BobbyYukitsuki",
            "id": "in2x0rp",
            "parent_id": "t1_imzj9nk",
            "score": 8,
            "created_utc": 1662313345.0,
            "replies": []
        },
        {
            "body": "Because the sound 5 is definitely missed potential, they were truly interesting",
            "author": "WillSmisk",
            "id": "imzm473",
            "parent_id": "t1_imzj9nk",
            "score": 9,
            "created_utc": 1662247504.0,
            "replies": [
                {
                    "body": "I just feel like it’s way more important for characters like Neji and Rock Lee to have screentime but then again that still doesn’t mean there was wasted potential with some of the smaller villains",
                    "author": "D3ATHSTR0KE_",
                    "id": "imzm870",
                    "parent_id": "t1_imzm473",
                    "score": -1,
                    "created_utc": 1662247556.0,
                    "replies": [
                        {
                            "body": "Those two are definitely bigger priorities, just sad to see the world building and characters not fleshed out more",
                            "author": "WillSmisk",
                            "id": "imzon67",
                            "parent_id": "t1_imzm870",
                            "score": 5,
                            "created_utc": 1662248701.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, in my opinion Tayuya is stronger than Temari.",
            "author": "V4POR97",
            "id": "in3gyd4",
            "parent_id": "t1_in34mzd",
            "score": 1,
            "created_utc": 1662321625.0,
            "replies": []
        },
        {
            "body": "its the meme format honey if you dont like it make an meme format that catches on",
            "author": "Pixelated_Fudge",
            "id": "in2fs2q",
            "parent_id": "t1_in0ra19",
            "score": 5,
            "created_utc": 1662306627.0,
            "replies": []
        },
        {
            "body": "Not reddit if someone doesn’t get their panties in a twist over something so small.",
            "author": "Kill_Frosty",
            "id": "in2jk1z",
            "parent_id": "t1_in0ra19",
            "score": 2,
            "created_utc": 1662308105.0,
            "replies": []
        },
        {
            "body": "Its a meme chill",
            "author": "noohshab",
            "id": "in0x224",
            "parent_id": "t1_in0ra19",
            "score": 4,
            "created_utc": 1662273203.0,
            "replies": []
        },
        {
            "body": "It’s a joke 💀",
            "author": "SniperIsAlien",
            "id": "in12zga",
            "parent_id": "t1_in0ra19",
            "score": 2,
            "created_utc": 1662277894.0,
            "replies": [
                {
                    "body": "I know that. It's a dumb joke that reinforces negative stereotypes that basically only 12 year old boys find funny",
                    "author": "IwishIwasGoku",
                    "id": "in2arcf",
                    "parent_id": "t1_in12zga",
                    "score": -1,
                    "created_utc": 1662304639.0,
                    "replies": [
                        {
                            "body": "Or maybe that’s supposed to be the joke",
                            "author": "SniperIsAlien",
                            "id": "in39w6j",
                            "parent_id": "t1_in2arcf",
                            "score": 2,
                            "created_utc": 1662318627.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Memes stopped being funny a long time ago.",
            "author": "CompleteQuiet5170",
            "id": "in0nv94",
            "parent_id": "t1_imzm5ha",
            "score": 1,
            "created_utc": 1662266727.0,
            "replies": []
        },
        {
            "body": "The problem is, Dosu actually had pretty much screentime during the Chuunin exams, so it give us the impression that his character has a bigger role or at least a character with later development.",
            "author": "V4POR97",
            "id": "in3gu1a",
            "parent_id": "t1_in3fk6k",
            "score": 1,
            "created_utc": 1662321575.0,
            "replies": [
                {
                    "body": "Kind of how Zabuza and Haku got a full arc to themselves and ended up dying for the purpose of plot advancement and the overall narrative? It's fine for a character to get time in the lime light but when it's over it doesn't always mean they have to stay involved",
                    "author": "aa821",
                    "id": "in3h54x",
                    "parent_id": "t1_in3gu1a",
                    "score": 1,
                    "created_utc": 1662321703.0,
                    "replies": [
                        {
                            "body": "At least they could have their final fight, meanwhile Dosu didn't even have a proper fight against Gaara.\nAnd like many of others said, it would be cool to see him betraying Orochimaru. I would like to see someone doing other than Sasuke. That plot wasn't even surprising because his main goal was to avenge Itachi, and only used Orochimaru to train him. After Sasuke became stronger, Orochimaru was at his way, so he had to get rid of him.\nBut unlike Sasuke, Dosu's plot was something unexpected.",
                            "author": "V4POR97",
                            "id": "in3i3c5",
                            "parent_id": "t1_in3h54x",
                            "score": 2,
                            "created_utc": 1662322109.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's not a contest... just because there are more blatant cases doesn't invalidate the lost potential in Dosu. Character potential and screentime shouldn't correlate\n\nalso it's naruto, literally everyone can be called lost potential",
            "author": "BobbyYukitsuki",
            "id": "in49rcm",
            "parent_id": "t1_in3fk6k",
            "score": 1,
            "created_utc": 1662334456.0,
            "replies": []
        },
        {
            "body": "Yeah I felt the entire team had potential that got wasted. Dodu crushed, and the other two used as sacrifices to reincarnate the first two Hokage.",
            "author": "ElderDark",
            "id": "in1veku",
            "parent_id": "t1_in1ouhn",
            "score": 14,
            "created_utc": 1662298111.0,
            "replies": []
        },
        {
            "body": "Also, sacrificing his own genin team doesn't make sense, they were somewhat valuable. He could've just used some of his prisoners.",
            "author": "V4POR97",
            "id": "imz1wfh",
            "parent_id": "t1_imz1m9l",
            "score": 80,
            "created_utc": 1662238570.0,
            "replies": [
                {
                    "body": "What do you mean? He did sacrifice them. Watch the 3rd hokage vs orochimaru fight. It reveals their faces/bodies after the third hokage seals the 1st and 2nd hokages spirits during the fight",
                    "author": null,
                    "id": "imz2d6u",
                    "parent_id": "t1_imz1wfh",
                    "score": 49,
                    "created_utc": 1662238765.0,
                    "replies": [
                        {
                            "body": "I saw that fight and I know he sacrificed them, but I wanted to point out that he had a group of prisoners to sacrifice, instead of them who were literally kids.",
                            "author": "V4POR97",
                            "id": "imz3sbs",
                            "parent_id": "t1_imz2d6u",
                            "score": 32,
                            "created_utc": 1662239355.0,
                            "replies": [
                                {
                                    "body": "Orochimaru doesn’t care if someone is a child, he will still use them and or sacrifice them. Even if they are useful, he still will. He tried to murder naruto, who arguably is the most useful of all the children in the entire series, since he’s a jinchuriki",
                                    "author": null,
                                    "id": "imz42hv",
                                    "parent_id": "t1_imz3sbs",
                                    "score": 34,
                                    "created_utc": 1662239476.0,
                                    "replies": [
                                        {
                                            "body": "Then what was the point of taking Zaku from the streets and promise that if Zaku will join him, he could get power? He even took the time to modify Zaku's arms.\nI mean, he could easily find other people to sacrifice, other than investing effort to a kid just to be a dummy for Edo-tensei.",
                                            "author": "V4POR97",
                                            "id": "imz4rq6",
                                            "parent_id": "t1_imz42hv",
                                            "score": -5,
                                            "created_utc": 1662239779.0,
                                            "replies": [
                                                {
                                                    "body": "To use him, then when he is no longer relevant, sacrifice him. Which is exactly what he did.",
                                                    "author": null,
                                                    "id": "imz53br",
                                                    "parent_id": "t1_imz4rq6",
                                                    "score": 36,
                                                    "created_utc": 1662239917.0,
                                                    "replies": [
                                                        {
                                                            "body": "Okay, I admit that you have valid points. The problem is that these 3 ninjas (especially Dosu and Zaku) could have been decent characters, because their jutsu was unique, and Dosu actually had talent and high intelligence. And they were far more memorable than the other characters Kishimito gave the \"fodder\" faith to. For example the Demon Brothers, the other 2 ninjas from Kabuto's team and Team Shigure weren't memorable, their jutsu just wasn't that special (unlike Dosu's Echo Drill).\nI know that Kishimoto created them to be fodder, but he just made them too memorable. Especially Dosu. \nAnd I'm not the only one who would want to see him continue his plot.",
                                                            "author": "V4POR97",
                                                            "id": "imz7gm3",
                                                            "parent_id": "t1_imz53br",
                                                            "score": 14,
                                                            "created_utc": 1662240945.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Oh yeah definitely, they were extremely unique. I wish they had more screen time, I’m just pointing out the sociopathic tendencies of Orochimaru and also the fate a lot of supporting characters have in anime.",
                                                                    "author": null,
                                                                    "id": "imzdn3f",
                                                                    "parent_id": "t1_imz7gm3",
                                                                    "score": 11,
                                                                    "created_utc": 1662243640.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "He used them because they had served their purpose, was injured and no one from the leaf would search for them if they disappeared and they were closer than his prisoners.",
                    "author": "WillSmisk",
                    "id": "imzg6iz",
                    "parent_id": "t1_imz1wfh",
                    "score": 8,
                    "created_utc": 1662244786.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So smart that he charged at gaara without knowing much about him.",
            "author": "1_dont_care",
            "id": "in3841a",
            "parent_id": "t1_imz1m9l",
            "score": 3,
            "created_utc": 1662317880.0,
            "replies": []
        },
        {
            "body": "Smarter than his teammates, but still not on Orochimaru’s level. If Orochimaru wants to use Dosu for whatever he wants, he will. Dosu can’t stand up to Orochimaru",
            "author": "whalemix",
            "id": "in2qha3",
            "parent_id": "t1_imz1m9l",
            "score": 1,
            "created_utc": 1662310812.0,
            "replies": [
                {
                    "body": "tbf, he easily could've asked Konoha for asylum",
                    "author": "BobbyYukitsuki",
                    "id": "in2w5pb",
                    "parent_id": "t1_in2qha3",
                    "score": 2,
                    "created_utc": 1662313002.0,
                    "replies": [
                        {
                            "body": "He could’ve, but I doubt he would. He’s a sound ninja, they’re arrogant and hate the Leaf. I think even faced with death, Dosu wouldn’t have begged Konoha for help",
                            "author": "whalemix",
                            "id": "in4108d",
                            "parent_id": "t1_in2w5pb",
                            "score": 1,
                            "created_utc": 1662330307.0,
                            "replies": [
                                {
                                    "body": "That's a good point actually, though I think the possibility isn't completely out of the question in part because a: he was able to recognize that Sasuke was more than he could handle and swallowed his pride in the forest, and b: it felt like much of the Sound Village's arrogance stemmed from their loyalty to Orochimaru, which Dosu had discarded.\n\nIf anything it would make for an interesting development seeing him ponder over it",
                                    "author": "BobbyYukitsuki",
                                    "id": "in4a0nq",
                                    "parent_id": "t1_in4108d",
                                    "score": 1,
                                    "created_utc": 1662334580.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "But they couldn't use Dosu for that, because he died after he was facing Gaara.",
            "author": "V4POR97",
            "id": "in3g2e7",
            "parent_id": "t1_in2cdsy",
            "score": 3,
            "created_utc": 1662321249.0,
            "replies": []
        },
        {
            "body": "I thought he kinda solved it during the Sauske retrieval arc when Temari used Wind Style to blow it back? It’s a shame it wasn’t used more since it had really good potential and seems like it would’ve been a good counter to the Sharingan",
            "author": "SeductivePillowcase",
            "id": "imzwwtj",
            "parent_id": "t1_imzh30a",
            "score": 19,
            "created_utc": 1662252640.0,
            "replies": [
                {
                    "body": "God that was such a good fight. Shikamaru vs Tayuya is easily top 10 material for pre-Shippuden.",
                    "author": "LaughingGaster666",
                    "id": "in0b79a",
                    "parent_id": "t1_imzwwtj",
                    "score": 14,
                    "created_utc": 1662259565.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's what happened with Kotoamatsukami but way worse which is why it never got used in any meaningful way.\n\nHad Shisui used his brain though, he wouldn't have needed to try to brainwash the entire clan.",
            "author": "SmallerBork",
            "id": "in0ok34",
            "parent_id": "t1_imzh30a",
            "score": 6,
            "created_utc": 1662267178.0,
            "replies": []
        },
        {
            "body": "It was clearly supposed to be a counter to sharingan  (see obitos noise cancel headphones). They wouldn't have shippuden if these guys survived part 1",
            "author": "waster1993",
            "id": "in385wx",
            "parent_id": "t1_imzh30a",
            "score": 1,
            "created_utc": 1662317902.0,
            "replies": []
        },
        {
            "body": "Bros drunk 😭",
            "author": "hsg4mer1",
            "id": "imz3blb",
            "parent_id": "t1_imyy10j",
            "score": 28,
            "created_utc": 1662239160.0,
            "replies": []
        },
        {
            "body": "It all started when he picked his username",
            "author": "SmallerBork",
            "id": "in0ocq4",
            "parent_id": "t1_imyy10j",
            "score": 8,
            "created_utc": 1662267043.0,
            "replies": []
        },
        {
            "body": "He also has the voice of a 40 year old smoker",
            "author": "Garutoku",
            "id": "imzfkwh",
            "parent_id": "t1_imzc18w",
            "score": 40,
            "created_utc": 1662244512.0,
            "replies": [
                {
                    "body": "English dubs in the 2000's be like",
                    "author": "yenjhin",
                    "id": "in10hva",
                    "parent_id": "t1_imzfkwh",
                    "score": 9,
                    "created_utc": 1662275881.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The day that I learned that Dosu and his team, and the Sound 4, were only teenagers threw me for a loop.",
            "author": "Proto-Omega",
            "id": "imzr3ck",
            "parent_id": "t1_imzc18w",
            "score": 16,
            "created_utc": 1662249861.0,
            "replies": [
                {
                    "body": "Right? The sound four even called Sasuke “kid”. Imo they should’ve been shown to be like 18-20 years old.",
                    "author": "Neat_Biscotti8950",
                    "id": "in1fo5f",
                    "parent_id": "t1_imzr3ck",
                    "score": 2,
                    "created_utc": 1662288461.0,
                    "replies": [
                        {
                            "body": "The average life of a ninja outside of the Leaf is probably like 16 or so.",
                            "author": "DisneyPrincessDVorah",
                            "id": "in1vq9j",
                            "parent_id": "t1_in1fo5f",
                            "score": 2,
                            "created_utc": 1662298268.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I just feel like it’s way more important for characters like Neji and Rock Lee to have screentime but then again that still doesn’t mean there was wasted potential with some of the smaller villains",
            "author": "D3ATHSTR0KE_",
            "id": "imzm870",
            "parent_id": "t1_imzm473",
            "score": -1,
            "created_utc": 1662247556.0,
            "replies": [
                {
                    "body": "Those two are definitely bigger priorities, just sad to see the world building and characters not fleshed out more",
                    "author": "WillSmisk",
                    "id": "imzon67",
                    "parent_id": "t1_imzm870",
                    "score": 5,
                    "created_utc": 1662248701.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know that. It's a dumb joke that reinforces negative stereotypes that basically only 12 year old boys find funny",
            "author": "IwishIwasGoku",
            "id": "in2arcf",
            "parent_id": "t1_in12zga",
            "score": -1,
            "created_utc": 1662304639.0,
            "replies": [
                {
                    "body": "Or maybe that’s supposed to be the joke",
                    "author": "SniperIsAlien",
                    "id": "in39w6j",
                    "parent_id": "t1_in2arcf",
                    "score": 2,
                    "created_utc": 1662318627.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Kind of how Zabuza and Haku got a full arc to themselves and ended up dying for the purpose of plot advancement and the overall narrative? It's fine for a character to get time in the lime light but when it's over it doesn't always mean they have to stay involved",
            "author": "aa821",
            "id": "in3h54x",
            "parent_id": "t1_in3gu1a",
            "score": 1,
            "created_utc": 1662321703.0,
            "replies": [
                {
                    "body": "At least they could have their final fight, meanwhile Dosu didn't even have a proper fight against Gaara.\nAnd like many of others said, it would be cool to see him betraying Orochimaru. I would like to see someone doing other than Sasuke. That plot wasn't even surprising because his main goal was to avenge Itachi, and only used Orochimaru to train him. After Sasuke became stronger, Orochimaru was at his way, so he had to get rid of him.\nBut unlike Sasuke, Dosu's plot was something unexpected.",
                    "author": "V4POR97",
                    "id": "in3i3c5",
                    "parent_id": "t1_in3h54x",
                    "score": 2,
                    "created_utc": 1662322109.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What do you mean? He did sacrifice them. Watch the 3rd hokage vs orochimaru fight. It reveals their faces/bodies after the third hokage seals the 1st and 2nd hokages spirits during the fight",
            "author": null,
            "id": "imz2d6u",
            "parent_id": "t1_imz1wfh",
            "score": 49,
            "created_utc": 1662238765.0,
            "replies": [
                {
                    "body": "I saw that fight and I know he sacrificed them, but I wanted to point out that he had a group of prisoners to sacrifice, instead of them who were literally kids.",
                    "author": "V4POR97",
                    "id": "imz3sbs",
                    "parent_id": "t1_imz2d6u",
                    "score": 32,
                    "created_utc": 1662239355.0,
                    "replies": [
                        {
                            "body": "Orochimaru doesn’t care if someone is a child, he will still use them and or sacrifice them. Even if they are useful, he still will. He tried to murder naruto, who arguably is the most useful of all the children in the entire series, since he’s a jinchuriki",
                            "author": null,
                            "id": "imz42hv",
                            "parent_id": "t1_imz3sbs",
                            "score": 34,
                            "created_utc": 1662239476.0,
                            "replies": [
                                {
                                    "body": "Then what was the point of taking Zaku from the streets and promise that if Zaku will join him, he could get power? He even took the time to modify Zaku's arms.\nI mean, he could easily find other people to sacrifice, other than investing effort to a kid just to be a dummy for Edo-tensei.",
                                    "author": "V4POR97",
                                    "id": "imz4rq6",
                                    "parent_id": "t1_imz42hv",
                                    "score": -5,
                                    "created_utc": 1662239779.0,
                                    "replies": [
                                        {
                                            "body": "To use him, then when he is no longer relevant, sacrifice him. Which is exactly what he did.",
                                            "author": null,
                                            "id": "imz53br",
                                            "parent_id": "t1_imz4rq6",
                                            "score": 36,
                                            "created_utc": 1662239917.0,
                                            "replies": [
                                                {
                                                    "body": "Okay, I admit that you have valid points. The problem is that these 3 ninjas (especially Dosu and Zaku) could have been decent characters, because their jutsu was unique, and Dosu actually had talent and high intelligence. And they were far more memorable than the other characters Kishimito gave the \"fodder\" faith to. For example the Demon Brothers, the other 2 ninjas from Kabuto's team and Team Shigure weren't memorable, their jutsu just wasn't that special (unlike Dosu's Echo Drill).\nI know that Kishimoto created them to be fodder, but he just made them too memorable. Especially Dosu. \nAnd I'm not the only one who would want to see him continue his plot.",
                                                    "author": "V4POR97",
                                                    "id": "imz7gm3",
                                                    "parent_id": "t1_imz53br",
                                                    "score": 14,
                                                    "created_utc": 1662240945.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oh yeah definitely, they were extremely unique. I wish they had more screen time, I’m just pointing out the sociopathic tendencies of Orochimaru and also the fate a lot of supporting characters have in anime.",
                                                            "author": null,
                                                            "id": "imzdn3f",
                                                            "parent_id": "t1_imz7gm3",
                                                            "score": 11,
                                                            "created_utc": 1662243640.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He used them because they had served their purpose, was injured and no one from the leaf would search for them if they disappeared and they were closer than his prisoners.",
            "author": "WillSmisk",
            "id": "imzg6iz",
            "parent_id": "t1_imz1wfh",
            "score": 8,
            "created_utc": 1662244786.0,
            "replies": []
        },
        {
            "body": "tbf, he easily could've asked Konoha for asylum",
            "author": "BobbyYukitsuki",
            "id": "in2w5pb",
            "parent_id": "t1_in2qha3",
            "score": 2,
            "created_utc": 1662313002.0,
            "replies": [
                {
                    "body": "He could’ve, but I doubt he would. He’s a sound ninja, they’re arrogant and hate the Leaf. I think even faced with death, Dosu wouldn’t have begged Konoha for help",
                    "author": "whalemix",
                    "id": "in4108d",
                    "parent_id": "t1_in2w5pb",
                    "score": 1,
                    "created_utc": 1662330307.0,
                    "replies": [
                        {
                            "body": "That's a good point actually, though I think the possibility isn't completely out of the question in part because a: he was able to recognize that Sasuke was more than he could handle and swallowed his pride in the forest, and b: it felt like much of the Sound Village's arrogance stemmed from their loyalty to Orochimaru, which Dosu had discarded.\n\nIf anything it would make for an interesting development seeing him ponder over it",
                            "author": "BobbyYukitsuki",
                            "id": "in4a0nq",
                            "parent_id": "t1_in4108d",
                            "score": 1,
                            "created_utc": 1662334580.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "God that was such a good fight. Shikamaru vs Tayuya is easily top 10 material for pre-Shippuden.",
            "author": "LaughingGaster666",
            "id": "in0b79a",
            "parent_id": "t1_imzwwtj",
            "score": 14,
            "created_utc": 1662259565.0,
            "replies": []
        },
        {
            "body": "English dubs in the 2000's be like",
            "author": "yenjhin",
            "id": "in10hva",
            "parent_id": "t1_imzfkwh",
            "score": 9,
            "created_utc": 1662275881.0,
            "replies": []
        },
        {
            "body": "Right? The sound four even called Sasuke “kid”. Imo they should’ve been shown to be like 18-20 years old.",
            "author": "Neat_Biscotti8950",
            "id": "in1fo5f",
            "parent_id": "t1_imzr3ck",
            "score": 2,
            "created_utc": 1662288461.0,
            "replies": [
                {
                    "body": "The average life of a ninja outside of the Leaf is probably like 16 or so.",
                    "author": "DisneyPrincessDVorah",
                    "id": "in1vq9j",
                    "parent_id": "t1_in1fo5f",
                    "score": 2,
                    "created_utc": 1662298268.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Those two are definitely bigger priorities, just sad to see the world building and characters not fleshed out more",
            "author": "WillSmisk",
            "id": "imzon67",
            "parent_id": "t1_imzm870",
            "score": 5,
            "created_utc": 1662248701.0,
            "replies": []
        },
        {
            "body": "Or maybe that’s supposed to be the joke",
            "author": "SniperIsAlien",
            "id": "in39w6j",
            "parent_id": "t1_in2arcf",
            "score": 2,
            "created_utc": 1662318627.0,
            "replies": []
        },
        {
            "body": "At least they could have their final fight, meanwhile Dosu didn't even have a proper fight against Gaara.\nAnd like many of others said, it would be cool to see him betraying Orochimaru. I would like to see someone doing other than Sasuke. That plot wasn't even surprising because his main goal was to avenge Itachi, and only used Orochimaru to train him. After Sasuke became stronger, Orochimaru was at his way, so he had to get rid of him.\nBut unlike Sasuke, Dosu's plot was something unexpected.",
            "author": "V4POR97",
            "id": "in3i3c5",
            "parent_id": "t1_in3h54x",
            "score": 2,
            "created_utc": 1662322109.0,
            "replies": []
        },
        {
            "body": "I saw that fight and I know he sacrificed them, but I wanted to point out that he had a group of prisoners to sacrifice, instead of them who were literally kids.",
            "author": "V4POR97",
            "id": "imz3sbs",
            "parent_id": "t1_imz2d6u",
            "score": 32,
            "created_utc": 1662239355.0,
            "replies": [
                {
                    "body": "Orochimaru doesn’t care if someone is a child, he will still use them and or sacrifice them. Even if they are useful, he still will. He tried to murder naruto, who arguably is the most useful of all the children in the entire series, since he’s a jinchuriki",
                    "author": null,
                    "id": "imz42hv",
                    "parent_id": "t1_imz3sbs",
                    "score": 34,
                    "created_utc": 1662239476.0,
                    "replies": [
                        {
                            "body": "Then what was the point of taking Zaku from the streets and promise that if Zaku will join him, he could get power? He even took the time to modify Zaku's arms.\nI mean, he could easily find other people to sacrifice, other than investing effort to a kid just to be a dummy for Edo-tensei.",
                            "author": "V4POR97",
                            "id": "imz4rq6",
                            "parent_id": "t1_imz42hv",
                            "score": -5,
                            "created_utc": 1662239779.0,
                            "replies": [
                                {
                                    "body": "To use him, then when he is no longer relevant, sacrifice him. Which is exactly what he did.",
                                    "author": null,
                                    "id": "imz53br",
                                    "parent_id": "t1_imz4rq6",
                                    "score": 36,
                                    "created_utc": 1662239917.0,
                                    "replies": [
                                        {
                                            "body": "Okay, I admit that you have valid points. The problem is that these 3 ninjas (especially Dosu and Zaku) could have been decent characters, because their jutsu was unique, and Dosu actually had talent and high intelligence. And they were far more memorable than the other characters Kishimito gave the \"fodder\" faith to. For example the Demon Brothers, the other 2 ninjas from Kabuto's team and Team Shigure weren't memorable, their jutsu just wasn't that special (unlike Dosu's Echo Drill).\nI know that Kishimoto created them to be fodder, but he just made them too memorable. Especially Dosu. \nAnd I'm not the only one who would want to see him continue his plot.",
                                            "author": "V4POR97",
                                            "id": "imz7gm3",
                                            "parent_id": "t1_imz53br",
                                            "score": 14,
                                            "created_utc": 1662240945.0,
                                            "replies": [
                                                {
                                                    "body": "Oh yeah definitely, they were extremely unique. I wish they had more screen time, I’m just pointing out the sociopathic tendencies of Orochimaru and also the fate a lot of supporting characters have in anime.",
                                                    "author": null,
                                                    "id": "imzdn3f",
                                                    "parent_id": "t1_imz7gm3",
                                                    "score": 11,
                                                    "created_utc": 1662243640.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He could’ve, but I doubt he would. He’s a sound ninja, they’re arrogant and hate the Leaf. I think even faced with death, Dosu wouldn’t have begged Konoha for help",
            "author": "whalemix",
            "id": "in4108d",
            "parent_id": "t1_in2w5pb",
            "score": 1,
            "created_utc": 1662330307.0,
            "replies": [
                {
                    "body": "That's a good point actually, though I think the possibility isn't completely out of the question in part because a: he was able to recognize that Sasuke was more than he could handle and swallowed his pride in the forest, and b: it felt like much of the Sound Village's arrogance stemmed from their loyalty to Orochimaru, which Dosu had discarded.\n\nIf anything it would make for an interesting development seeing him ponder over it",
                    "author": "BobbyYukitsuki",
                    "id": "in4a0nq",
                    "parent_id": "t1_in4108d",
                    "score": 1,
                    "created_utc": 1662334580.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The average life of a ninja outside of the Leaf is probably like 16 or so.",
            "author": "DisneyPrincessDVorah",
            "id": "in1vq9j",
            "parent_id": "t1_in1fo5f",
            "score": 2,
            "created_utc": 1662298268.0,
            "replies": []
        },
        {
            "body": "Orochimaru doesn’t care if someone is a child, he will still use them and or sacrifice them. Even if they are useful, he still will. He tried to murder naruto, who arguably is the most useful of all the children in the entire series, since he’s a jinchuriki",
            "author": null,
            "id": "imz42hv",
            "parent_id": "t1_imz3sbs",
            "score": 34,
            "created_utc": 1662239476.0,
            "replies": [
                {
                    "body": "Then what was the point of taking Zaku from the streets and promise that if Zaku will join him, he could get power? He even took the time to modify Zaku's arms.\nI mean, he could easily find other people to sacrifice, other than investing effort to a kid just to be a dummy for Edo-tensei.",
                    "author": "V4POR97",
                    "id": "imz4rq6",
                    "parent_id": "t1_imz42hv",
                    "score": -5,
                    "created_utc": 1662239779.0,
                    "replies": [
                        {
                            "body": "To use him, then when he is no longer relevant, sacrifice him. Which is exactly what he did.",
                            "author": null,
                            "id": "imz53br",
                            "parent_id": "t1_imz4rq6",
                            "score": 36,
                            "created_utc": 1662239917.0,
                            "replies": [
                                {
                                    "body": "Okay, I admit that you have valid points. The problem is that these 3 ninjas (especially Dosu and Zaku) could have been decent characters, because their jutsu was unique, and Dosu actually had talent and high intelligence. And they were far more memorable than the other characters Kishimito gave the \"fodder\" faith to. For example the Demon Brothers, the other 2 ninjas from Kabuto's team and Team Shigure weren't memorable, their jutsu just wasn't that special (unlike Dosu's Echo Drill).\nI know that Kishimoto created them to be fodder, but he just made them too memorable. Especially Dosu. \nAnd I'm not the only one who would want to see him continue his plot.",
                                    "author": "V4POR97",
                                    "id": "imz7gm3",
                                    "parent_id": "t1_imz53br",
                                    "score": 14,
                                    "created_utc": 1662240945.0,
                                    "replies": [
                                        {
                                            "body": "Oh yeah definitely, they were extremely unique. I wish they had more screen time, I’m just pointing out the sociopathic tendencies of Orochimaru and also the fate a lot of supporting characters have in anime.",
                                            "author": null,
                                            "id": "imzdn3f",
                                            "parent_id": "t1_imz7gm3",
                                            "score": 11,
                                            "created_utc": 1662243640.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's a good point actually, though I think the possibility isn't completely out of the question in part because a: he was able to recognize that Sasuke was more than he could handle and swallowed his pride in the forest, and b: it felt like much of the Sound Village's arrogance stemmed from their loyalty to Orochimaru, which Dosu had discarded.\n\nIf anything it would make for an interesting development seeing him ponder over it",
            "author": "BobbyYukitsuki",
            "id": "in4a0nq",
            "parent_id": "t1_in4108d",
            "score": 1,
            "created_utc": 1662334580.0,
            "replies": []
        },
        {
            "body": "Then what was the point of taking Zaku from the streets and promise that if Zaku will join him, he could get power? He even took the time to modify Zaku's arms.\nI mean, he could easily find other people to sacrifice, other than investing effort to a kid just to be a dummy for Edo-tensei.",
            "author": "V4POR97",
            "id": "imz4rq6",
            "parent_id": "t1_imz42hv",
            "score": -5,
            "created_utc": 1662239779.0,
            "replies": [
                {
                    "body": "To use him, then when he is no longer relevant, sacrifice him. Which is exactly what he did.",
                    "author": null,
                    "id": "imz53br",
                    "parent_id": "t1_imz4rq6",
                    "score": 36,
                    "created_utc": 1662239917.0,
                    "replies": [
                        {
                            "body": "Okay, I admit that you have valid points. The problem is that these 3 ninjas (especially Dosu and Zaku) could have been decent characters, because their jutsu was unique, and Dosu actually had talent and high intelligence. And they were far more memorable than the other characters Kishimito gave the \"fodder\" faith to. For example the Demon Brothers, the other 2 ninjas from Kabuto's team and Team Shigure weren't memorable, their jutsu just wasn't that special (unlike Dosu's Echo Drill).\nI know that Kishimoto created them to be fodder, but he just made them too memorable. Especially Dosu. \nAnd I'm not the only one who would want to see him continue his plot.",
                            "author": "V4POR97",
                            "id": "imz7gm3",
                            "parent_id": "t1_imz53br",
                            "score": 14,
                            "created_utc": 1662240945.0,
                            "replies": [
                                {
                                    "body": "Oh yeah definitely, they were extremely unique. I wish they had more screen time, I’m just pointing out the sociopathic tendencies of Orochimaru and also the fate a lot of supporting characters have in anime.",
                                    "author": null,
                                    "id": "imzdn3f",
                                    "parent_id": "t1_imz7gm3",
                                    "score": 11,
                                    "created_utc": 1662243640.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "To use him, then when he is no longer relevant, sacrifice him. Which is exactly what he did.",
            "author": null,
            "id": "imz53br",
            "parent_id": "t1_imz4rq6",
            "score": 36,
            "created_utc": 1662239917.0,
            "replies": [
                {
                    "body": "Okay, I admit that you have valid points. The problem is that these 3 ninjas (especially Dosu and Zaku) could have been decent characters, because their jutsu was unique, and Dosu actually had talent and high intelligence. And they were far more memorable than the other characters Kishimito gave the \"fodder\" faith to. For example the Demon Brothers, the other 2 ninjas from Kabuto's team and Team Shigure weren't memorable, their jutsu just wasn't that special (unlike Dosu's Echo Drill).\nI know that Kishimoto created them to be fodder, but he just made them too memorable. Especially Dosu. \nAnd I'm not the only one who would want to see him continue his plot.",
                    "author": "V4POR97",
                    "id": "imz7gm3",
                    "parent_id": "t1_imz53br",
                    "score": 14,
                    "created_utc": 1662240945.0,
                    "replies": [
                        {
                            "body": "Oh yeah definitely, they were extremely unique. I wish they had more screen time, I’m just pointing out the sociopathic tendencies of Orochimaru and also the fate a lot of supporting characters have in anime.",
                            "author": null,
                            "id": "imzdn3f",
                            "parent_id": "t1_imz7gm3",
                            "score": 11,
                            "created_utc": 1662243640.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Okay, I admit that you have valid points. The problem is that these 3 ninjas (especially Dosu and Zaku) could have been decent characters, because their jutsu was unique, and Dosu actually had talent and high intelligence. And they were far more memorable than the other characters Kishimito gave the \"fodder\" faith to. For example the Demon Brothers, the other 2 ninjas from Kabuto's team and Team Shigure weren't memorable, their jutsu just wasn't that special (unlike Dosu's Echo Drill).\nI know that Kishimoto created them to be fodder, but he just made them too memorable. Especially Dosu. \nAnd I'm not the only one who would want to see him continue his plot.",
            "author": "V4POR97",
            "id": "imz7gm3",
            "parent_id": "t1_imz53br",
            "score": 14,
            "created_utc": 1662240945.0,
            "replies": [
                {
                    "body": "Oh yeah definitely, they were extremely unique. I wish they had more screen time, I’m just pointing out the sociopathic tendencies of Orochimaru and also the fate a lot of supporting characters have in anime.",
                    "author": null,
                    "id": "imzdn3f",
                    "parent_id": "t1_imz7gm3",
                    "score": 11,
                    "created_utc": 1662243640.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh yeah definitely, they were extremely unique. I wish they had more screen time, I’m just pointing out the sociopathic tendencies of Orochimaru and also the fate a lot of supporting characters have in anime.",
            "author": null,
            "id": "imzdn3f",
            "parent_id": "t1_imz7gm3",
            "score": 11,
            "created_utc": 1662243640.0,
            "replies": []
        }
    ]
}