{
    "title": "23f. Very new and (very) nervous to sugar dating. A profile review would be HIGHLY appreciated. Thankss! 🙌🏼💖",
    "post_id": "ip7tm3",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ip7tm3/23f_very_new_and_very_nervous_to_sugar_dating_a/",
    "author": "careeradvicex",
    "body": "",
    "url": "https://www.reddit.com/gallery/ip7tm3",
    "score": 121,
    "upvote_ratio": 0.9,
    "created_utc": 1599619521.0,
    "num_comments": 63,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Girl, you're gorgeous! I feel like you look like what people think of when they think \"sugar baby\" (definitely wishing I had your face haha). Your profile looks pretty good to me, I didn't notice any glaring red flags on a first pass!",
            "author": "saccharinesweetheart",
            "id": "g4iemu7",
            "parent_id": "t3_ip7tm3",
            "score": 102,
            "created_utc": 1599620471.0,
            "replies": [
                {
                    "body": "Omg, right. This is the type of girl I imagine when sd’s talk about a 10/IG model.",
                    "author": "ImaginaryBullfrog5",
                    "id": "g4iewj0",
                    "parent_id": "t1_g4iemu7",
                    "score": 29,
                    "created_utc": 1599620630.0,
                    "replies": []
                },
                {
                    "body": "Thank you so much ❤️ that’s really sweet. I really hope my sugar experience goes well I am very nervous about meeting SDs haha",
                    "author": "careeradvicex",
                    "id": "g4ig07k",
                    "parent_id": "t1_g4iemu7",
                    "score": 24,
                    "created_utc": 1599621307.0,
                    "replies": [
                        {
                            "body": "You will get a lot of complements here and on the site ...   good luck",
                            "author": "shamloo77",
                            "id": "g4iloml",
                            "parent_id": "t1_g4ig07k",
                            "score": 11,
                            "created_utc": 1599624949.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g4iixm6",
                    "parent_id": "t1_g4iemu7",
                    "score": 3,
                    "created_utc": 1599623121.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g4ilxff",
                            "parent_id": "t1_g4iixm6",
                            "score": 3,
                            "created_utc": 1599625119.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g4imytu",
                                    "parent_id": "t1_g4ilxff",
                                    "score": 2,
                                    "created_utc": 1599625856.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "g4inxmy",
                                            "parent_id": "t1_g4imytu",
                                            "score": 16,
                                            "created_utc": 1599626564.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "My thoughts:\n\n* You're obviously very pretty, but your pics all have this vacant expression, like maybe you were focusing on holding still or something. Swap in a candid with a smile, or a laugh. Just to bring some life to the image. Something in a more casual outfit could help too - so the SD gets a sense of both fancy date night you and casual night in you. \n* I that what you're doing in the first couple of lines of your \"about me\" is a stylistic choice, but it's not my favorite. It comes off like it's over produced. \n* The second paragraph can be cut - everything you say about yourself there is true of 99% of people. It's better to cut stuff that doesn't do much for your profile. Keep it concise and impactful. \n* I would instead flesh out a few of the details you mention. Being in graphic design is super cool. Maybe talk about a recent job you did that was interesting? Or you say you're into fitness - what's your favorite forms of exercise? Maybe the POT is into it too and you two can connect over that. Just add a little more texture to the details of who you are as a person - help the reader get to know you a bit. \n* Your \"why me\" is all kinda redundant and/or pointless. Clearly you are fit and wear tight dresses - your pics show that. And it's better to let them come to the conclusion that you're bubbly and fun instead of just stating that you are. \n* I would cut a couple of the tags, just focus on the few that are most important to you. \n* Your \"seeking\" could actually use a lot more information. Your description of what you're looking for in the SR and in the SD are incredibly vague - any SD who reads it is going to think he fits the bill. Add some details that are useful - like are you looking for regular weekly meetings? Wanting something short term? Do you care if the SD is single or not? Just add something that actually filters some people out, so it attracts the ones you do want. \n* The \"i want allowance from the start\" bit is difficult. I assume you know it's difficult, otherwise you wouldn't need to state it on your profile, but maybe explain why allowance immediately is important to you? Just to calm the reader - because it's a scammer red flag as is. \n* The whole thing about needing a voice/video call doesn't need to be on your profile itself, that should be brought up in messages with people. Putting it out in front makes you seem bossy/demanding/etc. Just a negative vibe. \n* Ditch the \"no time wasters\". No one will ever read that and think \"oh, I'm a time waster, guess I shouldn't message her\". It's not going to have any impact on the quality of men you get messages from and it leaves a bad taste in the mouth as a closing line.",
            "author": "MASugarBaby",
            "id": "g4iff3s",
            "parent_id": "t3_ip7tm3",
            "score": 123,
            "created_utc": 1599620951.0,
            "replies": [
                {
                    "body": "Excellent critique.   Her profile will be fantastic.\n\nNow, I'll go back to the 95% of profiles that I read containing a single pic, 1 1/2 sentences written, and two tags checked.  I'll consider myself lucky if those two tags are not \"Luxury Lifestyle\" and \"Platonic.\"",
                    "author": "soicansaywhatiwant",
                    "id": "g4k7noq",
                    "parent_id": "t1_g4iff3s",
                    "score": 8,
                    "created_utc": 1599669713.0,
                    "replies": []
                },
                {
                    "body": "Sound advice except for one correction she didn't say she wants and allowance from the start. She said she wants someone who is open to discussing allowance with her from the start.",
                    "author": "LaSirene23",
                    "id": "g4ish71",
                    "parent_id": "t1_g4iff3s",
                    "score": 22,
                    "created_utc": 1599630200.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are truly a gorgeous woman, so you're going to get a lot of attention. The profile text is mostly fine, too, but I have a few pet peeves I will share with you:  \n\n\n* It's odd to describe your appearance when everyone has already seen the photos. You're hot and exotic? I agree, but you really don't have to say it. Either the person viewing already feels that way or they don't. The recounting of it therefore adds little\n* Addressing \"time wasters\" is I think very pointless. Time wasters don't care about wasting your time; they live for it. People who aren't going to waste your time are unlikely to view your request to be left alone by time wasters with a skeptical eye or worse. It's basically a totally fair thing for you to want, but the mentioning of it is almost counter to what you desire\n\nYou're again super lovely and you're going to get a ton of attention. And I wish you nothing but great fortune in the bowl. I would suggest you share some of the things that make you nervous here at SLF. Maybe we can help lower that fear factor.\n\nBest to you!",
            "author": "marker3000",
            "id": "g4ivvm1",
            "parent_id": "t3_ip7tm3",
            "score": 33,
            "created_utc": 1599633305.0,
            "replies": [
                {
                    "body": "Thank you so much! Yeah i've deleted those parts out. I also deleted the \"time wasters\" part out.  I think you're right, a time waster is not going to care.\n\n>You're again super lovely and you're going to get a ton of attention. And I wish you nothing but great fortune in the bowl. \n\nI am mostly nervous about meeting somebody who ends up being manipulative or abusive or even someone who doesn’t pay me. I've seen many articles about  some sugar horror stories and I hope my experiences will end up good. I need to read the wiki on this sub but if you have any tips I would appreciate it so much <3",
                    "author": "careeradvicex",
                    "id": "g4jlozm",
                    "parent_id": "t1_g4ivvm1",
                    "score": 2,
                    "created_utc": 1599658154.0,
                    "replies": [
                        {
                            "body": "It's safe to assume that there are manipulative and/or abusive types out there. And certainly people who won't give the promised allowances.\n\nThat said, I think if you (1) read here as you've planned! (2) ask good questions (3) use your judgment (4) move slowly... you're likely to be OK.",
                            "author": "marker3000",
                            "id": "g4l98m9",
                            "parent_id": "t1_g4jlozm",
                            "score": 1,
                            "created_utc": 1599688322.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Smile?",
            "author": "alittleagave",
            "id": "g4jzh82",
            "parent_id": "t3_ip7tm3",
            "score": 5,
            "created_utc": 1599665673.0,
            "replies": []
        },
        {
            "body": "Major, major, MAJOR problem with this profile. You are in London. I am not.\n\nDoesn't matter what your text says IMO, your pics will bring them running.\n\nGood luck.",
            "author": null,
            "id": "g4ihm6b",
            "parent_id": "t3_ip7tm3",
            "score": 27,
            "created_utc": 1599622290.0,
            "replies": []
        },
        {
            "body": "Get that paper gurl",
            "author": "mandingoBBC",
            "id": "g4ikeem",
            "parent_id": "t3_ip7tm3",
            "score": 7,
            "created_utc": 1599624071.0,
            "replies": []
        },
        {
            "body": "Good evening, your profile starts in a good place, so many of these comments are nibbling around the edges. I have a couple of issues that pop out just for me (as opposed to more general feedback), and I will try and flag those.\n\nPhotos: Overall great - your beautiful and show it off along with your figure - so you cover the most important thing. If you can add a photo showing a smile, that would make it pop a bit more for me.\n\nAbout me: As I said - it's good. I prefer things that are less general (your first two paragraphs are quite general). More specifics would help - to build a connection  around (what sorts of things we could do together - I get art ... but beyond that?). There are a couple of style things - the bullets are a negative for me - but not a major one. As for the Meyers-Briggs ... meh. I find that needs more context rather than being something useful in a profile (this is a personal preference as well).\n\nSeeking: The biggest thing here - the admonition for time wasters. No one thinks of themselves that way and most who fit that description will not pay attention/read this far. Get rid of the negativity. The phone/video call may cost you a decent POT or two, but if it's important, that is probably worthwhile.",
            "author": "sfwinefan",
            "id": "g4ieye7",
            "parent_id": "t3_ip7tm3",
            "score": 7,
            "created_utc": 1599620660.0,
            "replies": []
        },
        {
            "body": "Smile!! You're gorgeous and SDs can see that from your pics so I don't think you need to include that in your bio, it comes off self centered and a lot of guys will next you for it. Unfortunately you're so pretty I'm sure a lot of guys will next you for being a bot or a catfish too, so I'd maybe add some pics of you outside doing what you're interested in. Best of luck!",
            "author": "Kalypso_Starr",
            "id": "g4ka2rl",
            "parent_id": "t3_ip7tm3",
            "score": 3,
            "created_utc": 1599670873.0,
            "replies": []
        },
        {
            "body": "Just a tip, this forum can be pretty one dimensional  and probably isn’t going to be your best resource. Feel free to DM me if you want advice or have questions. 💖\n\nETA the advice you get from SB’s here will be good. It’s the SD’s on here that aren’t always the most helpful 😴",
            "author": "ashes2asscheeks",
            "id": "g4knc5x",
            "parent_id": "t3_ip7tm3",
            "score": 6,
            "created_utc": 1599677544.0,
            "replies": [
                {
                    "body": "EXACTLY! Cant believe these “SD” tools giving pages of negatives about ANYTHING about her. Seems like they get off putting down a woman who is galaxies out of their league! Turns my stomach.\n\nSeriously she’d do great just slapping up a couple photos and leaving it all blank if she’s good at screening the responses flooding in. Lol",
                    "author": "usernamechecksout4u",
                    "id": "g4kro24",
                    "parent_id": "t1_g4knc5x",
                    "score": 7,
                    "created_utc": 1599679650.0,
                    "replies": [
                        {
                            "body": "I’m waiting for my dozen or so downvotes now 😌",
                            "author": "ashes2asscheeks",
                            "id": "g4krvze",
                            "parent_id": "t1_g4kro24",
                            "score": 3,
                            "created_utc": 1599679758.0,
                            "replies": [
                                {
                                    "body": "😂😂😂 I hear ya!\n\nI commented one time (only time) on one of the other sugar subs. It was extremely polite and totally noncontroversial but I got a ton of upvotes and the guy kicked me off the sub for getting upvoted. Not even in my control. Like I care about up or down votes! 😳 🍤 lol",
                                    "author": "usernamechecksout4u",
                                    "id": "g4ksckz",
                                    "parent_id": "t1_g4krvze",
                                    "score": 3,
                                    "created_utc": 1599679981.0,
                                    "replies": [
                                        {
                                            "body": "Oh yeah I heard the other one is even worse than this one lmao",
                                            "author": "ashes2asscheeks",
                                            "id": "g4ksibn",
                                            "parent_id": "t1_g4ksckz",
                                            "score": 1,
                                            "created_utc": 1599680062.0,
                                            "replies": [
                                                {
                                                    "body": "This one has extremes but also reasonable people in the middle of both sides (misogynistic vs man-bashing) but THAT sub...\nOmg. I can’t believe it’s allowed; it’s truly hateful. The guy squashes any hint of other opinion and he’s flat out toxic himself.\n\nAnyway, not to hijack her thread just a warning to take SD advice with a grain of salt.",
                                                    "author": "usernamechecksout4u",
                                                    "id": "g4ksy88",
                                                    "parent_id": "t1_g4ksibn",
                                                    "score": 2,
                                                    "created_utc": 1599680276.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Girl you are stunning! You’re gonna have ALL the SD’s!! 💕",
            "author": null,
            "id": "g4jby3b",
            "parent_id": "t3_ip7tm3",
            "score": 2,
            "created_utc": 1599650947.0,
            "replies": [
                {
                    "body": "Thankyou! You’re gorgeous too btw :)",
                    "author": "careeradvicex",
                    "id": "g4jiemo",
                    "parent_id": "t1_g4jby3b",
                    "score": 1,
                    "created_utc": 1599656015.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Drop dead gorgeous, no mention of wanting to be platonic.  You are golden.",
            "author": null,
            "id": "g4kkmv5",
            "parent_id": "t3_ip7tm3",
            "score": 2,
            "created_utc": 1599676220.0,
            "replies": []
        },
        {
            "body": "I suppose it depends on what type of arrangement you’re looking for, but if you want to spend time hanging out together outside of intimacy maybe post a pic without as much makeup. It’s beautifully done, but if you’re a natural beauty I think that counts for a lot.\n\nIt’s pretty familiar refrain here that SBs don’t look like their photos IRL. A no makeup shot would help that.",
            "author": "InnerRadio7",
            "id": "g4lnec6",
            "parent_id": "t3_ip7tm3",
            "score": 2,
            "created_utc": 1599695380.0,
            "replies": []
        },
        {
            "body": "You're an attractive woman, and just my type. I would contact you just based on that, but would hope you are also the type of woman I look for too.\n\nhere are a few notes about your profile...\n\n* Profile Tags - I tend to avoid women that use the LIFE of Leisure Tag. t says to me, you are looking to live entirely off of me and be dependent on me like a Trophy Wife\n* Photos - all of your photos have the model look that looks like you're an empty vessel, with no warmth, personality or soul. Throw in a few non model photos in more candid shots, and preferably at least 1or 2 with a smile.\n* ABOUT ME: Does a pretty good job of describing you and your personality, but hasn't really done anything to tell me as a SD what qualities are going to be desirable to him:. Things I look for (affectionate, sensual, romantic, fun loving, easy going, appreciative, etc)\n* SEEKING: This section should be used to describe the type of relationship we will have. You're profile neither implies or even makes reference to this being a physical relationship. We have no idea whether you're looking to be a platonic princess, have NSA hotel sex, be more like friends w/ benefits, or be a sugar girlfriend sugar relationship. If you're open to any or all of these things, it would be a good idea to mention which ones. If you're only open to one of these things, it would be an even better idea to mention which one specifically..!  A good Seeking section tells an SD exactly the type of SR you want, the types of connections preferred (emotional, mental, physical), it also gives us a window into what a SR might be with you. Be more descriptive.. will we be dancing the night away, and then running away on romantic weekends, will we be dinning out, and then whisking away to fancy hotels, or will we be spending days outdoors, then retiring inside to eat some good food by the fire, drinking wine together, having great conversations mixed in with copious amounts of flirting, and teasing...?\n\nI know many attractive women your age haven't really given it much thought what they can do to enhance a SD's life. Most attractive women haven't had to work on such things in their vanilla life, because 100's of thirsty guys on Dating Apps and Bars thrown themselves at her, so she hasn't had to give it much thought as to what she brings to the table, because her good looks or intelligence. My suggestion is to sit down and honestly assess yourself, what qualities do you possess that would be desirable to a man, especially a man with money that can have his choice of women because he's giving an allowance.",
            "author": "ruphun",
            "id": "g4jaazq",
            "parent_id": "t3_ip7tm3",
            "score": 8,
            "created_utc": 1599649379.0,
            "replies": [
                {
                    "body": "THis is SO good.    \n\n\nTo the SB - you are TOTALLY my type.  I love Esmeralda Gypsy types.  But your pictures and profiles scream that I will be little more than an ATM.  That isn't good and won't work (emotionally) if you really are new and scared.  \n\n\nI am not going to tell you which picture to dump for it (maybe none) but I want 1 or 2 pictures of you being a goofball.  Drinking a pint with friends.  You cheering (without makeup) for M United  or whomever you like.    \n\n\nFOr the seeking you mention \"Exploring London\".  Well what?  Do you want your SD to take you on a pub crawl?  Kensington Gardens?  Walk the Themes at sunset?  Show you his favorite gallery at the Tate and explain to you why?   Take the train out to Greenwich for the day and spoil you over tea and then take you back to his flat and find out all the neat uses of cream and strawberries (you can leave that out).   And by telling him that (and then talking about it in chat) you can quickly start to screen the posers and bad actors from others.  \n\n\nAs others have said, you need to get rid of the allowance.  Others will have been words to suggest.  \n\n\nAs someone in search AND attracted to your type I would pass.  Something in the back of my mind would scream  that I would get eaten up, spit out, and never a glance back.  I( have been passing on MANY like this.  The challenge as a beautiful girl is showing that other side of you - if you DON\"T just want to be valued for your looks alone what else?  And if you can't answer this question just now  it isn't a problem.  Instead answer what do you hope to LEARN from an SD that further rounds you out?  \n\n\nHope this helps.  One guys opinion and a N of 1 for market research.",
                    "author": null,
                    "id": "g4ksygf",
                    "parent_id": "t1_g4jaazq",
                    "score": -2,
                    "created_utc": 1599680279.0,
                    "replies": [
                        {
                            "body": "She’s my type too, but unfortunately after meeting several like her I felt like nothing more then a personal ATM, and didn’t feel like she was there for me.",
                            "author": "ruphun",
                            "id": "g4kty83",
                            "parent_id": "t1_g4ksygf",
                            "score": 0,
                            "created_utc": 1599680768.0,
                            "replies": [
                                {
                                    "body": "Plus many. After a GREAT S&M ( I wrote it up)  I just want to scream at some many of these girls about the emotional intangible parts of this that are critical.  The she has such a great smile, holds a conversation (if not really the questioning type) and shares enough interests that I know we would have fun.  Once you start meeting THOSE you figure out how to make things work in the bowl.  \n\nThanks for reaching out.  The hardest thing about this is that you can't really talk to ANYONE about the bowl.",
                                    "author": null,
                                    "id": "g4kx9yi",
                                    "parent_id": "t1_g4kty83",
                                    "score": 0,
                                    "created_utc": 1599682420.0,
                                    "replies": [
                                        {
                                            "body": "The problem is they approach this like vanilla dating and most have no idea what they can offer other than their looks, or body. \n\nQuite unfortunate many haven’t learned yet what it takes to please a man or to keep him happy. We’re really simple creatures. Give me some attention, affection & appreciation and I’ll bend over backwards to make you happy. Instead they do the bare minimum & expect the world with their handout",
                                            "author": "ruphun",
                                            "id": "g4kxsza",
                                            "parent_id": "t1_g4kx9yi",
                                            "score": 0,
                                            "created_utc": 1599682678.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah.....and I don't think they get that we have been around the block (or twice) and what that means.....(or for me)\n\nA)  We KNOW we do not look like we did at 30.  We accept that.  We understand that our success has other intangible rewards\nB)  We don't want a divorcee.  We know plenty.  That sounds AWFUL.\nC)  We may be married.  We are not leaving her.  Lots of reasons.  It very much is a 19th century mistriss moment.\nD)  But we want to feel fun and special and appreciated.  Since most of us are required to have very high BS meters to hold onto our success we can't really be conned over the long term.",
                                                    "author": null,
                                                    "id": "g4l0cd8",
                                                    "parent_id": "t1_g4kxsza",
                                                    "score": 0,
                                                    "created_utc": 1599683773.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4inplw",
            "parent_id": "t3_ip7tm3",
            "score": 4,
            "created_utc": 1599626401.0,
            "replies": []
        },
        {
            "body": "Profile is well done. Beautiful Lady. My only issue is London does not have 5G yet? Thats a hard no for me. Lol, J/K",
            "author": "FoolishTimes",
            "id": "g4jq8dk",
            "parent_id": "t3_ip7tm3",
            "score": 1,
            "created_utc": 1599660831.0,
            "replies": []
        },
        {
            "body": "I read your other posts of your insecurities because men sometimes dont compliment. I never cared. They usually wanted ro meet again. Some said compliments some felt it was unnecessary. When they ask for another date they cleary are into you 🙂\n\nAnd some are too shy/ proud/ or like feel \"lame\" because they think u would get tired of hearing ur pretty all the time. I have been told that.\nSometimes they don't wanna be \"unoriginal\" like the other guys lol. Im serious. You're absolutely beautiful, wether they say it or not. Dont forget that a lot men on there sre pretty nervous and shy too.\n\nAnd i bet you will make them fall in love even more with your personality etc. Don't worry at all for your looks. Believe me. Ur perfect.",
            "author": "ThatDangerousWoman",
            "id": "g4juanm",
            "parent_id": "t3_ip7tm3",
            "score": 1,
            "created_utc": 1599663016.0,
            "replies": [
                {
                    "body": "Thanks! Also Yeah I suffer from BDD and my self worth can be pretty fragile. I only feel good about myself if a man compliments me or gives me signals on dates. Which is another reason I’m hesitant about giving  the sugar dating a go if I’m not 100% in a great mental place at this moment? And dont want to come across  non-legit men or manipulative psychopaths on SA who may enhance these insecurities. But at the same time, I’m only 23 once 😅 so I may as well give it a shot",
                    "author": "careeradvicex",
                    "id": "g4jvtxe",
                    "parent_id": "t1_g4juanm",
                    "score": 4,
                    "created_utc": 1599663812.0,
                    "replies": [
                        {
                            "body": "You need to be careful tbh because \n\n>And dont want to come across  non-legit men or manipulative psychopaths on SA who may enhance these insecurities\n\nis 110% a given. If possible, make some SB friends who you can debrief with and laugh about shitty experiences/ comments with so you don't internalise them.",
                            "author": "blonde-throwaway",
                            "id": "g4k14ed",
                            "parent_id": "t1_g4jvtxe",
                            "score": 5,
                            "created_utc": 1599666498.0,
                            "replies": [
                                {
                                    "body": "That’s a great suggestion. Where can I find SB friends apart from reddit? :) It would be nice to meet other Sbs maybe like discord community or fb group or something",
                                    "author": "careeradvicex",
                                    "id": "g4qdf3m",
                                    "parent_id": "t1_g4k14ed",
                                    "score": 3,
                                    "created_utc": 1599765919.0,
                                    "replies": []
                                },
                                {
                                    "body": "Great advice!!!",
                                    "author": "ashes2asscheeks",
                                    "id": "g4kntxt",
                                    "parent_id": "t1_g4k14ed",
                                    "score": 1,
                                    "created_utc": 1599677783.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "you had me at the eyes a great profile and good luck",
            "author": "Tongueready",
            "id": "g4kbhjk",
            "parent_id": "t3_ip7tm3",
            "score": 1,
            "created_utc": 1599671560.0,
            "replies": []
        },
        {
            "body": "Come to the USA!",
            "author": "larvan3",
            "id": "g4kmb6l",
            "parent_id": "t3_ip7tm3",
            "score": 1,
            "created_utc": 1599677043.0,
            "replies": []
        },
        {
            "body": "You don’t need to change a thing! Seriously perfect profile. I am also an ENFP. I’ve always thought two ENFPs would spell relationship disaster.",
            "author": "SouthernGentSD",
            "id": "g4l8ou3",
            "parent_id": "t3_ip7tm3",
            "score": 1,
            "created_utc": 1599688034.0,
            "replies": []
        },
        {
            "body": "You’re hot af",
            "author": "UnearthlyDinosaur",
            "id": "g4mg2jc",
            "parent_id": "t3_ip7tm3",
            "score": 1,
            "created_utc": 1599711593.0,
            "replies": []
        },
        {
            "body": "This is a tiny thing, and as all have said you are gorgeously fair, but it should be \"who loves to go to the gym\". Small typo for certain, but you did ask for anything. As you might guess, my employment has to do with the devil existing inside details. Best of luck, wish you were across the pond.;)",
            "author": "SDInLeather",
            "id": "g4rirn0",
            "parent_id": "t3_ip7tm3",
            "score": 1,
            "created_utc": 1599777587.0,
            "replies": []
        },
        {
            "body": "\"Will listen \\[..\\] over a glass of prosecco\"\n\nMy suggestion would be to change this to \"over a nice dinner at a 5-michelin star restaurant- socially distanced of course!\"",
            "author": "WaitWaitHeart",
            "id": "g5rq8pm",
            "parent_id": "t3_ip7tm3",
            "score": 1,
            "created_utc": 1600480656.0,
            "replies": []
        },
        {
            "body": "My god you are perfect. You will be first in line on every SD's wish list.",
            "author": "SugarGuyAround",
            "id": "g6llq9l",
            "parent_id": "t3_ip7tm3",
            "score": 1,
            "created_utc": 1601086152.0,
            "replies": []
        },
        {
            "body": "Wish you lived in my city",
            "author": "snakeeyes24",
            "id": "g4jpg11",
            "parent_id": "t3_ip7tm3",
            "score": 1,
            "created_utc": 1599660381.0,
            "replies": []
        },
        {
            "body": "Haters will say ur fake haha.  Ur too beautiful. \nU will get many many guys to literally give u everything in the same second. \nBe safe 💛 100% perfect everything and ur bio too",
            "author": "ThatDangerousWoman",
            "id": "g4jtamc",
            "parent_id": "t3_ip7tm3",
            "score": 1,
            "created_utc": 1599662495.0,
            "replies": []
        },
        {
            "body": "You’re so pretty 😍😍",
            "author": null,
            "id": "g4k31wp",
            "parent_id": "t3_ip7tm3",
            "score": 1,
            "created_utc": 1599667457.0,
            "replies": []
        },
        {
            "body": "moving to england",
            "author": "amigodeface",
            "id": "g4kfoxy",
            "parent_id": "t3_ip7tm3",
            "score": 1,
            "created_utc": 1599673741.0,
            "replies": []
        },
        {
            "body": "The demand for a phone call/video chat will drive away a lot of guys. Blackmail is a thing, and a phone call or video chat ending up on youtube or in a guy's wifes hands, etc... Theres no deniability for that. I'd pass.",
            "author": "CaptainUltraObvious",
            "id": "g4idunk",
            "parent_id": "t3_ip7tm3",
            "score": 0,
            "created_utc": 1599620004.0,
            "replies": [
                {
                    "body": "That's odd, I've actually had a lot of POTs ask for a phone call to see if we're compatible. I don't think it's something that would rule people out if they're legit!",
                    "author": "saccharinesweetheart",
                    "id": "g4iecwa",
                    "parent_id": "t1_g4idunk",
                    "score": 5,
                    "created_utc": 1599620301.0,
                    "replies": [
                        {
                            "body": "That you've had pots ask for it doesnt mean its not something most wouldnt avoid. There was a poll here on it a while back, something like 2/3 said hell no to video chat.\n\nTen percent of guys might be into pegging, but a solid 80% will run if you pull out a strap on. Dont assume all guys want the same thing.",
                            "author": "CaptainUltraObvious",
                            "id": "g4if3r0",
                            "parent_id": "t1_g4iecwa",
                            "score": 1,
                            "created_utc": 1599620752.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Is it worth saying that it’s not a nessecity but it is very much preferred? It’s maybe better to speak on call to ensure neither of us waste each others time and weeding out the scammers",
                    "author": "careeradvicex",
                    "id": "g4ifyi9",
                    "parent_id": "t1_g4idunk",
                    "score": 5,
                    "created_utc": 1599621279.0,
                    "replies": [
                        {
                            "body": "Saying that its only a preference would be good.\n\nI'm not sure what you expect to filter for with a phone call to be honest. Scammers, johns, etc all have phones too. In terms of discussing allowance, ppm etc, all that can be done through a messaging app.",
                            "author": "CaptainUltraObvious",
                            "id": "g4igfzg",
                            "parent_id": "t1_g4ifyi9",
                            "score": -1,
                            "created_utc": 1599621568.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g4inxto",
                    "parent_id": "t1_g4idunk",
                    "score": 5,
                    "created_utc": 1599626567.0,
                    "replies": [
                        {
                            "body": "Fair.\n\nBut if she's looking for someone high value, well most of them want discretion and value reputation. So she's just filtering out all the richest men.",
                            "author": "CaptainUltraObvious",
                            "id": "g4iokal",
                            "parent_id": "t1_g4inxto",
                            "score": -2,
                            "created_utc": 1599627036.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g4iotg7",
                                    "parent_id": "t1_g4iokal",
                                    "score": 5,
                                    "created_utc": 1599627227.0,
                                    "replies": [
                                        {
                                            "body": "Her post history includes FDS, its a safe bet she's looking to date the richest guys she can find. I'll say it again, the richest guys wont video chat.",
                                            "author": "CaptainUltraObvious",
                                            "id": "g4ipe3c",
                                            "parent_id": "t1_g4iotg7",
                                            "score": -1,
                                            "created_utc": 1599627661.0,
                                            "replies": [
                                                {
                                                    "body": "What does FDS mean?",
                                                    "author": "usernamechecksout4u",
                                                    "id": "g4j773f",
                                                    "parent_id": "t1_g4ipe3c",
                                                    "score": 2,
                                                    "created_utc": 1599646093.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "They also don't want anyone from FDS...",
                                                    "author": "Josiah85",
                                                    "id": "g4iptek",
                                                    "parent_id": "t1_g4ipe3c",
                                                    "score": -5,
                                                    "created_utc": 1599627991.0,
                                                    "replies": [
                                                        {
                                                            "body": "I guess we should be telling her to insist on it then.",
                                                            "author": "CaptainUltraObvious",
                                                            "id": "g4ipyd5",
                                                            "parent_id": "t1_g4iptek",
                                                            "score": -1,
                                                            "created_utc": 1599628099.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "g4iqd9n",
                                                            "parent_id": "t1_g4iptek",
                                                            "score": -4,
                                                            "created_utc": 1599628431.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "g4oxdq8",
                                                                    "parent_id": "t1_g4iqd9n",
                                                                    "score": 1,
                                                                    "created_utc": 1599750480.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "g4pnhod",
                                                                            "parent_id": "t1_g4oxdq8",
                                                                            "score": 1,
                                                                            "created_utc": 1599758904.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "g4pnpao",
                                                                                    "parent_id": "t1_g4pnhod",
                                                                                    "score": 1,
                                                                                    "created_utc": 1599758992.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Demand for a phone call/video chat is fantastic and makes her profile REAL ...  She has to have it in her profile ...",
                    "author": "shamloo77",
                    "id": "g4ilvg4",
                    "parent_id": "t1_g4idunk",
                    "score": 3,
                    "created_utc": 1599625081.0,
                    "replies": []
                },
                {
                    "body": "Actually, disagree. A quick video chat is the best way to make sure you're not getting scammed, the person is the person in the picture, and both parties are actually serious.\n\nIf an SD reveals so much info a quick 30 second fuzzy video chat can be traced back to him, thats completely his fault.\n\nFrom the SD sides, it helps save a ton of time.",
                    "author": null,
                    "id": "g4j4lhf",
                    "parent_id": "t1_g4idunk",
                    "score": 4,
                    "created_utc": 1599643041.0,
                    "replies": []
                },
                {
                    "body": ">[Blackmail is a thing](https://www.reddit.com/r/sugarlifestyleforum/comments/ht2m92/sds_how_many_times_in_total_have_you_been/)",
                    "author": "TY2022",
                    "id": "g4j2aow",
                    "parent_id": "t1_g4idunk",
                    "score": 0,
                    "created_utc": 1599640282.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Omg, right. This is the type of girl I imagine when sd’s talk about a 10/IG model.",
            "author": "ImaginaryBullfrog5",
            "id": "g4iewj0",
            "parent_id": "t1_g4iemu7",
            "score": 29,
            "created_utc": 1599620630.0,
            "replies": []
        },
        {
            "body": "Thank you so much ❤️ that’s really sweet. I really hope my sugar experience goes well I am very nervous about meeting SDs haha",
            "author": "careeradvicex",
            "id": "g4ig07k",
            "parent_id": "t1_g4iemu7",
            "score": 24,
            "created_utc": 1599621307.0,
            "replies": [
                {
                    "body": "You will get a lot of complements here and on the site ...   good luck",
                    "author": "shamloo77",
                    "id": "g4iloml",
                    "parent_id": "t1_g4ig07k",
                    "score": 11,
                    "created_utc": 1599624949.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4iixm6",
            "parent_id": "t1_g4iemu7",
            "score": 3,
            "created_utc": 1599623121.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g4ilxff",
                    "parent_id": "t1_g4iixm6",
                    "score": 3,
                    "created_utc": 1599625119.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g4imytu",
                            "parent_id": "t1_g4ilxff",
                            "score": 2,
                            "created_utc": 1599625856.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g4inxmy",
                                    "parent_id": "t1_g4imytu",
                                    "score": 16,
                                    "created_utc": 1599626564.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Excellent critique.   Her profile will be fantastic.\n\nNow, I'll go back to the 95% of profiles that I read containing a single pic, 1 1/2 sentences written, and two tags checked.  I'll consider myself lucky if those two tags are not \"Luxury Lifestyle\" and \"Platonic.\"",
            "author": "soicansaywhatiwant",
            "id": "g4k7noq",
            "parent_id": "t1_g4iff3s",
            "score": 8,
            "created_utc": 1599669713.0,
            "replies": []
        },
        {
            "body": "Sound advice except for one correction she didn't say she wants and allowance from the start. She said she wants someone who is open to discussing allowance with her from the start.",
            "author": "LaSirene23",
            "id": "g4ish71",
            "parent_id": "t1_g4iff3s",
            "score": 22,
            "created_utc": 1599630200.0,
            "replies": []
        },
        {
            "body": "Thank you so much! Yeah i've deleted those parts out. I also deleted the \"time wasters\" part out.  I think you're right, a time waster is not going to care.\n\n>You're again super lovely and you're going to get a ton of attention. And I wish you nothing but great fortune in the bowl. \n\nI am mostly nervous about meeting somebody who ends up being manipulative or abusive or even someone who doesn’t pay me. I've seen many articles about  some sugar horror stories and I hope my experiences will end up good. I need to read the wiki on this sub but if you have any tips I would appreciate it so much <3",
            "author": "careeradvicex",
            "id": "g4jlozm",
            "parent_id": "t1_g4ivvm1",
            "score": 2,
            "created_utc": 1599658154.0,
            "replies": [
                {
                    "body": "It's safe to assume that there are manipulative and/or abusive types out there. And certainly people who won't give the promised allowances.\n\nThat said, I think if you (1) read here as you've planned! (2) ask good questions (3) use your judgment (4) move slowly... you're likely to be OK.",
                    "author": "marker3000",
                    "id": "g4l98m9",
                    "parent_id": "t1_g4jlozm",
                    "score": 1,
                    "created_utc": 1599688322.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "EXACTLY! Cant believe these “SD” tools giving pages of negatives about ANYTHING about her. Seems like they get off putting down a woman who is galaxies out of their league! Turns my stomach.\n\nSeriously she’d do great just slapping up a couple photos and leaving it all blank if she’s good at screening the responses flooding in. Lol",
            "author": "usernamechecksout4u",
            "id": "g4kro24",
            "parent_id": "t1_g4knc5x",
            "score": 7,
            "created_utc": 1599679650.0,
            "replies": [
                {
                    "body": "I’m waiting for my dozen or so downvotes now 😌",
                    "author": "ashes2asscheeks",
                    "id": "g4krvze",
                    "parent_id": "t1_g4kro24",
                    "score": 3,
                    "created_utc": 1599679758.0,
                    "replies": [
                        {
                            "body": "😂😂😂 I hear ya!\n\nI commented one time (only time) on one of the other sugar subs. It was extremely polite and totally noncontroversial but I got a ton of upvotes and the guy kicked me off the sub for getting upvoted. Not even in my control. Like I care about up or down votes! 😳 🍤 lol",
                            "author": "usernamechecksout4u",
                            "id": "g4ksckz",
                            "parent_id": "t1_g4krvze",
                            "score": 3,
                            "created_utc": 1599679981.0,
                            "replies": [
                                {
                                    "body": "Oh yeah I heard the other one is even worse than this one lmao",
                                    "author": "ashes2asscheeks",
                                    "id": "g4ksibn",
                                    "parent_id": "t1_g4ksckz",
                                    "score": 1,
                                    "created_utc": 1599680062.0,
                                    "replies": [
                                        {
                                            "body": "This one has extremes but also reasonable people in the middle of both sides (misogynistic vs man-bashing) but THAT sub...\nOmg. I can’t believe it’s allowed; it’s truly hateful. The guy squashes any hint of other opinion and he’s flat out toxic himself.\n\nAnyway, not to hijack her thread just a warning to take SD advice with a grain of salt.",
                                            "author": "usernamechecksout4u",
                                            "id": "g4ksy88",
                                            "parent_id": "t1_g4ksibn",
                                            "score": 2,
                                            "created_utc": 1599680276.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thankyou! You’re gorgeous too btw :)",
            "author": "careeradvicex",
            "id": "g4jiemo",
            "parent_id": "t1_g4jby3b",
            "score": 1,
            "created_utc": 1599656015.0,
            "replies": []
        },
        {
            "body": "THis is SO good.    \n\n\nTo the SB - you are TOTALLY my type.  I love Esmeralda Gypsy types.  But your pictures and profiles scream that I will be little more than an ATM.  That isn't good and won't work (emotionally) if you really are new and scared.  \n\n\nI am not going to tell you which picture to dump for it (maybe none) but I want 1 or 2 pictures of you being a goofball.  Drinking a pint with friends.  You cheering (without makeup) for M United  or whomever you like.    \n\n\nFOr the seeking you mention \"Exploring London\".  Well what?  Do you want your SD to take you on a pub crawl?  Kensington Gardens?  Walk the Themes at sunset?  Show you his favorite gallery at the Tate and explain to you why?   Take the train out to Greenwich for the day and spoil you over tea and then take you back to his flat and find out all the neat uses of cream and strawberries (you can leave that out).   And by telling him that (and then talking about it in chat) you can quickly start to screen the posers and bad actors from others.  \n\n\nAs others have said, you need to get rid of the allowance.  Others will have been words to suggest.  \n\n\nAs someone in search AND attracted to your type I would pass.  Something in the back of my mind would scream  that I would get eaten up, spit out, and never a glance back.  I( have been passing on MANY like this.  The challenge as a beautiful girl is showing that other side of you - if you DON\"T just want to be valued for your looks alone what else?  And if you can't answer this question just now  it isn't a problem.  Instead answer what do you hope to LEARN from an SD that further rounds you out?  \n\n\nHope this helps.  One guys opinion and a N of 1 for market research.",
            "author": null,
            "id": "g4ksygf",
            "parent_id": "t1_g4jaazq",
            "score": -2,
            "created_utc": 1599680279.0,
            "replies": [
                {
                    "body": "She’s my type too, but unfortunately after meeting several like her I felt like nothing more then a personal ATM, and didn’t feel like she was there for me.",
                    "author": "ruphun",
                    "id": "g4kty83",
                    "parent_id": "t1_g4ksygf",
                    "score": 0,
                    "created_utc": 1599680768.0,
                    "replies": [
                        {
                            "body": "Plus many. After a GREAT S&M ( I wrote it up)  I just want to scream at some many of these girls about the emotional intangible parts of this that are critical.  The she has such a great smile, holds a conversation (if not really the questioning type) and shares enough interests that I know we would have fun.  Once you start meeting THOSE you figure out how to make things work in the bowl.  \n\nThanks for reaching out.  The hardest thing about this is that you can't really talk to ANYONE about the bowl.",
                            "author": null,
                            "id": "g4kx9yi",
                            "parent_id": "t1_g4kty83",
                            "score": 0,
                            "created_utc": 1599682420.0,
                            "replies": [
                                {
                                    "body": "The problem is they approach this like vanilla dating and most have no idea what they can offer other than their looks, or body. \n\nQuite unfortunate many haven’t learned yet what it takes to please a man or to keep him happy. We’re really simple creatures. Give me some attention, affection & appreciation and I’ll bend over backwards to make you happy. Instead they do the bare minimum & expect the world with their handout",
                                    "author": "ruphun",
                                    "id": "g4kxsza",
                                    "parent_id": "t1_g4kx9yi",
                                    "score": 0,
                                    "created_utc": 1599682678.0,
                                    "replies": [
                                        {
                                            "body": "Yeah.....and I don't think they get that we have been around the block (or twice) and what that means.....(or for me)\n\nA)  We KNOW we do not look like we did at 30.  We accept that.  We understand that our success has other intangible rewards\nB)  We don't want a divorcee.  We know plenty.  That sounds AWFUL.\nC)  We may be married.  We are not leaving her.  Lots of reasons.  It very much is a 19th century mistriss moment.\nD)  But we want to feel fun and special and appreciated.  Since most of us are required to have very high BS meters to hold onto our success we can't really be conned over the long term.",
                                            "author": null,
                                            "id": "g4l0cd8",
                                            "parent_id": "t1_g4kxsza",
                                            "score": 0,
                                            "created_utc": 1599683773.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks! Also Yeah I suffer from BDD and my self worth can be pretty fragile. I only feel good about myself if a man compliments me or gives me signals on dates. Which is another reason I’m hesitant about giving  the sugar dating a go if I’m not 100% in a great mental place at this moment? And dont want to come across  non-legit men or manipulative psychopaths on SA who may enhance these insecurities. But at the same time, I’m only 23 once 😅 so I may as well give it a shot",
            "author": "careeradvicex",
            "id": "g4jvtxe",
            "parent_id": "t1_g4juanm",
            "score": 4,
            "created_utc": 1599663812.0,
            "replies": [
                {
                    "body": "You need to be careful tbh because \n\n>And dont want to come across  non-legit men or manipulative psychopaths on SA who may enhance these insecurities\n\nis 110% a given. If possible, make some SB friends who you can debrief with and laugh about shitty experiences/ comments with so you don't internalise them.",
                    "author": "blonde-throwaway",
                    "id": "g4k14ed",
                    "parent_id": "t1_g4jvtxe",
                    "score": 5,
                    "created_utc": 1599666498.0,
                    "replies": [
                        {
                            "body": "That’s a great suggestion. Where can I find SB friends apart from reddit? :) It would be nice to meet other Sbs maybe like discord community or fb group or something",
                            "author": "careeradvicex",
                            "id": "g4qdf3m",
                            "parent_id": "t1_g4k14ed",
                            "score": 3,
                            "created_utc": 1599765919.0,
                            "replies": []
                        },
                        {
                            "body": "Great advice!!!",
                            "author": "ashes2asscheeks",
                            "id": "g4kntxt",
                            "parent_id": "t1_g4k14ed",
                            "score": 1,
                            "created_utc": 1599677783.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's odd, I've actually had a lot of POTs ask for a phone call to see if we're compatible. I don't think it's something that would rule people out if they're legit!",
            "author": "saccharinesweetheart",
            "id": "g4iecwa",
            "parent_id": "t1_g4idunk",
            "score": 5,
            "created_utc": 1599620301.0,
            "replies": [
                {
                    "body": "That you've had pots ask for it doesnt mean its not something most wouldnt avoid. There was a poll here on it a while back, something like 2/3 said hell no to video chat.\n\nTen percent of guys might be into pegging, but a solid 80% will run if you pull out a strap on. Dont assume all guys want the same thing.",
                    "author": "CaptainUltraObvious",
                    "id": "g4if3r0",
                    "parent_id": "t1_g4iecwa",
                    "score": 1,
                    "created_utc": 1599620752.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Is it worth saying that it’s not a nessecity but it is very much preferred? It’s maybe better to speak on call to ensure neither of us waste each others time and weeding out the scammers",
            "author": "careeradvicex",
            "id": "g4ifyi9",
            "parent_id": "t1_g4idunk",
            "score": 5,
            "created_utc": 1599621279.0,
            "replies": [
                {
                    "body": "Saying that its only a preference would be good.\n\nI'm not sure what you expect to filter for with a phone call to be honest. Scammers, johns, etc all have phones too. In terms of discussing allowance, ppm etc, all that can be done through a messaging app.",
                    "author": "CaptainUltraObvious",
                    "id": "g4igfzg",
                    "parent_id": "t1_g4ifyi9",
                    "score": -1,
                    "created_utc": 1599621568.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4inxto",
            "parent_id": "t1_g4idunk",
            "score": 5,
            "created_utc": 1599626567.0,
            "replies": [
                {
                    "body": "Fair.\n\nBut if she's looking for someone high value, well most of them want discretion and value reputation. So she's just filtering out all the richest men.",
                    "author": "CaptainUltraObvious",
                    "id": "g4iokal",
                    "parent_id": "t1_g4inxto",
                    "score": -2,
                    "created_utc": 1599627036.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g4iotg7",
                            "parent_id": "t1_g4iokal",
                            "score": 5,
                            "created_utc": 1599627227.0,
                            "replies": [
                                {
                                    "body": "Her post history includes FDS, its a safe bet she's looking to date the richest guys she can find. I'll say it again, the richest guys wont video chat.",
                                    "author": "CaptainUltraObvious",
                                    "id": "g4ipe3c",
                                    "parent_id": "t1_g4iotg7",
                                    "score": -1,
                                    "created_utc": 1599627661.0,
                                    "replies": [
                                        {
                                            "body": "What does FDS mean?",
                                            "author": "usernamechecksout4u",
                                            "id": "g4j773f",
                                            "parent_id": "t1_g4ipe3c",
                                            "score": 2,
                                            "created_utc": 1599646093.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "They also don't want anyone from FDS...",
                                            "author": "Josiah85",
                                            "id": "g4iptek",
                                            "parent_id": "t1_g4ipe3c",
                                            "score": -5,
                                            "created_utc": 1599627991.0,
                                            "replies": [
                                                {
                                                    "body": "I guess we should be telling her to insist on it then.",
                                                    "author": "CaptainUltraObvious",
                                                    "id": "g4ipyd5",
                                                    "parent_id": "t1_g4iptek",
                                                    "score": -1,
                                                    "created_utc": 1599628099.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "g4iqd9n",
                                                    "parent_id": "t1_g4iptek",
                                                    "score": -4,
                                                    "created_utc": 1599628431.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "g4oxdq8",
                                                            "parent_id": "t1_g4iqd9n",
                                                            "score": 1,
                                                            "created_utc": 1599750480.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "g4pnhod",
                                                                    "parent_id": "t1_g4oxdq8",
                                                                    "score": 1,
                                                                    "created_utc": 1599758904.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "g4pnpao",
                                                                            "parent_id": "t1_g4pnhod",
                                                                            "score": 1,
                                                                            "created_utc": 1599758992.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Demand for a phone call/video chat is fantastic and makes her profile REAL ...  She has to have it in her profile ...",
            "author": "shamloo77",
            "id": "g4ilvg4",
            "parent_id": "t1_g4idunk",
            "score": 3,
            "created_utc": 1599625081.0,
            "replies": []
        },
        {
            "body": "Actually, disagree. A quick video chat is the best way to make sure you're not getting scammed, the person is the person in the picture, and both parties are actually serious.\n\nIf an SD reveals so much info a quick 30 second fuzzy video chat can be traced back to him, thats completely his fault.\n\nFrom the SD sides, it helps save a ton of time.",
            "author": null,
            "id": "g4j4lhf",
            "parent_id": "t1_g4idunk",
            "score": 4,
            "created_utc": 1599643041.0,
            "replies": []
        },
        {
            "body": ">[Blackmail is a thing](https://www.reddit.com/r/sugarlifestyleforum/comments/ht2m92/sds_how_many_times_in_total_have_you_been/)",
            "author": "TY2022",
            "id": "g4j2aow",
            "parent_id": "t1_g4idunk",
            "score": 0,
            "created_utc": 1599640282.0,
            "replies": []
        },
        {
            "body": "You will get a lot of complements here and on the site ...   good luck",
            "author": "shamloo77",
            "id": "g4iloml",
            "parent_id": "t1_g4ig07k",
            "score": 11,
            "created_utc": 1599624949.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4ilxff",
            "parent_id": "t1_g4iixm6",
            "score": 3,
            "created_utc": 1599625119.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g4imytu",
                    "parent_id": "t1_g4ilxff",
                    "score": 2,
                    "created_utc": 1599625856.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g4inxmy",
                            "parent_id": "t1_g4imytu",
                            "score": 16,
                            "created_utc": 1599626564.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's safe to assume that there are manipulative and/or abusive types out there. And certainly people who won't give the promised allowances.\n\nThat said, I think if you (1) read here as you've planned! (2) ask good questions (3) use your judgment (4) move slowly... you're likely to be OK.",
            "author": "marker3000",
            "id": "g4l98m9",
            "parent_id": "t1_g4jlozm",
            "score": 1,
            "created_utc": 1599688322.0,
            "replies": []
        },
        {
            "body": "I’m waiting for my dozen or so downvotes now 😌",
            "author": "ashes2asscheeks",
            "id": "g4krvze",
            "parent_id": "t1_g4kro24",
            "score": 3,
            "created_utc": 1599679758.0,
            "replies": [
                {
                    "body": "😂😂😂 I hear ya!\n\nI commented one time (only time) on one of the other sugar subs. It was extremely polite and totally noncontroversial but I got a ton of upvotes and the guy kicked me off the sub for getting upvoted. Not even in my control. Like I care about up or down votes! 😳 🍤 lol",
                    "author": "usernamechecksout4u",
                    "id": "g4ksckz",
                    "parent_id": "t1_g4krvze",
                    "score": 3,
                    "created_utc": 1599679981.0,
                    "replies": [
                        {
                            "body": "Oh yeah I heard the other one is even worse than this one lmao",
                            "author": "ashes2asscheeks",
                            "id": "g4ksibn",
                            "parent_id": "t1_g4ksckz",
                            "score": 1,
                            "created_utc": 1599680062.0,
                            "replies": [
                                {
                                    "body": "This one has extremes but also reasonable people in the middle of both sides (misogynistic vs man-bashing) but THAT sub...\nOmg. I can’t believe it’s allowed; it’s truly hateful. The guy squashes any hint of other opinion and he’s flat out toxic himself.\n\nAnyway, not to hijack her thread just a warning to take SD advice with a grain of salt.",
                                    "author": "usernamechecksout4u",
                                    "id": "g4ksy88",
                                    "parent_id": "t1_g4ksibn",
                                    "score": 2,
                                    "created_utc": 1599680276.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "She’s my type too, but unfortunately after meeting several like her I felt like nothing more then a personal ATM, and didn’t feel like she was there for me.",
            "author": "ruphun",
            "id": "g4kty83",
            "parent_id": "t1_g4ksygf",
            "score": 0,
            "created_utc": 1599680768.0,
            "replies": [
                {
                    "body": "Plus many. After a GREAT S&M ( I wrote it up)  I just want to scream at some many of these girls about the emotional intangible parts of this that are critical.  The she has such a great smile, holds a conversation (if not really the questioning type) and shares enough interests that I know we would have fun.  Once you start meeting THOSE you figure out how to make things work in the bowl.  \n\nThanks for reaching out.  The hardest thing about this is that you can't really talk to ANYONE about the bowl.",
                    "author": null,
                    "id": "g4kx9yi",
                    "parent_id": "t1_g4kty83",
                    "score": 0,
                    "created_utc": 1599682420.0,
                    "replies": [
                        {
                            "body": "The problem is they approach this like vanilla dating and most have no idea what they can offer other than their looks, or body. \n\nQuite unfortunate many haven’t learned yet what it takes to please a man or to keep him happy. We’re really simple creatures. Give me some attention, affection & appreciation and I’ll bend over backwards to make you happy. Instead they do the bare minimum & expect the world with their handout",
                            "author": "ruphun",
                            "id": "g4kxsza",
                            "parent_id": "t1_g4kx9yi",
                            "score": 0,
                            "created_utc": 1599682678.0,
                            "replies": [
                                {
                                    "body": "Yeah.....and I don't think they get that we have been around the block (or twice) and what that means.....(or for me)\n\nA)  We KNOW we do not look like we did at 30.  We accept that.  We understand that our success has other intangible rewards\nB)  We don't want a divorcee.  We know plenty.  That sounds AWFUL.\nC)  We may be married.  We are not leaving her.  Lots of reasons.  It very much is a 19th century mistriss moment.\nD)  But we want to feel fun and special and appreciated.  Since most of us are required to have very high BS meters to hold onto our success we can't really be conned over the long term.",
                                    "author": null,
                                    "id": "g4l0cd8",
                                    "parent_id": "t1_g4kxsza",
                                    "score": 0,
                                    "created_utc": 1599683773.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You need to be careful tbh because \n\n>And dont want to come across  non-legit men or manipulative psychopaths on SA who may enhance these insecurities\n\nis 110% a given. If possible, make some SB friends who you can debrief with and laugh about shitty experiences/ comments with so you don't internalise them.",
            "author": "blonde-throwaway",
            "id": "g4k14ed",
            "parent_id": "t1_g4jvtxe",
            "score": 5,
            "created_utc": 1599666498.0,
            "replies": [
                {
                    "body": "That’s a great suggestion. Where can I find SB friends apart from reddit? :) It would be nice to meet other Sbs maybe like discord community or fb group or something",
                    "author": "careeradvicex",
                    "id": "g4qdf3m",
                    "parent_id": "t1_g4k14ed",
                    "score": 3,
                    "created_utc": 1599765919.0,
                    "replies": []
                },
                {
                    "body": "Great advice!!!",
                    "author": "ashes2asscheeks",
                    "id": "g4kntxt",
                    "parent_id": "t1_g4k14ed",
                    "score": 1,
                    "created_utc": 1599677783.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That you've had pots ask for it doesnt mean its not something most wouldnt avoid. There was a poll here on it a while back, something like 2/3 said hell no to video chat.\n\nTen percent of guys might be into pegging, but a solid 80% will run if you pull out a strap on. Dont assume all guys want the same thing.",
            "author": "CaptainUltraObvious",
            "id": "g4if3r0",
            "parent_id": "t1_g4iecwa",
            "score": 1,
            "created_utc": 1599620752.0,
            "replies": []
        },
        {
            "body": "Saying that its only a preference would be good.\n\nI'm not sure what you expect to filter for with a phone call to be honest. Scammers, johns, etc all have phones too. In terms of discussing allowance, ppm etc, all that can be done through a messaging app.",
            "author": "CaptainUltraObvious",
            "id": "g4igfzg",
            "parent_id": "t1_g4ifyi9",
            "score": -1,
            "created_utc": 1599621568.0,
            "replies": []
        },
        {
            "body": "Fair.\n\nBut if she's looking for someone high value, well most of them want discretion and value reputation. So she's just filtering out all the richest men.",
            "author": "CaptainUltraObvious",
            "id": "g4iokal",
            "parent_id": "t1_g4inxto",
            "score": -2,
            "created_utc": 1599627036.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g4iotg7",
                    "parent_id": "t1_g4iokal",
                    "score": 5,
                    "created_utc": 1599627227.0,
                    "replies": [
                        {
                            "body": "Her post history includes FDS, its a safe bet she's looking to date the richest guys she can find. I'll say it again, the richest guys wont video chat.",
                            "author": "CaptainUltraObvious",
                            "id": "g4ipe3c",
                            "parent_id": "t1_g4iotg7",
                            "score": -1,
                            "created_utc": 1599627661.0,
                            "replies": [
                                {
                                    "body": "What does FDS mean?",
                                    "author": "usernamechecksout4u",
                                    "id": "g4j773f",
                                    "parent_id": "t1_g4ipe3c",
                                    "score": 2,
                                    "created_utc": 1599646093.0,
                                    "replies": []
                                },
                                {
                                    "body": "They also don't want anyone from FDS...",
                                    "author": "Josiah85",
                                    "id": "g4iptek",
                                    "parent_id": "t1_g4ipe3c",
                                    "score": -5,
                                    "created_utc": 1599627991.0,
                                    "replies": [
                                        {
                                            "body": "I guess we should be telling her to insist on it then.",
                                            "author": "CaptainUltraObvious",
                                            "id": "g4ipyd5",
                                            "parent_id": "t1_g4iptek",
                                            "score": -1,
                                            "created_utc": 1599628099.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "g4iqd9n",
                                            "parent_id": "t1_g4iptek",
                                            "score": -4,
                                            "created_utc": 1599628431.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "g4oxdq8",
                                                    "parent_id": "t1_g4iqd9n",
                                                    "score": 1,
                                                    "created_utc": 1599750480.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "g4pnhod",
                                                            "parent_id": "t1_g4oxdq8",
                                                            "score": 1,
                                                            "created_utc": 1599758904.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "g4pnpao",
                                                                    "parent_id": "t1_g4pnhod",
                                                                    "score": 1,
                                                                    "created_utc": 1599758992.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4imytu",
            "parent_id": "t1_g4ilxff",
            "score": 2,
            "created_utc": 1599625856.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g4inxmy",
                    "parent_id": "t1_g4imytu",
                    "score": 16,
                    "created_utc": 1599626564.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😂😂😂 I hear ya!\n\nI commented one time (only time) on one of the other sugar subs. It was extremely polite and totally noncontroversial but I got a ton of upvotes and the guy kicked me off the sub for getting upvoted. Not even in my control. Like I care about up or down votes! 😳 🍤 lol",
            "author": "usernamechecksout4u",
            "id": "g4ksckz",
            "parent_id": "t1_g4krvze",
            "score": 3,
            "created_utc": 1599679981.0,
            "replies": [
                {
                    "body": "Oh yeah I heard the other one is even worse than this one lmao",
                    "author": "ashes2asscheeks",
                    "id": "g4ksibn",
                    "parent_id": "t1_g4ksckz",
                    "score": 1,
                    "created_utc": 1599680062.0,
                    "replies": [
                        {
                            "body": "This one has extremes but also reasonable people in the middle of both sides (misogynistic vs man-bashing) but THAT sub...\nOmg. I can’t believe it’s allowed; it’s truly hateful. The guy squashes any hint of other opinion and he’s flat out toxic himself.\n\nAnyway, not to hijack her thread just a warning to take SD advice with a grain of salt.",
                            "author": "usernamechecksout4u",
                            "id": "g4ksy88",
                            "parent_id": "t1_g4ksibn",
                            "score": 2,
                            "created_utc": 1599680276.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Plus many. After a GREAT S&M ( I wrote it up)  I just want to scream at some many of these girls about the emotional intangible parts of this that are critical.  The she has such a great smile, holds a conversation (if not really the questioning type) and shares enough interests that I know we would have fun.  Once you start meeting THOSE you figure out how to make things work in the bowl.  \n\nThanks for reaching out.  The hardest thing about this is that you can't really talk to ANYONE about the bowl.",
            "author": null,
            "id": "g4kx9yi",
            "parent_id": "t1_g4kty83",
            "score": 0,
            "created_utc": 1599682420.0,
            "replies": [
                {
                    "body": "The problem is they approach this like vanilla dating and most have no idea what they can offer other than their looks, or body. \n\nQuite unfortunate many haven’t learned yet what it takes to please a man or to keep him happy. We’re really simple creatures. Give me some attention, affection & appreciation and I’ll bend over backwards to make you happy. Instead they do the bare minimum & expect the world with their handout",
                    "author": "ruphun",
                    "id": "g4kxsza",
                    "parent_id": "t1_g4kx9yi",
                    "score": 0,
                    "created_utc": 1599682678.0,
                    "replies": [
                        {
                            "body": "Yeah.....and I don't think they get that we have been around the block (or twice) and what that means.....(or for me)\n\nA)  We KNOW we do not look like we did at 30.  We accept that.  We understand that our success has other intangible rewards\nB)  We don't want a divorcee.  We know plenty.  That sounds AWFUL.\nC)  We may be married.  We are not leaving her.  Lots of reasons.  It very much is a 19th century mistriss moment.\nD)  But we want to feel fun and special and appreciated.  Since most of us are required to have very high BS meters to hold onto our success we can't really be conned over the long term.",
                            "author": null,
                            "id": "g4l0cd8",
                            "parent_id": "t1_g4kxsza",
                            "score": 0,
                            "created_utc": 1599683773.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s a great suggestion. Where can I find SB friends apart from reddit? :) It would be nice to meet other Sbs maybe like discord community or fb group or something",
            "author": "careeradvicex",
            "id": "g4qdf3m",
            "parent_id": "t1_g4k14ed",
            "score": 3,
            "created_utc": 1599765919.0,
            "replies": []
        },
        {
            "body": "Great advice!!!",
            "author": "ashes2asscheeks",
            "id": "g4kntxt",
            "parent_id": "t1_g4k14ed",
            "score": 1,
            "created_utc": 1599677783.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4iotg7",
            "parent_id": "t1_g4iokal",
            "score": 5,
            "created_utc": 1599627227.0,
            "replies": [
                {
                    "body": "Her post history includes FDS, its a safe bet she's looking to date the richest guys she can find. I'll say it again, the richest guys wont video chat.",
                    "author": "CaptainUltraObvious",
                    "id": "g4ipe3c",
                    "parent_id": "t1_g4iotg7",
                    "score": -1,
                    "created_utc": 1599627661.0,
                    "replies": [
                        {
                            "body": "What does FDS mean?",
                            "author": "usernamechecksout4u",
                            "id": "g4j773f",
                            "parent_id": "t1_g4ipe3c",
                            "score": 2,
                            "created_utc": 1599646093.0,
                            "replies": []
                        },
                        {
                            "body": "They also don't want anyone from FDS...",
                            "author": "Josiah85",
                            "id": "g4iptek",
                            "parent_id": "t1_g4ipe3c",
                            "score": -5,
                            "created_utc": 1599627991.0,
                            "replies": [
                                {
                                    "body": "I guess we should be telling her to insist on it then.",
                                    "author": "CaptainUltraObvious",
                                    "id": "g4ipyd5",
                                    "parent_id": "t1_g4iptek",
                                    "score": -1,
                                    "created_utc": 1599628099.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g4iqd9n",
                                    "parent_id": "t1_g4iptek",
                                    "score": -4,
                                    "created_utc": 1599628431.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "g4oxdq8",
                                            "parent_id": "t1_g4iqd9n",
                                            "score": 1,
                                            "created_utc": 1599750480.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "g4pnhod",
                                                    "parent_id": "t1_g4oxdq8",
                                                    "score": 1,
                                                    "created_utc": 1599758904.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "g4pnpao",
                                                            "parent_id": "t1_g4pnhod",
                                                            "score": 1,
                                                            "created_utc": 1599758992.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4inxmy",
            "parent_id": "t1_g4imytu",
            "score": 16,
            "created_utc": 1599626564.0,
            "replies": []
        },
        {
            "body": "Oh yeah I heard the other one is even worse than this one lmao",
            "author": "ashes2asscheeks",
            "id": "g4ksibn",
            "parent_id": "t1_g4ksckz",
            "score": 1,
            "created_utc": 1599680062.0,
            "replies": [
                {
                    "body": "This one has extremes but also reasonable people in the middle of both sides (misogynistic vs man-bashing) but THAT sub...\nOmg. I can’t believe it’s allowed; it’s truly hateful. The guy squashes any hint of other opinion and he’s flat out toxic himself.\n\nAnyway, not to hijack her thread just a warning to take SD advice with a grain of salt.",
                    "author": "usernamechecksout4u",
                    "id": "g4ksy88",
                    "parent_id": "t1_g4ksibn",
                    "score": 2,
                    "created_utc": 1599680276.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The problem is they approach this like vanilla dating and most have no idea what they can offer other than their looks, or body. \n\nQuite unfortunate many haven’t learned yet what it takes to please a man or to keep him happy. We’re really simple creatures. Give me some attention, affection & appreciation and I’ll bend over backwards to make you happy. Instead they do the bare minimum & expect the world with their handout",
            "author": "ruphun",
            "id": "g4kxsza",
            "parent_id": "t1_g4kx9yi",
            "score": 0,
            "created_utc": 1599682678.0,
            "replies": [
                {
                    "body": "Yeah.....and I don't think they get that we have been around the block (or twice) and what that means.....(or for me)\n\nA)  We KNOW we do not look like we did at 30.  We accept that.  We understand that our success has other intangible rewards\nB)  We don't want a divorcee.  We know plenty.  That sounds AWFUL.\nC)  We may be married.  We are not leaving her.  Lots of reasons.  It very much is a 19th century mistriss moment.\nD)  But we want to feel fun and special and appreciated.  Since most of us are required to have very high BS meters to hold onto our success we can't really be conned over the long term.",
                    "author": null,
                    "id": "g4l0cd8",
                    "parent_id": "t1_g4kxsza",
                    "score": 0,
                    "created_utc": 1599683773.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Her post history includes FDS, its a safe bet she's looking to date the richest guys she can find. I'll say it again, the richest guys wont video chat.",
            "author": "CaptainUltraObvious",
            "id": "g4ipe3c",
            "parent_id": "t1_g4iotg7",
            "score": -1,
            "created_utc": 1599627661.0,
            "replies": [
                {
                    "body": "What does FDS mean?",
                    "author": "usernamechecksout4u",
                    "id": "g4j773f",
                    "parent_id": "t1_g4ipe3c",
                    "score": 2,
                    "created_utc": 1599646093.0,
                    "replies": []
                },
                {
                    "body": "They also don't want anyone from FDS...",
                    "author": "Josiah85",
                    "id": "g4iptek",
                    "parent_id": "t1_g4ipe3c",
                    "score": -5,
                    "created_utc": 1599627991.0,
                    "replies": [
                        {
                            "body": "I guess we should be telling her to insist on it then.",
                            "author": "CaptainUltraObvious",
                            "id": "g4ipyd5",
                            "parent_id": "t1_g4iptek",
                            "score": -1,
                            "created_utc": 1599628099.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g4iqd9n",
                            "parent_id": "t1_g4iptek",
                            "score": -4,
                            "created_utc": 1599628431.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g4oxdq8",
                                    "parent_id": "t1_g4iqd9n",
                                    "score": 1,
                                    "created_utc": 1599750480.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "g4pnhod",
                                            "parent_id": "t1_g4oxdq8",
                                            "score": 1,
                                            "created_utc": 1599758904.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "g4pnpao",
                                                    "parent_id": "t1_g4pnhod",
                                                    "score": 1,
                                                    "created_utc": 1599758992.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This one has extremes but also reasonable people in the middle of both sides (misogynistic vs man-bashing) but THAT sub...\nOmg. I can’t believe it’s allowed; it’s truly hateful. The guy squashes any hint of other opinion and he’s flat out toxic himself.\n\nAnyway, not to hijack her thread just a warning to take SD advice with a grain of salt.",
            "author": "usernamechecksout4u",
            "id": "g4ksy88",
            "parent_id": "t1_g4ksibn",
            "score": 2,
            "created_utc": 1599680276.0,
            "replies": []
        },
        {
            "body": "Yeah.....and I don't think they get that we have been around the block (or twice) and what that means.....(or for me)\n\nA)  We KNOW we do not look like we did at 30.  We accept that.  We understand that our success has other intangible rewards\nB)  We don't want a divorcee.  We know plenty.  That sounds AWFUL.\nC)  We may be married.  We are not leaving her.  Lots of reasons.  It very much is a 19th century mistriss moment.\nD)  But we want to feel fun and special and appreciated.  Since most of us are required to have very high BS meters to hold onto our success we can't really be conned over the long term.",
            "author": null,
            "id": "g4l0cd8",
            "parent_id": "t1_g4kxsza",
            "score": 0,
            "created_utc": 1599683773.0,
            "replies": []
        },
        {
            "body": "What does FDS mean?",
            "author": "usernamechecksout4u",
            "id": "g4j773f",
            "parent_id": "t1_g4ipe3c",
            "score": 2,
            "created_utc": 1599646093.0,
            "replies": []
        },
        {
            "body": "They also don't want anyone from FDS...",
            "author": "Josiah85",
            "id": "g4iptek",
            "parent_id": "t1_g4ipe3c",
            "score": -5,
            "created_utc": 1599627991.0,
            "replies": [
                {
                    "body": "I guess we should be telling her to insist on it then.",
                    "author": "CaptainUltraObvious",
                    "id": "g4ipyd5",
                    "parent_id": "t1_g4iptek",
                    "score": -1,
                    "created_utc": 1599628099.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g4iqd9n",
                    "parent_id": "t1_g4iptek",
                    "score": -4,
                    "created_utc": 1599628431.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g4oxdq8",
                            "parent_id": "t1_g4iqd9n",
                            "score": 1,
                            "created_utc": 1599750480.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g4pnhod",
                                    "parent_id": "t1_g4oxdq8",
                                    "score": 1,
                                    "created_utc": 1599758904.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "g4pnpao",
                                            "parent_id": "t1_g4pnhod",
                                            "score": 1,
                                            "created_utc": 1599758992.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I guess we should be telling her to insist on it then.",
            "author": "CaptainUltraObvious",
            "id": "g4ipyd5",
            "parent_id": "t1_g4iptek",
            "score": -1,
            "created_utc": 1599628099.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4iqd9n",
            "parent_id": "t1_g4iptek",
            "score": -4,
            "created_utc": 1599628431.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g4oxdq8",
                    "parent_id": "t1_g4iqd9n",
                    "score": 1,
                    "created_utc": 1599750480.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g4pnhod",
                            "parent_id": "t1_g4oxdq8",
                            "score": 1,
                            "created_utc": 1599758904.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g4pnpao",
                                    "parent_id": "t1_g4pnhod",
                                    "score": 1,
                                    "created_utc": 1599758992.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4oxdq8",
            "parent_id": "t1_g4iqd9n",
            "score": 1,
            "created_utc": 1599750480.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g4pnhod",
                    "parent_id": "t1_g4oxdq8",
                    "score": 1,
                    "created_utc": 1599758904.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g4pnpao",
                            "parent_id": "t1_g4pnhod",
                            "score": 1,
                            "created_utc": 1599758992.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4pnhod",
            "parent_id": "t1_g4oxdq8",
            "score": 1,
            "created_utc": 1599758904.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g4pnpao",
                    "parent_id": "t1_g4pnhod",
                    "score": 1,
                    "created_utc": 1599758992.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4pnpao",
            "parent_id": "t1_g4pnhod",
            "score": 1,
            "created_utc": 1599758992.0,
            "replies": []
        }
    ]
}