{
    "title": "Sex after dinner",
    "post_id": "gxv0ze",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/gxv0ze/sex_after_dinner/",
    "author": "SheThrowsGoodSugar",
    "body": "I read this forum a lot and have noticed a common pattern for dates: lunch/dinner and then sugar time. I don't understand how sex after eating works. I get a food baby after eating and feel a bit heavy. Tmi, but I also have quick bowel movements so I need to \"lighten up\" after eating. \n\nAm I the only one who experiences all this? \n\nHow do people on here in this lifestyle manage to have sex right after eating? \n\nAm I doing something wrong or should I be doing something differently? \n\nOn a side note, do you brush your teeth after eating or only pump some breath freshener?\n\nTIA!",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/gxv0ze/sex_after_dinner/",
    "score": 141,
    "upvote_ratio": 0.96,
    "created_utc": 1591464043.0,
    "num_comments": 91,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "ft5gthg",
            "parent_id": "t3_gxv0ze",
            "score": 139,
            "created_utc": 1591464475.0,
            "replies": [
                {
                    "body": "Plus then you can work up a real appetite!",
                    "author": "falecf4",
                    "id": "ft6ztdm",
                    "parent_id": "t1_ft5gthg",
                    "score": 15,
                    "created_utc": 1591479726.0,
                    "replies": []
                },
                {
                    "body": ">This lowkey sucks bc you can’t stuff your face with expensive stuff.\n\nExactly, right?!",
                    "author": "SheThrowsGoodSugar",
                    "id": "ft5mffa",
                    "parent_id": "t1_ft5gthg",
                    "score": 32,
                    "created_utc": 1591466193.0,
                    "replies": []
                },
                {
                    "body": "Halfway through the sex? You mean at like the 2 minute mark? Just kidding not really.",
                    "author": "highjinx411",
                    "id": "ft8ce4g",
                    "parent_id": "t1_ft5gthg",
                    "score": 6,
                    "created_utc": 1591498060.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "On our first intimate date, my SD ordered a light salad (and didn’t even finish) and had no drinks while I, on the other hand, engorged myself with a heavy pasta dish and several glass of wine. Not the brightest decision, but we made it work (and I was very proud of myself for not falling asleep because that’s the effect pasta and wine has on me). We both also had a handful of mint on us, so we just popped some before we kissed. \n\nI also had another SD where I met him at his home, and for that we ended up being intimate first and then he cooked me dinner. I kinda prefer the reverse order just because I love falling asleep after a good fuck. \n\nBut if you’re nervous about a food baby or impromptu bowel movements, settle for something light.",
            "author": "GoodyGoobert",
            "id": "ft5jv3z",
            "parent_id": "t3_gxv0ze",
            "score": 36,
            "created_utc": 1591465436.0,
            "replies": []
        },
        {
            "body": "Sex before dinner is just so hard, personally. \n\nI mean I’ve done it but I end up getting ready twice. \n\nI get nice and dolled up for a date. After sex and a shower, my hair frizzes, my makeup needs redoing, I need to layer on lotion +skincare especially if we are going out afterwards.\n\nI think I’ve only been too stuffed to move twice. It was painful but still tried to have sex cus why not. But for the most part, it’s fine and sexual tension is built up through dinner anyhow. It’s fun.",
            "author": null,
            "id": "ft5k1ph",
            "parent_id": "t3_gxv0ze",
            "score": 35,
            "created_utc": 1591465482.0,
            "replies": []
        },
        {
            "body": "I never eat heavily enough on a sugar date for it to make a difference to me. I eat a real meal, I'm not picking at appetizers, but I'll pick something on the lighter side. And I just like having the meal as a chance to warm up so to speak. I get reacquainted to my SD, catch up on how life has been in the last week or so since I've seen him, etc etc. And if I were to have sex first then I would fuss about getting ready for the date and making sure I don't look freshly tumbled while eating.\n\nAlso I don't worry about brushing my teeth or using breath spray - I just don't eat a bunch of onions or garlic or whatever and I drink a bunch of water while eating.",
            "author": "MASugarBaby",
            "id": "ft5hmh2",
            "parent_id": "t3_gxv0ze",
            "score": 15,
            "created_utc": 1591464739.0,
            "replies": []
        },
        {
            "body": "I wish more men thought about this! \n\nI’m 10000% an intimacy first kind of gal. I don’t want anything messing with my pleasure 😂 Without sounding overly crass, sugar date or not, there’s nothing worse than wanting to throw it back when he’s behind you and feeling every ounce of food you ate just sloshing around. \n\nIn my fantasy sugar world, we’d get together, have nasty, debauchery filled fun like a bunch of rabbits and then order take out (French fries hit so different post sex). Then we’re eating in the post glow of an orgasm or a handful. No reservations for a potential BM, no feeling self conscious about a food baby, no worries about any indigestion (tell me why I have worse heartburn than most of the men I’ve met??), and huge pro- you work up an appetite with all that exercise 😉",
            "author": "lawbabyesq",
            "id": "ft5riaw",
            "parent_id": "t3_gxv0ze",
            "score": 29,
            "created_utc": 1591467986.0,
            "replies": [
                {
                    "body": "That sounds pretty damn awesome to me.  I don't see why you or OP can't just bring it up with the SD.  How many men will say \"no\" to having sex?  (LOL)  As long as it sounds reasonable, I can be flexible with planning in that way.",
                    "author": null,
                    "id": "ft7ylc3",
                    "parent_id": "t1_ft5riaw",
                    "score": 2,
                    "created_utc": 1591490411.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Some people prefer the Fuck First Philosophy (Filosophy?) to get that out of the way and then do other date activities like dinner. If guys initiate this, there's a risk the lady will feel \"used\" - if you're a lady, feel free to suggest it and see what he says!",
            "author": "SeattleLaserMeteor",
            "id": "ft5gclz",
            "parent_id": "t3_gxv0ze",
            "score": 36,
            "created_utc": 1591464327.0,
            "replies": [
                {
                    "body": "Fucfirosophy??",
                    "author": "SheThrowsGoodSugar",
                    "id": "ft5m2au",
                    "parent_id": "t1_ft5gclz",
                    "score": 18,
                    "created_utc": 1591466072.0,
                    "replies": []
                },
                {
                    "body": "I prefer to fuck first. It puts me at ease for the rest of the date",
                    "author": null,
                    "id": "ft6kjo4",
                    "parent_id": "t1_ft5gclz",
                    "score": 7,
                    "created_utc": 1591475553.0,
                    "replies": [
                        {
                            "body": "Is this what I’ve been doing wrong? I feel so pressured throughout the date that I can’t focus on anything and when the time comes it’s never as good as it could have been. How do I convince him to not wait til the end?",
                            "author": "Finikan",
                            "id": "ft79t3r",
                            "parent_id": "t1_ft6kjo4",
                            "score": 2,
                            "created_utc": 1591482701.0,
                            "replies": [
                                {
                                    "body": "Just tell him. I’m very straightforward and blunt, I just can’t help it.",
                                    "author": null,
                                    "id": "fukm9i5",
                                    "parent_id": "t1_ft79t3r",
                                    "score": 3,
                                    "created_utc": 1591942489.0,
                                    "replies": []
                                },
                                {
                                    "body": "Most men will not be offended at all if you suggest sex, or \"make a move\", before he does.  I've had her say \"I can't wait until after dinner.  I need it now!\"  I was happy to oblige!  :)\n\nWe did miss dinner completely one time after falling asleep on the floor after a pretty spirited naked wrestling match...",
                                    "author": "willfromvb",
                                    "id": "ft9e9a9",
                                    "parent_id": "t1_ft79t3r",
                                    "score": 4,
                                    "created_utc": 1591530739.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "ft5jxvj",
                    "parent_id": "t1_ft5gclz",
                    "score": 5,
                    "created_utc": 1591465454.0,
                    "replies": [
                        {
                            "body": "And it helps with blue balls / ovaries too!",
                            "author": "SeattleLaserMeteor",
                            "id": "ft5lqs5",
                            "parent_id": "t1_ft5jxvj",
                            "score": 4,
                            "created_utc": 1591465982.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Absolutely not for me. I'd have to get ready,  hair and makeup,  then redo after it gets messed up.  \n\nI'm a total fucking princess though.",
                    "author": "_Fortuna_",
                    "id": "ft5ry83",
                    "parent_id": "t1_ft5gclz",
                    "score": 11,
                    "created_utc": 1591468118.0,
                    "replies": [
                        {
                            "body": "I prefer to work up an appetite first",
                            "author": "IntelligentExternal",
                            "id": "ft64uae",
                            "parent_id": "t1_ft5ry83",
                            "score": 4,
                            "created_utc": 1591471613.0,
                            "replies": [
                                {
                                    "body": "Appetite is never an issue for me 😅",
                                    "author": "_Fortuna_",
                                    "id": "ft65rnl",
                                    "parent_id": "t1_ft64uae",
                                    "score": 3,
                                    "created_utc": 1591471836.0,
                                    "replies": []
                                },
                                {
                                    "body": "Appetite for food or sex?",
                                    "author": "bradpitt3",
                                    "id": "ft6qlz7",
                                    "parent_id": "t1_ft64uae",
                                    "score": 1,
                                    "created_utc": 1591477313.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I wish mine would go for this!",
                    "author": "Finikan",
                    "id": "ft6icaz",
                    "parent_id": "t1_ft5gclz",
                    "score": 1,
                    "created_utc": 1591474989.0,
                    "replies": []
                },
                {
                    "body": "Sorry who’s paying for the date and dinner again?",
                    "author": null,
                    "id": "ft9n64t",
                    "parent_id": "t1_ft5gclz",
                    "score": 0,
                    "created_utc": 1591537546.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't brush my teeth just chew gum like I would any other time?\n\nI am short and have a very short torso so I know all about the food baby you speak of! I straight up look like a toddler with their belly sticking out when I am full 😂\n\nI honestly find myself not usually eating much when we have meals- not intentionally but we are always engrossed in our conversation so it just happens. \n\nBut I normally try to cool it on eating a lot a few days before I see him so that I have room to eat and still feel sexy and not like a pregnant cow.",
            "author": "Dressedtokillxxx",
            "id": "ft5k7g2",
            "parent_id": "t3_gxv0ze",
            "score": 13,
            "created_utc": 1591465526.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ft5liqi",
                    "parent_id": "t1_ft5k7g2",
                    "score": 8,
                    "created_utc": 1591465915.0,
                    "replies": [
                        {
                            "body": "😂😂😂\n\nYasss girl!\nFor me it totally is- it even happens when I drink a lot of something too. 😩",
                            "author": "Dressedtokillxxx",
                            "id": "ft762g5",
                            "parent_id": "t1_ft5liqi",
                            "score": 5,
                            "created_utc": 1591481559.0,
                            "replies": [
                                {
                                    "body": "Same 😩",
                                    "author": "SheThrowsGoodSugar",
                                    "id": "ft76h4m",
                                    "parent_id": "t1_ft762g5",
                                    "score": 3,
                                    "created_utc": 1591481691.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If I eat a big meal before sex then not even a mega dose of Viagra will get it up..(yeah I tried it once) ..... So it's either eat light or have sex first and I am NOT a light eater... I have discovered that for ME, morning or early afternoon sex is best..",
            "author": "erickraemer",
            "id": "ft5v8g6",
            "parent_id": "t3_gxv0ze",
            "score": 8,
            "created_utc": 1591469050.0,
            "replies": []
        },
        {
            "body": "I always like to have sex first before lunch or Dinner. I break that pattern only if we are on vacation. But usually on vacations, it’s sex before and after food😁",
            "author": "supportiveceo",
            "id": "ft5jtxb",
            "parent_id": "t3_gxv0ze",
            "score": 15,
            "created_utc": 1591465427.0,
            "replies": [
                {
                    "body": "And sex for food as well, I assume?",
                    "author": "SheThrowsGoodSugar",
                    "id": "ft5lvkf",
                    "parent_id": "t1_ft5jtxb",
                    "score": 9,
                    "created_utc": 1591466021.0,
                    "replies": [
                        {
                            "body": "😬😬",
                            "author": "supportiveceo",
                            "id": "ft6dt81",
                            "parent_id": "t1_ft5lvkf",
                            "score": 1,
                            "created_utc": 1591473856.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Generally my dates involve dinner and then a good long wind down before intimacy. We drink wine, we chat, it can sometimes last 2 hours or so just hanging out post meal. If I order a large dinner I eat some and take the rest home for lunch the next day.",
            "author": "Meowohmeow20",
            "id": "ft5lmn3",
            "parent_id": "t3_gxv0ze",
            "score": 8,
            "created_utc": 1591465945.0,
            "replies": []
        },
        {
            "body": "I had a vanilla ex that wanted to eat stuff like burritos and expected to have sex after. BLEW MY MIND. So, yes! So real! Nothin’ makes me feel as not sexy as a food baby. 🙅🏻‍♀️",
            "author": null,
            "id": "ft5te7n",
            "parent_id": "t3_gxv0ze",
            "score": 5,
            "created_utc": 1591468542.0,
            "replies": [
                {
                    "body": "What is it with all you people moving your bowels after dinner?  Am I in crazy town???\n\nlol just teasing!!!  But I'm shocked this is so common.  SLF once again opens my eyes to the real world :)   That's why I come here, to learn the important stuff",
                    "author": "Azurecole",
                    "id": "ft5uiiz",
                    "parent_id": "t1_ft5te7n",
                    "score": 2,
                    "created_utc": 1591468852.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "100% with you.  A few thoughts (all over the place).\n\n1.  This is why - if we are going out to eat at nice restaurants, I'm pretty much expecting a minimum of 5-6 hour dates.  If you think about a 6 hour dinner date;  you consume most of the food likely 30 - 75 minutes into the date.  You then have 2 hours of talking, hanging out, digesting before sex is coming up.  \n\n2.  While we might go out to eat most dates in the first month - it's very common that stops being an every date thing.  Instead, more ordering in.  (which has the benefit of sex before & after).  \n\n3.  On shorter dinner dates - we are likely going somewhere more casual.  I'm simply not going to eat a \"full\" meal in the standard sense (that you would when fine dining).  No bread;  appetizer.  My normal go to is to order a steak;  say, a rib eye.  But ask for no sides.  I know everyone is different - but as MUCH as I love steak, it's very hard for me to \"over eat\" meat if there are no carbs around.  So limiting this, keeps me better for later.",
            "author": "SDstartingOut",
            "id": "ft5t111",
            "parent_id": "t3_gxv0ze",
            "score": 8,
            "created_utc": 1591468437.0,
            "replies": []
        },
        {
            "body": "This always always depends on the two of you and how you interact. \n\nConsider this weekend:\n\n1) Arrive at hotel at 2pm. You name is on the reservation. Dress casually. Bring XX dress. Our restaurant reservation is at 7:30\n\n2) Next day shopping and aftercare ...",
            "author": "daddoms",
            "id": "ft6230a",
            "parent_id": "t3_gxv0ze",
            "score": 3,
            "created_utc": 1591470935.0,
            "replies": []
        },
        {
            "body": "I concur with you. How I manage this is the first couple dates will either not include dinner and only drinks or may follow the familiar pattern of sex after dinner. But after a couple intimate dates and there is comfort I explain I prefer sex first and then eating.\n\nYes to brushing teeth after eating as well and I keep extra toothbrushes on hand when a SB is coming to my home.",
            "author": "SpendItRight",
            "id": "ft5p7ca",
            "parent_id": "t3_gxv0ze",
            "score": 6,
            "created_utc": 1591467132.0,
            "replies": []
        },
        {
            "body": "Having my sd rub my belly and hold onto it while im on top? Nope don’t feel sexy for me.",
            "author": "femuserhere",
            "id": "ft6jfa9",
            "parent_id": "t3_gxv0ze",
            "score": 3,
            "created_utc": 1591475259.0,
            "replies": [
                {
                    "body": "mmmm that shit is the best, I like my SB to have just the smallest amount of belly. One big hand placed directly in the front and one on the ass. I got excited just typing that, good thing the SB is on her way over.",
                    "author": null,
                    "id": "ft6yxdd",
                    "parent_id": "t1_ft6jfa9",
                    "score": 2,
                    "created_utc": 1591479488.0,
                    "replies": [
                        {
                            "body": "Not when I’m bloated with a food baby.",
                            "author": "femuserhere",
                            "id": "ft6zxmo",
                            "parent_id": "t1_ft6yxdd",
                            "score": 2,
                            "created_utc": 1591479757.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Can I rub your belly 🥺",
                    "author": null,
                    "id": "ft8ognt",
                    "parent_id": "t1_ft6jfa9",
                    "score": 2,
                    "created_utc": 1591506179.0,
                    "replies": [
                        {
                            "body": "You can be the exception. Use your magic hands to put me into labor",
                            "author": "femuserhere",
                            "id": "ftax9mi",
                            "parent_id": "t1_ft8ognt",
                            "score": 1,
                            "created_utc": 1591563202.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Corona dates have been meals at home. So that’s easier, eat, Netflix most or all of the movie, then traipse yo the bedroom. That leaves some time to settle. No answer for the dates that were fancy dinners out. We’d both chow and just suck it up back at home. Sure, the bloated word occasionally popped up, but once you become LT, there’s a forgiving aspect to the tummy bump and all else too!",
            "author": "jacknjilled",
            "id": "ft89jjo",
            "parent_id": "t3_gxv0ze",
            "score": 3,
            "created_utc": 1591496297.0,
            "replies": []
        },
        {
            "body": "I barely eat on sugar dates.  I usually just order whatever she orders which is always light and healthy and then pick at it.  Now after the date, I may have a real meal, but I like to stay light on sugar dates.",
            "author": "MidwestAmMan",
            "id": "ft5g1oc",
            "parent_id": "t3_gxv0ze",
            "score": 6,
            "created_utc": 1591464226.0,
            "replies": []
        },
        {
            "body": "IF it's evening sex, 95% of the time it's sex after dinner.  I don't have any after-meal bloating or other issues, and haven't had an SB that has that issue either, to my knowledge.  It's never sex immediately after dinner, we usually wind down with movies, or get ourselves wound up getting drinks, before we head back for the sex.  But usually a couple of hours of separation.\n\nIf I knew she moved her bowels after dinner, that would be all I need to know, I'd definitely shift to sex before dinner!",
            "author": "Azurecole",
            "id": "ft5nces",
            "parent_id": "t3_gxv0ze",
            "score": 7,
            "created_utc": 1591466482.0,
            "replies": [
                {
                    "body": ">If I knew she moved her bowels after dinner, that would be all I need to know, I'd definitely shift to sex before dinner!\n\nHow would one tastefully and tactfully make their SD aware of such tendencies? Should one? Or like others mentioned, would it best to ask the SD to have the sex first without going into details?",
                    "author": "SheThrowsGoodSugar",
                    "id": "ft5ooku",
                    "parent_id": "t1_ft5nces",
                    "score": 7,
                    "created_utc": 1591466935.0,
                    "replies": [
                        {
                            "body": "I think I personally would notice (I *think*).  But if I didn't, I'm trying to imagine what might work best on me lol...  Maybe something along the lines of:  \"Would you enjoy having sex before dinner instead?  I love having sex right away when I'm super energized, and after dinner I always feel a little more bloated\".\n\nSo, make it about how much better the sex will be if we have it before dinner, and then just a subtle mention of being bloated or stomach upset, and I think most guys will get it.\n\nQuestion: would some drinks at the bar to warm us up so we can flirt and get a little horny work?  Or does that kick off the GI runaway reaction?",
                            "author": "Azurecole",
                            "id": "ft5tar2",
                            "parent_id": "t1_ft5ooku",
                            "score": 7,
                            "created_utc": 1591468517.0,
                            "replies": [
                                {
                                    "body": "Thanks for the sound advice!\n\nNot sure if that question is for me but I don't drink. I'm plenty wild without the alcohol 😈. I guess I could do mocktails if my SD wanted to drink.",
                                    "author": "SheThrowsGoodSugar",
                                    "id": "ft5uu0f",
                                    "parent_id": "t1_ft5tar2",
                                    "score": 3,
                                    "created_utc": 1591468939.0,
                                    "replies": [
                                        {
                                            "body": "Yes, the question was for you.  The reason I asked is because what I might struggle with a bit is: you show up to the room, we exchange niceties, and 10 minutes later we're having sex.  I like to be positively *aching* for her by the time we're having sex; my IQ should have dropped at least 20 points.  That's easily accomplished: go to the hotel bar, talk and flirt and drink (the drinking is less important than the talking and flirting), then head upstairs when I can't keep my hands off her.  THAT would work fine for me.  But at least 30-60 minutes of socializing first.\n\nTL;DR: You want that primo Vitamin Azure, you gotta warm me up first 🤣🤣",
                                            "author": "Azurecole",
                                            "id": "ft5wkkw",
                                            "parent_id": "t1_ft5uu0f",
                                            "score": 6,
                                            "created_utc": 1591469410.0,
                                            "replies": [
                                                {
                                                    "body": "Not too hard to accomplish, I feel! I could have a good ol' club soda with lime and flirt my way to the \"can't keep my hands off her\" stage as your drink starts making your IQ drop to a sexy level.",
                                                    "author": "SheThrowsGoodSugar",
                                                    "id": "ft5ykzt",
                                                    "parent_id": "t1_ft5wkkw",
                                                    "score": 5,
                                                    "created_utc": 1591469968.0,
                                                    "replies": [
                                                        {
                                                            "body": "How *you* doin'?",
                                                            "author": "Azurecole",
                                                            "id": "ft5zb8a",
                                                            "parent_id": "t1_ft5ykzt",
                                                            "score": 4,
                                                            "created_utc": 1591470188.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "ft5zrby",
                                                                    "parent_id": "t1_ft5zb8a",
                                                                    "score": 3,
                                                                    "created_utc": 1591470316.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If I am on a sugar date with limited time say 4hrs then I just eat lightly, salad that sort of thing. Currently I am with a SB that always overnights with me, we eat, have sex, eat, sex, eat, sex until about noon or so the next day.",
            "author": null,
            "id": "ft5ies8",
            "parent_id": "t3_gxv0ze",
            "score": 4,
            "created_utc": 1591464989.0,
            "replies": [
                {
                    "body": "How does this work? I've heard of other people doing this in vanilla relationships too. I'm assuming you keep snacking in between the sessions instead of actual meals?",
                    "author": "SheThrowsGoodSugar",
                    "id": "ft5n1aw",
                    "parent_id": "t1_ft5ies8",
                    "score": 2,
                    "created_utc": 1591466384.0,
                    "replies": [
                        {
                            "body": "When I've done it, it was never really planned.  You just kinda go with the flow.  In some cases - we've cancelled dinner reservations.\n\nExample:\n\nMe:  \"Hey, it's 3pm.  I'm hungry, we fucked our way through lunch.  But we have a 7pm dinner reservation.  What are you thinking?\"\n\nHer:  You want to just skip dinner, and order something now, with extras for later?  \n\nBut yes - snacking + ordering food is the main way to do it.  \n\nTo put in perspective, before uber eats, Pizza + Chinese used to be very common for this.  And both are things really easy to order a bunch of to have around.",
                            "author": "SDstartingOut",
                            "id": "ft5v1b1",
                            "parent_id": "t1_ft5n1aw",
                            "score": 6,
                            "created_utc": 1591468994.0,
                            "replies": []
                        },
                        {
                            "body": "Yes I am talking about a meet at home, we have done this in hotels also with door dash, uber eats or I just bring some food along. Yes we will go for a round, take a break snack a bit, this just leads into another round, a break, snacking and another round (repeat until someone gives up)",
                            "author": null,
                            "id": "ft6y2gp",
                            "parent_id": "t1_ft5n1aw",
                            "score": 1,
                            "created_utc": 1591479264.0,
                            "replies": [
                                {
                                    "body": "Sounds like life in heaven.",
                                    "author": "SheThrowsGoodSugar",
                                    "id": "ft6ywv6",
                                    "parent_id": "t1_ft6y2gp",
                                    "score": 2,
                                    "created_utc": 1591479484.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "In the beginning we use to just have drinks and then fun time. After a while we started doing dinner dates, after eating we would usually watch tv until we weren't too full (an hour or so in most cases).    \n\n\nSometimes we did brush our teeth before hand other times we were just way too into it even bother.",
            "author": "youngsugardaddy2019",
            "id": "ft6g1d7",
            "parent_id": "t3_gxv0ze",
            "score": 2,
            "created_utc": 1591474410.0,
            "replies": []
        },
        {
            "body": "I dont like to eat then sugar a drink maybe but I'll pass on the dinner thing unless it's just dinner.",
            "author": "bookworm010101",
            "id": "ft77msj",
            "parent_id": "t3_gxv0ze",
            "score": 2,
            "created_utc": 1591482027.0,
            "replies": []
        },
        {
            "body": "Yes, go out to eat after!  You will be more relaxed anyway, presuming your partner has any ability whatsoever.  There is a tangential benefit to going out to eat after, maybe two.  Sometimes, folks pick up on the vibe and you get a waitress / bartender hit on you over and above the usual service worker call of duty (no, I do not respond as that would be Dickensian.  If my sb wants to quietly float a balloon, she has the green light).  Also, every once in a while, some big muscle boy gets a \"WTF!\" response and goes for the aggressive eye contact \"you could do better\" routine.  That can be a touch uncomfortable, but quite fun afterwards.  Also, if she knows you well and packed a comfort outfit that can be fun.  This is especially true if her shirt reads \"feminist killjoy\" (Hi A!) or something like that.  Loved that particular outfit, to be honest.",
            "author": "NCtriadSD",
            "id": "ft78znj",
            "parent_id": "t3_gxv0ze",
            "score": 2,
            "created_utc": 1591482457.0,
            "replies": [
                {
                    "body": "Also, if you really like to meet in public before, to make triple sure everyone is on the same page or whatever before getting bcd, order take out!  Plan ahead with a bottle of whatever, and you get a pic nic between round one and the other, if that happens.",
                    "author": "NCtriadSD",
                    "id": "ft79fl6",
                    "parent_id": "t1_ft78znj",
                    "score": 1,
                    "created_utc": 1591482589.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So good to read this.\n\nI don't eat a fine meal and then jump up and go play a game of basketball. \n\nI feel absolutely terrible when I eat a nice meal and then have sex after for the same reason. Especially if you have something particularly spicy. \n\nI don't know what the easy solution is either because it is a progression of the evening date thing for me.",
            "author": "amigodeface",
            "id": "ft7c5hk",
            "parent_id": "t3_gxv0ze",
            "score": 2,
            "created_utc": 1591483351.0,
            "replies": [
                {
                    "body": "Others here have commented that they eat light. This would help with typical evening date progression.",
                    "author": "SheThrowsGoodSugar",
                    "id": "ft7dgg5",
                    "parent_id": "t1_ft7c5hk",
                    "score": 1,
                    "created_utc": 1591483715.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I take Dan Savage's advice -fuck first! \n\nEspecially if you're meeting at a hotel or at your SD's home. Have some drinks, fuck around then order room service or delivery, or go out to a nice place.",
            "author": "bourbonandblonde",
            "id": "ft5q83j",
            "parent_id": "t3_gxv0ze",
            "score": 2,
            "created_utc": 1591467541.0,
            "replies": []
        },
        {
            "body": "My SB and I had a routine of before and after. Worked with perfection.",
            "author": null,
            "id": "ft5n2m2",
            "parent_id": "t3_gxv0ze",
            "score": 2,
            "created_utc": 1591466394.0,
            "replies": [
                {
                    "body": "Care to expand?",
                    "author": "SheThrowsGoodSugar",
                    "id": "ft5q12g",
                    "parent_id": "t1_ft5n2m2",
                    "score": 3,
                    "created_utc": 1591467472.0,
                    "replies": [
                        {
                            "body": "Yes. She would show up at my apt. We would go for round 1. Then we would go for a nice romantic dinner. Come back to my place for round 2 and beyond.",
                            "author": null,
                            "id": "ft7jw46",
                            "parent_id": "t1_ft5q12g",
                            "score": 1,
                            "created_utc": 1591485505.0,
                            "replies": [
                                {
                                    "body": "Very similar. We would meet. Once inside the room. Press her against the wall from behind and kiss her neck and ear. That started her engine, moved to the bed for a little DATY. We cuddle after her O for a 1/2 hr or so then hit dinner. After eats always did some type of activity for a few hours. Then once back it was on like like donkey Kong. She always liked my rule. If she doesn’t O, nobody does. Plus that before dinner escapade really told me how into seeing me she was cause there would be a whole lot of wetness felt as soon as I started. \n\nA few others were dry as a bone.",
                                    "author": "SingleCondition4",
                                    "id": "ft887gs",
                                    "parent_id": "t1_ft7jw46",
                                    "score": 1,
                                    "created_utc": 1591495480.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Reading all these comments, so relatable! But is it weird that we usually do it before and after dinner? 😱 Before is like pre-game, nothing too crazy but he goes down til I climax and then we have sex til he does... And I’m not too crazy looking after - because it’s very sweet and not rough or strenuous -so we immediately go to dinner or order in (especially since covid) and then more intense/crazy sex a couple hours after that. If I stay the night, 50/50 chance of one more time in the morning. Sometimes he’s too worn out. haha \n\nI admit that I don’t usually eat as much as I’d like to. As for going to the bathroom, I’m one of those people who won’t even feel the urge if I’m not at home. I guess that’s good and bad. I’ve noticed he has wipes in his bathroom so if I ever needed to I’d just use those - or preferably shower. Sorry tmi and maybe not even helpful to the convo. Just sharing my experience cause you guys got me thinking about it. 🤪",
            "author": "jawslovesme",
            "id": "ft8a7yj",
            "parent_id": "t3_gxv0ze",
            "score": 2,
            "created_utc": 1591496714.0,
            "replies": [
                {
                    "body": "It's definitely helpful! I'm glad you brought it up. I like to take a quick shower and wash everything down there. The cleaner, the better.",
                    "author": "SheThrowsGoodSugar",
                    "id": "ft8bq0h",
                    "parent_id": "t1_ft8a7yj",
                    "score": 3,
                    "created_utc": 1591497635.0,
                    "replies": [
                        {
                            "body": "For sure! Otherwise - ewww. I feel like that’s disgusting and disrespectful.",
                            "author": "jawslovesme",
                            "id": "ft8nscl",
                            "parent_id": "t1_ft8bq0h",
                            "score": 1,
                            "created_utc": 1591505672.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Look at all these amateurs.\n\nMy ex SB (ex because she had to leave UK due to the fucking virus) and I got this figured out to the T.\n\nWe met at the train station after work. She came in her casual dress and without much make up. We drove to the country hotel. Hit the gym, run a few laps in the park, have a swim and sauna. Back to the room. Sexy time. Shower and then head out for dinner.\n\nAfter dinner, slumber Infront of the TV in the room. Maybe round 2/3.\n\nNext morning, breakfast in bed. Another round.\n\nGreat way to spend a mid week.",
            "author": "eurosd",
            "id": "ft68xpt",
            "parent_id": "t3_gxv0ze",
            "score": 2,
            "created_utc": 1591472631.0,
            "replies": [
                {
                    "body": "You're a pro! You weren't lying when you said you've got it figured out to the T.",
                    "author": "SheThrowsGoodSugar",
                    "id": "ft6kqid",
                    "parent_id": "t1_ft68xpt",
                    "score": 1,
                    "created_utc": 1591475606.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I like sex in the morning. Either wake up next to my SB or she {used to} come overly after I finished my morning run. We ravished each other than made breakfast and sat naked on my balcony to eat. Wonderful days. Gone now. 😥",
            "author": "AFSMSgt",
            "id": "ft7ir3b",
            "parent_id": "t3_gxv0ze",
            "score": 1,
            "created_utc": 1591485188.0,
            "replies": []
        },
        {
            "body": "I don't have that issue too much, I'm lucky I guess. No food baby here.",
            "author": "TwitchyArtist",
            "id": "ft7lv70",
            "parent_id": "t3_gxv0ze",
            "score": 1,
            "created_utc": 1591486057.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ft7nqqh",
                    "parent_id": "t1_ft7lv70",
                    "score": 1,
                    "created_utc": 1591486584.0,
                    "replies": [
                        {
                            "body": "No super short actually.",
                            "author": "TwitchyArtist",
                            "id": "ft7nu74",
                            "parent_id": "t1_ft7nqqh",
                            "score": 1,
                            "created_utc": 1591486611.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ft7ohsw",
                                    "parent_id": "t1_ft7nu74",
                                    "score": 1,
                                    "created_utc": 1591486789.0,
                                    "replies": [
                                        {
                                            "body": "Lol I'm 4\"11 but I'm very small in general only 75lbs",
                                            "author": "TwitchyArtist",
                                            "id": "ft7on3x",
                                            "parent_id": "t1_ft7ohsw",
                                            "score": 2,
                                            "created_utc": 1591486829.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "We have no issues, the normal is grab lunch and then head to the hotel",
            "author": "blk-tye",
            "id": "ft7nn6j",
            "parent_id": "t3_gxv0ze",
            "score": 1,
            "created_utc": 1591486555.0,
            "replies": []
        },
        {
            "body": "Well my prior long term SB was smart enough to carry an essentials bag in her trunk. After great advice by me. The current one is not on board even after numerous hints and a gift of an overnight bag. That takes care of any impromptu happenings. I have a ton of individual sealed toothbrushes from dentist visits if needed. \nWe always ate out all over the place then came back to hotel and payed around cuddling for hours watching movies. Usually never got hot and heavy until hours after eating. And then if it turned into an overnight she had everything available.",
            "author": "SingleCondition4",
            "id": "ft7v3hj",
            "parent_id": "t3_gxv0ze",
            "score": 1,
            "created_utc": 1591489031.0,
            "replies": []
        },
        {
            "body": "I don't see how is that any different from vanilla? I also have sex after dinner on vanilla, who doesn’t?",
            "author": "mtriad",
            "id": "ft9360d",
            "parent_id": "t3_gxv0ze",
            "score": 1,
            "created_utc": 1591519589.0,
            "replies": []
        },
        {
            "body": "Not keen on routines, much prefer to mix it up",
            "author": "SlothsvPangolins",
            "id": "ft9jrax",
            "parent_id": "t3_gxv0ze",
            "score": 1,
            "created_utc": 1591535181.0,
            "replies": []
        },
        {
            "body": "My best SR was when dinner was never on the agenda.",
            "author": null,
            "id": "ft9n3up",
            "parent_id": "t3_gxv0ze",
            "score": 1,
            "created_utc": 1591537504.0,
            "replies": []
        },
        {
            "body": "Definitely, my preference is to hang out and be intimate before going out eating and drinking. \n\nIf it’s the other way around, im going to have a light dinner and no carbonated drinks.",
            "author": "slf2020",
            "id": "ftcfv45",
            "parent_id": "t3_gxv0ze",
            "score": 1,
            "created_utc": 1591597527.0,
            "replies": []
        },
        {
            "body": "Really a great topic and one you need to work out with your SD. My former SB Lilly was very attractive but she wasn't the cleanest human I've know. I always insisted on bathing being part of our play time so she was clean by time we were intimate. \n\nUnlike most SDs I really like giving oral not just receiving it. So i like to make sure she is very fresh. Certainly there are times when that isn't practical, like she would come to my office and just pleasure me or in a park or the car.",
            "author": "FredCouplesBaby",
            "id": "ftdhs3w",
            "parent_id": "t3_gxv0ze",
            "score": 1,
            "created_utc": 1591628249.0,
            "replies": []
        },
        {
            "body": "My SRs have involved a dinner date followed by non sexual evening hangout stuff, such as Netflix,followed by bedtime.  But we do what works for out time available and the parameters of the SR.",
            "author": "GSSD",
            "id": "ftecy0v",
            "parent_id": "t3_gxv0ze",
            "score": 1,
            "created_utc": 1591643822.0,
            "replies": []
        },
        {
            "body": "This post reminds me of advice Dan Savage gives his many readers / listeners every Valentines Day, but I think works well all year round. This rule is simple and easy to understand: \n\nF**k First. \n\n\nhttps://chicagoist.com/2016/02/09/dan_savages_nsfw_valentines_day_adv.php",
            "author": "SouthernGentSD",
            "id": "ft6ckeb",
            "parent_id": "t3_gxv0ze",
            "score": 1,
            "created_utc": 1591473549.0,
            "replies": []
        },
        {
            "body": "My SD and I are usually intimate first. I'm not sure if this is intentional, but we usually start after we tell each other about our day. We even sometimes will continue the conversation during, depending on what it's about. Pros and Cons on that one. \n\nI'll usually spend the night, but will go home to shower and such so if things work out, it's all timed correctly lol",
            "author": null,
            "id": "ft81zd5",
            "parent_id": "t3_gxv0ze",
            "score": 1,
            "created_utc": 1591491960.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ft793zm",
            "parent_id": "t3_gxv0ze",
            "score": -1,
            "created_utc": 1591482496.0,
            "replies": [
                {
                    "body": "Whaat?! 2-3 rounds after dinner? How long is the wait between dinner and sex? How much do you eat (proper full meal, light, munching, etc.)?",
                    "author": "SheThrowsGoodSugar",
                    "id": "ft7adym",
                    "parent_id": "t1_ft793zm",
                    "score": 3,
                    "created_utc": 1591482865.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ft7b99t",
                            "parent_id": "t1_ft7adym",
                            "score": 0,
                            "created_utc": 1591483106.0,
                            "replies": [
                                {
                                    "body": "Apps/main/dessert is a heavy meal. I would look pregnant after that haha.",
                                    "author": "SheThrowsGoodSugar",
                                    "id": "ft7c4wb",
                                    "parent_id": "t1_ft7b99t",
                                    "score": 2,
                                    "created_utc": 1591483347.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ft7c9bx",
                                            "parent_id": "t1_ft7c4wb",
                                            "score": 1,
                                            "created_utc": 1591483382.0,
                                            "replies": [
                                                {
                                                    "body": "Oh ok. Still heavy though lol. But I guess it depends on the serving size.",
                                                    "author": "SheThrowsGoodSugar",
                                                    "id": "ft7csqi",
                                                    "parent_id": "t1_ft7c9bx",
                                                    "score": 2,
                                                    "created_utc": 1591483531.0,
                                                    "replies": [
                                                        {
                                                            "body": "> Oh ok. Still heavy though lol. But I guess it depends on the serving size.\n\nThis is one thing I really miss about living in Europe.  They have appetizers & deserts right.\n\nIn the US - appetizers & deserts are often a meal (in terms of calories) on their own.  Not something light.",
                                                            "author": "SDstartingOut",
                                                            "id": "ft8eusq",
                                                            "parent_id": "t1_ft7csqi",
                                                            "score": 1,
                                                            "created_utc": 1591499630.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Humm",
            "author": "InfiniteTemptation",
            "id": "ft6di44",
            "parent_id": "t3_gxv0ze",
            "score": 0,
            "created_utc": 1591473779.0,
            "replies": []
        },
        {
            "body": "Most of the time my dates are daytime . We usually meet about 11, have a drink and some fun time, then go out for a late lunch with great wine. After we go back to my place & snuggle & talk.  I highly recommend it.",
            "author": "daddyxfun",
            "id": "ft8fjw4",
            "parent_id": "t3_gxv0ze",
            "score": 0,
            "created_utc": 1591500081.0,
            "replies": []
        },
        {
            "body": "I throughout most of my dating life have certain things I carry with me to be ready for sex in all occasions. It consists of feminine wipes, an empty enema bottle, lube, a small bottle of air freshener and extra panties. I've got it so it all flits in a makeup bag. I also have a mini tooth brush and paste and icebreakers gum.\n\nIf I have a BM after dinner I can use the enema to further cleanse with warm water and freshen up with feminine wipes. The lube it for the enema tip. Extra panties because you never know. Air freshener because a lady should never leave a bad impression.\n\nSD's & SB's are human, humans have bodily functions. In time you can address them, but until then it's nice to be prepared anyways.",
            "author": "tgibook",
            "id": "ft8j7xs",
            "parent_id": "t3_gxv0ze",
            "score": 0,
            "created_utc": 1591502483.0,
            "replies": []
        },
        {
            "body": "Plus then you can work up a real appetite!",
            "author": "falecf4",
            "id": "ft6ztdm",
            "parent_id": "t1_ft5gthg",
            "score": 15,
            "created_utc": 1591479726.0,
            "replies": []
        },
        {
            "body": ">This lowkey sucks bc you can’t stuff your face with expensive stuff.\n\nExactly, right?!",
            "author": "SheThrowsGoodSugar",
            "id": "ft5mffa",
            "parent_id": "t1_ft5gthg",
            "score": 32,
            "created_utc": 1591466193.0,
            "replies": []
        },
        {
            "body": "Halfway through the sex? You mean at like the 2 minute mark? Just kidding not really.",
            "author": "highjinx411",
            "id": "ft8ce4g",
            "parent_id": "t1_ft5gthg",
            "score": 6,
            "created_utc": 1591498060.0,
            "replies": []
        },
        {
            "body": "That sounds pretty damn awesome to me.  I don't see why you or OP can't just bring it up with the SD.  How many men will say \"no\" to having sex?  (LOL)  As long as it sounds reasonable, I can be flexible with planning in that way.",
            "author": null,
            "id": "ft7ylc3",
            "parent_id": "t1_ft5riaw",
            "score": 2,
            "created_utc": 1591490411.0,
            "replies": []
        },
        {
            "body": "Fucfirosophy??",
            "author": "SheThrowsGoodSugar",
            "id": "ft5m2au",
            "parent_id": "t1_ft5gclz",
            "score": 18,
            "created_utc": 1591466072.0,
            "replies": []
        },
        {
            "body": "I prefer to fuck first. It puts me at ease for the rest of the date",
            "author": null,
            "id": "ft6kjo4",
            "parent_id": "t1_ft5gclz",
            "score": 7,
            "created_utc": 1591475553.0,
            "replies": [
                {
                    "body": "Is this what I’ve been doing wrong? I feel so pressured throughout the date that I can’t focus on anything and when the time comes it’s never as good as it could have been. How do I convince him to not wait til the end?",
                    "author": "Finikan",
                    "id": "ft79t3r",
                    "parent_id": "t1_ft6kjo4",
                    "score": 2,
                    "created_utc": 1591482701.0,
                    "replies": [
                        {
                            "body": "Just tell him. I’m very straightforward and blunt, I just can’t help it.",
                            "author": null,
                            "id": "fukm9i5",
                            "parent_id": "t1_ft79t3r",
                            "score": 3,
                            "created_utc": 1591942489.0,
                            "replies": []
                        },
                        {
                            "body": "Most men will not be offended at all if you suggest sex, or \"make a move\", before he does.  I've had her say \"I can't wait until after dinner.  I need it now!\"  I was happy to oblige!  :)\n\nWe did miss dinner completely one time after falling asleep on the floor after a pretty spirited naked wrestling match...",
                            "author": "willfromvb",
                            "id": "ft9e9a9",
                            "parent_id": "t1_ft79t3r",
                            "score": 4,
                            "created_utc": 1591530739.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ft5jxvj",
            "parent_id": "t1_ft5gclz",
            "score": 5,
            "created_utc": 1591465454.0,
            "replies": [
                {
                    "body": "And it helps with blue balls / ovaries too!",
                    "author": "SeattleLaserMeteor",
                    "id": "ft5lqs5",
                    "parent_id": "t1_ft5jxvj",
                    "score": 4,
                    "created_utc": 1591465982.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Absolutely not for me. I'd have to get ready,  hair and makeup,  then redo after it gets messed up.  \n\nI'm a total fucking princess though.",
            "author": "_Fortuna_",
            "id": "ft5ry83",
            "parent_id": "t1_ft5gclz",
            "score": 11,
            "created_utc": 1591468118.0,
            "replies": [
                {
                    "body": "I prefer to work up an appetite first",
                    "author": "IntelligentExternal",
                    "id": "ft64uae",
                    "parent_id": "t1_ft5ry83",
                    "score": 4,
                    "created_utc": 1591471613.0,
                    "replies": [
                        {
                            "body": "Appetite is never an issue for me 😅",
                            "author": "_Fortuna_",
                            "id": "ft65rnl",
                            "parent_id": "t1_ft64uae",
                            "score": 3,
                            "created_utc": 1591471836.0,
                            "replies": []
                        },
                        {
                            "body": "Appetite for food or sex?",
                            "author": "bradpitt3",
                            "id": "ft6qlz7",
                            "parent_id": "t1_ft64uae",
                            "score": 1,
                            "created_utc": 1591477313.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wish mine would go for this!",
            "author": "Finikan",
            "id": "ft6icaz",
            "parent_id": "t1_ft5gclz",
            "score": 1,
            "created_utc": 1591474989.0,
            "replies": []
        },
        {
            "body": "Sorry who’s paying for the date and dinner again?",
            "author": null,
            "id": "ft9n64t",
            "parent_id": "t1_ft5gclz",
            "score": 0,
            "created_utc": 1591537546.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ft5liqi",
            "parent_id": "t1_ft5k7g2",
            "score": 8,
            "created_utc": 1591465915.0,
            "replies": [
                {
                    "body": "😂😂😂\n\nYasss girl!\nFor me it totally is- it even happens when I drink a lot of something too. 😩",
                    "author": "Dressedtokillxxx",
                    "id": "ft762g5",
                    "parent_id": "t1_ft5liqi",
                    "score": 5,
                    "created_utc": 1591481559.0,
                    "replies": [
                        {
                            "body": "Same 😩",
                            "author": "SheThrowsGoodSugar",
                            "id": "ft76h4m",
                            "parent_id": "t1_ft762g5",
                            "score": 3,
                            "created_utc": 1591481691.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And sex for food as well, I assume?",
            "author": "SheThrowsGoodSugar",
            "id": "ft5lvkf",
            "parent_id": "t1_ft5jtxb",
            "score": 9,
            "created_utc": 1591466021.0,
            "replies": [
                {
                    "body": "😬😬",
                    "author": "supportiveceo",
                    "id": "ft6dt81",
                    "parent_id": "t1_ft5lvkf",
                    "score": 1,
                    "created_utc": 1591473856.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What is it with all you people moving your bowels after dinner?  Am I in crazy town???\n\nlol just teasing!!!  But I'm shocked this is so common.  SLF once again opens my eyes to the real world :)   That's why I come here, to learn the important stuff",
            "author": "Azurecole",
            "id": "ft5uiiz",
            "parent_id": "t1_ft5te7n",
            "score": 2,
            "created_utc": 1591468852.0,
            "replies": []
        },
        {
            "body": "mmmm that shit is the best, I like my SB to have just the smallest amount of belly. One big hand placed directly in the front and one on the ass. I got excited just typing that, good thing the SB is on her way over.",
            "author": null,
            "id": "ft6yxdd",
            "parent_id": "t1_ft6jfa9",
            "score": 2,
            "created_utc": 1591479488.0,
            "replies": [
                {
                    "body": "Not when I’m bloated with a food baby.",
                    "author": "femuserhere",
                    "id": "ft6zxmo",
                    "parent_id": "t1_ft6yxdd",
                    "score": 2,
                    "created_utc": 1591479757.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can I rub your belly 🥺",
            "author": null,
            "id": "ft8ognt",
            "parent_id": "t1_ft6jfa9",
            "score": 2,
            "created_utc": 1591506179.0,
            "replies": [
                {
                    "body": "You can be the exception. Use your magic hands to put me into labor",
                    "author": "femuserhere",
                    "id": "ftax9mi",
                    "parent_id": "t1_ft8ognt",
                    "score": 1,
                    "created_utc": 1591563202.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">If I knew she moved her bowels after dinner, that would be all I need to know, I'd definitely shift to sex before dinner!\n\nHow would one tastefully and tactfully make their SD aware of such tendencies? Should one? Or like others mentioned, would it best to ask the SD to have the sex first without going into details?",
            "author": "SheThrowsGoodSugar",
            "id": "ft5ooku",
            "parent_id": "t1_ft5nces",
            "score": 7,
            "created_utc": 1591466935.0,
            "replies": [
                {
                    "body": "I think I personally would notice (I *think*).  But if I didn't, I'm trying to imagine what might work best on me lol...  Maybe something along the lines of:  \"Would you enjoy having sex before dinner instead?  I love having sex right away when I'm super energized, and after dinner I always feel a little more bloated\".\n\nSo, make it about how much better the sex will be if we have it before dinner, and then just a subtle mention of being bloated or stomach upset, and I think most guys will get it.\n\nQuestion: would some drinks at the bar to warm us up so we can flirt and get a little horny work?  Or does that kick off the GI runaway reaction?",
                    "author": "Azurecole",
                    "id": "ft5tar2",
                    "parent_id": "t1_ft5ooku",
                    "score": 7,
                    "created_utc": 1591468517.0,
                    "replies": [
                        {
                            "body": "Thanks for the sound advice!\n\nNot sure if that question is for me but I don't drink. I'm plenty wild without the alcohol 😈. I guess I could do mocktails if my SD wanted to drink.",
                            "author": "SheThrowsGoodSugar",
                            "id": "ft5uu0f",
                            "parent_id": "t1_ft5tar2",
                            "score": 3,
                            "created_utc": 1591468939.0,
                            "replies": [
                                {
                                    "body": "Yes, the question was for you.  The reason I asked is because what I might struggle with a bit is: you show up to the room, we exchange niceties, and 10 minutes later we're having sex.  I like to be positively *aching* for her by the time we're having sex; my IQ should have dropped at least 20 points.  That's easily accomplished: go to the hotel bar, talk and flirt and drink (the drinking is less important than the talking and flirting), then head upstairs when I can't keep my hands off her.  THAT would work fine for me.  But at least 30-60 minutes of socializing first.\n\nTL;DR: You want that primo Vitamin Azure, you gotta warm me up first 🤣🤣",
                                    "author": "Azurecole",
                                    "id": "ft5wkkw",
                                    "parent_id": "t1_ft5uu0f",
                                    "score": 6,
                                    "created_utc": 1591469410.0,
                                    "replies": [
                                        {
                                            "body": "Not too hard to accomplish, I feel! I could have a good ol' club soda with lime and flirt my way to the \"can't keep my hands off her\" stage as your drink starts making your IQ drop to a sexy level.",
                                            "author": "SheThrowsGoodSugar",
                                            "id": "ft5ykzt",
                                            "parent_id": "t1_ft5wkkw",
                                            "score": 5,
                                            "created_utc": 1591469968.0,
                                            "replies": [
                                                {
                                                    "body": "How *you* doin'?",
                                                    "author": "Azurecole",
                                                    "id": "ft5zb8a",
                                                    "parent_id": "t1_ft5ykzt",
                                                    "score": 4,
                                                    "created_utc": 1591470188.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "ft5zrby",
                                                            "parent_id": "t1_ft5zb8a",
                                                            "score": 3,
                                                            "created_utc": 1591470316.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How does this work? I've heard of other people doing this in vanilla relationships too. I'm assuming you keep snacking in between the sessions instead of actual meals?",
            "author": "SheThrowsGoodSugar",
            "id": "ft5n1aw",
            "parent_id": "t1_ft5ies8",
            "score": 2,
            "created_utc": 1591466384.0,
            "replies": [
                {
                    "body": "When I've done it, it was never really planned.  You just kinda go with the flow.  In some cases - we've cancelled dinner reservations.\n\nExample:\n\nMe:  \"Hey, it's 3pm.  I'm hungry, we fucked our way through lunch.  But we have a 7pm dinner reservation.  What are you thinking?\"\n\nHer:  You want to just skip dinner, and order something now, with extras for later?  \n\nBut yes - snacking + ordering food is the main way to do it.  \n\nTo put in perspective, before uber eats, Pizza + Chinese used to be very common for this.  And both are things really easy to order a bunch of to have around.",
                    "author": "SDstartingOut",
                    "id": "ft5v1b1",
                    "parent_id": "t1_ft5n1aw",
                    "score": 6,
                    "created_utc": 1591468994.0,
                    "replies": []
                },
                {
                    "body": "Yes I am talking about a meet at home, we have done this in hotels also with door dash, uber eats or I just bring some food along. Yes we will go for a round, take a break snack a bit, this just leads into another round, a break, snacking and another round (repeat until someone gives up)",
                    "author": null,
                    "id": "ft6y2gp",
                    "parent_id": "t1_ft5n1aw",
                    "score": 1,
                    "created_utc": 1591479264.0,
                    "replies": [
                        {
                            "body": "Sounds like life in heaven.",
                            "author": "SheThrowsGoodSugar",
                            "id": "ft6ywv6",
                            "parent_id": "t1_ft6y2gp",
                            "score": 2,
                            "created_utc": 1591479484.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Also, if you really like to meet in public before, to make triple sure everyone is on the same page or whatever before getting bcd, order take out!  Plan ahead with a bottle of whatever, and you get a pic nic between round one and the other, if that happens.",
            "author": "NCtriadSD",
            "id": "ft79fl6",
            "parent_id": "t1_ft78znj",
            "score": 1,
            "created_utc": 1591482589.0,
            "replies": []
        },
        {
            "body": "Others here have commented that they eat light. This would help with typical evening date progression.",
            "author": "SheThrowsGoodSugar",
            "id": "ft7dgg5",
            "parent_id": "t1_ft7c5hk",
            "score": 1,
            "created_utc": 1591483715.0,
            "replies": []
        },
        {
            "body": "Care to expand?",
            "author": "SheThrowsGoodSugar",
            "id": "ft5q12g",
            "parent_id": "t1_ft5n2m2",
            "score": 3,
            "created_utc": 1591467472.0,
            "replies": [
                {
                    "body": "Yes. She would show up at my apt. We would go for round 1. Then we would go for a nice romantic dinner. Come back to my place for round 2 and beyond.",
                    "author": null,
                    "id": "ft7jw46",
                    "parent_id": "t1_ft5q12g",
                    "score": 1,
                    "created_utc": 1591485505.0,
                    "replies": [
                        {
                            "body": "Very similar. We would meet. Once inside the room. Press her against the wall from behind and kiss her neck and ear. That started her engine, moved to the bed for a little DATY. We cuddle after her O for a 1/2 hr or so then hit dinner. After eats always did some type of activity for a few hours. Then once back it was on like like donkey Kong. She always liked my rule. If she doesn’t O, nobody does. Plus that before dinner escapade really told me how into seeing me she was cause there would be a whole lot of wetness felt as soon as I started. \n\nA few others were dry as a bone.",
                            "author": "SingleCondition4",
                            "id": "ft887gs",
                            "parent_id": "t1_ft7jw46",
                            "score": 1,
                            "created_utc": 1591495480.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's definitely helpful! I'm glad you brought it up. I like to take a quick shower and wash everything down there. The cleaner, the better.",
            "author": "SheThrowsGoodSugar",
            "id": "ft8bq0h",
            "parent_id": "t1_ft8a7yj",
            "score": 3,
            "created_utc": 1591497635.0,
            "replies": [
                {
                    "body": "For sure! Otherwise - ewww. I feel like that’s disgusting and disrespectful.",
                    "author": "jawslovesme",
                    "id": "ft8nscl",
                    "parent_id": "t1_ft8bq0h",
                    "score": 1,
                    "created_utc": 1591505672.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're a pro! You weren't lying when you said you've got it figured out to the T.",
            "author": "SheThrowsGoodSugar",
            "id": "ft6kqid",
            "parent_id": "t1_ft68xpt",
            "score": 1,
            "created_utc": 1591475606.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ft7nqqh",
            "parent_id": "t1_ft7lv70",
            "score": 1,
            "created_utc": 1591486584.0,
            "replies": [
                {
                    "body": "No super short actually.",
                    "author": "TwitchyArtist",
                    "id": "ft7nu74",
                    "parent_id": "t1_ft7nqqh",
                    "score": 1,
                    "created_utc": 1591486611.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ft7ohsw",
                            "parent_id": "t1_ft7nu74",
                            "score": 1,
                            "created_utc": 1591486789.0,
                            "replies": [
                                {
                                    "body": "Lol I'm 4\"11 but I'm very small in general only 75lbs",
                                    "author": "TwitchyArtist",
                                    "id": "ft7on3x",
                                    "parent_id": "t1_ft7ohsw",
                                    "score": 2,
                                    "created_utc": 1591486829.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Whaat?! 2-3 rounds after dinner? How long is the wait between dinner and sex? How much do you eat (proper full meal, light, munching, etc.)?",
            "author": "SheThrowsGoodSugar",
            "id": "ft7adym",
            "parent_id": "t1_ft793zm",
            "score": 3,
            "created_utc": 1591482865.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ft7b99t",
                    "parent_id": "t1_ft7adym",
                    "score": 0,
                    "created_utc": 1591483106.0,
                    "replies": [
                        {
                            "body": "Apps/main/dessert is a heavy meal. I would look pregnant after that haha.",
                            "author": "SheThrowsGoodSugar",
                            "id": "ft7c4wb",
                            "parent_id": "t1_ft7b99t",
                            "score": 2,
                            "created_utc": 1591483347.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ft7c9bx",
                                    "parent_id": "t1_ft7c4wb",
                                    "score": 1,
                                    "created_utc": 1591483382.0,
                                    "replies": [
                                        {
                                            "body": "Oh ok. Still heavy though lol. But I guess it depends on the serving size.",
                                            "author": "SheThrowsGoodSugar",
                                            "id": "ft7csqi",
                                            "parent_id": "t1_ft7c9bx",
                                            "score": 2,
                                            "created_utc": 1591483531.0,
                                            "replies": [
                                                {
                                                    "body": "> Oh ok. Still heavy though lol. But I guess it depends on the serving size.\n\nThis is one thing I really miss about living in Europe.  They have appetizers & deserts right.\n\nIn the US - appetizers & deserts are often a meal (in terms of calories) on their own.  Not something light.",
                                                    "author": "SDstartingOut",
                                                    "id": "ft8eusq",
                                                    "parent_id": "t1_ft7csqi",
                                                    "score": 1,
                                                    "created_utc": 1591499630.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Is this what I’ve been doing wrong? I feel so pressured throughout the date that I can’t focus on anything and when the time comes it’s never as good as it could have been. How do I convince him to not wait til the end?",
            "author": "Finikan",
            "id": "ft79t3r",
            "parent_id": "t1_ft6kjo4",
            "score": 2,
            "created_utc": 1591482701.0,
            "replies": [
                {
                    "body": "Just tell him. I’m very straightforward and blunt, I just can’t help it.",
                    "author": null,
                    "id": "fukm9i5",
                    "parent_id": "t1_ft79t3r",
                    "score": 3,
                    "created_utc": 1591942489.0,
                    "replies": []
                },
                {
                    "body": "Most men will not be offended at all if you suggest sex, or \"make a move\", before he does.  I've had her say \"I can't wait until after dinner.  I need it now!\"  I was happy to oblige!  :)\n\nWe did miss dinner completely one time after falling asleep on the floor after a pretty spirited naked wrestling match...",
                    "author": "willfromvb",
                    "id": "ft9e9a9",
                    "parent_id": "t1_ft79t3r",
                    "score": 4,
                    "created_utc": 1591530739.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And it helps with blue balls / ovaries too!",
            "author": "SeattleLaserMeteor",
            "id": "ft5lqs5",
            "parent_id": "t1_ft5jxvj",
            "score": 4,
            "created_utc": 1591465982.0,
            "replies": []
        },
        {
            "body": "I prefer to work up an appetite first",
            "author": "IntelligentExternal",
            "id": "ft64uae",
            "parent_id": "t1_ft5ry83",
            "score": 4,
            "created_utc": 1591471613.0,
            "replies": [
                {
                    "body": "Appetite is never an issue for me 😅",
                    "author": "_Fortuna_",
                    "id": "ft65rnl",
                    "parent_id": "t1_ft64uae",
                    "score": 3,
                    "created_utc": 1591471836.0,
                    "replies": []
                },
                {
                    "body": "Appetite for food or sex?",
                    "author": "bradpitt3",
                    "id": "ft6qlz7",
                    "parent_id": "t1_ft64uae",
                    "score": 1,
                    "created_utc": 1591477313.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😂😂😂\n\nYasss girl!\nFor me it totally is- it even happens when I drink a lot of something too. 😩",
            "author": "Dressedtokillxxx",
            "id": "ft762g5",
            "parent_id": "t1_ft5liqi",
            "score": 5,
            "created_utc": 1591481559.0,
            "replies": [
                {
                    "body": "Same 😩",
                    "author": "SheThrowsGoodSugar",
                    "id": "ft76h4m",
                    "parent_id": "t1_ft762g5",
                    "score": 3,
                    "created_utc": 1591481691.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😬😬",
            "author": "supportiveceo",
            "id": "ft6dt81",
            "parent_id": "t1_ft5lvkf",
            "score": 1,
            "created_utc": 1591473856.0,
            "replies": []
        },
        {
            "body": "Not when I’m bloated with a food baby.",
            "author": "femuserhere",
            "id": "ft6zxmo",
            "parent_id": "t1_ft6yxdd",
            "score": 2,
            "created_utc": 1591479757.0,
            "replies": []
        },
        {
            "body": "You can be the exception. Use your magic hands to put me into labor",
            "author": "femuserhere",
            "id": "ftax9mi",
            "parent_id": "t1_ft8ognt",
            "score": 1,
            "created_utc": 1591563202.0,
            "replies": []
        },
        {
            "body": "I think I personally would notice (I *think*).  But if I didn't, I'm trying to imagine what might work best on me lol...  Maybe something along the lines of:  \"Would you enjoy having sex before dinner instead?  I love having sex right away when I'm super energized, and after dinner I always feel a little more bloated\".\n\nSo, make it about how much better the sex will be if we have it before dinner, and then just a subtle mention of being bloated or stomach upset, and I think most guys will get it.\n\nQuestion: would some drinks at the bar to warm us up so we can flirt and get a little horny work?  Or does that kick off the GI runaway reaction?",
            "author": "Azurecole",
            "id": "ft5tar2",
            "parent_id": "t1_ft5ooku",
            "score": 7,
            "created_utc": 1591468517.0,
            "replies": [
                {
                    "body": "Thanks for the sound advice!\n\nNot sure if that question is for me but I don't drink. I'm plenty wild without the alcohol 😈. I guess I could do mocktails if my SD wanted to drink.",
                    "author": "SheThrowsGoodSugar",
                    "id": "ft5uu0f",
                    "parent_id": "t1_ft5tar2",
                    "score": 3,
                    "created_utc": 1591468939.0,
                    "replies": [
                        {
                            "body": "Yes, the question was for you.  The reason I asked is because what I might struggle with a bit is: you show up to the room, we exchange niceties, and 10 minutes later we're having sex.  I like to be positively *aching* for her by the time we're having sex; my IQ should have dropped at least 20 points.  That's easily accomplished: go to the hotel bar, talk and flirt and drink (the drinking is less important than the talking and flirting), then head upstairs when I can't keep my hands off her.  THAT would work fine for me.  But at least 30-60 minutes of socializing first.\n\nTL;DR: You want that primo Vitamin Azure, you gotta warm me up first 🤣🤣",
                            "author": "Azurecole",
                            "id": "ft5wkkw",
                            "parent_id": "t1_ft5uu0f",
                            "score": 6,
                            "created_utc": 1591469410.0,
                            "replies": [
                                {
                                    "body": "Not too hard to accomplish, I feel! I could have a good ol' club soda with lime and flirt my way to the \"can't keep my hands off her\" stage as your drink starts making your IQ drop to a sexy level.",
                                    "author": "SheThrowsGoodSugar",
                                    "id": "ft5ykzt",
                                    "parent_id": "t1_ft5wkkw",
                                    "score": 5,
                                    "created_utc": 1591469968.0,
                                    "replies": [
                                        {
                                            "body": "How *you* doin'?",
                                            "author": "Azurecole",
                                            "id": "ft5zb8a",
                                            "parent_id": "t1_ft5ykzt",
                                            "score": 4,
                                            "created_utc": 1591470188.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "ft5zrby",
                                                    "parent_id": "t1_ft5zb8a",
                                                    "score": 3,
                                                    "created_utc": 1591470316.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "When I've done it, it was never really planned.  You just kinda go with the flow.  In some cases - we've cancelled dinner reservations.\n\nExample:\n\nMe:  \"Hey, it's 3pm.  I'm hungry, we fucked our way through lunch.  But we have a 7pm dinner reservation.  What are you thinking?\"\n\nHer:  You want to just skip dinner, and order something now, with extras for later?  \n\nBut yes - snacking + ordering food is the main way to do it.  \n\nTo put in perspective, before uber eats, Pizza + Chinese used to be very common for this.  And both are things really easy to order a bunch of to have around.",
            "author": "SDstartingOut",
            "id": "ft5v1b1",
            "parent_id": "t1_ft5n1aw",
            "score": 6,
            "created_utc": 1591468994.0,
            "replies": []
        },
        {
            "body": "Yes I am talking about a meet at home, we have done this in hotels also with door dash, uber eats or I just bring some food along. Yes we will go for a round, take a break snack a bit, this just leads into another round, a break, snacking and another round (repeat until someone gives up)",
            "author": null,
            "id": "ft6y2gp",
            "parent_id": "t1_ft5n1aw",
            "score": 1,
            "created_utc": 1591479264.0,
            "replies": [
                {
                    "body": "Sounds like life in heaven.",
                    "author": "SheThrowsGoodSugar",
                    "id": "ft6ywv6",
                    "parent_id": "t1_ft6y2gp",
                    "score": 2,
                    "created_utc": 1591479484.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes. She would show up at my apt. We would go for round 1. Then we would go for a nice romantic dinner. Come back to my place for round 2 and beyond.",
            "author": null,
            "id": "ft7jw46",
            "parent_id": "t1_ft5q12g",
            "score": 1,
            "created_utc": 1591485505.0,
            "replies": [
                {
                    "body": "Very similar. We would meet. Once inside the room. Press her against the wall from behind and kiss her neck and ear. That started her engine, moved to the bed for a little DATY. We cuddle after her O for a 1/2 hr or so then hit dinner. After eats always did some type of activity for a few hours. Then once back it was on like like donkey Kong. She always liked my rule. If she doesn’t O, nobody does. Plus that before dinner escapade really told me how into seeing me she was cause there would be a whole lot of wetness felt as soon as I started. \n\nA few others were dry as a bone.",
                    "author": "SingleCondition4",
                    "id": "ft887gs",
                    "parent_id": "t1_ft7jw46",
                    "score": 1,
                    "created_utc": 1591495480.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For sure! Otherwise - ewww. I feel like that’s disgusting and disrespectful.",
            "author": "jawslovesme",
            "id": "ft8nscl",
            "parent_id": "t1_ft8bq0h",
            "score": 1,
            "created_utc": 1591505672.0,
            "replies": []
        },
        {
            "body": "No super short actually.",
            "author": "TwitchyArtist",
            "id": "ft7nu74",
            "parent_id": "t1_ft7nqqh",
            "score": 1,
            "created_utc": 1591486611.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ft7ohsw",
                    "parent_id": "t1_ft7nu74",
                    "score": 1,
                    "created_utc": 1591486789.0,
                    "replies": [
                        {
                            "body": "Lol I'm 4\"11 but I'm very small in general only 75lbs",
                            "author": "TwitchyArtist",
                            "id": "ft7on3x",
                            "parent_id": "t1_ft7ohsw",
                            "score": 2,
                            "created_utc": 1591486829.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ft7b99t",
            "parent_id": "t1_ft7adym",
            "score": 0,
            "created_utc": 1591483106.0,
            "replies": [
                {
                    "body": "Apps/main/dessert is a heavy meal. I would look pregnant after that haha.",
                    "author": "SheThrowsGoodSugar",
                    "id": "ft7c4wb",
                    "parent_id": "t1_ft7b99t",
                    "score": 2,
                    "created_utc": 1591483347.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ft7c9bx",
                            "parent_id": "t1_ft7c4wb",
                            "score": 1,
                            "created_utc": 1591483382.0,
                            "replies": [
                                {
                                    "body": "Oh ok. Still heavy though lol. But I guess it depends on the serving size.",
                                    "author": "SheThrowsGoodSugar",
                                    "id": "ft7csqi",
                                    "parent_id": "t1_ft7c9bx",
                                    "score": 2,
                                    "created_utc": 1591483531.0,
                                    "replies": [
                                        {
                                            "body": "> Oh ok. Still heavy though lol. But I guess it depends on the serving size.\n\nThis is one thing I really miss about living in Europe.  They have appetizers & deserts right.\n\nIn the US - appetizers & deserts are often a meal (in terms of calories) on their own.  Not something light.",
                                            "author": "SDstartingOut",
                                            "id": "ft8eusq",
                                            "parent_id": "t1_ft7csqi",
                                            "score": 1,
                                            "created_utc": 1591499630.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just tell him. I’m very straightforward and blunt, I just can’t help it.",
            "author": null,
            "id": "fukm9i5",
            "parent_id": "t1_ft79t3r",
            "score": 3,
            "created_utc": 1591942489.0,
            "replies": []
        },
        {
            "body": "Most men will not be offended at all if you suggest sex, or \"make a move\", before he does.  I've had her say \"I can't wait until after dinner.  I need it now!\"  I was happy to oblige!  :)\n\nWe did miss dinner completely one time after falling asleep on the floor after a pretty spirited naked wrestling match...",
            "author": "willfromvb",
            "id": "ft9e9a9",
            "parent_id": "t1_ft79t3r",
            "score": 4,
            "created_utc": 1591530739.0,
            "replies": []
        },
        {
            "body": "Appetite is never an issue for me 😅",
            "author": "_Fortuna_",
            "id": "ft65rnl",
            "parent_id": "t1_ft64uae",
            "score": 3,
            "created_utc": 1591471836.0,
            "replies": []
        },
        {
            "body": "Appetite for food or sex?",
            "author": "bradpitt3",
            "id": "ft6qlz7",
            "parent_id": "t1_ft64uae",
            "score": 1,
            "created_utc": 1591477313.0,
            "replies": []
        },
        {
            "body": "Same 😩",
            "author": "SheThrowsGoodSugar",
            "id": "ft76h4m",
            "parent_id": "t1_ft762g5",
            "score": 3,
            "created_utc": 1591481691.0,
            "replies": []
        },
        {
            "body": "Thanks for the sound advice!\n\nNot sure if that question is for me but I don't drink. I'm plenty wild without the alcohol 😈. I guess I could do mocktails if my SD wanted to drink.",
            "author": "SheThrowsGoodSugar",
            "id": "ft5uu0f",
            "parent_id": "t1_ft5tar2",
            "score": 3,
            "created_utc": 1591468939.0,
            "replies": [
                {
                    "body": "Yes, the question was for you.  The reason I asked is because what I might struggle with a bit is: you show up to the room, we exchange niceties, and 10 minutes later we're having sex.  I like to be positively *aching* for her by the time we're having sex; my IQ should have dropped at least 20 points.  That's easily accomplished: go to the hotel bar, talk and flirt and drink (the drinking is less important than the talking and flirting), then head upstairs when I can't keep my hands off her.  THAT would work fine for me.  But at least 30-60 minutes of socializing first.\n\nTL;DR: You want that primo Vitamin Azure, you gotta warm me up first 🤣🤣",
                    "author": "Azurecole",
                    "id": "ft5wkkw",
                    "parent_id": "t1_ft5uu0f",
                    "score": 6,
                    "created_utc": 1591469410.0,
                    "replies": [
                        {
                            "body": "Not too hard to accomplish, I feel! I could have a good ol' club soda with lime and flirt my way to the \"can't keep my hands off her\" stage as your drink starts making your IQ drop to a sexy level.",
                            "author": "SheThrowsGoodSugar",
                            "id": "ft5ykzt",
                            "parent_id": "t1_ft5wkkw",
                            "score": 5,
                            "created_utc": 1591469968.0,
                            "replies": [
                                {
                                    "body": "How *you* doin'?",
                                    "author": "Azurecole",
                                    "id": "ft5zb8a",
                                    "parent_id": "t1_ft5ykzt",
                                    "score": 4,
                                    "created_utc": 1591470188.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ft5zrby",
                                            "parent_id": "t1_ft5zb8a",
                                            "score": 3,
                                            "created_utc": 1591470316.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sounds like life in heaven.",
            "author": "SheThrowsGoodSugar",
            "id": "ft6ywv6",
            "parent_id": "t1_ft6y2gp",
            "score": 2,
            "created_utc": 1591479484.0,
            "replies": []
        },
        {
            "body": "Very similar. We would meet. Once inside the room. Press her against the wall from behind and kiss her neck and ear. That started her engine, moved to the bed for a little DATY. We cuddle after her O for a 1/2 hr or so then hit dinner. After eats always did some type of activity for a few hours. Then once back it was on like like donkey Kong. She always liked my rule. If she doesn’t O, nobody does. Plus that before dinner escapade really told me how into seeing me she was cause there would be a whole lot of wetness felt as soon as I started. \n\nA few others were dry as a bone.",
            "author": "SingleCondition4",
            "id": "ft887gs",
            "parent_id": "t1_ft7jw46",
            "score": 1,
            "created_utc": 1591495480.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ft7ohsw",
            "parent_id": "t1_ft7nu74",
            "score": 1,
            "created_utc": 1591486789.0,
            "replies": [
                {
                    "body": "Lol I'm 4\"11 but I'm very small in general only 75lbs",
                    "author": "TwitchyArtist",
                    "id": "ft7on3x",
                    "parent_id": "t1_ft7ohsw",
                    "score": 2,
                    "created_utc": 1591486829.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Apps/main/dessert is a heavy meal. I would look pregnant after that haha.",
            "author": "SheThrowsGoodSugar",
            "id": "ft7c4wb",
            "parent_id": "t1_ft7b99t",
            "score": 2,
            "created_utc": 1591483347.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ft7c9bx",
                    "parent_id": "t1_ft7c4wb",
                    "score": 1,
                    "created_utc": 1591483382.0,
                    "replies": [
                        {
                            "body": "Oh ok. Still heavy though lol. But I guess it depends on the serving size.",
                            "author": "SheThrowsGoodSugar",
                            "id": "ft7csqi",
                            "parent_id": "t1_ft7c9bx",
                            "score": 2,
                            "created_utc": 1591483531.0,
                            "replies": [
                                {
                                    "body": "> Oh ok. Still heavy though lol. But I guess it depends on the serving size.\n\nThis is one thing I really miss about living in Europe.  They have appetizers & deserts right.\n\nIn the US - appetizers & deserts are often a meal (in terms of calories) on their own.  Not something light.",
                                    "author": "SDstartingOut",
                                    "id": "ft8eusq",
                                    "parent_id": "t1_ft7csqi",
                                    "score": 1,
                                    "created_utc": 1591499630.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, the question was for you.  The reason I asked is because what I might struggle with a bit is: you show up to the room, we exchange niceties, and 10 minutes later we're having sex.  I like to be positively *aching* for her by the time we're having sex; my IQ should have dropped at least 20 points.  That's easily accomplished: go to the hotel bar, talk and flirt and drink (the drinking is less important than the talking and flirting), then head upstairs when I can't keep my hands off her.  THAT would work fine for me.  But at least 30-60 minutes of socializing first.\n\nTL;DR: You want that primo Vitamin Azure, you gotta warm me up first 🤣🤣",
            "author": "Azurecole",
            "id": "ft5wkkw",
            "parent_id": "t1_ft5uu0f",
            "score": 6,
            "created_utc": 1591469410.0,
            "replies": [
                {
                    "body": "Not too hard to accomplish, I feel! I could have a good ol' club soda with lime and flirt my way to the \"can't keep my hands off her\" stage as your drink starts making your IQ drop to a sexy level.",
                    "author": "SheThrowsGoodSugar",
                    "id": "ft5ykzt",
                    "parent_id": "t1_ft5wkkw",
                    "score": 5,
                    "created_utc": 1591469968.0,
                    "replies": [
                        {
                            "body": "How *you* doin'?",
                            "author": "Azurecole",
                            "id": "ft5zb8a",
                            "parent_id": "t1_ft5ykzt",
                            "score": 4,
                            "created_utc": 1591470188.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ft5zrby",
                                    "parent_id": "t1_ft5zb8a",
                                    "score": 3,
                                    "created_utc": 1591470316.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol I'm 4\"11 but I'm very small in general only 75lbs",
            "author": "TwitchyArtist",
            "id": "ft7on3x",
            "parent_id": "t1_ft7ohsw",
            "score": 2,
            "created_utc": 1591486829.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ft7c9bx",
            "parent_id": "t1_ft7c4wb",
            "score": 1,
            "created_utc": 1591483382.0,
            "replies": [
                {
                    "body": "Oh ok. Still heavy though lol. But I guess it depends on the serving size.",
                    "author": "SheThrowsGoodSugar",
                    "id": "ft7csqi",
                    "parent_id": "t1_ft7c9bx",
                    "score": 2,
                    "created_utc": 1591483531.0,
                    "replies": [
                        {
                            "body": "> Oh ok. Still heavy though lol. But I guess it depends on the serving size.\n\nThis is one thing I really miss about living in Europe.  They have appetizers & deserts right.\n\nIn the US - appetizers & deserts are often a meal (in terms of calories) on their own.  Not something light.",
                            "author": "SDstartingOut",
                            "id": "ft8eusq",
                            "parent_id": "t1_ft7csqi",
                            "score": 1,
                            "created_utc": 1591499630.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not too hard to accomplish, I feel! I could have a good ol' club soda with lime and flirt my way to the \"can't keep my hands off her\" stage as your drink starts making your IQ drop to a sexy level.",
            "author": "SheThrowsGoodSugar",
            "id": "ft5ykzt",
            "parent_id": "t1_ft5wkkw",
            "score": 5,
            "created_utc": 1591469968.0,
            "replies": [
                {
                    "body": "How *you* doin'?",
                    "author": "Azurecole",
                    "id": "ft5zb8a",
                    "parent_id": "t1_ft5ykzt",
                    "score": 4,
                    "created_utc": 1591470188.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ft5zrby",
                            "parent_id": "t1_ft5zb8a",
                            "score": 3,
                            "created_utc": 1591470316.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh ok. Still heavy though lol. But I guess it depends on the serving size.",
            "author": "SheThrowsGoodSugar",
            "id": "ft7csqi",
            "parent_id": "t1_ft7c9bx",
            "score": 2,
            "created_utc": 1591483531.0,
            "replies": [
                {
                    "body": "> Oh ok. Still heavy though lol. But I guess it depends on the serving size.\n\nThis is one thing I really miss about living in Europe.  They have appetizers & deserts right.\n\nIn the US - appetizers & deserts are often a meal (in terms of calories) on their own.  Not something light.",
                    "author": "SDstartingOut",
                    "id": "ft8eusq",
                    "parent_id": "t1_ft7csqi",
                    "score": 1,
                    "created_utc": 1591499630.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How *you* doin'?",
            "author": "Azurecole",
            "id": "ft5zb8a",
            "parent_id": "t1_ft5ykzt",
            "score": 4,
            "created_utc": 1591470188.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ft5zrby",
                    "parent_id": "t1_ft5zb8a",
                    "score": 3,
                    "created_utc": 1591470316.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Oh ok. Still heavy though lol. But I guess it depends on the serving size.\n\nThis is one thing I really miss about living in Europe.  They have appetizers & deserts right.\n\nIn the US - appetizers & deserts are often a meal (in terms of calories) on their own.  Not something light.",
            "author": "SDstartingOut",
            "id": "ft8eusq",
            "parent_id": "t1_ft7csqi",
            "score": 1,
            "created_utc": 1591499630.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ft5zrby",
            "parent_id": "t1_ft5zb8a",
            "score": 3,
            "created_utc": 1591470316.0,
            "replies": []
        }
    ]
}