{
    "title": "My first SD passed away Update",
    "post_id": "demutr",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/demutr/my_first_sd_passed_away_update/",
    "author": "IAlwaysFloat",
    "body": "Hi everyone! Thank you to all of you for reaching out and being such a great support system when I posted about my first SD passing away. This is a different account because I couldn’t remember my password for my previous account (u/slinkyinthebag). I took some time for myself and am finally in a place where I’ve accepted that “D” is not coming back. (He’s probably just watching me judging every move I make). \n\nA little update! I got accepted into my MBA program, I start next fall. I’m also starring in a new TV show as a main character so hopefully it gets good reviews and we all get to keep our jobs— fingers crossed 🤞. I’m so excited for everything that is coming up. \n\nI wanted to say that I am truly thankful for the sugar bowl. I found someone I really connected with through this world. We supported one another, laughed, cried, traveled— hell, he even saw me without makeup— and I saw him at his worst. Yet, we were still beautiful to one another. Oh, and guess the hell what? D’s daughter reached out to me via email shortly after his funeral and wanted to get coffee, I accepted. She’s everything I imagined her to be. D would always talk about her and I already had a picture of what she would be like engraved in my mind. She’s so accepting and full of love. How did I get so lucky? \n\nI know a lot of SR’s don’t work out this way but if you truly care about one another, you’ll show respect to each other and appreciate who you’ve found. Don’t settle for less, find someone that supports you! Whether it be in the sugar bowl, or in the vanilla world. If I end up marrying someone that’s an asshole to me, D promised he’d set my pillow on fire in the middle of the night whether he’s alive or dead. When that time comes, I’ll file for divorce that same day. \n\nAnyway, I’ll be commenting every now and then giving our newbies advice. So a little message to the new SB’s... please do your research before posting. If you’re asking if it’s a scam or not, it most likely is. If it sounds too good to be true, it most likely is. If he asks to meet in his hotel room on the first meeting, don’t freaking go. Sugaring should be supplemental to your life, not a primary income. I hope you all meet someone who is good to you and supports you even after they’re no longer here. Have a good day everyone, I hope you see me on TV 😊",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/demutr/my_first_sd_passed_away_update/",
    "score": 111,
    "upvote_ratio": 0.95,
    "created_utc": 1570470073.0,
    "num_comments": 10,
    "links": [
        [
            "/u/slinkyinthebag"
        ]
    ],
    "comments": [
        {
            "body": "Wonderful update and so good to hear you got to meet his daughter and that she was kind and accepting.  The true connections really are special and I am sorry for your loss.  We should all be so lucky as to find someone as amazing as it sounds like you were for each other.\n\nBreak a leg on the new show!!",
            "author": "cassiedear",
            "id": "f2x36br",
            "parent_id": "t3_demutr",
            "score": 11,
            "created_utc": 1570473247.0,
            "replies": [
                {
                    "body": "Thank you!",
                    "author": "IAlwaysFloat",
                    "id": "f2x830q",
                    "parent_id": "t1_f2x36br",
                    "score": 2,
                    "created_utc": 1570474757.0,
                    "replies": []
                },
                {
                    "body": "tears and smiles at this end .......   a class act on both ends \n\nand you presumably own the screen rights to the story    and the classic \n\nslinkyinthebag",
                    "author": "pinotandsugar",
                    "id": "f2xes9a",
                    "parent_id": "t1_f2x36br",
                    "score": 1,
                    "created_utc": 1570477564.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I had recently joined this forum when you originally posted and it was one of the posts I read. I’ve been wondering about you because that post stood out so much. Thank you for the update! Congrats on the MBA acceptance and the show. It seems like you have huge things coming your way and you deserve all of it.",
            "author": "soullessfreckles",
            "id": "f2xhvw3",
            "parent_id": "t3_demutr",
            "score": 3,
            "created_utc": 1570478583.0,
            "replies": []
        },
        {
            "body": "Thanks for the update and congratulations on your new job. Good people always find each other in the end. I’m glad “D” was able to make a positive impact on your life. All the best for your new relationships in life.",
            "author": "supportiveceo",
            "id": "f2wvcxv",
            "parent_id": "t3_demutr",
            "score": 2,
            "created_utc": 1570470650.0,
            "replies": [
                {
                    "body": "Thank you so much!",
                    "author": "IAlwaysFloat",
                    "id": "f2x80we",
                    "parent_id": "t1_f2wvcxv",
                    "score": 2,
                    "created_utc": 1570474737.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Glad to hear things worked out in the end. Sorry to hear the loss but from what it sounds like the great memories weight out the bad. And when the time comes around let me know what show it is you’re in! Would love to give it a watch sometime 😊",
            "author": null,
            "id": "f2xb1yc",
            "parent_id": "t3_demutr",
            "score": 2,
            "created_utc": 1570475736.0,
            "replies": []
        },
        {
            "body": "Awesome love ❤️",
            "author": "absthaw",
            "id": "f2xbch9",
            "parent_id": "t3_demutr",
            "score": 2,
            "created_utc": 1570475842.0,
            "replies": []
        },
        {
            "body": "Woohoo!!!!  Congrats!",
            "author": "mtncityguy",
            "id": "f2xdhpo",
            "parent_id": "t3_demutr",
            "score": 2,
            "created_utc": 1570476909.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f301m9c",
            "parent_id": "t3_demutr",
            "score": 1,
            "created_utc": 1570544289.0,
            "replies": [
                {
                    "body": "Heart warming... Hope all goes your way. Reading this made my day..😊",
                    "author": "Luke2315",
                    "id": "f30tiev",
                    "parent_id": "t1_f301m9c",
                    "score": 2,
                    "created_utc": 1570562126.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you!",
            "author": "IAlwaysFloat",
            "id": "f2x830q",
            "parent_id": "t1_f2x36br",
            "score": 2,
            "created_utc": 1570474757.0,
            "replies": []
        },
        {
            "body": "tears and smiles at this end .......   a class act on both ends \n\nand you presumably own the screen rights to the story    and the classic \n\nslinkyinthebag",
            "author": "pinotandsugar",
            "id": "f2xes9a",
            "parent_id": "t1_f2x36br",
            "score": 1,
            "created_utc": 1570477564.0,
            "replies": []
        },
        {
            "body": "Thank you so much!",
            "author": "IAlwaysFloat",
            "id": "f2x80we",
            "parent_id": "t1_f2wvcxv",
            "score": 2,
            "created_utc": 1570474737.0,
            "replies": []
        },
        {
            "body": "Heart warming... Hope all goes your way. Reading this made my day..😊",
            "author": "Luke2315",
            "id": "f30tiev",
            "parent_id": "t1_f301m9c",
            "score": 2,
            "created_utc": 1570562126.0,
            "replies": []
        }
    ]
}