{
    "title": "Why my SD paid my allowance during lockdown despite us not meeting. Very long post!",
    "post_id": "n4jot3",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/n4jot3/why_my_sd_paid_my_allowance_during_lockdown/",
    "author": "questionquestionone",
    "body": "ETA: Have received 3 angry DMs from 3 different people telling me I’m a prostitute.\n\n————————\n\nI have been with my very generous SD for 1.5 years now. \n\nThe first few months were spent getting to know each other and developing a friendship, with no allowance and no intimacy. It was something that just kind of blossomed naturally after we met through mutual friends. During the course of this period of getting to know each other he told me that he has some longterm girlfriends that he supports financially. At this point I was clueless about SRs, but I obviously now know that they are his SBs. \n\nAnyway, as our friendship developed he began buying me expensive gifts and it was usually things that I had no use (or space!) for. We were not yet intimate at this point, but it was beyond the friendship stage. We had expressed feelings for each other. I was always extremely grateful, but always found a polite way to tell him that I felt he was wasting his money as I wouldn’t use the things, and perhaps he could give them to his girlfriends. I would also always tell him that he didn’t need to “buy” my affection with gifts, and that I wanted to spend time with him willingly. He would insist that I kept the gifts, so I did. It was stuff like bags, shoes, clothes, things for my apartment, things for my hobbies, jewellery, electronics etc. \n\nAfter a few weeks of this, he did something amazing. We had spoken numerous times at length about my financial situation (which was dire) purely because I wanted his advice on a few things. After one of our dates at a restaurant, as I was leaving he said be careful with the bag (he had bought me a bag). I told him not to worry and that I wouldn’t lose it. When I got home I found an envelope with a huge wad of cash inside it. I genuinely couldn’t believe it. Keep in mind at this point I had NO CLUE about SRs or anything to do with SRs. I didn’t know that this was something that people did. I still remember how I felt as I looked at the massive amount of cash and thought about how ridiculously generous this man was. I remember counting it and not actually believing what I was seeing, it was enough to cover my monthly rent on my apartment. I called him and he said he did it because I’d probably find the cash more useful than the gifts, but that he still wanted to buy me things as he enjoyed it. I told him it was way too much and that I hadn’t done anything to deserve it (cringe). Note - we had still not yet had sex at this point but we had kissed. He insisted that I kept it, I kept refusing. The next time we met, I took it with me to give back to him. I don’t know why I did this as I actually really needed the money 🤦‍♀️ He would not take it back. And at the end of that date he gave me another envelope.\n\nAll of our dates so far had been in public places. He asked me if for our next date I’d like to spend some time with him in a hotel, and that I could pick any hotel in our city. I couldn’t bring myself to pick as it would have felt entitled, but I did want to take things further, so I asked him to decide. Ok so....I was NOT prepared for where he would take me. It was one of the fanciest hotels in our city. Somewhere where I would have been scared to ever set foot in because I’d have felt so out of place and not known how to act. I remember feeling like I had stepped into another world. I couldn’t believe it. The suite was maybe 3 times the size of my apartment. The bed was bigger than my entire bedroom. We had the most incredible time. He was so gentle to start. So patient and just spent so long on foreplay. It was beyond amazing. I have never in my entire life known anything like it. That night I went home and I started reading into things, I was looking up things like “what are older men interested in” 😂🥴 mainly because I wanted to keep things going with him as it was so enjoyable. So I found out about SRs. Obviously I had heard the term sugar daddy before but I didn’t properly understand. So many feelings as I was asking myself “am I a sugar baby??” and then the panic of thinking I wasn’t good enough or savvy enough. I decided to just let things continue as the were without worrying too much about labels.\n\nWe continued to meet up like this and each time he would take me to a different, amazing hotel after whatever date or activity. Then lockdown happened. By this stage we had switched from cash to bank transfers and I was (and am!) still so shocked/grateful/ecstatic every time I get a transfer. I told him that since we couldn’t meet up during lockdown, he should stop sending me money. He said that he was NOT sending me money for sex, but that it was because he wanted to help me. I said that I knew it wasn’t for sex, but it still didn’t feel fair that he was doing something for me when I couldn’t really do anything for him. He went ahead and sent over the usual amount of money the first month of lockdown - I immediately sent it back to him. We had a long chat and he told me that he would continue to send me the money so it was a waste of time me sending it back. And he kept his word and sent over the same amount for every month that we were in lockdown. Not even a reduced amount - the FULL AMOUNT 😫\n\nANYWAY. We are back to meeting in person now and I recently had a discussion with him about all of this and asked why he continued to send me money each month. I wanted to share his answer with you all. The gist of it is that he felt his help was making a difference to my life, and also because I have never expected or demanded it of him (turns out his other SBs had been hassling him about what would happen re “allowance” over lockdown). Also he mentioned that I have always been so genuinely grateful for his help. He is now talking about buying me a car and paying for driving lessons 😭\n\nI don’t know, I just wanted to share this little love story of mine haha. Maybe it will give people hope!",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/n4jot3/why_my_sd_paid_my_allowance_during_lockdown/",
    "score": 157,
    "upvote_ratio": 0.92,
    "created_utc": 1620118597.0,
    "num_comments": 50,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Thanks for sharing. You are blessed you have a generous SD",
            "author": "littleboopeep",
            "id": "gwwojcz",
            "parent_id": "t3_n4jot3",
            "score": 28,
            "created_utc": 1620136880.0,
            "replies": [
                {
                    "body": "Thanks 😊",
                    "author": "questionquestionone",
                    "id": "gwx40a7",
                    "parent_id": "t1_gwwojcz",
                    "score": 2,
                    "created_utc": 1620143310.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is what SRs should be in my opinion",
            "author": "bubblysweet23",
            "id": "gwxl7if",
            "parent_id": "t3_n4jot3",
            "score": 21,
            "created_utc": 1620150259.0,
            "replies": [
                {
                    "body": ":)",
                    "author": "questionquestionone",
                    "id": "gwznssy",
                    "parent_id": "t1_gwxl7if",
                    "score": 1,
                    "created_utc": 1620188647.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Whales do exist, just not very often.",
            "author": "GSSD",
            "id": "gwwirls",
            "parent_id": "t3_n4jot3",
            "score": 30,
            "created_utc": 1620134186.0,
            "replies": [
                {
                    "body": "Had to google what this meant 😂",
                    "author": "questionquestionone",
                    "id": "gwx48ps",
                    "parent_id": "t1_gwwirls",
                    "score": 2,
                    "created_utc": 1620143404.0,
                    "replies": [
                        {
                            "body": "In poker, a big fish.",
                            "author": "timrid",
                            "id": "gwz4jbj",
                            "parent_id": "t1_gwx48ps",
                            "score": 1,
                            "created_utc": 1620178451.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just saw your ETA edit. How on earth could anyone read this story as prostitution?? WTF is wrong with some people?\n\nAnyway, congrats on a great arrangement.",
            "author": "Ok-Tale-8876",
            "id": "gwxy1qh",
            "parent_id": "t3_n4jot3",
            "score": 13,
            "created_utc": 1620159085.0,
            "replies": [
                {
                    "body": "Agreed, that escalated quickly",
                    "author": "pintodinosaur",
                    "id": "gwy3tdz",
                    "parent_id": "t1_gwxy1qh",
                    "score": 1,
                    "created_utc": 1620161582.0,
                    "replies": []
                },
                {
                    "body": "Sooooo many people who are prudes and just come here to mess with others",
                    "author": "chak100",
                    "id": "gx2zl14",
                    "parent_id": "t1_gwxy1qh",
                    "score": 1,
                    "created_utc": 1620253781.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is amazing. I’m glad you met such a wonderful and generous man. I’ll remember this experience, since I hope to find such an amazing SD.",
            "author": null,
            "id": "gwwe120",
            "parent_id": "t3_n4jot3",
            "score": 19,
            "created_utc": 1620131684.0,
            "replies": [
                {
                    "body": "I think the key is to treat your SD with a lot of respect and show him exactly how generous you are. This seems to have made a huge impact on my SD, especially in comparison to his other SBs who he is now phasing out. I feel bad about that but he assured me it’s not my “fault” and it was something he was planning for anyway!",
                    "author": "questionquestionone",
                    "id": "gwx3zif",
                    "parent_id": "t1_gwwe120",
                    "score": 7,
                    "created_utc": 1620143301.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gwz5r2c",
            "parent_id": "t3_n4jot3",
            "score": 5,
            "created_utc": 1620179025.0,
            "replies": [
                {
                    "body": "Yes! This was the moral of the story that I was trying to convey haha",
                    "author": "questionquestionone",
                    "id": "gwzns3c",
                    "parent_id": "t1_gwz5r2c",
                    "score": 1,
                    "created_utc": 1620188634.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "aww thats so sweet. thanks for sharing. some SDs do genuinely care for their SBs",
            "author": "littlebobeep29",
            "id": "gwvx2me",
            "parent_id": "t3_n4jot3",
            "score": 8,
            "created_utc": 1620119081.0,
            "replies": [
                {
                    "body": "Yes! 😍",
                    "author": "questionquestionone",
                    "id": "gwvy04b",
                    "parent_id": "t1_gwvx2me",
                    "score": 0,
                    "created_utc": 1620119952.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "❤️❤️❤️ - love this!!!",
            "author": "thereadinessisall",
            "id": "gwvwy2g",
            "parent_id": "t3_n4jot3",
            "score": 7,
            "created_utc": 1620118966.0,
            "replies": [
                {
                    "body": "Ahh, thank you ☺️",
                    "author": "questionquestionone",
                    "id": "gwvxy9o",
                    "parent_id": "t1_gwvwy2g",
                    "score": 1,
                    "created_utc": 1620119905.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love this ❤️",
            "author": "brownn_sugarr",
            "id": "gwwkqfk",
            "parent_id": "t3_n4jot3",
            "score": 3,
            "created_utc": 1620135161.0,
            "replies": [
                {
                    "body": "😍",
                    "author": "questionquestionone",
                    "id": "gwx40y8",
                    "parent_id": "t1_gwwkqfk",
                    "score": 1,
                    "created_utc": 1620143317.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Love this! Very sweet!!! Can I ask, you mentioned driving lessons. Do you not drive? Just curious.",
            "author": "Ok_Conversation3453",
            "id": "gwwq73b",
            "parent_id": "t3_n4jot3",
            "score": 3,
            "created_utc": 1620137605.0,
            "replies": [
                {
                    "body": "No i don’t :( I’ve never had a need to!",
                    "author": "questionquestionone",
                    "id": "gwwygnc",
                    "parent_id": "t1_gwwq73b",
                    "score": 6,
                    "created_utc": 1620141037.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So nice when I see stories like this. This kind of organic situation is one almost any SD would love to find. Congratulations on finding a keeper.",
            "author": "Daddyg2019",
            "id": "gwynchj",
            "parent_id": "t3_n4jot3",
            "score": 3,
            "created_utc": 1620170262.0,
            "replies": [
                {
                    "body": "Thank you!",
                    "author": "questionquestionone",
                    "id": "gwznpg6",
                    "parent_id": "t1_gwynchj",
                    "score": 2,
                    "created_utc": 1620188589.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank goodness for generous sugar daddies ❤️",
            "author": "fabulousLB",
            "id": "gwwb8c6",
            "parent_id": "t3_n4jot3",
            "score": 6,
            "created_utc": 1620130060.0,
            "replies": [
                {
                    "body": "Yes. He has totally turned my life around - I’m nearly debt-free now. It’s crazy! I’m so thankful for him.",
                    "author": "questionquestionone",
                    "id": "gwx4enx",
                    "parent_id": "t1_gwwb8c6",
                    "score": 7,
                    "created_utc": 1620143470.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Such a beautiful story❤",
            "author": "Tough-Raisin1514",
            "id": "gwwav3z",
            "parent_id": "t3_n4jot3",
            "score": 2,
            "created_utc": 1620129837.0,
            "replies": [
                {
                    "body": "😊",
                    "author": "questionquestionone",
                    "id": "gwx49gp",
                    "parent_id": "t1_gwwav3z",
                    "score": 1,
                    "created_utc": 1620143413.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m sorry you’re getting such nasty messages. I think it’s great you found such a caring SD",
            "author": "MissAngieIfYouPlease",
            "id": "gwz0kv3",
            "parent_id": "t3_n4jot3",
            "score": 2,
            "created_utc": 1620176576.0,
            "replies": [
                {
                    "body": "Thank you :)",
                    "author": "questionquestionone",
                    "id": "gwznqox",
                    "parent_id": "t1_gwz0kv3",
                    "score": 1,
                    "created_utc": 1620188611.0,
                    "replies": [
                        {
                            "body": "No problem, I’ve dealt with ppl like that. They’re just jealous",
                            "author": "MissAngieIfYouPlease",
                            "id": "gx2s65p",
                            "parent_id": "t1_gwznqox",
                            "score": 1,
                            "created_utc": 1620250450.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bit of advice for you.  I think this SD has a \"papa provider complex\". He is probably drawn to SBs that are in dire straights, comes in and fixes things .  AND THEN MOVES ON to the next broken situation. You need to get your life stable and come out of this SR not needing a SD to get along.",
            "author": "Tough-Raisin1514",
            "id": "gwy1gf1",
            "parent_id": "t3_n4jot3",
            "score": 4,
            "created_utc": 1620160578.0,
            "replies": [
                {
                    "body": "Thank you - this makes a lot of sense, actually!",
                    "author": "questionquestionone",
                    "id": "gwycm6y",
                    "parent_id": "t1_gwy1gf1",
                    "score": 3,
                    "created_utc": 1620165301.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great story and thanks for sharing. Happy for you. How did you originally meet?",
            "author": "WasteTimeOrNot",
            "id": "gww3ldv",
            "parent_id": "t3_n4jot3",
            "score": 2,
            "created_utc": 1620124774.0,
            "replies": [
                {
                    "body": "Kind of through mutual friends on an online forum for a topic that we are both interested in (it wasn’t on reddit haha).",
                    "author": "questionquestionone",
                    "id": "gwx3h5t",
                    "parent_id": "t1_gww3ldv",
                    "score": 2,
                    "created_utc": 1620143094.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gww9han",
            "parent_id": "t3_n4jot3",
            "score": 5,
            "created_utc": 1620128974.0,
            "replies": [
                {
                    "body": "you sound a little bitter, no?",
                    "author": "kittenslutbaby-999",
                    "id": "gwwfser",
                    "parent_id": "t1_gww9han",
                    "score": -1,
                    "created_utc": 1620132643.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Would love to have my turn of help if I get lucky enough to have a SB. Your story is interesting and promising. kisses.",
            "author": "papadoes1",
            "id": "gx03gnh",
            "parent_id": "t3_n4jot3",
            "score": 1,
            "created_utc": 1620200303.0,
            "replies": []
        },
        {
            "body": "Would be an amazing commercial for seeking. Getting paid for a long distance and by default platonic relationship. If they put it as a marketing blog, SB signups will grow.",
            "author": null,
            "id": "gwwy1vm",
            "parent_id": "t3_n4jot3",
            "score": -1,
            "created_utc": 1620140869.0,
            "replies": [
                {
                    "body": "Haha! I’m not sure if it was clear in my post but we had slept together and built up a “relationship” before lockdown :)",
                    "author": "questionquestionone",
                    "id": "gwx3o1z",
                    "parent_id": "t1_gwwy1vm",
                    "score": 3,
                    "created_utc": 1620143172.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Driving lessons?  How old are you?",
            "author": "baronessblockage",
            "id": "gwz4wxt",
            "parent_id": "t3_n4jot3",
            "score": 0,
            "created_utc": 1620178626.0,
            "replies": [
                {
                    "body": "I live in a country where not everyone learns to drive the moment they turn legal driving age, as our public transport system is so reliable and efficient. Also, I could be somebody who had previously attempted to learn but wasn’t able to pass :)",
                    "author": "questionquestionone",
                    "id": "gwznozy",
                    "parent_id": "t1_gwz4wxt",
                    "score": 1,
                    "created_utc": 1620188582.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Too nice to be true, sorry...",
            "author": "your_right11",
            "id": "gww0qq6",
            "parent_id": "t3_n4jot3",
            "score": -14,
            "created_utc": 1620122387.0,
            "replies": [
                {
                    "body": "I’ll take this as a compliment! 😄",
                    "author": "questionquestionone",
                    "id": "gwwydt4",
                    "parent_id": "t1_gww0qq6",
                    "score": 3,
                    "created_utc": 1620141005.0,
                    "replies": []
                },
                {
                    "body": "No, it isn't. I had must met my ex-SD in January and when we went in lockdown, he continued to give my full allowance through November. I had the virus early, I kept seeing antibodies in tests and offered to meet up, but he kept declining. I was there for him in every way I could be except in person and he single handedly kept me afloat until I found a new job and then we parted ways. \n\nNow is OP a bit of a pushover? Yeah. But SDs like hers exist.",
                    "author": "secretactorian",
                    "id": "gwwcw83",
                    "parent_id": "t1_gww0qq6",
                    "score": 5,
                    "created_utc": 1620131033.0,
                    "replies": [
                        {
                            "body": "I believe your story, but it is very rare type of SD's.",
                            "author": "your_right11",
                            "id": "gwwenpp",
                            "parent_id": "t1_gwwcw83",
                            "score": 2,
                            "created_utc": 1620132030.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Shut up.",
                    "author": null,
                    "id": "gwwdvif",
                    "parent_id": "t1_gww0qq6",
                    "score": 2,
                    "created_utc": 1620131596.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "i know what u mean with the angry ppl from here this sub is one of the most aggressive places on reddit lol",
            "author": "frogppl",
            "id": "gwxkxyz",
            "parent_id": "t3_n4jot3",
            "score": 1,
            "created_utc": 1620150145.0,
            "replies": []
        },
        {
            "body": "Aww I love this for you!! Thanks for sharing, this was so sweet.",
            "author": "Interesting-Spite-18",
            "id": "gx2v37s",
            "parent_id": "t3_n4jot3",
            "score": 1,
            "created_utc": 1620251739.0,
            "replies": []
        },
        {
            "body": "Mine is doing the same thing actually! It’s been about 1.5 year and I really want a car but am nervous to ask him… do you think I should drop hints or bluntly ask him? I haven’t seen him in 5 months but I still get my allowance too which is a blessing",
            "author": "mister_banks",
            "id": "h1kf5i3",
            "parent_id": "t3_n4jot3",
            "score": 1,
            "created_utc": 1623540909.0,
            "replies": []
        },
        {
            "body": "Thanks 😊",
            "author": "questionquestionone",
            "id": "gwx40a7",
            "parent_id": "t1_gwwojcz",
            "score": 2,
            "created_utc": 1620143310.0,
            "replies": []
        },
        {
            "body": ":)",
            "author": "questionquestionone",
            "id": "gwznssy",
            "parent_id": "t1_gwxl7if",
            "score": 1,
            "created_utc": 1620188647.0,
            "replies": []
        },
        {
            "body": "Had to google what this meant 😂",
            "author": "questionquestionone",
            "id": "gwx48ps",
            "parent_id": "t1_gwwirls",
            "score": 2,
            "created_utc": 1620143404.0,
            "replies": [
                {
                    "body": "In poker, a big fish.",
                    "author": "timrid",
                    "id": "gwz4jbj",
                    "parent_id": "t1_gwx48ps",
                    "score": 1,
                    "created_utc": 1620178451.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed, that escalated quickly",
            "author": "pintodinosaur",
            "id": "gwy3tdz",
            "parent_id": "t1_gwxy1qh",
            "score": 1,
            "created_utc": 1620161582.0,
            "replies": []
        },
        {
            "body": "Sooooo many people who are prudes and just come here to mess with others",
            "author": "chak100",
            "id": "gx2zl14",
            "parent_id": "t1_gwxy1qh",
            "score": 1,
            "created_utc": 1620253781.0,
            "replies": []
        },
        {
            "body": "I think the key is to treat your SD with a lot of respect and show him exactly how generous you are. This seems to have made a huge impact on my SD, especially in comparison to his other SBs who he is now phasing out. I feel bad about that but he assured me it’s not my “fault” and it was something he was planning for anyway!",
            "author": "questionquestionone",
            "id": "gwx3zif",
            "parent_id": "t1_gwwe120",
            "score": 7,
            "created_utc": 1620143301.0,
            "replies": []
        },
        {
            "body": "Yes! This was the moral of the story that I was trying to convey haha",
            "author": "questionquestionone",
            "id": "gwzns3c",
            "parent_id": "t1_gwz5r2c",
            "score": 1,
            "created_utc": 1620188634.0,
            "replies": []
        },
        {
            "body": "Yes! 😍",
            "author": "questionquestionone",
            "id": "gwvy04b",
            "parent_id": "t1_gwvx2me",
            "score": 0,
            "created_utc": 1620119952.0,
            "replies": []
        },
        {
            "body": "Ahh, thank you ☺️",
            "author": "questionquestionone",
            "id": "gwvxy9o",
            "parent_id": "t1_gwvwy2g",
            "score": 1,
            "created_utc": 1620119905.0,
            "replies": []
        },
        {
            "body": "😍",
            "author": "questionquestionone",
            "id": "gwx40y8",
            "parent_id": "t1_gwwkqfk",
            "score": 1,
            "created_utc": 1620143317.0,
            "replies": []
        },
        {
            "body": "No i don’t :( I’ve never had a need to!",
            "author": "questionquestionone",
            "id": "gwwygnc",
            "parent_id": "t1_gwwq73b",
            "score": 6,
            "created_utc": 1620141037.0,
            "replies": []
        },
        {
            "body": "Thank you!",
            "author": "questionquestionone",
            "id": "gwznpg6",
            "parent_id": "t1_gwynchj",
            "score": 2,
            "created_utc": 1620188589.0,
            "replies": []
        },
        {
            "body": "Yes. He has totally turned my life around - I’m nearly debt-free now. It’s crazy! I’m so thankful for him.",
            "author": "questionquestionone",
            "id": "gwx4enx",
            "parent_id": "t1_gwwb8c6",
            "score": 7,
            "created_utc": 1620143470.0,
            "replies": []
        },
        {
            "body": "😊",
            "author": "questionquestionone",
            "id": "gwx49gp",
            "parent_id": "t1_gwwav3z",
            "score": 1,
            "created_utc": 1620143413.0,
            "replies": []
        },
        {
            "body": "Thank you :)",
            "author": "questionquestionone",
            "id": "gwznqox",
            "parent_id": "t1_gwz0kv3",
            "score": 1,
            "created_utc": 1620188611.0,
            "replies": [
                {
                    "body": "No problem, I’ve dealt with ppl like that. They’re just jealous",
                    "author": "MissAngieIfYouPlease",
                    "id": "gx2s65p",
                    "parent_id": "t1_gwznqox",
                    "score": 1,
                    "created_utc": 1620250450.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you - this makes a lot of sense, actually!",
            "author": "questionquestionone",
            "id": "gwycm6y",
            "parent_id": "t1_gwy1gf1",
            "score": 3,
            "created_utc": 1620165301.0,
            "replies": []
        },
        {
            "body": "Kind of through mutual friends on an online forum for a topic that we are both interested in (it wasn’t on reddit haha).",
            "author": "questionquestionone",
            "id": "gwx3h5t",
            "parent_id": "t1_gww3ldv",
            "score": 2,
            "created_utc": 1620143094.0,
            "replies": []
        },
        {
            "body": "you sound a little bitter, no?",
            "author": "kittenslutbaby-999",
            "id": "gwwfser",
            "parent_id": "t1_gww9han",
            "score": -1,
            "created_utc": 1620132643.0,
            "replies": []
        },
        {
            "body": "Haha! I’m not sure if it was clear in my post but we had slept together and built up a “relationship” before lockdown :)",
            "author": "questionquestionone",
            "id": "gwx3o1z",
            "parent_id": "t1_gwwy1vm",
            "score": 3,
            "created_utc": 1620143172.0,
            "replies": []
        },
        {
            "body": "I live in a country where not everyone learns to drive the moment they turn legal driving age, as our public transport system is so reliable and efficient. Also, I could be somebody who had previously attempted to learn but wasn’t able to pass :)",
            "author": "questionquestionone",
            "id": "gwznozy",
            "parent_id": "t1_gwz4wxt",
            "score": 1,
            "created_utc": 1620188582.0,
            "replies": []
        },
        {
            "body": "I’ll take this as a compliment! 😄",
            "author": "questionquestionone",
            "id": "gwwydt4",
            "parent_id": "t1_gww0qq6",
            "score": 3,
            "created_utc": 1620141005.0,
            "replies": []
        },
        {
            "body": "No, it isn't. I had must met my ex-SD in January and when we went in lockdown, he continued to give my full allowance through November. I had the virus early, I kept seeing antibodies in tests and offered to meet up, but he kept declining. I was there for him in every way I could be except in person and he single handedly kept me afloat until I found a new job and then we parted ways. \n\nNow is OP a bit of a pushover? Yeah. But SDs like hers exist.",
            "author": "secretactorian",
            "id": "gwwcw83",
            "parent_id": "t1_gww0qq6",
            "score": 5,
            "created_utc": 1620131033.0,
            "replies": [
                {
                    "body": "I believe your story, but it is very rare type of SD's.",
                    "author": "your_right11",
                    "id": "gwwenpp",
                    "parent_id": "t1_gwwcw83",
                    "score": 2,
                    "created_utc": 1620132030.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Shut up.",
            "author": null,
            "id": "gwwdvif",
            "parent_id": "t1_gww0qq6",
            "score": 2,
            "created_utc": 1620131596.0,
            "replies": []
        },
        {
            "body": "In poker, a big fish.",
            "author": "timrid",
            "id": "gwz4jbj",
            "parent_id": "t1_gwx48ps",
            "score": 1,
            "created_utc": 1620178451.0,
            "replies": []
        },
        {
            "body": "No problem, I’ve dealt with ppl like that. They’re just jealous",
            "author": "MissAngieIfYouPlease",
            "id": "gx2s65p",
            "parent_id": "t1_gwznqox",
            "score": 1,
            "created_utc": 1620250450.0,
            "replies": []
        },
        {
            "body": "I believe your story, but it is very rare type of SD's.",
            "author": "your_right11",
            "id": "gwwenpp",
            "parent_id": "t1_gwwcw83",
            "score": 2,
            "created_utc": 1620132030.0,
            "replies": []
        }
    ]
}