{
    "title": "I really lucked out with this one",
    "post_id": "f2mhhx",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/f2mhhx/i_really_lucked_out_with_this_one/",
    "author": "littlesquiggles",
    "body": "We found each other within the first week of me being on SA, and he was my first m&g ever. We're very alike and he isn't too much older than me. He's never hesitated to give me monetary gifts, even if time goes by that we can't get down and dirty. Oh and when we do get down and dirty he loves going down and getting dirty on me. Cuddling afterward is literally the best, it feels like pure bliss. I think the biggest win though, is that he is experienced in the industry I'm trying to get into so I can always ask him for help.\n\nRight now I've been going through some intense learning which has me really stressed out and he's offered his help at all hours of the day. He will literally stay up til I'm done, no matter the time so that I'm not alone and I always have help. He's always reassuring me and encouraging me and is really my personal cheerleader.\n\nRecently, my laptop has been giving me issues because I've been asking a lot from it and well, its actually a grandma in laptop years. I'd mentioned it here and there about it giving me problems, but one day I learned that it was no longer going to work for what I needed it for, and that was going to be real soon. Mostly, someone basically called me out and said I needed to get a new laptop because this old one wasn't going to cut it anymore while in front of a bunch of peers. I honestly felt so poor in that moment, getting called out for my ancient technology (actually not THAT old, but it is for what I need it for) in a sea of shiny new laptops. I mean, its been a good laptop to me, and always there when I needed it so it hadn't felt like an immediate need for a new one. Anyway, I'd been texting him about my day, and told him what'd happened while I was cooking. He kept telling me not to worry, that he could help me fix it. I thought he'd know of some other program I could get to help. Next text is a screenshot of an amazon notice with the date of an item that can be picked up at my local amazon locker. It doesn't say for what. Maybe some feel-better chocolates or something I thought. So I ask him what its for. \"It's your new laptop. It should be there tomorrow, assuming at night. I told you I don't want you to worry about it.\" Next thing I know, my eyes are filled with tears and I can't stop cryinggggggg. Right until he tells me its a windows computer. Then \"jk, it's apple still lol.\" Omg this man.\n\nHow did I get this lucky?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/f2mhhx/i_really_lucked_out_with_this_one/",
    "score": 103,
    "upvote_ratio": 0.99,
    "created_utc": 1581486498.0,
    "num_comments": 9,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "You're very lucky. I wish you all the best in the future 🤗",
            "author": "lucknomad",
            "id": "fhdiiny",
            "parent_id": "t3_f2mhhx",
            "score": 11,
            "created_utc": 1581487436.0,
            "replies": [
                {
                    "body": "Thanks, I feel lucky all the time when I'm with him.",
                    "author": "littlesquiggles",
                    "id": "fhdiolb",
                    "parent_id": "t1_fhdiiny",
                    "score": 5,
                    "created_utc": 1581487591.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Perhaps, if he’s not married and the age gap not too wide, you might have found something more than a SR. 🤷‍♂️",
            "author": "captcreamfiller",
            "id": "fhdme0i",
            "parent_id": "t3_f2mhhx",
            "score": 10,
            "created_utc": 1581491455.0,
            "replies": [
                {
                    "body": "The age gap isn't big, but he is married. So we're not making long term plans. But I'm enjoying my time with him.",
                    "author": "littlesquiggles",
                    "id": "fhdnc2r",
                    "parent_id": "t1_fhdme0i",
                    "score": 12,
                    "created_utc": 1581492540.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Very lucky",
            "author": "llamalord9000",
            "id": "fhdhlhb",
            "parent_id": "t3_f2mhhx",
            "score": 5,
            "created_utc": 1581486584.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fhdixh4",
            "parent_id": "t3_f2mhhx",
            "score": 10,
            "created_utc": 1581487827.0,
            "replies": [
                {
                    "body": "They really do. When you're not a fake nice guy. He's very genuine and has never pressured me into anything or made me feel bad about something. He does nice things because he cares about me, and I for him.",
                    "author": "littlesquiggles",
                    "id": "fhdnfgo",
                    "parent_id": "t1_fhdixh4",
                    "score": 11,
                    "created_utc": 1581492652.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm so happy for you!",
            "author": null,
            "id": "fhemvrd",
            "parent_id": "t3_f2mhhx",
            "score": 1,
            "created_utc": 1581525716.0,
            "replies": []
        },
        {
            "body": "May I ask how you met him?",
            "author": "sugarbaby5160",
            "id": "fheddjb",
            "parent_id": "t3_f2mhhx",
            "score": 1,
            "created_utc": 1581519923.0,
            "replies": []
        },
        {
            "body": "The number of times the phrase \"down and dirty\" appeared in this post makes me want to leave work and go  ........... (fill in the gaps)",
            "author": "PioneerExperience",
            "id": "fheos18",
            "parent_id": "t3_f2mhhx",
            "score": 1,
            "created_utc": 1581526820.0,
            "replies": []
        },
        {
            "body": "Thanks, I feel lucky all the time when I'm with him.",
            "author": "littlesquiggles",
            "id": "fhdiolb",
            "parent_id": "t1_fhdiiny",
            "score": 5,
            "created_utc": 1581487591.0,
            "replies": []
        },
        {
            "body": "The age gap isn't big, but he is married. So we're not making long term plans. But I'm enjoying my time with him.",
            "author": "littlesquiggles",
            "id": "fhdnc2r",
            "parent_id": "t1_fhdme0i",
            "score": 12,
            "created_utc": 1581492540.0,
            "replies": []
        },
        {
            "body": "They really do. When you're not a fake nice guy. He's very genuine and has never pressured me into anything or made me feel bad about something. He does nice things because he cares about me, and I for him.",
            "author": "littlesquiggles",
            "id": "fhdnfgo",
            "parent_id": "t1_fhdixh4",
            "score": 11,
            "created_utc": 1581492652.0,
            "replies": []
        }
    ]
}