{
    "title": "A most wonderful experience",
    "post_id": "g49z0x",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/g49z0x/a_most_wonderful_experience/",
    "author": "MamaMinx",
    "body": "Can’t believe my luck \n\nI had been in the bowl a few months. Met my fair share of creeps. Had two arrangements that weren’t what I actually wanted. (With a fair amount of blatant dishonesty from the SDs.) \n\nThen I got a message from a SD who lived just 6 miles away. Cant say he wowed me over text at first. (I really just assumed English wasn’t his first language.) He seemed familiar with arrangements (covered the basic compatibility questions, and asked what “level of support” I was looking for.) After a few hiccups in setting up the meet, we finalized dinner at a steakhouse. Coincidently it was the day before my birthday. \n\nThis man literally showed up with a bouquet of a dozen red roses (I didn’t even realize the joke until recently) and a gift bag. During the course of our texting we had briefly discussed vaporizers vs cigarettes. Wouldn’t you know it? He got me my own Juul with a buncha refills! And a little stuffed animal for my child. It seems silly, but, excluding family, no one had ever given me flowers!\n\nAfter dinner we kept talking in the parking lot and then sat in his car. At some point I made a comment about acing a “perception check” (DnD reference) and he was floored. Neither of us had any nerd/geek/gamer stuff in our profiles. He couldn’t believe I was into it. It was so great. We clicked on so many levels. \n\nThen he pulled out the PPM I specified and said he wanted to send me the rest of the allowance via PayPal. Asked if I’d like to go a hotel, which I declined and he respected. A little later he gave me a back rub and I could tell he’d be good in bed. I mentioned that I would definitely be excited to sleep with him. He laughed and said he really respected me. “I hand you xxx dollars and you’re not sure if you want sex, but are certain after a massage.” We ended up just talking until 1am. He sent me the rest of allowance via PayPal the next morning and I couldn’t believe it. \n\nOn our second intimate date he told me he got me a surprise. After I asked for advice about my desktop (~10 years old) he decided I needed a laptop and ordered me one! When it arrived we met for coffee and set it up. Then spent a few hours on the Autozone parking lot doing my car no pressure and just fun. Later that night we messed around in his car and it was awesome. \n\nThen Covid-19 happened. He had to stay home and so we started Skyping every few days. Easily 4-6 hours a night. Deep, open, and honest communication. The hottest cyber sex you can imagine. Everything has been amazing. He continued the allowance even with the lock down. \n\nAs luck would have it, he also happens to be the textbook version of a perfect Dom. Always seeking to understand my comfort levels and keeping me right at the edge. Even more than just the sexual satisfaction, I love that he wants to help me be a better me! I have always had a hard time keeping up on housework and other aspects of “adulting.” His reminders, motivation, and praise have given me the push I needed. The tasks he assigns me are things that I should be doing or will aid in getting my life more together. He set up a google calendar “daily schedule” for me that fits my life perfectly. It included a time for sewing and I started making corona masks. Sold 4 already and am like 0.0 \n\nThe thing that has really meant the most to me is the emotional support, dedication to being a safe space, and helping me process some past trauma. My ex was physically abusive (currently incarcerated for that.) My SD has never made me feel bad about being confused. Won’t ever tell me what I should do. Just offers gentle suggestions and advice for either course of action. He went back to an abusive ex multiple times and completely understands the struggle between holding onto the hope of their promises of change and refusing to be treated disrespectfully. It’s so nice to hear how much I’m wanted for who I am. His late wife struggled with and ultimately succumbed to alcoholism. Not proud to admit that I was heading that same road. I didn’t want to remind him of sad things so I cut back my drinking significantly and now it’s less than 3 per week. \n\nI love knowing when I’ve helped someone else out in any way. Once we were discussing my abuser and I mentioned how often I’d write about the occasional good times just to keep the cognitive dissidence at bay. He thanked me for that information because it helped him understand something his late wife had done. She had all these journals and such with pages and pages about her ex but nothing about him. It was painful, as he always wondered why, and I feel so great that I helped him makes sense of it. \n\nNever thought I’d find something like this on seeking. No matter what happens with the relationship, I’m in a much better place than I was before he came into my life.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/g49z0x/a_most_wonderful_experience/",
    "score": 99,
    "upvote_ratio": 0.92,
    "created_utc": 1587311792.0,
    "num_comments": 21,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Wait, what's the red roses joke? 😂 *Woosh*",
            "author": "anonbaby90",
            "id": "fnwdjjd",
            "parent_id": "t3_g49z0x",
            "score": 15,
            "created_utc": 1587316325.0,
            "replies": [
                {
                    "body": "In the escort world it’s is a code word for money.",
                    "author": "MamaMinx",
                    "id": "fnwe64k",
                    "parent_id": "t1_fnwdjjd",
                    "score": 20,
                    "created_utc": 1587316667.0,
                    "replies": [
                        {
                            "body": "Interesting! Thanks for keeping me in the loop :)",
                            "author": "anonbaby90",
                            "id": "fnweamx",
                            "parent_id": "t1_fnwe64k",
                            "score": 3,
                            "created_utc": 1587316735.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I get so jealous when people find their perfect SD. I can't even find a decent one after my first and last SD",
            "author": "Allysa209",
            "id": "fnwvr24",
            "parent_id": "t3_g49z0x",
            "score": 7,
            "created_utc": 1587326398.0,
            "replies": [
                {
                    "body": "Same he's coming!",
                    "author": null,
                    "id": "fnz1r4a",
                    "parent_id": "t1_fnwvr24",
                    "score": 2,
                    "created_utc": 1587383514.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "so happy for you!! hope it lasts long and is prosperous for yall both",
            "author": "slowlyrot",
            "id": "fnwcfcl",
            "parent_id": "t3_g49z0x",
            "score": 5,
            "created_utc": 1587315708.0,
            "replies": []
        },
        {
            "body": "I love hearing stories like this. Congrats",
            "author": "dade_murphy1",
            "id": "fnwpbic",
            "parent_id": "t3_g49z0x",
            "score": 5,
            "created_utc": 1587322780.0,
            "replies": []
        },
        {
            "body": "Love this! Congrats!",
            "author": "LikeHoney99",
            "id": "fnwbv67",
            "parent_id": "t3_g49z0x",
            "score": 3,
            "created_utc": 1587315400.0,
            "replies": []
        },
        {
            "body": "My little heart!!! I’m so excited for you.\nI love that you two have clicked so well, and that he’s helping you grow into the best you possible.",
            "author": "fckdthoroughly",
            "id": "fnwj63l",
            "parent_id": "t3_g49z0x",
            "score": 3,
            "created_utc": 1587319382.0,
            "replies": []
        },
        {
            "body": "Tried to double upvote didn't work lol congrats hun😊",
            "author": null,
            "id": "fnz1qj1",
            "parent_id": "t3_g49z0x",
            "score": 3,
            "created_utc": 1587383500.0,
            "replies": []
        },
        {
            "body": "this is so good, and i loved the dnd reference! definitely made me giggle.",
            "author": "sdawn13_",
            "id": "fnwtvuf",
            "parent_id": "t3_g49z0x",
            "score": 2,
            "created_utc": 1587325351.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fnxb7lp",
            "parent_id": "t3_g49z0x",
            "score": 2,
            "created_utc": 1587335123.0,
            "replies": [
                {
                    "body": "His three “rules” for relationships are respect, kindness, and consideration! Definitely took time. (Apparently he had even messaged me from a previous account a month prior and I didn’t respond.) \n\nIt was three months of actively searching before I connected with him. Patience is absolutely a big part. Even the bad experiences were somewhat necessary to learn what made him so great.",
                    "author": "MamaMinx",
                    "id": "fo3nt68",
                    "parent_id": "t1_fnxb7lp",
                    "score": 1,
                    "created_utc": 1587490002.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lately it seems there has been a lot of negativity in posts on this forum, so this is a breath of fresh air to read!  It's wonderful to hear others with successful stories and a genuine caring relationship.\n\nCongrats, Mama!  wish you all the best with your lucky catch! :)",
            "author": "Kitten4Play77",
            "id": "fny0khy",
            "parent_id": "t3_g49z0x",
            "score": 2,
            "created_utc": 1587350521.0,
            "replies": [
                {
                    "body": "Thank you! The negative posts were also one of the reasons I finished writing this.",
                    "author": "MamaMinx",
                    "id": "fo3lyio",
                    "parent_id": "t1_fny0khy",
                    "score": 1,
                    "created_utc": 1587489127.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow, this is so amazing!! I wish I have the same luck as you but I never do :( Guess you just have to keep posting and update us so we can live vicariously through you :)",
            "author": "unforgettableunicorn",
            "id": "fnyruat",
            "parent_id": "t3_g49z0x",
            "score": 2,
            "created_utc": 1587373285.0,
            "replies": []
        },
        {
            "body": "Happy for you, thank you for sharing!!",
            "author": "sugarthrowSD",
            "id": "fnw9frg",
            "parent_id": "t3_g49z0x",
            "score": 2,
            "created_utc": 1587314063.0,
            "replies": []
        },
        {
            "body": "So happy for you! 💜💜💜",
            "author": "boneyjoaniemacaroni",
            "id": "fnway8d",
            "parent_id": "t3_g49z0x",
            "score": 2,
            "created_utc": 1587314896.0,
            "replies": []
        },
        {
            "body": "Any thoughts of what it would be like had you met on a legit dating site?  It sounds like you two are naturally compatible.",
            "author": null,
            "id": "fnwyjk5",
            "parent_id": "t3_g49z0x",
            "score": 2,
            "created_utc": 1587327974.0,
            "replies": [
                {
                    "body": "I agree with the compatibility. It’s gotten borderline supernatural with some of the stuff. \n\nAnd honestly prolly would have missed him. I’ve never really used vanilla dating sites or apps. \n\nI told him I’d date him without an allowance, and told him to not give me anything in May to prove a point. So we’ll see.",
                    "author": "MamaMinx",
                    "id": "fnxias5",
                    "parent_id": "t1_fnwyjk5",
                    "score": 2,
                    "created_utc": 1587339211.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "LOVE and miss this feeling so much!! actually clicking with someone and getting paid on top of it is the best feeling.",
            "author": null,
            "id": "fnx725q",
            "parent_id": "t3_g49z0x",
            "score": 1,
            "created_utc": 1587332753.0,
            "replies": []
        },
        {
            "body": "In the escort world it’s is a code word for money.",
            "author": "MamaMinx",
            "id": "fnwe64k",
            "parent_id": "t1_fnwdjjd",
            "score": 20,
            "created_utc": 1587316667.0,
            "replies": [
                {
                    "body": "Interesting! Thanks for keeping me in the loop :)",
                    "author": "anonbaby90",
                    "id": "fnweamx",
                    "parent_id": "t1_fnwe64k",
                    "score": 3,
                    "created_utc": 1587316735.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Same he's coming!",
            "author": null,
            "id": "fnz1r4a",
            "parent_id": "t1_fnwvr24",
            "score": 2,
            "created_utc": 1587383514.0,
            "replies": []
        },
        {
            "body": "His three “rules” for relationships are respect, kindness, and consideration! Definitely took time. (Apparently he had even messaged me from a previous account a month prior and I didn’t respond.) \n\nIt was three months of actively searching before I connected with him. Patience is absolutely a big part. Even the bad experiences were somewhat necessary to learn what made him so great.",
            "author": "MamaMinx",
            "id": "fo3nt68",
            "parent_id": "t1_fnxb7lp",
            "score": 1,
            "created_utc": 1587490002.0,
            "replies": []
        },
        {
            "body": "Thank you! The negative posts were also one of the reasons I finished writing this.",
            "author": "MamaMinx",
            "id": "fo3lyio",
            "parent_id": "t1_fny0khy",
            "score": 1,
            "created_utc": 1587489127.0,
            "replies": []
        },
        {
            "body": "I agree with the compatibility. It’s gotten borderline supernatural with some of the stuff. \n\nAnd honestly prolly would have missed him. I’ve never really used vanilla dating sites or apps. \n\nI told him I’d date him without an allowance, and told him to not give me anything in May to prove a point. So we’ll see.",
            "author": "MamaMinx",
            "id": "fnxias5",
            "parent_id": "t1_fnwyjk5",
            "score": 2,
            "created_utc": 1587339211.0,
            "replies": []
        },
        {
            "body": "Interesting! Thanks for keeping me in the loop :)",
            "author": "anonbaby90",
            "id": "fnweamx",
            "parent_id": "t1_fnwe64k",
            "score": 3,
            "created_utc": 1587316735.0,
            "replies": []
        }
    ]
}