{
    "title": "a recent terrifying Experience as an SB",
    "post_id": "9ia33z",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/9ia33z/a_recent_terrifying_experience_as_an_sb/",
    "author": "grapefruit422",
    "body": "Hello there. I'm a long-time lurker on this subreddit and just wanted to recount something that happened to me recently - perhaps as a safety PSA to all other SBs out there.\n\n&nbsp;\n\nI'm not particularly new to the bowl. I had one long-term SR previously. I understand that there are certain precautions one should take when going on meet-and-greets and I am particularly careful. I think I'm pretty street smart - I'm in my late 20s, live in NYC, and have lived in several other large cities. I always to tell a friend where I am going and for how long, as well as share my location on my phone.\n\n&nbsp;\n\nWell anyway, about a month and a half ago, I was sitting at the bar of a restaurant by myself when a very handsome, older gentleman approached me. (I love taking myself out to dinner haha). We chatted a bit and he mentioned that he was \"looking for an arrangement\". I was pretty excited to have met him - I had never free-styled before and wasn't even trying to find a SD. We exchanged numbers (I gave him my Google Voice number) and sent many messages over the next few weeks. It sounded like we were both looking for the same things and he offered me a very generous allowance.  We made plans to meet up at a popular bar in Midtown. I was excited!\n\n&nbsp;\n\nSo I show up and he greets me warmly and we find a booth to sit at. We order a few drinks and at first, things seem to be going very well. We have many things in common, so it was quite easy to converse. We talked about sports, music, our recent travels, and the sort of food we liked to eat - all of my favorite things. I was certainly enjoying our time together. In my head, I was thinking about how he'd be a great SD. Then of course, things turned for the worse.\n\n&nbsp;\n\nHe casually mentions his fascination with \"exotic girls\". That is a huge red flag for me, sugar or vanilla. He goes on to say how he always likes to have a Chinese or Japanese girl by his side, but wouldn't mind making an exception for me, an \"above average Korean\" who has \"decent taste in clothes and seems mildly talented with a makeup brush\". Jeez thanks, lovely compliments. \n\n&nbsp;\n\nAt this point, I obviously know that this is not the SD for me. What a jackass. I politely try to start wrapping things up (still have traces of that \"Midwest nice\", unfortunately). Meanwhile he starts going down this path, telling me about how he likes to degrade girls in the bedroom, loves rape play, loves to choke, wants to be called \"daddy\", etc. I am feeling extremely uneasy and excuse myself to go to the restroom.\n\n&nbsp;\n\nI'm sort of panicking at this point (my natural reaction) and so on my way to the restroom, I stop a hostess and tell her about how I'm on a bad date and that I wouldn't mind having security or a manager keep an eye on me when I go to leave. She is totally understanding and asks if I'd like to be led out the back door right then and there. I would have, but I stupidly left my bag at the table and I needed the keys to my apartment. She says \"no worries\" and would have security watch me as I go collect my things.\n\n&nbsp;\n\nI walked back to the table, grabbed my bag, and said \"It was nice to meet you, but I'm sorry, I'm not interested in continuing on. Have a nice night\". He starts telling me about what an \"ungrateful slut I am\" because I should at least stay to finish my drink... Absolutely not. I make a dash to the foyer of the bar and thank the hostess for helping me out. \n\n&nbsp;\n\nI walk outside to get a cab to go home. I had just opened the door and was about to step in when someone grabbed my shoulder and jerked me so hard that I fell to the ground. I look up and it's this freaking POT. He starts DRAGGING me to another cab (he's quite a bit taller/bigger than me) by my wrist, then starts pushing me, and yells at me to get in and says he's \"going to punish me for humiliating\" him. I'm in such shock at this point that I can't do or say anything but try to resist.\n\n&nbsp;\n\nLuckily, 2 bystanders and a security guard run to the car, push POT aside, and the security guard picks me up and carries me inside. I have no idea what else happened (I sort of blacked out) and when I come back to Earth, I'm sitting in the manager's office with the hostess and 2 police officers and I don't know what to do except cry. The cops asked me a ton of a questions about him - of course, I didn't know that much.  Apparently after the security guard came to my rescue, the POT managed to get away on foot.  The bar has cameras, which caught the whole incident, but I don't know what will come of it or whether he'll be identified.\n\n&nbsp;\n\nI'm still a bit shaken up by the experience. At the time, I thought it was a little dramatic to tell the hostess about what was happening, but I am so glad that I did. Who knows what could have happened otherwise. \n\n&nbsp;\n\nSBs, be freaking careful out there. Trust your instincts and if you are feeling unsafe, get yourself out of that situation.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/9ia33z/a_recent_terrifying_experience_as_an_sb/",
    "score": 292,
    "upvote_ratio": 0.97,
    "created_utc": 1537723302.0,
    "num_comments": 60,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Holy shit! \n\nFirst, I'm so glad you're ok and nothing worse happened to you. \n\nThank you for sharing that horrible experience as a reminder to all to please be safe out there. ",
            "author": "mraspencer",
            "id": "e6ifaf3",
            "parent_id": "t3_9ia33z",
            "score": 92,
            "created_utc": 1537735989.0,
            "replies": [
                {
                    "body": "I was driving back up the coast to home Friday evening when John and Ken had the Orange County DA on updating the unfolding case of a doctor and his female accomplice   who had been picking up girls, drugging and then filming sexual attacks on them. It sounds like SA may have been one of the sources in addition to the OC bars, freestylers and other web sites. \n\nApparently there are a large number of women on the many tapes seized from the doc's home and obtained under court order from Apple.\n\nThe article was written after after the arrests and probably before the doc's computer was searched.  \n\nhttps://www.ocregister.com/2018/09/18/newport-beach-surgeon-who-appeared-on-bravo-reality-show-and-his-girlfriend-accused-of-raping-2-women/\n\nI was surprised when my current SB was describing how common date rape drugs are in the Santa Barbara bar scene. There's also the case of cosmetic heir Andrew  Luster who loved to film the rape and degradation of drugged girls from the Santa Barbara area bars.\n\nIt's a dangerous world out there for young women including SB's.  \n\nThe young woman who opened the discussion deserves 5 gold stars for the good judgement in asking for help \n",
                    "author": "pinotandsugar",
                    "id": "e6im1od",
                    "parent_id": "t1_e6ifaf3",
                    "score": 22,
                    "created_utc": 1537742040.0,
                    "replies": [
                        {
                            "body": "It's so terrifying to hear about what you described. Usually my first dates (vanilla or not) are grabbing drinks and once you have a few in your system, it's not hard to start feeling relaxed and to become a little carefree. I'm glad that I wasn't in that sort of state. ",
                            "author": "grapefruit422",
                            "id": "e6iptv8",
                            "parent_id": "t1_e6im1od",
                            "score": 8,
                            "created_utc": 1537745584.0,
                            "replies": []
                        },
                        {
                            "body": "Santa Barbara has a really gross meat market scene. I occasionally work at a bar/venue up there and frequent a few other bars downtown where friends work (not club-type bars, but still packed on Fridays and Saturdays). I love SB because of my friends and the places I’m comfortable, but I could never live there and do the State St. scene habitually. ",
                            "author": "Mxfish1313",
                            "id": "e6j4dtw",
                            "parent_id": "t1_e6im1od",
                            "score": 2,
                            "created_utc": 1537760209.0,
                            "replies": [
                                {
                                    "body": "When I started driving from LA to the Santa Ynez Valley, often Friday evenings, the stretch of 101 from State Street out to  UCSB was like a demolition derby on speed. ",
                                    "author": "pinotandsugar",
                                    "id": "e6jc6al",
                                    "parent_id": "t1_e6j4dtw",
                                    "score": 2,
                                    "created_utc": 1537772040.0,
                                    "replies": [
                                        {
                                            "body": "Yep. I knew a guy that got killed on that stretch, too. They run busses from Isla Vista to downtown to help keep a lot of drunkies off of the road, but it’s a drop in the bucket. ",
                                            "author": "Mxfish1313",
                                            "id": "e6jcx1f",
                                            "parent_id": "t1_e6jc6al",
                                            "score": 1,
                                            "created_utc": 1537773544.0,
                                            "replies": [
                                                {
                                                    "body": "101 functions as a Darwinian sieve from State Street to  Isla Vista ",
                                                    "author": "pinotandsugar",
                                                    "id": "e6je91k",
                                                    "parent_id": "t1_e6jcx1f",
                                                    "score": 1,
                                                    "created_utc": 1537776515.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I hope they find him before he does this again.  I meet so many naïve girls on SA. Some have no idea of the dangers.\n",
            "author": "SDinBA",
            "id": "e6iftl2",
            "parent_id": "t3_9ia33z",
            "score": 26,
            "created_utc": 1537736432.0,
            "replies": []
        },
        {
            "body": "Glad you didn’t finish that drink. It is an oddly specific demand and leads me to believe he had either drugged you or would have conditioned to drugging you in the future. Could also explain why you felt trouble remembering at the taxi. ",
            "author": "whitefrogmatt",
            "id": "e6imw67",
            "parent_id": "t3_9ia33z",
            "score": 49,
            "created_utc": 1537742814.0,
            "replies": [
                {
                    "body": "Oh yes, there was no way I was going to finish that drink. My parents didn't raise no fool! Up until that point, I was holding each of my drinks in my hand, so I don't think he had any chance to slip anything in, luckily.",
                    "author": "grapefruit422",
                    "id": "e6iqj17",
                    "parent_id": "t1_e6imw67",
                    "score": 14,
                    "created_utc": 1537746285.0,
                    "replies": []
                },
                {
                    "body": "I was thinking the same thing ",
                    "author": "pinotandsugar",
                    "id": "e6ine8y",
                    "parent_id": "t1_e6imw67",
                    "score": 6,
                    "created_utc": 1537743282.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If something like happens (which I fervently hope never does). Your strongest weapon at time (unless you’re a black belt in karate) is simply your voice.  Yell as loudly as you can NO, anything to accompany that is fine, “get away”, “leave me alone” or “help”  but very loud shouts of  NO will attract a lot of attention that a guy in that place doesn’t want focused on him and can’t really be confused for anything else by observers.   ",
            "author": "Db102",
            "id": "e6imtqt",
            "parent_id": "t3_9ia33z",
            "score": 18,
            "created_utc": 1537742752.0,
            "replies": [
                {
                    "body": "> (unless you’re a black belt in karate)\n\nThis is the one Asian stereotype I don't fall under, unfortunately! Haha. Jokes aside, those are really valid points. I said this in another comment, but I believe that I just froze in the situation. My instinct wasn't to yell or scream or anything, it was just to take a mental recording of everything that was happening. I hope to never encounter anything similar ever again, but if I do, I'd like to think I'd be more prepared.",
                    "author": "grapefruit422",
                    "id": "e6ir3cc",
                    "parent_id": "t1_e6imtqt",
                    "score": 11,
                    "created_utc": 1537746870.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s extremely scary. I don’t think you did anything in the wrong to have prevented this situation. A big plus is you told the hostess to keep an eye out. Please be careful out there. ",
            "author": "tannedsb05",
            "id": "e6imo95",
            "parent_id": "t3_9ia33z",
            "score": 12,
            "created_utc": 1537742614.0,
            "replies": []
        },
        {
            "body": "This points up one of the dangers of freestyling that never gets mentioned here -- you have almost no way of knowing who the guy really is. At least when you meet someone through SA, there's a chance they can trace wrongdoers through their IP address or credit card info (not guaranteed, of course, but certainly better than nothing). I'm also curious why the restaurant wouldn't have his CC info? Anyway, I hope they catch the asshole. A nice, fat felony assault conviction (the modern-day Scarlet A) would be an appropriate outcome.  ",
            "author": null,
            "id": "e6ij83j",
            "parent_id": "t3_9ia33z",
            "score": 17,
            "created_utc": 1537739442.0,
            "replies": [
                {
                    "body": "I know, for whatever reason I thought it was better that we had met the way we did. I have no idea whether any part of the identity he provided me with (name, number, occupation, etc.) is real or not.\n\nHe hadn't provided a CC though, unfortunately. We were being served at the table, so we hadn't gotten a check or anything at that point.",
                    "author": "grapefruit422",
                    "id": "e6iqagq",
                    "parent_id": "t1_e6ij83j",
                    "score": 10,
                    "created_utc": 1537746038.0,
                    "replies": []
                },
                {
                    "body": "Good points.",
                    "author": null,
                    "id": "e6ikjp6",
                    "parent_id": "t1_e6ij83j",
                    "score": 2,
                    "created_utc": 1537740646.0,
                    "replies": []
                }
            ]
        },
        {
            "body": " What a terrible experience, thanks for sharing.  Glad you escaped relatively unscathed!",
            "author": "CentralUSGal",
            "id": "e6ifyxp",
            "parent_id": "t3_9ia33z",
            "score": 13,
            "created_utc": 1537736559.0,
            "replies": []
        },
        {
            "body": "This is horrific. The only good things here is the guy let out his true self during the M&G and you used your instincts and smarts to back yourself up at the restaurant. Lesson is always meet at a public place. A high end place is even better as they want to make sure their patrons feel safe.",
            "author": null,
            "id": "e6iib5v",
            "parent_id": "t3_9ia33z",
            "score": 12,
            "created_utc": 1537738629.0,
            "replies": [
                {
                    "body": "Ugh, right? And for the most part, I thought he was a respectable man... I didn't see this coming at all. It still doesn't even feel real.",
                    "author": "grapefruit422",
                    "id": "e6ipis2",
                    "parent_id": "t1_e6iib5v",
                    "score": 3,
                    "created_utc": 1537745283.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow. What a complete piece. So sorry this happened to you, and thank you for sharing your experience with the other women here. ",
            "author": "hesjustafriend",
            "id": "e6iiswq",
            "parent_id": "t3_9ia33z",
            "score": 4,
            "created_utc": 1537739073.0,
            "replies": []
        },
        {
            "body": "I’m so happy you trusted your gut and told the hostess. Hospitality staff are very understanding and helpful with situations like this, even if there turns out not to be a situation. Better to be safe, always.\n\nI hope they catch this guy and convict him with assault before he does this to someone else. Glad the police are involved.\n\nHope you’re okay too. You handled the situation the best anyone could, but I imagine it’d be quite anxiety provoking. The one thing to come out of this is to know that 9/10 people will protect you from that 1/10, which is my personal mantra whenever anxiety creeps up. Sending hugs ❤️",
            "author": null,
            "id": "e6iko4a",
            "parent_id": "t3_9ia33z",
            "score": 9,
            "created_utc": 1537740766.0,
            "replies": [
                {
                    "body": "> The one thing to come out of this is to know that 9/10 people will protect you from that 1/10\n\nThis, yes. So reassuring. I think that I'm a fairly confident person and I rarely feel intimated or scared, but in this situation I definitely froze up. It's good to know that there are still good people out there.",
                    "author": "grapefruit422",
                    "id": "e6iqqbv",
                    "parent_id": "t1_e6iko4a",
                    "score": 4,
                    "created_utc": 1537746495.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Iam sorry you had to go through this terrible experience. I hope they catch this monster before he does something terrible to other girls.",
            "author": "jawadas11",
            "id": "e6iieem",
            "parent_id": "t3_9ia33z",
            "score": 5,
            "created_utc": 1537738711.0,
            "replies": []
        },
        {
            "body": "You need to make sure the police have all the info to catch him \n\nAnd that he tells women that he is looking for an arrangement \n\nWhat a psycho ...",
            "author": "shamloo77",
            "id": "e6ipkqi",
            "parent_id": "t3_9ia33z",
            "score": 3,
            "created_utc": 1537745335.0,
            "replies": [
                {
                    "body": "I gave them all the information I had. I don't know if any of his story is legit or not. I basically told the police that he had promised to spoil me, financially and with gifts (this is true). I was slightly concerned that if they did find him, he'd try to pin me as an escort or something, but from what I can tell, they weren't too concerned about that. ",
                    "author": "grapefruit422",
                    "id": "e6iqvqh",
                    "parent_id": "t1_e6ipkqi",
                    "score": 4,
                    "created_utc": 1537746652.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow. I am so sorry that this happened to you and I am glad you made it out relatively safely. Unfortunately,  I have seen this countless times as a I spent many years in the nightclub business from bouncer to owner. There are many deranged scumbags and just as many women who let their guard down. It is a recipe for disaster. Thanks for providing a cautionary message for all the women out there",
            "author": "Teejaynj",
            "id": "e6irf2j",
            "parent_id": "t3_9ia33z",
            "score": 5,
            "created_utc": 1537747210.0,
            "replies": []
        },
        {
            "body": "Omg, are you ok??\n\nI’m glad you spoke to the hostess and that the restaurant got involved! It was wonderful of them to call the police for you and take care of you while you were processing what had happened. It’s scary thinking about what might have happened if you had sat down again, like if he’s emboldened enough to attack you in public he’s probably not above drugging your drink either...\n\nHere’s a million hugs for you 💗",
            "author": "enchantedbaby",
            "id": "e6ii3t9",
            "parent_id": "t3_9ia33z",
            "score": 7,
            "created_utc": 1537738445.0,
            "replies": [
                {
                    "body": "Thank you so much. I'm incredibly grateful for their help! ",
                    "author": "grapefruit422",
                    "id": "e6iq0h1",
                    "parent_id": "t1_e6ii3t9",
                    "score": 3,
                    "created_utc": 1537745761.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow! I am so sorry you had this experience \n\nBut you did almost everything right when the \"date\" went south. Telling someone especially a female someone as soon as you can is critical.\n\nYou posting this tactic will save some girls life I'm sure. Perhaps you saved your own.\n\n",
            "author": "ninja1818",
            "id": "e6iz8d1",
            "parent_id": "t3_9ia33z",
            "score": 3,
            "created_utc": 1537755020.0,
            "replies": []
        },
        {
            "body": "I don't understand how human beings can think like those kind of guys do.\n\nSomewhat good that he was dumb enough to let you know early enough about the inner sociopath.\n\nI wish you better luck!",
            "author": "bitcoinmaster9000",
            "id": "e6klo8r",
            "parent_id": "t3_9ia33z",
            "score": 3,
            "created_utc": 1537823151.0,
            "replies": []
        },
        {
            "body": "Sorry about your experience. I hope they catch the guy. Next time carry pepper spray in your purse 👛 you can never be too careful. ",
            "author": "coolchic101",
            "id": "e6ikk8z",
            "parent_id": "t3_9ia33z",
            "score": 5,
            "created_utc": 1537740661.0,
            "replies": [
                {
                    "body": "Ugh yes, I should. I've heard that it's difficult to come by in NYC (I think it's illegal to have it mailed to you personally?) but definitely worth seeking out.",
                    "author": "grapefruit422",
                    "id": "e6iqml8",
                    "parent_id": "t1_e6ikk8z",
                    "score": 2,
                    "created_utc": 1537746386.0,
                    "replies": [
                        {
                            "body": "i live in austin now but i was born and raised in new york and if you can take the train out to long island any gun store there would have it or mace and they have super discreet packaging you can get it in ",
                            "author": "sunsetsandnicotine",
                            "id": "e6j80bv",
                            "parent_id": "t1_e6iqml8",
                            "score": 2,
                            "created_utc": 1537764935.0,
                            "replies": []
                        },
                        {
                            "body": "Hi, native New Yorker. I've had pepper spray mailed to me personally a few times. Just make sure it fits in the mailbox. ",
                            "author": null,
                            "id": "ec0dgwj",
                            "parent_id": "t1_e6iqml8",
                            "score": 1,
                            "created_utc": 1545088992.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Holy fuck, that is terrible! I'm so glad people were able to help you get away from that POS in time. And hopefully the authorities are able to identify and catch him. I just wish it wasn't too emotional traumatic for you.",
            "author": "Sugarbetch",
            "id": "e6in0d2",
            "parent_id": "t3_9ia33z",
            "score": 2,
            "created_utc": 1537742928.0,
            "replies": []
        },
        {
            "body": "I'm so sorry this happened to you. Sounds like you handled it as well as I could have hoped to. Just comes to show you can never be too careful. Feel free to PM if you ever need to vent, NYC can be terrifying because of the people it holds.",
            "author": "NYC-SB",
            "id": "e6j41gk",
            "parent_id": "t3_9ia33z",
            "score": 2,
            "created_utc": 1537759811.0,
            "replies": [
                {
                    "body": "Thanks girl :) Same here! We have to stay vigilant!",
                    "author": "grapefruit422",
                    "id": "e6jorbs",
                    "parent_id": "t1_e6j41gk",
                    "score": 2,
                    "created_utc": 1537795089.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well that's fucking nuts! I am sorry that happened to you! I am glad you were able to get out of the situation and the cops were called! Fuck that guy and anyone like him who thinks that sort of behavior is ok! ",
            "author": "BigBearSD",
            "id": "e6jlypf",
            "parent_id": "t3_9ia33z",
            "score": 2,
            "created_utc": 1537791678.0,
            "replies": []
        },
        {
            "body": "What a deplorable person, that's scary AF and I'm so glad you got away, and had the presence of mind to enlist the help of the bar staff. If he was willing to show this much of his dark side in public, I can't imagine what would have happened in private. Stay safe.",
            "author": "Cledaddy23",
            "id": "e6kr1j1",
            "parent_id": "t3_9ia33z",
            "score": 2,
            "created_utc": 1537827882.0,
            "replies": []
        },
        {
            "body": "So sorry this happened to you. Literally nothing you could have done better in this circumstance. There are just horrible men out there and we all have to stay vigilant no matter how nice a guy seems. ",
            "author": "MASugarBaby",
            "id": "e6ig6dj",
            "parent_id": "t3_9ia33z",
            "score": 4,
            "created_utc": 1537736739.0,
            "replies": []
        },
        {
            "body": "What percentage of SDs are like this, I wonder....",
            "author": "Laurendonahue7",
            "id": "e6iq2u7",
            "parent_id": "t3_9ia33z",
            "score": 2,
            "created_utc": 1537745825.0,
            "replies": [
                {
                    "body": "REAL sugar daddies?  Actually very few.  This guy most likely wasn’t a wealthy benefactor, he had some cash to throw around but if he’s less than ceo level, (and its pretty easy to tell, if you thjnk about it)  then he’s a fraud or what I call a Splenda-Daddy.  These dudes are much, much likelier to physically hurt you. They’re the ones that feel impotent and powerless in their real lives in they want to live out an opposite fantasy, and they don’t care if it’s your life paying the expense.\n\nBasic rule if thumb I’ve found to be most helpful in helping me tell the difference:  ask yourself “How is he speaking to me? Is he asking what I do, what I like; is he talking about his job or his hobbies, where he feels unfulfilled, what he likes about you (physical doesn’t count)?  Is he paying you compliments, making eye contact, actually actively listening and giving feedback?  Is HE TREATING YOU LIKE A POTENTIAL COMPANION, OR IS HE TREATING YOU LIKE A HOOKER?”\n\nIf the first things out if his mouth are sexual, jf he’s lewd and crude, if he interrupts or talks iver you ir dismisses you, if he orders drinks/meals for you without asking, if he shows you nudes of himself or ugh, of him fucking another woman (true disgusting story), is he trying to get too physically close, does he not ask you anything other than sexual questions...all these are huge red flags.\n\nReal sugar daddies know that a woman must ne wooed to be interested.  Real daddies dont want a hooker, they could get one cheaper any time.  Real daddies dont cut to the chase like a horny teenager.  The real ones have class, a better standard of livjng which requires honed manners that are not easily broken out of habit.  They are high ups in companies inpart due to their genteelness and amiability.  They are people pleasers, not abusers.  \n\nIve had the remarkable luck of having one who was vice pres of a five star hotel chain, and two retired military officers from the Pentagon.  Set your standards high, ladies.  Be witty, funny, demure yet teasing.  Keep it light and fun.  Keep it classy.  Do your homework.  Verify info.  And if you get a weird vibe, for gods sake give yourself enough credit to trust your instincts and bolt.  ",
                    "author": "Junoblanche",
                    "id": "e8cd7oq",
                    "parent_id": "t1_e6iq2u7",
                    "score": 3,
                    "created_utc": 1540356638.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Holy shit.  Glad your spidy-sense kicked in before it was too late (or before you finished that drink).",
            "author": "imaybeacatIRl",
            "id": "e6j5uaj",
            "parent_id": "t3_9ia33z",
            "score": 1,
            "created_utc": 1537761978.0,
            "replies": []
        },
        {
            "body": "Wow.. wow.. wow.. that’s one hell of a terrifying experience holy crap! \nAfter weeks of talking and agreeing to a generous arrangement all to get shoved to the ground with him saying you humiliated him?! Gadddaamm that’s fucked up! He was probably a serial killer for all you freakin knew! But you’re so right with those gut instincts.. if you just listen you can dodge any bullet. Especially telling the host, I would have been too ashamed to have her look at me like “whatever that’s not my job” but hey you did exactly what your instincts told you, had you not you would could have been... shit.. nvm. \nI cannot believe some men.. well.. a lot of men actually who think they can get away with whatever they want because money. They don’t value us, they think we’re trash sometimes and treat us like we should be bowing down to them or some shit. Not all men but the majority are either bs or insane. I’m always aggressive through texting and if they can get past that then I’ll meet and I’d say 95% cannot get past the interrogation phase which is fine I’d rather block a person online then go running for the hills. \nBut man your situation could have happened to me or anyone because of the continued texting and because it seems genuine but... anything can happen so it’s best to always keep your guards up and remain focused on your safety. \n",
            "author": "hyvon92",
            "id": "e7bl7m0",
            "parent_id": "t3_9ia33z",
            "score": 1,
            "created_utc": 1538897065.0,
            "replies": []
        },
        {
            "body": "this is terrifying. you dotted your i's and crossed your t's, and he still slipped through. as another asian (korean!) girl, i've had plenty of the creepy asian fetishization dudes, but never this scary. \n\nso glad you're safe! and this could have honestly been SO much worse--this dude sounds dangerous but you trusted your instincts and did everything right. none of this was on you.",
            "author": "valentine9712",
            "id": "ec3mc4a",
            "parent_id": "t3_9ia33z",
            "score": 1,
            "created_utc": 1545205488.0,
            "replies": []
        },
        {
            "body": "What a creep!! Please never underlook your safety. Freestyling (unfortunately) has risks no one should ignore. Glad those bystanders were there to help you! Remember to always stay safe and don't compromise on safety rules. Take care :)",
            "author": null,
            "id": "ei78jb4",
            "parent_id": "t3_9ia33z",
            "score": 1,
            "created_utc": 1552216185.0,
            "replies": []
        },
        {
            "body": "Yeah sure lol ",
            "author": "cargarzartar",
            "id": "eied99j",
            "parent_id": "t3_9ia33z",
            "score": 1,
            "created_utc": 1552440499.0,
            "replies": []
        },
        {
            "body": "r/thathappened",
            "author": "cargarzartar",
            "id": "eiedapl",
            "parent_id": "t3_9ia33z",
            "score": 1,
            "created_utc": 1552440528.0,
            "replies": []
        },
        {
            "body": "There are many women’s self defense classes out there. Many are free, I taught one at a local college for many years.  They can be empowering and help you overcome that sense of panic ",
            "author": "Db102",
            "id": "e6iz3wh",
            "parent_id": "t3_9ia33z",
            "score": 0,
            "created_utc": 1537754894.0,
            "replies": []
        },
        {
            "body": "We are very glad that you are safe but is there any news articles about this attack?  in the past people have written sensational stories to get attention.  We should all be careful not to trust everything that we read.  This happened in a public place and it will be very unusual not to find it covered by the news especially a sensational mag like New York Post.  Also op is new Reddit account.",
            "author": "lcsugar",
            "id": "e6ikqo9",
            "parent_id": "t3_9ia33z",
            "score": -10,
            "created_utc": 1537740833.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e6jbj0w",
                    "parent_id": "t1_e6ikqo9",
                    "score": 9,
                    "created_utc": 1537770813.0,
                    "replies": [
                        {
                            "body": "You don't believe someone can make up a story for attention/karma?",
                            "author": "lcsugar",
                            "id": "e6jkfc1",
                            "parent_id": "t1_e6jbj0w",
                            "score": 0,
                            "created_utc": 1537789488.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think it is way too common and clubs (and local politicians) do not like negative publicity especially if it is their big buck clients, donors or \"important people\"  .  ",
                    "author": "pinotandsugar",
                    "id": "e6imgvy",
                    "parent_id": "t1_e6ikqo9",
                    "score": 5,
                    "created_utc": 1537742426.0,
                    "replies": [
                        {
                            "body": "by her own admission this happened at a \"popular bar in Midtown\"... tons of people around, and I can't find anything on twitter, instagram, or news media about it.",
                            "author": "lcsugar",
                            "id": "e6ip77c",
                            "parent_id": "t1_e6imgvy",
                            "score": -1,
                            "created_utc": 1537744980.0,
                            "replies": [
                                {
                                    "body": "Which bar? Or if you’re uncomfortable sharing I think I may know who this is. Do you know if he lived in midtown? I had a bad experience with a guy from there. ",
                                    "author": "Concdead",
                                    "id": "e6itjrq",
                                    "parent_id": "t1_e6ip77c",
                                    "score": 3,
                                    "created_utc": 1537749409.0,
                                    "replies": [
                                        {
                                            "body": "you should reply to the OP rather than me, she probably can't see this.",
                                            "author": "lcsugar",
                                            "id": "e6iw7qr",
                                            "parent_id": "t1_e6itjrq",
                                            "score": 1,
                                            "created_utc": 1537752030.0,
                                            "replies": [
                                                {
                                                    "body": "Noob mistake lel my bad ",
                                                    "author": "Concdead",
                                                    "id": "e6iwzau",
                                                    "parent_id": "t1_e6iw7qr",
                                                    "score": 1,
                                                    "created_utc": 1537752777.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "There's a whole lot that never makes twitter, instagram or the news or that it filtered out.  If you want to understand how bad it gets google Gemmel Moore ",
                                    "author": "pinotandsugar",
                                    "id": "e6iymla",
                                    "parent_id": "t1_e6ip77c",
                                    "score": 2,
                                    "created_utc": 1537754409.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I haven't browsed the news or anything, so I have no idea. I understand your skepticism, though. I've been a lurker for a while and just felt it necessary to make an account to remind others to be safe.",
                    "author": "grapefruit422",
                    "id": "e6itqy8",
                    "parent_id": "t1_e6ikqo9",
                    "score": 6,
                    "created_utc": 1537749615.0,
                    "replies": []
                },
                {
                    "body": "Dude, this shit wouldn't even make the news in a boring small town, stuff way crazier than this happens a million times over all over the world and it doesn't get reported. Think about crazy things you've seen in your own life that were newsworthy but were never reported publicly",
                    "author": "OceanRacoon",
                    "id": "e6ix6gd",
                    "parent_id": "t1_e6ikqo9",
                    "score": 8,
                    "created_utc": 1537752975.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was driving back up the coast to home Friday evening when John and Ken had the Orange County DA on updating the unfolding case of a doctor and his female accomplice   who had been picking up girls, drugging and then filming sexual attacks on them. It sounds like SA may have been one of the sources in addition to the OC bars, freestylers and other web sites. \n\nApparently there are a large number of women on the many tapes seized from the doc's home and obtained under court order from Apple.\n\nThe article was written after after the arrests and probably before the doc's computer was searched.  \n\nhttps://www.ocregister.com/2018/09/18/newport-beach-surgeon-who-appeared-on-bravo-reality-show-and-his-girlfriend-accused-of-raping-2-women/\n\nI was surprised when my current SB was describing how common date rape drugs are in the Santa Barbara bar scene. There's also the case of cosmetic heir Andrew  Luster who loved to film the rape and degradation of drugged girls from the Santa Barbara area bars.\n\nIt's a dangerous world out there for young women including SB's.  \n\nThe young woman who opened the discussion deserves 5 gold stars for the good judgement in asking for help \n",
            "author": "pinotandsugar",
            "id": "e6im1od",
            "parent_id": "t1_e6ifaf3",
            "score": 22,
            "created_utc": 1537742040.0,
            "replies": [
                {
                    "body": "It's so terrifying to hear about what you described. Usually my first dates (vanilla or not) are grabbing drinks and once you have a few in your system, it's not hard to start feeling relaxed and to become a little carefree. I'm glad that I wasn't in that sort of state. ",
                    "author": "grapefruit422",
                    "id": "e6iptv8",
                    "parent_id": "t1_e6im1od",
                    "score": 8,
                    "created_utc": 1537745584.0,
                    "replies": []
                },
                {
                    "body": "Santa Barbara has a really gross meat market scene. I occasionally work at a bar/venue up there and frequent a few other bars downtown where friends work (not club-type bars, but still packed on Fridays and Saturdays). I love SB because of my friends and the places I’m comfortable, but I could never live there and do the State St. scene habitually. ",
                    "author": "Mxfish1313",
                    "id": "e6j4dtw",
                    "parent_id": "t1_e6im1od",
                    "score": 2,
                    "created_utc": 1537760209.0,
                    "replies": [
                        {
                            "body": "When I started driving from LA to the Santa Ynez Valley, often Friday evenings, the stretch of 101 from State Street out to  UCSB was like a demolition derby on speed. ",
                            "author": "pinotandsugar",
                            "id": "e6jc6al",
                            "parent_id": "t1_e6j4dtw",
                            "score": 2,
                            "created_utc": 1537772040.0,
                            "replies": [
                                {
                                    "body": "Yep. I knew a guy that got killed on that stretch, too. They run busses from Isla Vista to downtown to help keep a lot of drunkies off of the road, but it’s a drop in the bucket. ",
                                    "author": "Mxfish1313",
                                    "id": "e6jcx1f",
                                    "parent_id": "t1_e6jc6al",
                                    "score": 1,
                                    "created_utc": 1537773544.0,
                                    "replies": [
                                        {
                                            "body": "101 functions as a Darwinian sieve from State Street to  Isla Vista ",
                                            "author": "pinotandsugar",
                                            "id": "e6je91k",
                                            "parent_id": "t1_e6jcx1f",
                                            "score": 1,
                                            "created_utc": 1537776515.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh yes, there was no way I was going to finish that drink. My parents didn't raise no fool! Up until that point, I was holding each of my drinks in my hand, so I don't think he had any chance to slip anything in, luckily.",
            "author": "grapefruit422",
            "id": "e6iqj17",
            "parent_id": "t1_e6imw67",
            "score": 14,
            "created_utc": 1537746285.0,
            "replies": []
        },
        {
            "body": "I was thinking the same thing ",
            "author": "pinotandsugar",
            "id": "e6ine8y",
            "parent_id": "t1_e6imw67",
            "score": 6,
            "created_utc": 1537743282.0,
            "replies": []
        },
        {
            "body": "> (unless you’re a black belt in karate)\n\nThis is the one Asian stereotype I don't fall under, unfortunately! Haha. Jokes aside, those are really valid points. I said this in another comment, but I believe that I just froze in the situation. My instinct wasn't to yell or scream or anything, it was just to take a mental recording of everything that was happening. I hope to never encounter anything similar ever again, but if I do, I'd like to think I'd be more prepared.",
            "author": "grapefruit422",
            "id": "e6ir3cc",
            "parent_id": "t1_e6imtqt",
            "score": 11,
            "created_utc": 1537746870.0,
            "replies": []
        },
        {
            "body": "I know, for whatever reason I thought it was better that we had met the way we did. I have no idea whether any part of the identity he provided me with (name, number, occupation, etc.) is real or not.\n\nHe hadn't provided a CC though, unfortunately. We were being served at the table, so we hadn't gotten a check or anything at that point.",
            "author": "grapefruit422",
            "id": "e6iqagq",
            "parent_id": "t1_e6ij83j",
            "score": 10,
            "created_utc": 1537746038.0,
            "replies": []
        },
        {
            "body": "Good points.",
            "author": null,
            "id": "e6ikjp6",
            "parent_id": "t1_e6ij83j",
            "score": 2,
            "created_utc": 1537740646.0,
            "replies": []
        },
        {
            "body": "Ugh, right? And for the most part, I thought he was a respectable man... I didn't see this coming at all. It still doesn't even feel real.",
            "author": "grapefruit422",
            "id": "e6ipis2",
            "parent_id": "t1_e6iib5v",
            "score": 3,
            "created_utc": 1537745283.0,
            "replies": []
        },
        {
            "body": "> The one thing to come out of this is to know that 9/10 people will protect you from that 1/10\n\nThis, yes. So reassuring. I think that I'm a fairly confident person and I rarely feel intimated or scared, but in this situation I definitely froze up. It's good to know that there are still good people out there.",
            "author": "grapefruit422",
            "id": "e6iqqbv",
            "parent_id": "t1_e6iko4a",
            "score": 4,
            "created_utc": 1537746495.0,
            "replies": []
        },
        {
            "body": "I gave them all the information I had. I don't know if any of his story is legit or not. I basically told the police that he had promised to spoil me, financially and with gifts (this is true). I was slightly concerned that if they did find him, he'd try to pin me as an escort or something, but from what I can tell, they weren't too concerned about that. ",
            "author": "grapefruit422",
            "id": "e6iqvqh",
            "parent_id": "t1_e6ipkqi",
            "score": 4,
            "created_utc": 1537746652.0,
            "replies": []
        },
        {
            "body": "Thank you so much. I'm incredibly grateful for their help! ",
            "author": "grapefruit422",
            "id": "e6iq0h1",
            "parent_id": "t1_e6ii3t9",
            "score": 3,
            "created_utc": 1537745761.0,
            "replies": []
        },
        {
            "body": "Ugh yes, I should. I've heard that it's difficult to come by in NYC (I think it's illegal to have it mailed to you personally?) but definitely worth seeking out.",
            "author": "grapefruit422",
            "id": "e6iqml8",
            "parent_id": "t1_e6ikk8z",
            "score": 2,
            "created_utc": 1537746386.0,
            "replies": [
                {
                    "body": "i live in austin now but i was born and raised in new york and if you can take the train out to long island any gun store there would have it or mace and they have super discreet packaging you can get it in ",
                    "author": "sunsetsandnicotine",
                    "id": "e6j80bv",
                    "parent_id": "t1_e6iqml8",
                    "score": 2,
                    "created_utc": 1537764935.0,
                    "replies": []
                },
                {
                    "body": "Hi, native New Yorker. I've had pepper spray mailed to me personally a few times. Just make sure it fits in the mailbox. ",
                    "author": null,
                    "id": "ec0dgwj",
                    "parent_id": "t1_e6iqml8",
                    "score": 1,
                    "created_utc": 1545088992.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks girl :) Same here! We have to stay vigilant!",
            "author": "grapefruit422",
            "id": "e6jorbs",
            "parent_id": "t1_e6j41gk",
            "score": 2,
            "created_utc": 1537795089.0,
            "replies": []
        },
        {
            "body": "REAL sugar daddies?  Actually very few.  This guy most likely wasn’t a wealthy benefactor, he had some cash to throw around but if he’s less than ceo level, (and its pretty easy to tell, if you thjnk about it)  then he’s a fraud or what I call a Splenda-Daddy.  These dudes are much, much likelier to physically hurt you. They’re the ones that feel impotent and powerless in their real lives in they want to live out an opposite fantasy, and they don’t care if it’s your life paying the expense.\n\nBasic rule if thumb I’ve found to be most helpful in helping me tell the difference:  ask yourself “How is he speaking to me? Is he asking what I do, what I like; is he talking about his job or his hobbies, where he feels unfulfilled, what he likes about you (physical doesn’t count)?  Is he paying you compliments, making eye contact, actually actively listening and giving feedback?  Is HE TREATING YOU LIKE A POTENTIAL COMPANION, OR IS HE TREATING YOU LIKE A HOOKER?”\n\nIf the first things out if his mouth are sexual, jf he’s lewd and crude, if he interrupts or talks iver you ir dismisses you, if he orders drinks/meals for you without asking, if he shows you nudes of himself or ugh, of him fucking another woman (true disgusting story), is he trying to get too physically close, does he not ask you anything other than sexual questions...all these are huge red flags.\n\nReal sugar daddies know that a woman must ne wooed to be interested.  Real daddies dont want a hooker, they could get one cheaper any time.  Real daddies dont cut to the chase like a horny teenager.  The real ones have class, a better standard of livjng which requires honed manners that are not easily broken out of habit.  They are high ups in companies inpart due to their genteelness and amiability.  They are people pleasers, not abusers.  \n\nIve had the remarkable luck of having one who was vice pres of a five star hotel chain, and two retired military officers from the Pentagon.  Set your standards high, ladies.  Be witty, funny, demure yet teasing.  Keep it light and fun.  Keep it classy.  Do your homework.  Verify info.  And if you get a weird vibe, for gods sake give yourself enough credit to trust your instincts and bolt.  ",
            "author": "Junoblanche",
            "id": "e8cd7oq",
            "parent_id": "t1_e6iq2u7",
            "score": 3,
            "created_utc": 1540356638.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e6jbj0w",
            "parent_id": "t1_e6ikqo9",
            "score": 9,
            "created_utc": 1537770813.0,
            "replies": [
                {
                    "body": "You don't believe someone can make up a story for attention/karma?",
                    "author": "lcsugar",
                    "id": "e6jkfc1",
                    "parent_id": "t1_e6jbj0w",
                    "score": 0,
                    "created_utc": 1537789488.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think it is way too common and clubs (and local politicians) do not like negative publicity especially if it is their big buck clients, donors or \"important people\"  .  ",
            "author": "pinotandsugar",
            "id": "e6imgvy",
            "parent_id": "t1_e6ikqo9",
            "score": 5,
            "created_utc": 1537742426.0,
            "replies": [
                {
                    "body": "by her own admission this happened at a \"popular bar in Midtown\"... tons of people around, and I can't find anything on twitter, instagram, or news media about it.",
                    "author": "lcsugar",
                    "id": "e6ip77c",
                    "parent_id": "t1_e6imgvy",
                    "score": -1,
                    "created_utc": 1537744980.0,
                    "replies": [
                        {
                            "body": "Which bar? Or if you’re uncomfortable sharing I think I may know who this is. Do you know if he lived in midtown? I had a bad experience with a guy from there. ",
                            "author": "Concdead",
                            "id": "e6itjrq",
                            "parent_id": "t1_e6ip77c",
                            "score": 3,
                            "created_utc": 1537749409.0,
                            "replies": [
                                {
                                    "body": "you should reply to the OP rather than me, she probably can't see this.",
                                    "author": "lcsugar",
                                    "id": "e6iw7qr",
                                    "parent_id": "t1_e6itjrq",
                                    "score": 1,
                                    "created_utc": 1537752030.0,
                                    "replies": [
                                        {
                                            "body": "Noob mistake lel my bad ",
                                            "author": "Concdead",
                                            "id": "e6iwzau",
                                            "parent_id": "t1_e6iw7qr",
                                            "score": 1,
                                            "created_utc": 1537752777.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "There's a whole lot that never makes twitter, instagram or the news or that it filtered out.  If you want to understand how bad it gets google Gemmel Moore ",
                            "author": "pinotandsugar",
                            "id": "e6iymla",
                            "parent_id": "t1_e6ip77c",
                            "score": 2,
                            "created_utc": 1537754409.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I haven't browsed the news or anything, so I have no idea. I understand your skepticism, though. I've been a lurker for a while and just felt it necessary to make an account to remind others to be safe.",
            "author": "grapefruit422",
            "id": "e6itqy8",
            "parent_id": "t1_e6ikqo9",
            "score": 6,
            "created_utc": 1537749615.0,
            "replies": []
        },
        {
            "body": "Dude, this shit wouldn't even make the news in a boring small town, stuff way crazier than this happens a million times over all over the world and it doesn't get reported. Think about crazy things you've seen in your own life that were newsworthy but were never reported publicly",
            "author": "OceanRacoon",
            "id": "e6ix6gd",
            "parent_id": "t1_e6ikqo9",
            "score": 8,
            "created_utc": 1537752975.0,
            "replies": []
        },
        {
            "body": "It's so terrifying to hear about what you described. Usually my first dates (vanilla or not) are grabbing drinks and once you have a few in your system, it's not hard to start feeling relaxed and to become a little carefree. I'm glad that I wasn't in that sort of state. ",
            "author": "grapefruit422",
            "id": "e6iptv8",
            "parent_id": "t1_e6im1od",
            "score": 8,
            "created_utc": 1537745584.0,
            "replies": []
        },
        {
            "body": "Santa Barbara has a really gross meat market scene. I occasionally work at a bar/venue up there and frequent a few other bars downtown where friends work (not club-type bars, but still packed on Fridays and Saturdays). I love SB because of my friends and the places I’m comfortable, but I could never live there and do the State St. scene habitually. ",
            "author": "Mxfish1313",
            "id": "e6j4dtw",
            "parent_id": "t1_e6im1od",
            "score": 2,
            "created_utc": 1537760209.0,
            "replies": [
                {
                    "body": "When I started driving from LA to the Santa Ynez Valley, often Friday evenings, the stretch of 101 from State Street out to  UCSB was like a demolition derby on speed. ",
                    "author": "pinotandsugar",
                    "id": "e6jc6al",
                    "parent_id": "t1_e6j4dtw",
                    "score": 2,
                    "created_utc": 1537772040.0,
                    "replies": [
                        {
                            "body": "Yep. I knew a guy that got killed on that stretch, too. They run busses from Isla Vista to downtown to help keep a lot of drunkies off of the road, but it’s a drop in the bucket. ",
                            "author": "Mxfish1313",
                            "id": "e6jcx1f",
                            "parent_id": "t1_e6jc6al",
                            "score": 1,
                            "created_utc": 1537773544.0,
                            "replies": [
                                {
                                    "body": "101 functions as a Darwinian sieve from State Street to  Isla Vista ",
                                    "author": "pinotandsugar",
                                    "id": "e6je91k",
                                    "parent_id": "t1_e6jcx1f",
                                    "score": 1,
                                    "created_utc": 1537776515.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "i live in austin now but i was born and raised in new york and if you can take the train out to long island any gun store there would have it or mace and they have super discreet packaging you can get it in ",
            "author": "sunsetsandnicotine",
            "id": "e6j80bv",
            "parent_id": "t1_e6iqml8",
            "score": 2,
            "created_utc": 1537764935.0,
            "replies": []
        },
        {
            "body": "Hi, native New Yorker. I've had pepper spray mailed to me personally a few times. Just make sure it fits in the mailbox. ",
            "author": null,
            "id": "ec0dgwj",
            "parent_id": "t1_e6iqml8",
            "score": 1,
            "created_utc": 1545088992.0,
            "replies": []
        },
        {
            "body": "You don't believe someone can make up a story for attention/karma?",
            "author": "lcsugar",
            "id": "e6jkfc1",
            "parent_id": "t1_e6jbj0w",
            "score": 0,
            "created_utc": 1537789488.0,
            "replies": []
        },
        {
            "body": "by her own admission this happened at a \"popular bar in Midtown\"... tons of people around, and I can't find anything on twitter, instagram, or news media about it.",
            "author": "lcsugar",
            "id": "e6ip77c",
            "parent_id": "t1_e6imgvy",
            "score": -1,
            "created_utc": 1537744980.0,
            "replies": [
                {
                    "body": "Which bar? Or if you’re uncomfortable sharing I think I may know who this is. Do you know if he lived in midtown? I had a bad experience with a guy from there. ",
                    "author": "Concdead",
                    "id": "e6itjrq",
                    "parent_id": "t1_e6ip77c",
                    "score": 3,
                    "created_utc": 1537749409.0,
                    "replies": [
                        {
                            "body": "you should reply to the OP rather than me, she probably can't see this.",
                            "author": "lcsugar",
                            "id": "e6iw7qr",
                            "parent_id": "t1_e6itjrq",
                            "score": 1,
                            "created_utc": 1537752030.0,
                            "replies": [
                                {
                                    "body": "Noob mistake lel my bad ",
                                    "author": "Concdead",
                                    "id": "e6iwzau",
                                    "parent_id": "t1_e6iw7qr",
                                    "score": 1,
                                    "created_utc": 1537752777.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "There's a whole lot that never makes twitter, instagram or the news or that it filtered out.  If you want to understand how bad it gets google Gemmel Moore ",
                    "author": "pinotandsugar",
                    "id": "e6iymla",
                    "parent_id": "t1_e6ip77c",
                    "score": 2,
                    "created_utc": 1537754409.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When I started driving from LA to the Santa Ynez Valley, often Friday evenings, the stretch of 101 from State Street out to  UCSB was like a demolition derby on speed. ",
            "author": "pinotandsugar",
            "id": "e6jc6al",
            "parent_id": "t1_e6j4dtw",
            "score": 2,
            "created_utc": 1537772040.0,
            "replies": [
                {
                    "body": "Yep. I knew a guy that got killed on that stretch, too. They run busses from Isla Vista to downtown to help keep a lot of drunkies off of the road, but it’s a drop in the bucket. ",
                    "author": "Mxfish1313",
                    "id": "e6jcx1f",
                    "parent_id": "t1_e6jc6al",
                    "score": 1,
                    "created_utc": 1537773544.0,
                    "replies": [
                        {
                            "body": "101 functions as a Darwinian sieve from State Street to  Isla Vista ",
                            "author": "pinotandsugar",
                            "id": "e6je91k",
                            "parent_id": "t1_e6jcx1f",
                            "score": 1,
                            "created_utc": 1537776515.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Which bar? Or if you’re uncomfortable sharing I think I may know who this is. Do you know if he lived in midtown? I had a bad experience with a guy from there. ",
            "author": "Concdead",
            "id": "e6itjrq",
            "parent_id": "t1_e6ip77c",
            "score": 3,
            "created_utc": 1537749409.0,
            "replies": [
                {
                    "body": "you should reply to the OP rather than me, she probably can't see this.",
                    "author": "lcsugar",
                    "id": "e6iw7qr",
                    "parent_id": "t1_e6itjrq",
                    "score": 1,
                    "created_utc": 1537752030.0,
                    "replies": [
                        {
                            "body": "Noob mistake lel my bad ",
                            "author": "Concdead",
                            "id": "e6iwzau",
                            "parent_id": "t1_e6iw7qr",
                            "score": 1,
                            "created_utc": 1537752777.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There's a whole lot that never makes twitter, instagram or the news or that it filtered out.  If you want to understand how bad it gets google Gemmel Moore ",
            "author": "pinotandsugar",
            "id": "e6iymla",
            "parent_id": "t1_e6ip77c",
            "score": 2,
            "created_utc": 1537754409.0,
            "replies": []
        },
        {
            "body": "Yep. I knew a guy that got killed on that stretch, too. They run busses from Isla Vista to downtown to help keep a lot of drunkies off of the road, but it’s a drop in the bucket. ",
            "author": "Mxfish1313",
            "id": "e6jcx1f",
            "parent_id": "t1_e6jc6al",
            "score": 1,
            "created_utc": 1537773544.0,
            "replies": [
                {
                    "body": "101 functions as a Darwinian sieve from State Street to  Isla Vista ",
                    "author": "pinotandsugar",
                    "id": "e6je91k",
                    "parent_id": "t1_e6jcx1f",
                    "score": 1,
                    "created_utc": 1537776515.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "you should reply to the OP rather than me, she probably can't see this.",
            "author": "lcsugar",
            "id": "e6iw7qr",
            "parent_id": "t1_e6itjrq",
            "score": 1,
            "created_utc": 1537752030.0,
            "replies": [
                {
                    "body": "Noob mistake lel my bad ",
                    "author": "Concdead",
                    "id": "e6iwzau",
                    "parent_id": "t1_e6iw7qr",
                    "score": 1,
                    "created_utc": 1537752777.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "101 functions as a Darwinian sieve from State Street to  Isla Vista ",
            "author": "pinotandsugar",
            "id": "e6je91k",
            "parent_id": "t1_e6jcx1f",
            "score": 1,
            "created_utc": 1537776515.0,
            "replies": []
        },
        {
            "body": "Noob mistake lel my bad ",
            "author": "Concdead",
            "id": "e6iwzau",
            "parent_id": "t1_e6iw7qr",
            "score": 1,
            "created_utc": 1537752777.0,
            "replies": []
        }
    ]
}