{
    "title": "( M 21) Advice for my hairline I keep my hair in a fringed mullet",
    "post_id": "o4uwxx",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/o4uwxx/m_21_advice_for_my_hairline_i_keep_my_hair_in_a/",
    "author": "somesortageezer",
    "body": "",
    "url": "https://i.redd.it/sinc5qh2dm671.jpg",
    "score": 266,
    "upvote_ratio": 0.98,
    "created_utc": 1624281417.0,
    "num_comments": 35,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I just wanna say that your hair looks fucking amazing",
            "author": "darkpsycho_",
            "id": "h2jju8l",
            "parent_id": "t3_o4uwxx",
            "score": 150,
            "created_utc": 1624287456.0,
            "replies": [
                {
                    "body": "Hahah I appreciate that mate it’s come a long way",
                    "author": "somesortageezer",
                    "id": "h2jk0f4",
                    "parent_id": "t1_h2jju8l",
                    "score": 30,
                    "created_utc": 1624287536.0,
                    "replies": []
                },
                {
                    "body": "I came here to say the same thing. Maybe you should be giving advice lol",
                    "author": "Cleverrhymes",
                    "id": "h2k5jyf",
                    "parent_id": "t1_h2jju8l",
                    "score": 12,
                    "created_utc": 1624297202.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know men have a lot of insecurities about receding hairlines. That hairline does not define your beauty. I think this might be one of those ‘imperfections’ that one tends to hyper focus on. I have my own. Although your curls are rockin, maybe one day they’ll be gone, or a hair product is out there that might slow down hair loss, or one day you might get something similar to plugs… you are still gonna be handsome. I don’t know what sex your interested in… but only shallow people you wouldn’t want in your life would give a shit about something that from the outside perspective is minute. I don’t mean to downplay something that bothers you about your appearance, but you have so much going for you beyond your hairline. I know you seek advice, and I answered w a pep talk. I have no idea why Reddit even suggested this subreddit, maybe because I’m in r/curlyhair? Enjoy the day.",
            "author": "kgetit",
            "id": "h2jolp7",
            "parent_id": "t3_o4uwxx",
            "score": 57,
            "created_utc": 1624289685.0,
            "replies": [
                {
                    "body": "Appreciate it fella and I don’t have a clue why either !",
                    "author": "somesortageezer",
                    "id": "h2joxk4",
                    "parent_id": "t1_h2jolp7",
                    "score": 7,
                    "created_utc": 1624289835.0,
                    "replies": [
                        {
                            "body": "Just get on fin bro",
                            "author": "Botgonnelie",
                            "id": "h2jvrsx",
                            "parent_id": "t1_h2joxk4",
                            "score": 5,
                            "created_utc": 1624292917.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You’re hair is amazing dude, just my opinion though I feel a fade and leaving the top would turn you from an 8 to a 10",
            "author": "owenistaken",
            "id": "h2jo0nk",
            "parent_id": "t3_o4uwxx",
            "score": 34,
            "created_utc": 1624289417.0,
            "replies": [
                {
                    "body": "I’m deffo gonna skin the sides like I used to but the mullet has to stay for summer according to my mates haha",
                    "author": "somesortageezer",
                    "id": "h2jovzv",
                    "parent_id": "t1_h2jo0nk",
                    "score": 15,
                    "created_utc": 1624289815.0,
                    "replies": [
                        {
                            "body": "I’m gonna second your mates and say keep the mullet. Bring it back brotha!",
                            "author": null,
                            "id": "h2m2mq0",
                            "parent_id": "t1_h2jovzv",
                            "score": 4,
                            "created_utc": 1624331783.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "And you could even turn it into a man bun after getting a fade. Your hair is perfect for it",
                    "author": "owenistaken",
                    "id": "h2jo5cf",
                    "parent_id": "t1_h2jo0nk",
                    "score": -18,
                    "created_utc": 1624289475.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Rock it dudeeee",
            "author": null,
            "id": "h2jwzxb",
            "parent_id": "t3_o4uwxx",
            "score": 4,
            "created_utc": 1624293451.0,
            "replies": []
        },
        {
            "body": "Hope on finastride the first sign you see of balding..believe me",
            "author": "atif147",
            "id": "h2k7gzu",
            "parent_id": "t3_o4uwxx",
            "score": 5,
            "created_utc": 1624298054.0,
            "replies": []
        },
        {
            "body": "Not everyone has a hairline thst is straight across. I’m wondering if it’s not really receding , just a hairline some have naturally. Your hair is so thick even in the middle front, it is STELLAR hair, no sign of thinning. You might ask a dermatologist and hopefully it’s not a sign of balding. That is hair to be jealous of, I’m sure plenty are.",
            "author": "hairlover1003",
            "id": "h2kuhxi",
            "parent_id": "t3_o4uwxx",
            "score": 3,
            "created_utc": 1624308498.0,
            "replies": []
        },
        {
            "body": "Hi! If u live in a country (USA for example) where finasteride is avaliable as a means to treat hair loss, start taking them now. The earlier you start, the better results you get. Unfortunately for me, finasteride is only available to treat prostate problems, so no doctor will ever prescribe it for me for hair loss reasons, I had to find something else. Here in Hungary, sabal (saw palmetto) is available without prescription, and it targets the same hormone DHT that causes prostate problems and balding (receding hairline) (which is also the hormone that finasteride is good against). I started taking it a month ago, and I haven't experienced anything yet. The pills I take also contain pumpkin seed oil. \n\ntldr; finasteride or sabal (saw palmetto) can be used to counteract a receding hairline",
            "author": "varmtte",
            "id": "h2jyvtz",
            "parent_id": "t3_o4uwxx",
            "score": 7,
            "created_utc": 1624294270.0,
            "replies": [
                {
                    "body": "Bro I live in Hungary too and my hair is very dense and thick and always has been. Im asking you because you sound like you know 1 or 2 things in this topic, that if my dad is bald ( not bald bald he kinda looks like Jason Statham)  and I think it started for him in his 30's, that means I have the same fate? My mother on the other hand have the best hair genes someone can get. Strong, thick, dense etc. What should I do to keep my hair? Im 18 btw",
                    "author": "mivagyoken",
                    "id": "h2koxl4",
                    "parent_id": "t1_h2jyvtz",
                    "score": 1,
                    "created_utc": 1624305952.0,
                    "replies": [
                        {
                            "body": "It’s a 50/50 chance. Since you’re 18 now and with no signs of balding, just don’t worry about it at all and enjoy life. If at any point you start to notice recession or thinning, then you can think about starting finasteride. But until then, you don’t need to worry about it because you will never be able to know until it happens, and it may not happen.",
                            "author": "Illustrious_Pumpkin",
                            "id": "h2lkouw",
                            "parent_id": "t1_h2koxl4",
                            "score": 3,
                            "created_utc": 1624321778.0,
                            "replies": []
                        },
                        {
                            "body": "A long time ago I read that there are balding genes that come from your mothers father  (so if hes bald, u have a bad fater ahead of you) but then this is the case with me and im 23 with the thickest head of hair u could ever imagine. My 2 yrs younger brother has it worse tho, so in ur case it might just be luck, what genes are dominant, and how stressful your life is.",
                            "author": "varmtte",
                            "id": "h3mfyhv",
                            "parent_id": "t1_h2koxl4",
                            "score": 2,
                            "created_utc": 1625097632.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly with that hair. You can roll with anything",
            "author": "Modrixinho",
            "id": "h2k0uw1",
            "parent_id": "t3_o4uwxx",
            "score": 2,
            "created_utc": 1624295131.0,
            "replies": []
        },
        {
            "body": "You have rescession but your hair is thick.   I have been using a natural DHT blocker suppliment from Advanced Trichology you might want to try.   I also have been using DS laboratories  nanoxidil on my beard and eyebrows and it's working and you could try using it but just be aware that you need to use it for at least 5 months to see anything and it's normal to have a little shedding in the first three months.   From what I read for beards at least people who used minoxidil for at least a year an a half were able to \"teach\" there bodies to keep their hair if they stopped using it or cut back.   At least for while.   If they stopped in less than a year thier gains fell out.",
            "author": "FlowDad",
            "id": "h2kdk93",
            "parent_id": "t3_o4uwxx",
            "score": 2,
            "created_utc": 1624300781.0,
            "replies": []
        },
        {
            "body": "I have almost the same hairstyle with the same hairline, thanks for posting. It just looks like you're aging, not balding.",
            "author": "party20barty",
            "id": "h2l5bdr",
            "parent_id": "t3_o4uwxx",
            "score": 2,
            "created_utc": 1624313623.0,
            "replies": []
        },
        {
            "body": "What curl pattern is this? 3a?",
            "author": "madethison2020",
            "id": "h2jqmvj",
            "parent_id": "t3_o4uwxx",
            "score": 0,
            "created_utc": 1624290615.0,
            "replies": []
        },
        {
            "body": "Your hair rocks !! You can even get away with having longer locks, not sure if in the background is a Fez… I wouldn’t recommend the fez :)",
            "author": "Cleopatra-81",
            "id": "h2jxhgv",
            "parent_id": "t3_o4uwxx",
            "score": 1,
            "created_utc": 1624293664.0,
            "replies": [
                {
                    "body": "Thanks so much! And it’s my lamp shade 😂",
                    "author": "somesortageezer",
                    "id": "h2jxmgu",
                    "parent_id": "t1_h2jxhgv",
                    "score": 1,
                    "created_utc": 1624293724.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Looks like your caftan got knocked off in the second photo",
            "author": "SheprdCommndr",
            "id": "h2kh9bu",
            "parent_id": "t3_o4uwxx",
            "score": 1,
            "created_utc": 1624302449.0,
            "replies": []
        },
        {
            "body": "Keep it that way. It's rad!",
            "author": "Bubbysparks",
            "id": "h2l6w9q",
            "parent_id": "t3_o4uwxx",
            "score": 1,
            "created_utc": 1624314425.0,
            "replies": []
        },
        {
            "body": "If I wanted to get a cut like this what would I say",
            "author": "Enzirv",
            "id": "h2l9sj5",
            "parent_id": "t3_o4uwxx",
            "score": 1,
            "created_utc": 1624315955.0,
            "replies": []
        },
        {
            "body": "Got any pictures of yourself as a young kid? You'll probably notice you have the same hairline. I wondered if I was recessing a while back too, but it turns out I just have a pretty big forehead that was evidently visible from pictures of me with buzzed hair at like age 5, lol.",
            "author": "Tephnos",
            "id": "h2la7ig",
            "parent_id": "t3_o4uwxx",
            "score": 1,
            "created_utc": 1624316171.0,
            "replies": []
        },
        {
            "body": "Such a cool haircut.  If your hair were short I honestly think your hairline would look completely normal.  It's not receding its just your hairline,  pulling the hair back is creating an illusion more so than you probably think",
            "author": "Aaron31088",
            "id": "h2lcrg8",
            "parent_id": "t3_o4uwxx",
            "score": 1,
            "created_utc": 1624317491.0,
            "replies": []
        },
        {
            "body": "If you want to try and halt it/slow it down/reverse it, you can try finasteride. There are a few things you can do nowadays. I started receeding when I was 21, I'm 22 now and have been on finasteride for almost a year, and it's been good. Just do your research if you do end up going down that path.",
            "author": null,
            "id": "h2ljsvo",
            "parent_id": "t3_o4uwxx",
            "score": 1,
            "created_utc": 1624321294.0,
            "replies": []
        },
        {
            "body": "Your hairline looks great and your hair is awesome as well. You may very well see changes in your hairline and hair texture as you hit your mid to late 20s due to changes in hormone levels (testosterone) that occur at that point as you fully mature and your body no longer needs those levels of testosterone for development. That doesn’t look like recession to me at all but just check for changes occasionally and document with pictures in similar lighting and angles.",
            "author": "SirNelsonOfWales",
            "id": "h2lv189",
            "parent_id": "t3_o4uwxx",
            "score": 1,
            "created_utc": 1624327415.0,
            "replies": []
        },
        {
            "body": "Visit r/curlyhair",
            "author": "josef_cruz93",
            "id": "h2m3ayl",
            "parent_id": "t3_o4uwxx",
            "score": 1,
            "created_utc": 1624332188.0,
            "replies": []
        },
        {
            "body": "your starting to look like vegeta",
            "author": "Jude_idk",
            "id": "h2mm2zt",
            "parent_id": "t3_o4uwxx",
            "score": 1,
            "created_utc": 1624346204.0,
            "replies": []
        },
        {
            "body": "I mean, a receding hairline is just the result of the balance of a bunch of natural chemicals in our makeup, and it’s just genetics. Is what it is. No one should feel bad for it. That said, you have a full head of hair, plus it’s curly. So you’re winning pretty well for the most part. And even if you cut it short, a receding hairline actually looks pretty well while it’s still on the front half of your head with a nice beard too. So don’t worry, yaknow. Just embrace where you’re at. I’m sure most of us on here all have the exact same problems. My hairline around my temples are going straight too, but since my hair is growing out it’s not so noticeable and I don’t mind it. 24 here. Hope it helps anyways^ keep doing you",
            "author": "Successful-Basil-685",
            "id": "h2o3jpy",
            "parent_id": "t3_o4uwxx",
            "score": 1,
            "created_utc": 1624380493.0,
            "replies": []
        },
        {
            "body": "Keep growing it.  Everything looks fantastic.  Do not cut it.  I appreciate men with longer hair and I would say your hair looks great.  I do not see any hairline issues.  It is not thin it is not bare.  You look good!",
            "author": "castironrod-gmail",
            "id": "h4ev3r0",
            "parent_id": "t3_o4uwxx",
            "score": 1,
            "created_utc": 1625699988.0,
            "replies": []
        },
        {
            "body": "Personally for me I’ve had the same hairline as a child. Which has inconstancy’s, which isn’t perfectly square or looks like Norwood 1. My halftime looks more of a combination of both (my left temple is a little higher but my right is perfect square). So this could be an inconstancy for you. Plus having hair longer than 6 inches starts to define your hair and shows more inconsistencies in it. That aside your hair looks great bro, I would say just take some finasteride if you see any sight of recession or you can start now as long as your above 18 (because FDS and side effects it could have on you) but finasteride is good for your body overall. I take finasteride but I don’t have a receding hairline, I just take it more so for prevention. But I’m not getting any negative feedback at all from it, so I’m going to continue taking it, but that may not apply to everyone.",
            "author": "VogueEnrique",
            "id": "hny3q66",
            "parent_id": "t3_o4uwxx",
            "score": 1,
            "created_utc": 1639110169.0,
            "replies": []
        },
        {
            "body": "Hahah I appreciate that mate it’s come a long way",
            "author": "somesortageezer",
            "id": "h2jk0f4",
            "parent_id": "t1_h2jju8l",
            "score": 30,
            "created_utc": 1624287536.0,
            "replies": []
        },
        {
            "body": "I came here to say the same thing. Maybe you should be giving advice lol",
            "author": "Cleverrhymes",
            "id": "h2k5jyf",
            "parent_id": "t1_h2jju8l",
            "score": 12,
            "created_utc": 1624297202.0,
            "replies": []
        },
        {
            "body": "Appreciate it fella and I don’t have a clue why either !",
            "author": "somesortageezer",
            "id": "h2joxk4",
            "parent_id": "t1_h2jolp7",
            "score": 7,
            "created_utc": 1624289835.0,
            "replies": [
                {
                    "body": "Just get on fin bro",
                    "author": "Botgonnelie",
                    "id": "h2jvrsx",
                    "parent_id": "t1_h2joxk4",
                    "score": 5,
                    "created_utc": 1624292917.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m deffo gonna skin the sides like I used to but the mullet has to stay for summer according to my mates haha",
            "author": "somesortageezer",
            "id": "h2jovzv",
            "parent_id": "t1_h2jo0nk",
            "score": 15,
            "created_utc": 1624289815.0,
            "replies": [
                {
                    "body": "I’m gonna second your mates and say keep the mullet. Bring it back brotha!",
                    "author": null,
                    "id": "h2m2mq0",
                    "parent_id": "t1_h2jovzv",
                    "score": 4,
                    "created_utc": 1624331783.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And you could even turn it into a man bun after getting a fade. Your hair is perfect for it",
            "author": "owenistaken",
            "id": "h2jo5cf",
            "parent_id": "t1_h2jo0nk",
            "score": -18,
            "created_utc": 1624289475.0,
            "replies": []
        },
        {
            "body": "Bro I live in Hungary too and my hair is very dense and thick and always has been. Im asking you because you sound like you know 1 or 2 things in this topic, that if my dad is bald ( not bald bald he kinda looks like Jason Statham)  and I think it started for him in his 30's, that means I have the same fate? My mother on the other hand have the best hair genes someone can get. Strong, thick, dense etc. What should I do to keep my hair? Im 18 btw",
            "author": "mivagyoken",
            "id": "h2koxl4",
            "parent_id": "t1_h2jyvtz",
            "score": 1,
            "created_utc": 1624305952.0,
            "replies": [
                {
                    "body": "It’s a 50/50 chance. Since you’re 18 now and with no signs of balding, just don’t worry about it at all and enjoy life. If at any point you start to notice recession or thinning, then you can think about starting finasteride. But until then, you don’t need to worry about it because you will never be able to know until it happens, and it may not happen.",
                    "author": "Illustrious_Pumpkin",
                    "id": "h2lkouw",
                    "parent_id": "t1_h2koxl4",
                    "score": 3,
                    "created_utc": 1624321778.0,
                    "replies": []
                },
                {
                    "body": "A long time ago I read that there are balding genes that come from your mothers father  (so if hes bald, u have a bad fater ahead of you) but then this is the case with me and im 23 with the thickest head of hair u could ever imagine. My 2 yrs younger brother has it worse tho, so in ur case it might just be luck, what genes are dominant, and how stressful your life is.",
                    "author": "varmtte",
                    "id": "h3mfyhv",
                    "parent_id": "t1_h2koxl4",
                    "score": 2,
                    "created_utc": 1625097632.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks so much! And it’s my lamp shade 😂",
            "author": "somesortageezer",
            "id": "h2jxmgu",
            "parent_id": "t1_h2jxhgv",
            "score": 1,
            "created_utc": 1624293724.0,
            "replies": []
        },
        {
            "body": "Just get on fin bro",
            "author": "Botgonnelie",
            "id": "h2jvrsx",
            "parent_id": "t1_h2joxk4",
            "score": 5,
            "created_utc": 1624292917.0,
            "replies": []
        },
        {
            "body": "I’m gonna second your mates and say keep the mullet. Bring it back brotha!",
            "author": null,
            "id": "h2m2mq0",
            "parent_id": "t1_h2jovzv",
            "score": 4,
            "created_utc": 1624331783.0,
            "replies": []
        },
        {
            "body": "It’s a 50/50 chance. Since you’re 18 now and with no signs of balding, just don’t worry about it at all and enjoy life. If at any point you start to notice recession or thinning, then you can think about starting finasteride. But until then, you don’t need to worry about it because you will never be able to know until it happens, and it may not happen.",
            "author": "Illustrious_Pumpkin",
            "id": "h2lkouw",
            "parent_id": "t1_h2koxl4",
            "score": 3,
            "created_utc": 1624321778.0,
            "replies": []
        },
        {
            "body": "A long time ago I read that there are balding genes that come from your mothers father  (so if hes bald, u have a bad fater ahead of you) but then this is the case with me and im 23 with the thickest head of hair u could ever imagine. My 2 yrs younger brother has it worse tho, so in ur case it might just be luck, what genes are dominant, and how stressful your life is.",
            "author": "varmtte",
            "id": "h3mfyhv",
            "parent_id": "t1_h2koxl4",
            "score": 2,
            "created_utc": 1625097632.0,
            "replies": []
        }
    ]
}