{
    "title": "Kaguya : I created the ingredients of the beer",
    "post_id": "n31650",
    "post_url": "https://www.reddit.com/r/dankruto/comments/n31650/kaguya_i_created_the_ingredients_of_the_beer/",
    "author": "azulepearl",
    "body": "",
    "url": "https://i.redd.it/6of7zzd6qnw61.png",
    "score": 4125,
    "upvote_ratio": 0.99,
    "created_utc": 1619939460.0,
    "num_comments": 48,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Naruto: beer rasengan!!",
            "author": null,
            "id": "gwn434g",
            "parent_id": "t3_n31650",
            "score": 152,
            "created_utc": 1619949375.0,
            "replies": [
                {
                    "body": "Beerengan",
                    "author": "Anvesh221",
                    "id": "gwpcttg",
                    "parent_id": "t1_gwn434g",
                    "score": 4,
                    "created_utc": 1619985746.0,
                    "replies": []
                },
                {
                    "body": "Beedori !",
                    "author": "supare1",
                    "id": "gwqrv9x",
                    "parent_id": "t1_gwn434g",
                    "score": 3,
                    "created_utc": 1620013057.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't think killing the Uchihas was a good thing (from the storytelling perspective it had to be done becouse they are too powerful) but as a leader of a willige I would also not be confortable with a group of people whom the more they want to destroy the world the more capeble they become to do so.",
            "author": "samunagy",
            "id": "gwnjmqs",
            "parent_id": "t3_n31650",
            "score": 84,
            "created_utc": 1619958179.0,
            "replies": [
                {
                    "body": ".. Then perhaps the village leaders should have tried, idk not discriminating against the uchiha anymore and treating them with respect every citizen of a place deserves? Bc with way things in the series went its proven that most uchiha reacted like that when they were made to suffer by the shinobi world or their governments. \n\nThere was harmony between the uchiha and the leaf govt during the time obito was a genin but things started to get strained after danzo tried to blame konoha's uchiha for the nine tails attack and started to discriminate against them. Sasuke had no harsh feelings for the village till he found out that konoha's govt was responsible for the uchiha masscre. Madara was fine with his alliance with hashirama till  the uchiha started to get sidelined from government involvement \n\nMost problems with the uchiha wouldn't have occured if the government instead of trying to control or monitor the uchiha, tried to talk things out with them",
                    "author": "azulepearl",
                    "id": "gwnov0x",
                    "parent_id": "t1_gwnjmqs",
                    "score": 49,
                    "created_utc": 1619960902.0,
                    "replies": [
                        {
                            "body": "Problem started when they made the uchihas the police force and moved their territory to the outskirts. Apparently the police force couldn’t be hokage so the responsibility looked good on the surface but sucked long term. And the outskirts move started isolating them more",
                            "author": "Phenoxx",
                            "id": "gwnply2",
                            "parent_id": "t1_gwnov0x",
                            "score": 23,
                            "created_utc": 1619961279.0,
                            "replies": [
                                {
                                    "body": ">they made the uchihas the police force \n\nNo one \"made\" them the police force, they chose to accept the position because [it made them privileged and influential.](https://pbs.twimg.com/media/Eryy5JXXYAU_3ky?format=png&name=small) Some Uchiha like Shisui, Itachi, Kagami, Mikoto, etc chose to not be cops.\n\n>moved their territory to the outskirts.\n\nAnd who made that happen? Obito when he framed the Uchiha for Kyuubi's attack. He admits he had planned to destroy the clan anyways.\n\n>Apparently the police force couldn’t be hokage\n\nNo such a thing was stated in canon. Itachi and Kagami were Hokage material and were close to become one.",
                                    "author": "TyrionGoldenLion",
                                    "id": "gwnrrfr",
                                    "parent_id": "t1_gwnply2",
                                    "score": 7,
                                    "created_utc": 1619962340.0,
                                    "replies": [
                                        {
                                            "body": "Lmao you try to back shit up with source links but that link you put is shite. Itachi talking to his little kid brother ofc he’s gonna say our clan is cool only the coolest get to be the enforcers. \n\nDidn’t this uchiha clan role in the village shit happen during tobiramas time. Doubt itachi was alive then to “choose not to be cops”\n\nPretty sure the takeaway is that they couldn’t have an uchiha hokage",
                                            "author": "Phenoxx",
                                            "id": "gwntgce",
                                            "parent_id": "t1_gwnrrfr",
                                            "score": 12,
                                            "created_utc": 1619963170.0,
                                            "replies": [
                                                {
                                                    "body": ">Itachi talking to his little kid brother\n\nSo Orochimaru is somehow more reliable.\n\n>itachi was alive then to “choose not to be cops”\n\nAnd he chose not to be. He joined the ANBU.\n\n>they couldn’t have an uchiha hokage\n\nKagami Uchiha almost became Hokage over Hiruzen.\n\nAt least I bother citing canon. Unlike you who makes up bs and throws cheap insults.",
                                                    "author": "TyrionGoldenLion",
                                                    "id": "gwntr4o",
                                                    "parent_id": "t1_gwntgce",
                                                    "score": 5,
                                                    "created_utc": 1619963353.0,
                                                    "replies": [
                                                        {
                                                            "body": ">So Orochimaru is somehow more reliable.\n\nThat was clearly narrative exposition.\n\n>And he chose not to be. He joined the ANBU.\n\nItachi and Shisui were allowed to be special exceptions because of their abnormal talent. 99% of Uchiha shinobi were the police force. That doesn’t sound like much of a choice.\n\n>Kagami Uchiha almost became Hokage over Hiruzen.\n\nBut he didn’t. Almost became hokage is not became hokage.",
                                                            "author": "YesNoMan58",
                                                            "id": "gwo5s9l",
                                                            "parent_id": "t1_gwntr4o",
                                                            "score": 4,
                                                            "created_utc": 1619968767.0,
                                                            "replies": [
                                                                {
                                                                    "body": ">Itachi and Shisui were allowed to be special exceptions because of their abnormal talent\n\nFanon news. Aside from those two,  Uchiha [had great influence within ANBU forces.](https://pbs.twimg.com/media/EyWfmW0XIAAwMBt?format=jpg&name=small)\n\n>Almost became hokage is not became hokage.\n\nThe other commenter was saying Uchiha weren't allowed to be Hokage and I debunked because they clearly could.\n\n>That was clearly narrative exposition.\n\nSo is Itachi's quote and he had no reason to lie at the time, unlike Orochimaru who says nothing notable and is disputed immediately.",
                                                                    "author": "TyrionGoldenLion",
                                                                    "id": "gwo6gtg",
                                                                    "parent_id": "t1_gwo5s9l",
                                                                    "score": 1,
                                                                    "created_utc": 1619969014.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">Madara was fine with his alliance with hashirama till the uchiha started to get sidelined from government involvement \n\nNo, Madara was salty because he lost the election to Hashirama. He was bitter and wanted power.\n\n>Most problems with the uchiha wouldn't have occured\n\nGenerations of stupid Uchija [serving Zetsu](https://pbs.twimg.com/media/EyL3wFFXEAQbZlz?format=jpg&name=small), Uchiha [murdering their loved ones for power ](https://pbs.twimg.com/media/EyL3u7YWUAIzWxr?format=jpg&name=360x360), Madara warmongering, corrupting, Obito framing the clan and devastating the village, etc. None of that could be solved with talking when the morons refuse to listen.",
                            "author": "TyrionGoldenLion",
                            "id": "gwns76n",
                            "parent_id": "t1_gwnov0x",
                            "score": 4,
                            "created_utc": 1619962550.0,
                            "replies": [
                                {
                                    "body": "Bro why are you writing research thesis about a fictional clan on a meme post of another fictional series? Its fine if some people joke about this stuff no need to pull out links and sources for such random things",
                                    "author": "floral-dawns",
                                    "id": "gwnsz3g",
                                    "parent_id": "t1_gwns76n",
                                    "score": -1,
                                    "created_utc": 1619962947.0,
                                    "replies": [
                                        {
                                            "body": "Some people like lore",
                                            "author": "KinkyGCM",
                                            "id": "gwokwag",
                                            "parent_id": "t1_gwnsz3g",
                                            "score": 7,
                                            "created_utc": 1619974664.0,
                                            "replies": [
                                                {
                                                    "body": "The Uchiha stans are mad at me because I use canon to show their faves were assholes. One of them pretty much said I should stop citing the canon. Lmao",
                                                    "author": "TyrionGoldenLion",
                                                    "id": "gwouhmq",
                                                    "parent_id": "t1_gwokwag",
                                                    "score": 7,
                                                    "created_utc": 1619977995.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lmao thats a weird way to phrase \"people are telling me to stop acting like a certain group of people are genetically evil and that they are the ones to be blamed for the discrimination and genocide carried out against them\"",
                                                            "author": "azulepearl",
                                                            "id": "gwp1tjz",
                                                            "parent_id": "t1_gwouhmq",
                                                            "score": 0,
                                                            "created_utc": 1619980699.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Um, no, I never said any of that. You're pretending Uchiha did nothing wrong and I'm correcting you. I even said Uchiha were framed by Obito, meaning they didn't deserve what they got. \n\nSo don't try to put words into my mouth just because you can'tmake am argument. All your comments factually incorrect.",
                                                                    "author": "TyrionGoldenLion",
                                                                    "id": "gwp2qxy",
                                                                    "parent_id": "t1_gwp1tjz",
                                                                    "score": 6,
                                                                    "created_utc": 1619981066.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Literally the first thing u commented on this post was \"Uchiha have been trash long before Danzo. Tobirama did nothing to them.\nUchiha are just problematic.\" what other interpretation is there of it?? And for hours you've been arguing about how the uchiha were evil and fucked up and tobirama n danzo tried their best.",
                                                                            "author": "azulepearl",
                                                                            "id": "gwp3pho",
                                                                            "parent_id": "t1_gwp2qxy",
                                                                            "score": 0,
                                                                            "created_utc": 1619981437.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": ">\"Uchiha have been trash long before Danzo\n\nPlease don't act ignorant, you know I was talking the batshit ones and not every single one of them.\n\n>you've been arguing about how the uchiha were evil\n\nWell if that's how you interpret the manga panels I've linked...\n\n>danzo tried their best.\n\nI literally called Danzo scum. Lmao\n\nAnyways, I'm done with you. It's obvious you deflect any canon evidence with bs. Chill, all major Uchiha were villainous at some point and it's their job to be bad.",
                                                                                    "author": "TyrionGoldenLion",
                                                                                    "id": "gwp4g2y",
                                                                                    "parent_id": "t1_gwp3pho",
                                                                                    "score": 4,
                                                                                    "created_utc": 1619981723.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I wrote it to another \"thesis\" as you put it. Why are you bothered by my comments only?",
                                            "author": "TyrionGoldenLion",
                                            "id": "gwntczm",
                                            "parent_id": "t1_gwnsz3g",
                                            "score": 0,
                                            "created_utc": 1619963126.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Uchiha were massacred by two other Uchiha as a result of another Uchiha's long-term schemes.",
                    "author": "TyrionGoldenLion",
                    "id": "gwnk9s8",
                    "parent_id": "t1_gwnjmqs",
                    "score": 11,
                    "created_utc": 1619958527.0,
                    "replies": [
                        {
                            "body": "And two of the said Utchihas are in fact in the top 5 or top 10 strongest characters and almoast destroyed the whole world",
                            "author": "samunagy",
                            "id": "gwnlmco",
                            "parent_id": "t1_gwnk9s8",
                            "score": 10,
                            "created_utc": 1619959242.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">willige",
                    "author": null,
                    "id": "gwpkjl7",
                    "parent_id": "t1_gwnjmqs",
                    "score": 1,
                    "created_utc": 1619989572.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Madara: The beer has hashirama cells",
            "author": "NHK21506",
            "id": "gwof4ks",
            "parent_id": "t3_n31650",
            "score": 7,
            "created_utc": 1619972401.0,
            "replies": []
        },
        {
            "body": "White zetsu: beer factory",
            "author": "Magnostad",
            "id": "gwo9fws",
            "parent_id": "t3_n31650",
            "score": 8,
            "created_utc": 1619970171.0,
            "replies": []
        },
        {
            "body": "Uchiha have been trash long before Danzo. Tobirama did nothing to them.\n\nUchiha are just problematic. The only clan Zetsu was able to use. That says it all.",
            "author": "TyrionGoldenLion",
            "id": "gwna37m",
            "parent_id": "t3_n31650",
            "score": 39,
            "created_utc": 1619953265.0,
            "replies": [
                {
                    "body": "Calm down tobirama",
                    "author": "azulepearl",
                    "id": "gwnd2jx",
                    "parent_id": "t1_gwna37m",
                    "score": 85,
                    "created_utc": 1619954434.0,
                    "replies": [
                        {
                            "body": "Is he wrong? Tobirama and Madara hated each other, and anyone who was close to Madara probably hated him too. \n\nThe only thing he did was move the clan, which Orochimaru claimed upset the Uchiha but seeing as Tobirama is a very practical person his excuse of moving them to deal with prisoners makes a lot of sense (see when Hashirama wanted to give away the tailed beasts but Tobirama made the other kage pay). I can see how he didn't think of those consequences.",
                            "author": null,
                            "id": "gwnizt2",
                            "parent_id": "t1_gwnd2jx",
                            "score": 11,
                            "created_utc": 1619957845.0,
                            "replies": [
                                {
                                    "body": ">The only thing he did was move the clan\n\nAll Tobirama did was building a police station for them. He didn't move them. Danzo moved and only after Kyuubi's attack. And who orchestrated that? Obito, Madara's pawn. He got the Uchiha massacred.\n\nAll I'm saying is Uchiha apologists always try to deflect the blame from their faves with no logic or evidence. Danzo is scum but he was enabled by Uchiha characters.",
                                    "author": "TyrionGoldenLion",
                                    "id": "gwnk1a3",
                                    "parent_id": "t1_gwnizt2",
                                    "score": 14,
                                    "created_utc": 1619958401.0,
                                    "replies": [
                                        {
                                            "body": "Oh yeah, apparently he was slighting them because people don't like police. \n\nEssentially that was Orochimaru saying ACAB, he tried to free the means of Sharingan and socialised sage energy.\n\nOrochimaru is a marxist confirmed.",
                                            "author": null,
                                            "id": "gwnkxp5",
                                            "parent_id": "t1_gwnk1a3",
                                            "score": 12,
                                            "created_utc": 1619958881.0,
                                            "replies": [
                                                {
                                                    "body": "Non-Uchiha cops had no such problem. And the position canonically made them [the privileged elite.](https://pbs.twimg.com/media/Eryy5JXXYAU_3ky?format=png&name=small) So the issue are the Uchiha themselves. Even Orochimaru said such influence and power made them conceited and corrupt.",
                                                    "author": "TyrionGoldenLion",
                                                    "id": "gwnl6ko",
                                                    "parent_id": "t1_gwnkxp5",
                                                    "score": 1,
                                                    "created_utc": 1619959017.0,
                                                    "replies": [
                                                        {
                                                            "body": "Power corrupting is a universal concept. Police irl that have little oversight do whatever they want due to little repercussion for their actions. \n\nItachi could be referring to the fact that the Sharingan allows them to do police work better than others. The Sharingan can be used to detect forgeries, are effectively visual polygraphs and can get information from suspects very easily.",
                                                            "author": null,
                                                            "id": "gwnoapc",
                                                            "parent_id": "t1_gwnl6ko",
                                                            "score": 5,
                                                            "created_utc": 1619960628.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Oh yeah bc being showed to the outskirts of the village and being monitored 24/7 and being denied top gpvt positions bc of ur genes is SUCH a privilege",
                                                            "author": "azulepearl",
                                                            "id": "gwnrsl9",
                                                            "parent_id": "t1_gwnl6ko",
                                                            "score": -1,
                                                            "created_utc": 1619962355.0,
                                                            "replies": [
                                                                {
                                                                    "body": ">the outskirts of the village and being monitored 24/7 and\n\nAll that happened after Obito framed the Uchiha for Kyuubi's attack.\n\n>being denied top gpvt positions\n\nItachi and Shisui were top ANBU agents, [Uchiha were massively influential within ANBU](https://pbs.twimg.com/media/Enx36NUWEAoMsv6?format=jpg&name=small) and as stated in CANON MANGA, they were the elite and had absolute control over Shinobi law enforcement, thus most other Shinobi of the village. Every single Uchiha fighter had a top post in this village.\n\nMeanwhile most Yamanaka sold flowers, Akimichi sold food products, Nara had deers, Hyuga were isolated and powerless.\n\nYes, I can see how those poor smol Uchiha were such oppressed victims when they had it better than everyone else.",
                                                                    "author": "TyrionGoldenLion",
                                                                    "id": "gwnsonb",
                                                                    "parent_id": "t1_gwnrsl9",
                                                                    "score": 6,
                                                                    "created_utc": 1619962805.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "It's been basically stated that moving the clan/making them in charge of the police was not the only way the uchiha were discriminated against. They wrre also removed from and denied any big government positions and basically shafted. What was the point of having a police force in a shinobi village anyways? They had jonins and chunins n anbu to take care ofany threat being posed to the village from inside or outside\n\nThe uchiha police were just left with petty robberies or bar fights to deal with. Thats like making a person with tank guard a random apartment complex.Id be pissed too if the govt was utilising my mangekyo for dealing with theifs and drunkards bc they thought that id overthrow the govt if i got 10 centimeters near a govt building",
                                    "author": "azulepearl",
                                    "id": "gwnrh5j",
                                    "parent_id": "t1_gwnizt2",
                                    "score": 2,
                                    "created_utc": 1619962202.0,
                                    "replies": [
                                        {
                                            "body": ">It's been basically stated that moving the clan/making them in charge of the police was not the only way the uchiha were discriminated against. \n\nYou keep repeating that nonsense even though [it was Danzo who moved out the Uchiha and only after Kyuubi's attack.](https://pbs.twimg.com/media/Ezq_5odWQAQ84eX?format=jpg&name=900x900) and the police force was voluntary.\n\n>The uchiha police were just left with petty robberies or bar fights to deal with. \n\n[Only ones who can enforce the laws on Shinobi's crimes are superior Shinobi.](https://pbs.twimg.com/media/Eryy5JXXYAU_3ky?format=png&name=small) So you're wrong. Again.",
                                            "author": "TyrionGoldenLion",
                                            "id": "gwnt7oo",
                                            "parent_id": "t1_gwnrh5j",
                                            "score": 4,
                                            "created_utc": 1619963059.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I think the idea was that the Uchiha were supposed to be 'overseers', effectively supposed to help police other ninja. It makes sense given such a position that Tobirama or whoever was trying to stop a conflict of interest. Like when the police investigate themselves for wrongdoing. \n\nWhenever they've shown prisons in the series there are ninja there, idk where you got the idea they were dealing with bar fights. I think the ANBU took on their responsibilities after they were destroyed, every time they've shown them before the Uchiha destruction they've been doing special ops type missions.",
                                            "author": null,
                                            "id": "gwntbca",
                                            "parent_id": "t1_gwnrh5j",
                                            "score": 1,
                                            "created_utc": 1619963105.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Okay, Uchiha",
                            "author": "TyrionGoldenLion",
                            "id": "gwnd4a3",
                            "parent_id": "t1_gwnd2jx",
                            "score": 5,
                            "created_utc": 1619954465.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You really are devoted to be unreasonably annoying in every comment section. Props to your devotion I guess.",
                    "author": "HisOnlyFriend",
                    "id": "gwnfli3",
                    "parent_id": "t1_gwna37m",
                    "score": 4,
                    "created_utc": 1619955969.0,
                    "replies": [
                        {
                            "body": "For real I tagged him as “Tobirama Simp” as a joke after I saw one of his comments but he legit shows up EVERY TIME the name Uchiha gets mentioned",
                            "author": "Anything_Random",
                            "id": "gwnnkr8",
                            "parent_id": "t1_gwnfli3",
                            "score": 5,
                            "created_utc": 1619960265.0,
                            "replies": []
                        },
                        {
                            "body": "If you're annoyed by Naruto facts, that's your problem.",
                            "author": "TyrionGoldenLion",
                            "id": "gwnfpca",
                            "parent_id": "t1_gwnfli3",
                            "score": -4,
                            "created_utc": 1619956027.0,
                            "replies": [
                                {
                                    "body": "That's one hell of a statement coming from someone who spends day after day writing angry comments at Madara fans haha.",
                                    "author": "HisOnlyFriend",
                                    "id": "gwng1rm",
                                    "parent_id": "t1_gwnfpca",
                                    "score": 9,
                                    "created_utc": 1619956207.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "More like\n\nS06P:  Me and my brother created the beer\n\nKaguya: I gave you the family recipe\n\nHer clan: We made the recipe",
            "author": "IAmYoDaddyDuh",
            "id": "gwp0gl5",
            "parent_id": "t3_n31650",
            "score": 2,
            "created_utc": 1619980187.0,
            "replies": []
        },
        {
            "body": "Pretty much. Slap a synopsis tag on this",
            "author": "themiscira",
            "id": "gwpc9jg",
            "parent_id": "t3_n31650",
            "score": 0,
            "created_utc": 1619985473.0,
            "replies": []
        },
        {
            "body": "Fax yo",
            "author": "Adorable_Notice5427",
            "id": "gwpllkd",
            "parent_id": "t3_n31650",
            "score": 0,
            "created_utc": 1619990092.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gwn8igc",
            "parent_id": "t3_n31650",
            "score": -5,
            "created_utc": 1619952695.0,
            "replies": [
                {
                    "body": "Chill out dude its just a joke danzo isnt gonna pay you for sprouting anti uchiha agenda or whatever yall call it on a random meme page",
                    "author": "floral-dawns",
                    "id": "gwnehlk",
                    "parent_id": "t1_gwn8igc",
                    "score": 11,
                    "created_utc": 1619955287.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was drinking zetsu all this time?\nThat explains why my wife can control me when I'm drunk",
            "author": "Andirion",
            "id": "gwpmyx1",
            "parent_id": "t3_n31650",
            "score": 1,
            "created_utc": 1619990763.0,
            "replies": []
        },
        {
            "body": "Someone from the Uchiha clan: \"God I wish I could have beer\"",
            "author": "TempusCavus",
            "id": "gwptrf8",
            "parent_id": "t3_n31650",
            "score": 1,
            "created_utc": 1619994192.0,
            "replies": []
        },
        {
            "body": "Beerengan",
            "author": "Anvesh221",
            "id": "gwpcttg",
            "parent_id": "t1_gwn434g",
            "score": 4,
            "created_utc": 1619985746.0,
            "replies": []
        },
        {
            "body": "Beedori !",
            "author": "supare1",
            "id": "gwqrv9x",
            "parent_id": "t1_gwn434g",
            "score": 3,
            "created_utc": 1620013057.0,
            "replies": []
        },
        {
            "body": ".. Then perhaps the village leaders should have tried, idk not discriminating against the uchiha anymore and treating them with respect every citizen of a place deserves? Bc with way things in the series went its proven that most uchiha reacted like that when they were made to suffer by the shinobi world or their governments. \n\nThere was harmony between the uchiha and the leaf govt during the time obito was a genin but things started to get strained after danzo tried to blame konoha's uchiha for the nine tails attack and started to discriminate against them. Sasuke had no harsh feelings for the village till he found out that konoha's govt was responsible for the uchiha masscre. Madara was fine with his alliance with hashirama till  the uchiha started to get sidelined from government involvement \n\nMost problems with the uchiha wouldn't have occured if the government instead of trying to control or monitor the uchiha, tried to talk things out with them",
            "author": "azulepearl",
            "id": "gwnov0x",
            "parent_id": "t1_gwnjmqs",
            "score": 49,
            "created_utc": 1619960902.0,
            "replies": [
                {
                    "body": "Problem started when they made the uchihas the police force and moved their territory to the outskirts. Apparently the police force couldn’t be hokage so the responsibility looked good on the surface but sucked long term. And the outskirts move started isolating them more",
                    "author": "Phenoxx",
                    "id": "gwnply2",
                    "parent_id": "t1_gwnov0x",
                    "score": 23,
                    "created_utc": 1619961279.0,
                    "replies": [
                        {
                            "body": ">they made the uchihas the police force \n\nNo one \"made\" them the police force, they chose to accept the position because [it made them privileged and influential.](https://pbs.twimg.com/media/Eryy5JXXYAU_3ky?format=png&name=small) Some Uchiha like Shisui, Itachi, Kagami, Mikoto, etc chose to not be cops.\n\n>moved their territory to the outskirts.\n\nAnd who made that happen? Obito when he framed the Uchiha for Kyuubi's attack. He admits he had planned to destroy the clan anyways.\n\n>Apparently the police force couldn’t be hokage\n\nNo such a thing was stated in canon. Itachi and Kagami were Hokage material and were close to become one.",
                            "author": "TyrionGoldenLion",
                            "id": "gwnrrfr",
                            "parent_id": "t1_gwnply2",
                            "score": 7,
                            "created_utc": 1619962340.0,
                            "replies": [
                                {
                                    "body": "Lmao you try to back shit up with source links but that link you put is shite. Itachi talking to his little kid brother ofc he’s gonna say our clan is cool only the coolest get to be the enforcers. \n\nDidn’t this uchiha clan role in the village shit happen during tobiramas time. Doubt itachi was alive then to “choose not to be cops”\n\nPretty sure the takeaway is that they couldn’t have an uchiha hokage",
                                    "author": "Phenoxx",
                                    "id": "gwntgce",
                                    "parent_id": "t1_gwnrrfr",
                                    "score": 12,
                                    "created_utc": 1619963170.0,
                                    "replies": [
                                        {
                                            "body": ">Itachi talking to his little kid brother\n\nSo Orochimaru is somehow more reliable.\n\n>itachi was alive then to “choose not to be cops”\n\nAnd he chose not to be. He joined the ANBU.\n\n>they couldn’t have an uchiha hokage\n\nKagami Uchiha almost became Hokage over Hiruzen.\n\nAt least I bother citing canon. Unlike you who makes up bs and throws cheap insults.",
                                            "author": "TyrionGoldenLion",
                                            "id": "gwntr4o",
                                            "parent_id": "t1_gwntgce",
                                            "score": 5,
                                            "created_utc": 1619963353.0,
                                            "replies": [
                                                {
                                                    "body": ">So Orochimaru is somehow more reliable.\n\nThat was clearly narrative exposition.\n\n>And he chose not to be. He joined the ANBU.\n\nItachi and Shisui were allowed to be special exceptions because of their abnormal talent. 99% of Uchiha shinobi were the police force. That doesn’t sound like much of a choice.\n\n>Kagami Uchiha almost became Hokage over Hiruzen.\n\nBut he didn’t. Almost became hokage is not became hokage.",
                                                    "author": "YesNoMan58",
                                                    "id": "gwo5s9l",
                                                    "parent_id": "t1_gwntr4o",
                                                    "score": 4,
                                                    "created_utc": 1619968767.0,
                                                    "replies": [
                                                        {
                                                            "body": ">Itachi and Shisui were allowed to be special exceptions because of their abnormal talent\n\nFanon news. Aside from those two,  Uchiha [had great influence within ANBU forces.](https://pbs.twimg.com/media/EyWfmW0XIAAwMBt?format=jpg&name=small)\n\n>Almost became hokage is not became hokage.\n\nThe other commenter was saying Uchiha weren't allowed to be Hokage and I debunked because they clearly could.\n\n>That was clearly narrative exposition.\n\nSo is Itachi's quote and he had no reason to lie at the time, unlike Orochimaru who says nothing notable and is disputed immediately.",
                                                            "author": "TyrionGoldenLion",
                                                            "id": "gwo6gtg",
                                                            "parent_id": "t1_gwo5s9l",
                                                            "score": 1,
                                                            "created_utc": 1619969014.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">Madara was fine with his alliance with hashirama till the uchiha started to get sidelined from government involvement \n\nNo, Madara was salty because he lost the election to Hashirama. He was bitter and wanted power.\n\n>Most problems with the uchiha wouldn't have occured\n\nGenerations of stupid Uchija [serving Zetsu](https://pbs.twimg.com/media/EyL3wFFXEAQbZlz?format=jpg&name=small), Uchiha [murdering their loved ones for power ](https://pbs.twimg.com/media/EyL3u7YWUAIzWxr?format=jpg&name=360x360), Madara warmongering, corrupting, Obito framing the clan and devastating the village, etc. None of that could be solved with talking when the morons refuse to listen.",
                    "author": "TyrionGoldenLion",
                    "id": "gwns76n",
                    "parent_id": "t1_gwnov0x",
                    "score": 4,
                    "created_utc": 1619962550.0,
                    "replies": [
                        {
                            "body": "Bro why are you writing research thesis about a fictional clan on a meme post of another fictional series? Its fine if some people joke about this stuff no need to pull out links and sources for such random things",
                            "author": "floral-dawns",
                            "id": "gwnsz3g",
                            "parent_id": "t1_gwns76n",
                            "score": -1,
                            "created_utc": 1619962947.0,
                            "replies": [
                                {
                                    "body": "Some people like lore",
                                    "author": "KinkyGCM",
                                    "id": "gwokwag",
                                    "parent_id": "t1_gwnsz3g",
                                    "score": 7,
                                    "created_utc": 1619974664.0,
                                    "replies": [
                                        {
                                            "body": "The Uchiha stans are mad at me because I use canon to show their faves were assholes. One of them pretty much said I should stop citing the canon. Lmao",
                                            "author": "TyrionGoldenLion",
                                            "id": "gwouhmq",
                                            "parent_id": "t1_gwokwag",
                                            "score": 7,
                                            "created_utc": 1619977995.0,
                                            "replies": [
                                                {
                                                    "body": "Lmao thats a weird way to phrase \"people are telling me to stop acting like a certain group of people are genetically evil and that they are the ones to be blamed for the discrimination and genocide carried out against them\"",
                                                    "author": "azulepearl",
                                                    "id": "gwp1tjz",
                                                    "parent_id": "t1_gwouhmq",
                                                    "score": 0,
                                                    "created_utc": 1619980699.0,
                                                    "replies": [
                                                        {
                                                            "body": "Um, no, I never said any of that. You're pretending Uchiha did nothing wrong and I'm correcting you. I even said Uchiha were framed by Obito, meaning they didn't deserve what they got. \n\nSo don't try to put words into my mouth just because you can'tmake am argument. All your comments factually incorrect.",
                                                            "author": "TyrionGoldenLion",
                                                            "id": "gwp2qxy",
                                                            "parent_id": "t1_gwp1tjz",
                                                            "score": 6,
                                                            "created_utc": 1619981066.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Literally the first thing u commented on this post was \"Uchiha have been trash long before Danzo. Tobirama did nothing to them.\nUchiha are just problematic.\" what other interpretation is there of it?? And for hours you've been arguing about how the uchiha were evil and fucked up and tobirama n danzo tried their best.",
                                                                    "author": "azulepearl",
                                                                    "id": "gwp3pho",
                                                                    "parent_id": "t1_gwp2qxy",
                                                                    "score": 0,
                                                                    "created_utc": 1619981437.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": ">\"Uchiha have been trash long before Danzo\n\nPlease don't act ignorant, you know I was talking the batshit ones and not every single one of them.\n\n>you've been arguing about how the uchiha were evil\n\nWell if that's how you interpret the manga panels I've linked...\n\n>danzo tried their best.\n\nI literally called Danzo scum. Lmao\n\nAnyways, I'm done with you. It's obvious you deflect any canon evidence with bs. Chill, all major Uchiha were villainous at some point and it's their job to be bad.",
                                                                            "author": "TyrionGoldenLion",
                                                                            "id": "gwp4g2y",
                                                                            "parent_id": "t1_gwp3pho",
                                                                            "score": 4,
                                                                            "created_utc": 1619981723.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I wrote it to another \"thesis\" as you put it. Why are you bothered by my comments only?",
                                    "author": "TyrionGoldenLion",
                                    "id": "gwntczm",
                                    "parent_id": "t1_gwnsz3g",
                                    "score": 0,
                                    "created_utc": 1619963126.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Uchiha were massacred by two other Uchiha as a result of another Uchiha's long-term schemes.",
            "author": "TyrionGoldenLion",
            "id": "gwnk9s8",
            "parent_id": "t1_gwnjmqs",
            "score": 11,
            "created_utc": 1619958527.0,
            "replies": [
                {
                    "body": "And two of the said Utchihas are in fact in the top 5 or top 10 strongest characters and almoast destroyed the whole world",
                    "author": "samunagy",
                    "id": "gwnlmco",
                    "parent_id": "t1_gwnk9s8",
                    "score": 10,
                    "created_utc": 1619959242.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">willige",
            "author": null,
            "id": "gwpkjl7",
            "parent_id": "t1_gwnjmqs",
            "score": 1,
            "created_utc": 1619989572.0,
            "replies": []
        },
        {
            "body": "Calm down tobirama",
            "author": "azulepearl",
            "id": "gwnd2jx",
            "parent_id": "t1_gwna37m",
            "score": 85,
            "created_utc": 1619954434.0,
            "replies": [
                {
                    "body": "Is he wrong? Tobirama and Madara hated each other, and anyone who was close to Madara probably hated him too. \n\nThe only thing he did was move the clan, which Orochimaru claimed upset the Uchiha but seeing as Tobirama is a very practical person his excuse of moving them to deal with prisoners makes a lot of sense (see when Hashirama wanted to give away the tailed beasts but Tobirama made the other kage pay). I can see how he didn't think of those consequences.",
                    "author": null,
                    "id": "gwnizt2",
                    "parent_id": "t1_gwnd2jx",
                    "score": 11,
                    "created_utc": 1619957845.0,
                    "replies": [
                        {
                            "body": ">The only thing he did was move the clan\n\nAll Tobirama did was building a police station for them. He didn't move them. Danzo moved and only after Kyuubi's attack. And who orchestrated that? Obito, Madara's pawn. He got the Uchiha massacred.\n\nAll I'm saying is Uchiha apologists always try to deflect the blame from their faves with no logic or evidence. Danzo is scum but he was enabled by Uchiha characters.",
                            "author": "TyrionGoldenLion",
                            "id": "gwnk1a3",
                            "parent_id": "t1_gwnizt2",
                            "score": 14,
                            "created_utc": 1619958401.0,
                            "replies": [
                                {
                                    "body": "Oh yeah, apparently he was slighting them because people don't like police. \n\nEssentially that was Orochimaru saying ACAB, he tried to free the means of Sharingan and socialised sage energy.\n\nOrochimaru is a marxist confirmed.",
                                    "author": null,
                                    "id": "gwnkxp5",
                                    "parent_id": "t1_gwnk1a3",
                                    "score": 12,
                                    "created_utc": 1619958881.0,
                                    "replies": [
                                        {
                                            "body": "Non-Uchiha cops had no such problem. And the position canonically made them [the privileged elite.](https://pbs.twimg.com/media/Eryy5JXXYAU_3ky?format=png&name=small) So the issue are the Uchiha themselves. Even Orochimaru said such influence and power made them conceited and corrupt.",
                                            "author": "TyrionGoldenLion",
                                            "id": "gwnl6ko",
                                            "parent_id": "t1_gwnkxp5",
                                            "score": 1,
                                            "created_utc": 1619959017.0,
                                            "replies": [
                                                {
                                                    "body": "Power corrupting is a universal concept. Police irl that have little oversight do whatever they want due to little repercussion for their actions. \n\nItachi could be referring to the fact that the Sharingan allows them to do police work better than others. The Sharingan can be used to detect forgeries, are effectively visual polygraphs and can get information from suspects very easily.",
                                                    "author": null,
                                                    "id": "gwnoapc",
                                                    "parent_id": "t1_gwnl6ko",
                                                    "score": 5,
                                                    "created_utc": 1619960628.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Oh yeah bc being showed to the outskirts of the village and being monitored 24/7 and being denied top gpvt positions bc of ur genes is SUCH a privilege",
                                                    "author": "azulepearl",
                                                    "id": "gwnrsl9",
                                                    "parent_id": "t1_gwnl6ko",
                                                    "score": -1,
                                                    "created_utc": 1619962355.0,
                                                    "replies": [
                                                        {
                                                            "body": ">the outskirts of the village and being monitored 24/7 and\n\nAll that happened after Obito framed the Uchiha for Kyuubi's attack.\n\n>being denied top gpvt positions\n\nItachi and Shisui were top ANBU agents, [Uchiha were massively influential within ANBU](https://pbs.twimg.com/media/Enx36NUWEAoMsv6?format=jpg&name=small) and as stated in CANON MANGA, they were the elite and had absolute control over Shinobi law enforcement, thus most other Shinobi of the village. Every single Uchiha fighter had a top post in this village.\n\nMeanwhile most Yamanaka sold flowers, Akimichi sold food products, Nara had deers, Hyuga were isolated and powerless.\n\nYes, I can see how those poor smol Uchiha were such oppressed victims when they had it better than everyone else.",
                                                            "author": "TyrionGoldenLion",
                                                            "id": "gwnsonb",
                                                            "parent_id": "t1_gwnrsl9",
                                                            "score": 6,
                                                            "created_utc": 1619962805.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "It's been basically stated that moving the clan/making them in charge of the police was not the only way the uchiha were discriminated against. They wrre also removed from and denied any big government positions and basically shafted. What was the point of having a police force in a shinobi village anyways? They had jonins and chunins n anbu to take care ofany threat being posed to the village from inside or outside\n\nThe uchiha police were just left with petty robberies or bar fights to deal with. Thats like making a person with tank guard a random apartment complex.Id be pissed too if the govt was utilising my mangekyo for dealing with theifs and drunkards bc they thought that id overthrow the govt if i got 10 centimeters near a govt building",
                            "author": "azulepearl",
                            "id": "gwnrh5j",
                            "parent_id": "t1_gwnizt2",
                            "score": 2,
                            "created_utc": 1619962202.0,
                            "replies": [
                                {
                                    "body": ">It's been basically stated that moving the clan/making them in charge of the police was not the only way the uchiha were discriminated against. \n\nYou keep repeating that nonsense even though [it was Danzo who moved out the Uchiha and only after Kyuubi's attack.](https://pbs.twimg.com/media/Ezq_5odWQAQ84eX?format=jpg&name=900x900) and the police force was voluntary.\n\n>The uchiha police were just left with petty robberies or bar fights to deal with. \n\n[Only ones who can enforce the laws on Shinobi's crimes are superior Shinobi.](https://pbs.twimg.com/media/Eryy5JXXYAU_3ky?format=png&name=small) So you're wrong. Again.",
                                    "author": "TyrionGoldenLion",
                                    "id": "gwnt7oo",
                                    "parent_id": "t1_gwnrh5j",
                                    "score": 4,
                                    "created_utc": 1619963059.0,
                                    "replies": []
                                },
                                {
                                    "body": "I think the idea was that the Uchiha were supposed to be 'overseers', effectively supposed to help police other ninja. It makes sense given such a position that Tobirama or whoever was trying to stop a conflict of interest. Like when the police investigate themselves for wrongdoing. \n\nWhenever they've shown prisons in the series there are ninja there, idk where you got the idea they were dealing with bar fights. I think the ANBU took on their responsibilities after they were destroyed, every time they've shown them before the Uchiha destruction they've been doing special ops type missions.",
                                    "author": null,
                                    "id": "gwntbca",
                                    "parent_id": "t1_gwnrh5j",
                                    "score": 1,
                                    "created_utc": 1619963105.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Okay, Uchiha",
                    "author": "TyrionGoldenLion",
                    "id": "gwnd4a3",
                    "parent_id": "t1_gwnd2jx",
                    "score": 5,
                    "created_utc": 1619954465.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You really are devoted to be unreasonably annoying in every comment section. Props to your devotion I guess.",
            "author": "HisOnlyFriend",
            "id": "gwnfli3",
            "parent_id": "t1_gwna37m",
            "score": 4,
            "created_utc": 1619955969.0,
            "replies": [
                {
                    "body": "For real I tagged him as “Tobirama Simp” as a joke after I saw one of his comments but he legit shows up EVERY TIME the name Uchiha gets mentioned",
                    "author": "Anything_Random",
                    "id": "gwnnkr8",
                    "parent_id": "t1_gwnfli3",
                    "score": 5,
                    "created_utc": 1619960265.0,
                    "replies": []
                },
                {
                    "body": "If you're annoyed by Naruto facts, that's your problem.",
                    "author": "TyrionGoldenLion",
                    "id": "gwnfpca",
                    "parent_id": "t1_gwnfli3",
                    "score": -4,
                    "created_utc": 1619956027.0,
                    "replies": [
                        {
                            "body": "That's one hell of a statement coming from someone who spends day after day writing angry comments at Madara fans haha.",
                            "author": "HisOnlyFriend",
                            "id": "gwng1rm",
                            "parent_id": "t1_gwnfpca",
                            "score": 9,
                            "created_utc": 1619956207.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Chill out dude its just a joke danzo isnt gonna pay you for sprouting anti uchiha agenda or whatever yall call it on a random meme page",
            "author": "floral-dawns",
            "id": "gwnehlk",
            "parent_id": "t1_gwn8igc",
            "score": 11,
            "created_utc": 1619955287.0,
            "replies": []
        },
        {
            "body": "Problem started when they made the uchihas the police force and moved their territory to the outskirts. Apparently the police force couldn’t be hokage so the responsibility looked good on the surface but sucked long term. And the outskirts move started isolating them more",
            "author": "Phenoxx",
            "id": "gwnply2",
            "parent_id": "t1_gwnov0x",
            "score": 23,
            "created_utc": 1619961279.0,
            "replies": [
                {
                    "body": ">they made the uchihas the police force \n\nNo one \"made\" them the police force, they chose to accept the position because [it made them privileged and influential.](https://pbs.twimg.com/media/Eryy5JXXYAU_3ky?format=png&name=small) Some Uchiha like Shisui, Itachi, Kagami, Mikoto, etc chose to not be cops.\n\n>moved their territory to the outskirts.\n\nAnd who made that happen? Obito when he framed the Uchiha for Kyuubi's attack. He admits he had planned to destroy the clan anyways.\n\n>Apparently the police force couldn’t be hokage\n\nNo such a thing was stated in canon. Itachi and Kagami were Hokage material and were close to become one.",
                    "author": "TyrionGoldenLion",
                    "id": "gwnrrfr",
                    "parent_id": "t1_gwnply2",
                    "score": 7,
                    "created_utc": 1619962340.0,
                    "replies": [
                        {
                            "body": "Lmao you try to back shit up with source links but that link you put is shite. Itachi talking to his little kid brother ofc he’s gonna say our clan is cool only the coolest get to be the enforcers. \n\nDidn’t this uchiha clan role in the village shit happen during tobiramas time. Doubt itachi was alive then to “choose not to be cops”\n\nPretty sure the takeaway is that they couldn’t have an uchiha hokage",
                            "author": "Phenoxx",
                            "id": "gwntgce",
                            "parent_id": "t1_gwnrrfr",
                            "score": 12,
                            "created_utc": 1619963170.0,
                            "replies": [
                                {
                                    "body": ">Itachi talking to his little kid brother\n\nSo Orochimaru is somehow more reliable.\n\n>itachi was alive then to “choose not to be cops”\n\nAnd he chose not to be. He joined the ANBU.\n\n>they couldn’t have an uchiha hokage\n\nKagami Uchiha almost became Hokage over Hiruzen.\n\nAt least I bother citing canon. Unlike you who makes up bs and throws cheap insults.",
                                    "author": "TyrionGoldenLion",
                                    "id": "gwntr4o",
                                    "parent_id": "t1_gwntgce",
                                    "score": 5,
                                    "created_utc": 1619963353.0,
                                    "replies": [
                                        {
                                            "body": ">So Orochimaru is somehow more reliable.\n\nThat was clearly narrative exposition.\n\n>And he chose not to be. He joined the ANBU.\n\nItachi and Shisui were allowed to be special exceptions because of their abnormal talent. 99% of Uchiha shinobi were the police force. That doesn’t sound like much of a choice.\n\n>Kagami Uchiha almost became Hokage over Hiruzen.\n\nBut he didn’t. Almost became hokage is not became hokage.",
                                            "author": "YesNoMan58",
                                            "id": "gwo5s9l",
                                            "parent_id": "t1_gwntr4o",
                                            "score": 4,
                                            "created_utc": 1619968767.0,
                                            "replies": [
                                                {
                                                    "body": ">Itachi and Shisui were allowed to be special exceptions because of their abnormal talent\n\nFanon news. Aside from those two,  Uchiha [had great influence within ANBU forces.](https://pbs.twimg.com/media/EyWfmW0XIAAwMBt?format=jpg&name=small)\n\n>Almost became hokage is not became hokage.\n\nThe other commenter was saying Uchiha weren't allowed to be Hokage and I debunked because they clearly could.\n\n>That was clearly narrative exposition.\n\nSo is Itachi's quote and he had no reason to lie at the time, unlike Orochimaru who says nothing notable and is disputed immediately.",
                                                    "author": "TyrionGoldenLion",
                                                    "id": "gwo6gtg",
                                                    "parent_id": "t1_gwo5s9l",
                                                    "score": 1,
                                                    "created_utc": 1619969014.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Madara was fine with his alliance with hashirama till the uchiha started to get sidelined from government involvement \n\nNo, Madara was salty because he lost the election to Hashirama. He was bitter and wanted power.\n\n>Most problems with the uchiha wouldn't have occured\n\nGenerations of stupid Uchija [serving Zetsu](https://pbs.twimg.com/media/EyL3wFFXEAQbZlz?format=jpg&name=small), Uchiha [murdering their loved ones for power ](https://pbs.twimg.com/media/EyL3u7YWUAIzWxr?format=jpg&name=360x360), Madara warmongering, corrupting, Obito framing the clan and devastating the village, etc. None of that could be solved with talking when the morons refuse to listen.",
            "author": "TyrionGoldenLion",
            "id": "gwns76n",
            "parent_id": "t1_gwnov0x",
            "score": 4,
            "created_utc": 1619962550.0,
            "replies": [
                {
                    "body": "Bro why are you writing research thesis about a fictional clan on a meme post of another fictional series? Its fine if some people joke about this stuff no need to pull out links and sources for such random things",
                    "author": "floral-dawns",
                    "id": "gwnsz3g",
                    "parent_id": "t1_gwns76n",
                    "score": -1,
                    "created_utc": 1619962947.0,
                    "replies": [
                        {
                            "body": "Some people like lore",
                            "author": "KinkyGCM",
                            "id": "gwokwag",
                            "parent_id": "t1_gwnsz3g",
                            "score": 7,
                            "created_utc": 1619974664.0,
                            "replies": [
                                {
                                    "body": "The Uchiha stans are mad at me because I use canon to show their faves were assholes. One of them pretty much said I should stop citing the canon. Lmao",
                                    "author": "TyrionGoldenLion",
                                    "id": "gwouhmq",
                                    "parent_id": "t1_gwokwag",
                                    "score": 7,
                                    "created_utc": 1619977995.0,
                                    "replies": [
                                        {
                                            "body": "Lmao thats a weird way to phrase \"people are telling me to stop acting like a certain group of people are genetically evil and that they are the ones to be blamed for the discrimination and genocide carried out against them\"",
                                            "author": "azulepearl",
                                            "id": "gwp1tjz",
                                            "parent_id": "t1_gwouhmq",
                                            "score": 0,
                                            "created_utc": 1619980699.0,
                                            "replies": [
                                                {
                                                    "body": "Um, no, I never said any of that. You're pretending Uchiha did nothing wrong and I'm correcting you. I even said Uchiha were framed by Obito, meaning they didn't deserve what they got. \n\nSo don't try to put words into my mouth just because you can'tmake am argument. All your comments factually incorrect.",
                                                    "author": "TyrionGoldenLion",
                                                    "id": "gwp2qxy",
                                                    "parent_id": "t1_gwp1tjz",
                                                    "score": 6,
                                                    "created_utc": 1619981066.0,
                                                    "replies": [
                                                        {
                                                            "body": "Literally the first thing u commented on this post was \"Uchiha have been trash long before Danzo. Tobirama did nothing to them.\nUchiha are just problematic.\" what other interpretation is there of it?? And for hours you've been arguing about how the uchiha were evil and fucked up and tobirama n danzo tried their best.",
                                                            "author": "azulepearl",
                                                            "id": "gwp3pho",
                                                            "parent_id": "t1_gwp2qxy",
                                                            "score": 0,
                                                            "created_utc": 1619981437.0,
                                                            "replies": [
                                                                {
                                                                    "body": ">\"Uchiha have been trash long before Danzo\n\nPlease don't act ignorant, you know I was talking the batshit ones and not every single one of them.\n\n>you've been arguing about how the uchiha were evil\n\nWell if that's how you interpret the manga panels I've linked...\n\n>danzo tried their best.\n\nI literally called Danzo scum. Lmao\n\nAnyways, I'm done with you. It's obvious you deflect any canon evidence with bs. Chill, all major Uchiha were villainous at some point and it's their job to be bad.",
                                                                    "author": "TyrionGoldenLion",
                                                                    "id": "gwp4g2y",
                                                                    "parent_id": "t1_gwp3pho",
                                                                    "score": 4,
                                                                    "created_utc": 1619981723.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I wrote it to another \"thesis\" as you put it. Why are you bothered by my comments only?",
                            "author": "TyrionGoldenLion",
                            "id": "gwntczm",
                            "parent_id": "t1_gwnsz3g",
                            "score": 0,
                            "created_utc": 1619963126.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And two of the said Utchihas are in fact in the top 5 or top 10 strongest characters and almoast destroyed the whole world",
            "author": "samunagy",
            "id": "gwnlmco",
            "parent_id": "t1_gwnk9s8",
            "score": 10,
            "created_utc": 1619959242.0,
            "replies": []
        },
        {
            "body": "Is he wrong? Tobirama and Madara hated each other, and anyone who was close to Madara probably hated him too. \n\nThe only thing he did was move the clan, which Orochimaru claimed upset the Uchiha but seeing as Tobirama is a very practical person his excuse of moving them to deal with prisoners makes a lot of sense (see when Hashirama wanted to give away the tailed beasts but Tobirama made the other kage pay). I can see how he didn't think of those consequences.",
            "author": null,
            "id": "gwnizt2",
            "parent_id": "t1_gwnd2jx",
            "score": 11,
            "created_utc": 1619957845.0,
            "replies": [
                {
                    "body": ">The only thing he did was move the clan\n\nAll Tobirama did was building a police station for them. He didn't move them. Danzo moved and only after Kyuubi's attack. And who orchestrated that? Obito, Madara's pawn. He got the Uchiha massacred.\n\nAll I'm saying is Uchiha apologists always try to deflect the blame from their faves with no logic or evidence. Danzo is scum but he was enabled by Uchiha characters.",
                    "author": "TyrionGoldenLion",
                    "id": "gwnk1a3",
                    "parent_id": "t1_gwnizt2",
                    "score": 14,
                    "created_utc": 1619958401.0,
                    "replies": [
                        {
                            "body": "Oh yeah, apparently he was slighting them because people don't like police. \n\nEssentially that was Orochimaru saying ACAB, he tried to free the means of Sharingan and socialised sage energy.\n\nOrochimaru is a marxist confirmed.",
                            "author": null,
                            "id": "gwnkxp5",
                            "parent_id": "t1_gwnk1a3",
                            "score": 12,
                            "created_utc": 1619958881.0,
                            "replies": [
                                {
                                    "body": "Non-Uchiha cops had no such problem. And the position canonically made them [the privileged elite.](https://pbs.twimg.com/media/Eryy5JXXYAU_3ky?format=png&name=small) So the issue are the Uchiha themselves. Even Orochimaru said such influence and power made them conceited and corrupt.",
                                    "author": "TyrionGoldenLion",
                                    "id": "gwnl6ko",
                                    "parent_id": "t1_gwnkxp5",
                                    "score": 1,
                                    "created_utc": 1619959017.0,
                                    "replies": [
                                        {
                                            "body": "Power corrupting is a universal concept. Police irl that have little oversight do whatever they want due to little repercussion for their actions. \n\nItachi could be referring to the fact that the Sharingan allows them to do police work better than others. The Sharingan can be used to detect forgeries, are effectively visual polygraphs and can get information from suspects very easily.",
                                            "author": null,
                                            "id": "gwnoapc",
                                            "parent_id": "t1_gwnl6ko",
                                            "score": 5,
                                            "created_utc": 1619960628.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Oh yeah bc being showed to the outskirts of the village and being monitored 24/7 and being denied top gpvt positions bc of ur genes is SUCH a privilege",
                                            "author": "azulepearl",
                                            "id": "gwnrsl9",
                                            "parent_id": "t1_gwnl6ko",
                                            "score": -1,
                                            "created_utc": 1619962355.0,
                                            "replies": [
                                                {
                                                    "body": ">the outskirts of the village and being monitored 24/7 and\n\nAll that happened after Obito framed the Uchiha for Kyuubi's attack.\n\n>being denied top gpvt positions\n\nItachi and Shisui were top ANBU agents, [Uchiha were massively influential within ANBU](https://pbs.twimg.com/media/Enx36NUWEAoMsv6?format=jpg&name=small) and as stated in CANON MANGA, they were the elite and had absolute control over Shinobi law enforcement, thus most other Shinobi of the village. Every single Uchiha fighter had a top post in this village.\n\nMeanwhile most Yamanaka sold flowers, Akimichi sold food products, Nara had deers, Hyuga were isolated and powerless.\n\nYes, I can see how those poor smol Uchiha were such oppressed victims when they had it better than everyone else.",
                                                    "author": "TyrionGoldenLion",
                                                    "id": "gwnsonb",
                                                    "parent_id": "t1_gwnrsl9",
                                                    "score": 6,
                                                    "created_utc": 1619962805.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It's been basically stated that moving the clan/making them in charge of the police was not the only way the uchiha were discriminated against. They wrre also removed from and denied any big government positions and basically shafted. What was the point of having a police force in a shinobi village anyways? They had jonins and chunins n anbu to take care ofany threat being posed to the village from inside or outside\n\nThe uchiha police were just left with petty robberies or bar fights to deal with. Thats like making a person with tank guard a random apartment complex.Id be pissed too if the govt was utilising my mangekyo for dealing with theifs and drunkards bc they thought that id overthrow the govt if i got 10 centimeters near a govt building",
                    "author": "azulepearl",
                    "id": "gwnrh5j",
                    "parent_id": "t1_gwnizt2",
                    "score": 2,
                    "created_utc": 1619962202.0,
                    "replies": [
                        {
                            "body": ">It's been basically stated that moving the clan/making them in charge of the police was not the only way the uchiha were discriminated against. \n\nYou keep repeating that nonsense even though [it was Danzo who moved out the Uchiha and only after Kyuubi's attack.](https://pbs.twimg.com/media/Ezq_5odWQAQ84eX?format=jpg&name=900x900) and the police force was voluntary.\n\n>The uchiha police were just left with petty robberies or bar fights to deal with. \n\n[Only ones who can enforce the laws on Shinobi's crimes are superior Shinobi.](https://pbs.twimg.com/media/Eryy5JXXYAU_3ky?format=png&name=small) So you're wrong. Again.",
                            "author": "TyrionGoldenLion",
                            "id": "gwnt7oo",
                            "parent_id": "t1_gwnrh5j",
                            "score": 4,
                            "created_utc": 1619963059.0,
                            "replies": []
                        },
                        {
                            "body": "I think the idea was that the Uchiha were supposed to be 'overseers', effectively supposed to help police other ninja. It makes sense given such a position that Tobirama or whoever was trying to stop a conflict of interest. Like when the police investigate themselves for wrongdoing. \n\nWhenever they've shown prisons in the series there are ninja there, idk where you got the idea they were dealing with bar fights. I think the ANBU took on their responsibilities after they were destroyed, every time they've shown them before the Uchiha destruction they've been doing special ops type missions.",
                            "author": null,
                            "id": "gwntbca",
                            "parent_id": "t1_gwnrh5j",
                            "score": 1,
                            "created_utc": 1619963105.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Okay, Uchiha",
            "author": "TyrionGoldenLion",
            "id": "gwnd4a3",
            "parent_id": "t1_gwnd2jx",
            "score": 5,
            "created_utc": 1619954465.0,
            "replies": []
        },
        {
            "body": "For real I tagged him as “Tobirama Simp” as a joke after I saw one of his comments but he legit shows up EVERY TIME the name Uchiha gets mentioned",
            "author": "Anything_Random",
            "id": "gwnnkr8",
            "parent_id": "t1_gwnfli3",
            "score": 5,
            "created_utc": 1619960265.0,
            "replies": []
        },
        {
            "body": "If you're annoyed by Naruto facts, that's your problem.",
            "author": "TyrionGoldenLion",
            "id": "gwnfpca",
            "parent_id": "t1_gwnfli3",
            "score": -4,
            "created_utc": 1619956027.0,
            "replies": [
                {
                    "body": "That's one hell of a statement coming from someone who spends day after day writing angry comments at Madara fans haha.",
                    "author": "HisOnlyFriend",
                    "id": "gwng1rm",
                    "parent_id": "t1_gwnfpca",
                    "score": 9,
                    "created_utc": 1619956207.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">they made the uchihas the police force \n\nNo one \"made\" them the police force, they chose to accept the position because [it made them privileged and influential.](https://pbs.twimg.com/media/Eryy5JXXYAU_3ky?format=png&name=small) Some Uchiha like Shisui, Itachi, Kagami, Mikoto, etc chose to not be cops.\n\n>moved their territory to the outskirts.\n\nAnd who made that happen? Obito when he framed the Uchiha for Kyuubi's attack. He admits he had planned to destroy the clan anyways.\n\n>Apparently the police force couldn’t be hokage\n\nNo such a thing was stated in canon. Itachi and Kagami were Hokage material and were close to become one.",
            "author": "TyrionGoldenLion",
            "id": "gwnrrfr",
            "parent_id": "t1_gwnply2",
            "score": 7,
            "created_utc": 1619962340.0,
            "replies": [
                {
                    "body": "Lmao you try to back shit up with source links but that link you put is shite. Itachi talking to his little kid brother ofc he’s gonna say our clan is cool only the coolest get to be the enforcers. \n\nDidn’t this uchiha clan role in the village shit happen during tobiramas time. Doubt itachi was alive then to “choose not to be cops”\n\nPretty sure the takeaway is that they couldn’t have an uchiha hokage",
                    "author": "Phenoxx",
                    "id": "gwntgce",
                    "parent_id": "t1_gwnrrfr",
                    "score": 12,
                    "created_utc": 1619963170.0,
                    "replies": [
                        {
                            "body": ">Itachi talking to his little kid brother\n\nSo Orochimaru is somehow more reliable.\n\n>itachi was alive then to “choose not to be cops”\n\nAnd he chose not to be. He joined the ANBU.\n\n>they couldn’t have an uchiha hokage\n\nKagami Uchiha almost became Hokage over Hiruzen.\n\nAt least I bother citing canon. Unlike you who makes up bs and throws cheap insults.",
                            "author": "TyrionGoldenLion",
                            "id": "gwntr4o",
                            "parent_id": "t1_gwntgce",
                            "score": 5,
                            "created_utc": 1619963353.0,
                            "replies": [
                                {
                                    "body": ">So Orochimaru is somehow more reliable.\n\nThat was clearly narrative exposition.\n\n>And he chose not to be. He joined the ANBU.\n\nItachi and Shisui were allowed to be special exceptions because of their abnormal talent. 99% of Uchiha shinobi were the police force. That doesn’t sound like much of a choice.\n\n>Kagami Uchiha almost became Hokage over Hiruzen.\n\nBut he didn’t. Almost became hokage is not became hokage.",
                                    "author": "YesNoMan58",
                                    "id": "gwo5s9l",
                                    "parent_id": "t1_gwntr4o",
                                    "score": 4,
                                    "created_utc": 1619968767.0,
                                    "replies": [
                                        {
                                            "body": ">Itachi and Shisui were allowed to be special exceptions because of their abnormal talent\n\nFanon news. Aside from those two,  Uchiha [had great influence within ANBU forces.](https://pbs.twimg.com/media/EyWfmW0XIAAwMBt?format=jpg&name=small)\n\n>Almost became hokage is not became hokage.\n\nThe other commenter was saying Uchiha weren't allowed to be Hokage and I debunked because they clearly could.\n\n>That was clearly narrative exposition.\n\nSo is Itachi's quote and he had no reason to lie at the time, unlike Orochimaru who says nothing notable and is disputed immediately.",
                                            "author": "TyrionGoldenLion",
                                            "id": "gwo6gtg",
                                            "parent_id": "t1_gwo5s9l",
                                            "score": 1,
                                            "created_utc": 1619969014.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bro why are you writing research thesis about a fictional clan on a meme post of another fictional series? Its fine if some people joke about this stuff no need to pull out links and sources for such random things",
            "author": "floral-dawns",
            "id": "gwnsz3g",
            "parent_id": "t1_gwns76n",
            "score": -1,
            "created_utc": 1619962947.0,
            "replies": [
                {
                    "body": "Some people like lore",
                    "author": "KinkyGCM",
                    "id": "gwokwag",
                    "parent_id": "t1_gwnsz3g",
                    "score": 7,
                    "created_utc": 1619974664.0,
                    "replies": [
                        {
                            "body": "The Uchiha stans are mad at me because I use canon to show their faves were assholes. One of them pretty much said I should stop citing the canon. Lmao",
                            "author": "TyrionGoldenLion",
                            "id": "gwouhmq",
                            "parent_id": "t1_gwokwag",
                            "score": 7,
                            "created_utc": 1619977995.0,
                            "replies": [
                                {
                                    "body": "Lmao thats a weird way to phrase \"people are telling me to stop acting like a certain group of people are genetically evil and that they are the ones to be blamed for the discrimination and genocide carried out against them\"",
                                    "author": "azulepearl",
                                    "id": "gwp1tjz",
                                    "parent_id": "t1_gwouhmq",
                                    "score": 0,
                                    "created_utc": 1619980699.0,
                                    "replies": [
                                        {
                                            "body": "Um, no, I never said any of that. You're pretending Uchiha did nothing wrong and I'm correcting you. I even said Uchiha were framed by Obito, meaning they didn't deserve what they got. \n\nSo don't try to put words into my mouth just because you can'tmake am argument. All your comments factually incorrect.",
                                            "author": "TyrionGoldenLion",
                                            "id": "gwp2qxy",
                                            "parent_id": "t1_gwp1tjz",
                                            "score": 6,
                                            "created_utc": 1619981066.0,
                                            "replies": [
                                                {
                                                    "body": "Literally the first thing u commented on this post was \"Uchiha have been trash long before Danzo. Tobirama did nothing to them.\nUchiha are just problematic.\" what other interpretation is there of it?? And for hours you've been arguing about how the uchiha were evil and fucked up and tobirama n danzo tried their best.",
                                                    "author": "azulepearl",
                                                    "id": "gwp3pho",
                                                    "parent_id": "t1_gwp2qxy",
                                                    "score": 0,
                                                    "created_utc": 1619981437.0,
                                                    "replies": [
                                                        {
                                                            "body": ">\"Uchiha have been trash long before Danzo\n\nPlease don't act ignorant, you know I was talking the batshit ones and not every single one of them.\n\n>you've been arguing about how the uchiha were evil\n\nWell if that's how you interpret the manga panels I've linked...\n\n>danzo tried their best.\n\nI literally called Danzo scum. Lmao\n\nAnyways, I'm done with you. It's obvious you deflect any canon evidence with bs. Chill, all major Uchiha were villainous at some point and it's their job to be bad.",
                                                            "author": "TyrionGoldenLion",
                                                            "id": "gwp4g2y",
                                                            "parent_id": "t1_gwp3pho",
                                                            "score": 4,
                                                            "created_utc": 1619981723.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I wrote it to another \"thesis\" as you put it. Why are you bothered by my comments only?",
                    "author": "TyrionGoldenLion",
                    "id": "gwntczm",
                    "parent_id": "t1_gwnsz3g",
                    "score": 0,
                    "created_utc": 1619963126.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">The only thing he did was move the clan\n\nAll Tobirama did was building a police station for them. He didn't move them. Danzo moved and only after Kyuubi's attack. And who orchestrated that? Obito, Madara's pawn. He got the Uchiha massacred.\n\nAll I'm saying is Uchiha apologists always try to deflect the blame from their faves with no logic or evidence. Danzo is scum but he was enabled by Uchiha characters.",
            "author": "TyrionGoldenLion",
            "id": "gwnk1a3",
            "parent_id": "t1_gwnizt2",
            "score": 14,
            "created_utc": 1619958401.0,
            "replies": [
                {
                    "body": "Oh yeah, apparently he was slighting them because people don't like police. \n\nEssentially that was Orochimaru saying ACAB, he tried to free the means of Sharingan and socialised sage energy.\n\nOrochimaru is a marxist confirmed.",
                    "author": null,
                    "id": "gwnkxp5",
                    "parent_id": "t1_gwnk1a3",
                    "score": 12,
                    "created_utc": 1619958881.0,
                    "replies": [
                        {
                            "body": "Non-Uchiha cops had no such problem. And the position canonically made them [the privileged elite.](https://pbs.twimg.com/media/Eryy5JXXYAU_3ky?format=png&name=small) So the issue are the Uchiha themselves. Even Orochimaru said such influence and power made them conceited and corrupt.",
                            "author": "TyrionGoldenLion",
                            "id": "gwnl6ko",
                            "parent_id": "t1_gwnkxp5",
                            "score": 1,
                            "created_utc": 1619959017.0,
                            "replies": [
                                {
                                    "body": "Power corrupting is a universal concept. Police irl that have little oversight do whatever they want due to little repercussion for their actions. \n\nItachi could be referring to the fact that the Sharingan allows them to do police work better than others. The Sharingan can be used to detect forgeries, are effectively visual polygraphs and can get information from suspects very easily.",
                                    "author": null,
                                    "id": "gwnoapc",
                                    "parent_id": "t1_gwnl6ko",
                                    "score": 5,
                                    "created_utc": 1619960628.0,
                                    "replies": []
                                },
                                {
                                    "body": "Oh yeah bc being showed to the outskirts of the village and being monitored 24/7 and being denied top gpvt positions bc of ur genes is SUCH a privilege",
                                    "author": "azulepearl",
                                    "id": "gwnrsl9",
                                    "parent_id": "t1_gwnl6ko",
                                    "score": -1,
                                    "created_utc": 1619962355.0,
                                    "replies": [
                                        {
                                            "body": ">the outskirts of the village and being monitored 24/7 and\n\nAll that happened after Obito framed the Uchiha for Kyuubi's attack.\n\n>being denied top gpvt positions\n\nItachi and Shisui were top ANBU agents, [Uchiha were massively influential within ANBU](https://pbs.twimg.com/media/Enx36NUWEAoMsv6?format=jpg&name=small) and as stated in CANON MANGA, they were the elite and had absolute control over Shinobi law enforcement, thus most other Shinobi of the village. Every single Uchiha fighter had a top post in this village.\n\nMeanwhile most Yamanaka sold flowers, Akimichi sold food products, Nara had deers, Hyuga were isolated and powerless.\n\nYes, I can see how those poor smol Uchiha were such oppressed victims when they had it better than everyone else.",
                                            "author": "TyrionGoldenLion",
                                            "id": "gwnsonb",
                                            "parent_id": "t1_gwnrsl9",
                                            "score": 6,
                                            "created_utc": 1619962805.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's been basically stated that moving the clan/making them in charge of the police was not the only way the uchiha were discriminated against. They wrre also removed from and denied any big government positions and basically shafted. What was the point of having a police force in a shinobi village anyways? They had jonins and chunins n anbu to take care ofany threat being posed to the village from inside or outside\n\nThe uchiha police were just left with petty robberies or bar fights to deal with. Thats like making a person with tank guard a random apartment complex.Id be pissed too if the govt was utilising my mangekyo for dealing with theifs and drunkards bc they thought that id overthrow the govt if i got 10 centimeters near a govt building",
            "author": "azulepearl",
            "id": "gwnrh5j",
            "parent_id": "t1_gwnizt2",
            "score": 2,
            "created_utc": 1619962202.0,
            "replies": [
                {
                    "body": ">It's been basically stated that moving the clan/making them in charge of the police was not the only way the uchiha were discriminated against. \n\nYou keep repeating that nonsense even though [it was Danzo who moved out the Uchiha and only after Kyuubi's attack.](https://pbs.twimg.com/media/Ezq_5odWQAQ84eX?format=jpg&name=900x900) and the police force was voluntary.\n\n>The uchiha police were just left with petty robberies or bar fights to deal with. \n\n[Only ones who can enforce the laws on Shinobi's crimes are superior Shinobi.](https://pbs.twimg.com/media/Eryy5JXXYAU_3ky?format=png&name=small) So you're wrong. Again.",
                    "author": "TyrionGoldenLion",
                    "id": "gwnt7oo",
                    "parent_id": "t1_gwnrh5j",
                    "score": 4,
                    "created_utc": 1619963059.0,
                    "replies": []
                },
                {
                    "body": "I think the idea was that the Uchiha were supposed to be 'overseers', effectively supposed to help police other ninja. It makes sense given such a position that Tobirama or whoever was trying to stop a conflict of interest. Like when the police investigate themselves for wrongdoing. \n\nWhenever they've shown prisons in the series there are ninja there, idk where you got the idea they were dealing with bar fights. I think the ANBU took on their responsibilities after they were destroyed, every time they've shown them before the Uchiha destruction they've been doing special ops type missions.",
                    "author": null,
                    "id": "gwntbca",
                    "parent_id": "t1_gwnrh5j",
                    "score": 1,
                    "created_utc": 1619963105.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's one hell of a statement coming from someone who spends day after day writing angry comments at Madara fans haha.",
            "author": "HisOnlyFriend",
            "id": "gwng1rm",
            "parent_id": "t1_gwnfpca",
            "score": 9,
            "created_utc": 1619956207.0,
            "replies": []
        },
        {
            "body": "Lmao you try to back shit up with source links but that link you put is shite. Itachi talking to his little kid brother ofc he’s gonna say our clan is cool only the coolest get to be the enforcers. \n\nDidn’t this uchiha clan role in the village shit happen during tobiramas time. Doubt itachi was alive then to “choose not to be cops”\n\nPretty sure the takeaway is that they couldn’t have an uchiha hokage",
            "author": "Phenoxx",
            "id": "gwntgce",
            "parent_id": "t1_gwnrrfr",
            "score": 12,
            "created_utc": 1619963170.0,
            "replies": [
                {
                    "body": ">Itachi talking to his little kid brother\n\nSo Orochimaru is somehow more reliable.\n\n>itachi was alive then to “choose not to be cops”\n\nAnd he chose not to be. He joined the ANBU.\n\n>they couldn’t have an uchiha hokage\n\nKagami Uchiha almost became Hokage over Hiruzen.\n\nAt least I bother citing canon. Unlike you who makes up bs and throws cheap insults.",
                    "author": "TyrionGoldenLion",
                    "id": "gwntr4o",
                    "parent_id": "t1_gwntgce",
                    "score": 5,
                    "created_utc": 1619963353.0,
                    "replies": [
                        {
                            "body": ">So Orochimaru is somehow more reliable.\n\nThat was clearly narrative exposition.\n\n>And he chose not to be. He joined the ANBU.\n\nItachi and Shisui were allowed to be special exceptions because of their abnormal talent. 99% of Uchiha shinobi were the police force. That doesn’t sound like much of a choice.\n\n>Kagami Uchiha almost became Hokage over Hiruzen.\n\nBut he didn’t. Almost became hokage is not became hokage.",
                            "author": "YesNoMan58",
                            "id": "gwo5s9l",
                            "parent_id": "t1_gwntr4o",
                            "score": 4,
                            "created_utc": 1619968767.0,
                            "replies": [
                                {
                                    "body": ">Itachi and Shisui were allowed to be special exceptions because of their abnormal talent\n\nFanon news. Aside from those two,  Uchiha [had great influence within ANBU forces.](https://pbs.twimg.com/media/EyWfmW0XIAAwMBt?format=jpg&name=small)\n\n>Almost became hokage is not became hokage.\n\nThe other commenter was saying Uchiha weren't allowed to be Hokage and I debunked because they clearly could.\n\n>That was clearly narrative exposition.\n\nSo is Itachi's quote and he had no reason to lie at the time, unlike Orochimaru who says nothing notable and is disputed immediately.",
                                    "author": "TyrionGoldenLion",
                                    "id": "gwo6gtg",
                                    "parent_id": "t1_gwo5s9l",
                                    "score": 1,
                                    "created_utc": 1619969014.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some people like lore",
            "author": "KinkyGCM",
            "id": "gwokwag",
            "parent_id": "t1_gwnsz3g",
            "score": 7,
            "created_utc": 1619974664.0,
            "replies": [
                {
                    "body": "The Uchiha stans are mad at me because I use canon to show their faves were assholes. One of them pretty much said I should stop citing the canon. Lmao",
                    "author": "TyrionGoldenLion",
                    "id": "gwouhmq",
                    "parent_id": "t1_gwokwag",
                    "score": 7,
                    "created_utc": 1619977995.0,
                    "replies": [
                        {
                            "body": "Lmao thats a weird way to phrase \"people are telling me to stop acting like a certain group of people are genetically evil and that they are the ones to be blamed for the discrimination and genocide carried out against them\"",
                            "author": "azulepearl",
                            "id": "gwp1tjz",
                            "parent_id": "t1_gwouhmq",
                            "score": 0,
                            "created_utc": 1619980699.0,
                            "replies": [
                                {
                                    "body": "Um, no, I never said any of that. You're pretending Uchiha did nothing wrong and I'm correcting you. I even said Uchiha were framed by Obito, meaning they didn't deserve what they got. \n\nSo don't try to put words into my mouth just because you can'tmake am argument. All your comments factually incorrect.",
                                    "author": "TyrionGoldenLion",
                                    "id": "gwp2qxy",
                                    "parent_id": "t1_gwp1tjz",
                                    "score": 6,
                                    "created_utc": 1619981066.0,
                                    "replies": [
                                        {
                                            "body": "Literally the first thing u commented on this post was \"Uchiha have been trash long before Danzo. Tobirama did nothing to them.\nUchiha are just problematic.\" what other interpretation is there of it?? And for hours you've been arguing about how the uchiha were evil and fucked up and tobirama n danzo tried their best.",
                                            "author": "azulepearl",
                                            "id": "gwp3pho",
                                            "parent_id": "t1_gwp2qxy",
                                            "score": 0,
                                            "created_utc": 1619981437.0,
                                            "replies": [
                                                {
                                                    "body": ">\"Uchiha have been trash long before Danzo\n\nPlease don't act ignorant, you know I was talking the batshit ones and not every single one of them.\n\n>you've been arguing about how the uchiha were evil\n\nWell if that's how you interpret the manga panels I've linked...\n\n>danzo tried their best.\n\nI literally called Danzo scum. Lmao\n\nAnyways, I'm done with you. It's obvious you deflect any canon evidence with bs. Chill, all major Uchiha were villainous at some point and it's their job to be bad.",
                                                    "author": "TyrionGoldenLion",
                                                    "id": "gwp4g2y",
                                                    "parent_id": "t1_gwp3pho",
                                                    "score": 4,
                                                    "created_utc": 1619981723.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wrote it to another \"thesis\" as you put it. Why are you bothered by my comments only?",
            "author": "TyrionGoldenLion",
            "id": "gwntczm",
            "parent_id": "t1_gwnsz3g",
            "score": 0,
            "created_utc": 1619963126.0,
            "replies": []
        },
        {
            "body": "Oh yeah, apparently he was slighting them because people don't like police. \n\nEssentially that was Orochimaru saying ACAB, he tried to free the means of Sharingan and socialised sage energy.\n\nOrochimaru is a marxist confirmed.",
            "author": null,
            "id": "gwnkxp5",
            "parent_id": "t1_gwnk1a3",
            "score": 12,
            "created_utc": 1619958881.0,
            "replies": [
                {
                    "body": "Non-Uchiha cops had no such problem. And the position canonically made them [the privileged elite.](https://pbs.twimg.com/media/Eryy5JXXYAU_3ky?format=png&name=small) So the issue are the Uchiha themselves. Even Orochimaru said such influence and power made them conceited and corrupt.",
                    "author": "TyrionGoldenLion",
                    "id": "gwnl6ko",
                    "parent_id": "t1_gwnkxp5",
                    "score": 1,
                    "created_utc": 1619959017.0,
                    "replies": [
                        {
                            "body": "Power corrupting is a universal concept. Police irl that have little oversight do whatever they want due to little repercussion for their actions. \n\nItachi could be referring to the fact that the Sharingan allows them to do police work better than others. The Sharingan can be used to detect forgeries, are effectively visual polygraphs and can get information from suspects very easily.",
                            "author": null,
                            "id": "gwnoapc",
                            "parent_id": "t1_gwnl6ko",
                            "score": 5,
                            "created_utc": 1619960628.0,
                            "replies": []
                        },
                        {
                            "body": "Oh yeah bc being showed to the outskirts of the village and being monitored 24/7 and being denied top gpvt positions bc of ur genes is SUCH a privilege",
                            "author": "azulepearl",
                            "id": "gwnrsl9",
                            "parent_id": "t1_gwnl6ko",
                            "score": -1,
                            "created_utc": 1619962355.0,
                            "replies": [
                                {
                                    "body": ">the outskirts of the village and being monitored 24/7 and\n\nAll that happened after Obito framed the Uchiha for Kyuubi's attack.\n\n>being denied top gpvt positions\n\nItachi and Shisui were top ANBU agents, [Uchiha were massively influential within ANBU](https://pbs.twimg.com/media/Enx36NUWEAoMsv6?format=jpg&name=small) and as stated in CANON MANGA, they were the elite and had absolute control over Shinobi law enforcement, thus most other Shinobi of the village. Every single Uchiha fighter had a top post in this village.\n\nMeanwhile most Yamanaka sold flowers, Akimichi sold food products, Nara had deers, Hyuga were isolated and powerless.\n\nYes, I can see how those poor smol Uchiha were such oppressed victims when they had it better than everyone else.",
                                    "author": "TyrionGoldenLion",
                                    "id": "gwnsonb",
                                    "parent_id": "t1_gwnrsl9",
                                    "score": 6,
                                    "created_utc": 1619962805.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">It's been basically stated that moving the clan/making them in charge of the police was not the only way the uchiha were discriminated against. \n\nYou keep repeating that nonsense even though [it was Danzo who moved out the Uchiha and only after Kyuubi's attack.](https://pbs.twimg.com/media/Ezq_5odWQAQ84eX?format=jpg&name=900x900) and the police force was voluntary.\n\n>The uchiha police were just left with petty robberies or bar fights to deal with. \n\n[Only ones who can enforce the laws on Shinobi's crimes are superior Shinobi.](https://pbs.twimg.com/media/Eryy5JXXYAU_3ky?format=png&name=small) So you're wrong. Again.",
            "author": "TyrionGoldenLion",
            "id": "gwnt7oo",
            "parent_id": "t1_gwnrh5j",
            "score": 4,
            "created_utc": 1619963059.0,
            "replies": []
        },
        {
            "body": "I think the idea was that the Uchiha were supposed to be 'overseers', effectively supposed to help police other ninja. It makes sense given such a position that Tobirama or whoever was trying to stop a conflict of interest. Like when the police investigate themselves for wrongdoing. \n\nWhenever they've shown prisons in the series there are ninja there, idk where you got the idea they were dealing with bar fights. I think the ANBU took on their responsibilities after they were destroyed, every time they've shown them before the Uchiha destruction they've been doing special ops type missions.",
            "author": null,
            "id": "gwntbca",
            "parent_id": "t1_gwnrh5j",
            "score": 1,
            "created_utc": 1619963105.0,
            "replies": []
        },
        {
            "body": ">Itachi talking to his little kid brother\n\nSo Orochimaru is somehow more reliable.\n\n>itachi was alive then to “choose not to be cops”\n\nAnd he chose not to be. He joined the ANBU.\n\n>they couldn’t have an uchiha hokage\n\nKagami Uchiha almost became Hokage over Hiruzen.\n\nAt least I bother citing canon. Unlike you who makes up bs and throws cheap insults.",
            "author": "TyrionGoldenLion",
            "id": "gwntr4o",
            "parent_id": "t1_gwntgce",
            "score": 5,
            "created_utc": 1619963353.0,
            "replies": [
                {
                    "body": ">So Orochimaru is somehow more reliable.\n\nThat was clearly narrative exposition.\n\n>And he chose not to be. He joined the ANBU.\n\nItachi and Shisui were allowed to be special exceptions because of their abnormal talent. 99% of Uchiha shinobi were the police force. That doesn’t sound like much of a choice.\n\n>Kagami Uchiha almost became Hokage over Hiruzen.\n\nBut he didn’t. Almost became hokage is not became hokage.",
                    "author": "YesNoMan58",
                    "id": "gwo5s9l",
                    "parent_id": "t1_gwntr4o",
                    "score": 4,
                    "created_utc": 1619968767.0,
                    "replies": [
                        {
                            "body": ">Itachi and Shisui were allowed to be special exceptions because of their abnormal talent\n\nFanon news. Aside from those two,  Uchiha [had great influence within ANBU forces.](https://pbs.twimg.com/media/EyWfmW0XIAAwMBt?format=jpg&name=small)\n\n>Almost became hokage is not became hokage.\n\nThe other commenter was saying Uchiha weren't allowed to be Hokage and I debunked because they clearly could.\n\n>That was clearly narrative exposition.\n\nSo is Itachi's quote and he had no reason to lie at the time, unlike Orochimaru who says nothing notable and is disputed immediately.",
                            "author": "TyrionGoldenLion",
                            "id": "gwo6gtg",
                            "parent_id": "t1_gwo5s9l",
                            "score": 1,
                            "created_utc": 1619969014.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The Uchiha stans are mad at me because I use canon to show their faves were assholes. One of them pretty much said I should stop citing the canon. Lmao",
            "author": "TyrionGoldenLion",
            "id": "gwouhmq",
            "parent_id": "t1_gwokwag",
            "score": 7,
            "created_utc": 1619977995.0,
            "replies": [
                {
                    "body": "Lmao thats a weird way to phrase \"people are telling me to stop acting like a certain group of people are genetically evil and that they are the ones to be blamed for the discrimination and genocide carried out against them\"",
                    "author": "azulepearl",
                    "id": "gwp1tjz",
                    "parent_id": "t1_gwouhmq",
                    "score": 0,
                    "created_utc": 1619980699.0,
                    "replies": [
                        {
                            "body": "Um, no, I never said any of that. You're pretending Uchiha did nothing wrong and I'm correcting you. I even said Uchiha were framed by Obito, meaning they didn't deserve what they got. \n\nSo don't try to put words into my mouth just because you can'tmake am argument. All your comments factually incorrect.",
                            "author": "TyrionGoldenLion",
                            "id": "gwp2qxy",
                            "parent_id": "t1_gwp1tjz",
                            "score": 6,
                            "created_utc": 1619981066.0,
                            "replies": [
                                {
                                    "body": "Literally the first thing u commented on this post was \"Uchiha have been trash long before Danzo. Tobirama did nothing to them.\nUchiha are just problematic.\" what other interpretation is there of it?? And for hours you've been arguing about how the uchiha were evil and fucked up and tobirama n danzo tried their best.",
                                    "author": "azulepearl",
                                    "id": "gwp3pho",
                                    "parent_id": "t1_gwp2qxy",
                                    "score": 0,
                                    "created_utc": 1619981437.0,
                                    "replies": [
                                        {
                                            "body": ">\"Uchiha have been trash long before Danzo\n\nPlease don't act ignorant, you know I was talking the batshit ones and not every single one of them.\n\n>you've been arguing about how the uchiha were evil\n\nWell if that's how you interpret the manga panels I've linked...\n\n>danzo tried their best.\n\nI literally called Danzo scum. Lmao\n\nAnyways, I'm done with you. It's obvious you deflect any canon evidence with bs. Chill, all major Uchiha were villainous at some point and it's their job to be bad.",
                                            "author": "TyrionGoldenLion",
                                            "id": "gwp4g2y",
                                            "parent_id": "t1_gwp3pho",
                                            "score": 4,
                                            "created_utc": 1619981723.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Non-Uchiha cops had no such problem. And the position canonically made them [the privileged elite.](https://pbs.twimg.com/media/Eryy5JXXYAU_3ky?format=png&name=small) So the issue are the Uchiha themselves. Even Orochimaru said such influence and power made them conceited and corrupt.",
            "author": "TyrionGoldenLion",
            "id": "gwnl6ko",
            "parent_id": "t1_gwnkxp5",
            "score": 1,
            "created_utc": 1619959017.0,
            "replies": [
                {
                    "body": "Power corrupting is a universal concept. Police irl that have little oversight do whatever they want due to little repercussion for their actions. \n\nItachi could be referring to the fact that the Sharingan allows them to do police work better than others. The Sharingan can be used to detect forgeries, are effectively visual polygraphs and can get information from suspects very easily.",
                    "author": null,
                    "id": "gwnoapc",
                    "parent_id": "t1_gwnl6ko",
                    "score": 5,
                    "created_utc": 1619960628.0,
                    "replies": []
                },
                {
                    "body": "Oh yeah bc being showed to the outskirts of the village and being monitored 24/7 and being denied top gpvt positions bc of ur genes is SUCH a privilege",
                    "author": "azulepearl",
                    "id": "gwnrsl9",
                    "parent_id": "t1_gwnl6ko",
                    "score": -1,
                    "created_utc": 1619962355.0,
                    "replies": [
                        {
                            "body": ">the outskirts of the village and being monitored 24/7 and\n\nAll that happened after Obito framed the Uchiha for Kyuubi's attack.\n\n>being denied top gpvt positions\n\nItachi and Shisui were top ANBU agents, [Uchiha were massively influential within ANBU](https://pbs.twimg.com/media/Enx36NUWEAoMsv6?format=jpg&name=small) and as stated in CANON MANGA, they were the elite and had absolute control over Shinobi law enforcement, thus most other Shinobi of the village. Every single Uchiha fighter had a top post in this village.\n\nMeanwhile most Yamanaka sold flowers, Akimichi sold food products, Nara had deers, Hyuga were isolated and powerless.\n\nYes, I can see how those poor smol Uchiha were such oppressed victims when they had it better than everyone else.",
                            "author": "TyrionGoldenLion",
                            "id": "gwnsonb",
                            "parent_id": "t1_gwnrsl9",
                            "score": 6,
                            "created_utc": 1619962805.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">So Orochimaru is somehow more reliable.\n\nThat was clearly narrative exposition.\n\n>And he chose not to be. He joined the ANBU.\n\nItachi and Shisui were allowed to be special exceptions because of their abnormal talent. 99% of Uchiha shinobi were the police force. That doesn’t sound like much of a choice.\n\n>Kagami Uchiha almost became Hokage over Hiruzen.\n\nBut he didn’t. Almost became hokage is not became hokage.",
            "author": "YesNoMan58",
            "id": "gwo5s9l",
            "parent_id": "t1_gwntr4o",
            "score": 4,
            "created_utc": 1619968767.0,
            "replies": [
                {
                    "body": ">Itachi and Shisui were allowed to be special exceptions because of their abnormal talent\n\nFanon news. Aside from those two,  Uchiha [had great influence within ANBU forces.](https://pbs.twimg.com/media/EyWfmW0XIAAwMBt?format=jpg&name=small)\n\n>Almost became hokage is not became hokage.\n\nThe other commenter was saying Uchiha weren't allowed to be Hokage and I debunked because they clearly could.\n\n>That was clearly narrative exposition.\n\nSo is Itachi's quote and he had no reason to lie at the time, unlike Orochimaru who says nothing notable and is disputed immediately.",
                    "author": "TyrionGoldenLion",
                    "id": "gwo6gtg",
                    "parent_id": "t1_gwo5s9l",
                    "score": 1,
                    "created_utc": 1619969014.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lmao thats a weird way to phrase \"people are telling me to stop acting like a certain group of people are genetically evil and that they are the ones to be blamed for the discrimination and genocide carried out against them\"",
            "author": "azulepearl",
            "id": "gwp1tjz",
            "parent_id": "t1_gwouhmq",
            "score": 0,
            "created_utc": 1619980699.0,
            "replies": [
                {
                    "body": "Um, no, I never said any of that. You're pretending Uchiha did nothing wrong and I'm correcting you. I even said Uchiha were framed by Obito, meaning they didn't deserve what they got. \n\nSo don't try to put words into my mouth just because you can'tmake am argument. All your comments factually incorrect.",
                    "author": "TyrionGoldenLion",
                    "id": "gwp2qxy",
                    "parent_id": "t1_gwp1tjz",
                    "score": 6,
                    "created_utc": 1619981066.0,
                    "replies": [
                        {
                            "body": "Literally the first thing u commented on this post was \"Uchiha have been trash long before Danzo. Tobirama did nothing to them.\nUchiha are just problematic.\" what other interpretation is there of it?? And for hours you've been arguing about how the uchiha were evil and fucked up and tobirama n danzo tried their best.",
                            "author": "azulepearl",
                            "id": "gwp3pho",
                            "parent_id": "t1_gwp2qxy",
                            "score": 0,
                            "created_utc": 1619981437.0,
                            "replies": [
                                {
                                    "body": ">\"Uchiha have been trash long before Danzo\n\nPlease don't act ignorant, you know I was talking the batshit ones and not every single one of them.\n\n>you've been arguing about how the uchiha were evil\n\nWell if that's how you interpret the manga panels I've linked...\n\n>danzo tried their best.\n\nI literally called Danzo scum. Lmao\n\nAnyways, I'm done with you. It's obvious you deflect any canon evidence with bs. Chill, all major Uchiha were villainous at some point and it's their job to be bad.",
                                    "author": "TyrionGoldenLion",
                                    "id": "gwp4g2y",
                                    "parent_id": "t1_gwp3pho",
                                    "score": 4,
                                    "created_utc": 1619981723.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Power corrupting is a universal concept. Police irl that have little oversight do whatever they want due to little repercussion for their actions. \n\nItachi could be referring to the fact that the Sharingan allows them to do police work better than others. The Sharingan can be used to detect forgeries, are effectively visual polygraphs and can get information from suspects very easily.",
            "author": null,
            "id": "gwnoapc",
            "parent_id": "t1_gwnl6ko",
            "score": 5,
            "created_utc": 1619960628.0,
            "replies": []
        },
        {
            "body": "Oh yeah bc being showed to the outskirts of the village and being monitored 24/7 and being denied top gpvt positions bc of ur genes is SUCH a privilege",
            "author": "azulepearl",
            "id": "gwnrsl9",
            "parent_id": "t1_gwnl6ko",
            "score": -1,
            "created_utc": 1619962355.0,
            "replies": [
                {
                    "body": ">the outskirts of the village and being monitored 24/7 and\n\nAll that happened after Obito framed the Uchiha for Kyuubi's attack.\n\n>being denied top gpvt positions\n\nItachi and Shisui were top ANBU agents, [Uchiha were massively influential within ANBU](https://pbs.twimg.com/media/Enx36NUWEAoMsv6?format=jpg&name=small) and as stated in CANON MANGA, they were the elite and had absolute control over Shinobi law enforcement, thus most other Shinobi of the village. Every single Uchiha fighter had a top post in this village.\n\nMeanwhile most Yamanaka sold flowers, Akimichi sold food products, Nara had deers, Hyuga were isolated and powerless.\n\nYes, I can see how those poor smol Uchiha were such oppressed victims when they had it better than everyone else.",
                    "author": "TyrionGoldenLion",
                    "id": "gwnsonb",
                    "parent_id": "t1_gwnrsl9",
                    "score": 6,
                    "created_utc": 1619962805.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Itachi and Shisui were allowed to be special exceptions because of their abnormal talent\n\nFanon news. Aside from those two,  Uchiha [had great influence within ANBU forces.](https://pbs.twimg.com/media/EyWfmW0XIAAwMBt?format=jpg&name=small)\n\n>Almost became hokage is not became hokage.\n\nThe other commenter was saying Uchiha weren't allowed to be Hokage and I debunked because they clearly could.\n\n>That was clearly narrative exposition.\n\nSo is Itachi's quote and he had no reason to lie at the time, unlike Orochimaru who says nothing notable and is disputed immediately.",
            "author": "TyrionGoldenLion",
            "id": "gwo6gtg",
            "parent_id": "t1_gwo5s9l",
            "score": 1,
            "created_utc": 1619969014.0,
            "replies": []
        },
        {
            "body": "Um, no, I never said any of that. You're pretending Uchiha did nothing wrong and I'm correcting you. I even said Uchiha were framed by Obito, meaning they didn't deserve what they got. \n\nSo don't try to put words into my mouth just because you can'tmake am argument. All your comments factually incorrect.",
            "author": "TyrionGoldenLion",
            "id": "gwp2qxy",
            "parent_id": "t1_gwp1tjz",
            "score": 6,
            "created_utc": 1619981066.0,
            "replies": [
                {
                    "body": "Literally the first thing u commented on this post was \"Uchiha have been trash long before Danzo. Tobirama did nothing to them.\nUchiha are just problematic.\" what other interpretation is there of it?? And for hours you've been arguing about how the uchiha were evil and fucked up and tobirama n danzo tried their best.",
                    "author": "azulepearl",
                    "id": "gwp3pho",
                    "parent_id": "t1_gwp2qxy",
                    "score": 0,
                    "created_utc": 1619981437.0,
                    "replies": [
                        {
                            "body": ">\"Uchiha have been trash long before Danzo\n\nPlease don't act ignorant, you know I was talking the batshit ones and not every single one of them.\n\n>you've been arguing about how the uchiha were evil\n\nWell if that's how you interpret the manga panels I've linked...\n\n>danzo tried their best.\n\nI literally called Danzo scum. Lmao\n\nAnyways, I'm done with you. It's obvious you deflect any canon evidence with bs. Chill, all major Uchiha were villainous at some point and it's their job to be bad.",
                            "author": "TyrionGoldenLion",
                            "id": "gwp4g2y",
                            "parent_id": "t1_gwp3pho",
                            "score": 4,
                            "created_utc": 1619981723.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">the outskirts of the village and being monitored 24/7 and\n\nAll that happened after Obito framed the Uchiha for Kyuubi's attack.\n\n>being denied top gpvt positions\n\nItachi and Shisui were top ANBU agents, [Uchiha were massively influential within ANBU](https://pbs.twimg.com/media/Enx36NUWEAoMsv6?format=jpg&name=small) and as stated in CANON MANGA, they were the elite and had absolute control over Shinobi law enforcement, thus most other Shinobi of the village. Every single Uchiha fighter had a top post in this village.\n\nMeanwhile most Yamanaka sold flowers, Akimichi sold food products, Nara had deers, Hyuga were isolated and powerless.\n\nYes, I can see how those poor smol Uchiha were such oppressed victims when they had it better than everyone else.",
            "author": "TyrionGoldenLion",
            "id": "gwnsonb",
            "parent_id": "t1_gwnrsl9",
            "score": 6,
            "created_utc": 1619962805.0,
            "replies": []
        },
        {
            "body": "Literally the first thing u commented on this post was \"Uchiha have been trash long before Danzo. Tobirama did nothing to them.\nUchiha are just problematic.\" what other interpretation is there of it?? And for hours you've been arguing about how the uchiha were evil and fucked up and tobirama n danzo tried their best.",
            "author": "azulepearl",
            "id": "gwp3pho",
            "parent_id": "t1_gwp2qxy",
            "score": 0,
            "created_utc": 1619981437.0,
            "replies": [
                {
                    "body": ">\"Uchiha have been trash long before Danzo\n\nPlease don't act ignorant, you know I was talking the batshit ones and not every single one of them.\n\n>you've been arguing about how the uchiha were evil\n\nWell if that's how you interpret the manga panels I've linked...\n\n>danzo tried their best.\n\nI literally called Danzo scum. Lmao\n\nAnyways, I'm done with you. It's obvious you deflect any canon evidence with bs. Chill, all major Uchiha were villainous at some point and it's their job to be bad.",
                    "author": "TyrionGoldenLion",
                    "id": "gwp4g2y",
                    "parent_id": "t1_gwp3pho",
                    "score": 4,
                    "created_utc": 1619981723.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">\"Uchiha have been trash long before Danzo\n\nPlease don't act ignorant, you know I was talking the batshit ones and not every single one of them.\n\n>you've been arguing about how the uchiha were evil\n\nWell if that's how you interpret the manga panels I've linked...\n\n>danzo tried their best.\n\nI literally called Danzo scum. Lmao\n\nAnyways, I'm done with you. It's obvious you deflect any canon evidence with bs. Chill, all major Uchiha were villainous at some point and it's their job to be bad.",
            "author": "TyrionGoldenLion",
            "id": "gwp4g2y",
            "parent_id": "t1_gwp3pho",
            "score": 4,
            "created_utc": 1619981723.0,
            "replies": []
        }
    ]
}