{
    "title": "Looking for an SD, got offered... something else",
    "post_id": "ehmo5u",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ehmo5u/looking_for_an_sd_got_offered_something_else/",
    "author": "fuzzyfuzzbourne",
    "body": "SB here. So I was on SA and started chatting to this nice, attractive guy. He said he found me very interesting and a conversation began that lasted for a couple of months. This included several phone calls and skype chats. All along the messages were flirtatious, (‘you’re very attractive, I can’t wait to meet you’ that sort of thing from him). I really liked him and we set a date to meet. It meant me travelling up to London on the 26th of December, but I thought he was great, he thought I was great, he promised a generous and regular allowance in his profile so I thought it might be worth it.\n\nWe were meeting late so I booked a hostel to stay in. Now normally I don’t travel far for M&Gs, and I certainly don’t do anything expensive like book a place to stay, but this guy seemed so nice and genuine that I decided to take the chance. Having been in the sugar bowl for a while I thought I was wise enough to know when I was being taken for a ride (ha!) \n\nSo, time passes, I spend a month slimming down to get rid of those pesky extra kilos, bought myself a nice dress.\n\nFour days before the meeting he tells me he has a wonderful surprise for me, and that in preparation I must watch the film ‘Rebecca’ (plot summary: rich man marries young ingenuous woman and whisks her off to country mansion where she is terrorised by an evil housekeeper.) I found this a bit weird, but hoped it could be a good omen. \n\nSo the date is coming up and he’s being all mysterious about the life-changing news he has for me, and how impatient he is to see me. The day comes, I put on my make-up, and make the long, tiresome journey to London.\n\nI’m waiting for him in the lobby of his posh Mayfair hotel. He sweeps in - as attractive in flesh as in photos! - and buys me a drink in the hotel bar. \n\nI’m on tenterhooks, waiting to hear what could possibly be the wonderful news he has for me... \n\nAnd it turns out he wants to employ me. As his housekeeper. He had me watch the film not so I could imagine myself as the romantic heroine being swept off her feet, but see myself in the shoes of the crusty old bag who makes sure the meals are acceptable and that the maids don’t steal the silver. He needed a woman to organise his 10 homes around the world, hire and fire staff, make sure he isn’t working too hard, and to put his many lovers in their place when they begin to get a bit too uppity.\n\nHe added, “of course there would be nothing romantic/sexual between you and me. That would get in the way of business. Plus, you’re not really my type.”\n\nTo say that I was deflated was an understatement. \n\nI sat there in my nice dress and my careful make-up and watched his mouth go up and down for a while, and then I made my excuses and left. \n\nThe job offer was not bad - a generous wage, but involved a 7 day week and a lot of responsibility, not to mention having to be ready to drop everything and pack my suitcase as soon as he decided to move from his Swiss home to his house in Gibraltar. Not something I think I would be cut out for even if were 100% physically well.\n\nMy main niggles about the whole experience \n\n- I told the guy right from the word go that I’m suffering from a chronic illness and can’t really work. If he’d just come out about wanting to employ me I could have told him no and saved myself a difficult, painful and expensive journey. \n\n- In all of our conversations he used romantic, flirty language. Then he waits til we meet to say he doesn’t fancy me? \n\n- Why the hell was he on a sugar dating site when he was looking for an employee? Surely there are websites for that?!? \n\n- oh, and as a seasoned sugar baby, I’m kicking myself for being so dumb and naive. \n\nAnyway, I trailed back to my hostel to spend a wakeful night listening to the snores of the guy in the bed above me and crying into my pillow. \n\nI’m just posting this here partly for cathartic reasons, and partly to ask - is this kind of behaviour... normal? Has it happened to anyone else? \n\nTL;DR - I got my hopes up about a nice attractive SD and made a difficult journey to meet him and he offers me a job as a ‘Nanny but to a 60 year old man instead of a child’ (his words, not mine.) I feel upset and wonder if this is a common occurrence or if this guy is just nuts.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ehmo5u/looking_for_an_sd_got_offered_something_else/",
    "score": 141,
    "upvote_ratio": 0.97,
    "created_utc": 1577716106.0,
    "num_comments": 81,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "fck4lgf",
            "parent_id": "t3_ehmo5u",
            "score": 160,
            "created_utc": 1577716424.0,
            "replies": [
                {
                    "body": "Indeed, I think you’re right!!",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckmj39",
                    "parent_id": "t1_fck4lgf",
                    "score": 12,
                    "created_utc": 1577728563.0,
                    "replies": []
                },
                {
                    "body": "She needs to copyright the story .........   made for TV",
                    "author": "pinotandsugar",
                    "id": "fcm4oz8",
                    "parent_id": "t1_fck4lgf",
                    "score": 4,
                    "created_utc": 1577764166.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No one should have to cry into their pillow at night because of a guy like this. It was made worse by him stringing you along for months. He was a sadistic SoB for leading you on, knowing you could not take the job. (The offer was probably fake) There are many men out there that will treat you well, please don’t let this jerk sour you on the search.",
            "author": "SDforreal",
            "id": "fck5jwp",
            "parent_id": "t3_ehmo5u",
            "score": 66,
            "created_utc": 1577717210.0,
            "replies": [
                {
                    "body": "Agree.  We're out here.  Dont give up because of idiots like this guy.",
                    "author": "Life_b_beautiful",
                    "id": "fck93tk",
                    "parent_id": "t1_fck5jwp",
                    "score": 9,
                    "created_utc": 1577719911.0,
                    "replies": []
                },
                {
                    "body": "Thanks for the reassurance :)",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckmkm8",
                    "parent_id": "t1_fck5jwp",
                    "score": 3,
                    "created_utc": 1577728588.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m an idiot!\n\nNah, just hopeful.\n\n\" a conversation began that lasted for a couple of months.\"\n\nThis is actually the bright red flag and I knew from the first sentence that things would not end well. Long courtships are not a good idea in the sugar world. Move things along briskly within a week or two . Beyond that you wll be a pen pal.",
            "author": "GSSD",
            "id": "fck86nf",
            "parent_id": "t3_ehmo5u",
            "score": 40,
            "created_utc": 1577719251.0,
            "replies": [
                {
                    "body": "His excuse was ‘I’m only in the uk for 2 days in December, after which I’ll be in Japan...’ should have known it was fishy.",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckmnhl",
                    "parent_id": "t1_fck86nf",
                    "score": 11,
                    "created_utc": 1577728636.0,
                    "replies": [
                        {
                            "body": "Yep-needed to get laid asap, never to be seen again.",
                            "author": "GSSD",
                            "id": "fcknx5u",
                            "parent_id": "t1_fckmnhl",
                            "score": 2,
                            "created_utc": 1577729416.0,
                            "replies": [
                                {
                                    "body": "The weird thing is, he said he absolutely wasn’t interested in me sexually. Didn’t try to coerce me,  get me to come to his hotel room, nothing. I mean, I liked him to start with, if he’d suggested doing a one-off PPM I wouldn’t have been so annoyed - as long as he handed over the gift before we got down to business.",
                                    "author": "fuzzyfuzzbourne",
                                    "id": "fckyu9m",
                                    "parent_id": "t1_fcknx5u",
                                    "score": 7,
                                    "created_utc": 1577736126.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That’s not even courtship",
                    "author": "Lilipuss25",
                    "id": "fcnox9f",
                    "parent_id": "t1_fck86nf",
                    "score": 1,
                    "created_utc": 1577815650.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Guy is more than nuts... sociopath comes to mind.  As an SD stories like this are really hard to read.  People like this make it so much harder for genuine SBs and SDs to connect.",
            "author": null,
            "id": "fck5an1",
            "parent_id": "t3_ehmo5u",
            "score": 31,
            "created_utc": 1577717001.0,
            "replies": [
                {
                    "body": "Glad I’m not alone in thinking he’s a lunatic! Thanks for the sympathy",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckmpmq",
                    "parent_id": "t1_fck5an1",
                    "score": 3,
                    "created_utc": 1577728671.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This guy is a sadistic sicko.\n\nCan you imagine if he took you on a trip under the pretense of wanting you to be his SB, but then sprung a maid’s outfit, Brillo pads and a mop on you?! Not to make light of it, but what a psycho. I’m sorry you met this asshole, but I’m glad you got away from him!\n\nJust goes to show you there are indeed a lot of crazies out there.\n\nAlso, regarding the “expensive” trip, don’t put out lots of money for a m&g no matter how charming someone seems.",
            "author": "scorpiogirl26",
            "id": "fck5omp",
            "parent_id": "t3_ehmo5u",
            "score": 26,
            "created_utc": 1577717315.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fckf18m",
                    "parent_id": "t1_fck5omp",
                    "score": 8,
                    "created_utc": 1577723872.0,
                    "replies": [
                        {
                            "body": "It baffles me too... at least there are some good guys out there",
                            "author": "fuzzyfuzzbourne",
                            "id": "fckmua5",
                            "parent_id": "t1_fckf18m",
                            "score": 3,
                            "created_utc": 1577728748.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yep. Lesson learnt. I won’t ever be doing that again!!",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckmryp",
                    "parent_id": "t1_fck5omp",
                    "score": 3,
                    "created_utc": 1577728710.0,
                    "replies": [
                        {
                            "body": "Yeah, I’m sorry you went through that. There are good guys out there, it just takes a ton of time, screening and patience. :)",
                            "author": "scorpiogirl26",
                            "id": "fckn4sh",
                            "parent_id": "t1_fckmryp",
                            "score": 2,
                            "created_utc": 1577728924.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fck9hvo",
            "parent_id": "t3_ehmo5u",
            "score": 23,
            "created_utc": 1577720187.0,
            "replies": [
                {
                    "body": "The sex trafficking thing is something I didn’t even think about! Good thing I got out of there quick...",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckmy2y",
                    "parent_id": "t1_fck9hvo",
                    "score": 9,
                    "created_utc": 1577728811.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I had a similar, but not so lengthy situation. Talked to a SD for a couple days. Decided to meet for lunch. (I like quick meetings, as to not waste time and time effort.) \n\nDuring the course of the conversation, we talked about his software business and my job. He realized I worked in a company that could benefit from his software; particularly my role was useful in getting his foot in the door. \n\nAt the end of the lunch, he asked how I felt. I said I thought we had a great connection so far and would be interested in another meeting. He said he’d rather explore the business side of things (using my connections to swell his software into the company). Also, he wanted to know if I’d be interested in personally testing his software, since I’d been in the ideal role to use this software in a past job. Compensated, of course. Eye roll. And by the way, since he was interested in the business side and doesn’t want to be sued for conflict of interest, etc., why don’t we see how the business side turns out then, we can explore the romantic side of things. \n\nThat’s going to be a pass and block from me. You’re not going to use my name or my job to sell your software into my company and make money for yourself. Fuck off. I’m no longer interested.",
            "author": "allllnamesaretaken",
            "id": "fckjje7",
            "parent_id": "t3_ehmo5u",
            "score": 12,
            "created_utc": 1577726714.0,
            "replies": [
                {
                    "body": "I’m glad he didn’t string you out for long, and I’m glad you told him where he could stick his software!!",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckn7ph",
                    "parent_id": "t1_fckjje7",
                    "score": 1,
                    "created_utc": 1577728974.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fckgdnp",
            "parent_id": "t3_ehmo5u",
            "score": 10,
            "created_utc": 1577724730.0,
            "replies": [
                {
                    "body": "That’s a great idea. I don’t have an SA profile any more but I think I will make one again just so I can  report him!",
                    "author": "fuzzyfuzzbourne",
                    "id": "fcknpae",
                    "parent_id": "t1_fckgdnp",
                    "score": 2,
                    "created_utc": 1577729279.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not only should he not have mislead you but he certainly should have paid for your trip.",
            "author": "Michael952",
            "id": "fckbz2u",
            "parent_id": "t3_ehmo5u",
            "score": 8,
            "created_utc": 1577721890.0,
            "replies": [
                {
                    "body": "Yeah... I guess I’m still in time to send him the bill! Not that it’ll do much good I guess",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckn0z8",
                    "parent_id": "t1_fckbz2u",
                    "score": 3,
                    "created_utc": 1577728860.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He's a psycho who probably doesn't even have 10 houses, etc. Who knows what his motives were, but any truly wealthy man doesn't waste his time looking for a house manager in the manner you described.",
            "author": "Seven_league_boots",
            "id": "fckdeyv",
            "parent_id": "t3_ehmo5u",
            "score": 5,
            "created_utc": 1577722832.0,
            "replies": [
                {
                    "body": "I’m sure you’re right. Seemed like a very convoluted way to find someone to employ!",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckn3d4",
                    "parent_id": "t1_fckdeyv",
                    "score": 3,
                    "created_utc": 1577728901.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Creep",
            "author": "FrankyAllDay",
            "id": "fck6i05",
            "parent_id": "t3_ehmo5u",
            "score": 5,
            "created_utc": 1577717960.0,
            "replies": []
        },
        {
            "body": "Any guy that chats back and forth for months before meeting isn’t normal.",
            "author": "LotBuilder",
            "id": "fckggo1",
            "parent_id": "t3_ehmo5u",
            "score": 6,
            "created_utc": 1577724783.0,
            "replies": [
                {
                    "body": "Agreed! Something to keep in mind from now on...",
                    "author": "fuzzyfuzzbourne",
                    "id": "fcknqih",
                    "parent_id": "t1_fckggo1",
                    "score": 1,
                    "created_utc": 1577729301.0,
                    "replies": [
                        {
                            "body": "I have a one week rule... maybe a little longer over the holidays or if there is a reason.  My best arrangement have all moved quickly.  Meet within a few days then second date shortly after.",
                            "author": "LotBuilder",
                            "id": "fcko1y0",
                            "parent_id": "t1_fcknqih",
                            "score": 2,
                            "created_utc": 1577729500.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"made an expensive and difficult journey\"  Did you pay for all of this????",
            "author": "conicheck",
            "id": "fck5fgz",
            "parent_id": "t3_ehmo5u",
            "score": 7,
            "created_utc": 1577717110.0,
            "replies": [
                {
                    "body": "Yep. Honestly it wasn’t THAT expensive (on the whole I spent around 120 pounds between room, travel and meals) but since I became ill I’ve been living on my savings and on the little bit of money I get from the government as a registered carer for my grandmother, so obviously parting with that much cash for a not-sure thing was a dumb choice. I might send him an invoice for it all (with a heavy extra charge for all the emotional labour...) not that he’ll pay it!",
                    "author": "fuzzyfuzzbourne",
                    "id": "fcko740",
                    "parent_id": "t1_fck5fgz",
                    "score": 3,
                    "created_utc": 1577729587.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fckt13y",
            "parent_id": "t3_ehmo5u",
            "score": 3,
            "created_utc": 1577732557.0,
            "replies": [
                {
                    "body": "Thank you for the advice and the sympathy 💜",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckthxj",
                    "parent_id": "t1_fckt13y",
                    "score": 1,
                    "created_utc": 1577732846.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow is all I can say, sorry this happened.",
            "author": "OffhandCut",
            "id": "fck8jnw",
            "parent_id": "t3_ehmo5u",
            "score": 2,
            "created_utc": 1577719516.0,
            "replies": [
                {
                    "body": "Thanks for the sympathy!",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckmz13",
                    "parent_id": "t1_fck8jnw",
                    "score": 1,
                    "created_utc": 1577728827.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow, I've never said this about anyone but he is a nut job. I'm sorry this happened to you. \n Now ya know better; long term online chats is kinda like a kiss or death for the bowl. Also, you being unable to work yet shelled your own money for this trip has me confused.\n\nAnd no, this behaviour isn't normal.",
            "author": "bsbdfw",
            "id": "fckdnka",
            "parent_id": "t3_ehmo5u",
            "score": 2,
            "created_utc": 1577722983.0,
            "replies": [
                {
                    "body": "I worked full time until I became ill last year so I have some savings. I also get 60 pounds a week from the government as I am a registered carer for my grandmother (though tbh she’s in better shape than I am). The London trip was not so expensive, but obviously due to my financial situation parting with any kind of money is painful!",
                    "author": "fuzzyfuzzbourne",
                    "id": "fcknlqx",
                    "parent_id": "t1_fckdnka",
                    "score": 2,
                    "created_utc": 1577729216.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fckseyl",
            "parent_id": "t3_ehmo5u",
            "score": 2,
            "created_utc": 1577732180.0,
            "replies": [
                {
                    "body": "Agreed!",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckvz3a",
                    "parent_id": "t1_fckseyl",
                    "score": 2,
                    "created_utc": 1577734375.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thaaaat sounds like human trafficking waiting to happen... You think you're in for a romantic getaway, he makes you watch 'Rebecca' (seriously, I can't imagine a scenario inspired by that story that ends well), and then wants you to work as a housekeeper where he'll need you to travel out of the country with him? Nope. I've seen that episode of SVU, thank you very much. Glad you dodged the bullet!",
            "author": "ThePrettyLovely",
            "id": "fcky50r",
            "parent_id": "t3_ehmo5u",
            "score": 2,
            "created_utc": 1577735698.0,
            "replies": [
                {
                    "body": "Thanks! Honestly when he sent me ‘Rebecca’ alarm bells went off, but I stupidly ignored them...",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckyxjq",
                    "parent_id": "t1_fcky50r",
                    "score": 2,
                    "created_utc": 1577736183.0,
                    "replies": [
                        {
                            "body": "Damn gothic romances, getting our hopes up about ball gowns and seaside mansions.",
                            "author": "ThePrettyLovely",
                            "id": "fckz7yt",
                            "parent_id": "t1_fckyxjq",
                            "score": 3,
                            "created_utc": 1577736361.0,
                            "replies": [
                                {
                                    "body": "I know right. When he said to me, “I want you to be like a Mrs. Danvers to me,” I replied, “So you want me to hate your guts and... set fire to your house?”",
                                    "author": "fuzzyfuzzbourne",
                                    "id": "fckzla9",
                                    "parent_id": "t1_fckz7yt",
                                    "score": 2,
                                    "created_utc": 1577736588.0,
                                    "replies": [
                                        {
                                            "body": "🤣",
                                            "author": "Fizzledy01",
                                            "id": "fd2o20b",
                                            "parent_id": "t1_fckzla9",
                                            "score": 2,
                                            "created_utc": 1578149954.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "😂😂😂😂😂\n\n\"Buddy, I am way ahead of you.\"",
                                            "author": "ThePrettyLovely",
                                            "id": "fckzqct",
                                            "parent_id": "t1_fckzla9",
                                            "score": 1,
                                            "created_utc": 1577736674.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’d fucking slap him right there, you have a lot of self control. I’m so sorry this happened to you.",
            "author": "kamicandy",
            "id": "fcl6zi7",
            "parent_id": "t3_ehmo5u",
            "score": 2,
            "created_utc": 1577741160.0,
            "replies": [
                {
                    "body": "I’m almost wishing I made a big scene in the lobby to guilt him into coughing up my train fare! Thanks.",
                    "author": "fuzzyfuzzbourne",
                    "id": "fcmnjhp",
                    "parent_id": "t1_fcl6zi7",
                    "score": 2,
                    "created_utc": 1577783019.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly, if you spent months talking to him and he never sent a dime for your efforts, you should have bailed long before meeting him.",
            "author": "mike_o212",
            "id": "fcmtpcw",
            "parent_id": "t3_ehmo5u",
            "score": 2,
            "created_utc": 1577791781.0,
            "replies": [
                {
                    "body": "His excuse was that he wouldn’t be in the UK til the 26th... and I’d never ask for money just for talking. But yes, you’re right, I should have been more suspicious.",
                    "author": "fuzzyfuzzbourne",
                    "id": "fcmtuuf",
                    "parent_id": "t1_fcmtpcw",
                    "score": 1,
                    "created_utc": 1577791996.0,
                    "replies": [
                        {
                            "body": "His excuse is lame.  He got a free chat buddy.  You shouldn't have to ask for money if he is the one dragging things out over a \"couple month conversation\".  I would just have lost interest if he never tried helping out.",
                            "author": "mike_o212",
                            "id": "fcmufk9",
                            "parent_id": "t1_fcmtuuf",
                            "score": 2,
                            "created_utc": 1577792790.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fck7kzt",
            "parent_id": "t3_ehmo5u",
            "score": 3,
            "created_utc": 1577718798.0,
            "replies": [
                {
                    "body": "I hope so! Thanks for the reply",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckn9n4",
                    "parent_id": "t1_fck7kzt",
                    "score": 1,
                    "created_utc": 1577729008.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry this happened to you. Not your fault. A couple of lessons here...Conversations should not drag on for weeks or months. If it does then I would block and move on. The whole movie thing was weird. I would have bolted at that. Don't tolerate even one ounce of weird or BS in the bowl. It's a bad sign and things will only get worse if you allow it to happen. \n\nI operate by a pretty simple rule rule in my interactions in the bowl. If any pot says or does something that I would never say or do then I immediately block & move on. I tolerate zero BS.",
            "author": "Rcwanderer2018",
            "id": "fckdn3x",
            "parent_id": "t3_ehmo5u",
            "score": 1,
            "created_utc": 1577722975.0,
            "replies": [
                {
                    "body": "That’s a good rule. I’ll have to do the same in the future. His excuse for dragging things out was that he wouldn’t be in the country for a couple of months... I’ll be wiser next time!",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckne4d",
                    "parent_id": "t1_fckdn3x",
                    "score": 1,
                    "created_utc": 1577729086.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fckei32",
            "parent_id": "t3_ehmo5u",
            "score": 1,
            "created_utc": 1577723531.0,
            "replies": [
                {
                    "body": "Thank you!",
                    "author": "fuzzyfuzzbourne",
                    "id": "fcknm6m",
                    "parent_id": "t1_fckei32",
                    "score": 1,
                    "created_utc": 1577729224.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fckh3h8",
            "parent_id": "t3_ehmo5u",
            "score": 1,
            "created_utc": 1577725189.0,
            "replies": [
                {
                    "body": "Thank you for your sympathy. Just gotta be careful of the bad guys out there I guess...",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckns5x",
                    "parent_id": "t1_fckh3h8",
                    "score": 1,
                    "created_utc": 1577729330.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He sounds so manipulative, I’m so sorry you wasted your time for THAT",
            "author": "Wind_Avi",
            "id": "fclkiej",
            "parent_id": "t3_ehmo5u",
            "score": 1,
            "created_utc": 1577749914.0,
            "replies": [
                {
                    "body": "Yeah :( lesson learnt I guess!",
                    "author": "fuzzyfuzzbourne",
                    "id": "fcmnln1",
                    "parent_id": "t1_fclkiej",
                    "score": 1,
                    "created_utc": 1577783104.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fcln7zl",
            "parent_id": "t3_ehmo5u",
            "score": 1,
            "created_utc": 1577751758.0,
            "replies": [
                {
                    "body": "But we conversed for two months about him wanting a sugar baby and me wanting a sugar daddy? \n\nLiterally the first thing I asked was, ‘these (xyz) are my expectations from a sugar relationships, is that the kind of thing you’re looking for and do you think I’m the right person for that kind of relationship with you?’ His response was ‘yes!’ \n\nMy fault lies in the fact that I spent money on a meet and greet, not the fact that I was lied to.",
                    "author": "fuzzyfuzzbourne",
                    "id": "fcmnbbv",
                    "parent_id": "t1_fcln7zl",
                    "score": 1,
                    "created_utc": 1577782707.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fcn2o9y",
                            "parent_id": "t1_fcmnbbv",
                            "score": 1,
                            "created_utc": 1577801574.0,
                            "replies": [
                                {
                                    "body": "Yep. Video chat, phone calls, did them all. After our meeting I went back and read through all our messages to try and understand if he’d given me hints and I had missed them. But throughout the conversation he made it clear he was definitely looking for a sugar baby. One thing I thought of was that maybe he found another girl he liked more at the last minute but wanted to keep me on the back burner in case it didn’t work out with her - but even that seems far-fetched. \nThe whole experience was just really weird...",
                                    "author": "fuzzyfuzzbourne",
                                    "id": "fcn5z4x",
                                    "parent_id": "t1_fcn2o9y",
                                    "score": 1,
                                    "created_utc": 1577804159.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This reminds me of a time a guy offered me a job with similar tasks...I'm pretty sure he was a sex trafficker. So. Glad I got out of that fast.",
            "author": "aherdofdustyturtles",
            "id": "fcmc0q9",
            "parent_id": "t3_ehmo5u",
            "score": 1,
            "created_utc": 1577770043.0,
            "replies": [
                {
                    "body": "All these replies about sex trafficking are making me think I seriously dodged a bullet. Thanks!",
                    "author": "fuzzyfuzzbourne",
                    "id": "fcmnhbs",
                    "parent_id": "t1_fcmc0q9",
                    "score": 2,
                    "created_utc": 1577782938.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fcmipln",
            "parent_id": "t3_ehmo5u",
            "score": 1,
            "created_utc": 1577776878.0,
            "replies": [
                {
                    "body": "Yeah weird af. Thanks!",
                    "author": "fuzzyfuzzbourne",
                    "id": "fcmnggo",
                    "parent_id": "t1_fcmipln",
                    "score": 1,
                    "created_utc": 1577782906.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I want to hug you so hard",
            "author": "sugarintherawr",
            "id": "fcmp9y9",
            "parent_id": "t3_ehmo5u",
            "score": 1,
            "created_utc": 1577785468.0,
            "replies": [
                {
                    "body": "🤗🤗",
                    "author": "fuzzyfuzzbourne",
                    "id": "fcmsbno",
                    "parent_id": "t1_fcmp9y9",
                    "score": 1,
                    "created_utc": 1577789836.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fcn7f3o",
            "parent_id": "t3_ehmo5u",
            "score": 1,
            "created_utc": 1577805222.0,
            "replies": [
                {
                    "body": "I wish I had!! Would have served him right",
                    "author": "fuzzyfuzzbourne",
                    "id": "fcnw31w",
                    "parent_id": "t1_fcn7f3o",
                    "score": 1,
                    "created_utc": 1577819598.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This reminds me of the time a \"SD\" invited me to his home after a successful M&G. I go, we're talking, flirting, his hand on the small of my back as he shows me his beautiful home. We go outside so he can show me additions he's building on the property (mostly to store a small plane) and takes me to an unfinished one. As I'm telling him how impressive it all is, he then tells me he's willing to pay me a whopping $15/hr to finish painting one of his unfinished structures. I was hurt for 0.5 seconds, then laughed and left. There is no shortage of assholes on SA that don't understand what SA is for. Sorry this happened to you.",
            "author": "sugardresden",
            "id": "fcr8fx0",
            "parent_id": "t3_ehmo5u",
            "score": 1,
            "created_utc": 1577898299.0,
            "replies": [
                {
                    "body": "Noooo! He wanted a painter and decorator?! What a lunatic!",
                    "author": "fuzzyfuzzbourne",
                    "id": "fcrt8du",
                    "parent_id": "t1_fcr8fx0",
                    "score": 1,
                    "created_utc": 1577906303.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you want to employ someone you don’t go looking in the bowl.\n\nHate to break it to you, but you were probably lied to and negged. There’s men who make it a contest to see just how far they can make a woman go and this is just that. He’s probably reveling on some forum about how he led you on to spend all this money and fly to London for you to be a fake maid for a fake 10 houses and a fake lifestyle.\n\nSorry about this. I think the biggest lesson to learn is don’t spend money for M&Gs. If he wants you truly he’ll be the one spending. This is why I personally stopped being on SA. The site is full of cheap trash tbh.",
            "author": "JadaNJade",
            "id": "fcla7ue",
            "parent_id": "t3_ehmo5u",
            "score": 0,
            "created_utc": 1577743177.0,
            "replies": [
                {
                    "body": "I’m sure you’re right! In fact I am now done with SA. My lesson is learnt!\n\nOh, luckily I didn’t fly. It was just trains. But with the price of trains in the south of England I could have flown somewhere lol",
                    "author": "fuzzyfuzzbourne",
                    "id": "fcmng16",
                    "parent_id": "t1_fcla7ue",
                    "score": 2,
                    "created_utc": 1577782889.0,
                    "replies": [
                        {
                            "body": "I like sugardaddymeet and just straight up Tinder but watch Tinder. I got banned from there 4 times without any reason and I had no inclination I was looking for money. I emailed them a lot and they just ignore your request for an explanation. If you don't explicitly say you're just a basic girl looking to fuck broke men for free they'll probably kick you.\n\nAshley Madison and a few other sites are known for banning real female accounts so their bots can lure men into spending money. \n\nFreestyling works well if you can blend into professional spaces well. I've turned most of my professors/mentors into SDs at one point or another LOL",
                            "author": "JadaNJade",
                            "id": "fcqyguu",
                            "parent_id": "t1_fcmng16",
                            "score": 1,
                            "created_utc": 1577894106.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seriously strange.\n\nI don't know how bad your illness is, but if you could handle just the managerial part, as he sounded like he more wanted you to be in charge of the maids than to be one yourself, id consider it at least for a while. get management experience on your resume, management experience, involving total control over numerous employees, in different fields, cooking, maids, other stuff, over multi million dollar properties, in several countries, the experience alone lines you up to be a future hotel manager. pLus good pay and a chance to see the world. I wouldn't do it indefinitely, even if 100% healthy, 7 days a week and travel is rough but if you're in charge you can lessen it somewhat through delegation, and when you've had enough just leave with a new list of resume experience and a good bit of pocket change",
            "author": "Mr_Curious_Cat",
            "id": "fckkr0f",
            "parent_id": "t3_ehmo5u",
            "score": -2,
            "created_utc": 1577727466.0,
            "replies": []
        },
        {
            "body": "Soooooo. You live in the age of capitalism, where most are struggling to pay their student loans off, and making money is not for the faint of heart preoccupied with looks. And you expect to meet both a breedable, handsome and rich man and get a life of ease!!! All in one swift move?  Wow. It took me 2 shitty marriages. Almost 14 years of lone toil and no support from anyone, to dominate capitalism. Fortunately I look good and have always looked good whatever my age, and the experience did not ravage me. But the road to wealth is not easy. There is no way I am going to wife up anyone and just hand this to them on a plate. Jesus. Are people this lazy and daft!",
            "author": null,
            "id": "fckpgpf",
            "parent_id": "t3_ehmo5u",
            "score": -6,
            "created_utc": 1577730365.0,
            "replies": [
                {
                    "body": "Did you read my post? Did I ask anyone to marry me? Did I ask anyone to hand me wealth on a plate?",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckqd3q",
                    "parent_id": "t1_fckpgpf",
                    "score": 5,
                    "created_utc": 1577730918.0,
                    "replies": [
                        {
                            "body": "Yep.",
                            "author": null,
                            "id": "fckqou9",
                            "parent_id": "t1_fckqd3q",
                            "score": -2,
                            "created_utc": 1577731117.0,
                            "replies": [
                                {
                                    "body": "Didn’t say i want to get married. Don’t want to be handed wealth for nothing (if a guy is getting my time, my body and my exclusivity, he can compensate me for it). Don’t want a ‘breedable’ man. \n\nI know it’s painful, but relationships in which men give women money in turn for intimacy have been going on since time immemorial. You can angst about it and troll sugar forums all you like but the sugar babies getting allowances and the escorts making 4 figures a night are still going carry right on doing it. Just unlucky you were born male and have to fight to dominate capitalism instead of just luring capitalism into bed for half an hour!",
                                    "author": "fuzzyfuzzbourne",
                                    "id": "fckrgv0",
                                    "parent_id": "t1_fckqou9",
                                    "score": 7,
                                    "created_utc": 1577731599.0,
                                    "replies": [
                                        {
                                            "body": "Mate. You and I both know you want your cake and to eat it. Welcome to reality.",
                                            "author": null,
                                            "id": "fckrl87",
                                            "parent_id": "t1_fckrgv0",
                                            "score": -2,
                                            "created_utc": 1577731673.0,
                                            "replies": [
                                                {
                                                    "body": "If being financially compensated for my body, my time, and my exclusivity is having my cake and eating it, yes, that’s right!",
                                                    "author": "fuzzyfuzzbourne",
                                                    "id": "fckrpsk",
                                                    "parent_id": "t1_fckrl87",
                                                    "score": 5,
                                                    "created_utc": 1577731751.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "fcksxl2",
                                                            "parent_id": "t1_fckrpsk",
                                                            "score": 5,
                                                            "created_utc": 1577732496.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Thanks for the heads-up. I’ll stop wasting my pearls of wisdom on him now",
                                                                    "author": "fuzzyfuzzbourne",
                                                                    "id": "fcktfqe",
                                                                    "parent_id": "t1_fcksxl2",
                                                                    "score": 4,
                                                                    "created_utc": 1577732809.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Then be realistic. That's all I am saying.",
                                                            "author": null,
                                                            "id": "fckrs3r",
                                                            "parent_id": "t1_fckrpsk",
                                                            "score": 0,
                                                            "created_utc": 1577731790.0,
                                                            "replies": [
                                                                {
                                                                    "body": "What is unrealistic about looking for a sugar relationship and feeling bemused when I’m offered a position as a maid? He got me up there on false pretences. If it had been a simple m&g in which we hadn’t clicked, this post wouldn’t exist. I have never asked money for a m&g. I’m just pissed that I spent cash on something that could have been avoided if the guy had been honest about what he was looking for in the first place. \n\nImagine if a girl messages you for two months about all the hot sex you could have with her, and when you finally meet her she says she wants a strictly platonic arrangement. You’d be pretty annoyed",
                                                                    "author": "fuzzyfuzzbourne",
                                                                    "id": "fcks91x",
                                                                    "parent_id": "t1_fckrs3r",
                                                                    "score": 1,
                                                                    "created_utc": 1577732079.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "You are in a business. Selling your body to access wealth. And I mean that as in sugar dating. Nothing else. Study your market demographics and be honest to yourself.",
                                                                            "author": null,
                                                                            "id": "fcksflb",
                                                                            "parent_id": "t1_fcks91x",
                                                                            "score": 0,
                                                                            "created_utc": 1577732190.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Yeah. My business is that I’m selling my ass. I go to the job to sell my ass and the guy tells me he doesn’t want my ass, he wants a maid. \n\nIt’s like someone ordering 10 kilos of cheese from a dairy 2 months in advance. I’m the cheesemaker. They spend 2 months telling me how much they’re looking forward to sampling my cheddar. I go to deliver the cheese and when I get there they tell me they actually want tofu. Now I’m an angry cheesemaker, I conserved my stock of cheeses and made the journey to deliver them for nothing. \n\nI have every right to be pissed off about bring misled. You being bitter over the fact that you can’t get free poon has nothing to do with my predicament",
                                                                                    "author": "fuzzyfuzzbourne",
                                                                                    "id": "fcktbvc",
                                                                                    "parent_id": "t1_fcksflb",
                                                                                    "score": 5,
                                                                                    "created_utc": 1577732742.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "You have every right to learn the hard way. Gotta dash. Being rich takes effort. Later.",
                                                                                            "author": null,
                                                                                            "id": "fcktwao",
                                                                                            "parent_id": "t1_fcktbvc",
                                                                                            "score": 0,
                                                                                            "created_utc": 1577733093.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Ok, you just run along and go dominate that capitalism! After all, how else are you going to be able to afford to get laid?",
                                                                                                    "author": "fuzzyfuzzbourne",
                                                                                                    "id": "fckub5r",
                                                                                                    "parent_id": "t1_fcktwao",
                                                                                                    "score": 6,
                                                                                                    "created_utc": 1577733349.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Indeed, I think you’re right!!",
            "author": "fuzzyfuzzbourne",
            "id": "fckmj39",
            "parent_id": "t1_fck4lgf",
            "score": 12,
            "created_utc": 1577728563.0,
            "replies": []
        },
        {
            "body": "She needs to copyright the story .........   made for TV",
            "author": "pinotandsugar",
            "id": "fcm4oz8",
            "parent_id": "t1_fck4lgf",
            "score": 4,
            "created_utc": 1577764166.0,
            "replies": []
        },
        {
            "body": "Agree.  We're out here.  Dont give up because of idiots like this guy.",
            "author": "Life_b_beautiful",
            "id": "fck93tk",
            "parent_id": "t1_fck5jwp",
            "score": 9,
            "created_utc": 1577719911.0,
            "replies": []
        },
        {
            "body": "Thanks for the reassurance :)",
            "author": "fuzzyfuzzbourne",
            "id": "fckmkm8",
            "parent_id": "t1_fck5jwp",
            "score": 3,
            "created_utc": 1577728588.0,
            "replies": []
        },
        {
            "body": "His excuse was ‘I’m only in the uk for 2 days in December, after which I’ll be in Japan...’ should have known it was fishy.",
            "author": "fuzzyfuzzbourne",
            "id": "fckmnhl",
            "parent_id": "t1_fck86nf",
            "score": 11,
            "created_utc": 1577728636.0,
            "replies": [
                {
                    "body": "Yep-needed to get laid asap, never to be seen again.",
                    "author": "GSSD",
                    "id": "fcknx5u",
                    "parent_id": "t1_fckmnhl",
                    "score": 2,
                    "created_utc": 1577729416.0,
                    "replies": [
                        {
                            "body": "The weird thing is, he said he absolutely wasn’t interested in me sexually. Didn’t try to coerce me,  get me to come to his hotel room, nothing. I mean, I liked him to start with, if he’d suggested doing a one-off PPM I wouldn’t have been so annoyed - as long as he handed over the gift before we got down to business.",
                            "author": "fuzzyfuzzbourne",
                            "id": "fckyu9m",
                            "parent_id": "t1_fcknx5u",
                            "score": 7,
                            "created_utc": 1577736126.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s not even courtship",
            "author": "Lilipuss25",
            "id": "fcnox9f",
            "parent_id": "t1_fck86nf",
            "score": 1,
            "created_utc": 1577815650.0,
            "replies": []
        },
        {
            "body": "Glad I’m not alone in thinking he’s a lunatic! Thanks for the sympathy",
            "author": "fuzzyfuzzbourne",
            "id": "fckmpmq",
            "parent_id": "t1_fck5an1",
            "score": 3,
            "created_utc": 1577728671.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fckf18m",
            "parent_id": "t1_fck5omp",
            "score": 8,
            "created_utc": 1577723872.0,
            "replies": [
                {
                    "body": "It baffles me too... at least there are some good guys out there",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckmua5",
                    "parent_id": "t1_fckf18m",
                    "score": 3,
                    "created_utc": 1577728748.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep. Lesson learnt. I won’t ever be doing that again!!",
            "author": "fuzzyfuzzbourne",
            "id": "fckmryp",
            "parent_id": "t1_fck5omp",
            "score": 3,
            "created_utc": 1577728710.0,
            "replies": [
                {
                    "body": "Yeah, I’m sorry you went through that. There are good guys out there, it just takes a ton of time, screening and patience. :)",
                    "author": "scorpiogirl26",
                    "id": "fckn4sh",
                    "parent_id": "t1_fckmryp",
                    "score": 2,
                    "created_utc": 1577728924.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The sex trafficking thing is something I didn’t even think about! Good thing I got out of there quick...",
            "author": "fuzzyfuzzbourne",
            "id": "fckmy2y",
            "parent_id": "t1_fck9hvo",
            "score": 9,
            "created_utc": 1577728811.0,
            "replies": []
        },
        {
            "body": "I’m glad he didn’t string you out for long, and I’m glad you told him where he could stick his software!!",
            "author": "fuzzyfuzzbourne",
            "id": "fckn7ph",
            "parent_id": "t1_fckjje7",
            "score": 1,
            "created_utc": 1577728974.0,
            "replies": []
        },
        {
            "body": "That’s a great idea. I don’t have an SA profile any more but I think I will make one again just so I can  report him!",
            "author": "fuzzyfuzzbourne",
            "id": "fcknpae",
            "parent_id": "t1_fckgdnp",
            "score": 2,
            "created_utc": 1577729279.0,
            "replies": []
        },
        {
            "body": "Yeah... I guess I’m still in time to send him the bill! Not that it’ll do much good I guess",
            "author": "fuzzyfuzzbourne",
            "id": "fckn0z8",
            "parent_id": "t1_fckbz2u",
            "score": 3,
            "created_utc": 1577728860.0,
            "replies": []
        },
        {
            "body": "I’m sure you’re right. Seemed like a very convoluted way to find someone to employ!",
            "author": "fuzzyfuzzbourne",
            "id": "fckn3d4",
            "parent_id": "t1_fckdeyv",
            "score": 3,
            "created_utc": 1577728901.0,
            "replies": []
        },
        {
            "body": "Agreed! Something to keep in mind from now on...",
            "author": "fuzzyfuzzbourne",
            "id": "fcknqih",
            "parent_id": "t1_fckggo1",
            "score": 1,
            "created_utc": 1577729301.0,
            "replies": [
                {
                    "body": "I have a one week rule... maybe a little longer over the holidays or if there is a reason.  My best arrangement have all moved quickly.  Meet within a few days then second date shortly after.",
                    "author": "LotBuilder",
                    "id": "fcko1y0",
                    "parent_id": "t1_fcknqih",
                    "score": 2,
                    "created_utc": 1577729500.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep. Honestly it wasn’t THAT expensive (on the whole I spent around 120 pounds between room, travel and meals) but since I became ill I’ve been living on my savings and on the little bit of money I get from the government as a registered carer for my grandmother, so obviously parting with that much cash for a not-sure thing was a dumb choice. I might send him an invoice for it all (with a heavy extra charge for all the emotional labour...) not that he’ll pay it!",
            "author": "fuzzyfuzzbourne",
            "id": "fcko740",
            "parent_id": "t1_fck5fgz",
            "score": 3,
            "created_utc": 1577729587.0,
            "replies": []
        },
        {
            "body": "Thank you for the advice and the sympathy 💜",
            "author": "fuzzyfuzzbourne",
            "id": "fckthxj",
            "parent_id": "t1_fckt13y",
            "score": 1,
            "created_utc": 1577732846.0,
            "replies": []
        },
        {
            "body": "Thanks for the sympathy!",
            "author": "fuzzyfuzzbourne",
            "id": "fckmz13",
            "parent_id": "t1_fck8jnw",
            "score": 1,
            "created_utc": 1577728827.0,
            "replies": []
        },
        {
            "body": "I worked full time until I became ill last year so I have some savings. I also get 60 pounds a week from the government as I am a registered carer for my grandmother (though tbh she’s in better shape than I am). The London trip was not so expensive, but obviously due to my financial situation parting with any kind of money is painful!",
            "author": "fuzzyfuzzbourne",
            "id": "fcknlqx",
            "parent_id": "t1_fckdnka",
            "score": 2,
            "created_utc": 1577729216.0,
            "replies": []
        },
        {
            "body": "Agreed!",
            "author": "fuzzyfuzzbourne",
            "id": "fckvz3a",
            "parent_id": "t1_fckseyl",
            "score": 2,
            "created_utc": 1577734375.0,
            "replies": []
        },
        {
            "body": "Thanks! Honestly when he sent me ‘Rebecca’ alarm bells went off, but I stupidly ignored them...",
            "author": "fuzzyfuzzbourne",
            "id": "fckyxjq",
            "parent_id": "t1_fcky50r",
            "score": 2,
            "created_utc": 1577736183.0,
            "replies": [
                {
                    "body": "Damn gothic romances, getting our hopes up about ball gowns and seaside mansions.",
                    "author": "ThePrettyLovely",
                    "id": "fckz7yt",
                    "parent_id": "t1_fckyxjq",
                    "score": 3,
                    "created_utc": 1577736361.0,
                    "replies": [
                        {
                            "body": "I know right. When he said to me, “I want you to be like a Mrs. Danvers to me,” I replied, “So you want me to hate your guts and... set fire to your house?”",
                            "author": "fuzzyfuzzbourne",
                            "id": "fckzla9",
                            "parent_id": "t1_fckz7yt",
                            "score": 2,
                            "created_utc": 1577736588.0,
                            "replies": [
                                {
                                    "body": "🤣",
                                    "author": "Fizzledy01",
                                    "id": "fd2o20b",
                                    "parent_id": "t1_fckzla9",
                                    "score": 2,
                                    "created_utc": 1578149954.0,
                                    "replies": []
                                },
                                {
                                    "body": "😂😂😂😂😂\n\n\"Buddy, I am way ahead of you.\"",
                                    "author": "ThePrettyLovely",
                                    "id": "fckzqct",
                                    "parent_id": "t1_fckzla9",
                                    "score": 1,
                                    "created_utc": 1577736674.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m almost wishing I made a big scene in the lobby to guilt him into coughing up my train fare! Thanks.",
            "author": "fuzzyfuzzbourne",
            "id": "fcmnjhp",
            "parent_id": "t1_fcl6zi7",
            "score": 2,
            "created_utc": 1577783019.0,
            "replies": []
        },
        {
            "body": "His excuse was that he wouldn’t be in the UK til the 26th... and I’d never ask for money just for talking. But yes, you’re right, I should have been more suspicious.",
            "author": "fuzzyfuzzbourne",
            "id": "fcmtuuf",
            "parent_id": "t1_fcmtpcw",
            "score": 1,
            "created_utc": 1577791996.0,
            "replies": [
                {
                    "body": "His excuse is lame.  He got a free chat buddy.  You shouldn't have to ask for money if he is the one dragging things out over a \"couple month conversation\".  I would just have lost interest if he never tried helping out.",
                    "author": "mike_o212",
                    "id": "fcmufk9",
                    "parent_id": "t1_fcmtuuf",
                    "score": 2,
                    "created_utc": 1577792790.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I hope so! Thanks for the reply",
            "author": "fuzzyfuzzbourne",
            "id": "fckn9n4",
            "parent_id": "t1_fck7kzt",
            "score": 1,
            "created_utc": 1577729008.0,
            "replies": []
        },
        {
            "body": "That’s a good rule. I’ll have to do the same in the future. His excuse for dragging things out was that he wouldn’t be in the country for a couple of months... I’ll be wiser next time!",
            "author": "fuzzyfuzzbourne",
            "id": "fckne4d",
            "parent_id": "t1_fckdn3x",
            "score": 1,
            "created_utc": 1577729086.0,
            "replies": []
        },
        {
            "body": "Thank you!",
            "author": "fuzzyfuzzbourne",
            "id": "fcknm6m",
            "parent_id": "t1_fckei32",
            "score": 1,
            "created_utc": 1577729224.0,
            "replies": []
        },
        {
            "body": "Thank you for your sympathy. Just gotta be careful of the bad guys out there I guess...",
            "author": "fuzzyfuzzbourne",
            "id": "fckns5x",
            "parent_id": "t1_fckh3h8",
            "score": 1,
            "created_utc": 1577729330.0,
            "replies": []
        },
        {
            "body": "Yeah :( lesson learnt I guess!",
            "author": "fuzzyfuzzbourne",
            "id": "fcmnln1",
            "parent_id": "t1_fclkiej",
            "score": 1,
            "created_utc": 1577783104.0,
            "replies": []
        },
        {
            "body": "But we conversed for two months about him wanting a sugar baby and me wanting a sugar daddy? \n\nLiterally the first thing I asked was, ‘these (xyz) are my expectations from a sugar relationships, is that the kind of thing you’re looking for and do you think I’m the right person for that kind of relationship with you?’ His response was ‘yes!’ \n\nMy fault lies in the fact that I spent money on a meet and greet, not the fact that I was lied to.",
            "author": "fuzzyfuzzbourne",
            "id": "fcmnbbv",
            "parent_id": "t1_fcln7zl",
            "score": 1,
            "created_utc": 1577782707.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fcn2o9y",
                    "parent_id": "t1_fcmnbbv",
                    "score": 1,
                    "created_utc": 1577801574.0,
                    "replies": [
                        {
                            "body": "Yep. Video chat, phone calls, did them all. After our meeting I went back and read through all our messages to try and understand if he’d given me hints and I had missed them. But throughout the conversation he made it clear he was definitely looking for a sugar baby. One thing I thought of was that maybe he found another girl he liked more at the last minute but wanted to keep me on the back burner in case it didn’t work out with her - but even that seems far-fetched. \nThe whole experience was just really weird...",
                            "author": "fuzzyfuzzbourne",
                            "id": "fcn5z4x",
                            "parent_id": "t1_fcn2o9y",
                            "score": 1,
                            "created_utc": 1577804159.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "All these replies about sex trafficking are making me think I seriously dodged a bullet. Thanks!",
            "author": "fuzzyfuzzbourne",
            "id": "fcmnhbs",
            "parent_id": "t1_fcmc0q9",
            "score": 2,
            "created_utc": 1577782938.0,
            "replies": []
        },
        {
            "body": "Yeah weird af. Thanks!",
            "author": "fuzzyfuzzbourne",
            "id": "fcmnggo",
            "parent_id": "t1_fcmipln",
            "score": 1,
            "created_utc": 1577782906.0,
            "replies": []
        },
        {
            "body": "🤗🤗",
            "author": "fuzzyfuzzbourne",
            "id": "fcmsbno",
            "parent_id": "t1_fcmp9y9",
            "score": 1,
            "created_utc": 1577789836.0,
            "replies": []
        },
        {
            "body": "I wish I had!! Would have served him right",
            "author": "fuzzyfuzzbourne",
            "id": "fcnw31w",
            "parent_id": "t1_fcn7f3o",
            "score": 1,
            "created_utc": 1577819598.0,
            "replies": []
        },
        {
            "body": "Noooo! He wanted a painter and decorator?! What a lunatic!",
            "author": "fuzzyfuzzbourne",
            "id": "fcrt8du",
            "parent_id": "t1_fcr8fx0",
            "score": 1,
            "created_utc": 1577906303.0,
            "replies": []
        },
        {
            "body": "I’m sure you’re right! In fact I am now done with SA. My lesson is learnt!\n\nOh, luckily I didn’t fly. It was just trains. But with the price of trains in the south of England I could have flown somewhere lol",
            "author": "fuzzyfuzzbourne",
            "id": "fcmng16",
            "parent_id": "t1_fcla7ue",
            "score": 2,
            "created_utc": 1577782889.0,
            "replies": [
                {
                    "body": "I like sugardaddymeet and just straight up Tinder but watch Tinder. I got banned from there 4 times without any reason and I had no inclination I was looking for money. I emailed them a lot and they just ignore your request for an explanation. If you don't explicitly say you're just a basic girl looking to fuck broke men for free they'll probably kick you.\n\nAshley Madison and a few other sites are known for banning real female accounts so their bots can lure men into spending money. \n\nFreestyling works well if you can blend into professional spaces well. I've turned most of my professors/mentors into SDs at one point or another LOL",
                    "author": "JadaNJade",
                    "id": "fcqyguu",
                    "parent_id": "t1_fcmng16",
                    "score": 1,
                    "created_utc": 1577894106.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Did you read my post? Did I ask anyone to marry me? Did I ask anyone to hand me wealth on a plate?",
            "author": "fuzzyfuzzbourne",
            "id": "fckqd3q",
            "parent_id": "t1_fckpgpf",
            "score": 5,
            "created_utc": 1577730918.0,
            "replies": [
                {
                    "body": "Yep.",
                    "author": null,
                    "id": "fckqou9",
                    "parent_id": "t1_fckqd3q",
                    "score": -2,
                    "created_utc": 1577731117.0,
                    "replies": [
                        {
                            "body": "Didn’t say i want to get married. Don’t want to be handed wealth for nothing (if a guy is getting my time, my body and my exclusivity, he can compensate me for it). Don’t want a ‘breedable’ man. \n\nI know it’s painful, but relationships in which men give women money in turn for intimacy have been going on since time immemorial. You can angst about it and troll sugar forums all you like but the sugar babies getting allowances and the escorts making 4 figures a night are still going carry right on doing it. Just unlucky you were born male and have to fight to dominate capitalism instead of just luring capitalism into bed for half an hour!",
                            "author": "fuzzyfuzzbourne",
                            "id": "fckrgv0",
                            "parent_id": "t1_fckqou9",
                            "score": 7,
                            "created_utc": 1577731599.0,
                            "replies": [
                                {
                                    "body": "Mate. You and I both know you want your cake and to eat it. Welcome to reality.",
                                    "author": null,
                                    "id": "fckrl87",
                                    "parent_id": "t1_fckrgv0",
                                    "score": -2,
                                    "created_utc": 1577731673.0,
                                    "replies": [
                                        {
                                            "body": "If being financially compensated for my body, my time, and my exclusivity is having my cake and eating it, yes, that’s right!",
                                            "author": "fuzzyfuzzbourne",
                                            "id": "fckrpsk",
                                            "parent_id": "t1_fckrl87",
                                            "score": 5,
                                            "created_utc": 1577731751.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fcksxl2",
                                                    "parent_id": "t1_fckrpsk",
                                                    "score": 5,
                                                    "created_utc": 1577732496.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thanks for the heads-up. I’ll stop wasting my pearls of wisdom on him now",
                                                            "author": "fuzzyfuzzbourne",
                                                            "id": "fcktfqe",
                                                            "parent_id": "t1_fcksxl2",
                                                            "score": 4,
                                                            "created_utc": 1577732809.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Then be realistic. That's all I am saying.",
                                                    "author": null,
                                                    "id": "fckrs3r",
                                                    "parent_id": "t1_fckrpsk",
                                                    "score": 0,
                                                    "created_utc": 1577731790.0,
                                                    "replies": [
                                                        {
                                                            "body": "What is unrealistic about looking for a sugar relationship and feeling bemused when I’m offered a position as a maid? He got me up there on false pretences. If it had been a simple m&g in which we hadn’t clicked, this post wouldn’t exist. I have never asked money for a m&g. I’m just pissed that I spent cash on something that could have been avoided if the guy had been honest about what he was looking for in the first place. \n\nImagine if a girl messages you for two months about all the hot sex you could have with her, and when you finally meet her she says she wants a strictly platonic arrangement. You’d be pretty annoyed",
                                                            "author": "fuzzyfuzzbourne",
                                                            "id": "fcks91x",
                                                            "parent_id": "t1_fckrs3r",
                                                            "score": 1,
                                                            "created_utc": 1577732079.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You are in a business. Selling your body to access wealth. And I mean that as in sugar dating. Nothing else. Study your market demographics and be honest to yourself.",
                                                                    "author": null,
                                                                    "id": "fcksflb",
                                                                    "parent_id": "t1_fcks91x",
                                                                    "score": 0,
                                                                    "created_utc": 1577732190.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yeah. My business is that I’m selling my ass. I go to the job to sell my ass and the guy tells me he doesn’t want my ass, he wants a maid. \n\nIt’s like someone ordering 10 kilos of cheese from a dairy 2 months in advance. I’m the cheesemaker. They spend 2 months telling me how much they’re looking forward to sampling my cheddar. I go to deliver the cheese and when I get there they tell me they actually want tofu. Now I’m an angry cheesemaker, I conserved my stock of cheeses and made the journey to deliver them for nothing. \n\nI have every right to be pissed off about bring misled. You being bitter over the fact that you can’t get free poon has nothing to do with my predicament",
                                                                            "author": "fuzzyfuzzbourne",
                                                                            "id": "fcktbvc",
                                                                            "parent_id": "t1_fcksflb",
                                                                            "score": 5,
                                                                            "created_utc": 1577732742.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "You have every right to learn the hard way. Gotta dash. Being rich takes effort. Later.",
                                                                                    "author": null,
                                                                                    "id": "fcktwao",
                                                                                    "parent_id": "t1_fcktbvc",
                                                                                    "score": 0,
                                                                                    "created_utc": 1577733093.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Ok, you just run along and go dominate that capitalism! After all, how else are you going to be able to afford to get laid?",
                                                                                            "author": "fuzzyfuzzbourne",
                                                                                            "id": "fckub5r",
                                                                                            "parent_id": "t1_fcktwao",
                                                                                            "score": 6,
                                                                                            "created_utc": 1577733349.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yep-needed to get laid asap, never to be seen again.",
            "author": "GSSD",
            "id": "fcknx5u",
            "parent_id": "t1_fckmnhl",
            "score": 2,
            "created_utc": 1577729416.0,
            "replies": [
                {
                    "body": "The weird thing is, he said he absolutely wasn’t interested in me sexually. Didn’t try to coerce me,  get me to come to his hotel room, nothing. I mean, I liked him to start with, if he’d suggested doing a one-off PPM I wouldn’t have been so annoyed - as long as he handed over the gift before we got down to business.",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckyu9m",
                    "parent_id": "t1_fcknx5u",
                    "score": 7,
                    "created_utc": 1577736126.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It baffles me too... at least there are some good guys out there",
            "author": "fuzzyfuzzbourne",
            "id": "fckmua5",
            "parent_id": "t1_fckf18m",
            "score": 3,
            "created_utc": 1577728748.0,
            "replies": []
        },
        {
            "body": "Yeah, I’m sorry you went through that. There are good guys out there, it just takes a ton of time, screening and patience. :)",
            "author": "scorpiogirl26",
            "id": "fckn4sh",
            "parent_id": "t1_fckmryp",
            "score": 2,
            "created_utc": 1577728924.0,
            "replies": []
        },
        {
            "body": "I have a one week rule... maybe a little longer over the holidays or if there is a reason.  My best arrangement have all moved quickly.  Meet within a few days then second date shortly after.",
            "author": "LotBuilder",
            "id": "fcko1y0",
            "parent_id": "t1_fcknqih",
            "score": 2,
            "created_utc": 1577729500.0,
            "replies": []
        },
        {
            "body": "Damn gothic romances, getting our hopes up about ball gowns and seaside mansions.",
            "author": "ThePrettyLovely",
            "id": "fckz7yt",
            "parent_id": "t1_fckyxjq",
            "score": 3,
            "created_utc": 1577736361.0,
            "replies": [
                {
                    "body": "I know right. When he said to me, “I want you to be like a Mrs. Danvers to me,” I replied, “So you want me to hate your guts and... set fire to your house?”",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckzla9",
                    "parent_id": "t1_fckz7yt",
                    "score": 2,
                    "created_utc": 1577736588.0,
                    "replies": [
                        {
                            "body": "🤣",
                            "author": "Fizzledy01",
                            "id": "fd2o20b",
                            "parent_id": "t1_fckzla9",
                            "score": 2,
                            "created_utc": 1578149954.0,
                            "replies": []
                        },
                        {
                            "body": "😂😂😂😂😂\n\n\"Buddy, I am way ahead of you.\"",
                            "author": "ThePrettyLovely",
                            "id": "fckzqct",
                            "parent_id": "t1_fckzla9",
                            "score": 1,
                            "created_utc": 1577736674.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "His excuse is lame.  He got a free chat buddy.  You shouldn't have to ask for money if he is the one dragging things out over a \"couple month conversation\".  I would just have lost interest if he never tried helping out.",
            "author": "mike_o212",
            "id": "fcmufk9",
            "parent_id": "t1_fcmtuuf",
            "score": 2,
            "created_utc": 1577792790.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fcn2o9y",
            "parent_id": "t1_fcmnbbv",
            "score": 1,
            "created_utc": 1577801574.0,
            "replies": [
                {
                    "body": "Yep. Video chat, phone calls, did them all. After our meeting I went back and read through all our messages to try and understand if he’d given me hints and I had missed them. But throughout the conversation he made it clear he was definitely looking for a sugar baby. One thing I thought of was that maybe he found another girl he liked more at the last minute but wanted to keep me on the back burner in case it didn’t work out with her - but even that seems far-fetched. \nThe whole experience was just really weird...",
                    "author": "fuzzyfuzzbourne",
                    "id": "fcn5z4x",
                    "parent_id": "t1_fcn2o9y",
                    "score": 1,
                    "created_utc": 1577804159.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I like sugardaddymeet and just straight up Tinder but watch Tinder. I got banned from there 4 times without any reason and I had no inclination I was looking for money. I emailed them a lot and they just ignore your request for an explanation. If you don't explicitly say you're just a basic girl looking to fuck broke men for free they'll probably kick you.\n\nAshley Madison and a few other sites are known for banning real female accounts so their bots can lure men into spending money. \n\nFreestyling works well if you can blend into professional spaces well. I've turned most of my professors/mentors into SDs at one point or another LOL",
            "author": "JadaNJade",
            "id": "fcqyguu",
            "parent_id": "t1_fcmng16",
            "score": 1,
            "created_utc": 1577894106.0,
            "replies": []
        },
        {
            "body": "Yep.",
            "author": null,
            "id": "fckqou9",
            "parent_id": "t1_fckqd3q",
            "score": -2,
            "created_utc": 1577731117.0,
            "replies": [
                {
                    "body": "Didn’t say i want to get married. Don’t want to be handed wealth for nothing (if a guy is getting my time, my body and my exclusivity, he can compensate me for it). Don’t want a ‘breedable’ man. \n\nI know it’s painful, but relationships in which men give women money in turn for intimacy have been going on since time immemorial. You can angst about it and troll sugar forums all you like but the sugar babies getting allowances and the escorts making 4 figures a night are still going carry right on doing it. Just unlucky you were born male and have to fight to dominate capitalism instead of just luring capitalism into bed for half an hour!",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckrgv0",
                    "parent_id": "t1_fckqou9",
                    "score": 7,
                    "created_utc": 1577731599.0,
                    "replies": [
                        {
                            "body": "Mate. You and I both know you want your cake and to eat it. Welcome to reality.",
                            "author": null,
                            "id": "fckrl87",
                            "parent_id": "t1_fckrgv0",
                            "score": -2,
                            "created_utc": 1577731673.0,
                            "replies": [
                                {
                                    "body": "If being financially compensated for my body, my time, and my exclusivity is having my cake and eating it, yes, that’s right!",
                                    "author": "fuzzyfuzzbourne",
                                    "id": "fckrpsk",
                                    "parent_id": "t1_fckrl87",
                                    "score": 5,
                                    "created_utc": 1577731751.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fcksxl2",
                                            "parent_id": "t1_fckrpsk",
                                            "score": 5,
                                            "created_utc": 1577732496.0,
                                            "replies": [
                                                {
                                                    "body": "Thanks for the heads-up. I’ll stop wasting my pearls of wisdom on him now",
                                                    "author": "fuzzyfuzzbourne",
                                                    "id": "fcktfqe",
                                                    "parent_id": "t1_fcksxl2",
                                                    "score": 4,
                                                    "created_utc": 1577732809.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Then be realistic. That's all I am saying.",
                                            "author": null,
                                            "id": "fckrs3r",
                                            "parent_id": "t1_fckrpsk",
                                            "score": 0,
                                            "created_utc": 1577731790.0,
                                            "replies": [
                                                {
                                                    "body": "What is unrealistic about looking for a sugar relationship and feeling bemused when I’m offered a position as a maid? He got me up there on false pretences. If it had been a simple m&g in which we hadn’t clicked, this post wouldn’t exist. I have never asked money for a m&g. I’m just pissed that I spent cash on something that could have been avoided if the guy had been honest about what he was looking for in the first place. \n\nImagine if a girl messages you for two months about all the hot sex you could have with her, and when you finally meet her she says she wants a strictly platonic arrangement. You’d be pretty annoyed",
                                                    "author": "fuzzyfuzzbourne",
                                                    "id": "fcks91x",
                                                    "parent_id": "t1_fckrs3r",
                                                    "score": 1,
                                                    "created_utc": 1577732079.0,
                                                    "replies": [
                                                        {
                                                            "body": "You are in a business. Selling your body to access wealth. And I mean that as in sugar dating. Nothing else. Study your market demographics and be honest to yourself.",
                                                            "author": null,
                                                            "id": "fcksflb",
                                                            "parent_id": "t1_fcks91x",
                                                            "score": 0,
                                                            "created_utc": 1577732190.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah. My business is that I’m selling my ass. I go to the job to sell my ass and the guy tells me he doesn’t want my ass, he wants a maid. \n\nIt’s like someone ordering 10 kilos of cheese from a dairy 2 months in advance. I’m the cheesemaker. They spend 2 months telling me how much they’re looking forward to sampling my cheddar. I go to deliver the cheese and when I get there they tell me they actually want tofu. Now I’m an angry cheesemaker, I conserved my stock of cheeses and made the journey to deliver them for nothing. \n\nI have every right to be pissed off about bring misled. You being bitter over the fact that you can’t get free poon has nothing to do with my predicament",
                                                                    "author": "fuzzyfuzzbourne",
                                                                    "id": "fcktbvc",
                                                                    "parent_id": "t1_fcksflb",
                                                                    "score": 5,
                                                                    "created_utc": 1577732742.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "You have every right to learn the hard way. Gotta dash. Being rich takes effort. Later.",
                                                                            "author": null,
                                                                            "id": "fcktwao",
                                                                            "parent_id": "t1_fcktbvc",
                                                                            "score": 0,
                                                                            "created_utc": 1577733093.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Ok, you just run along and go dominate that capitalism! After all, how else are you going to be able to afford to get laid?",
                                                                                    "author": "fuzzyfuzzbourne",
                                                                                    "id": "fckub5r",
                                                                                    "parent_id": "t1_fcktwao",
                                                                                    "score": 6,
                                                                                    "created_utc": 1577733349.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The weird thing is, he said he absolutely wasn’t interested in me sexually. Didn’t try to coerce me,  get me to come to his hotel room, nothing. I mean, I liked him to start with, if he’d suggested doing a one-off PPM I wouldn’t have been so annoyed - as long as he handed over the gift before we got down to business.",
            "author": "fuzzyfuzzbourne",
            "id": "fckyu9m",
            "parent_id": "t1_fcknx5u",
            "score": 7,
            "created_utc": 1577736126.0,
            "replies": []
        },
        {
            "body": "I know right. When he said to me, “I want you to be like a Mrs. Danvers to me,” I replied, “So you want me to hate your guts and... set fire to your house?”",
            "author": "fuzzyfuzzbourne",
            "id": "fckzla9",
            "parent_id": "t1_fckz7yt",
            "score": 2,
            "created_utc": 1577736588.0,
            "replies": [
                {
                    "body": "🤣",
                    "author": "Fizzledy01",
                    "id": "fd2o20b",
                    "parent_id": "t1_fckzla9",
                    "score": 2,
                    "created_utc": 1578149954.0,
                    "replies": []
                },
                {
                    "body": "😂😂😂😂😂\n\n\"Buddy, I am way ahead of you.\"",
                    "author": "ThePrettyLovely",
                    "id": "fckzqct",
                    "parent_id": "t1_fckzla9",
                    "score": 1,
                    "created_utc": 1577736674.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep. Video chat, phone calls, did them all. After our meeting I went back and read through all our messages to try and understand if he’d given me hints and I had missed them. But throughout the conversation he made it clear he was definitely looking for a sugar baby. One thing I thought of was that maybe he found another girl he liked more at the last minute but wanted to keep me on the back burner in case it didn’t work out with her - but even that seems far-fetched. \nThe whole experience was just really weird...",
            "author": "fuzzyfuzzbourne",
            "id": "fcn5z4x",
            "parent_id": "t1_fcn2o9y",
            "score": 1,
            "created_utc": 1577804159.0,
            "replies": []
        },
        {
            "body": "Didn’t say i want to get married. Don’t want to be handed wealth for nothing (if a guy is getting my time, my body and my exclusivity, he can compensate me for it). Don’t want a ‘breedable’ man. \n\nI know it’s painful, but relationships in which men give women money in turn for intimacy have been going on since time immemorial. You can angst about it and troll sugar forums all you like but the sugar babies getting allowances and the escorts making 4 figures a night are still going carry right on doing it. Just unlucky you were born male and have to fight to dominate capitalism instead of just luring capitalism into bed for half an hour!",
            "author": "fuzzyfuzzbourne",
            "id": "fckrgv0",
            "parent_id": "t1_fckqou9",
            "score": 7,
            "created_utc": 1577731599.0,
            "replies": [
                {
                    "body": "Mate. You and I both know you want your cake and to eat it. Welcome to reality.",
                    "author": null,
                    "id": "fckrl87",
                    "parent_id": "t1_fckrgv0",
                    "score": -2,
                    "created_utc": 1577731673.0,
                    "replies": [
                        {
                            "body": "If being financially compensated for my body, my time, and my exclusivity is having my cake and eating it, yes, that’s right!",
                            "author": "fuzzyfuzzbourne",
                            "id": "fckrpsk",
                            "parent_id": "t1_fckrl87",
                            "score": 5,
                            "created_utc": 1577731751.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fcksxl2",
                                    "parent_id": "t1_fckrpsk",
                                    "score": 5,
                                    "created_utc": 1577732496.0,
                                    "replies": [
                                        {
                                            "body": "Thanks for the heads-up. I’ll stop wasting my pearls of wisdom on him now",
                                            "author": "fuzzyfuzzbourne",
                                            "id": "fcktfqe",
                                            "parent_id": "t1_fcksxl2",
                                            "score": 4,
                                            "created_utc": 1577732809.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Then be realistic. That's all I am saying.",
                                    "author": null,
                                    "id": "fckrs3r",
                                    "parent_id": "t1_fckrpsk",
                                    "score": 0,
                                    "created_utc": 1577731790.0,
                                    "replies": [
                                        {
                                            "body": "What is unrealistic about looking for a sugar relationship and feeling bemused when I’m offered a position as a maid? He got me up there on false pretences. If it had been a simple m&g in which we hadn’t clicked, this post wouldn’t exist. I have never asked money for a m&g. I’m just pissed that I spent cash on something that could have been avoided if the guy had been honest about what he was looking for in the first place. \n\nImagine if a girl messages you for two months about all the hot sex you could have with her, and when you finally meet her she says she wants a strictly platonic arrangement. You’d be pretty annoyed",
                                            "author": "fuzzyfuzzbourne",
                                            "id": "fcks91x",
                                            "parent_id": "t1_fckrs3r",
                                            "score": 1,
                                            "created_utc": 1577732079.0,
                                            "replies": [
                                                {
                                                    "body": "You are in a business. Selling your body to access wealth. And I mean that as in sugar dating. Nothing else. Study your market demographics and be honest to yourself.",
                                                    "author": null,
                                                    "id": "fcksflb",
                                                    "parent_id": "t1_fcks91x",
                                                    "score": 0,
                                                    "created_utc": 1577732190.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah. My business is that I’m selling my ass. I go to the job to sell my ass and the guy tells me he doesn’t want my ass, he wants a maid. \n\nIt’s like someone ordering 10 kilos of cheese from a dairy 2 months in advance. I’m the cheesemaker. They spend 2 months telling me how much they’re looking forward to sampling my cheddar. I go to deliver the cheese and when I get there they tell me they actually want tofu. Now I’m an angry cheesemaker, I conserved my stock of cheeses and made the journey to deliver them for nothing. \n\nI have every right to be pissed off about bring misled. You being bitter over the fact that you can’t get free poon has nothing to do with my predicament",
                                                            "author": "fuzzyfuzzbourne",
                                                            "id": "fcktbvc",
                                                            "parent_id": "t1_fcksflb",
                                                            "score": 5,
                                                            "created_utc": 1577732742.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You have every right to learn the hard way. Gotta dash. Being rich takes effort. Later.",
                                                                    "author": null,
                                                                    "id": "fcktwao",
                                                                    "parent_id": "t1_fcktbvc",
                                                                    "score": 0,
                                                                    "created_utc": 1577733093.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Ok, you just run along and go dominate that capitalism! After all, how else are you going to be able to afford to get laid?",
                                                                            "author": "fuzzyfuzzbourne",
                                                                            "id": "fckub5r",
                                                                            "parent_id": "t1_fcktwao",
                                                                            "score": 6,
                                                                            "created_utc": 1577733349.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "🤣",
            "author": "Fizzledy01",
            "id": "fd2o20b",
            "parent_id": "t1_fckzla9",
            "score": 2,
            "created_utc": 1578149954.0,
            "replies": []
        },
        {
            "body": "😂😂😂😂😂\n\n\"Buddy, I am way ahead of you.\"",
            "author": "ThePrettyLovely",
            "id": "fckzqct",
            "parent_id": "t1_fckzla9",
            "score": 1,
            "created_utc": 1577736674.0,
            "replies": []
        },
        {
            "body": "Mate. You and I both know you want your cake and to eat it. Welcome to reality.",
            "author": null,
            "id": "fckrl87",
            "parent_id": "t1_fckrgv0",
            "score": -2,
            "created_utc": 1577731673.0,
            "replies": [
                {
                    "body": "If being financially compensated for my body, my time, and my exclusivity is having my cake and eating it, yes, that’s right!",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckrpsk",
                    "parent_id": "t1_fckrl87",
                    "score": 5,
                    "created_utc": 1577731751.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fcksxl2",
                            "parent_id": "t1_fckrpsk",
                            "score": 5,
                            "created_utc": 1577732496.0,
                            "replies": [
                                {
                                    "body": "Thanks for the heads-up. I’ll stop wasting my pearls of wisdom on him now",
                                    "author": "fuzzyfuzzbourne",
                                    "id": "fcktfqe",
                                    "parent_id": "t1_fcksxl2",
                                    "score": 4,
                                    "created_utc": 1577732809.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Then be realistic. That's all I am saying.",
                            "author": null,
                            "id": "fckrs3r",
                            "parent_id": "t1_fckrpsk",
                            "score": 0,
                            "created_utc": 1577731790.0,
                            "replies": [
                                {
                                    "body": "What is unrealistic about looking for a sugar relationship and feeling bemused when I’m offered a position as a maid? He got me up there on false pretences. If it had been a simple m&g in which we hadn’t clicked, this post wouldn’t exist. I have never asked money for a m&g. I’m just pissed that I spent cash on something that could have been avoided if the guy had been honest about what he was looking for in the first place. \n\nImagine if a girl messages you for two months about all the hot sex you could have with her, and when you finally meet her she says she wants a strictly platonic arrangement. You’d be pretty annoyed",
                                    "author": "fuzzyfuzzbourne",
                                    "id": "fcks91x",
                                    "parent_id": "t1_fckrs3r",
                                    "score": 1,
                                    "created_utc": 1577732079.0,
                                    "replies": [
                                        {
                                            "body": "You are in a business. Selling your body to access wealth. And I mean that as in sugar dating. Nothing else. Study your market demographics and be honest to yourself.",
                                            "author": null,
                                            "id": "fcksflb",
                                            "parent_id": "t1_fcks91x",
                                            "score": 0,
                                            "created_utc": 1577732190.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah. My business is that I’m selling my ass. I go to the job to sell my ass and the guy tells me he doesn’t want my ass, he wants a maid. \n\nIt’s like someone ordering 10 kilos of cheese from a dairy 2 months in advance. I’m the cheesemaker. They spend 2 months telling me how much they’re looking forward to sampling my cheddar. I go to deliver the cheese and when I get there they tell me they actually want tofu. Now I’m an angry cheesemaker, I conserved my stock of cheeses and made the journey to deliver them for nothing. \n\nI have every right to be pissed off about bring misled. You being bitter over the fact that you can’t get free poon has nothing to do with my predicament",
                                                    "author": "fuzzyfuzzbourne",
                                                    "id": "fcktbvc",
                                                    "parent_id": "t1_fcksflb",
                                                    "score": 5,
                                                    "created_utc": 1577732742.0,
                                                    "replies": [
                                                        {
                                                            "body": "You have every right to learn the hard way. Gotta dash. Being rich takes effort. Later.",
                                                            "author": null,
                                                            "id": "fcktwao",
                                                            "parent_id": "t1_fcktbvc",
                                                            "score": 0,
                                                            "created_utc": 1577733093.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Ok, you just run along and go dominate that capitalism! After all, how else are you going to be able to afford to get laid?",
                                                                    "author": "fuzzyfuzzbourne",
                                                                    "id": "fckub5r",
                                                                    "parent_id": "t1_fcktwao",
                                                                    "score": 6,
                                                                    "created_utc": 1577733349.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If being financially compensated for my body, my time, and my exclusivity is having my cake and eating it, yes, that’s right!",
            "author": "fuzzyfuzzbourne",
            "id": "fckrpsk",
            "parent_id": "t1_fckrl87",
            "score": 5,
            "created_utc": 1577731751.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fcksxl2",
                    "parent_id": "t1_fckrpsk",
                    "score": 5,
                    "created_utc": 1577732496.0,
                    "replies": [
                        {
                            "body": "Thanks for the heads-up. I’ll stop wasting my pearls of wisdom on him now",
                            "author": "fuzzyfuzzbourne",
                            "id": "fcktfqe",
                            "parent_id": "t1_fcksxl2",
                            "score": 4,
                            "created_utc": 1577732809.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Then be realistic. That's all I am saying.",
                    "author": null,
                    "id": "fckrs3r",
                    "parent_id": "t1_fckrpsk",
                    "score": 0,
                    "created_utc": 1577731790.0,
                    "replies": [
                        {
                            "body": "What is unrealistic about looking for a sugar relationship and feeling bemused when I’m offered a position as a maid? He got me up there on false pretences. If it had been a simple m&g in which we hadn’t clicked, this post wouldn’t exist. I have never asked money for a m&g. I’m just pissed that I spent cash on something that could have been avoided if the guy had been honest about what he was looking for in the first place. \n\nImagine if a girl messages you for two months about all the hot sex you could have with her, and when you finally meet her she says she wants a strictly platonic arrangement. You’d be pretty annoyed",
                            "author": "fuzzyfuzzbourne",
                            "id": "fcks91x",
                            "parent_id": "t1_fckrs3r",
                            "score": 1,
                            "created_utc": 1577732079.0,
                            "replies": [
                                {
                                    "body": "You are in a business. Selling your body to access wealth. And I mean that as in sugar dating. Nothing else. Study your market demographics and be honest to yourself.",
                                    "author": null,
                                    "id": "fcksflb",
                                    "parent_id": "t1_fcks91x",
                                    "score": 0,
                                    "created_utc": 1577732190.0,
                                    "replies": [
                                        {
                                            "body": "Yeah. My business is that I’m selling my ass. I go to the job to sell my ass and the guy tells me he doesn’t want my ass, he wants a maid. \n\nIt’s like someone ordering 10 kilos of cheese from a dairy 2 months in advance. I’m the cheesemaker. They spend 2 months telling me how much they’re looking forward to sampling my cheddar. I go to deliver the cheese and when I get there they tell me they actually want tofu. Now I’m an angry cheesemaker, I conserved my stock of cheeses and made the journey to deliver them for nothing. \n\nI have every right to be pissed off about bring misled. You being bitter over the fact that you can’t get free poon has nothing to do with my predicament",
                                            "author": "fuzzyfuzzbourne",
                                            "id": "fcktbvc",
                                            "parent_id": "t1_fcksflb",
                                            "score": 5,
                                            "created_utc": 1577732742.0,
                                            "replies": [
                                                {
                                                    "body": "You have every right to learn the hard way. Gotta dash. Being rich takes effort. Later.",
                                                    "author": null,
                                                    "id": "fcktwao",
                                                    "parent_id": "t1_fcktbvc",
                                                    "score": 0,
                                                    "created_utc": 1577733093.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ok, you just run along and go dominate that capitalism! After all, how else are you going to be able to afford to get laid?",
                                                            "author": "fuzzyfuzzbourne",
                                                            "id": "fckub5r",
                                                            "parent_id": "t1_fcktwao",
                                                            "score": 6,
                                                            "created_utc": 1577733349.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fcksxl2",
            "parent_id": "t1_fckrpsk",
            "score": 5,
            "created_utc": 1577732496.0,
            "replies": [
                {
                    "body": "Thanks for the heads-up. I’ll stop wasting my pearls of wisdom on him now",
                    "author": "fuzzyfuzzbourne",
                    "id": "fcktfqe",
                    "parent_id": "t1_fcksxl2",
                    "score": 4,
                    "created_utc": 1577732809.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Then be realistic. That's all I am saying.",
            "author": null,
            "id": "fckrs3r",
            "parent_id": "t1_fckrpsk",
            "score": 0,
            "created_utc": 1577731790.0,
            "replies": [
                {
                    "body": "What is unrealistic about looking for a sugar relationship and feeling bemused when I’m offered a position as a maid? He got me up there on false pretences. If it had been a simple m&g in which we hadn’t clicked, this post wouldn’t exist. I have never asked money for a m&g. I’m just pissed that I spent cash on something that could have been avoided if the guy had been honest about what he was looking for in the first place. \n\nImagine if a girl messages you for two months about all the hot sex you could have with her, and when you finally meet her she says she wants a strictly platonic arrangement. You’d be pretty annoyed",
                    "author": "fuzzyfuzzbourne",
                    "id": "fcks91x",
                    "parent_id": "t1_fckrs3r",
                    "score": 1,
                    "created_utc": 1577732079.0,
                    "replies": [
                        {
                            "body": "You are in a business. Selling your body to access wealth. And I mean that as in sugar dating. Nothing else. Study your market demographics and be honest to yourself.",
                            "author": null,
                            "id": "fcksflb",
                            "parent_id": "t1_fcks91x",
                            "score": 0,
                            "created_utc": 1577732190.0,
                            "replies": [
                                {
                                    "body": "Yeah. My business is that I’m selling my ass. I go to the job to sell my ass and the guy tells me he doesn’t want my ass, he wants a maid. \n\nIt’s like someone ordering 10 kilos of cheese from a dairy 2 months in advance. I’m the cheesemaker. They spend 2 months telling me how much they’re looking forward to sampling my cheddar. I go to deliver the cheese and when I get there they tell me they actually want tofu. Now I’m an angry cheesemaker, I conserved my stock of cheeses and made the journey to deliver them for nothing. \n\nI have every right to be pissed off about bring misled. You being bitter over the fact that you can’t get free poon has nothing to do with my predicament",
                                    "author": "fuzzyfuzzbourne",
                                    "id": "fcktbvc",
                                    "parent_id": "t1_fcksflb",
                                    "score": 5,
                                    "created_utc": 1577732742.0,
                                    "replies": [
                                        {
                                            "body": "You have every right to learn the hard way. Gotta dash. Being rich takes effort. Later.",
                                            "author": null,
                                            "id": "fcktwao",
                                            "parent_id": "t1_fcktbvc",
                                            "score": 0,
                                            "created_utc": 1577733093.0,
                                            "replies": [
                                                {
                                                    "body": "Ok, you just run along and go dominate that capitalism! After all, how else are you going to be able to afford to get laid?",
                                                    "author": "fuzzyfuzzbourne",
                                                    "id": "fckub5r",
                                                    "parent_id": "t1_fcktwao",
                                                    "score": 6,
                                                    "created_utc": 1577733349.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks for the heads-up. I’ll stop wasting my pearls of wisdom on him now",
            "author": "fuzzyfuzzbourne",
            "id": "fcktfqe",
            "parent_id": "t1_fcksxl2",
            "score": 4,
            "created_utc": 1577732809.0,
            "replies": []
        },
        {
            "body": "What is unrealistic about looking for a sugar relationship and feeling bemused when I’m offered a position as a maid? He got me up there on false pretences. If it had been a simple m&g in which we hadn’t clicked, this post wouldn’t exist. I have never asked money for a m&g. I’m just pissed that I spent cash on something that could have been avoided if the guy had been honest about what he was looking for in the first place. \n\nImagine if a girl messages you for two months about all the hot sex you could have with her, and when you finally meet her she says she wants a strictly platonic arrangement. You’d be pretty annoyed",
            "author": "fuzzyfuzzbourne",
            "id": "fcks91x",
            "parent_id": "t1_fckrs3r",
            "score": 1,
            "created_utc": 1577732079.0,
            "replies": [
                {
                    "body": "You are in a business. Selling your body to access wealth. And I mean that as in sugar dating. Nothing else. Study your market demographics and be honest to yourself.",
                    "author": null,
                    "id": "fcksflb",
                    "parent_id": "t1_fcks91x",
                    "score": 0,
                    "created_utc": 1577732190.0,
                    "replies": [
                        {
                            "body": "Yeah. My business is that I’m selling my ass. I go to the job to sell my ass and the guy tells me he doesn’t want my ass, he wants a maid. \n\nIt’s like someone ordering 10 kilos of cheese from a dairy 2 months in advance. I’m the cheesemaker. They spend 2 months telling me how much they’re looking forward to sampling my cheddar. I go to deliver the cheese and when I get there they tell me they actually want tofu. Now I’m an angry cheesemaker, I conserved my stock of cheeses and made the journey to deliver them for nothing. \n\nI have every right to be pissed off about bring misled. You being bitter over the fact that you can’t get free poon has nothing to do with my predicament",
                            "author": "fuzzyfuzzbourne",
                            "id": "fcktbvc",
                            "parent_id": "t1_fcksflb",
                            "score": 5,
                            "created_utc": 1577732742.0,
                            "replies": [
                                {
                                    "body": "You have every right to learn the hard way. Gotta dash. Being rich takes effort. Later.",
                                    "author": null,
                                    "id": "fcktwao",
                                    "parent_id": "t1_fcktbvc",
                                    "score": 0,
                                    "created_utc": 1577733093.0,
                                    "replies": [
                                        {
                                            "body": "Ok, you just run along and go dominate that capitalism! After all, how else are you going to be able to afford to get laid?",
                                            "author": "fuzzyfuzzbourne",
                                            "id": "fckub5r",
                                            "parent_id": "t1_fcktwao",
                                            "score": 6,
                                            "created_utc": 1577733349.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are in a business. Selling your body to access wealth. And I mean that as in sugar dating. Nothing else. Study your market demographics and be honest to yourself.",
            "author": null,
            "id": "fcksflb",
            "parent_id": "t1_fcks91x",
            "score": 0,
            "created_utc": 1577732190.0,
            "replies": [
                {
                    "body": "Yeah. My business is that I’m selling my ass. I go to the job to sell my ass and the guy tells me he doesn’t want my ass, he wants a maid. \n\nIt’s like someone ordering 10 kilos of cheese from a dairy 2 months in advance. I’m the cheesemaker. They spend 2 months telling me how much they’re looking forward to sampling my cheddar. I go to deliver the cheese and when I get there they tell me they actually want tofu. Now I’m an angry cheesemaker, I conserved my stock of cheeses and made the journey to deliver them for nothing. \n\nI have every right to be pissed off about bring misled. You being bitter over the fact that you can’t get free poon has nothing to do with my predicament",
                    "author": "fuzzyfuzzbourne",
                    "id": "fcktbvc",
                    "parent_id": "t1_fcksflb",
                    "score": 5,
                    "created_utc": 1577732742.0,
                    "replies": [
                        {
                            "body": "You have every right to learn the hard way. Gotta dash. Being rich takes effort. Later.",
                            "author": null,
                            "id": "fcktwao",
                            "parent_id": "t1_fcktbvc",
                            "score": 0,
                            "created_utc": 1577733093.0,
                            "replies": [
                                {
                                    "body": "Ok, you just run along and go dominate that capitalism! After all, how else are you going to be able to afford to get laid?",
                                    "author": "fuzzyfuzzbourne",
                                    "id": "fckub5r",
                                    "parent_id": "t1_fcktwao",
                                    "score": 6,
                                    "created_utc": 1577733349.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah. My business is that I’m selling my ass. I go to the job to sell my ass and the guy tells me he doesn’t want my ass, he wants a maid. \n\nIt’s like someone ordering 10 kilos of cheese from a dairy 2 months in advance. I’m the cheesemaker. They spend 2 months telling me how much they’re looking forward to sampling my cheddar. I go to deliver the cheese and when I get there they tell me they actually want tofu. Now I’m an angry cheesemaker, I conserved my stock of cheeses and made the journey to deliver them for nothing. \n\nI have every right to be pissed off about bring misled. You being bitter over the fact that you can’t get free poon has nothing to do with my predicament",
            "author": "fuzzyfuzzbourne",
            "id": "fcktbvc",
            "parent_id": "t1_fcksflb",
            "score": 5,
            "created_utc": 1577732742.0,
            "replies": [
                {
                    "body": "You have every right to learn the hard way. Gotta dash. Being rich takes effort. Later.",
                    "author": null,
                    "id": "fcktwao",
                    "parent_id": "t1_fcktbvc",
                    "score": 0,
                    "created_utc": 1577733093.0,
                    "replies": [
                        {
                            "body": "Ok, you just run along and go dominate that capitalism! After all, how else are you going to be able to afford to get laid?",
                            "author": "fuzzyfuzzbourne",
                            "id": "fckub5r",
                            "parent_id": "t1_fcktwao",
                            "score": 6,
                            "created_utc": 1577733349.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You have every right to learn the hard way. Gotta dash. Being rich takes effort. Later.",
            "author": null,
            "id": "fcktwao",
            "parent_id": "t1_fcktbvc",
            "score": 0,
            "created_utc": 1577733093.0,
            "replies": [
                {
                    "body": "Ok, you just run along and go dominate that capitalism! After all, how else are you going to be able to afford to get laid?",
                    "author": "fuzzyfuzzbourne",
                    "id": "fckub5r",
                    "parent_id": "t1_fcktwao",
                    "score": 6,
                    "created_utc": 1577733349.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ok, you just run along and go dominate that capitalism! After all, how else are you going to be able to afford to get laid?",
            "author": "fuzzyfuzzbourne",
            "id": "fckub5r",
            "parent_id": "t1_fcktwao",
            "score": 6,
            "created_utc": 1577733349.0,
            "replies": []
        }
    ]
}