{
    "title": "I tried Sugar Tinder",
    "post_id": "gawrj8",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/gawrj8/i_tried_sugar_tinder/",
    "author": null,
    "body": "**Mandatory Disclaimer:** Everything you read here is true. This really happened. Some dialogue has been recreated due to poor memory but, to the best of my ability, everything here is factual. Two years ago, I tried Sugar Tinder^(TM), and this is my story.\n\n&#x200B;\n\nAs a girl who looks for more organic relationships than the usual tit-for-tat found on SA, I was thrilled to see posts on this forum about using Tinder for Sugar. The success stories varied wildly, but I felt with my knowledge and feel for people I could use Tinder as a more organic approach to finding a spoiled relationship. I was tired of the same old pay for play. I set up my profile hinting about liking the finer things in life, included a fun and flirty photo of myself from the neck down, and set my age range to 45+. I swiped right on men that appeared to be married and successful, and occasionally on the single successful guy.\n\nWithin hours I had more matches than I could handle. I unmatched anyone with low effort messages (a majority of them) and also with anyone who sent a message asking to *meet right now*. I was left with very few, but mostly promising, matches. Over the course of the next few hours I managed to whittle my entire list down to one match either due to a mismatch in expectations or general likability. My final match hadn't yet messaged, so I decided to reach out first.\n\nThis particular match did not have a face photo, but he had a photo from his neck to his knees, on what appeared to be a very nice boat. I wasn't thrilled about this particular match having only one photo but the thing is, I like boats. I know almost nothing about them, and I could probably never help upkeep one, but I love them all the same. I was literally feeling the salty wind in my hair as I reached out and sent my first message to my new POT.\n\nIt took a few hours, but he finally responded. \"I'm sorry for my delay in reply,\" he wrote. \"I've been in the Hamptons on the boat. I just returned to the city.\"\n\nWe got to know each other over the course of messaging through the app. He's a physicist that is currently in New York for work. He's writing a novel part time and his wife lives on the West Coast for the time being. He's vague in regards to his line of work, not expanding on who he works for or what exactly he does, but being used to the OPSEC required for use on Seeking Arrangements I don't give any of it much thought. Besides, I don't really even know what a physicist does. A google search makes it sound interesting. And, well, he's got a boat.\n\nI run the cell phone number he eventually gives to me through google and turn up nothing. We agree to exchange more photos and he sends over a slightly grainy photo of a man appearing to be in his late forties, with very blonde hair, and a body on the thinner side. He's not atrocious looking. He sends me a photo of the view from his apartment in Manhattan, and also a photo of his cat. All completely normal. I waffle on discussing sugar dating and an allowance, but since I tend to drive my relationships more organically, I refrain. Everything he's shown me and told me matches up with what I'm looking for in a potential partner, including his mention of how he likes to \"spoil women\".\n\nOn his recommendation we agree to meet at a wine bar in an affluent shopping mall in New York City. I am floored at my luck and google the shops located within the mall. I plan my arrival early so I can do some recon on the shopping situation, but upon arrival find that there is almost zero parking within a two block radius. After much frustration, I finally find street parking a few blocks away. By the time I've completed my walk the stilettos I am wearing have cut blisters into the backs of my heels. When I arrive to the mall, I beeline to the window of Prada and check out the goodies quickly, before heading over to the wine bar. I am officially late.\n\nI walk into the bar and scan the tables for my date. I don't find him and thank my lucky stars that he is also tardy. I take a seat outside the wine bar on a bench, secretly checking out the jewelry in the display across from me. Eventually, my phone rings. I answer and he asks me if I've been detained. It's the first time we've spoken on the phone and his voice sounds funny, higher pitched than I'd expected. I tell him I'm outside and that I'd looked in the bar but hadn't seen him. He tells me to come back inside and as I do I see a man gesturing frantically from one of the front high-tops. \n\nThis man is not the man I'd agreed to meet. Or, at least, he hasn't been in a few decades. This man's hair is no longer blonde, it's now white, from age. It's thinning and sticks out all over his head like he's been electrocuted, or like someone just rubbed a balloon all over him and the static still remains. He's much thinner than in the photo, his skin clinging to his bones like he'd recently walked through the desert and returned dehydrated and with massive muscle loss. When he shook my hand his longer than normal fingernails scraped my wrist.\n\n\"Were you doing some window shopping?\" he asks, his eyebrows raised. I shrug in response, hoping to appear coy.\n\nI sit down, thinking I've been catfished, but upon searching his face realize this man is most likely the one in the photo, just quite a bit later on in life. I am annoyed but figure I might as well give him a chance. I order a glass of white wine and he gives me the stink eye over the top of the menu while he orders a glass of water. It's 4pm and we're at a wine bar. I shrug it off and he asks me if I want food. I tell him I'll happily split an appetizer but I'm not terribly hungry at the moment. He ignores my request for an appetizer and orders a meal for himself. The waitress gives me a funny look.\n\nConversation doesn't flow easily and I try to jump start it while sipping my wine. He's wearing a polo and I can't help but notice that his veins are visible through his paper-like, pasty skin. My stomach begins to turn as he laments about his time on Tinder, how many women he's met, and what has become of each encounter. He uses the phrase 'friends with benefits' too much. He becomes animated when I mention I've spent time in the BDSM scene. He launches into a reimagining of his recent delve into dominating a younger woman at an orgy and I stifle a laugh thinking about him wearing leather and trying to wield a paddle with his non-existent biceps. I begin to wonder if there is a fetish for being finger-banged by a man with dagger-talons. Does he visit a manicurist to get them so rounded?\n\nWords begin to flow freely from his mouth and I'm brought back from my mental mockery when he says, \"and that's how I spoil my women.\"\n\nThinking I've somehow missed the cue for us to go shopping I try to backtrack the conversation in my mind. We were definitely talking about sex and not presents. Giving up my attempt to not seem dense I say, \"How do you spoil your women again?\"\n\nHe winks at me but instead of his eyelid coming down, his nose and cheek go up to meet his forehead, and his mouth gapes open all creepy like. His face appears contorted when he winks. \"I'm an animal in bed.\" He says. \"My women orgasm, on average, at least ten times.\"\n\nI feel like vomiting from his usage of 'my women' and immediately search out the waitress while chugging the rest of my wine. Screw shopping. I need a fast exit. He ignores my obvious distress and changes the subject.\n\n\"Have you ever seen Gattaca?\"\n\nI'm confused at the topic change. My back hurts like I've just suffered from a case of whip lash. I can feel my cheeks and neck getting hot, which is what happens when I get embarrassed or upset. If I don't calm down soon, I'll break out in hives. I briefly debate ordering another wine. Instead, I stupidly affirm that I have, in fact, seen Gattaca.\n\n\"Aliens are real.\" He says deadpan. In retrospect, there isn't any other way to announce that aliens are real. If you say it all wide eyed with your voice at an alarming decibel you'll get sent off to the looney bin. Considering this man's voice is already a few octaves too high for an XY chromosome, he has no other choice but to announce that lifeforms outside of this earth exist as if he's announcing the weather. *It's raining and there is a chance of sun later today. High of sixty. Oh and flying saucers exist.*\n\n\"Aliens?\" This is me, trying to find the waitress again. I need a shot. Something strong, like absinthe. Maybe they have edibles at this wine bar. I'm trying to keep my eyebrows from lifting into my hairline. \"Aliens are real?\"\n\n\"In Gattaca, Ethan Hawke is genetically inferior,\" he becomes animated while he speaks. \"In the movie, parents can genetically engineer their children to be better, but Ethan Hawke is not engineered. He's just a regular boy. But these other children, the genetically engineered ones, they have higher intelligence, better bodies. Eugenics.\" \n\nI am trying to keep up, even though the whole date is beginning to take a bit of a surreal quality around the edges. I begin to wonder if he slipped something into my drink. My neck feels like it's on fire and my cheeks are burning. He's stopped talking and I realize I'm supposed to answer.\n\n\"Eugenics. Right. I'm German. So, like, selective breeding?\"\n\nHe shakes his head empathically. I guess I haven't been keeping up after all. \"Not breeding. The aliens come here and insert genetically modified DNA into humans.\" His hands make saucer shapes in the air, he zips the finger saucers to and fro in the air as he speaks. \"They help move evolution along.\"\n\nI'm pretty certain I'm being punked at this point so I stand up from the table. \"I have to use the restroom.\" I grab my purse and make a beeline for the bathroom, searching for an exit on the way. I have never ditched a date in my life but I certainly plan to now. There is no back entrance, or side entrance. The only one is the door directly in front of our table. I won't be able to slip out without him seeing me do so. I stand in the bathroom and contemplate whether my bill for my drink will get paid. I check the mirror and see that hives are breaking out along my neck and chest. I take a Benadryl from my purse and down it using water from the sink. I cower in a stall for a bit before I decide to go back out and make an excuse for a hasty exit. I have no idea how long I've been gone.\n\nWhen I return to the table and sit back down he becomes animated again, his arms flailing as he speaks. It dawns on me that this man looks exactly like Einstein, crazy white hair and all. I giggle to myself when I think this, a short reprieve from the yucky-boiling-feeling in my gut. He explains how the aliens come to earth, either as experiment or means to assist us in survival, and genetically mutate humans. I debate asking him if he thinks he's been mutated but instead I blurt out the next best thing, \"Like the X-men? Evolution skips ahead, people become mutants.\" \n\n\"Yes!\" He yells, pounding his fists on the table. Our cutlery clinks around and my wine glass wobbles. The waitress finally takes notice and begins rushing over to our table. My date leans in close, I can smell the garlic from his lunch on his breath. \"Mutants are real. Mutants are very real.\" He whispers.\n\nThe waitress arrives and asks us if we want anything else. I shake my head, unable to articulate words. I feel like I'm suffering from tunnel vision. She lays the bill on the table and walks away. \"So, where to next?\" He asks me. His face is contorted because he's making the weird winky eye again. I'm now positive he's a mutant, but the not the sexy clawed Wolverine kind. That kind, I'd be okay with.\n\n\"I think I'm going to go home.\" I say.\n\nHe face morphs into one of confusion. \"I thought maybe we'd take a trip to the Hamptons...\"\n\nI hesitate, because, you know, boats.\n\n\"My friend would love to meet you. It's his boat. But he doesn't mind if I come over from time to time. I bring the girls. You don't mind driving do you?\"\n\nMy brain works slowly, catching up with the present, anger begins to bubble in my veins. A waking nightmare of a forced orgy at sea with a man that looks like Einstein and another man that looks like the Gimp from pulp fiction flits through my mind. *Bring out the Gimp!* reverberates in my brain. I manage to squeak out, \"It's... not your boat?\"\n\nHe shakes his head while glancing down at the bill. \"Okay... Your wine costs twelve dollars, so you owe....\"\n\nI see red and it drowns out the rest of his words. A waiter, not ours, passes by and I grab his shoulder, while digging in my wallet. I'm irate and I might be screaming. \"THIS GUY SAYS MY DRINK WAS TWELVE DOLLARS.\" I throw a twenty onto the waiters bussing tray. \"KEEP THE CHANGE.\"\n\nI run out the door without looking back. I walk in circles not remembering where I'd left my car. I'm confused and my limbs feel heavy. It begins to downpour and I don't have an umbrella. I squint at my phone, the google map pin point blinks at me showing me where I'd left my car, but I can't seem to find it. Nothing looks familiar. Eventually, I back track to the mall, remove my shoes and walk barefoot through New York City, back the way I came, with my ankle blisters bleeding onto the concrete. \n\nI finally find my car. I'm soaked straight through to my bra, my feet and ankles are covered in dirt and god-knows what. Premium denim is really heavy when it's wet. I'm too tired to drive myself home so I crawl into the back seat, my chest and neck itching like mad. I take another Benadryl and fall asleep listening to the rain pound down on the roof of my car. The rushing water sounds almost like being out to sea. \n\nI deleted Sugar Tinder^(TM) from my phone upon return home. Also, Sugar Tinder^(TM) is not a thing. You've been warned.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/gawrj8/i_tried_sugar_tinder/",
    "score": 793,
    "upvote_ratio": 0.97,
    "created_utc": 1588257222.0,
    "num_comments": 87,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "10/10 - great story to read while eating a breakfast bagel. Almost timed perfectly for the length of my meal.\n\nAlso, this is getting gold. Thanks for sharing your saga! I burst out a little laugh when you describe how hard he hits the table.",
            "author": "LoftDaddy",
            "id": "fp29kww",
            "parent_id": "t3_gawrj8",
            "score": 210,
            "created_utc": 1588257819.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fp2kcgy",
            "parent_id": "t3_gawrj8",
            "score": 78,
            "created_utc": 1588263241.0,
            "replies": []
        },
        {
            "body": "As someone who was once married to a physicist, I am more amused than I perhaps should be 💀💀💀",
            "author": "LikeHoney99",
            "id": "fp2kcth",
            "parent_id": "t3_gawrj8",
            "score": 55,
            "created_utc": 1588263246.0,
            "replies": []
        },
        {
            "body": "Having lived in NYC for a good part of my life I knew that there was a clear warning sign when the wine was only 12 bucks. I can hardly get Evian for that price where I go.",
            "author": "KeyToGramercy",
            "id": "fp3kjm0",
            "parent_id": "t3_gawrj8",
            "score": 36,
            "created_utc": 1588280921.0,
            "replies": []
        },
        {
            "body": "Excellent story.  You should be a writer (if you are not one already).",
            "author": "craa141",
            "id": "fp2bgus",
            "parent_id": "t3_gawrj8",
            "score": 86,
            "created_utc": 1588258812.0,
            "replies": []
        },
        {
            "body": "Amazing. Clearly in that category of “You can’t make up shit like this....”. If we didn’t know before, Now we all know not to try that app!",
            "author": "tg3000a",
            "id": "fp2eo0x",
            "parent_id": "t3_gawrj8",
            "score": 21,
            "created_utc": 1588260449.0,
            "replies": [
                {
                    "body": "Yes you can.",
                    "author": "HoosierSdaddie",
                    "id": "hgynjnr",
                    "parent_id": "t1_fp2eo0x",
                    "score": 3,
                    "created_utc": 1634458789.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When you mentioned boat, I knew it was a wrap. I don’t know why, but all the boat owners in NY waters, especially anything with the Hamptons, are mildly insane.\n\nEdit: mildly because this isn’t the worst I’ve seen or heard.",
            "author": null,
            "id": "fp2fnfn",
            "parent_id": "t3_gawrj8",
            "score": 42,
            "created_utc": 1588260943.0,
            "replies": [
                {
                    "body": "Plot twist, wasnt even his boat.",
                    "author": "DoctorSumter2You",
                    "id": "hqc11eg",
                    "parent_id": "t1_fp2fnfn",
                    "score": 3,
                    "created_utc": 1640730203.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My stomach was so tight from reading this , it safe to say no ab workout will be required today.",
            "author": "Half_anOrange",
            "id": "fp2esfq",
            "parent_id": "t3_gawrj8",
            "score": 38,
            "created_utc": 1588260511.0,
            "replies": []
        },
        {
            "body": "Could you pretty please write a book on your sugar experiences?  I don't even care if they're true.  I'll read every word.",
            "author": "UseTheForceRey",
            "id": "fp3nk17",
            "parent_id": "t3_gawrj8",
            "score": 13,
            "created_utc": 1588282461.0,
            "replies": [
                {
                    "body": "You might like r/rimjob_steve",
                    "author": "agjrpsl",
                    "id": "fp4qksk",
                    "parent_id": "t1_fp3nk17",
                    "score": 4,
                    "created_utc": 1588304956.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"You've been warned\". Love it, Ab.\n\n\n My experience with sugar Tinder hasn't been bad but it hasn't been great either. SA still trumps any other sugar seeking app imo.",
            "author": "PioneerExperience",
            "id": "fp2m2jd",
            "parent_id": "t3_gawrj8",
            "score": 11,
            "created_utc": 1588264084.0,
            "replies": []
        },
        {
            "body": "Goddess bless girl. The horror. THE HORROR 😤",
            "author": null,
            "id": "fp2fv43",
            "parent_id": "t3_gawrj8",
            "score": 20,
            "created_utc": 1588261047.0,
            "replies": []
        },
        {
            "body": "WOW im very impressed by your writing style, I had to check a few times if this was a book or reddit! Thank you for sharing and wish you luck on finding your perfect SD",
            "author": "99percentangelx",
            "id": "fp44j16",
            "parent_id": "t3_gawrj8",
            "score": 9,
            "created_utc": 1588291533.0,
            "replies": []
        },
        {
            "body": "I read this to myself then immediately read it out loud to my boyfriend. It was even better the second time around. Great read/PSA, op!",
            "author": "duckling-fantasy",
            "id": "fp2qsth",
            "parent_id": "t3_gawrj8",
            "score": 7,
            "created_utc": 1588266337.0,
            "replies": []
        },
        {
            "body": "This is so well written! I’m so sorry this happened to you, but my goodness, you have such a way with words!",
            "author": "lovelylocks22",
            "id": "fp2cqnb",
            "parent_id": "t3_gawrj8",
            "score": 6,
            "created_utc": 1588259475.0,
            "replies": []
        },
        {
            "body": "Please write a book",
            "author": "i-love-popcorn",
            "id": "fp2qep7",
            "parent_id": "t3_gawrj8",
            "score": 6,
            "created_utc": 1588266149.0,
            "replies": []
        },
        {
            "body": "Wow.\n\nWhat a great tale.",
            "author": "graveyarding1",
            "id": "fp2b1tn",
            "parent_id": "t3_gawrj8",
            "score": 5,
            "created_utc": 1588258594.0,
            "replies": []
        },
        {
            "body": "A tour de force!  Bravo for you!  Life is interesting.",
            "author": null,
            "id": "fp2c7ok",
            "parent_id": "t3_gawrj8",
            "score": 5,
            "created_utc": 1588259200.0,
            "replies": []
        },
        {
            "body": "He's an animal alright. \n\nTAKE MY UPVOTES!!!",
            "author": null,
            "id": "fp2jviv",
            "parent_id": "t3_gawrj8",
            "score": 5,
            "created_utc": 1588263010.0,
            "replies": []
        },
        {
            "body": "This should almost be on one of those podcasts with people telling unbelievable but real life stories.",
            "author": "FortuneGear09",
            "id": "fp2gmke",
            "parent_id": "t3_gawrj8",
            "score": 9,
            "created_utc": 1588261417.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fp2l256",
            "parent_id": "t3_gawrj8",
            "score": 8,
            "created_utc": 1588263592.0,
            "replies": [
                {
                    "body": "You have good perception. I do tend to lose it a lot in New York. I also like naps. These are my constants.",
                    "author": null,
                    "id": "fp2m6tm",
                    "parent_id": "t1_fp2l256",
                    "score": 8,
                    "created_utc": 1588264142.0,
                    "replies": [
                        {
                            "body": ">I also like naps. \n\nI think almost all of your stories have you falling asleep at some point 😉",
                            "author": "ruphun",
                            "id": "fp2nkta",
                            "parent_id": "t1_fp2m6tm",
                            "score": 0,
                            "created_utc": 1588264806.0,
                            "replies": [
                                {
                                    "body": "Beauty sleep, my friend. 😉",
                                    "author": null,
                                    "id": "fp2nq77",
                                    "parent_id": "t1_fp2nkta",
                                    "score": 4,
                                    "created_utc": 1588264877.0,
                                    "replies": [
                                        {
                                            "body": "Of course...I wouldn't expect anything less from someone so beautiful ;)\n\nGood to see you around and great story 👍🏻",
                                            "author": "ruphun",
                                            "id": "fp2o6sp",
                                            "parent_id": "t1_fp2nq77",
                                            "score": 1,
                                            "created_utc": 1588265095.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Very entertaining. Are you a writer pretending to be a sb or a sb pretending to be a writer?",
            "author": "FrostyLeave",
            "id": "fp2lm0m",
            "parent_id": "t3_gawrj8",
            "score": 10,
            "created_utc": 1588263861.0,
            "replies": [
                {
                    "body": "Definitely the latter.",
                    "author": null,
                    "id": "fp2m9b4",
                    "parent_id": "t1_fp2lm0m",
                    "score": 13,
                    "created_utc": 1588264176.0,
                    "replies": [
                        {
                            "body": "I would argue you are both an SB and a writer. No need to choose one or the other. Excellent writing btw — is this your outlet or do you have others as well?",
                            "author": "emptyoverflow",
                            "id": "fp62jox",
                            "parent_id": "t1_fp2m9b4",
                            "score": 3,
                            "created_utc": 1588344858.0,
                            "replies": [
                                {
                                    "body": "This is currently my outlet. I do write on r/writingprompts from time to time, but SLF is currently my main outlet. \n\nIf all things align, maybe one day I’ll start and finish a novel and publish it too. Maybe. One day.",
                                    "author": null,
                                    "id": "fp634td",
                                    "parent_id": "t1_fp62jox",
                                    "score": 3,
                                    "created_utc": 1588345172.0,
                                    "replies": [
                                        {
                                            "body": "Very cool. I could never get into prompts. And...there’s always NaNoWriMo! ;)",
                                            "author": "emptyoverflow",
                                            "id": "fp8zh0p",
                                            "parent_id": "t1_fp634td",
                                            "score": 1,
                                            "created_utc": 1588408536.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This was such a great read! Wow. Lol I’m so sorry about your experience.",
            "author": "VisibleSense",
            "id": "fp2cq5l",
            "parent_id": "t3_gawrj8",
            "score": 7,
            "created_utc": 1588259468.0,
            "replies": []
        },
        {
            "body": "You're such a talented story teller! Love reading your stories.",
            "author": "verosse",
            "id": "fp3a89q",
            "parent_id": "t3_gawrj8",
            "score": 5,
            "created_utc": 1588275793.0,
            "replies": []
        },
        {
            "body": "I just searched the app and couldn't find it in the Google play store. I guess I dodged a bullet?",
            "author": "_All_Bi_Myself_",
            "id": "fp3i6wb",
            "parent_id": "t3_gawrj8",
            "score": 4,
            "created_utc": 1588279737.0,
            "replies": []
        },
        {
            "body": "Sugar tinder is real. You just didnt find the right one.  How many pots on SA didnt work out? Many.",
            "author": "dade_murphy1",
            "id": "fp2n8zv",
            "parent_id": "t3_gawrj8",
            "score": 15,
            "created_utc": 1588264650.0,
            "replies": [
                {
                    "body": "I agree. I’ve had several duds on SA (with some good ones mixed in), but my second date from Tinder has been the best one ever! 💕",
                    "author": "cleanevergreen",
                    "id": "fp389aq",
                    "parent_id": "t1_fp2n8zv",
                    "score": 7,
                    "created_utc": 1588274812.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow, what happened with the hives and the confusion? I'm seriously worried..",
            "author": null,
            "id": "fp2foik",
            "parent_id": "t3_gawrj8",
            "score": 7,
            "created_utc": 1588260958.0,
            "replies": [
                {
                    "body": "I have mild social anxiety. Stressful situations with new people tend to upend me mentally. The hives is an indicator of stress. \n\nI’m also allergic to cheap cotton sheets when it’s hot. Those give me hives too. So I tend to not tell SDs about the former in case they mistake the cheap sheet hives for sex related stress. 🤷🏻‍♀️",
                    "author": null,
                    "id": "fp2mht5",
                    "parent_id": "t1_fp2foik",
                    "score": 15,
                    "created_utc": 1588264289.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are a very descriptive writer! I enjoyed reading .",
            "author": "g26k",
            "id": "fp2l6i7",
            "parent_id": "t3_gawrj8",
            "score": 3,
            "created_utc": 1588263649.0,
            "replies": []
        },
        {
            "body": "So aliens do exist 😆",
            "author": "_mimi97",
            "id": "fp2w7vl",
            "parent_id": "t3_gawrj8",
            "score": 3,
            "created_utc": 1588268920.0,
            "replies": []
        },
        {
            "body": "I seriously thought the friend was going to be the real SD and this wacko was like a test she had to go through to get to him 🤣 slightly disappointed there was no happy ending but not half as disappointed as I'm sure she was... that was incredibly well written comedy gold tho.",
            "author": "Kitten4Play77",
            "id": "fp40x51",
            "parent_id": "t3_gawrj8",
            "score": 3,
            "created_utc": 1588289521.0,
            "replies": []
        },
        {
            "body": "Your writing style is incredible. Tinder is not where it’s at, unless you clarify what you’re looking for before you meet. Or at least what spoiling means to you",
            "author": "DevynDior",
            "id": "fp4b0yn",
            "parent_id": "t3_gawrj8",
            "score": 3,
            "created_utc": 1588295269.0,
            "replies": [
                {
                    "body": "which is hard to do on the app itself cuz of Tinder's tos and their hawk-like sense to scour for finding words/phrasing/language associated to sugar dating!",
                    "author": "chicityt",
                    "id": "fp4fp8x",
                    "parent_id": "t1_fp4b0yn",
                    "score": 2,
                    "created_utc": 1588298054.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sugar Tinder is real, but you definitely have to work harder. \nYou have to do everything you possibly can to find background information on the guy, and you have to talk on the phone prior to a date.\nI believe someone else mentioned it but always look up the restaurant beforehand to see if it’s nice. Meeting in a mall in nyc is a red flag because there are so many other incredibly wonderful spaces to meet up.",
            "author": "DevinMills93",
            "id": "fp7coqs",
            "parent_id": "t3_gawrj8",
            "score": 3,
            "created_utc": 1588368149.0,
            "replies": []
        },
        {
            "body": "Sugaring in Tinder has been covered in other posts 1-2 months ago but I couldn't find them. Anyhow the idea is that, yes although an SB can occasionally get lucky and find a nice SD there; but you should be ready to pay your own meal plus his (yes \"the whole thing\"!), and your round trip travel from your home to the meeting point and back.  And the older the man you are going to meet, creepier the things may get :)   \n\nBy the way you are a great writer! It is a joy to read your writings.",
            "author": "charming_gentleman49",
            "id": "fp3jfje",
            "parent_id": "t3_gawrj8",
            "score": 6,
            "created_utc": 1588280353.0,
            "replies": []
        },
        {
            "body": "This story makes me want to beat the shit out of that guy,or better still, watch you do it. \n\nIn the future 1) get up and leave with the obvious catfish   \n2) leave the bill on the table and leave,3) climb out the bathroom window",
            "author": "GSSD",
            "id": "fp2sw8m",
            "parent_id": "t3_gawrj8",
            "score": 4,
            "created_utc": 1588267340.0,
            "replies": []
        },
        {
            "body": "You are a talented writer.  This description kept my attention in its entirety, and I didn't note any errors in spelling or grammar that might have thrown me off.  Really talented.",
            "author": "TY2022",
            "id": "fp2gcro",
            "parent_id": "t3_gawrj8",
            "score": 5,
            "created_utc": 1588261285.0,
            "replies": []
        },
        {
            "body": "Dead. Totally dead! 😂☠",
            "author": "noaveragesugarbaby",
            "id": "fp2txz5",
            "parent_id": "t3_gawrj8",
            "score": 2,
            "created_utc": 1588267832.0,
            "replies": []
        },
        {
            "body": "Great writing!  But now the aliens will be watching you.",
            "author": "FlyingLyger",
            "id": "fp2yn5w",
            "parent_id": "t3_gawrj8",
            "score": 2,
            "created_utc": 1588270090.0,
            "replies": []
        },
        {
            "body": "This was a very entertaining read!  Love your writing style :)  Sorry to hear about your experience, but your good sense of humor made this a somewhat positive experience (for us to read, maybe not for your to actually live through it).",
            "author": "jeffzeke",
            "id": "fp33b4k",
            "parent_id": "t3_gawrj8",
            "score": 2,
            "created_utc": 1588272360.0,
            "replies": []
        },
        {
            "body": "I laughed, I gasped, I laughed again and now I wish I could send you a hug. You’re really talented! I’m sorry about that crazy experience, don’t give up on tinder just yet!",
            "author": null,
            "id": "fp35l5z",
            "parent_id": "t3_gawrj8",
            "score": 2,
            "created_utc": 1588273478.0,
            "replies": []
        },
        {
            "body": "Braver than any US Marine!",
            "author": "twocatsnoheart",
            "id": "fp3mviv",
            "parent_id": "t3_gawrj8",
            "score": 2,
            "created_utc": 1588282113.0,
            "replies": []
        },
        {
            "body": "😂this was a wonderful read, thank you.",
            "author": "MissLeilaToYou",
            "id": "fp3vm06",
            "parent_id": "t3_gawrj8",
            "score": 2,
            "created_utc": 1588286633.0,
            "replies": []
        },
        {
            "body": "I'm going to say, its not Tinder that lead you astray, it was your filtering methodology.  You could have replicated the same experience with SA.  Always get a current picture, before meeting, and at least discuss financial ballpark prior to meeting.  I have had women falsify their age by about 20 years in the past because they \"needed to remain discreet\", right, just don't meet anyone that is like that, and yeah, let me show you a picture of my boat...",
            "author": "fuckingrandoSD",
            "id": "fp5mf86",
            "parent_id": "t3_gawrj8",
            "score": 2,
            "created_utc": 1588334306.0,
            "replies": []
        },
        {
            "body": "Oh gosh.. no, no, this cannot be true! OP, I am so sorry but gosh, this is so hilarious. 🤣🤣💀\n\nAliens are real. 🤪",
            "author": "why_so_sexy_",
            "id": "fp2d8gr",
            "parent_id": "t3_gawrj8",
            "score": 3,
            "created_utc": 1588259729.0,
            "replies": [
                {
                    "body": ">Aliens are real. \n\nThat's what they want you to believe 😜",
                    "author": "ruphun",
                    "id": "fp2nguy",
                    "parent_id": "t1_fp2d8gr",
                    "score": 3,
                    "created_utc": 1588264754.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have a boat!  Hit me up, gurl! \n\nI’m also a writer and publisher. Let’s discuss your ideas over coffee. 🤣",
            "author": "InitialD-86",
            "id": "fp2m8k3",
            "parent_id": "t3_gawrj8",
            "score": 2,
            "created_utc": 1588264165.0,
            "replies": [
                {
                    "body": "PM me. We can discuss my ~~allowance~~ book *advance* privately. 😉",
                    "author": null,
                    "id": "fp2n0hp",
                    "parent_id": "t1_fp2m8k3",
                    "score": 11,
                    "created_utc": 1588264538.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are an awesome writer. I enjoy every sec of reading the story.\n\n\nI know you said this is real, but I am having doubt. I meant this story have EVERYTHING. Little bit of romance, comedy, horror, alien, mutant, and crazy scientist. Are you sure this is not one of those 'based on real event's kinda story? \n\n\nI have to ask, so the whole reason you went on a date and sit through this whole thing was because of a boat?",
            "author": null,
            "id": "fp2nrw2",
            "parent_id": "t3_gawrj8",
            "score": 3,
            "created_utc": 1588264899.0,
            "replies": [
                {
                    "body": "Right? I mean...she could have screened these sorts of things on a well executed and strategic (altho subtly so) phone call.",
                    "author": "clair-cummings",
                    "id": "fp31dcw",
                    "parent_id": "t1_fp2nrw2",
                    "score": 3,
                    "created_utc": 1588271423.0,
                    "replies": []
                },
                {
                    "body": "So many guys will do things like strategically take pics on a yacht, by a high dollar car, on a private jet, etc. Its amateur pick-up artist 101 strategies actually. My take: it sounds like the writer purposefully likes finding these sorts of odd situations so she can write about them. I guess the adage is true...bad situations can make for good stories after the fact 🤷‍♀️",
                    "author": "clair-cummings",
                    "id": "fp31u62",
                    "parent_id": "t1_fp2nrw2",
                    "score": 4,
                    "created_utc": 1588271648.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I tried Vanilla Seeking & I liked it 😈🤣",
            "author": "ruphun",
            "id": "fp29hoo",
            "parent_id": "t3_gawrj8",
            "score": 3,
            "created_utc": 1588257770.0,
            "replies": [
                {
                    "body": "I hate when vanilla relationship minded folks <men> join sites like Seeking and WhatsYourPrice. They act all sorts of offended when you would have the AUDACITY to bring up anything money/sugar related. Like uh sir....I did not join this site to entertain the likes of you for free 🤦‍♀️🙄....and you are on the wrong site if you think I'm down for that <vanilla dating>.\n\nAnd....just to be clear: I think it's totally appropriate for a woman to expect some sort of token donation on a first meet. It does NOT have to be a lot, but at least $100 is appropriate.",
                    "author": "clair-cummings",
                    "id": "fp313u5",
                    "parent_id": "t1_fp29hoo",
                    "score": -1,
                    "created_utc": 1588271294.0,
                    "replies": [
                        {
                            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                            "author": "AutoModerator",
                            "id": "fp313vf",
                            "parent_id": "t1_fp313u5",
                            "score": 2,
                            "created_utc": 1588271294.0,
                            "replies": []
                        },
                        {
                            "body": "Right but if they paid they’re $90 per month then they have the right to be there. The funny thing is Seekings slogan is “relationships on your terms” Sounds like you can find or ask for any type of relationship as long as it’s on your terms. In addition, if vanilla wasn’t an option, Seeking wouldn’t have a marriage minded tag.\n\nMy comment about Vanilla Seeking was a joke. Because women constantly come on here telling us about using Tinder for sugar, but most of them also get upset when men want to vanilla date on Seeking.",
                            "author": "ruphun",
                            "id": "fp34x0q",
                            "parent_id": "t1_fp313u5",
                            "score": -1,
                            "created_utc": 1588273143.0,
                            "replies": [
                                {
                                    "body": "Yes....but just bc you CAN do something doesn't mean you should. Meaning...just bc you can join a site specifically targeted for sugaring doesn't make it a good idea if what you are looking for is to NOT support a woman and have more of a 50/50 vanilla type thing.\nI mean....its like going on Grindr as a hetero female and getting mad when none of the guys have interest in dating me 🤷‍♀️. I think Tinder was originally considered as a hook-up type site but its moved over as more of a vanilla type dating place too. Still, some are still hung up on the idea that it's still just for free hookups.\nSadly, I cant post on tinder and say what I'm actually looking for (a sugar arrangement and not vanilla dating...been there, done that, got tired of dating for free). Unfortunately, if you write those words you'll get reported and booted off and it's hard to do it all covert. Hell....I still run into men around who dont know what the term \"mutually beneficial relationship\" actually means. As if sex was enough for me....ha!",
                                    "author": "clair-cummings",
                                    "id": "fp3k9a1",
                                    "parent_id": "t1_fp34x0q",
                                    "score": 2,
                                    "created_utc": 1588280777.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I will wait for the movie",
            "author": "BaianaBae",
            "id": "fp4a4ow",
            "parent_id": "t3_gawrj8",
            "score": 1,
            "created_utc": 1588294741.0,
            "replies": []
        },
        {
            "body": "Although I’m sorry you had such a shitty experience I must say that this was a very good read. Haha",
            "author": "KayaAnine",
            "id": "fp4p19u",
            "parent_id": "t3_gawrj8",
            "score": 1,
            "created_utc": 1588303939.0,
            "replies": []
        },
        {
            "body": "I was right with your till the point he said “that’s how I spoil my women” \n\n\n\nWait wait wait 😂😂🤣🤣🤣🤣🤣 and the wink that the nose and cheek moved . That’s when you should have left. Sorry 😐 \nThe boat wasn’t even his ohhhh my 😖",
            "author": "BabyFebriana",
            "id": "fp4z38e",
            "parent_id": "t3_gawrj8",
            "score": 1,
            "created_utc": 1588311298.0,
            "replies": []
        },
        {
            "body": "Great story, great writing 💜",
            "author": "yogafeetclub",
            "id": "fp518w8",
            "parent_id": "t3_gawrj8",
            "score": 1,
            "created_utc": 1588313108.0,
            "replies": []
        },
        {
            "body": ">He winks at me but instead of his eyelid coming down, his nose and cheek go up to meet his forehead, and his mouth gapes open all creepy like.\n\nhow does one’s nose and cheek reach their forehead? lol",
            "author": "thrwawy_fdeawy",
            "id": "fp5bhqz",
            "parent_id": "t3_gawrj8",
            "score": 1,
            "created_utc": 1588323157.0,
            "replies": []
        },
        {
            "body": "This is hilarious. Thanks for sharing",
            "author": "AlwaysOverPar123",
            "id": "fp5qjxv",
            "parent_id": "t3_gawrj8",
            "score": 1,
            "created_utc": 1588337529.0,
            "replies": []
        },
        {
            "body": "I’ve had pretty good luck on tinder actually. Many girls are looking for more traditional arrangements and not so transactional but to each their own!",
            "author": "captialSD",
            "id": "fp7oz44",
            "parent_id": "t3_gawrj8",
            "score": 1,
            "created_utc": 1588374834.0,
            "replies": []
        },
        {
            "body": "Oh my god, I went through so many emotions in this, the DISGUST, you are amazing at descriptions, was with you the whole story.",
            "author": "excessg0ld",
            "id": "fp9bmu1",
            "parent_id": "t3_gawrj8",
            "score": 1,
            "created_utc": 1588421469.0,
            "replies": []
        },
        {
            "body": "(Ol ol amakk((*(;*;*;*",
            "author": "sisu103182",
            "id": "fpa9qm6",
            "parent_id": "t3_gawrj8",
            "score": 1,
            "created_utc": 1588443681.0,
            "replies": []
        },
        {
            "body": "#I often tell people here that “Tinder is not for sugar dating”. \n\nNow I can link to your post every time I do that.",
            "author": "geekxp",
            "id": "fpb6p0z",
            "parent_id": "t3_gawrj8",
            "score": 1,
            "created_utc": 1588463257.0,
            "replies": []
        },
        {
            "body": "Oh yikes! How’d I miss this? What a story!\n\nBoat isn’t even his, semi-catfish (if not full on), makes you pay for your drink...real winner there.",
            "author": "mraspencer",
            "id": "fpl0ipn",
            "parent_id": "t3_gawrj8",
            "score": 1,
            "created_utc": 1588704232.0,
            "replies": []
        },
        {
            "body": "It’s unbelievable and yet simultaneously believable.  Great job on the story.",
            "author": "bubdouglas",
            "id": "fptyf9i",
            "parent_id": "t3_gawrj8",
            "score": 1,
            "created_utc": 1588900806.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fqi6ebj",
            "parent_id": "t3_gawrj8",
            "score": 1,
            "created_utc": 1589391120.0,
            "replies": []
        },
        {
            "body": "You were trying a little too hard to be funny, yet you still pulled it off.  You're pretty funny.  I feel sorry for your feet.",
            "author": "Eugenius666",
            "id": "fqx0jfk",
            "parent_id": "t3_gawrj8",
            "score": 1,
            "created_utc": 1589722841.0,
            "replies": []
        },
        {
            "body": "Wild-ass ride!  Loved the story!\n\nYou should cross post on /r/tifu",
            "author": "SugaShak",
            "id": "fp2anva",
            "parent_id": "t3_gawrj8",
            "score": 1,
            "created_utc": 1588258394.0,
            "replies": []
        },
        {
            "body": "Is there a TL;DR version?\nBecause holy shit lol",
            "author": null,
            "id": "fp4jer4",
            "parent_id": "t3_gawrj8",
            "score": 1,
            "created_utc": 1588300358.0,
            "replies": []
        },
        {
            "body": "Don’t you wonder who you flippantly unmatched because they sent an opening “hello”?",
            "author": "Bigvee-to",
            "id": "fp2mgbm",
            "parent_id": "t3_gawrj8",
            "score": 0,
            "created_utc": 1588264270.0,
            "replies": []
        },
        {
            "body": "This entire thread is now a political war on vagina valuation. Let's face it , dudes are pissed the vagina has so much power. It's really just a random thing of evolution. Maybe not random. Point is the writer didn't think even 1 level deep.. she is totally biased.  SLF exists b/c of the free market. And let me tell you something.. CAPITALISM RULES AND COMMUNISM SUCKS. So I won't complain.",
            "author": null,
            "id": "fprcs9r",
            "parent_id": "t3_gawrj8",
            "score": -1,
            "created_utc": 1588850426.0,
            "replies": [
                {
                    "body": "how, pray tell, is this thread a \"political war on vagina valuation\"?!? Which posts are leading you to that conclusion? \n\nOr do you mean now that you posted and moving forward?",
                    "author": "mraspencer",
                    "id": "fps38fn",
                    "parent_id": "t1_fprcs9r",
                    "score": 1,
                    "created_utc": 1588866719.0,
                    "replies": [
                        {
                            "body": "I posted after reading the whole thread. It was my first go at reading all this SLF . Funny. You know the gender of the writer almost every time. Both sexes are out for their own interests. People just can't admit the truth. I think sugaring is a decent value for dudes but a real headache.  It's not prostitution. Prostitution would be Fentany and sugaring a weak bud.",
                            "author": null,
                            "id": "fpuw3dp",
                            "parent_id": "t1_fps38fn",
                            "score": 1,
                            "created_utc": 1588925745.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve never laughed so much, I have had such a depressing week and bad experiences with sugar daddies and you just really uplifted me with your hilarious tale and made me realise that shit like this happen to us all and to see the funny side of it!",
            "author": "TheNorthernAngel",
            "id": "hlxqkua",
            "parent_id": "t3_gawrj8",
            "score": 1,
            "created_utc": 1637781414.0,
            "replies": []
        },
        {
            "body": "Yes you can.",
            "author": "HoosierSdaddie",
            "id": "hgynjnr",
            "parent_id": "t1_fp2eo0x",
            "score": 3,
            "created_utc": 1634458789.0,
            "replies": []
        },
        {
            "body": "Plot twist, wasnt even his boat.",
            "author": "DoctorSumter2You",
            "id": "hqc11eg",
            "parent_id": "t1_fp2fnfn",
            "score": 3,
            "created_utc": 1640730203.0,
            "replies": []
        },
        {
            "body": "You might like r/rimjob_steve",
            "author": "agjrpsl",
            "id": "fp4qksk",
            "parent_id": "t1_fp3nk17",
            "score": 4,
            "created_utc": 1588304956.0,
            "replies": []
        },
        {
            "body": "You have good perception. I do tend to lose it a lot in New York. I also like naps. These are my constants.",
            "author": null,
            "id": "fp2m6tm",
            "parent_id": "t1_fp2l256",
            "score": 8,
            "created_utc": 1588264142.0,
            "replies": [
                {
                    "body": ">I also like naps. \n\nI think almost all of your stories have you falling asleep at some point 😉",
                    "author": "ruphun",
                    "id": "fp2nkta",
                    "parent_id": "t1_fp2m6tm",
                    "score": 0,
                    "created_utc": 1588264806.0,
                    "replies": [
                        {
                            "body": "Beauty sleep, my friend. 😉",
                            "author": null,
                            "id": "fp2nq77",
                            "parent_id": "t1_fp2nkta",
                            "score": 4,
                            "created_utc": 1588264877.0,
                            "replies": [
                                {
                                    "body": "Of course...I wouldn't expect anything less from someone so beautiful ;)\n\nGood to see you around and great story 👍🏻",
                                    "author": "ruphun",
                                    "id": "fp2o6sp",
                                    "parent_id": "t1_fp2nq77",
                                    "score": 1,
                                    "created_utc": 1588265095.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Definitely the latter.",
            "author": null,
            "id": "fp2m9b4",
            "parent_id": "t1_fp2lm0m",
            "score": 13,
            "created_utc": 1588264176.0,
            "replies": [
                {
                    "body": "I would argue you are both an SB and a writer. No need to choose one or the other. Excellent writing btw — is this your outlet or do you have others as well?",
                    "author": "emptyoverflow",
                    "id": "fp62jox",
                    "parent_id": "t1_fp2m9b4",
                    "score": 3,
                    "created_utc": 1588344858.0,
                    "replies": [
                        {
                            "body": "This is currently my outlet. I do write on r/writingprompts from time to time, but SLF is currently my main outlet. \n\nIf all things align, maybe one day I’ll start and finish a novel and publish it too. Maybe. One day.",
                            "author": null,
                            "id": "fp634td",
                            "parent_id": "t1_fp62jox",
                            "score": 3,
                            "created_utc": 1588345172.0,
                            "replies": [
                                {
                                    "body": "Very cool. I could never get into prompts. And...there’s always NaNoWriMo! ;)",
                                    "author": "emptyoverflow",
                                    "id": "fp8zh0p",
                                    "parent_id": "t1_fp634td",
                                    "score": 1,
                                    "created_utc": 1588408536.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree. I’ve had several duds on SA (with some good ones mixed in), but my second date from Tinder has been the best one ever! 💕",
            "author": "cleanevergreen",
            "id": "fp389aq",
            "parent_id": "t1_fp2n8zv",
            "score": 7,
            "created_utc": 1588274812.0,
            "replies": []
        },
        {
            "body": "I have mild social anxiety. Stressful situations with new people tend to upend me mentally. The hives is an indicator of stress. \n\nI’m also allergic to cheap cotton sheets when it’s hot. Those give me hives too. So I tend to not tell SDs about the former in case they mistake the cheap sheet hives for sex related stress. 🤷🏻‍♀️",
            "author": null,
            "id": "fp2mht5",
            "parent_id": "t1_fp2foik",
            "score": 15,
            "created_utc": 1588264289.0,
            "replies": []
        },
        {
            "body": "which is hard to do on the app itself cuz of Tinder's tos and their hawk-like sense to scour for finding words/phrasing/language associated to sugar dating!",
            "author": "chicityt",
            "id": "fp4fp8x",
            "parent_id": "t1_fp4b0yn",
            "score": 2,
            "created_utc": 1588298054.0,
            "replies": []
        },
        {
            "body": ">Aliens are real. \n\nThat's what they want you to believe 😜",
            "author": "ruphun",
            "id": "fp2nguy",
            "parent_id": "t1_fp2d8gr",
            "score": 3,
            "created_utc": 1588264754.0,
            "replies": []
        },
        {
            "body": "PM me. We can discuss my ~~allowance~~ book *advance* privately. 😉",
            "author": null,
            "id": "fp2n0hp",
            "parent_id": "t1_fp2m8k3",
            "score": 11,
            "created_utc": 1588264538.0,
            "replies": []
        },
        {
            "body": "Right? I mean...she could have screened these sorts of things on a well executed and strategic (altho subtly so) phone call.",
            "author": "clair-cummings",
            "id": "fp31dcw",
            "parent_id": "t1_fp2nrw2",
            "score": 3,
            "created_utc": 1588271423.0,
            "replies": []
        },
        {
            "body": "So many guys will do things like strategically take pics on a yacht, by a high dollar car, on a private jet, etc. Its amateur pick-up artist 101 strategies actually. My take: it sounds like the writer purposefully likes finding these sorts of odd situations so she can write about them. I guess the adage is true...bad situations can make for good stories after the fact 🤷‍♀️",
            "author": "clair-cummings",
            "id": "fp31u62",
            "parent_id": "t1_fp2nrw2",
            "score": 4,
            "created_utc": 1588271648.0,
            "replies": []
        },
        {
            "body": "I hate when vanilla relationship minded folks <men> join sites like Seeking and WhatsYourPrice. They act all sorts of offended when you would have the AUDACITY to bring up anything money/sugar related. Like uh sir....I did not join this site to entertain the likes of you for free 🤦‍♀️🙄....and you are on the wrong site if you think I'm down for that <vanilla dating>.\n\nAnd....just to be clear: I think it's totally appropriate for a woman to expect some sort of token donation on a first meet. It does NOT have to be a lot, but at least $100 is appropriate.",
            "author": "clair-cummings",
            "id": "fp313u5",
            "parent_id": "t1_fp29hoo",
            "score": -1,
            "created_utc": 1588271294.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "fp313vf",
                    "parent_id": "t1_fp313u5",
                    "score": 2,
                    "created_utc": 1588271294.0,
                    "replies": []
                },
                {
                    "body": "Right but if they paid they’re $90 per month then they have the right to be there. The funny thing is Seekings slogan is “relationships on your terms” Sounds like you can find or ask for any type of relationship as long as it’s on your terms. In addition, if vanilla wasn’t an option, Seeking wouldn’t have a marriage minded tag.\n\nMy comment about Vanilla Seeking was a joke. Because women constantly come on here telling us about using Tinder for sugar, but most of them also get upset when men want to vanilla date on Seeking.",
                    "author": "ruphun",
                    "id": "fp34x0q",
                    "parent_id": "t1_fp313u5",
                    "score": -1,
                    "created_utc": 1588273143.0,
                    "replies": [
                        {
                            "body": "Yes....but just bc you CAN do something doesn't mean you should. Meaning...just bc you can join a site specifically targeted for sugaring doesn't make it a good idea if what you are looking for is to NOT support a woman and have more of a 50/50 vanilla type thing.\nI mean....its like going on Grindr as a hetero female and getting mad when none of the guys have interest in dating me 🤷‍♀️. I think Tinder was originally considered as a hook-up type site but its moved over as more of a vanilla type dating place too. Still, some are still hung up on the idea that it's still just for free hookups.\nSadly, I cant post on tinder and say what I'm actually looking for (a sugar arrangement and not vanilla dating...been there, done that, got tired of dating for free). Unfortunately, if you write those words you'll get reported and booted off and it's hard to do it all covert. Hell....I still run into men around who dont know what the term \"mutually beneficial relationship\" actually means. As if sex was enough for me....ha!",
                            "author": "clair-cummings",
                            "id": "fp3k9a1",
                            "parent_id": "t1_fp34x0q",
                            "score": 2,
                            "created_utc": 1588280777.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "how, pray tell, is this thread a \"political war on vagina valuation\"?!? Which posts are leading you to that conclusion? \n\nOr do you mean now that you posted and moving forward?",
            "author": "mraspencer",
            "id": "fps38fn",
            "parent_id": "t1_fprcs9r",
            "score": 1,
            "created_utc": 1588866719.0,
            "replies": [
                {
                    "body": "I posted after reading the whole thread. It was my first go at reading all this SLF . Funny. You know the gender of the writer almost every time. Both sexes are out for their own interests. People just can't admit the truth. I think sugaring is a decent value for dudes but a real headache.  It's not prostitution. Prostitution would be Fentany and sugaring a weak bud.",
                    "author": null,
                    "id": "fpuw3dp",
                    "parent_id": "t1_fps38fn",
                    "score": 1,
                    "created_utc": 1588925745.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">I also like naps. \n\nI think almost all of your stories have you falling asleep at some point 😉",
            "author": "ruphun",
            "id": "fp2nkta",
            "parent_id": "t1_fp2m6tm",
            "score": 0,
            "created_utc": 1588264806.0,
            "replies": [
                {
                    "body": "Beauty sleep, my friend. 😉",
                    "author": null,
                    "id": "fp2nq77",
                    "parent_id": "t1_fp2nkta",
                    "score": 4,
                    "created_utc": 1588264877.0,
                    "replies": [
                        {
                            "body": "Of course...I wouldn't expect anything less from someone so beautiful ;)\n\nGood to see you around and great story 👍🏻",
                            "author": "ruphun",
                            "id": "fp2o6sp",
                            "parent_id": "t1_fp2nq77",
                            "score": 1,
                            "created_utc": 1588265095.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would argue you are both an SB and a writer. No need to choose one or the other. Excellent writing btw — is this your outlet or do you have others as well?",
            "author": "emptyoverflow",
            "id": "fp62jox",
            "parent_id": "t1_fp2m9b4",
            "score": 3,
            "created_utc": 1588344858.0,
            "replies": [
                {
                    "body": "This is currently my outlet. I do write on r/writingprompts from time to time, but SLF is currently my main outlet. \n\nIf all things align, maybe one day I’ll start and finish a novel and publish it too. Maybe. One day.",
                    "author": null,
                    "id": "fp634td",
                    "parent_id": "t1_fp62jox",
                    "score": 3,
                    "created_utc": 1588345172.0,
                    "replies": [
                        {
                            "body": "Very cool. I could never get into prompts. And...there’s always NaNoWriMo! ;)",
                            "author": "emptyoverflow",
                            "id": "fp8zh0p",
                            "parent_id": "t1_fp634td",
                            "score": 1,
                            "created_utc": 1588408536.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "fp313vf",
            "parent_id": "t1_fp313u5",
            "score": 2,
            "created_utc": 1588271294.0,
            "replies": []
        },
        {
            "body": "Right but if they paid they’re $90 per month then they have the right to be there. The funny thing is Seekings slogan is “relationships on your terms” Sounds like you can find or ask for any type of relationship as long as it’s on your terms. In addition, if vanilla wasn’t an option, Seeking wouldn’t have a marriage minded tag.\n\nMy comment about Vanilla Seeking was a joke. Because women constantly come on here telling us about using Tinder for sugar, but most of them also get upset when men want to vanilla date on Seeking.",
            "author": "ruphun",
            "id": "fp34x0q",
            "parent_id": "t1_fp313u5",
            "score": -1,
            "created_utc": 1588273143.0,
            "replies": [
                {
                    "body": "Yes....but just bc you CAN do something doesn't mean you should. Meaning...just bc you can join a site specifically targeted for sugaring doesn't make it a good idea if what you are looking for is to NOT support a woman and have more of a 50/50 vanilla type thing.\nI mean....its like going on Grindr as a hetero female and getting mad when none of the guys have interest in dating me 🤷‍♀️. I think Tinder was originally considered as a hook-up type site but its moved over as more of a vanilla type dating place too. Still, some are still hung up on the idea that it's still just for free hookups.\nSadly, I cant post on tinder and say what I'm actually looking for (a sugar arrangement and not vanilla dating...been there, done that, got tired of dating for free). Unfortunately, if you write those words you'll get reported and booted off and it's hard to do it all covert. Hell....I still run into men around who dont know what the term \"mutually beneficial relationship\" actually means. As if sex was enough for me....ha!",
                    "author": "clair-cummings",
                    "id": "fp3k9a1",
                    "parent_id": "t1_fp34x0q",
                    "score": 2,
                    "created_utc": 1588280777.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I posted after reading the whole thread. It was my first go at reading all this SLF . Funny. You know the gender of the writer almost every time. Both sexes are out for their own interests. People just can't admit the truth. I think sugaring is a decent value for dudes but a real headache.  It's not prostitution. Prostitution would be Fentany and sugaring a weak bud.",
            "author": null,
            "id": "fpuw3dp",
            "parent_id": "t1_fps38fn",
            "score": 1,
            "created_utc": 1588925745.0,
            "replies": []
        },
        {
            "body": "Beauty sleep, my friend. 😉",
            "author": null,
            "id": "fp2nq77",
            "parent_id": "t1_fp2nkta",
            "score": 4,
            "created_utc": 1588264877.0,
            "replies": [
                {
                    "body": "Of course...I wouldn't expect anything less from someone so beautiful ;)\n\nGood to see you around and great story 👍🏻",
                    "author": "ruphun",
                    "id": "fp2o6sp",
                    "parent_id": "t1_fp2nq77",
                    "score": 1,
                    "created_utc": 1588265095.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is currently my outlet. I do write on r/writingprompts from time to time, but SLF is currently my main outlet. \n\nIf all things align, maybe one day I’ll start and finish a novel and publish it too. Maybe. One day.",
            "author": null,
            "id": "fp634td",
            "parent_id": "t1_fp62jox",
            "score": 3,
            "created_utc": 1588345172.0,
            "replies": [
                {
                    "body": "Very cool. I could never get into prompts. And...there’s always NaNoWriMo! ;)",
                    "author": "emptyoverflow",
                    "id": "fp8zh0p",
                    "parent_id": "t1_fp634td",
                    "score": 1,
                    "created_utc": 1588408536.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes....but just bc you CAN do something doesn't mean you should. Meaning...just bc you can join a site specifically targeted for sugaring doesn't make it a good idea if what you are looking for is to NOT support a woman and have more of a 50/50 vanilla type thing.\nI mean....its like going on Grindr as a hetero female and getting mad when none of the guys have interest in dating me 🤷‍♀️. I think Tinder was originally considered as a hook-up type site but its moved over as more of a vanilla type dating place too. Still, some are still hung up on the idea that it's still just for free hookups.\nSadly, I cant post on tinder and say what I'm actually looking for (a sugar arrangement and not vanilla dating...been there, done that, got tired of dating for free). Unfortunately, if you write those words you'll get reported and booted off and it's hard to do it all covert. Hell....I still run into men around who dont know what the term \"mutually beneficial relationship\" actually means. As if sex was enough for me....ha!",
            "author": "clair-cummings",
            "id": "fp3k9a1",
            "parent_id": "t1_fp34x0q",
            "score": 2,
            "created_utc": 1588280777.0,
            "replies": []
        },
        {
            "body": "Of course...I wouldn't expect anything less from someone so beautiful ;)\n\nGood to see you around and great story 👍🏻",
            "author": "ruphun",
            "id": "fp2o6sp",
            "parent_id": "t1_fp2nq77",
            "score": 1,
            "created_utc": 1588265095.0,
            "replies": []
        },
        {
            "body": "Very cool. I could never get into prompts. And...there’s always NaNoWriMo! ;)",
            "author": "emptyoverflow",
            "id": "fp8zh0p",
            "parent_id": "t1_fp634td",
            "score": 1,
            "created_utc": 1588408536.0,
            "replies": []
        }
    ]
}