{
    "title": "POT thinks I am being stupid for not wanting to meet at his house for first M&G",
    "post_id": "gdvk7c",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/gdvk7c/pot_thinks_i_am_being_stupid_for_not_wanting_to/",
    "author": "nikkylo",
    "body": "First time poster so please bear with me. \n\nI am talking to a POT from SA that is more or less in my area. He invited me over to his house to meet “because of the virus” but got upset when I said that we could just talk until things opened back up. We live in opposite directions of the main city so a drive to his house would be an hour and a half whereas a drive to the city is maybe 45 minutes. I offered to do a quick little M&G at a restaurant in the city and eat in the car or outside instead and he became even more upset with that. His response was: “I won’t kidnap or kill you. I am just trying to be nice. Why tf would I want to eat in my car or at a park when I have a beautiful house and wine to share?” then goes on to talk about how he will even pay XXX for me to come to his house for a platonic M&G so I “feel better about it.” \n\nI am curious on how I should proceed. Going to his house is not even an option. I know better than to meet at someone’s house. If he does come around to doing the M&G in the city, should I still be worried that he is disregarding my concerns for my safety and thinks that throwing out a nice number will change my mind?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/gdvk7c/pot_thinks_i_am_being_stupid_for_not_wanting_to/",
    "score": 98,
    "upvote_ratio": 0.94,
    "created_utc": 1588675781.0,
    "num_comments": 90,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "It's one thing for this guy to make a suggestion to meet at his home. Maybe he didn't think about safety concerns. But to get all defensive and aggressive when you said  no thanks and offered an alternative? Next this guy. These are psychological red flags.",
            "author": "BinghamtonSD",
            "id": "fpjpeet",
            "parent_id": "t3_gdvk7c",
            "score": 215,
            "created_utc": 1588676921.0,
            "replies": [
                {
                    "body": "This nails it.  His reaction is way more concerning than his initial suggestion.  Giving him another chance risks getting you involved in an abusive relationship.  **Remember that he is showing you his best behavior at this point.**",
                    "author": "duckydee543",
                    "id": "fpjpv2p",
                    "parent_id": "t1_fpjpeet",
                    "score": 138,
                    "created_utc": 1588677361.0,
                    "replies": [
                        {
                            "body": "THAT PART!",
                            "author": "hannooony",
                            "id": "fpk6h70",
                            "parent_id": "t1_fpjpv2p",
                            "score": 26,
                            "created_utc": 1588688924.0,
                            "replies": []
                        },
                        {
                            "body": "😅😅 I honestly didn’t think about this being the first impression. Have to say that he didn’t do too well",
                            "author": "nikkylo",
                            "id": "fplq4j1",
                            "parent_id": "t1_fpjpv2p",
                            "score": 8,
                            "created_utc": 1588717338.0,
                            "replies": []
                        },
                        {
                            "body": "Exactly, this is the damn honeymoon phase and the feels are supposed to be amazing. Move on.",
                            "author": "pfc_6ixgodconsumer",
                            "id": "fplmswz",
                            "parent_id": "t1_fpjpv2p",
                            "score": 4,
                            "created_utc": 1588715558.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Completely agree with this. (edit for lack of clarity)Anyone who objects to you having reasonable concerns about your safety should start your spidey sense tingling. Maybe say (assuming you still decide to go through with it, which I wouldn't particularily recommend), \"can I bring a gf along if she just thinks you are some guy that I might date and have a taser in my purse?\"\n\nNo reason at all he could not meet you for a \"wine and cheese\" picnic at a local park to make you feel more comfortable.",
                    "author": "SDInLeather",
                    "id": "fpkd1es",
                    "parent_id": "t1_fpjpeet",
                    "score": 17,
                    "created_utc": 1588692453.0,
                    "replies": []
                },
                {
                    "body": "Yup.",
                    "author": "Life_b_beautiful",
                    "id": "fpkbv42",
                    "parent_id": "t1_fpjpeet",
                    "score": 6,
                    "created_utc": 1588691835.0,
                    "replies": []
                },
                {
                    "body": "This.",
                    "author": "Haffbad",
                    "id": "fpl965w",
                    "parent_id": "t1_fpjpeet",
                    "score": 1,
                    "created_utc": 1588708570.0,
                    "replies": [
                        {
                            "body": "I did a meet and greet and you know what we had a picnic. Hadn’t had a picnic in years. But tell the truth it was really nice. If somebody has an issue with a picnic then move onto the next one",
                            "author": "DiligentHall5",
                            "id": "fpm2yea",
                            "parent_id": "t1_fpl965w",
                            "score": 1,
                            "created_utc": 1588724490.0,
                            "replies": [
                                {
                                    "body": "Picnic is a great idea. I'm not sure I'd do it for M&G, though, but that's just me. I'd rather do the M&G over appetizers and a glass of wine. I think most ladies would prefer the safety of a public gathering spot where she can easily exit. \n\nBut, I'd love to picnic subsequently, tho.",
                                    "author": "Haffbad",
                                    "id": "fpodhme",
                                    "parent_id": "t1_fpm2yea",
                                    "score": 2,
                                    "created_utc": 1588782649.0,
                                    "replies": [
                                        {
                                            "body": "We had wine and dinner. It was easy and under some cover of good trees. Had a blast for a M&G. Under the current circumstances and it was her idea so down scaling from the nice restaurant was good. I got there a little early and had it ready and she brought the food due to her diet. Really probably was one of my best meets I can remember and so simple.",
                                            "author": "DiligentHall5",
                                            "id": "fpom0as",
                                            "parent_id": "t1_fpodhme",
                                            "score": 2,
                                            "created_utc": 1588786746.0,
                                            "replies": [
                                                {
                                                    "body": "That's awesome! Sounds like a great idea. She was obvi comfortable with it. I hope you found a new lady with whom you can connect.",
                                                    "author": "Haffbad",
                                                    "id": "fpou24v",
                                                    "parent_id": "t1_fpom0as",
                                                    "score": 2,
                                                    "created_utc": 1588790665.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bullying and pressuring you to go outside your limits (at any time, but especially before you have even met) is never a good sign. I hope you will block this guy and not give him a second chance.",
            "author": "OpenDoorSD",
            "id": "fpjpdjs",
            "parent_id": "t3_gdvk7c",
            "score": 72,
            "created_utc": 1588676897.0,
            "replies": [
                {
                    "body": "Blocked and deleted",
                    "author": "nikkylo",
                    "id": "fplq736",
                    "parent_id": "t1_fpjpdjs",
                    "score": 5,
                    "created_utc": 1588717376.0,
                    "replies": []
                },
                {
                    "body": "I actually can second this. I noticed guys who want to do something sexual will keep pushing the agenda. 😪",
                    "author": "BabySpiceeee",
                    "id": "fpjtzcn",
                    "parent_id": "t1_fpjpdjs",
                    "score": 20,
                    "created_utc": 1588680935.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fpkjlt3",
                            "parent_id": "t1_fpjtzcn",
                            "score": -6,
                            "created_utc": 1588695853.0,
                            "replies": [
                                {
                                    "body": "Not on a first meet for many (most?)",
                                    "author": "yeehaw_yall",
                                    "id": "fpl4r5w",
                                    "parent_id": "t1_fpkjlt3",
                                    "score": 6,
                                    "created_utc": 1588706344.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Agreed, and throwing money at you to go outside your limits is a slippery slope.\n\nI find the good quality SDs will value a baby who makes smart decisions and sticks to her boundaries.\n\n@OP. I’d personally reply with something along these lines and then stop responding. If he comes back in a week or two then you know you stood your ground and he respects that. “Unfortunately it appears we may not have the same priorities. To me, my safety and comfort must come first if I want to be able to meet my partners needs. I want my SD to be happy so it would be irresponsible of me to go into an arrangement if I had any reservations about my ability to do that because I know I might be holding back. If you change your mind and are willing to make a small sacrifices for our initial meet, please let me know and we can schedule something. Otherwise I wish you the best of luck in your search.”",
                    "author": "LVSugarBebe",
                    "id": "fpm3qpf",
                    "parent_id": "t1_fpjpdjs",
                    "score": 5,
                    "created_utc": 1588724946.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "More red flags than at a Communist Party rally in China.\n\nRed Flags:\n\n1. Rule 1 of SR.  Always meet a POT somewhere public for the first time.  Anyone who ignores that, its a red flag.\n2. Anyone who does not respect your views.  Its a red flag.\n3. Anyone who swears at you.  Its a red flag.\n4. Anyone who \"promises\" you money to overcome a concern you have.  Its a red flag.  And probably a scam.\n\nSA has a BLOCK button for a reason.  The reason is people like this.",
            "author": "bradpitt3",
            "id": "fpjz9mw",
            "parent_id": "t3_gdvk7c",
            "score": 68,
            "created_utc": 1588684676.0,
            "replies": [
                {
                    "body": "Amen 🙏🏽",
                    "author": "YogiFun",
                    "id": "fpkif8f",
                    "parent_id": "t1_fpjz9mw",
                    "score": 3,
                    "created_utc": 1588695259.0,
                    "replies": []
                },
                {
                    "body": "😂😂😂not a Communist Party rally in China. That honestly made my day but thank you for the advice. I do not take kindly to be cursed at (or in the context of conversation as he said) so that was a big flag for me on top of the others",
                    "author": "nikkylo",
                    "id": "fplqbyr",
                    "parent_id": "t1_fpjz9mw",
                    "score": 2,
                    "created_utc": 1588717447.0,
                    "replies": []
                },
                {
                    "body": "Right on.",
                    "author": "Haffbad",
                    "id": "fpl98kq",
                    "parent_id": "t1_fpjz9mw",
                    "score": 1,
                    "created_utc": 1588708603.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly you should just stop talking to him entirely. He doesn't respect your boundaries before you've even met him. Just imagine how comfortable he'll be crossing your boundaries once he knows things about you. He is showing that he is demanding, pompous, disrespectful, and rude. Do yourself a favor and move on.",
            "author": "atypicalsb",
            "id": "fpjqwfy",
            "parent_id": "t3_gdvk7c",
            "score": 31,
            "created_utc": 1588678321.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fpk4djy",
            "parent_id": "t3_gdvk7c",
            "score": 30,
            "created_utc": 1588687751.0,
            "replies": [
                {
                    "body": "Lol Right?! It’s also very dismissive of her concerns like she is being stupid for being cautious.",
                    "author": "ThatBrownSugarBabe",
                    "id": "fplqmg3",
                    "parent_id": "t1_fpk4djy",
                    "score": 2,
                    "created_utc": 1588717606.0,
                    "replies": []
                },
                {
                    "body": "That is exactly what I said🙃🙄 Then he just tells me how he wouldn’t hurt a fly and would be worried about me killing him",
                    "author": "nikkylo",
                    "id": "fplqexl",
                    "parent_id": "t1_fpk4djy",
                    "score": 1,
                    "created_utc": 1588717492.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"I'm looking for someone who respects my personal decisions, as much as I would/will respect theirs.   We've not even met - let alone began any type of arrangement - and I already feel uncomfortable.  It's glaringly obvious that you feel that it should be your way or the highway, and I'm going to choose the highway; if for no other reason, than to err on the side of caution and put my personal safety first.\"\n\nI'm an SD, but I get the same types of pushy SB's all the time.  \n\nIf I'm uncomfortable at all, or I feel that someone doesn't respect my boundaries - I'm out.   You should never compromise for a dollar. \n\nOnly you can decide what's right for you.",
            "author": null,
            "id": "fpjoxug",
            "parent_id": "t3_gdvk7c",
            "score": 44,
            "created_utc": 1588676477.0,
            "replies": [
                {
                    "body": "I like this response a lot!! I just told him that I wasn’t comfortable and blocked him when he began being overly sexual but I definitely could have been more elegant",
                    "author": "nikkylo",
                    "id": "fplqjsh",
                    "parent_id": "t1_fpjoxug",
                    "score": 1,
                    "created_utc": 1588717566.0,
                    "replies": [
                        {
                            "body": "Hey, you got the same result, so good on you",
                            "author": null,
                            "id": "fplrplg",
                            "parent_id": "t1_fplqjsh",
                            "score": 1,
                            "created_utc": 1588718193.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He doesn’t respect your health or his. And pandemic or not, never do a first meeting at home. Public places only!",
            "author": null,
            "id": "fpjokcf",
            "parent_id": "t3_gdvk7c",
            "score": 18,
            "created_utc": 1588676109.0,
            "replies": []
        },
        {
            "body": "Drop him he’s gonna murder you",
            "author": "babylina",
            "id": "fpk0n5t",
            "parent_id": "t3_gdvk7c",
            "score": 12,
            "created_utc": 1588685549.0,
            "replies": []
        },
        {
            "body": "Fuck this guy (figuratively, not literally). Making a date feel safe and comfortable should be any gentleman's FIRST priority.",
            "author": "roscoe7585",
            "id": "fpk37l0",
            "parent_id": "t3_gdvk7c",
            "score": 10,
            "created_utc": 1588687072.0,
            "replies": []
        },
        {
            "body": "No. \nRed flag. \nNO. \n\nFirst meeting can still be at a coffee shop or park even with this quarantine. Keep 6 ft apart. Going to someone’s home who you’ve never met before, seems like a bad choice. \n\nIf you communicated being uncomfortable & he thinks you’re “stupid”, - MOVE THE FUCK ON !!!!\n\nLet me say it again. Move on. \n\nWhen someone shows you their true colors, believe them the first time. \n\nSet boundaries and don’t let anyone - not even a man you think is gonna to spoil you, feel bad for them. \n\nProtect yourself.",
            "author": "sugalovah",
            "id": "fpk5hjq",
            "parent_id": "t3_gdvk7c",
            "score": 10,
            "created_utc": 1588688373.0,
            "replies": []
        },
        {
            "body": "Nothing wrong with him asking but his reaction to you declining makes him a Next.",
            "author": "whatshouldIdonow8907",
            "id": "fpjzbft",
            "parent_id": "t3_gdvk7c",
            "score": 7,
            "created_utc": 1588684708.0,
            "replies": []
        },
        {
            "body": "If he really got that aggressive then you need to block him and move on.\nThat kind of behavior is definitely a red flag.",
            "author": "DevinMills93",
            "id": "fpjtfo2",
            "parent_id": "t3_gdvk7c",
            "score": 15,
            "created_utc": 1588680494.0,
            "replies": []
        },
        {
            "body": "He disrespected you when you stated your concerns. Right off the bat he exposed himself as a jerk, and you should move on.",
            "author": "GSSD",
            "id": "fpjxu8r",
            "parent_id": "t3_gdvk7c",
            "score": 7,
            "created_utc": 1588683737.0,
            "replies": []
        },
        {
            "body": "I once had a POT literally degrade me because I wanted to meet him at the restaurant rather than him picking me up and driving us there. Mind you, I’ve never met this guy before we strictly only texts via SA. If they can’t even respect the simplest request and your boundaries, usually means they’re batshit crazy with evil intent. I can’t stress this enough, always always ALWAYS go with your gut feeling.",
            "author": "Chatnoir567",
            "id": "fpki0u4",
            "parent_id": "t3_gdvk7c",
            "score": 7,
            "created_utc": 1588695056.0,
            "replies": [
                {
                    "body": "Did he think you wanted him to know where you lived or did he think that you wanted to be the next star in “Taken”🤔",
                    "author": "nikkylo",
                    "id": "fplr04x",
                    "parent_id": "t1_fpki0u4",
                    "score": 1,
                    "created_utc": 1588717810.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hard pass. He can’t eve use common decency before meeting you. 100% he pressures you for sex on the first meet. 98% he’s an asshole. If he doesn’t know by now that women would be wary to meet an unknown man at his residence then this guy has zero street smarts and is oblivious to life.",
            "author": "Annieinjammies",
            "id": "fpkkxad",
            "parent_id": "t3_gdvk7c",
            "score": 6,
            "created_utc": 1588696522.0,
            "replies": [
                {
                    "body": "Once I told him that I was uncomfortable, he said that he would do the car date if I masturbated beside him and gave him head😑 Mind you, I have never met this man and only been talking to him for a couple of weeks and he makes such a request",
                    "author": "nikkylo",
                    "id": "fplqw30",
                    "parent_id": "t1_fpkkxad",
                    "score": 1,
                    "created_utc": 1588717749.0,
                    "replies": [
                        {
                            "body": "Absolutely not. That just tells you he wants you indoors because he wants to do something sexual. When a POT SD knows they only want sex or something sexual, they jump to indoor activities right off the bat. They won't waste their time suggesting a dinner date or quick coffee date. If he's trying to find an alternative that STILL centers around something sexual, he is a big hard pass. Please don't entertain him.",
                            "author": null,
                            "id": "fpm1m5a",
                            "parent_id": "t1_fplqw30",
                            "score": 3,
                            "created_utc": 1588723711.0,
                            "replies": []
                        },
                        {
                            "body": "I might even go as far as to say there is a very good chance that this guy is a predator. Stay far - and I mean fucking FAR - away.",
                            "author": "Annieinjammies",
                            "id": "fpr1oxh",
                            "parent_id": "t1_fplqw30",
                            "score": 2,
                            "created_utc": 1588839261.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My POT suggested to meet up for coffee and talk in the parking lot like cops when I mentioned that I was concern to meet right now due to social distancing. I still politely declined but he never made me feel bad about it and we are still talking. His pushy reaction is definitely a red flag! Run girl!",
            "author": "angiemama801",
            "id": "fpks9bg",
            "parent_id": "t3_gdvk7c",
            "score": 8,
            "created_utc": 1588700148.0,
            "replies": []
        },
        {
            "body": "All of this screams no! When guys are like this, I always remind them that they could be putting themselves at risk as well. How do they know that I'm not going to show up with a weapon and rob them? Or, worse, send someone else to do so? This one guy wanted to do drugs (I don't do drugs). I said, \"Be careful, dude. Guys aren't the only ones who can drug and take advantage of someone. See: Hustlers.\" :)",
            "author": null,
            "id": "fpl5i8z",
            "parent_id": "t3_gdvk7c",
            "score": 6,
            "created_utc": 1588706731.0,
            "replies": []
        },
        {
            "body": "Everything about this situation is telling you to politely decline any further contact with this person. I would suggest blocking him.",
            "author": "princesspangolinpie",
            "id": "fpk6vh6",
            "parent_id": "t3_gdvk7c",
            "score": 4,
            "created_utc": 1588689138.0,
            "replies": []
        },
        {
            "body": "Dude this has red flags all over it no.",
            "author": null,
            "id": "fpkka5o",
            "parent_id": "t3_gdvk7c",
            "score": 5,
            "created_utc": 1588696193.0,
            "replies": []
        },
        {
            "body": "Just ignore and don't talk to him ever again. That's already one red flag if he's not respecting what you feel comfortable with.",
            "author": "haeshelby",
            "id": "fpk9m9p",
            "parent_id": "t3_gdvk7c",
            "score": 4,
            "created_utc": 1588690628.0,
            "replies": []
        },
        {
            "body": "First meetings should always be used as a vetting process for both SDs and SBs. Taking a chance to look at their behavior, personality, if you guys actually click for an arrangement. \n\nIf either party feels something is off or uncomfortable I wouldn't agree to it. Going to a stranger's house is hella scary.",
            "author": null,
            "id": "fpk9mrw",
            "parent_id": "t3_gdvk7c",
            "score": 3,
            "created_utc": 1588690636.0,
            "replies": []
        },
        {
            "body": "Don’t ignore the red flags",
            "author": "ebonyxqueenx",
            "id": "fpkbo8t",
            "parent_id": "t3_gdvk7c",
            "score": 4,
            "created_utc": 1588691733.0,
            "replies": []
        },
        {
            "body": "I am curious on how I should proceed.\n\nEJECT........EJECT ................ you know everything you need to know",
            "author": "pinotandsugar",
            "id": "fpkg9om",
            "parent_id": "t3_gdvk7c",
            "score": 4,
            "created_utc": 1588694144.0,
            "replies": []
        },
        {
            "body": "He doesn’t give a fuck about your boundaries. \nUs ladies need to cut off the communication cause at this point you’re gonna go back and forth...so don’t waste your time.",
            "author": null,
            "id": "fpkjjz8",
            "parent_id": "t3_gdvk7c",
            "score": 3,
            "created_utc": 1588695828.0,
            "replies": [
                {
                    "body": "Exactly, I agree. Going back and forth sis pointless, especially when someone like him won't even see where he was wrong. Just block and continue with your day.",
                    "author": null,
                    "id": "fpm1skz",
                    "parent_id": "t1_fpkjjz8",
                    "score": 3,
                    "created_utc": 1588723815.0,
                    "replies": [
                        {
                            "body": "It’s this scarcity mentality! Like mami, there’s better out there! 😭",
                            "author": null,
                            "id": "fpmciq1",
                            "parent_id": "t1_fpm1skz",
                            "score": 1,
                            "created_utc": 1588730109.0,
                            "replies": [
                                {
                                    "body": "Yes definitely and that mentality will be the biggest downfall of SBs! There's men 10x better out there, like wake up !",
                                    "author": null,
                                    "id": "fpmcm64",
                                    "parent_id": "t1_fpmciq1",
                                    "score": 2,
                                    "created_utc": 1588730166.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "stick to your guns. a relationship that starts out like this has little chance of success",
            "author": "doctorcoolpop",
            "id": "fpkjpkx",
            "parent_id": "t3_gdvk7c",
            "score": 3,
            "created_utc": 1588695906.0,
            "replies": []
        },
        {
            "body": "Don't go there . If he can't wait then move on",
            "author": "electricsmith19",
            "id": "fpkm5oc",
            "parent_id": "t3_gdvk7c",
            "score": 3,
            "created_utc": 1588697132.0,
            "replies": []
        },
        {
            "body": "Red flag. Drop him.",
            "author": "SweetBitch713",
            "id": "fpkmmkn",
            "parent_id": "t3_gdvk7c",
            "score": 5,
            "created_utc": 1588697364.0,
            "replies": []
        },
        {
            "body": "Please don’t go see him. I feel like him wanting you to go to his house right away is a red flag. Also please please always meet someone in public first and do a google search on them and a beenverified or something like that. Give all the guys info to a friend and share location. (And this is even public dates- even people you’ve seen a couple times. Your safety is top priority and you can never be too careful.",
            "author": "enigmaticHOE",
            "id": "fpkmnee",
            "parent_id": "t3_gdvk7c",
            "score": 4,
            "created_utc": 1588697375.0,
            "replies": []
        },
        {
            "body": "I knew this would happen during this time. People will take advantage of this pandemic and try to get a cheap date and easy lay especially on SA. If people have a problem with only talking on the phone or video chat then they should wait until the lockdown is over to talk to people. No need to pressure someone to risk their safety whether that is risking getting COVID or raped and killed.",
            "author": "liliflower85",
            "id": "fpkpkgh",
            "parent_id": "t3_gdvk7c",
            "score": 4,
            "created_utc": 1588698817.0,
            "replies": [
                {
                    "body": "^^^This right here. I can’t tell you how many people I have blocked because they are looking to have sex on the first date. I thought I had finally found a good one and then he does this",
                    "author": "nikkylo",
                    "id": "fplrmiu",
                    "parent_id": "t1_fpkpkgh",
                    "score": 2,
                    "created_utc": 1588718146.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have been a SD many times and I always want a M&G to be in public. I have zero problem with the SB choosing the location (as long as it isn't In a bad part of town) . This protects both the SB and the SD. Yes I have met some SB's that are total nut jobs just like I know the same is true for some SD's.. a public place is always best for a M&G......",
            "author": "erickraemer",
            "id": "fpky0hi",
            "parent_id": "t3_gdvk7c",
            "score": 4,
            "created_utc": 1588702996.0,
            "replies": [
                {
                    "body": "Absolutely right. NEVER violate rule no. 1... to first meet in a public place. I usually go one step further and tell my POT SB that our meeting will only be for like an hour or so. And I’ve stuck to that in all but one  instance. That just takes any pressure off about next steps that day. Unless you both really catch a good vibe.",
                    "author": "tg3000a",
                    "id": "fplgegi",
                    "parent_id": "t1_fpky0hi",
                    "score": 3,
                    "created_utc": 1588712235.0,
                    "replies": [
                        {
                            "body": "I completely agree.. though I did do a number of M&G at a Mini Golf place.. it's actually a totally fun first date kind of thing.. and you can totally see you POT SB attitude regarding how competitive she is.. it is truly just supposed to be fun with no score keeping and can get quite flirty if there is a connection..",
                            "author": "erickraemer",
                            "id": "fplh4pn",
                            "parent_id": "t1_fplgegi",
                            "score": 2,
                            "created_utc": 1588712608.0,
                            "replies": [
                                {
                                    "body": "Mini Golf sounds like an amazing M&G. It takes all of the formality out of it and just lets both people be themselves",
                                    "author": "nikkylo",
                                    "id": "fplr4rl",
                                    "parent_id": "t1_fplh4pn",
                                    "score": 2,
                                    "created_utc": 1588717880.0,
                                    "replies": [
                                        {
                                            "body": "Exactly... Being me, I would practice and had the holes down pretty good, I honestly didn't have a whole lot else going on. I met 2 totally awesome SB's and had a grand time and we stayed together for over a year each.. I also met a total Bitch SB, she never finished the game... I figured out it is an awesome \"First Date'\" for any man and woman, not just POT SD and SB",
                                            "author": "erickraemer",
                                            "id": "fpls4ma",
                                            "parent_id": "t1_fplr4rl",
                                            "score": 1,
                                            "created_utc": 1588718417.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not just red but NEON RED red flags. Nope.",
            "author": "Emmahfknlee",
            "id": "fpl5ntz",
            "parent_id": "t3_gdvk7c",
            "score": 3,
            "created_utc": 1588706809.0,
            "replies": []
        },
        {
            "body": "Personal rule for me is if a guy ever becomes pushy or defensive about how I want to do meets, I discontinue contact with them. If these people behave this way, they do not have any respect or understanding for my feelings and safety. Best case scenario, they are ignorant or selfish. Worst case scenario, they become abusive and controlling once you actually meet them in person and that is putting your life in danger. Just isn't worth it.",
            "author": "chloe_aw",
            "id": "fpl8vp7",
            "parent_id": "t3_gdvk7c",
            "score": 4,
            "created_utc": 1588708427.0,
            "replies": []
        },
        {
            "body": "I don't have to say anything that hasn't already been said.  \n\n🙅 = Stop talking to him/her\n❌ = Decline ALL FUTURE CONTACT\n🚫 = Block profiles\n🔕 = Remove Notifications\n🔇 = Mute Ringtones\n📵 = Block phone numbers",
            "author": "Knosha",
            "id": "fplhjzq",
            "parent_id": "t3_gdvk7c",
            "score": 4,
            "created_utc": 1588712827.0,
            "replies": []
        },
        {
            "body": "Yeah, whether you are a SB or a SD you should always meet in public at first.",
            "author": null,
            "id": "fpllv27",
            "parent_id": "t3_gdvk7c",
            "score": 4,
            "created_utc": 1588715060.0,
            "replies": []
        },
        {
            "body": "Way too aggressive. Even if not dangerous, not someone you want to hang out with. Move on.",
            "author": "marker3000",
            "id": "fplnmdn",
            "parent_id": "t3_gdvk7c",
            "score": 3,
            "created_utc": 1588715994.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fpk7c3i",
            "parent_id": "t3_gdvk7c",
            "score": 3,
            "created_utc": 1588689392.0,
            "replies": [
                {
                    "body": "To say the least lol",
                    "author": "nikkylo",
                    "id": "fpprecv",
                    "parent_id": "t1_fpk7c3i",
                    "score": 2,
                    "created_utc": 1588807688.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fpksrbw",
            "parent_id": "t3_gdvk7c",
            "score": 3,
            "created_utc": 1588700395.0,
            "replies": [
                {
                    "body": "She sounds like a very formidable woman. You have a very great situation going on there so hold onto her",
                    "author": "nikkylo",
                    "id": "fplrqsa",
                    "parent_id": "t1_fpksrbw",
                    "score": 2,
                    "created_utc": 1588718210.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For maximum volume: block and move on. I've blocked a few SDs this week for trying to push me to go to their home and not respecting my boundaries. They aren't worth it.",
            "author": null,
            "id": "fpkssrb",
            "parent_id": "t3_gdvk7c",
            "score": 3,
            "created_utc": 1588700415.0,
            "replies": [
                {
                    "body": "I think my block button is worn out almost",
                    "author": "nikkylo",
                    "id": "fplrtr2",
                    "parent_id": "t1_fpkssrb",
                    "score": 1,
                    "created_utc": 1588718255.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow. Thank you all so much for the advice!! I love how quick everyone was to help and how nice (towards me) everyone was. I knew that continuing to talk to him wouldn’t be the best but I allowed the fact that he was one of the few SD’s in my area make me second guess myself. \n\nSN: I just came from getting a root canal and tell me why this clown said that he would pay for it if I came over🤦🏽‍♀️🤦🏽‍♀️ This is why we have block and delete.",
            "author": "nikkylo",
            "id": "fplpykj",
            "parent_id": "t3_gdvk7c",
            "score": 3,
            "created_utc": 1588717248.0,
            "replies": []
        },
        {
            "body": "Neither would I :)",
            "author": "bookworm010101",
            "id": "fpk24at",
            "parent_id": "t3_gdvk7c",
            "score": 2,
            "created_utc": 1588686442.0,
            "replies": []
        },
        {
            "body": "You two are not compatible. Move on. It's that easy :)",
            "author": "SDNH79",
            "id": "fpk2bhl",
            "parent_id": "t3_gdvk7c",
            "score": 2,
            "created_utc": 1588686555.0,
            "replies": []
        },
        {
            "body": "Honestly a good response is going to need some context. If this was the first time you said no to anything, then yeah huge red flag. Politely tell him whatever you think will let him down easy without lying and never talk to him again.\n\nIf he's been talking to you about hanging out since before the lockdown started and this is the 17th thing you said no to after he asked to have some phone conversations and get a G-rated pic and you turned down seven other meetings then a certain amount of frustration makes a little more sense.",
            "author": "EvilDomGM",
            "id": "fpkh5ga",
            "parent_id": "t3_gdvk7c",
            "score": 2,
            "created_utc": 1588694606.0,
            "replies": [
                {
                    "body": "He did not want to have a phone conversation or video chat when I offered to get to know each other during the quarantine. He said he only does M&G’s and will not exchange money beforehand (which I understand). I told him that he would have to do a video chat before we meet so I can validate that it is him and it was like pulling teeth. Then he asks me to go to his house and this happens. We have only been talking for a couple of weeks",
                    "author": "nikkylo",
                    "id": "fplrh30",
                    "parent_id": "t1_fpkh5ga",
                    "score": 2,
                    "created_utc": 1588718065.0,
                    "replies": [
                        {
                            "body": "Yeah, best case scenario is someone who's incredibly socially awkward. Likely worse.",
                            "author": "EvilDomGM",
                            "id": "fpnw7gc",
                            "parent_id": "t1_fplrh30",
                            "score": 1,
                            "created_utc": 1588773830.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I say no.  Attitude is off.  I don't think the invitation to his home is that weird, but his disregard for your comfort level makes me think you're better off without this sort of attitude in your life.",
            "author": null,
            "id": "fpl5b4c",
            "parent_id": "t3_gdvk7c",
            "score": 2,
            "created_utc": 1588706630.0,
            "replies": []
        },
        {
            "body": "Are you still talking to him or have you stopped talking to him?",
            "author": "InfiniteTemptation",
            "id": "fplb65h",
            "parent_id": "t3_gdvk7c",
            "score": 2,
            "created_utc": 1588709579.0,
            "replies": [
                {
                    "body": "I stopped talking to him when he brought it up again by saying “Aww baby I am sorry that your tooth hurts. I have something else that could go in your mouth in the car. It’ll make you forget all about that pain and I’ll give you XXXX (double what he initially offered) to cover the dental work and the work that I’m about to do” 🙃almost verbatim. I made the mistake of deleting after I blocked so I can’t give you the stupid emojis that went with that",
                    "author": "nikkylo",
                    "id": "fpls9gd",
                    "parent_id": "t1_fplb65h",
                    "score": 3,
                    "created_utc": 1588718491.0,
                    "replies": [
                        {
                            "body": "IF any other stupid, disrespectful macho a$$hole does this to you again, you send him a photo of a \"buttplug\", and tell him to start getting ready by lubing his a$$ because you are coming to his place with a 12 inch black dildo to fck the crap out of him and take the \"monthly allowance\"! They will disappear and run for their lives anyway! hahaha\n\n&#x200B;\n\n\"... I have something else that could go in your mouth in the car...  \" he is a total $hithead!",
                            "author": "charming_gentleman49",
                            "id": "fpns244",
                            "parent_id": "t1_fpls9gd",
                            "score": 2,
                            "created_utc": 1588771348.0,
                            "replies": []
                        },
                        {
                            "body": "He is not only a very disrespectful person but also a very disgusting person! Glad you blocked him!",
                            "author": "charming_gentleman49",
                            "id": "fpmd732",
                            "parent_id": "t1_fpls9gd",
                            "score": 1,
                            "created_utc": 1588730517.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Have you two tried doing a skype, or some kind of a live video chat at all? You can easily do this for 1-2 minutes, and see if this is a normal, safe and sane person or not. This should be done \"prior to\" considering to do your first M&G. I believe resorting to \"text messaging only\" (whether on the SA site or thru your mobile phone) and then going to a M&G is an archaic way of doing things.  It should be texting, live video chatting and then M&G.\n\nBut as others have posted he has loads of red flags and he is a \"disrespectful person\". And the damage is already done...",
            "author": "charming_gentleman49",
            "id": "fpk3hao",
            "parent_id": "t3_gdvk7c",
            "score": 2,
            "created_utc": 1588687230.0,
            "replies": [
                {
                    "body": "He didn’t want to skype or video chat when I offered. He finally agreed when we talked about setting a date, time, and location for the M&G",
                    "author": "nikkylo",
                    "id": "fplsdoo",
                    "parent_id": "t1_fpk3hao",
                    "score": 1,
                    "created_utc": 1588718556.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Please leave this POT alone and block him everywhere. His behavior is totally unacceptable. Inviting you to his house during a pandemic is not necessary wrong( I personally don't know any SD who offered to have a house meet during a pandemic)  but his defensiveness is an automatic no.",
            "author": null,
            "id": "fpm1df9",
            "parent_id": "t3_gdvk7c",
            "score": 1,
            "created_utc": 1588723571.0,
            "replies": []
        },
        {
            "body": "Personally, I am a very very respectful SB. You can be an asshole once or twice and I will still be polite/respectful but once you keep pushing and pushing,  all that respect goes out the window. I would literally tell this guy to go fuck himself, and then go about my day peacefully.",
            "author": null,
            "id": "fpm22gc",
            "parent_id": "t3_gdvk7c",
            "score": 1,
            "created_utc": 1588723974.0,
            "replies": []
        },
        {
            "body": "If someone offers a meet at their home I don’t get concerned about it. I assume they haven’t considered the safety aspects for a woman as a man often doesn’t have the need for the same thought process as we do in regards to our personal safety. \n\nWhat would concern me is if his response was defensive after I had expressed my concerns. I would be further alarmed that he would offer more money for me to compromise myself and ignore my concerns. It suggests a mentality that “anything is acceptable so long as you get compensated right?!”.\n\nFor me I would no longer pursue this arrangement. All he had to do was meet you publicly and by the second or third meet you may have been happy to go to his home. His aggressive eagerness suggests his intention was to “conquer” you and in his domain that would of been more achievable.",
            "author": null,
            "id": "fpmdkc9",
            "parent_id": "t3_gdvk7c",
            "score": 1,
            "created_utc": 1588730739.0,
            "replies": []
        },
        {
            "body": "A good partner in any adventure is one who considers your viewpoint and works to find a compromise that makes you both happy.\n\nA bad one is one who bullies you into seeing it his way, using money as a cudgel.\n\nThis will only get worse.",
            "author": null,
            "id": "fpmnh4e",
            "parent_id": "t3_gdvk7c",
            "score": 1,
            "created_utc": 1588737016.0,
            "replies": []
        },
        {
            "body": "This nails it.  His reaction is way more concerning than his initial suggestion.  Giving him another chance risks getting you involved in an abusive relationship.  **Remember that he is showing you his best behavior at this point.**",
            "author": "duckydee543",
            "id": "fpjpv2p",
            "parent_id": "t1_fpjpeet",
            "score": 138,
            "created_utc": 1588677361.0,
            "replies": [
                {
                    "body": "THAT PART!",
                    "author": "hannooony",
                    "id": "fpk6h70",
                    "parent_id": "t1_fpjpv2p",
                    "score": 26,
                    "created_utc": 1588688924.0,
                    "replies": []
                },
                {
                    "body": "😅😅 I honestly didn’t think about this being the first impression. Have to say that he didn’t do too well",
                    "author": "nikkylo",
                    "id": "fplq4j1",
                    "parent_id": "t1_fpjpv2p",
                    "score": 8,
                    "created_utc": 1588717338.0,
                    "replies": []
                },
                {
                    "body": "Exactly, this is the damn honeymoon phase and the feels are supposed to be amazing. Move on.",
                    "author": "pfc_6ixgodconsumer",
                    "id": "fplmswz",
                    "parent_id": "t1_fpjpv2p",
                    "score": 4,
                    "created_utc": 1588715558.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Completely agree with this. (edit for lack of clarity)Anyone who objects to you having reasonable concerns about your safety should start your spidey sense tingling. Maybe say (assuming you still decide to go through with it, which I wouldn't particularily recommend), \"can I bring a gf along if she just thinks you are some guy that I might date and have a taser in my purse?\"\n\nNo reason at all he could not meet you for a \"wine and cheese\" picnic at a local park to make you feel more comfortable.",
            "author": "SDInLeather",
            "id": "fpkd1es",
            "parent_id": "t1_fpjpeet",
            "score": 17,
            "created_utc": 1588692453.0,
            "replies": []
        },
        {
            "body": "Yup.",
            "author": "Life_b_beautiful",
            "id": "fpkbv42",
            "parent_id": "t1_fpjpeet",
            "score": 6,
            "created_utc": 1588691835.0,
            "replies": []
        },
        {
            "body": "This.",
            "author": "Haffbad",
            "id": "fpl965w",
            "parent_id": "t1_fpjpeet",
            "score": 1,
            "created_utc": 1588708570.0,
            "replies": [
                {
                    "body": "I did a meet and greet and you know what we had a picnic. Hadn’t had a picnic in years. But tell the truth it was really nice. If somebody has an issue with a picnic then move onto the next one",
                    "author": "DiligentHall5",
                    "id": "fpm2yea",
                    "parent_id": "t1_fpl965w",
                    "score": 1,
                    "created_utc": 1588724490.0,
                    "replies": [
                        {
                            "body": "Picnic is a great idea. I'm not sure I'd do it for M&G, though, but that's just me. I'd rather do the M&G over appetizers and a glass of wine. I think most ladies would prefer the safety of a public gathering spot where she can easily exit. \n\nBut, I'd love to picnic subsequently, tho.",
                            "author": "Haffbad",
                            "id": "fpodhme",
                            "parent_id": "t1_fpm2yea",
                            "score": 2,
                            "created_utc": 1588782649.0,
                            "replies": [
                                {
                                    "body": "We had wine and dinner. It was easy and under some cover of good trees. Had a blast for a M&G. Under the current circumstances and it was her idea so down scaling from the nice restaurant was good. I got there a little early and had it ready and she brought the food due to her diet. Really probably was one of my best meets I can remember and so simple.",
                                    "author": "DiligentHall5",
                                    "id": "fpom0as",
                                    "parent_id": "t1_fpodhme",
                                    "score": 2,
                                    "created_utc": 1588786746.0,
                                    "replies": [
                                        {
                                            "body": "That's awesome! Sounds like a great idea. She was obvi comfortable with it. I hope you found a new lady with whom you can connect.",
                                            "author": "Haffbad",
                                            "id": "fpou24v",
                                            "parent_id": "t1_fpom0as",
                                            "score": 2,
                                            "created_utc": 1588790665.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Blocked and deleted",
            "author": "nikkylo",
            "id": "fplq736",
            "parent_id": "t1_fpjpdjs",
            "score": 5,
            "created_utc": 1588717376.0,
            "replies": []
        },
        {
            "body": "I actually can second this. I noticed guys who want to do something sexual will keep pushing the agenda. 😪",
            "author": "BabySpiceeee",
            "id": "fpjtzcn",
            "parent_id": "t1_fpjpdjs",
            "score": 20,
            "created_utc": 1588680935.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fpkjlt3",
                    "parent_id": "t1_fpjtzcn",
                    "score": -6,
                    "created_utc": 1588695853.0,
                    "replies": [
                        {
                            "body": "Not on a first meet for many (most?)",
                            "author": "yeehaw_yall",
                            "id": "fpl4r5w",
                            "parent_id": "t1_fpkjlt3",
                            "score": 6,
                            "created_utc": 1588706344.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed, and throwing money at you to go outside your limits is a slippery slope.\n\nI find the good quality SDs will value a baby who makes smart decisions and sticks to her boundaries.\n\n@OP. I’d personally reply with something along these lines and then stop responding. If he comes back in a week or two then you know you stood your ground and he respects that. “Unfortunately it appears we may not have the same priorities. To me, my safety and comfort must come first if I want to be able to meet my partners needs. I want my SD to be happy so it would be irresponsible of me to go into an arrangement if I had any reservations about my ability to do that because I know I might be holding back. If you change your mind and are willing to make a small sacrifices for our initial meet, please let me know and we can schedule something. Otherwise I wish you the best of luck in your search.”",
            "author": "LVSugarBebe",
            "id": "fpm3qpf",
            "parent_id": "t1_fpjpdjs",
            "score": 5,
            "created_utc": 1588724946.0,
            "replies": []
        },
        {
            "body": "Amen 🙏🏽",
            "author": "YogiFun",
            "id": "fpkif8f",
            "parent_id": "t1_fpjz9mw",
            "score": 3,
            "created_utc": 1588695259.0,
            "replies": []
        },
        {
            "body": "😂😂😂not a Communist Party rally in China. That honestly made my day but thank you for the advice. I do not take kindly to be cursed at (or in the context of conversation as he said) so that was a big flag for me on top of the others",
            "author": "nikkylo",
            "id": "fplqbyr",
            "parent_id": "t1_fpjz9mw",
            "score": 2,
            "created_utc": 1588717447.0,
            "replies": []
        },
        {
            "body": "Right on.",
            "author": "Haffbad",
            "id": "fpl98kq",
            "parent_id": "t1_fpjz9mw",
            "score": 1,
            "created_utc": 1588708603.0,
            "replies": []
        },
        {
            "body": "Lol Right?! It’s also very dismissive of her concerns like she is being stupid for being cautious.",
            "author": "ThatBrownSugarBabe",
            "id": "fplqmg3",
            "parent_id": "t1_fpk4djy",
            "score": 2,
            "created_utc": 1588717606.0,
            "replies": []
        },
        {
            "body": "That is exactly what I said🙃🙄 Then he just tells me how he wouldn’t hurt a fly and would be worried about me killing him",
            "author": "nikkylo",
            "id": "fplqexl",
            "parent_id": "t1_fpk4djy",
            "score": 1,
            "created_utc": 1588717492.0,
            "replies": []
        },
        {
            "body": "I like this response a lot!! I just told him that I wasn’t comfortable and blocked him when he began being overly sexual but I definitely could have been more elegant",
            "author": "nikkylo",
            "id": "fplqjsh",
            "parent_id": "t1_fpjoxug",
            "score": 1,
            "created_utc": 1588717566.0,
            "replies": [
                {
                    "body": "Hey, you got the same result, so good on you",
                    "author": null,
                    "id": "fplrplg",
                    "parent_id": "t1_fplqjsh",
                    "score": 1,
                    "created_utc": 1588718193.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Did he think you wanted him to know where you lived or did he think that you wanted to be the next star in “Taken”🤔",
            "author": "nikkylo",
            "id": "fplr04x",
            "parent_id": "t1_fpki0u4",
            "score": 1,
            "created_utc": 1588717810.0,
            "replies": []
        },
        {
            "body": "Once I told him that I was uncomfortable, he said that he would do the car date if I masturbated beside him and gave him head😑 Mind you, I have never met this man and only been talking to him for a couple of weeks and he makes such a request",
            "author": "nikkylo",
            "id": "fplqw30",
            "parent_id": "t1_fpkkxad",
            "score": 1,
            "created_utc": 1588717749.0,
            "replies": [
                {
                    "body": "Absolutely not. That just tells you he wants you indoors because he wants to do something sexual. When a POT SD knows they only want sex or something sexual, they jump to indoor activities right off the bat. They won't waste their time suggesting a dinner date or quick coffee date. If he's trying to find an alternative that STILL centers around something sexual, he is a big hard pass. Please don't entertain him.",
                    "author": null,
                    "id": "fpm1m5a",
                    "parent_id": "t1_fplqw30",
                    "score": 3,
                    "created_utc": 1588723711.0,
                    "replies": []
                },
                {
                    "body": "I might even go as far as to say there is a very good chance that this guy is a predator. Stay far - and I mean fucking FAR - away.",
                    "author": "Annieinjammies",
                    "id": "fpr1oxh",
                    "parent_id": "t1_fplqw30",
                    "score": 2,
                    "created_utc": 1588839261.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly, I agree. Going back and forth sis pointless, especially when someone like him won't even see where he was wrong. Just block and continue with your day.",
            "author": null,
            "id": "fpm1skz",
            "parent_id": "t1_fpkjjz8",
            "score": 3,
            "created_utc": 1588723815.0,
            "replies": [
                {
                    "body": "It’s this scarcity mentality! Like mami, there’s better out there! 😭",
                    "author": null,
                    "id": "fpmciq1",
                    "parent_id": "t1_fpm1skz",
                    "score": 1,
                    "created_utc": 1588730109.0,
                    "replies": [
                        {
                            "body": "Yes definitely and that mentality will be the biggest downfall of SBs! There's men 10x better out there, like wake up !",
                            "author": null,
                            "id": "fpmcm64",
                            "parent_id": "t1_fpmciq1",
                            "score": 2,
                            "created_utc": 1588730166.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "^^^This right here. I can’t tell you how many people I have blocked because they are looking to have sex on the first date. I thought I had finally found a good one and then he does this",
            "author": "nikkylo",
            "id": "fplrmiu",
            "parent_id": "t1_fpkpkgh",
            "score": 2,
            "created_utc": 1588718146.0,
            "replies": []
        },
        {
            "body": "Absolutely right. NEVER violate rule no. 1... to first meet in a public place. I usually go one step further and tell my POT SB that our meeting will only be for like an hour or so. And I’ve stuck to that in all but one  instance. That just takes any pressure off about next steps that day. Unless you both really catch a good vibe.",
            "author": "tg3000a",
            "id": "fplgegi",
            "parent_id": "t1_fpky0hi",
            "score": 3,
            "created_utc": 1588712235.0,
            "replies": [
                {
                    "body": "I completely agree.. though I did do a number of M&G at a Mini Golf place.. it's actually a totally fun first date kind of thing.. and you can totally see you POT SB attitude regarding how competitive she is.. it is truly just supposed to be fun with no score keeping and can get quite flirty if there is a connection..",
                    "author": "erickraemer",
                    "id": "fplh4pn",
                    "parent_id": "t1_fplgegi",
                    "score": 2,
                    "created_utc": 1588712608.0,
                    "replies": [
                        {
                            "body": "Mini Golf sounds like an amazing M&G. It takes all of the formality out of it and just lets both people be themselves",
                            "author": "nikkylo",
                            "id": "fplr4rl",
                            "parent_id": "t1_fplh4pn",
                            "score": 2,
                            "created_utc": 1588717880.0,
                            "replies": [
                                {
                                    "body": "Exactly... Being me, I would practice and had the holes down pretty good, I honestly didn't have a whole lot else going on. I met 2 totally awesome SB's and had a grand time and we stayed together for over a year each.. I also met a total Bitch SB, she never finished the game... I figured out it is an awesome \"First Date'\" for any man and woman, not just POT SD and SB",
                                    "author": "erickraemer",
                                    "id": "fpls4ma",
                                    "parent_id": "t1_fplr4rl",
                                    "score": 1,
                                    "created_utc": 1588718417.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "To say the least lol",
            "author": "nikkylo",
            "id": "fpprecv",
            "parent_id": "t1_fpk7c3i",
            "score": 2,
            "created_utc": 1588807688.0,
            "replies": []
        },
        {
            "body": "She sounds like a very formidable woman. You have a very great situation going on there so hold onto her",
            "author": "nikkylo",
            "id": "fplrqsa",
            "parent_id": "t1_fpksrbw",
            "score": 2,
            "created_utc": 1588718210.0,
            "replies": []
        },
        {
            "body": "I think my block button is worn out almost",
            "author": "nikkylo",
            "id": "fplrtr2",
            "parent_id": "t1_fpkssrb",
            "score": 1,
            "created_utc": 1588718255.0,
            "replies": []
        },
        {
            "body": "He did not want to have a phone conversation or video chat when I offered to get to know each other during the quarantine. He said he only does M&G’s and will not exchange money beforehand (which I understand). I told him that he would have to do a video chat before we meet so I can validate that it is him and it was like pulling teeth. Then he asks me to go to his house and this happens. We have only been talking for a couple of weeks",
            "author": "nikkylo",
            "id": "fplrh30",
            "parent_id": "t1_fpkh5ga",
            "score": 2,
            "created_utc": 1588718065.0,
            "replies": [
                {
                    "body": "Yeah, best case scenario is someone who's incredibly socially awkward. Likely worse.",
                    "author": "EvilDomGM",
                    "id": "fpnw7gc",
                    "parent_id": "t1_fplrh30",
                    "score": 1,
                    "created_utc": 1588773830.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I stopped talking to him when he brought it up again by saying “Aww baby I am sorry that your tooth hurts. I have something else that could go in your mouth in the car. It’ll make you forget all about that pain and I’ll give you XXXX (double what he initially offered) to cover the dental work and the work that I’m about to do” 🙃almost verbatim. I made the mistake of deleting after I blocked so I can’t give you the stupid emojis that went with that",
            "author": "nikkylo",
            "id": "fpls9gd",
            "parent_id": "t1_fplb65h",
            "score": 3,
            "created_utc": 1588718491.0,
            "replies": [
                {
                    "body": "IF any other stupid, disrespectful macho a$$hole does this to you again, you send him a photo of a \"buttplug\", and tell him to start getting ready by lubing his a$$ because you are coming to his place with a 12 inch black dildo to fck the crap out of him and take the \"monthly allowance\"! They will disappear and run for their lives anyway! hahaha\n\n&#x200B;\n\n\"... I have something else that could go in your mouth in the car...  \" he is a total $hithead!",
                    "author": "charming_gentleman49",
                    "id": "fpns244",
                    "parent_id": "t1_fpls9gd",
                    "score": 2,
                    "created_utc": 1588771348.0,
                    "replies": []
                },
                {
                    "body": "He is not only a very disrespectful person but also a very disgusting person! Glad you blocked him!",
                    "author": "charming_gentleman49",
                    "id": "fpmd732",
                    "parent_id": "t1_fpls9gd",
                    "score": 1,
                    "created_utc": 1588730517.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He didn’t want to skype or video chat when I offered. He finally agreed when we talked about setting a date, time, and location for the M&G",
            "author": "nikkylo",
            "id": "fplsdoo",
            "parent_id": "t1_fpk3hao",
            "score": 1,
            "created_utc": 1588718556.0,
            "replies": []
        },
        {
            "body": "THAT PART!",
            "author": "hannooony",
            "id": "fpk6h70",
            "parent_id": "t1_fpjpv2p",
            "score": 26,
            "created_utc": 1588688924.0,
            "replies": []
        },
        {
            "body": "😅😅 I honestly didn’t think about this being the first impression. Have to say that he didn’t do too well",
            "author": "nikkylo",
            "id": "fplq4j1",
            "parent_id": "t1_fpjpv2p",
            "score": 8,
            "created_utc": 1588717338.0,
            "replies": []
        },
        {
            "body": "Exactly, this is the damn honeymoon phase and the feels are supposed to be amazing. Move on.",
            "author": "pfc_6ixgodconsumer",
            "id": "fplmswz",
            "parent_id": "t1_fpjpv2p",
            "score": 4,
            "created_utc": 1588715558.0,
            "replies": []
        },
        {
            "body": "I did a meet and greet and you know what we had a picnic. Hadn’t had a picnic in years. But tell the truth it was really nice. If somebody has an issue with a picnic then move onto the next one",
            "author": "DiligentHall5",
            "id": "fpm2yea",
            "parent_id": "t1_fpl965w",
            "score": 1,
            "created_utc": 1588724490.0,
            "replies": [
                {
                    "body": "Picnic is a great idea. I'm not sure I'd do it for M&G, though, but that's just me. I'd rather do the M&G over appetizers and a glass of wine. I think most ladies would prefer the safety of a public gathering spot where she can easily exit. \n\nBut, I'd love to picnic subsequently, tho.",
                    "author": "Haffbad",
                    "id": "fpodhme",
                    "parent_id": "t1_fpm2yea",
                    "score": 2,
                    "created_utc": 1588782649.0,
                    "replies": [
                        {
                            "body": "We had wine and dinner. It was easy and under some cover of good trees. Had a blast for a M&G. Under the current circumstances and it was her idea so down scaling from the nice restaurant was good. I got there a little early and had it ready and she brought the food due to her diet. Really probably was one of my best meets I can remember and so simple.",
                            "author": "DiligentHall5",
                            "id": "fpom0as",
                            "parent_id": "t1_fpodhme",
                            "score": 2,
                            "created_utc": 1588786746.0,
                            "replies": [
                                {
                                    "body": "That's awesome! Sounds like a great idea. She was obvi comfortable with it. I hope you found a new lady with whom you can connect.",
                                    "author": "Haffbad",
                                    "id": "fpou24v",
                                    "parent_id": "t1_fpom0as",
                                    "score": 2,
                                    "created_utc": 1588790665.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fpkjlt3",
            "parent_id": "t1_fpjtzcn",
            "score": -6,
            "created_utc": 1588695853.0,
            "replies": [
                {
                    "body": "Not on a first meet for many (most?)",
                    "author": "yeehaw_yall",
                    "id": "fpl4r5w",
                    "parent_id": "t1_fpkjlt3",
                    "score": 6,
                    "created_utc": 1588706344.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hey, you got the same result, so good on you",
            "author": null,
            "id": "fplrplg",
            "parent_id": "t1_fplqjsh",
            "score": 1,
            "created_utc": 1588718193.0,
            "replies": []
        },
        {
            "body": "Absolutely not. That just tells you he wants you indoors because he wants to do something sexual. When a POT SD knows they only want sex or something sexual, they jump to indoor activities right off the bat. They won't waste their time suggesting a dinner date or quick coffee date. If he's trying to find an alternative that STILL centers around something sexual, he is a big hard pass. Please don't entertain him.",
            "author": null,
            "id": "fpm1m5a",
            "parent_id": "t1_fplqw30",
            "score": 3,
            "created_utc": 1588723711.0,
            "replies": []
        },
        {
            "body": "I might even go as far as to say there is a very good chance that this guy is a predator. Stay far - and I mean fucking FAR - away.",
            "author": "Annieinjammies",
            "id": "fpr1oxh",
            "parent_id": "t1_fplqw30",
            "score": 2,
            "created_utc": 1588839261.0,
            "replies": []
        },
        {
            "body": "It’s this scarcity mentality! Like mami, there’s better out there! 😭",
            "author": null,
            "id": "fpmciq1",
            "parent_id": "t1_fpm1skz",
            "score": 1,
            "created_utc": 1588730109.0,
            "replies": [
                {
                    "body": "Yes definitely and that mentality will be the biggest downfall of SBs! There's men 10x better out there, like wake up !",
                    "author": null,
                    "id": "fpmcm64",
                    "parent_id": "t1_fpmciq1",
                    "score": 2,
                    "created_utc": 1588730166.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I completely agree.. though I did do a number of M&G at a Mini Golf place.. it's actually a totally fun first date kind of thing.. and you can totally see you POT SB attitude regarding how competitive she is.. it is truly just supposed to be fun with no score keeping and can get quite flirty if there is a connection..",
            "author": "erickraemer",
            "id": "fplh4pn",
            "parent_id": "t1_fplgegi",
            "score": 2,
            "created_utc": 1588712608.0,
            "replies": [
                {
                    "body": "Mini Golf sounds like an amazing M&G. It takes all of the formality out of it and just lets both people be themselves",
                    "author": "nikkylo",
                    "id": "fplr4rl",
                    "parent_id": "t1_fplh4pn",
                    "score": 2,
                    "created_utc": 1588717880.0,
                    "replies": [
                        {
                            "body": "Exactly... Being me, I would practice and had the holes down pretty good, I honestly didn't have a whole lot else going on. I met 2 totally awesome SB's and had a grand time and we stayed together for over a year each.. I also met a total Bitch SB, she never finished the game... I figured out it is an awesome \"First Date'\" for any man and woman, not just POT SD and SB",
                            "author": "erickraemer",
                            "id": "fpls4ma",
                            "parent_id": "t1_fplr4rl",
                            "score": 1,
                            "created_utc": 1588718417.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, best case scenario is someone who's incredibly socially awkward. Likely worse.",
            "author": "EvilDomGM",
            "id": "fpnw7gc",
            "parent_id": "t1_fplrh30",
            "score": 1,
            "created_utc": 1588773830.0,
            "replies": []
        },
        {
            "body": "IF any other stupid, disrespectful macho a$$hole does this to you again, you send him a photo of a \"buttplug\", and tell him to start getting ready by lubing his a$$ because you are coming to his place with a 12 inch black dildo to fck the crap out of him and take the \"monthly allowance\"! They will disappear and run for their lives anyway! hahaha\n\n&#x200B;\n\n\"... I have something else that could go in your mouth in the car...  \" he is a total $hithead!",
            "author": "charming_gentleman49",
            "id": "fpns244",
            "parent_id": "t1_fpls9gd",
            "score": 2,
            "created_utc": 1588771348.0,
            "replies": []
        },
        {
            "body": "He is not only a very disrespectful person but also a very disgusting person! Glad you blocked him!",
            "author": "charming_gentleman49",
            "id": "fpmd732",
            "parent_id": "t1_fpls9gd",
            "score": 1,
            "created_utc": 1588730517.0,
            "replies": []
        },
        {
            "body": "Picnic is a great idea. I'm not sure I'd do it for M&G, though, but that's just me. I'd rather do the M&G over appetizers and a glass of wine. I think most ladies would prefer the safety of a public gathering spot where she can easily exit. \n\nBut, I'd love to picnic subsequently, tho.",
            "author": "Haffbad",
            "id": "fpodhme",
            "parent_id": "t1_fpm2yea",
            "score": 2,
            "created_utc": 1588782649.0,
            "replies": [
                {
                    "body": "We had wine and dinner. It was easy and under some cover of good trees. Had a blast for a M&G. Under the current circumstances and it was her idea so down scaling from the nice restaurant was good. I got there a little early and had it ready and she brought the food due to her diet. Really probably was one of my best meets I can remember and so simple.",
                    "author": "DiligentHall5",
                    "id": "fpom0as",
                    "parent_id": "t1_fpodhme",
                    "score": 2,
                    "created_utc": 1588786746.0,
                    "replies": [
                        {
                            "body": "That's awesome! Sounds like a great idea. She was obvi comfortable with it. I hope you found a new lady with whom you can connect.",
                            "author": "Haffbad",
                            "id": "fpou24v",
                            "parent_id": "t1_fpom0as",
                            "score": 2,
                            "created_utc": 1588790665.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not on a first meet for many (most?)",
            "author": "yeehaw_yall",
            "id": "fpl4r5w",
            "parent_id": "t1_fpkjlt3",
            "score": 6,
            "created_utc": 1588706344.0,
            "replies": []
        },
        {
            "body": "Yes definitely and that mentality will be the biggest downfall of SBs! There's men 10x better out there, like wake up !",
            "author": null,
            "id": "fpmcm64",
            "parent_id": "t1_fpmciq1",
            "score": 2,
            "created_utc": 1588730166.0,
            "replies": []
        },
        {
            "body": "Mini Golf sounds like an amazing M&G. It takes all of the formality out of it and just lets both people be themselves",
            "author": "nikkylo",
            "id": "fplr4rl",
            "parent_id": "t1_fplh4pn",
            "score": 2,
            "created_utc": 1588717880.0,
            "replies": [
                {
                    "body": "Exactly... Being me, I would practice and had the holes down pretty good, I honestly didn't have a whole lot else going on. I met 2 totally awesome SB's and had a grand time and we stayed together for over a year each.. I also met a total Bitch SB, she never finished the game... I figured out it is an awesome \"First Date'\" for any man and woman, not just POT SD and SB",
                    "author": "erickraemer",
                    "id": "fpls4ma",
                    "parent_id": "t1_fplr4rl",
                    "score": 1,
                    "created_utc": 1588718417.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We had wine and dinner. It was easy and under some cover of good trees. Had a blast for a M&G. Under the current circumstances and it was her idea so down scaling from the nice restaurant was good. I got there a little early and had it ready and she brought the food due to her diet. Really probably was one of my best meets I can remember and so simple.",
            "author": "DiligentHall5",
            "id": "fpom0as",
            "parent_id": "t1_fpodhme",
            "score": 2,
            "created_utc": 1588786746.0,
            "replies": [
                {
                    "body": "That's awesome! Sounds like a great idea. She was obvi comfortable with it. I hope you found a new lady with whom you can connect.",
                    "author": "Haffbad",
                    "id": "fpou24v",
                    "parent_id": "t1_fpom0as",
                    "score": 2,
                    "created_utc": 1588790665.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly... Being me, I would practice and had the holes down pretty good, I honestly didn't have a whole lot else going on. I met 2 totally awesome SB's and had a grand time and we stayed together for over a year each.. I also met a total Bitch SB, she never finished the game... I figured out it is an awesome \"First Date'\" for any man and woman, not just POT SD and SB",
            "author": "erickraemer",
            "id": "fpls4ma",
            "parent_id": "t1_fplr4rl",
            "score": 1,
            "created_utc": 1588718417.0,
            "replies": []
        },
        {
            "body": "That's awesome! Sounds like a great idea. She was obvi comfortable with it. I hope you found a new lady with whom you can connect.",
            "author": "Haffbad",
            "id": "fpou24v",
            "parent_id": "t1_fpom0as",
            "score": 2,
            "created_utc": 1588790665.0,
            "replies": []
        }
    ]
}