{
    "title": "Safety apps for SBs",
    "post_id": "j2bs7m",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/j2bs7m/safety_apps_for_sbs/",
    "author": "honeypotsb",
    "body": "EDIT TO ADD: Y'all I haven't used this app in awhile! There are so many new features. You can add a timeline which is info about what you are doing and a record of last known activity to help figure out whats going on should the worst happen \n\nEXAMPLE:\n09/25/2020\nI met with pot 1 at Chili's (sad) today at 3PM. Pot 2 asked me to meet today but I was busy and he seemed upset.\n09/26/2020\nvanilla guy and I have a date today and he is picking me up and knows my address. He has a red ford focus with WA plates.\n09/26/2020\nVanilla plate number : AJS892 \n09/27/2020\nGot back from date with Vanilla at 9AM and had a great time. He was very sweet. I had a weird interaction with pot 2 via text today- he kept asking what I was doing on Friday and why I couldn't meet with him. We are supposed to meet 09/28/2020 at 5PM at Daniel's Broiler. I'm going to Uber there from my place. He offered to send me an Uber and I accepted but asked the pickup to be 3 blocks away (didn't tell him this).\n\nSee how that would be super helpful to know if you went missing? Also, in your contact info there is a spot for notes which will be used to help in an emergency! Potentially a good place to add contact info of SDs and Vanilla partners as well as SA usernames, the name of any friend you have that you use as a safety buddy, etc etc.\n\n**Also wanted to add that SDs that are calling the websites SBs and other women use to verify SD info extortion sites- they aren't. I was provided the list of them and first of all, you have to have the SDs full name and number generally to find anything out. And the only things you are finding out are how they treated other partners. No one is posting workplace info, kids schools, etc (and realistically if you have enough info to look the SD up on these sites you have enough info to find out all of those details...). I'm sure there are sites like that but these aren't it. SBs are worried about getting murdered and y'all are worried about blackmail/loss of clout/your marriage etc. Both are terrible things to have happen but there's one that is clearly worse. And don't even get me started on the risks involved in online dating and just existing let alone sugar dating for our trans and especially black trans babies!!! These sites have immense value and can save lives!**\n\n\nORIGINAL POST:\n(Or sds)\n\nHi! I’ve seen an awful lot of super alarming posts on here and it’s breaking my heart to know so many of you are being taken advantage of. I wanted to let everyone know about the app noonlight- essentially you keep your thumb on your screen and if you let go for more than ten seconds without entering your PIN number your info and location are sent to the police. The idea is unlike other apps someone can’t disarm it for you and it’s very discreet. \n\nPlease don’t get into cars with people you don’t know well. And please don’t go to anyplace private with them. But if you find yourself nervous about being followed at night or if suddenly the vibe seems weird (eventually you’ll have to be alone with your SD and there’s only so much vetting one can do) it’s a great safety net. \n\nLove y’all stay safe ❤️",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/j2bs7m/safety_apps_for_sbs/",
    "score": 154,
    "upvote_ratio": 0.95,
    "created_utc": 1601425844.0,
    "num_comments": 57,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Another tip is to always let a friend, or another trusted person, know where you are going and what the plans are going forth during the “date.” I always tell my little sister (22) what my plan is (where I’m going to meet them, how the date is progressing, what time I expect to be home, and I send her picture of my pets to prove that Im home). We also have a secret phrase to text in case something goes wrong. Its a lot, but better safe than sorry. I no longer do this with my sbf since we’ve been together for so long, but with my other sd, I let her know. She knows his name, how he looks, and where he works.",
            "author": "LaIndiaDeAzucar",
            "id": "g74pxdd",
            "parent_id": "t3_j2bs7m",
            "score": 37,
            "created_utc": 1601431306.0,
            "replies": [
                {
                    "body": "Yea having iPhone on share live location w my best friend helps too",
                    "author": "strawberrygazelle",
                    "id": "g762m7q",
                    "parent_id": "t1_g74pxdd",
                    "score": 6,
                    "created_utc": 1601471769.0,
                    "replies": []
                },
                {
                    "body": "While not directly used in this type scenario, during HS my daughters and I had a procedure where their mother or I would call our daughter.  A response was expected that related to pets. I.E. “yes, Dad I fed the dog. I love you, bye”. If she said she had NOT fed the dog we knew she wasn’t comfortable, in which case her brother who has a booming voice, easily overheard, would call to say he needed to pick her up immediately because ......  Then he or I did pick her up ASAP.  \n\nIn college the ladies amongst their friends integrated cats into similar calls, using it to indicate if they might be making a romantic night of it or not.",
                    "author": "LiamDC3",
                    "id": "g76io8p",
                    "parent_id": "t1_g74pxdd",
                    "score": 5,
                    "created_utc": 1601480305.0,
                    "replies": [
                        {
                            "body": "Yeah, thats essentially what we do. We taught our baby sisters to do that same thing too. Its wild being a girl.",
                            "author": "LaIndiaDeAzucar",
                            "id": "g77br2c",
                            "parent_id": "t1_g76io8p",
                            "score": 2,
                            "created_utc": 1601491855.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> She knows his name, how he looks, and where he works.\n\nIm a guy and do exactly the same. But somehow I'm a creep for sharing my SBs data with a trusted friend.\n\nWhy is this such a double standard? It's like men aren't expected to take their safety just as seriously as women.",
                    "author": "AdAlternative6041",
                    "id": "g77b6fd",
                    "parent_id": "t1_g74pxdd",
                    "score": 0,
                    "created_utc": 1601491633.0,
                    "replies": [
                        {
                            "body": "I don’t think you’re a creep for doing this? As long as it’s not a nude you’re sharing who cares.",
                            "author": "honeypotsb",
                            "id": "g77f7ro",
                            "parent_id": "t1_g77b6fd",
                            "score": 3,
                            "created_utc": 1601493208.0,
                            "replies": [
                                {
                                    "body": "Yeah, I know. It's a huge double standard I've found both in vanilla and sugar dating.\n\nAlso, I think we should build sites to denounce scammers and time wasting SBs just as like you said for SDs.\n\nThen we could see if the model really works for both sides.",
                                    "author": "AdAlternative6041",
                                    "id": "g77gs8w",
                                    "parent_id": "t1_g77f7ro",
                                    "score": 0,
                                    "created_utc": 1601493755.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Out here fighting the good fight I see!",
            "author": "Stargazerdoe89",
            "id": "g74h8m7",
            "parent_id": "t3_j2bs7m",
            "score": 15,
            "created_utc": 1601426462.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g74o8rn",
            "parent_id": "t3_j2bs7m",
            "score": 10,
            "created_utc": 1601430434.0,
            "replies": [
                {
                    "body": "Of course!!! Be safe 💕",
                    "author": "honeypotsb",
                    "id": "g74tqmy",
                    "parent_id": "t1_g74o8rn",
                    "score": 5,
                    "created_utc": 1601433216.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I always share my location via Google maps with my roommate.",
            "author": "sugababynerd1",
            "id": "g74zyb3",
            "parent_id": "t3_j2bs7m",
            "score": 6,
            "created_utc": 1601436668.0,
            "replies": []
        },
        {
            "body": "Great advice. Here are some of my tried and true safety strategies.\n\n1. Have a safety person that knows where you're going and when you're supposed to return. If you change locations, text and tell them. I always share my GPS location on my iOS device with a safety person, but I also share it via google maps to my other safety person's android device. Also, keep a knife or mace on you at all times.\n2. I do a thorough google search of anyone I'm going to meet (search their username, number, and the name they gave. Also reverse search all their google images).\n3. I won't go in a car or non-public place with them until I have met them a few times and have a fair amount of information about their identity (name, place of work, address, etc.).  I have a cloud location that I upload this information to along with my calendar. If I ever go missing, my safety person knows how to access it and provide it to the authorities.\n4. Also, print off or take screenshots of the SA profile before you meet someone. That way if they block you later you can still report any abuse to the site or authorities.\n5. Use an alias and fake number until you really know someone and can trust them (this goes for SDs as well, blackmail his unfortunately really common)\n6. Don't reveal the place you work or go to school until you've gotten to know someone.\n7. Never let anyone pick you up from your home or send an Uber to your address. If you're concerned, park near the meeting spot and take an uber for the last few blocks.\n8. Always park in a well-lit area and near the entrance or security cameras. Also, never let a POT walk you to your car. If you're really concerned after you meet someone, ask a security guard or employee to walk you out.\n9. If you're traveling with a new SD or traveling to meet a POT, always book the travel (make sure it's refundable) and reservations yourself, under your name. Your SD can reimburse you and he should respect your need for safety. One reason for this is if his name is in the hotel room, he can get a key. If he booked the flights, he can cancel your return flight, etc.\n10. Don't give your personal or bank info to an SD unless you REALLY know them (and never to someone you haven't met!!!). They can use other apps to send you cash if needed, it doesn't have to go through a wire transfer that might require a lot of personal information.\n11. If you have kids, for all that is holy please don't disclose any personal information about where they go to school, their names, or pictures of them, etc. Protect yourself and babies like their lives depend on it!!! This also goes for SDs with minor children... please use some common sense and consider your wife and family.",
            "author": "LVSugarBebe",
            "id": "g77go0s",
            "parent_id": "t3_j2bs7m",
            "score": 4,
            "created_utc": 1601493715.0,
            "replies": []
        },
        {
            "body": "There are also apps and websites where dangerous guys, their names and phone numbers are listed for being dodgy, predatory, time wasters or those to avoid for serious offenses. Many so-called SDs are on them.",
            "author": "sugarbooger1988",
            "id": "g74qmwg",
            "parent_id": "t3_j2bs7m",
            "score": 17,
            "created_utc": 1601431677.0,
            "replies": [
                {
                    "body": "Came here to say this! You can report a guy on there too. Always look them up before meeting to see if they've been blacklisted by another lady for physical abuse, time wasting, scamming, etc.",
                    "author": "vegasvoluptuous",
                    "id": "g7594c9",
                    "parent_id": "t1_g74qmwg",
                    "score": 9,
                    "created_utc": 1601442991.0,
                    "replies": [
                        {
                            "body": "Yes, interesting some are accusing resources for safety as all being *extortion sites*...\n\nReality: These tools are for the prevention of spending time with scamming or dangerous predators who unfortunately often represent quite a percentage on sugar daddy websites now, such as seeking since they are blacklisted from seeing ladies of the evening. Also, any real SD is going to give you his real name and phone number, once a little trust is established because a good guy wants you to feel comfortable and safe...or you can figure out who he is pretty quickly with hints about his company or what he does, then look up his business, company(ies), Bloomberg, news articles, ect. as he will have an online presence.",
                            "author": "sugarbooger1988",
                            "id": "g76g4pj",
                            "parent_id": "t1_g7594c9",
                            "score": 5,
                            "created_utc": 1601479228.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "g76j92a",
                                    "parent_id": "t1_g76g4pj",
                                    "score": 1,
                                    "created_utc": 1601480548.0,
                                    "replies": [
                                        {
                                            "body": "I disagree.",
                                            "author": "sugarbooger1988",
                                            "id": "g76k6m2",
                                            "parent_id": "t1_g76j92a",
                                            "score": 1,
                                            "created_utc": 1601480952.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "g76li9t",
                                                    "parent_id": "t1_g76k6m2",
                                                    "score": 3,
                                                    "created_utc": 1601481476.0,
                                                    "replies": [
                                                        {
                                                            "body": "I would never share a meal or much less my body with someone who refuses to tell me their name. That’s so sketch.\n\nIf blackmail is such a paranoia for men, then screen better. \n\nPlus, while blackmail isn’t fun, it is not literally life threatening....It is against the law and all one must do is have their lawyer contact said blackmailer. Simple as that. Sexual assault, Rape and murder are heinous felonies and it’s a crime that is MUCH more serious, in which one can never really recover from and difficult to have a lawyer deal with, once it has already happened (sexual trauma and being scammed can be preventable and why would any gentleman deny a lady knowing his real name? A clever person will figure it out eventually, anyway). \n\nHow many posts of girls on this forum alone, lately, who are scared to report the predators that assaulted them because it was an SB relationship or they feel it will be viewed as prostitution with the police, if they report....  \n\nLet’s be honest here, many sugar daddy websites have become increasingly inundated with predators. A savvy woman who is good with screening and can spot a genuine SD would not need any screening apps because he is going to offer up his name (I’ve always had this happen with a genuine SD) compared to a new girl who is going this alone and doesn’t have much life experience. I advise against such a girl using the sugar websites, anyways,but if she is intent, then at least it’s good if she can screen out bad, scamming or dangerous men. This would mean knowing their real name of course.",
                                                            "author": "sugarbooger1988",
                                                            "id": "g76o4z7",
                                                            "parent_id": "t1_g76li9t",
                                                            "score": 4,
                                                            "created_utc": 1601482495.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[removed]",
                                                                    "author": null,
                                                                    "id": "g76t7x0",
                                                                    "parent_id": "t1_g76o4z7",
                                                                    "score": 1,
                                                                    "created_utc": 1601484540.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I get men can be blackmailed—believe me—I get it. Try to have some empathy for women, too...you know, something that is not self-serving or about money and child support. \n\nAnd, stop with the straw man arguments—take them to someone else’s’ thread. For example, i can do examples, too. If you have a daughter or might one day, imagine her hanging out with men with whom she doesn’t know their name, alone in private places? Should we do a poll and ask men if they are ok with their sisters or daughters hanging out with nameless men alone? \n\nBut, I don’t have time or care to explain to grown MEN (gentlemen is a term I wouldn’t use in most cases here) that comfort and safety is a woman’s top priority—and is a *gentlemen’s* as well as he wants a lady to feel safe with him.",
                                                                            "author": "sugarbooger1988",
                                                                            "id": "g76ua3x",
                                                                            "parent_id": "t1_g76t7x0",
                                                                            "score": 4,
                                                                            "created_utc": 1601484977.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[removed]",
                                                                                    "author": null,
                                                                                    "id": "g77236d",
                                                                                    "parent_id": "t1_g76ua3x",
                                                                                    "score": 1,
                                                                                    "created_utc": 1601488050.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "**”Your feeling of comfort and safety doesn’t trump my need for safety.”**\n\nYes—we know—your many disgusting comments have shown us time and time again that you have no empathy or care for a woman’s safety and you are only focused on yourself and your needs, first and foremost—we get it internet stranger. Your posts speak VERY loud and clear as to what kind of character you have (lack thereof) along with lack of empathy for women’s safety or their emotional well-being more than anything...\n\nGirls reading comments like yours are why women should definitely know a man’s real name, and prove my point even more because you are very triggered by this and any guy who gets this defensive/ aggressive about basic courtesy like knowing something as simple as someone’s name is SCARY. What is someone like this hiding?...(besides lack of wealth of kindness). \n\nIf the constant paranoia of being blackmailed makes you think actual sexual “rape” and sexual assault is less traumatic an option for a woman (or man) in your self-centered scenario, (a truly disgusting comment and comparison) then perhaps, you should not be seeing girls online and risking so much, (if your wife will divorce you for your affairs) and if you won’t be able to afford “food and shelter” after a divorce” (sounds like *great SD* material, btw with such limited funds).\n\nI’m going to have to block you because my focus is on assisting girls...not wasting time teaching “men” to be a reasonable respectful and kind gentleman. That was your parent’s job.",
                                                                                            "author": "sugarbooger1988",
                                                                                            "id": "g78lxmg",
                                                                                            "parent_id": "t1_g77236d",
                                                                                            "score": 3,
                                                                                            "created_utc": 1601513784.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It’s really annoying to mention something extremely useful and not share what it is. What’s the point of your comment then?",
                    "author": "DontEvenLikeMenTbh",
                    "id": "g74yc0x",
                    "parent_id": "t1_g74qmwg",
                    "score": 3,
                    "created_utc": 1601435715.0,
                    "replies": [
                        {
                            "body": "I do not post publicly for (I’d assume?) obvious reasons.",
                            "author": "sugarbooger1988",
                            "id": "g76eyf5",
                            "parent_id": "t1_g74yc0x",
                            "score": 1,
                            "created_utc": 1601478681.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Can you link or list?",
                    "author": "honeypotsb",
                    "id": "g74tsf2",
                    "parent_id": "t1_g74qmwg",
                    "score": 5,
                    "created_utc": 1601433241.0,
                    "replies": [
                        {
                            "body": "Hey yes, can I DM you or feel free to message me and I can list them...",
                            "author": "sugarbooger1988",
                            "id": "g754csd",
                            "parent_id": "t1_g74tsf2",
                            "score": 2,
                            "created_utc": 1601439462.0,
                            "replies": [
                                {
                                    "body": "Sent thank you!",
                                    "author": "honeypotsb",
                                    "id": "g758nwg",
                                    "parent_id": "t1_g754csd",
                                    "score": 3,
                                    "created_utc": 1601442624.0,
                                    "replies": []
                                },
                                {
                                    "body": "Sent you a DM!",
                                    "author": "MissWo",
                                    "id": "g75ac1r",
                                    "parent_id": "t1_g754csd",
                                    "score": 3,
                                    "created_utc": 1601443996.0,
                                    "replies": []
                                },
                                {
                                    "body": "DMed You!",
                                    "author": "Freakonthelow",
                                    "id": "g75c5p2",
                                    "parent_id": "t1_g754csd",
                                    "score": 3,
                                    "created_utc": 1601445563.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g751e1y",
                    "parent_id": "t1_g74qmwg",
                    "score": 3,
                    "created_utc": 1601437542.0,
                    "replies": [
                        {
                            "body": "You mean extorting men or women? \n\nNo...the sites I speak of are for warning girls and not for extortion purposes. They are for safety measures for girls to know if the man is a scammer, time waster, dangerous or much worse.",
                            "author": "sugarbooger1988",
                            "id": "g7546b1",
                            "parent_id": "t1_g751e1y",
                            "score": 3,
                            "created_utc": 1601439340.0,
                            "replies": [
                                {
                                    "body": "Without moderation and asking for evidence there's no way you can tell true warnings from extortion.\n\nBut the idea isn't bad, we should have the same sites to warn guys about girls that run scams time waste or try to blackmail.",
                                    "author": "AdAlternative6041",
                                    "id": "g77cqtq",
                                    "parent_id": "t1_g7546b1",
                                    "score": 2,
                                    "created_utc": 1601492242.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah, what site is this?",
                    "author": "skeptic_narcoleptic",
                    "id": "g74txax",
                    "parent_id": "t1_g74qmwg",
                    "score": 2,
                    "created_utc": 1601433314.0,
                    "replies": [
                        {
                            "body": "DM me and I can send.",
                            "author": "sugarbooger1988",
                            "id": "g754khl",
                            "parent_id": "t1_g74txax",
                            "score": 2,
                            "created_utc": 1601439608.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g75ufq7",
                    "parent_id": "t1_g74qmwg",
                    "score": 1,
                    "created_utc": 1601465723.0,
                    "replies": [
                        {
                            "body": "I’m not sure? Maybe, someone from Oz can DM it post?",
                            "author": "sugarbooger1988",
                            "id": "g76ea9y",
                            "parent_id": "t1_g75ufq7",
                            "score": 2,
                            "created_utc": 1601478366.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Those are almost universally sites used to blackmail men, not to protect women.\n\nI would like to believe you have a quality resource that lists bad people, but I highly doubt you do.",
                    "author": "marker3000",
                    "id": "g75clif",
                    "parent_id": "t1_g74qmwg",
                    "score": -1,
                    "created_utc": 1601445963.0,
                    "replies": [
                        {
                            "body": "I just was provided the sites and uhm no they aren’t... you have to have the guys info already, there are no bank accounts or card numbers or whatever you think they are. It’s pretty much “name + number: I had X experience”",
                            "author": "honeypotsb",
                            "id": "g77fivw",
                            "parent_id": "t1_g75clif",
                            "score": 4,
                            "created_utc": 1601493317.0,
                            "replies": [
                                {
                                    "body": "So I mean this is fine and if it saves one person a horrible experience it's worth it.\n\nBut I'm very suspicious of there being a likelihood you will find the person you are looking for listed on any site.. too few data points.\n\nAnd I'm super skeptical that anything conflating \"dodgy\", \"time wasting\", and \"predatory\" is trustworthy",
                                    "author": "marker3000",
                                    "id": "g77lpiq",
                                    "parent_id": "t1_g77fivw",
                                    "score": 1,
                                    "created_utc": 1601495487.0,
                                    "replies": [
                                        {
                                            "body": "I just went through my POTs and old SDs on my phone and two of them had bad things listed. One had 4 women that said he was scary and they didnt feel safe being alone with him.",
                                            "author": "honeypotsb",
                                            "id": "g77m6a2",
                                            "parent_id": "t1_g77lpiq",
                                            "score": 2,
                                            "created_utc": 1601495651.0,
                                            "replies": [
                                                {
                                                    "body": "So let's agree that 4 separate reports are a pretty big red flag and he's to be avoided.\n\nThe ones that had single bad reports... How do you know whether that's an unhappy person or a bad dude? It's probably a bad dude, but it could just be retribution over a perceived slight. \n\nAs I said to the downvote cabal above: \"So I mean this is fine and if it saves one person a horrible experience it's worth it.\"",
                                                    "author": "marker3000",
                                                    "id": "g78cl3k",
                                                    "parent_id": "t1_g77m6a2",
                                                    "score": 3,
                                                    "created_utc": 1601508222.0,
                                                    "replies": [
                                                        {
                                                            "body": "The woman said they stalked her. It’s just data you can take and make an informed decision with. If someone commented “cheap and rude” I’d think hmmm maybe that didn’t turn out well due to differing ideas of an SR, but stalking? Nah.",
                                                            "author": "honeypotsb",
                                                            "id": "g78dcyl",
                                                            "parent_id": "t1_g78cl3k",
                                                            "score": 1,
                                                            "created_utc": 1601508692.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah, as someone who defaults to \"believe women\" I'd certainly be wary of anyone reported for stalking.\n\nI've also been blackmailed and threatened by so-called \"SBs\" so I'm not sure I trust everyone to be truthful, though.",
                                                                    "author": "marker3000",
                                                                    "id": "g78i309",
                                                                    "parent_id": "t1_g78dcyl",
                                                                    "score": 1,
                                                                    "created_utc": 1601511534.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": ">It’s pretty much “name + number: I had X experience”\n\nDo you realize how meaningless that is? So you can write anything about anyone and you take that as a trusted source of information?\n\nWhat if someone reported you as a scammer/blackmailer? Maybe THEN you'll realize how dangerous those sites are.",
                                    "author": "AdAlternative6041",
                                    "id": "g78li7t",
                                    "parent_id": "t1_g77fivw",
                                    "score": 0,
                                    "created_utc": 1601513542.0,
                                    "replies": [
                                        {
                                            "body": "🙄 oh no I would have a hard time finding an SD. I’d hardly define that as dangerous.",
                                            "author": "honeypotsb",
                                            "id": "g78v665",
                                            "parent_id": "t1_g78li7t",
                                            "score": 2,
                                            "created_utc": 1601518978.0,
                                            "replies": [
                                                {
                                                    "body": "It's dangerous once your name is on the internet related to something you didn't do.\n\nBecause there's no control over what anyone posts, do you seriously don't understand how that could be used against you?",
                                                    "author": "AdAlternative6041",
                                                    "id": "g78zkf6",
                                                    "parent_id": "t1_g78v665",
                                                    "score": 1,
                                                    "created_utc": 1601521519.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Those? What are you referencing? Because I didn’t name anything...The link someone else posted is not what I am talking about, anyway.\n\nYou really have no idea what you wrote of and really could care less what you “imagine in your fantasy” about resources *for women* that have nothing to do with extortion but do have to do with screening and safety for women.",
                            "author": "sugarbooger1988",
                            "id": "g76ekzd",
                            "parent_id": "t1_g75clif",
                            "score": 2,
                            "created_utc": 1601478507.0,
                            "replies": [
                                {
                                    "body": "And again, the resources that you describe *could* exist in theory, but do not exist in practice. \n\nMost people will never report a predator anywhere, let alone to a resource list they don't even know exist.\n\nNever mind that you're conflating predators and people who are \"time wasters\". Who is defining that latter category exactly?",
                                    "author": "marker3000",
                                    "id": "g76pykq",
                                    "parent_id": "t1_g76ekzd",
                                    "score": 2,
                                    "created_utc": 1601483245.0,
                                    "replies": [
                                        {
                                            "body": "You certainly are “passionate” about this, considering safety resources for women “do not exist” 😂😂",
                                            "author": "sugarbooger1988",
                                            "id": "g76q8cv",
                                            "parent_id": "t1_g76pykq",
                                            "score": 1,
                                            "created_utc": 1601483352.0,
                                            "replies": [
                                                {
                                                    "body": "A handful of anecdotes from a handful of people seen by a handful of other people do not constitute a \"safety resource\"\n\nI have zero patience for predators and think they should be made to suffer the most serious consequences imaginable for their actions.\n\nThat you conflate them with \"time wasters\" says more than you realize.",
                                                    "author": "marker3000",
                                                    "id": "g771ljm",
                                                    "parent_id": "t1_g76q8cv",
                                                    "score": 2,
                                                    "created_utc": 1601487860.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you ☺️",
            "author": "InnerRadio7",
            "id": "g7557ih",
            "parent_id": "t3_j2bs7m",
            "score": 3,
            "created_utc": 1601440055.0,
            "replies": []
        },
        {
            "body": "I’d also recommend the Emergency SOS feature on iPhone:\n\nhttps://support.apple.com/en-us/HT208076\n\nYou can also create a custom workflow with the Shortcuts app. For example: text your emergency contacts and share your location on the tap of a button or a Siri command.",
            "author": "geekxp",
            "id": "g76dc9c",
            "parent_id": "t3_j2bs7m",
            "score": 3,
            "created_utc": 1601477897.0,
            "replies": []
        },
        {
            "body": "Saving this post. Thank you!",
            "author": "cherrysplits",
            "id": "g757ioe",
            "parent_id": "t3_j2bs7m",
            "score": 2,
            "created_utc": 1601441738.0,
            "replies": []
        },
        {
            "body": "Are there any options that wouldn’t contact the police??",
            "author": "Freakonthelow",
            "id": "g758cgr",
            "parent_id": "t3_j2bs7m",
            "score": 2,
            "created_utc": 1601442373.0,
            "replies": [
                {
                    "body": "There is one called bsafe that’s popular and I think it allows a friend to track you and you can alert them if you need help but I’ve never used it.",
                    "author": "honeypotsb",
                    "id": "g758kzh",
                    "parent_id": "t1_g758cgr",
                    "score": 8,
                    "created_utc": 1601442561.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm adding a separate comment because I think it's important for SDs to also take precautions. Sure, it's unlikely an SD is going to be physically assaulted, but for the sake of the other people in their life that they're responsible for, who aren't consenting parties of an arrangement (i.e. wife, kids, employees), please be smart about your screening process and how you protect yourselves.\n\nI may not have a popular opinion as an SB, but I don't mind if a man doesn't want to reveal his name to me until we've met for coffee. I just don't go anywhere alone with him until I have that information and have verified it.\n\nOddly, I respect that he's being safe and protecting himself and his loved ones from the few unsavory SBs that are just out there to scam men (yes, men get blackmailed).\n\nI've met several wonderful, genuine SDs who weren't married or parents, but had a conservative job or were famous and didn't want to give out a lot of personal information to people they hadn't met. I totally understand this and actually inform them if I was able to find their personal information they may not want to be disclosed.\n\nMost men are just naive and oblivious to how risky it is to us as women to be giving out such personal information, or meeting someone we don't know. Once I've had a chance to explain to them I am not just protecting myself, but my kids, no one has ever pushed me to give out my real name, number, or address.",
            "author": "LVSugarBebe",
            "id": "g77jcgj",
            "parent_id": "t3_j2bs7m",
            "score": 1,
            "created_utc": 1601494662.0,
            "replies": [
                {
                    "body": "I agree! I don't expect much beyond a first name for the initial greeting and always in public. SDs should be safe as well and I think that in terms of giving info if you are meeting in public it's okay to stay private but as soon as you move to a private setting I think SDs need to give their full name.",
                    "author": "honeypotsb",
                    "id": "g77kjr4",
                    "parent_id": "t1_g77jcgj",
                    "score": 2,
                    "created_utc": 1601495084.0,
                    "replies": [
                        {
                            "body": "100 percent agree! My best SDs have had pretty public personas and I never would have met them if I insisted on seeing their ID first. Thankfully a lot of other SBs passed them up.\n\nAs long as we take a lot of other precautions to be safe about where we’re meeting and having a person aware of our location, we significantly lower our chances of something happening. If we’re really concerned we can ask a friend to come along and sit at a table near the entrance and ensure we leave alone.",
                            "author": "LVSugarBebe",
                            "id": "g77lcm8",
                            "parent_id": "t1_g77kjr4",
                            "score": 1,
                            "created_utc": 1601495364.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yea having iPhone on share live location w my best friend helps too",
            "author": "strawberrygazelle",
            "id": "g762m7q",
            "parent_id": "t1_g74pxdd",
            "score": 6,
            "created_utc": 1601471769.0,
            "replies": []
        },
        {
            "body": "While not directly used in this type scenario, during HS my daughters and I had a procedure where their mother or I would call our daughter.  A response was expected that related to pets. I.E. “yes, Dad I fed the dog. I love you, bye”. If she said she had NOT fed the dog we knew she wasn’t comfortable, in which case her brother who has a booming voice, easily overheard, would call to say he needed to pick her up immediately because ......  Then he or I did pick her up ASAP.  \n\nIn college the ladies amongst their friends integrated cats into similar calls, using it to indicate if they might be making a romantic night of it or not.",
            "author": "LiamDC3",
            "id": "g76io8p",
            "parent_id": "t1_g74pxdd",
            "score": 5,
            "created_utc": 1601480305.0,
            "replies": [
                {
                    "body": "Yeah, thats essentially what we do. We taught our baby sisters to do that same thing too. Its wild being a girl.",
                    "author": "LaIndiaDeAzucar",
                    "id": "g77br2c",
                    "parent_id": "t1_g76io8p",
                    "score": 2,
                    "created_utc": 1601491855.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> She knows his name, how he looks, and where he works.\n\nIm a guy and do exactly the same. But somehow I'm a creep for sharing my SBs data with a trusted friend.\n\nWhy is this such a double standard? It's like men aren't expected to take their safety just as seriously as women.",
            "author": "AdAlternative6041",
            "id": "g77b6fd",
            "parent_id": "t1_g74pxdd",
            "score": 0,
            "created_utc": 1601491633.0,
            "replies": [
                {
                    "body": "I don’t think you’re a creep for doing this? As long as it’s not a nude you’re sharing who cares.",
                    "author": "honeypotsb",
                    "id": "g77f7ro",
                    "parent_id": "t1_g77b6fd",
                    "score": 3,
                    "created_utc": 1601493208.0,
                    "replies": [
                        {
                            "body": "Yeah, I know. It's a huge double standard I've found both in vanilla and sugar dating.\n\nAlso, I think we should build sites to denounce scammers and time wasting SBs just as like you said for SDs.\n\nThen we could see if the model really works for both sides.",
                            "author": "AdAlternative6041",
                            "id": "g77gs8w",
                            "parent_id": "t1_g77f7ro",
                            "score": 0,
                            "created_utc": 1601493755.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Of course!!! Be safe 💕",
            "author": "honeypotsb",
            "id": "g74tqmy",
            "parent_id": "t1_g74o8rn",
            "score": 5,
            "created_utc": 1601433216.0,
            "replies": []
        },
        {
            "body": "Came here to say this! You can report a guy on there too. Always look them up before meeting to see if they've been blacklisted by another lady for physical abuse, time wasting, scamming, etc.",
            "author": "vegasvoluptuous",
            "id": "g7594c9",
            "parent_id": "t1_g74qmwg",
            "score": 9,
            "created_utc": 1601442991.0,
            "replies": [
                {
                    "body": "Yes, interesting some are accusing resources for safety as all being *extortion sites*...\n\nReality: These tools are for the prevention of spending time with scamming or dangerous predators who unfortunately often represent quite a percentage on sugar daddy websites now, such as seeking since they are blacklisted from seeing ladies of the evening. Also, any real SD is going to give you his real name and phone number, once a little trust is established because a good guy wants you to feel comfortable and safe...or you can figure out who he is pretty quickly with hints about his company or what he does, then look up his business, company(ies), Bloomberg, news articles, ect. as he will have an online presence.",
                    "author": "sugarbooger1988",
                    "id": "g76g4pj",
                    "parent_id": "t1_g7594c9",
                    "score": 5,
                    "created_utc": 1601479228.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "g76j92a",
                            "parent_id": "t1_g76g4pj",
                            "score": 1,
                            "created_utc": 1601480548.0,
                            "replies": [
                                {
                                    "body": "I disagree.",
                                    "author": "sugarbooger1988",
                                    "id": "g76k6m2",
                                    "parent_id": "t1_g76j92a",
                                    "score": 1,
                                    "created_utc": 1601480952.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "g76li9t",
                                            "parent_id": "t1_g76k6m2",
                                            "score": 3,
                                            "created_utc": 1601481476.0,
                                            "replies": [
                                                {
                                                    "body": "I would never share a meal or much less my body with someone who refuses to tell me their name. That’s so sketch.\n\nIf blackmail is such a paranoia for men, then screen better. \n\nPlus, while blackmail isn’t fun, it is not literally life threatening....It is against the law and all one must do is have their lawyer contact said blackmailer. Simple as that. Sexual assault, Rape and murder are heinous felonies and it’s a crime that is MUCH more serious, in which one can never really recover from and difficult to have a lawyer deal with, once it has already happened (sexual trauma and being scammed can be preventable and why would any gentleman deny a lady knowing his real name? A clever person will figure it out eventually, anyway). \n\nHow many posts of girls on this forum alone, lately, who are scared to report the predators that assaulted them because it was an SB relationship or they feel it will be viewed as prostitution with the police, if they report....  \n\nLet’s be honest here, many sugar daddy websites have become increasingly inundated with predators. A savvy woman who is good with screening and can spot a genuine SD would not need any screening apps because he is going to offer up his name (I’ve always had this happen with a genuine SD) compared to a new girl who is going this alone and doesn’t have much life experience. I advise against such a girl using the sugar websites, anyways,but if she is intent, then at least it’s good if she can screen out bad, scamming or dangerous men. This would mean knowing their real name of course.",
                                                    "author": "sugarbooger1988",
                                                    "id": "g76o4z7",
                                                    "parent_id": "t1_g76li9t",
                                                    "score": 4,
                                                    "created_utc": 1601482495.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "g76t7x0",
                                                            "parent_id": "t1_g76o4z7",
                                                            "score": 1,
                                                            "created_utc": 1601484540.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I get men can be blackmailed—believe me—I get it. Try to have some empathy for women, too...you know, something that is not self-serving or about money and child support. \n\nAnd, stop with the straw man arguments—take them to someone else’s’ thread. For example, i can do examples, too. If you have a daughter or might one day, imagine her hanging out with men with whom she doesn’t know their name, alone in private places? Should we do a poll and ask men if they are ok with their sisters or daughters hanging out with nameless men alone? \n\nBut, I don’t have time or care to explain to grown MEN (gentlemen is a term I wouldn’t use in most cases here) that comfort and safety is a woman’s top priority—and is a *gentlemen’s* as well as he wants a lady to feel safe with him.",
                                                                    "author": "sugarbooger1988",
                                                                    "id": "g76ua3x",
                                                                    "parent_id": "t1_g76t7x0",
                                                                    "score": 4,
                                                                    "created_utc": 1601484977.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[removed]",
                                                                            "author": null,
                                                                            "id": "g77236d",
                                                                            "parent_id": "t1_g76ua3x",
                                                                            "score": 1,
                                                                            "created_utc": 1601488050.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "**”Your feeling of comfort and safety doesn’t trump my need for safety.”**\n\nYes—we know—your many disgusting comments have shown us time and time again that you have no empathy or care for a woman’s safety and you are only focused on yourself and your needs, first and foremost—we get it internet stranger. Your posts speak VERY loud and clear as to what kind of character you have (lack thereof) along with lack of empathy for women’s safety or their emotional well-being more than anything...\n\nGirls reading comments like yours are why women should definitely know a man’s real name, and prove my point even more because you are very triggered by this and any guy who gets this defensive/ aggressive about basic courtesy like knowing something as simple as someone’s name is SCARY. What is someone like this hiding?...(besides lack of wealth of kindness). \n\nIf the constant paranoia of being blackmailed makes you think actual sexual “rape” and sexual assault is less traumatic an option for a woman (or man) in your self-centered scenario, (a truly disgusting comment and comparison) then perhaps, you should not be seeing girls online and risking so much, (if your wife will divorce you for your affairs) and if you won’t be able to afford “food and shelter” after a divorce” (sounds like *great SD* material, btw with such limited funds).\n\nI’m going to have to block you because my focus is on assisting girls...not wasting time teaching “men” to be a reasonable respectful and kind gentleman. That was your parent’s job.",
                                                                                    "author": "sugarbooger1988",
                                                                                    "id": "g78lxmg",
                                                                                    "parent_id": "t1_g77236d",
                                                                                    "score": 3,
                                                                                    "created_utc": 1601513784.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s really annoying to mention something extremely useful and not share what it is. What’s the point of your comment then?",
            "author": "DontEvenLikeMenTbh",
            "id": "g74yc0x",
            "parent_id": "t1_g74qmwg",
            "score": 3,
            "created_utc": 1601435715.0,
            "replies": [
                {
                    "body": "I do not post publicly for (I’d assume?) obvious reasons.",
                    "author": "sugarbooger1988",
                    "id": "g76eyf5",
                    "parent_id": "t1_g74yc0x",
                    "score": 1,
                    "created_utc": 1601478681.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can you link or list?",
            "author": "honeypotsb",
            "id": "g74tsf2",
            "parent_id": "t1_g74qmwg",
            "score": 5,
            "created_utc": 1601433241.0,
            "replies": [
                {
                    "body": "Hey yes, can I DM you or feel free to message me and I can list them...",
                    "author": "sugarbooger1988",
                    "id": "g754csd",
                    "parent_id": "t1_g74tsf2",
                    "score": 2,
                    "created_utc": 1601439462.0,
                    "replies": [
                        {
                            "body": "Sent thank you!",
                            "author": "honeypotsb",
                            "id": "g758nwg",
                            "parent_id": "t1_g754csd",
                            "score": 3,
                            "created_utc": 1601442624.0,
                            "replies": []
                        },
                        {
                            "body": "Sent you a DM!",
                            "author": "MissWo",
                            "id": "g75ac1r",
                            "parent_id": "t1_g754csd",
                            "score": 3,
                            "created_utc": 1601443996.0,
                            "replies": []
                        },
                        {
                            "body": "DMed You!",
                            "author": "Freakonthelow",
                            "id": "g75c5p2",
                            "parent_id": "t1_g754csd",
                            "score": 3,
                            "created_utc": 1601445563.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g751e1y",
            "parent_id": "t1_g74qmwg",
            "score": 3,
            "created_utc": 1601437542.0,
            "replies": [
                {
                    "body": "You mean extorting men or women? \n\nNo...the sites I speak of are for warning girls and not for extortion purposes. They are for safety measures for girls to know if the man is a scammer, time waster, dangerous or much worse.",
                    "author": "sugarbooger1988",
                    "id": "g7546b1",
                    "parent_id": "t1_g751e1y",
                    "score": 3,
                    "created_utc": 1601439340.0,
                    "replies": [
                        {
                            "body": "Without moderation and asking for evidence there's no way you can tell true warnings from extortion.\n\nBut the idea isn't bad, we should have the same sites to warn guys about girls that run scams time waste or try to blackmail.",
                            "author": "AdAlternative6041",
                            "id": "g77cqtq",
                            "parent_id": "t1_g7546b1",
                            "score": 2,
                            "created_utc": 1601492242.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, what site is this?",
            "author": "skeptic_narcoleptic",
            "id": "g74txax",
            "parent_id": "t1_g74qmwg",
            "score": 2,
            "created_utc": 1601433314.0,
            "replies": [
                {
                    "body": "DM me and I can send.",
                    "author": "sugarbooger1988",
                    "id": "g754khl",
                    "parent_id": "t1_g74txax",
                    "score": 2,
                    "created_utc": 1601439608.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g75ufq7",
            "parent_id": "t1_g74qmwg",
            "score": 1,
            "created_utc": 1601465723.0,
            "replies": [
                {
                    "body": "I’m not sure? Maybe, someone from Oz can DM it post?",
                    "author": "sugarbooger1988",
                    "id": "g76ea9y",
                    "parent_id": "t1_g75ufq7",
                    "score": 2,
                    "created_utc": 1601478366.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Those are almost universally sites used to blackmail men, not to protect women.\n\nI would like to believe you have a quality resource that lists bad people, but I highly doubt you do.",
            "author": "marker3000",
            "id": "g75clif",
            "parent_id": "t1_g74qmwg",
            "score": -1,
            "created_utc": 1601445963.0,
            "replies": [
                {
                    "body": "I just was provided the sites and uhm no they aren’t... you have to have the guys info already, there are no bank accounts or card numbers or whatever you think they are. It’s pretty much “name + number: I had X experience”",
                    "author": "honeypotsb",
                    "id": "g77fivw",
                    "parent_id": "t1_g75clif",
                    "score": 4,
                    "created_utc": 1601493317.0,
                    "replies": [
                        {
                            "body": "So I mean this is fine and if it saves one person a horrible experience it's worth it.\n\nBut I'm very suspicious of there being a likelihood you will find the person you are looking for listed on any site.. too few data points.\n\nAnd I'm super skeptical that anything conflating \"dodgy\", \"time wasting\", and \"predatory\" is trustworthy",
                            "author": "marker3000",
                            "id": "g77lpiq",
                            "parent_id": "t1_g77fivw",
                            "score": 1,
                            "created_utc": 1601495487.0,
                            "replies": [
                                {
                                    "body": "I just went through my POTs and old SDs on my phone and two of them had bad things listed. One had 4 women that said he was scary and they didnt feel safe being alone with him.",
                                    "author": "honeypotsb",
                                    "id": "g77m6a2",
                                    "parent_id": "t1_g77lpiq",
                                    "score": 2,
                                    "created_utc": 1601495651.0,
                                    "replies": [
                                        {
                                            "body": "So let's agree that 4 separate reports are a pretty big red flag and he's to be avoided.\n\nThe ones that had single bad reports... How do you know whether that's an unhappy person or a bad dude? It's probably a bad dude, but it could just be retribution over a perceived slight. \n\nAs I said to the downvote cabal above: \"So I mean this is fine and if it saves one person a horrible experience it's worth it.\"",
                                            "author": "marker3000",
                                            "id": "g78cl3k",
                                            "parent_id": "t1_g77m6a2",
                                            "score": 3,
                                            "created_utc": 1601508222.0,
                                            "replies": [
                                                {
                                                    "body": "The woman said they stalked her. It’s just data you can take and make an informed decision with. If someone commented “cheap and rude” I’d think hmmm maybe that didn’t turn out well due to differing ideas of an SR, but stalking? Nah.",
                                                    "author": "honeypotsb",
                                                    "id": "g78dcyl",
                                                    "parent_id": "t1_g78cl3k",
                                                    "score": 1,
                                                    "created_utc": 1601508692.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah, as someone who defaults to \"believe women\" I'd certainly be wary of anyone reported for stalking.\n\nI've also been blackmailed and threatened by so-called \"SBs\" so I'm not sure I trust everyone to be truthful, though.",
                                                            "author": "marker3000",
                                                            "id": "g78i309",
                                                            "parent_id": "t1_g78dcyl",
                                                            "score": 1,
                                                            "created_utc": 1601511534.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">It’s pretty much “name + number: I had X experience”\n\nDo you realize how meaningless that is? So you can write anything about anyone and you take that as a trusted source of information?\n\nWhat if someone reported you as a scammer/blackmailer? Maybe THEN you'll realize how dangerous those sites are.",
                            "author": "AdAlternative6041",
                            "id": "g78li7t",
                            "parent_id": "t1_g77fivw",
                            "score": 0,
                            "created_utc": 1601513542.0,
                            "replies": [
                                {
                                    "body": "🙄 oh no I would have a hard time finding an SD. I’d hardly define that as dangerous.",
                                    "author": "honeypotsb",
                                    "id": "g78v665",
                                    "parent_id": "t1_g78li7t",
                                    "score": 2,
                                    "created_utc": 1601518978.0,
                                    "replies": [
                                        {
                                            "body": "It's dangerous once your name is on the internet related to something you didn't do.\n\nBecause there's no control over what anyone posts, do you seriously don't understand how that could be used against you?",
                                            "author": "AdAlternative6041",
                                            "id": "g78zkf6",
                                            "parent_id": "t1_g78v665",
                                            "score": 1,
                                            "created_utc": 1601521519.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Those? What are you referencing? Because I didn’t name anything...The link someone else posted is not what I am talking about, anyway.\n\nYou really have no idea what you wrote of and really could care less what you “imagine in your fantasy” about resources *for women* that have nothing to do with extortion but do have to do with screening and safety for women.",
                    "author": "sugarbooger1988",
                    "id": "g76ekzd",
                    "parent_id": "t1_g75clif",
                    "score": 2,
                    "created_utc": 1601478507.0,
                    "replies": [
                        {
                            "body": "And again, the resources that you describe *could* exist in theory, but do not exist in practice. \n\nMost people will never report a predator anywhere, let alone to a resource list they don't even know exist.\n\nNever mind that you're conflating predators and people who are \"time wasters\". Who is defining that latter category exactly?",
                            "author": "marker3000",
                            "id": "g76pykq",
                            "parent_id": "t1_g76ekzd",
                            "score": 2,
                            "created_utc": 1601483245.0,
                            "replies": [
                                {
                                    "body": "You certainly are “passionate” about this, considering safety resources for women “do not exist” 😂😂",
                                    "author": "sugarbooger1988",
                                    "id": "g76q8cv",
                                    "parent_id": "t1_g76pykq",
                                    "score": 1,
                                    "created_utc": 1601483352.0,
                                    "replies": [
                                        {
                                            "body": "A handful of anecdotes from a handful of people seen by a handful of other people do not constitute a \"safety resource\"\n\nI have zero patience for predators and think they should be made to suffer the most serious consequences imaginable for their actions.\n\nThat you conflate them with \"time wasters\" says more than you realize.",
                                            "author": "marker3000",
                                            "id": "g771ljm",
                                            "parent_id": "t1_g76q8cv",
                                            "score": 2,
                                            "created_utc": 1601487860.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There is one called bsafe that’s popular and I think it allows a friend to track you and you can alert them if you need help but I’ve never used it.",
            "author": "honeypotsb",
            "id": "g758kzh",
            "parent_id": "t1_g758cgr",
            "score": 8,
            "created_utc": 1601442561.0,
            "replies": []
        },
        {
            "body": "I agree! I don't expect much beyond a first name for the initial greeting and always in public. SDs should be safe as well and I think that in terms of giving info if you are meeting in public it's okay to stay private but as soon as you move to a private setting I think SDs need to give their full name.",
            "author": "honeypotsb",
            "id": "g77kjr4",
            "parent_id": "t1_g77jcgj",
            "score": 2,
            "created_utc": 1601495084.0,
            "replies": [
                {
                    "body": "100 percent agree! My best SDs have had pretty public personas and I never would have met them if I insisted on seeing their ID first. Thankfully a lot of other SBs passed them up.\n\nAs long as we take a lot of other precautions to be safe about where we’re meeting and having a person aware of our location, we significantly lower our chances of something happening. If we’re really concerned we can ask a friend to come along and sit at a table near the entrance and ensure we leave alone.",
                    "author": "LVSugarBebe",
                    "id": "g77lcm8",
                    "parent_id": "t1_g77kjr4",
                    "score": 1,
                    "created_utc": 1601495364.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, thats essentially what we do. We taught our baby sisters to do that same thing too. Its wild being a girl.",
            "author": "LaIndiaDeAzucar",
            "id": "g77br2c",
            "parent_id": "t1_g76io8p",
            "score": 2,
            "created_utc": 1601491855.0,
            "replies": []
        },
        {
            "body": "I don’t think you’re a creep for doing this? As long as it’s not a nude you’re sharing who cares.",
            "author": "honeypotsb",
            "id": "g77f7ro",
            "parent_id": "t1_g77b6fd",
            "score": 3,
            "created_utc": 1601493208.0,
            "replies": [
                {
                    "body": "Yeah, I know. It's a huge double standard I've found both in vanilla and sugar dating.\n\nAlso, I think we should build sites to denounce scammers and time wasting SBs just as like you said for SDs.\n\nThen we could see if the model really works for both sides.",
                    "author": "AdAlternative6041",
                    "id": "g77gs8w",
                    "parent_id": "t1_g77f7ro",
                    "score": 0,
                    "created_utc": 1601493755.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, interesting some are accusing resources for safety as all being *extortion sites*...\n\nReality: These tools are for the prevention of spending time with scamming or dangerous predators who unfortunately often represent quite a percentage on sugar daddy websites now, such as seeking since they are blacklisted from seeing ladies of the evening. Also, any real SD is going to give you his real name and phone number, once a little trust is established because a good guy wants you to feel comfortable and safe...or you can figure out who he is pretty quickly with hints about his company or what he does, then look up his business, company(ies), Bloomberg, news articles, ect. as he will have an online presence.",
            "author": "sugarbooger1988",
            "id": "g76g4pj",
            "parent_id": "t1_g7594c9",
            "score": 5,
            "created_utc": 1601479228.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "g76j92a",
                    "parent_id": "t1_g76g4pj",
                    "score": 1,
                    "created_utc": 1601480548.0,
                    "replies": [
                        {
                            "body": "I disagree.",
                            "author": "sugarbooger1988",
                            "id": "g76k6m2",
                            "parent_id": "t1_g76j92a",
                            "score": 1,
                            "created_utc": 1601480952.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "g76li9t",
                                    "parent_id": "t1_g76k6m2",
                                    "score": 3,
                                    "created_utc": 1601481476.0,
                                    "replies": [
                                        {
                                            "body": "I would never share a meal or much less my body with someone who refuses to tell me their name. That’s so sketch.\n\nIf blackmail is such a paranoia for men, then screen better. \n\nPlus, while blackmail isn’t fun, it is not literally life threatening....It is against the law and all one must do is have their lawyer contact said blackmailer. Simple as that. Sexual assault, Rape and murder are heinous felonies and it’s a crime that is MUCH more serious, in which one can never really recover from and difficult to have a lawyer deal with, once it has already happened (sexual trauma and being scammed can be preventable and why would any gentleman deny a lady knowing his real name? A clever person will figure it out eventually, anyway). \n\nHow many posts of girls on this forum alone, lately, who are scared to report the predators that assaulted them because it was an SB relationship or they feel it will be viewed as prostitution with the police, if they report....  \n\nLet’s be honest here, many sugar daddy websites have become increasingly inundated with predators. A savvy woman who is good with screening and can spot a genuine SD would not need any screening apps because he is going to offer up his name (I’ve always had this happen with a genuine SD) compared to a new girl who is going this alone and doesn’t have much life experience. I advise against such a girl using the sugar websites, anyways,but if she is intent, then at least it’s good if she can screen out bad, scamming or dangerous men. This would mean knowing their real name of course.",
                                            "author": "sugarbooger1988",
                                            "id": "g76o4z7",
                                            "parent_id": "t1_g76li9t",
                                            "score": 4,
                                            "created_utc": 1601482495.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "g76t7x0",
                                                    "parent_id": "t1_g76o4z7",
                                                    "score": 1,
                                                    "created_utc": 1601484540.0,
                                                    "replies": [
                                                        {
                                                            "body": "I get men can be blackmailed—believe me—I get it. Try to have some empathy for women, too...you know, something that is not self-serving or about money and child support. \n\nAnd, stop with the straw man arguments—take them to someone else’s’ thread. For example, i can do examples, too. If you have a daughter or might one day, imagine her hanging out with men with whom she doesn’t know their name, alone in private places? Should we do a poll and ask men if they are ok with their sisters or daughters hanging out with nameless men alone? \n\nBut, I don’t have time or care to explain to grown MEN (gentlemen is a term I wouldn’t use in most cases here) that comfort and safety is a woman’s top priority—and is a *gentlemen’s* as well as he wants a lady to feel safe with him.",
                                                            "author": "sugarbooger1988",
                                                            "id": "g76ua3x",
                                                            "parent_id": "t1_g76t7x0",
                                                            "score": 4,
                                                            "created_utc": 1601484977.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[removed]",
                                                                    "author": null,
                                                                    "id": "g77236d",
                                                                    "parent_id": "t1_g76ua3x",
                                                                    "score": 1,
                                                                    "created_utc": 1601488050.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "**”Your feeling of comfort and safety doesn’t trump my need for safety.”**\n\nYes—we know—your many disgusting comments have shown us time and time again that you have no empathy or care for a woman’s safety and you are only focused on yourself and your needs, first and foremost—we get it internet stranger. Your posts speak VERY loud and clear as to what kind of character you have (lack thereof) along with lack of empathy for women’s safety or their emotional well-being more than anything...\n\nGirls reading comments like yours are why women should definitely know a man’s real name, and prove my point even more because you are very triggered by this and any guy who gets this defensive/ aggressive about basic courtesy like knowing something as simple as someone’s name is SCARY. What is someone like this hiding?...(besides lack of wealth of kindness). \n\nIf the constant paranoia of being blackmailed makes you think actual sexual “rape” and sexual assault is less traumatic an option for a woman (or man) in your self-centered scenario, (a truly disgusting comment and comparison) then perhaps, you should not be seeing girls online and risking so much, (if your wife will divorce you for your affairs) and if you won’t be able to afford “food and shelter” after a divorce” (sounds like *great SD* material, btw with such limited funds).\n\nI’m going to have to block you because my focus is on assisting girls...not wasting time teaching “men” to be a reasonable respectful and kind gentleman. That was your parent’s job.",
                                                                            "author": "sugarbooger1988",
                                                                            "id": "g78lxmg",
                                                                            "parent_id": "t1_g77236d",
                                                                            "score": 3,
                                                                            "created_utc": 1601513784.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I do not post publicly for (I’d assume?) obvious reasons.",
            "author": "sugarbooger1988",
            "id": "g76eyf5",
            "parent_id": "t1_g74yc0x",
            "score": 1,
            "created_utc": 1601478681.0,
            "replies": []
        },
        {
            "body": "Hey yes, can I DM you or feel free to message me and I can list them...",
            "author": "sugarbooger1988",
            "id": "g754csd",
            "parent_id": "t1_g74tsf2",
            "score": 2,
            "created_utc": 1601439462.0,
            "replies": [
                {
                    "body": "Sent thank you!",
                    "author": "honeypotsb",
                    "id": "g758nwg",
                    "parent_id": "t1_g754csd",
                    "score": 3,
                    "created_utc": 1601442624.0,
                    "replies": []
                },
                {
                    "body": "Sent you a DM!",
                    "author": "MissWo",
                    "id": "g75ac1r",
                    "parent_id": "t1_g754csd",
                    "score": 3,
                    "created_utc": 1601443996.0,
                    "replies": []
                },
                {
                    "body": "DMed You!",
                    "author": "Freakonthelow",
                    "id": "g75c5p2",
                    "parent_id": "t1_g754csd",
                    "score": 3,
                    "created_utc": 1601445563.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You mean extorting men or women? \n\nNo...the sites I speak of are for warning girls and not for extortion purposes. They are for safety measures for girls to know if the man is a scammer, time waster, dangerous or much worse.",
            "author": "sugarbooger1988",
            "id": "g7546b1",
            "parent_id": "t1_g751e1y",
            "score": 3,
            "created_utc": 1601439340.0,
            "replies": [
                {
                    "body": "Without moderation and asking for evidence there's no way you can tell true warnings from extortion.\n\nBut the idea isn't bad, we should have the same sites to warn guys about girls that run scams time waste or try to blackmail.",
                    "author": "AdAlternative6041",
                    "id": "g77cqtq",
                    "parent_id": "t1_g7546b1",
                    "score": 2,
                    "created_utc": 1601492242.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "DM me and I can send.",
            "author": "sugarbooger1988",
            "id": "g754khl",
            "parent_id": "t1_g74txax",
            "score": 2,
            "created_utc": 1601439608.0,
            "replies": []
        },
        {
            "body": "I’m not sure? Maybe, someone from Oz can DM it post?",
            "author": "sugarbooger1988",
            "id": "g76ea9y",
            "parent_id": "t1_g75ufq7",
            "score": 2,
            "created_utc": 1601478366.0,
            "replies": []
        },
        {
            "body": "I just was provided the sites and uhm no they aren’t... you have to have the guys info already, there are no bank accounts or card numbers or whatever you think they are. It’s pretty much “name + number: I had X experience”",
            "author": "honeypotsb",
            "id": "g77fivw",
            "parent_id": "t1_g75clif",
            "score": 4,
            "created_utc": 1601493317.0,
            "replies": [
                {
                    "body": "So I mean this is fine and if it saves one person a horrible experience it's worth it.\n\nBut I'm very suspicious of there being a likelihood you will find the person you are looking for listed on any site.. too few data points.\n\nAnd I'm super skeptical that anything conflating \"dodgy\", \"time wasting\", and \"predatory\" is trustworthy",
                    "author": "marker3000",
                    "id": "g77lpiq",
                    "parent_id": "t1_g77fivw",
                    "score": 1,
                    "created_utc": 1601495487.0,
                    "replies": [
                        {
                            "body": "I just went through my POTs and old SDs on my phone and two of them had bad things listed. One had 4 women that said he was scary and they didnt feel safe being alone with him.",
                            "author": "honeypotsb",
                            "id": "g77m6a2",
                            "parent_id": "t1_g77lpiq",
                            "score": 2,
                            "created_utc": 1601495651.0,
                            "replies": [
                                {
                                    "body": "So let's agree that 4 separate reports are a pretty big red flag and he's to be avoided.\n\nThe ones that had single bad reports... How do you know whether that's an unhappy person or a bad dude? It's probably a bad dude, but it could just be retribution over a perceived slight. \n\nAs I said to the downvote cabal above: \"So I mean this is fine and if it saves one person a horrible experience it's worth it.\"",
                                    "author": "marker3000",
                                    "id": "g78cl3k",
                                    "parent_id": "t1_g77m6a2",
                                    "score": 3,
                                    "created_utc": 1601508222.0,
                                    "replies": [
                                        {
                                            "body": "The woman said they stalked her. It’s just data you can take and make an informed decision with. If someone commented “cheap and rude” I’d think hmmm maybe that didn’t turn out well due to differing ideas of an SR, but stalking? Nah.",
                                            "author": "honeypotsb",
                                            "id": "g78dcyl",
                                            "parent_id": "t1_g78cl3k",
                                            "score": 1,
                                            "created_utc": 1601508692.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah, as someone who defaults to \"believe women\" I'd certainly be wary of anyone reported for stalking.\n\nI've also been blackmailed and threatened by so-called \"SBs\" so I'm not sure I trust everyone to be truthful, though.",
                                                    "author": "marker3000",
                                                    "id": "g78i309",
                                                    "parent_id": "t1_g78dcyl",
                                                    "score": 1,
                                                    "created_utc": 1601511534.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">It’s pretty much “name + number: I had X experience”\n\nDo you realize how meaningless that is? So you can write anything about anyone and you take that as a trusted source of information?\n\nWhat if someone reported you as a scammer/blackmailer? Maybe THEN you'll realize how dangerous those sites are.",
                    "author": "AdAlternative6041",
                    "id": "g78li7t",
                    "parent_id": "t1_g77fivw",
                    "score": 0,
                    "created_utc": 1601513542.0,
                    "replies": [
                        {
                            "body": "🙄 oh no I would have a hard time finding an SD. I’d hardly define that as dangerous.",
                            "author": "honeypotsb",
                            "id": "g78v665",
                            "parent_id": "t1_g78li7t",
                            "score": 2,
                            "created_utc": 1601518978.0,
                            "replies": [
                                {
                                    "body": "It's dangerous once your name is on the internet related to something you didn't do.\n\nBecause there's no control over what anyone posts, do you seriously don't understand how that could be used against you?",
                                    "author": "AdAlternative6041",
                                    "id": "g78zkf6",
                                    "parent_id": "t1_g78v665",
                                    "score": 1,
                                    "created_utc": 1601521519.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Those? What are you referencing? Because I didn’t name anything...The link someone else posted is not what I am talking about, anyway.\n\nYou really have no idea what you wrote of and really could care less what you “imagine in your fantasy” about resources *for women* that have nothing to do with extortion but do have to do with screening and safety for women.",
            "author": "sugarbooger1988",
            "id": "g76ekzd",
            "parent_id": "t1_g75clif",
            "score": 2,
            "created_utc": 1601478507.0,
            "replies": [
                {
                    "body": "And again, the resources that you describe *could* exist in theory, but do not exist in practice. \n\nMost people will never report a predator anywhere, let alone to a resource list they don't even know exist.\n\nNever mind that you're conflating predators and people who are \"time wasters\". Who is defining that latter category exactly?",
                    "author": "marker3000",
                    "id": "g76pykq",
                    "parent_id": "t1_g76ekzd",
                    "score": 2,
                    "created_utc": 1601483245.0,
                    "replies": [
                        {
                            "body": "You certainly are “passionate” about this, considering safety resources for women “do not exist” 😂😂",
                            "author": "sugarbooger1988",
                            "id": "g76q8cv",
                            "parent_id": "t1_g76pykq",
                            "score": 1,
                            "created_utc": 1601483352.0,
                            "replies": [
                                {
                                    "body": "A handful of anecdotes from a handful of people seen by a handful of other people do not constitute a \"safety resource\"\n\nI have zero patience for predators and think they should be made to suffer the most serious consequences imaginable for their actions.\n\nThat you conflate them with \"time wasters\" says more than you realize.",
                                    "author": "marker3000",
                                    "id": "g771ljm",
                                    "parent_id": "t1_g76q8cv",
                                    "score": 2,
                                    "created_utc": 1601487860.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "100 percent agree! My best SDs have had pretty public personas and I never would have met them if I insisted on seeing their ID first. Thankfully a lot of other SBs passed them up.\n\nAs long as we take a lot of other precautions to be safe about where we’re meeting and having a person aware of our location, we significantly lower our chances of something happening. If we’re really concerned we can ask a friend to come along and sit at a table near the entrance and ensure we leave alone.",
            "author": "LVSugarBebe",
            "id": "g77lcm8",
            "parent_id": "t1_g77kjr4",
            "score": 1,
            "created_utc": 1601495364.0,
            "replies": []
        },
        {
            "body": "Yeah, I know. It's a huge double standard I've found both in vanilla and sugar dating.\n\nAlso, I think we should build sites to denounce scammers and time wasting SBs just as like you said for SDs.\n\nThen we could see if the model really works for both sides.",
            "author": "AdAlternative6041",
            "id": "g77gs8w",
            "parent_id": "t1_g77f7ro",
            "score": 0,
            "created_utc": 1601493755.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "g76j92a",
            "parent_id": "t1_g76g4pj",
            "score": 1,
            "created_utc": 1601480548.0,
            "replies": [
                {
                    "body": "I disagree.",
                    "author": "sugarbooger1988",
                    "id": "g76k6m2",
                    "parent_id": "t1_g76j92a",
                    "score": 1,
                    "created_utc": 1601480952.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "g76li9t",
                            "parent_id": "t1_g76k6m2",
                            "score": 3,
                            "created_utc": 1601481476.0,
                            "replies": [
                                {
                                    "body": "I would never share a meal or much less my body with someone who refuses to tell me their name. That’s so sketch.\n\nIf blackmail is such a paranoia for men, then screen better. \n\nPlus, while blackmail isn’t fun, it is not literally life threatening....It is against the law and all one must do is have their lawyer contact said blackmailer. Simple as that. Sexual assault, Rape and murder are heinous felonies and it’s a crime that is MUCH more serious, in which one can never really recover from and difficult to have a lawyer deal with, once it has already happened (sexual trauma and being scammed can be preventable and why would any gentleman deny a lady knowing his real name? A clever person will figure it out eventually, anyway). \n\nHow many posts of girls on this forum alone, lately, who are scared to report the predators that assaulted them because it was an SB relationship or they feel it will be viewed as prostitution with the police, if they report....  \n\nLet’s be honest here, many sugar daddy websites have become increasingly inundated with predators. A savvy woman who is good with screening and can spot a genuine SD would not need any screening apps because he is going to offer up his name (I’ve always had this happen with a genuine SD) compared to a new girl who is going this alone and doesn’t have much life experience. I advise against such a girl using the sugar websites, anyways,but if she is intent, then at least it’s good if she can screen out bad, scamming or dangerous men. This would mean knowing their real name of course.",
                                    "author": "sugarbooger1988",
                                    "id": "g76o4z7",
                                    "parent_id": "t1_g76li9t",
                                    "score": 4,
                                    "created_utc": 1601482495.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "g76t7x0",
                                            "parent_id": "t1_g76o4z7",
                                            "score": 1,
                                            "created_utc": 1601484540.0,
                                            "replies": [
                                                {
                                                    "body": "I get men can be blackmailed—believe me—I get it. Try to have some empathy for women, too...you know, something that is not self-serving or about money and child support. \n\nAnd, stop with the straw man arguments—take them to someone else’s’ thread. For example, i can do examples, too. If you have a daughter or might one day, imagine her hanging out with men with whom she doesn’t know their name, alone in private places? Should we do a poll and ask men if they are ok with their sisters or daughters hanging out with nameless men alone? \n\nBut, I don’t have time or care to explain to grown MEN (gentlemen is a term I wouldn’t use in most cases here) that comfort and safety is a woman’s top priority—and is a *gentlemen’s* as well as he wants a lady to feel safe with him.",
                                                    "author": "sugarbooger1988",
                                                    "id": "g76ua3x",
                                                    "parent_id": "t1_g76t7x0",
                                                    "score": 4,
                                                    "created_utc": 1601484977.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "g77236d",
                                                            "parent_id": "t1_g76ua3x",
                                                            "score": 1,
                                                            "created_utc": 1601488050.0,
                                                            "replies": [
                                                                {
                                                                    "body": "**”Your feeling of comfort and safety doesn’t trump my need for safety.”**\n\nYes—we know—your many disgusting comments have shown us time and time again that you have no empathy or care for a woman’s safety and you are only focused on yourself and your needs, first and foremost—we get it internet stranger. Your posts speak VERY loud and clear as to what kind of character you have (lack thereof) along with lack of empathy for women’s safety or their emotional well-being more than anything...\n\nGirls reading comments like yours are why women should definitely know a man’s real name, and prove my point even more because you are very triggered by this and any guy who gets this defensive/ aggressive about basic courtesy like knowing something as simple as someone’s name is SCARY. What is someone like this hiding?...(besides lack of wealth of kindness). \n\nIf the constant paranoia of being blackmailed makes you think actual sexual “rape” and sexual assault is less traumatic an option for a woman (or man) in your self-centered scenario, (a truly disgusting comment and comparison) then perhaps, you should not be seeing girls online and risking so much, (if your wife will divorce you for your affairs) and if you won’t be able to afford “food and shelter” after a divorce” (sounds like *great SD* material, btw with such limited funds).\n\nI’m going to have to block you because my focus is on assisting girls...not wasting time teaching “men” to be a reasonable respectful and kind gentleman. That was your parent’s job.",
                                                                    "author": "sugarbooger1988",
                                                                    "id": "g78lxmg",
                                                                    "parent_id": "t1_g77236d",
                                                                    "score": 3,
                                                                    "created_utc": 1601513784.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sent thank you!",
            "author": "honeypotsb",
            "id": "g758nwg",
            "parent_id": "t1_g754csd",
            "score": 3,
            "created_utc": 1601442624.0,
            "replies": []
        },
        {
            "body": "Sent you a DM!",
            "author": "MissWo",
            "id": "g75ac1r",
            "parent_id": "t1_g754csd",
            "score": 3,
            "created_utc": 1601443996.0,
            "replies": []
        },
        {
            "body": "DMed You!",
            "author": "Freakonthelow",
            "id": "g75c5p2",
            "parent_id": "t1_g754csd",
            "score": 3,
            "created_utc": 1601445563.0,
            "replies": []
        },
        {
            "body": "Without moderation and asking for evidence there's no way you can tell true warnings from extortion.\n\nBut the idea isn't bad, we should have the same sites to warn guys about girls that run scams time waste or try to blackmail.",
            "author": "AdAlternative6041",
            "id": "g77cqtq",
            "parent_id": "t1_g7546b1",
            "score": 2,
            "created_utc": 1601492242.0,
            "replies": []
        },
        {
            "body": "So I mean this is fine and if it saves one person a horrible experience it's worth it.\n\nBut I'm very suspicious of there being a likelihood you will find the person you are looking for listed on any site.. too few data points.\n\nAnd I'm super skeptical that anything conflating \"dodgy\", \"time wasting\", and \"predatory\" is trustworthy",
            "author": "marker3000",
            "id": "g77lpiq",
            "parent_id": "t1_g77fivw",
            "score": 1,
            "created_utc": 1601495487.0,
            "replies": [
                {
                    "body": "I just went through my POTs and old SDs on my phone and two of them had bad things listed. One had 4 women that said he was scary and they didnt feel safe being alone with him.",
                    "author": "honeypotsb",
                    "id": "g77m6a2",
                    "parent_id": "t1_g77lpiq",
                    "score": 2,
                    "created_utc": 1601495651.0,
                    "replies": [
                        {
                            "body": "So let's agree that 4 separate reports are a pretty big red flag and he's to be avoided.\n\nThe ones that had single bad reports... How do you know whether that's an unhappy person or a bad dude? It's probably a bad dude, but it could just be retribution over a perceived slight. \n\nAs I said to the downvote cabal above: \"So I mean this is fine and if it saves one person a horrible experience it's worth it.\"",
                            "author": "marker3000",
                            "id": "g78cl3k",
                            "parent_id": "t1_g77m6a2",
                            "score": 3,
                            "created_utc": 1601508222.0,
                            "replies": [
                                {
                                    "body": "The woman said they stalked her. It’s just data you can take and make an informed decision with. If someone commented “cheap and rude” I’d think hmmm maybe that didn’t turn out well due to differing ideas of an SR, but stalking? Nah.",
                                    "author": "honeypotsb",
                                    "id": "g78dcyl",
                                    "parent_id": "t1_g78cl3k",
                                    "score": 1,
                                    "created_utc": 1601508692.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, as someone who defaults to \"believe women\" I'd certainly be wary of anyone reported for stalking.\n\nI've also been blackmailed and threatened by so-called \"SBs\" so I'm not sure I trust everyone to be truthful, though.",
                                            "author": "marker3000",
                                            "id": "g78i309",
                                            "parent_id": "t1_g78dcyl",
                                            "score": 1,
                                            "created_utc": 1601511534.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">It’s pretty much “name + number: I had X experience”\n\nDo you realize how meaningless that is? So you can write anything about anyone and you take that as a trusted source of information?\n\nWhat if someone reported you as a scammer/blackmailer? Maybe THEN you'll realize how dangerous those sites are.",
            "author": "AdAlternative6041",
            "id": "g78li7t",
            "parent_id": "t1_g77fivw",
            "score": 0,
            "created_utc": 1601513542.0,
            "replies": [
                {
                    "body": "🙄 oh no I would have a hard time finding an SD. I’d hardly define that as dangerous.",
                    "author": "honeypotsb",
                    "id": "g78v665",
                    "parent_id": "t1_g78li7t",
                    "score": 2,
                    "created_utc": 1601518978.0,
                    "replies": [
                        {
                            "body": "It's dangerous once your name is on the internet related to something you didn't do.\n\nBecause there's no control over what anyone posts, do you seriously don't understand how that could be used against you?",
                            "author": "AdAlternative6041",
                            "id": "g78zkf6",
                            "parent_id": "t1_g78v665",
                            "score": 1,
                            "created_utc": 1601521519.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And again, the resources that you describe *could* exist in theory, but do not exist in practice. \n\nMost people will never report a predator anywhere, let alone to a resource list they don't even know exist.\n\nNever mind that you're conflating predators and people who are \"time wasters\". Who is defining that latter category exactly?",
            "author": "marker3000",
            "id": "g76pykq",
            "parent_id": "t1_g76ekzd",
            "score": 2,
            "created_utc": 1601483245.0,
            "replies": [
                {
                    "body": "You certainly are “passionate” about this, considering safety resources for women “do not exist” 😂😂",
                    "author": "sugarbooger1988",
                    "id": "g76q8cv",
                    "parent_id": "t1_g76pykq",
                    "score": 1,
                    "created_utc": 1601483352.0,
                    "replies": [
                        {
                            "body": "A handful of anecdotes from a handful of people seen by a handful of other people do not constitute a \"safety resource\"\n\nI have zero patience for predators and think they should be made to suffer the most serious consequences imaginable for their actions.\n\nThat you conflate them with \"time wasters\" says more than you realize.",
                            "author": "marker3000",
                            "id": "g771ljm",
                            "parent_id": "t1_g76q8cv",
                            "score": 2,
                            "created_utc": 1601487860.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I disagree.",
            "author": "sugarbooger1988",
            "id": "g76k6m2",
            "parent_id": "t1_g76j92a",
            "score": 1,
            "created_utc": 1601480952.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "g76li9t",
                    "parent_id": "t1_g76k6m2",
                    "score": 3,
                    "created_utc": 1601481476.0,
                    "replies": [
                        {
                            "body": "I would never share a meal or much less my body with someone who refuses to tell me their name. That’s so sketch.\n\nIf blackmail is such a paranoia for men, then screen better. \n\nPlus, while blackmail isn’t fun, it is not literally life threatening....It is against the law and all one must do is have their lawyer contact said blackmailer. Simple as that. Sexual assault, Rape and murder are heinous felonies and it’s a crime that is MUCH more serious, in which one can never really recover from and difficult to have a lawyer deal with, once it has already happened (sexual trauma and being scammed can be preventable and why would any gentleman deny a lady knowing his real name? A clever person will figure it out eventually, anyway). \n\nHow many posts of girls on this forum alone, lately, who are scared to report the predators that assaulted them because it was an SB relationship or they feel it will be viewed as prostitution with the police, if they report....  \n\nLet’s be honest here, many sugar daddy websites have become increasingly inundated with predators. A savvy woman who is good with screening and can spot a genuine SD would not need any screening apps because he is going to offer up his name (I’ve always had this happen with a genuine SD) compared to a new girl who is going this alone and doesn’t have much life experience. I advise against such a girl using the sugar websites, anyways,but if she is intent, then at least it’s good if she can screen out bad, scamming or dangerous men. This would mean knowing their real name of course.",
                            "author": "sugarbooger1988",
                            "id": "g76o4z7",
                            "parent_id": "t1_g76li9t",
                            "score": 4,
                            "created_utc": 1601482495.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "g76t7x0",
                                    "parent_id": "t1_g76o4z7",
                                    "score": 1,
                                    "created_utc": 1601484540.0,
                                    "replies": [
                                        {
                                            "body": "I get men can be blackmailed—believe me—I get it. Try to have some empathy for women, too...you know, something that is not self-serving or about money and child support. \n\nAnd, stop with the straw man arguments—take them to someone else’s’ thread. For example, i can do examples, too. If you have a daughter or might one day, imagine her hanging out with men with whom she doesn’t know their name, alone in private places? Should we do a poll and ask men if they are ok with their sisters or daughters hanging out with nameless men alone? \n\nBut, I don’t have time or care to explain to grown MEN (gentlemen is a term I wouldn’t use in most cases here) that comfort and safety is a woman’s top priority—and is a *gentlemen’s* as well as he wants a lady to feel safe with him.",
                                            "author": "sugarbooger1988",
                                            "id": "g76ua3x",
                                            "parent_id": "t1_g76t7x0",
                                            "score": 4,
                                            "created_utc": 1601484977.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "g77236d",
                                                    "parent_id": "t1_g76ua3x",
                                                    "score": 1,
                                                    "created_utc": 1601488050.0,
                                                    "replies": [
                                                        {
                                                            "body": "**”Your feeling of comfort and safety doesn’t trump my need for safety.”**\n\nYes—we know—your many disgusting comments have shown us time and time again that you have no empathy or care for a woman’s safety and you are only focused on yourself and your needs, first and foremost—we get it internet stranger. Your posts speak VERY loud and clear as to what kind of character you have (lack thereof) along with lack of empathy for women’s safety or their emotional well-being more than anything...\n\nGirls reading comments like yours are why women should definitely know a man’s real name, and prove my point even more because you are very triggered by this and any guy who gets this defensive/ aggressive about basic courtesy like knowing something as simple as someone’s name is SCARY. What is someone like this hiding?...(besides lack of wealth of kindness). \n\nIf the constant paranoia of being blackmailed makes you think actual sexual “rape” and sexual assault is less traumatic an option for a woman (or man) in your self-centered scenario, (a truly disgusting comment and comparison) then perhaps, you should not be seeing girls online and risking so much, (if your wife will divorce you for your affairs) and if you won’t be able to afford “food and shelter” after a divorce” (sounds like *great SD* material, btw with such limited funds).\n\nI’m going to have to block you because my focus is on assisting girls...not wasting time teaching “men” to be a reasonable respectful and kind gentleman. That was your parent’s job.",
                                                            "author": "sugarbooger1988",
                                                            "id": "g78lxmg",
                                                            "parent_id": "t1_g77236d",
                                                            "score": 3,
                                                            "created_utc": 1601513784.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I just went through my POTs and old SDs on my phone and two of them had bad things listed. One had 4 women that said he was scary and they didnt feel safe being alone with him.",
            "author": "honeypotsb",
            "id": "g77m6a2",
            "parent_id": "t1_g77lpiq",
            "score": 2,
            "created_utc": 1601495651.0,
            "replies": [
                {
                    "body": "So let's agree that 4 separate reports are a pretty big red flag and he's to be avoided.\n\nThe ones that had single bad reports... How do you know whether that's an unhappy person or a bad dude? It's probably a bad dude, but it could just be retribution over a perceived slight. \n\nAs I said to the downvote cabal above: \"So I mean this is fine and if it saves one person a horrible experience it's worth it.\"",
                    "author": "marker3000",
                    "id": "g78cl3k",
                    "parent_id": "t1_g77m6a2",
                    "score": 3,
                    "created_utc": 1601508222.0,
                    "replies": [
                        {
                            "body": "The woman said they stalked her. It’s just data you can take and make an informed decision with. If someone commented “cheap and rude” I’d think hmmm maybe that didn’t turn out well due to differing ideas of an SR, but stalking? Nah.",
                            "author": "honeypotsb",
                            "id": "g78dcyl",
                            "parent_id": "t1_g78cl3k",
                            "score": 1,
                            "created_utc": 1601508692.0,
                            "replies": [
                                {
                                    "body": "Yeah, as someone who defaults to \"believe women\" I'd certainly be wary of anyone reported for stalking.\n\nI've also been blackmailed and threatened by so-called \"SBs\" so I'm not sure I trust everyone to be truthful, though.",
                                    "author": "marker3000",
                                    "id": "g78i309",
                                    "parent_id": "t1_g78dcyl",
                                    "score": 1,
                                    "created_utc": 1601511534.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "🙄 oh no I would have a hard time finding an SD. I’d hardly define that as dangerous.",
            "author": "honeypotsb",
            "id": "g78v665",
            "parent_id": "t1_g78li7t",
            "score": 2,
            "created_utc": 1601518978.0,
            "replies": [
                {
                    "body": "It's dangerous once your name is on the internet related to something you didn't do.\n\nBecause there's no control over what anyone posts, do you seriously don't understand how that could be used against you?",
                    "author": "AdAlternative6041",
                    "id": "g78zkf6",
                    "parent_id": "t1_g78v665",
                    "score": 1,
                    "created_utc": 1601521519.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You certainly are “passionate” about this, considering safety resources for women “do not exist” 😂😂",
            "author": "sugarbooger1988",
            "id": "g76q8cv",
            "parent_id": "t1_g76pykq",
            "score": 1,
            "created_utc": 1601483352.0,
            "replies": [
                {
                    "body": "A handful of anecdotes from a handful of people seen by a handful of other people do not constitute a \"safety resource\"\n\nI have zero patience for predators and think they should be made to suffer the most serious consequences imaginable for their actions.\n\nThat you conflate them with \"time wasters\" says more than you realize.",
                    "author": "marker3000",
                    "id": "g771ljm",
                    "parent_id": "t1_g76q8cv",
                    "score": 2,
                    "created_utc": 1601487860.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "g76li9t",
            "parent_id": "t1_g76k6m2",
            "score": 3,
            "created_utc": 1601481476.0,
            "replies": [
                {
                    "body": "I would never share a meal or much less my body with someone who refuses to tell me their name. That’s so sketch.\n\nIf blackmail is such a paranoia for men, then screen better. \n\nPlus, while blackmail isn’t fun, it is not literally life threatening....It is against the law and all one must do is have their lawyer contact said blackmailer. Simple as that. Sexual assault, Rape and murder are heinous felonies and it’s a crime that is MUCH more serious, in which one can never really recover from and difficult to have a lawyer deal with, once it has already happened (sexual trauma and being scammed can be preventable and why would any gentleman deny a lady knowing his real name? A clever person will figure it out eventually, anyway). \n\nHow many posts of girls on this forum alone, lately, who are scared to report the predators that assaulted them because it was an SB relationship or they feel it will be viewed as prostitution with the police, if they report....  \n\nLet’s be honest here, many sugar daddy websites have become increasingly inundated with predators. A savvy woman who is good with screening and can spot a genuine SD would not need any screening apps because he is going to offer up his name (I’ve always had this happen with a genuine SD) compared to a new girl who is going this alone and doesn’t have much life experience. I advise against such a girl using the sugar websites, anyways,but if she is intent, then at least it’s good if she can screen out bad, scamming or dangerous men. This would mean knowing their real name of course.",
                    "author": "sugarbooger1988",
                    "id": "g76o4z7",
                    "parent_id": "t1_g76li9t",
                    "score": 4,
                    "created_utc": 1601482495.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "g76t7x0",
                            "parent_id": "t1_g76o4z7",
                            "score": 1,
                            "created_utc": 1601484540.0,
                            "replies": [
                                {
                                    "body": "I get men can be blackmailed—believe me—I get it. Try to have some empathy for women, too...you know, something that is not self-serving or about money and child support. \n\nAnd, stop with the straw man arguments—take them to someone else’s’ thread. For example, i can do examples, too. If you have a daughter or might one day, imagine her hanging out with men with whom she doesn’t know their name, alone in private places? Should we do a poll and ask men if they are ok with their sisters or daughters hanging out with nameless men alone? \n\nBut, I don’t have time or care to explain to grown MEN (gentlemen is a term I wouldn’t use in most cases here) that comfort and safety is a woman’s top priority—and is a *gentlemen’s* as well as he wants a lady to feel safe with him.",
                                    "author": "sugarbooger1988",
                                    "id": "g76ua3x",
                                    "parent_id": "t1_g76t7x0",
                                    "score": 4,
                                    "created_utc": 1601484977.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "g77236d",
                                            "parent_id": "t1_g76ua3x",
                                            "score": 1,
                                            "created_utc": 1601488050.0,
                                            "replies": [
                                                {
                                                    "body": "**”Your feeling of comfort and safety doesn’t trump my need for safety.”**\n\nYes—we know—your many disgusting comments have shown us time and time again that you have no empathy or care for a woman’s safety and you are only focused on yourself and your needs, first and foremost—we get it internet stranger. Your posts speak VERY loud and clear as to what kind of character you have (lack thereof) along with lack of empathy for women’s safety or their emotional well-being more than anything...\n\nGirls reading comments like yours are why women should definitely know a man’s real name, and prove my point even more because you are very triggered by this and any guy who gets this defensive/ aggressive about basic courtesy like knowing something as simple as someone’s name is SCARY. What is someone like this hiding?...(besides lack of wealth of kindness). \n\nIf the constant paranoia of being blackmailed makes you think actual sexual “rape” and sexual assault is less traumatic an option for a woman (or man) in your self-centered scenario, (a truly disgusting comment and comparison) then perhaps, you should not be seeing girls online and risking so much, (if your wife will divorce you for your affairs) and if you won’t be able to afford “food and shelter” after a divorce” (sounds like *great SD* material, btw with such limited funds).\n\nI’m going to have to block you because my focus is on assisting girls...not wasting time teaching “men” to be a reasonable respectful and kind gentleman. That was your parent’s job.",
                                                    "author": "sugarbooger1988",
                                                    "id": "g78lxmg",
                                                    "parent_id": "t1_g77236d",
                                                    "score": 3,
                                                    "created_utc": 1601513784.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So let's agree that 4 separate reports are a pretty big red flag and he's to be avoided.\n\nThe ones that had single bad reports... How do you know whether that's an unhappy person or a bad dude? It's probably a bad dude, but it could just be retribution over a perceived slight. \n\nAs I said to the downvote cabal above: \"So I mean this is fine and if it saves one person a horrible experience it's worth it.\"",
            "author": "marker3000",
            "id": "g78cl3k",
            "parent_id": "t1_g77m6a2",
            "score": 3,
            "created_utc": 1601508222.0,
            "replies": [
                {
                    "body": "The woman said they stalked her. It’s just data you can take and make an informed decision with. If someone commented “cheap and rude” I’d think hmmm maybe that didn’t turn out well due to differing ideas of an SR, but stalking? Nah.",
                    "author": "honeypotsb",
                    "id": "g78dcyl",
                    "parent_id": "t1_g78cl3k",
                    "score": 1,
                    "created_utc": 1601508692.0,
                    "replies": [
                        {
                            "body": "Yeah, as someone who defaults to \"believe women\" I'd certainly be wary of anyone reported for stalking.\n\nI've also been blackmailed and threatened by so-called \"SBs\" so I'm not sure I trust everyone to be truthful, though.",
                            "author": "marker3000",
                            "id": "g78i309",
                            "parent_id": "t1_g78dcyl",
                            "score": 1,
                            "created_utc": 1601511534.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's dangerous once your name is on the internet related to something you didn't do.\n\nBecause there's no control over what anyone posts, do you seriously don't understand how that could be used against you?",
            "author": "AdAlternative6041",
            "id": "g78zkf6",
            "parent_id": "t1_g78v665",
            "score": 1,
            "created_utc": 1601521519.0,
            "replies": []
        },
        {
            "body": "A handful of anecdotes from a handful of people seen by a handful of other people do not constitute a \"safety resource\"\n\nI have zero patience for predators and think they should be made to suffer the most serious consequences imaginable for their actions.\n\nThat you conflate them with \"time wasters\" says more than you realize.",
            "author": "marker3000",
            "id": "g771ljm",
            "parent_id": "t1_g76q8cv",
            "score": 2,
            "created_utc": 1601487860.0,
            "replies": []
        },
        {
            "body": "I would never share a meal or much less my body with someone who refuses to tell me their name. That’s so sketch.\n\nIf blackmail is such a paranoia for men, then screen better. \n\nPlus, while blackmail isn’t fun, it is not literally life threatening....It is against the law and all one must do is have their lawyer contact said blackmailer. Simple as that. Sexual assault, Rape and murder are heinous felonies and it’s a crime that is MUCH more serious, in which one can never really recover from and difficult to have a lawyer deal with, once it has already happened (sexual trauma and being scammed can be preventable and why would any gentleman deny a lady knowing his real name? A clever person will figure it out eventually, anyway). \n\nHow many posts of girls on this forum alone, lately, who are scared to report the predators that assaulted them because it was an SB relationship or they feel it will be viewed as prostitution with the police, if they report....  \n\nLet’s be honest here, many sugar daddy websites have become increasingly inundated with predators. A savvy woman who is good with screening and can spot a genuine SD would not need any screening apps because he is going to offer up his name (I’ve always had this happen with a genuine SD) compared to a new girl who is going this alone and doesn’t have much life experience. I advise against such a girl using the sugar websites, anyways,but if she is intent, then at least it’s good if she can screen out bad, scamming or dangerous men. This would mean knowing their real name of course.",
            "author": "sugarbooger1988",
            "id": "g76o4z7",
            "parent_id": "t1_g76li9t",
            "score": 4,
            "created_utc": 1601482495.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "g76t7x0",
                    "parent_id": "t1_g76o4z7",
                    "score": 1,
                    "created_utc": 1601484540.0,
                    "replies": [
                        {
                            "body": "I get men can be blackmailed—believe me—I get it. Try to have some empathy for women, too...you know, something that is not self-serving or about money and child support. \n\nAnd, stop with the straw man arguments—take them to someone else’s’ thread. For example, i can do examples, too. If you have a daughter or might one day, imagine her hanging out with men with whom she doesn’t know their name, alone in private places? Should we do a poll and ask men if they are ok with their sisters or daughters hanging out with nameless men alone? \n\nBut, I don’t have time or care to explain to grown MEN (gentlemen is a term I wouldn’t use in most cases here) that comfort and safety is a woman’s top priority—and is a *gentlemen’s* as well as he wants a lady to feel safe with him.",
                            "author": "sugarbooger1988",
                            "id": "g76ua3x",
                            "parent_id": "t1_g76t7x0",
                            "score": 4,
                            "created_utc": 1601484977.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "g77236d",
                                    "parent_id": "t1_g76ua3x",
                                    "score": 1,
                                    "created_utc": 1601488050.0,
                                    "replies": [
                                        {
                                            "body": "**”Your feeling of comfort and safety doesn’t trump my need for safety.”**\n\nYes—we know—your many disgusting comments have shown us time and time again that you have no empathy or care for a woman’s safety and you are only focused on yourself and your needs, first and foremost—we get it internet stranger. Your posts speak VERY loud and clear as to what kind of character you have (lack thereof) along with lack of empathy for women’s safety or their emotional well-being more than anything...\n\nGirls reading comments like yours are why women should definitely know a man’s real name, and prove my point even more because you are very triggered by this and any guy who gets this defensive/ aggressive about basic courtesy like knowing something as simple as someone’s name is SCARY. What is someone like this hiding?...(besides lack of wealth of kindness). \n\nIf the constant paranoia of being blackmailed makes you think actual sexual “rape” and sexual assault is less traumatic an option for a woman (or man) in your self-centered scenario, (a truly disgusting comment and comparison) then perhaps, you should not be seeing girls online and risking so much, (if your wife will divorce you for your affairs) and if you won’t be able to afford “food and shelter” after a divorce” (sounds like *great SD* material, btw with such limited funds).\n\nI’m going to have to block you because my focus is on assisting girls...not wasting time teaching “men” to be a reasonable respectful and kind gentleman. That was your parent’s job.",
                                            "author": "sugarbooger1988",
                                            "id": "g78lxmg",
                                            "parent_id": "t1_g77236d",
                                            "score": 3,
                                            "created_utc": 1601513784.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The woman said they stalked her. It’s just data you can take and make an informed decision with. If someone commented “cheap and rude” I’d think hmmm maybe that didn’t turn out well due to differing ideas of an SR, but stalking? Nah.",
            "author": "honeypotsb",
            "id": "g78dcyl",
            "parent_id": "t1_g78cl3k",
            "score": 1,
            "created_utc": 1601508692.0,
            "replies": [
                {
                    "body": "Yeah, as someone who defaults to \"believe women\" I'd certainly be wary of anyone reported for stalking.\n\nI've also been blackmailed and threatened by so-called \"SBs\" so I'm not sure I trust everyone to be truthful, though.",
                    "author": "marker3000",
                    "id": "g78i309",
                    "parent_id": "t1_g78dcyl",
                    "score": 1,
                    "created_utc": 1601511534.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "g76t7x0",
            "parent_id": "t1_g76o4z7",
            "score": 1,
            "created_utc": 1601484540.0,
            "replies": [
                {
                    "body": "I get men can be blackmailed—believe me—I get it. Try to have some empathy for women, too...you know, something that is not self-serving or about money and child support. \n\nAnd, stop with the straw man arguments—take them to someone else’s’ thread. For example, i can do examples, too. If you have a daughter or might one day, imagine her hanging out with men with whom she doesn’t know their name, alone in private places? Should we do a poll and ask men if they are ok with their sisters or daughters hanging out with nameless men alone? \n\nBut, I don’t have time or care to explain to grown MEN (gentlemen is a term I wouldn’t use in most cases here) that comfort and safety is a woman’s top priority—and is a *gentlemen’s* as well as he wants a lady to feel safe with him.",
                    "author": "sugarbooger1988",
                    "id": "g76ua3x",
                    "parent_id": "t1_g76t7x0",
                    "score": 4,
                    "created_utc": 1601484977.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "g77236d",
                            "parent_id": "t1_g76ua3x",
                            "score": 1,
                            "created_utc": 1601488050.0,
                            "replies": [
                                {
                                    "body": "**”Your feeling of comfort and safety doesn’t trump my need for safety.”**\n\nYes—we know—your many disgusting comments have shown us time and time again that you have no empathy or care for a woman’s safety and you are only focused on yourself and your needs, first and foremost—we get it internet stranger. Your posts speak VERY loud and clear as to what kind of character you have (lack thereof) along with lack of empathy for women’s safety or their emotional well-being more than anything...\n\nGirls reading comments like yours are why women should definitely know a man’s real name, and prove my point even more because you are very triggered by this and any guy who gets this defensive/ aggressive about basic courtesy like knowing something as simple as someone’s name is SCARY. What is someone like this hiding?...(besides lack of wealth of kindness). \n\nIf the constant paranoia of being blackmailed makes you think actual sexual “rape” and sexual assault is less traumatic an option for a woman (or man) in your self-centered scenario, (a truly disgusting comment and comparison) then perhaps, you should not be seeing girls online and risking so much, (if your wife will divorce you for your affairs) and if you won’t be able to afford “food and shelter” after a divorce” (sounds like *great SD* material, btw with such limited funds).\n\nI’m going to have to block you because my focus is on assisting girls...not wasting time teaching “men” to be a reasonable respectful and kind gentleman. That was your parent’s job.",
                                    "author": "sugarbooger1988",
                                    "id": "g78lxmg",
                                    "parent_id": "t1_g77236d",
                                    "score": 3,
                                    "created_utc": 1601513784.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, as someone who defaults to \"believe women\" I'd certainly be wary of anyone reported for stalking.\n\nI've also been blackmailed and threatened by so-called \"SBs\" so I'm not sure I trust everyone to be truthful, though.",
            "author": "marker3000",
            "id": "g78i309",
            "parent_id": "t1_g78dcyl",
            "score": 1,
            "created_utc": 1601511534.0,
            "replies": []
        },
        {
            "body": "I get men can be blackmailed—believe me—I get it. Try to have some empathy for women, too...you know, something that is not self-serving or about money and child support. \n\nAnd, stop with the straw man arguments—take them to someone else’s’ thread. For example, i can do examples, too. If you have a daughter or might one day, imagine her hanging out with men with whom she doesn’t know their name, alone in private places? Should we do a poll and ask men if they are ok with their sisters or daughters hanging out with nameless men alone? \n\nBut, I don’t have time or care to explain to grown MEN (gentlemen is a term I wouldn’t use in most cases here) that comfort and safety is a woman’s top priority—and is a *gentlemen’s* as well as he wants a lady to feel safe with him.",
            "author": "sugarbooger1988",
            "id": "g76ua3x",
            "parent_id": "t1_g76t7x0",
            "score": 4,
            "created_utc": 1601484977.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "g77236d",
                    "parent_id": "t1_g76ua3x",
                    "score": 1,
                    "created_utc": 1601488050.0,
                    "replies": [
                        {
                            "body": "**”Your feeling of comfort and safety doesn’t trump my need for safety.”**\n\nYes—we know—your many disgusting comments have shown us time and time again that you have no empathy or care for a woman’s safety and you are only focused on yourself and your needs, first and foremost—we get it internet stranger. Your posts speak VERY loud and clear as to what kind of character you have (lack thereof) along with lack of empathy for women’s safety or their emotional well-being more than anything...\n\nGirls reading comments like yours are why women should definitely know a man’s real name, and prove my point even more because you are very triggered by this and any guy who gets this defensive/ aggressive about basic courtesy like knowing something as simple as someone’s name is SCARY. What is someone like this hiding?...(besides lack of wealth of kindness). \n\nIf the constant paranoia of being blackmailed makes you think actual sexual “rape” and sexual assault is less traumatic an option for a woman (or man) in your self-centered scenario, (a truly disgusting comment and comparison) then perhaps, you should not be seeing girls online and risking so much, (if your wife will divorce you for your affairs) and if you won’t be able to afford “food and shelter” after a divorce” (sounds like *great SD* material, btw with such limited funds).\n\nI’m going to have to block you because my focus is on assisting girls...not wasting time teaching “men” to be a reasonable respectful and kind gentleman. That was your parent’s job.",
                            "author": "sugarbooger1988",
                            "id": "g78lxmg",
                            "parent_id": "t1_g77236d",
                            "score": 3,
                            "created_utc": 1601513784.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "g77236d",
            "parent_id": "t1_g76ua3x",
            "score": 1,
            "created_utc": 1601488050.0,
            "replies": [
                {
                    "body": "**”Your feeling of comfort and safety doesn’t trump my need for safety.”**\n\nYes—we know—your many disgusting comments have shown us time and time again that you have no empathy or care for a woman’s safety and you are only focused on yourself and your needs, first and foremost—we get it internet stranger. Your posts speak VERY loud and clear as to what kind of character you have (lack thereof) along with lack of empathy for women’s safety or their emotional well-being more than anything...\n\nGirls reading comments like yours are why women should definitely know a man’s real name, and prove my point even more because you are very triggered by this and any guy who gets this defensive/ aggressive about basic courtesy like knowing something as simple as someone’s name is SCARY. What is someone like this hiding?...(besides lack of wealth of kindness). \n\nIf the constant paranoia of being blackmailed makes you think actual sexual “rape” and sexual assault is less traumatic an option for a woman (or man) in your self-centered scenario, (a truly disgusting comment and comparison) then perhaps, you should not be seeing girls online and risking so much, (if your wife will divorce you for your affairs) and if you won’t be able to afford “food and shelter” after a divorce” (sounds like *great SD* material, btw with such limited funds).\n\nI’m going to have to block you because my focus is on assisting girls...not wasting time teaching “men” to be a reasonable respectful and kind gentleman. That was your parent’s job.",
                    "author": "sugarbooger1988",
                    "id": "g78lxmg",
                    "parent_id": "t1_g77236d",
                    "score": 3,
                    "created_utc": 1601513784.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "**”Your feeling of comfort and safety doesn’t trump my need for safety.”**\n\nYes—we know—your many disgusting comments have shown us time and time again that you have no empathy or care for a woman’s safety and you are only focused on yourself and your needs, first and foremost—we get it internet stranger. Your posts speak VERY loud and clear as to what kind of character you have (lack thereof) along with lack of empathy for women’s safety or their emotional well-being more than anything...\n\nGirls reading comments like yours are why women should definitely know a man’s real name, and prove my point even more because you are very triggered by this and any guy who gets this defensive/ aggressive about basic courtesy like knowing something as simple as someone’s name is SCARY. What is someone like this hiding?...(besides lack of wealth of kindness). \n\nIf the constant paranoia of being blackmailed makes you think actual sexual “rape” and sexual assault is less traumatic an option for a woman (or man) in your self-centered scenario, (a truly disgusting comment and comparison) then perhaps, you should not be seeing girls online and risking so much, (if your wife will divorce you for your affairs) and if you won’t be able to afford “food and shelter” after a divorce” (sounds like *great SD* material, btw with such limited funds).\n\nI’m going to have to block you because my focus is on assisting girls...not wasting time teaching “men” to be a reasonable respectful and kind gentleman. That was your parent’s job.",
            "author": "sugarbooger1988",
            "id": "g78lxmg",
            "parent_id": "t1_g77236d",
            "score": 3,
            "created_utc": 1601513784.0,
            "replies": []
        }
    ]
}