{
    "title": "Completely shook...",
    "post_id": "hsattw",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hsattw/completely_shook/",
    "author": "First_Baby",
    "body": "To keep a long story short.....I met a SD that seemed very sweet. We got along well and decided that we should get a room. The night was fantastic, he treated me well and I was completely comfortable. I should mention that I was very clear about using condoms, we talked about this when we were discussing our arrangement. He never brought any. When it came down to it I told him that I wouldn't be doing anything without one and he could go to the store if he needed to. Somehow he magically produced one from his wallet, but only the one. We got into it and I found out that he had taken the condom off during sex when I felt his load coming out of me. I was absolutely stunned. I didn't lose my shit outwardly, but I told him very firmly that this was absolutely not okay. He played stupid... I asked for money for a plan B and left.\n\n**Edit for update:**  \nI made an appointment with my doctor to be examined. I've asked about PrEP. Fortunately, I'm already seeing a psychologist so I plan to bring it up at the next appointment. Stealthing is not a crime where I am. I spoke to an attorney who said I could definitely implicate myself in a crime if I report it. All of your kind words are much appreciated. This kind of thing isn't something I talk to my friends and family about and I felt like there was no outlet for my frustration until I remembered SLF. ",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hsattw/completely_shook/",
    "score": 148,
    "upvote_ratio": 0.99,
    "created_utc": 1594910524.0,
    "num_comments": 116,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "This is called stealthing and there are political leaders currently trying to have it classified as rape or sexual assault.\n\nI am so sorry you went through this.",
            "author": "kaitlynnkidd",
            "id": "fy9a1gs",
            "parent_id": "t3_hsattw",
            "score": 127,
            "created_utc": 1594910997.0,
            "replies": [
                {
                    "body": "I had a friend tell me that too. It didn't feel like an assault, but I definitely feel violated.",
                    "author": "First_Baby",
                    "id": "fy9aom9",
                    "parent_id": "t1_fy9a1gs",
                    "score": 36,
                    "created_utc": 1594911324.0,
                    "replies": [
                        {
                            "body": "It was an assault, and completely intentional - your story of how they agreed to the condom, then pretended they did not have one, then magically found one after being told nothing will happen without it makes it crystal clear this was no accident.\n\nDo not ever see this lowlife scum again, and if stealthing is a crime in your jurisdiction, I would consider filing a police report... but that is a decision for you and you alone.",
                            "author": "GDarn",
                            "id": "fy9dpm1",
                            "parent_id": "t1_fy9aom9",
                            "score": 46,
                            "created_utc": 1594912867.0,
                            "replies": [
                                {
                                    "body": "Would I get in trouble? I know sugaring isn't illegal, but some people don't see it that way.",
                                    "author": "First_Baby",
                                    "id": "fy9n9iz",
                                    "parent_id": "t1_fy9dpm1",
                                    "score": 6,
                                    "created_utc": 1594917520.0,
                                    "replies": [
                                        {
                                            "body": "I cannot answer this question since it is not only jurisdiction specific, but it also depends on a lot of other facts that should not be asked for or disclosed online.\n\nIf you would like to report this assault but are concerned about getting in legal trouble yourself, I would talk to a local attorney so you can get useful legal advice.\n\nMany of them offer short free consultations, or you could find a legal services clinic that offers free legal services.\n\nDo not file a police report without getting a legal opinion first - you do not want to self incriminate.",
                                            "author": "GDarn",
                                            "id": "fy9nqi1",
                                            "parent_id": "t1_fy9n9iz",
                                            "score": 14,
                                            "created_utc": 1594917745.0,
                                            "replies": [
                                                {
                                                    "body": "Of course. I know just who to call. Thank you.",
                                                    "author": "First_Baby",
                                                    "id": "fy9rkvs",
                                                    "parent_id": "t1_fy9nqi1",
                                                    "score": 6,
                                                    "created_utc": 1594919587.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I’m so sorry this happened to you. \n\nI had the exact same thing happened to me. Unfortunately it is rape. \nI suggest aside from the plan B, get a full panel of blood and urine exams done to test for STIs.",
                            "author": "wndrlnds",
                            "id": "fy9crc2",
                            "parent_id": "t1_fy9aom9",
                            "score": 24,
                            "created_utc": 1594912391.0,
                            "replies": [
                                {
                                    "body": "Oh my goodness. I'm sorry that happened to you too. I hope you're okay. I know the physical part must have been rough, but the mental is really taxing.",
                                    "author": "First_Baby",
                                    "id": "fy9ndhx",
                                    "parent_id": "t1_fy9crc2",
                                    "score": 5,
                                    "created_utc": 1594917573.0,
                                    "replies": [
                                        {
                                            "body": "It’s a really terrible experience. You’re vulnerable and try to trust someone you practically don’t know. And they fully take advantage of you. It’s fucking horrible.",
                                            "author": "wndrlnds",
                                            "id": "fy9tzmk",
                                            "parent_id": "t1_fy9ndhx",
                                            "score": 10,
                                            "created_utc": 1594920716.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This is why sex work should be legalized.  Even if political leaders accomplish getting this classified as rape or sexual assault. OP would still be worried about prostitution charges if she reported it to police.\n\nIt's akin to someone having some of their weed stolen in a state without legalization, what are they going to do, call the police about half their weed being stolen?",
                    "author": "MoreCowbellNeeded",
                    "id": "fy9m82c",
                    "parent_id": "t1_fy9a1gs",
                    "score": 19,
                    "created_utc": 1594917019.0,
                    "replies": [
                        {
                            "body": "You're totally right and I completely agree with you that sex work should be legal. \n\nOur government has always been behind the times so hopefully they'll make stealthing punishable and work towards other laws to protect those in and out of sex work.",
                            "author": "kaitlynnkidd",
                            "id": "fy9mgf9",
                            "parent_id": "t1_fy9m82c",
                            "score": 6,
                            "created_utc": 1594917129.0,
                            "replies": []
                        },
                        {
                            "body": "Someone mentioned I should go to the police and I was worried about that exact thing. I agree it should be legalized.",
                            "author": "First_Baby",
                            "id": "fy9nh7r",
                            "parent_id": "t1_fy9m82c",
                            "score": 7,
                            "created_utc": 1594917622.0,
                            "replies": [
                                {
                                    "body": "I'd also lean towards going to police, there are just so many factors that others far more informed than my self would be able to assist you with, and this is time sensitive.  Rape kit's should be administered as soon as possible to collect evidence. \n\nPossibly a call to a domestic abuse lawyer in your area, or a call to a national sexual assault hotline like [RAINN](https://www.rainn.org/about-national-sexual-assault-telephone-hotline)",
                                    "author": "MoreCowbellNeeded",
                                    "id": "fy9sgua",
                                    "parent_id": "t1_fy9nh7r",
                                    "score": 2,
                                    "created_utc": 1594920006.0,
                                    "replies": [
                                        {
                                            "body": "I've talked to my doctor and I have an appointment lined up. Unfortunately, I can't go to the police in my area.",
                                            "author": "First_Baby",
                                            "id": "fy9zo65",
                                            "parent_id": "t1_fy9sgua",
                                            "score": 3,
                                            "created_utc": 1594923442.0,
                                            "replies": [
                                                {
                                                    "body": "Good because you should NOT get a rape kit at the police station anyways. They mess it up most of the time and also barely actually complete it, there are thousands of rape kits that have gone untested this way. ALWAYS go to the hospital ASAP for a rape kit (dont shower or wash your clothes). This is valuable information for everyone to know so I figured i would respond here for those that may need to know this info later",
                                                    "author": "bstractig",
                                                    "id": "fyaf56u",
                                                    "parent_id": "t1_fy9zo65",
                                                    "score": 4,
                                                    "created_utc": 1594930950.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This happened to me, but not in a sugar situation. I was lucky to make it out without any STDs. I understand how painful this is. I am so sorry this happened to you. Where I lived (I can DM you if interested) my friend who works in victim services said that it was sexual assault and I could press charges but unfortunately it was a one night stand.",
                    "author": "Jcheerw",
                    "id": "fybabru",
                    "parent_id": "t1_fy9a1gs",
                    "score": 2,
                    "created_utc": 1594947488.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is completely unethical but I would teach him a lesson. If it were me, I would tell him I went and got tested and have an STD and he'd better get tested. (I know you don't) That would make him think twice about pulling that shtick on someone else.",
            "author": "tgibook",
            "id": "fy9ld2g",
            "parent_id": "t3_hsattw",
            "score": 17,
            "created_utc": 1594916606.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fy9px7k",
                    "parent_id": "t1_fy9ld2g",
                    "score": 23,
                    "created_utc": 1594918790.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fya7nld",
                            "parent_id": "t1_fy9px7k",
                            "score": 9,
                            "created_utc": 1594927367.0,
                            "replies": []
                        },
                        {
                            "body": "I almost said that but I chickened out. Kudos to you for being bold and brave!",
                            "author": "tgibook",
                            "id": "fy9qb8l",
                            "parent_id": "t1_fy9px7k",
                            "score": 5,
                            "created_utc": 1594918977.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "What's scary is that I don't know if I have an STD or not. I'll be honest though, I'm not usually one to play games and trick people like that... but I'm 100% down for it this time. I'm really scared, and I bet he's just thinking about how good a fuck I was...",
                    "author": "First_Baby",
                    "id": "fy9qfgp",
                    "parent_id": "t1_fy9ld2g",
                    "score": 8,
                    "created_utc": 1594919034.0,
                    "replies": [
                        {
                            "body": "I'm so sorry you are going through this! You're not alone. We are all here with you. You were assaulted, plain and simple. Do you have insurance? If not go to planned parenthood. They charge on a sliding scale. You should also make him pay for you needing to be tested. If you need positive test results, believe it or not there are loads in Google images. DM me if you need to vent or anything and please keep us informed!",
                            "author": "tgibook",
                            "id": "fy9sd0u",
                            "parent_id": "t1_fy9qfgp",
                            "score": 3,
                            "created_utc": 1594919956.0,
                            "replies": [
                                {
                                    "body": "I do. I'm going to be examined by my doctor soon. Thank you for the support. I will absolutely keep that in mind if I need to talk to someone.",
                                    "author": "First_Baby",
                                    "id": "fy9zsvv",
                                    "parent_id": "t1_fy9sd0u",
                                    "score": 2,
                                    "created_utc": 1594923504.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The \"Accidental Creampie\" fantasy is being played out a lot these days in porn, and I believe a lot of guys are into it. The female actresses are incredibly fake when they complain, but since it's all an act, the producers don't really care about the effect. Obviously, the fetish is having a negative impact in a world outside of porn, and you have been a victim of this. It's a violation of women's rights, plain and simple.",
            "author": "KnightAnthony",
            "id": "fy9h0k7",
            "parent_id": "t3_hsattw",
            "score": 17,
            "created_utc": 1594914496.0,
            "replies": []
        },
        {
            "body": "That's horrifying and sorry this happened to you.  This POS needs to be taught that this is not right and is assault since you did not consent to unprotected sex.  I don't want to scare you but get tested as well.  Stuff like this pisses me off and karma is a bitch for assholes like him.  Hope you are doing okay.",
            "author": "EMPOWER_not_enable",
            "id": "fy9b33x",
            "parent_id": "t3_hsattw",
            "score": 26,
            "created_utc": 1594911529.0,
            "replies": [
                {
                    "body": "I called my doctor this morning and took a plan B last night. My understanding of assault has definitely shifted.",
                    "author": "First_Baby",
                    "id": "fy9blva",
                    "parent_id": "t1_fy9b33x",
                    "score": 17,
                    "created_utc": 1594911799.0,
                    "replies": []
                },
                {
                    "body": "This^",
                    "author": "SunnyWinter85",
                    "id": "fy9bmw9",
                    "parent_id": "t1_fy9b33x",
                    "score": 5,
                    "created_utc": 1594911815.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am so so sorry this happened to you. He's a monster and a predator and of course played dumb. Depending on where you are, this can be classified as sexual assault and prosecuted, at the very least he should know that as it is a serious violation of health and safety.\n\n(when guys are shitty about not wanting to use condoms, I tend to go the extreme route and say \"well, we don't know for sure if I have HIV or not..\", tends to shut them up.)\n\nEdit to echo everyone here and say that you did absolutely nothing wrong.",
            "author": "scorpiorider116",
            "id": "fy9i3tq",
            "parent_id": "t3_hsattw",
            "score": 11,
            "created_utc": 1594915024.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fy9edcy",
            "parent_id": "t3_hsattw",
            "score": 8,
            "created_utc": 1594913196.0,
            "replies": [
                {
                    "body": "Absolutely. I'm learning that the men who prey on SA and SBs are incredibly manipulative.   The common line though is that I ignored red flags that would have protected me. I'm still learning what not to do. I've been in this forum for a long time doing as much research as possible, but I guess there isnt anything that can teach you like real-life experience can.",
                    "author": "First_Baby",
                    "id": "fy9p7ac",
                    "parent_id": "t1_fy9edcy",
                    "score": 5,
                    "created_utc": 1594918450.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fyb0jo5",
                            "parent_id": "t1_fy9p7ac",
                            "score": 4,
                            "created_utc": 1594941856.0,
                            "replies": [
                                {
                                    "body": "What is this blacklist people keep mentioning?",
                                    "author": "First_Baby",
                                    "id": "fyp943i",
                                    "parent_id": "t1_fyb0jo5",
                                    "score": 1,
                                    "created_utc": 1595280768.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's probably not the answer you're looking for, but if condoms are important, take condoms.  You can order the ones you like online and they arrive in a plain brown box.  Yes, the guy should be responsible enough to plan ahead.  Don't let his stupidity break the deal.  Stealthing?  Tell him you were trying to protect him, your herpes is acting up.  He might want to get checked.",
            "author": "hal99514",
            "id": "fy9dktu",
            "parent_id": "t3_hsattw",
            "score": 21,
            "created_utc": 1594912801.0,
            "replies": [
                {
                    "body": "That is 100% true. I let my guard down because I had hope that he would stick to our arrangement which included using condoms.  These are all lessons I'm learning the hard way. I've had nothing but \"learnable\" experiences in the sugar dating world.",
                    "author": "First_Baby",
                    "id": "fy9o29p",
                    "parent_id": "t1_fy9dktu",
                    "score": 4,
                    "created_utc": 1594917903.0,
                    "replies": [
                        {
                            "body": "As you read through all of these comments, remember that EVERYONE has an agenda.  You have to pick through everything and figure out what's true, what's not and how it applies to you.",
                            "author": "hal99514",
                            "id": "fy9ozog",
                            "parent_id": "t1_fy9o29p",
                            "score": 7,
                            "created_utc": 1594918348.0,
                            "replies": [
                                {
                                    "body": "I agree. I take everything accordingly.",
                                    "author": "First_Baby",
                                    "id": "fy9rhmg",
                                    "parent_id": "t1_fy9ozog",
                                    "score": 3,
                                    "created_utc": 1594919543.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Make sure to talk to your doctor about taking a pill that helps reduce your chances of getting Aids/HIV too. This RAPIST could have a rainbow of stds in his system. It was assault and it was rape, whether it felt like an attack or not. I’m sorry this happened to you.",
            "author": "TopNotchDude",
            "id": "fy9iys4",
            "parent_id": "t3_hsattw",
            "score": 13,
            "created_utc": 1594915444.0,
            "replies": [
                {
                    "body": "I'll talk to my doctor about that. Thank you!",
                    "author": "First_Baby",
                    "id": "fy9pfwj",
                    "parent_id": "t1_fy9iys4",
                    "score": 2,
                    "created_utc": 1594918563.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm truly sorry this happened to you. Totally unacceptable and borders on rape imo. \n\nThat being said, him saying that he didn't bring a condom & then suddenly producing one when you tell him \"no go\" tells you that he's a complete lying piece of shit and not someone you shouldn't be in an arrangement with. You should have walked then. My only other advice is that if you're going to be intimate with someone, then switch positions now and then. When doing so, make sure his condom is still on. If not, then get up and leave immediately Pretty sad you have to do this, but there are wolves in sheep's clothing out there \n\nYou did nothing wrong here other than being naive & trusting. We've all made this mistake in the bowl at some point. Best of luck to you.",
            "author": "chippyboy11254",
            "id": "fy9cfv8",
            "parent_id": "t3_hsattw",
            "score": 9,
            "created_utc": 1594912229.0,
            "replies": [
                {
                    "body": "This is a really good tip. I'm considering this to be strike 2 for my sugar dating experiences, strike 3 and I'm out. What's crazy is that of all the years I spent vanilla dating, I've never had issues like I do in this arena. Its like I'm a minnow in a barrel of mostly sharks.",
                    "author": "First_Baby",
                    "id": "fy9ohcq",
                    "parent_id": "t1_fy9cfv8",
                    "score": 6,
                    "created_utc": 1594918106.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I asked for money for a plan B \n\nAnd hopefully your allowance as well.\n\nDon't let the door hit him in the ass on his way out of your life.",
            "author": "GSSD",
            "id": "fy9e1s9",
            "parent_id": "t3_hsattw",
            "score": 8,
            "created_utc": 1594913036.0,
            "replies": [
                {
                    "body": "He had put my allowance in my purse beforehand so I was good for that, thank goodness. Idk if I would have had the spine enough to bring it up.",
                    "author": "First_Baby",
                    "id": "fy9noqn",
                    "parent_id": "t1_fy9e1s9",
                    "score": 3,
                    "created_utc": 1594917722.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "WHAT. AN. ASSHOLE.",
            "author": "BGDDDY1",
            "id": "fy99pjl",
            "parent_id": "t3_hsattw",
            "score": 9,
            "created_utc": 1594910826.0,
            "replies": []
        },
        {
            "body": "Holy shit! I just want to say I’m so damn sorry that happened to you.",
            "author": "Givemeknowledge2323",
            "id": "fy99dk7",
            "parent_id": "t3_hsattw",
            "score": 7,
            "created_utc": 1594910653.0,
            "replies": []
        },
        {
            "body": "What a piece of shit. I’m so sorry this happened to you!!",
            "author": "pumpkinspicedcream",
            "id": "fy9cktm",
            "parent_id": "t3_hsattw",
            "score": 6,
            "created_utc": 1594912299.0,
            "replies": []
        },
        {
            "body": "Jesus, so sorry this happened. Thankfully you were able to get a Plan B (Although I realize that isn't ideal and wrecks havoc on your body). \n\nWhat he didn't isn't ok.",
            "author": "mraspencer",
            "id": "fy9drfh",
            "parent_id": "t3_hsattw",
            "score": 3,
            "created_utc": 1594912891.0,
            "replies": [
                {
                    "body": "That's the part that kills me. When I asked for the money for a plan B he said, \"well you're on birth control, right\"? Like I was just going to have to accept that. On top of it, I'm really sensitive to PH changes. I'm going to get a yeast infection and have a messed up cycle, hopefully thats all he left me with...",
                    "author": "First_Baby",
                    "id": "fy9ougv",
                    "parent_id": "t1_fy9drfh",
                    "score": 4,
                    "created_utc": 1594918278.0,
                    "replies": [
                        {
                            "body": "Ugh, that's terrible! Hopefully all the side effects will be minor.",
                            "author": "mraspencer",
                            "id": "fy9p2u2",
                            "parent_id": "t1_fy9ougv",
                            "score": 3,
                            "created_utc": 1594918391.0,
                            "replies": [
                                {
                                    "body": "I can only pray at this point.",
                                    "author": "First_Baby",
                                    "id": "fy9rev5",
                                    "parent_id": "t1_fy9p2u2",
                                    "score": 2,
                                    "created_utc": 1594919506.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve already seen a couple people comment this, but 100% get tested. I had this happen to a close friend of mine, the guy gave her something because he was with several other girls and sneaking around about it. I’m sorry you had expectations and rules and they were broken :(",
            "author": null,
            "id": "fy9fj53",
            "parent_id": "t3_hsattw",
            "score": 3,
            "created_utc": 1594913766.0,
            "replies": [
                {
                    "body": "I plan on it. I asked him and he said he doesn't have anything, but of course, he's a liar.",
                    "author": "First_Baby",
                    "id": "fy9pbba",
                    "parent_id": "t1_fy9fj53",
                    "score": 5,
                    "created_utc": 1594918503.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is so horrific I'm truly sorry, please take some time out for yourself and understand it wasn't your fault. I'm all about revenge so I would 100% tell him you're pregnant and you caught something. Let that cretin SWEAT",
            "author": "BisforBands",
            "id": "fy9u9xg",
            "parent_id": "t3_hsattw",
            "score": 3,
            "created_utc": 1594920851.0,
            "replies": []
        },
        {
            "body": "Absolutely unacceptable. What a waste of human breath in his case.",
            "author": "SDInLeather",
            "id": "fyacutd",
            "parent_id": "t3_hsattw",
            "score": 3,
            "created_utc": 1594929871.0,
            "replies": []
        },
        {
            "body": "It's absolutely not ok and you absolutely were taken advantage of by someone who basically attacked you without consent.\n\nThe law is a mess here and this is not a crime in most places. Before you even think about a report, find out.... don't report if it isn't a crime because -- as you noted -- they will make this about you and not him. It's despicable, by why add the police to your trauma if law enforcement isn't going to help.\n\nSadly, my reading of the state of the law is this a crime almost nowhere on earth   \n([https://en.wikipedia.org/wiki/Non-consensual\\_condom\\_removal#:\\~:text=Non%2Dconsensual%20condom%20removal%2C%20or,a%20form%20of%20reproductive%20coercion.](https://en.wikipedia.org/wiki/Non-consensual_condom_removal#:~:text=Non%2Dconsensual%20condom%20removal%2C%20or,a%20form%20of%20reproductive%20coercion.))  \n\n\nThere is a national sex assault hotline that can recommend best practices as to what to do here. I will say something to reassure you a bit that will be disliked by many here: **The odds are this isn't some disease-ridden psychopath.** The odds are he's just a manipulative douchebag. There are places (and not a few) where knowingly giving someone HIV is a crime for example. And most men who are sugaring -- even as pigs like this one -- will know their status.   \n\n\nThe odds of someone have multiple STDs are low because their tend to be visible symptoms and tons of discomfort with them. I mean of course you should get tested (thought not immediately as there are incubation periods on most everything) but I'm cautiously optimistic that you caught nothing here.\n\nThe time to process and deal with this will vary from person to person and I suggest seeking any counseling resources you feel you need.\n\nYou have our support!",
            "author": "marker3000",
            "id": "fy9tmnu",
            "parent_id": "t3_hsattw",
            "score": 7,
            "created_utc": 1594920548.0,
            "replies": [
                {
                    "body": "Thank you for the info. I called an attorney in my city and found out that this was not a crime and I could have caught charges myself if I had reported it. Fortunately, I'm already in therapy from another assault. My therapist actually told me that I would be prone to attract predators, but I struggled to make the connection. I don't see how... but I do..",
                    "author": "First_Baby",
                    "id": "fy9zjf3",
                    "parent_id": "t1_fy9tmnu",
                    "score": 6,
                    "created_utc": 1594923378.0,
                    "replies": [
                        {
                            "body": "Well, I'm sure your therapist is better equipped to explain this than I am but: **Do not blame yourself for the actions of those predators**. \n\nThat you're \"prone to attract\" them isn't some character flaw or something you are responsible for, no matter what happens to you. I think the \"trick\" here is to get to know yourself better, understand what's inside you that makes you tick, deal with past trauma, and figure out how to move forward with your guard up, but also the vulnerability necessary to have *any kind* of decent human relationships.\n\nBest to you! Reach out if you need someone to talk to!",
                            "author": "marker3000",
                            "id": "fya1tn4",
                            "parent_id": "t1_fy9zjf3",
                            "score": 6,
                            "created_utc": 1594924469.0,
                            "replies": [
                                {
                                    "body": "I agree with this advice heavily. I think it’s spot on and portrays a very realistic outcome. \nThe “prone to attract” thing doesn’t sound like your therapist presented that correctly. I’ve been in therapy a long time and I am very aware of when I am vulnerable and can’t always do much about it other than work harder at putting up boundaries, not that that would prevent this man from doing that to you. @marker3000 is right- not a character flaw just something to be aware of as it is simply fact that women who have been raped/assaulted are MUCH more likely to be subjected to abuse again. I’d say You are on the right track to healing and protecting yourself mentally and physically. Do whatever you need to do but be smart and fuck the police. Until you talk to a few lawyers, get a rape kit (someone said wait but that is definitely wrong as you have to do it within 72 hours), take a full panel STD test, see your psychologist and doctor. \nEdit: I meant do all that before going to the police but then I remembered that the police have to order the rape kit.",
                                    "author": null,
                                    "id": "fyadsuf",
                                    "parent_id": "t1_fya1tn4",
                                    "score": 3,
                                    "created_utc": 1594930313.0,
                                    "replies": [
                                        {
                                            "body": "It is 100% this guys fault.\n\nAt the same time, there are a lot of micro-interactions and signals that bad people and predators give off that are often missed by people with trauma history, and it’s good to recognize this.",
                                            "author": "garret6758",
                                            "id": "fyaeo47",
                                            "parent_id": "t1_fyadsuf",
                                            "score": 3,
                                            "created_utc": 1594930721.0,
                                            "replies": [
                                                {
                                                    "body": "Yes very true! Well put. You get used to it and become color blind. Trauma that isn’t healed or dealt with in a healthy manner- it internalizes and comes out in a disguise.",
                                                    "author": null,
                                                    "id": "fyaix98",
                                                    "parent_id": "t1_fyaeo47",
                                                    "score": 3,
                                                    "created_utc": 1594932739.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "> Until you talk to a few lawyers, get a rape kit (someone said wait but that is definitely wrong as you have to do it within 72 hours), take a full panel STD test, see your psychologist and doctor. Edit: I meant do all that before going to the police but then I remembered that the police have to order the rape kit.  \n\n\nI 100% agree if she was assaulted she should get a rape kit.\n\nIn this case, though, getting an immediate STD test is mostly pointless. Nothing incubates fast enough to show up that fast. \n\nWhat I was advocating on \"waiting\" for was the STD test.",
                                            "author": "marker3000",
                                            "id": "fyaxin5",
                                            "parent_id": "t1_fyadsuf",
                                            "score": 1,
                                            "created_utc": 1594940188.0,
                                            "replies": [
                                                {
                                                    "body": "oh ok my bad glad you saw this and corrected me.",
                                                    "author": null,
                                                    "id": "fyb12u5",
                                                    "parent_id": "t1_fyaxin5",
                                                    "score": 3,
                                                    "created_utc": 1594942149.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "***the odds are he is a RAPIST",
                    "author": "bstractig",
                    "id": "fyafhxj",
                    "parent_id": "t1_fy9tmnu",
                    "score": 1,
                    "created_utc": 1594931120.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OMG! I’m so so soooooo sorry that happened to you!! UUGGG....makes me so mad. If you need an ear to bend, feel free to DM me!\nHang in there❤️",
            "author": "SunnyWinter85",
            "id": "fy99r3m",
            "parent_id": "t3_hsattw",
            "score": 5,
            "created_utc": 1594910848.0,
            "replies": [
                {
                    "body": "Thank you. I will absolutely be taking you up on that.",
                    "author": "First_Baby",
                    "id": "fy9afxk",
                    "parent_id": "t1_fy99r3m",
                    "score": 3,
                    "created_utc": 1594911201.0,
                    "replies": [
                        {
                            "body": "By all means!!",
                            "author": "SunnyWinter85",
                            "id": "fy9akrz",
                            "parent_id": "t1_fy9afxk",
                            "score": 3,
                            "created_utc": 1594911270.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "omg so sorry you had to go through that. i’ve experienced stealthing before so i know how scary that can be... if i were you i would definitely find a new SD.",
            "author": "lilpoundcake_420",
            "id": "fy9c9t4",
            "parent_id": "t3_hsattw",
            "score": 5,
            "created_utc": 1594912143.0,
            "replies": [
                {
                    "body": "The track record for SA is 2-0, I was taken advantage of both men that I've met with from the site. At this point, I'm ready to write it off as a haven for predators. Someone sent me a message about trying different methods to find SDs, I think the only way I could proceed is if it's not through SA.",
                    "author": "First_Baby",
                    "id": "fyaqiq8",
                    "parent_id": "t1_fy9c9t4",
                    "score": 5,
                    "created_utc": 1594936457.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is seriously messed up. This guy needs to get reported",
            "author": "Rich_Wishbone",
            "id": "fy9hvzt",
            "parent_id": "t3_hsattw",
            "score": 6,
            "created_utc": 1594914919.0,
            "replies": []
        },
        {
            "body": "I'm so sorry this happened to you. Can you report him on whatever platform you used to meet? I'd hate to think he'll have the opportunity to inflict himself on new vicitms.",
            "author": "Brashtard",
            "id": "fy9fg3g",
            "parent_id": "t3_hsattw",
            "score": 3,
            "created_utc": 1594913724.0,
            "replies": [
                {
                    "body": "It was SA, is that possible?",
                    "author": "First_Baby",
                    "id": "fy9o44u",
                    "parent_id": "t1_fy9fg3g",
                    "score": 5,
                    "created_utc": 1594917928.0,
                    "replies": [
                        {
                            "body": "Yes, I'm pretty sure there is a place on his profile that will allow you register a complaint. Even in the event that he has already blocked you, you could still contact SA's customer support and register a complaint. Actually, if you are so inclined, you can still file criminal charges and the police will investigate his identity. \n\nIf this should happen to you again or someone else reading - heaven forfend - you can treat it as a rape in which case you would want to go to the police straight away and have them take semen samples as physical evidence.",
                            "author": "Brashtard",
                            "id": "fya8s1n",
                            "parent_id": "t1_fy9o44u",
                            "score": 2,
                            "created_utc": 1594927912.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Shockingly bad behaviour.",
            "author": "bradpitt3",
            "id": "fy9mv37",
            "parent_id": "t3_hsattw",
            "score": 2,
            "created_utc": 1594917325.0,
            "replies": []
        },
        {
            "body": "That’s sexual assault technically and you could press charges.",
            "author": "lasswithaleash",
            "id": "fy9ncod",
            "parent_id": "t3_hsattw",
            "score": 2,
            "created_utc": 1594917562.0,
            "replies": []
        },
        {
            "body": "Omg love I’m so sorry. What a scum bag.",
            "author": "hellokittyho",
            "id": "fy9otq7",
            "parent_id": "t3_hsattw",
            "score": 2,
            "created_utc": 1594918269.0,
            "replies": []
        },
        {
            "body": "That is terrible and unforgivable. Period!",
            "author": "justaguyhereyeah",
            "id": "fy9qan6",
            "parent_id": "t3_hsattw",
            "score": 2,
            "created_utc": 1594918969.0,
            "replies": []
        },
        {
            "body": "Dump him.  I can't believe the shit men do.  What an asshole.  Maybe check with law enforcement to see if this kind of behavior is sexual assault/rape in your area.",
            "author": "Daddyg2019",
            "id": "fy9uxkf",
            "parent_id": "t3_hsattw",
            "score": 2,
            "created_utc": 1594921161.0,
            "replies": []
        },
        {
            "body": "This is sad because he put you at risk of std but also taking plan b has so much negative affect, plan b throws your hormone balance off and can eventually cause thyroid issue and much more.",
            "author": "Mcapricorn",
            "id": "fya4e7k",
            "parent_id": "t3_hsattw",
            "score": 2,
            "created_utc": 1594925690.0,
            "replies": []
        },
        {
            "body": "Damn people are such dicks!! No pun intended. Something like that would never even have crossed my mind to do.",
            "author": "Jdn345",
            "id": "fya8ri0",
            "parent_id": "t3_hsattw",
            "score": 2,
            "created_utc": 1594927904.0,
            "replies": []
        },
        {
            "body": "I would listen to your attorney.",
            "author": "SebastianArnault",
            "id": "fya9nwt",
            "parent_id": "t3_hsattw",
            "score": 2,
            "created_utc": 1594928346.0,
            "replies": [
                {
                    "body": "I would talk to 5 more attorneys.",
                    "author": "babylina",
                    "id": "fybjyla",
                    "parent_id": "t1_fya9nwt",
                    "score": 3,
                    "created_utc": 1594953324.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wonder why guys have the desire to do this.",
            "author": "mrjimmyjsz",
            "id": "fyb1196",
            "parent_id": "t3_hsattw",
            "score": 2,
            "created_utc": 1594942125.0,
            "replies": [
                {
                    "body": "See post by KnightAnthony - \"stealthing\" or \"accidental (on purpose) cream pie\" fantasy has become popular in porn. So we can call the guys who do this Demon Sheep. Demon because it's evil, Sheep because the fantasy they're acting out isn't even their original idea, but something they picked up from the media.\n\n(BTW if you look up Demon Sheep you'll find something completely different, so don't look it up unless you want to be distracted.)",
                    "author": "highfructoseSD",
                    "id": "fybuymp",
                    "parent_id": "t1_fyb1196",
                    "score": 1,
                    "created_utc": 1594960607.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "All I can do is send hugs and healing vibes girl. I’m so very sorry you are going through this",
            "author": "Layla_Fox2",
            "id": "fyb5g69",
            "parent_id": "t3_hsattw",
            "score": 2,
            "created_utc": 1594944610.0,
            "replies": []
        },
        {
            "body": "Absolute scum.  Sorry that happened to you.  He ruined a good thing by being a jerk.",
            "author": null,
            "id": "fybdwrr",
            "parent_id": "t3_hsattw",
            "score": 2,
            "created_utc": 1594949638.0,
            "replies": []
        },
        {
            "body": "You need to wait 2-6 weeks to get tested because STDs can take time to show up. I hope everything turns out ok.",
            "author": "Royal-Progress",
            "id": "fybehcm",
            "parent_id": "t3_hsattw",
            "score": 2,
            "created_utc": 1594949980.0,
            "replies": []
        },
        {
            "body": "First off: like many have assured, this is rape and disgusting and I’m so very sorry you had such an experience. I had an assault under similar circumstances and it’s hard to know how to react in the moment bc it’s hard to process when there wasn’t any force or struggle \n\nAlso... why would either of you mention there was any money involved in any capacity? I’m pretty ignorant on legality stuff (I never ended up reporting mine as at the time I figured since everything else was consensual and he was a father it wouldn’t be worth it- wrong). But I don’t see how you would get a prostitution charge especially since it wasn’t prostitution. If you only talked to one lawyer, talk to five more.",
            "author": null,
            "id": "fyac010",
            "parent_id": "t3_hsattw",
            "score": 2,
            "created_utc": 1594929469.0,
            "replies": [
                {
                    "body": "I hear you. I don't feel like I've been raped. Unfortunately, I know what that feels like, but this is different because he wasn't pinning me down or screaming at me. I feel just as violated though.",
                    "author": "First_Baby",
                    "id": "fyaq4q2",
                    "parent_id": "t1_fyac010",
                    "score": 1,
                    "created_utc": 1594936257.0,
                    "replies": [
                        {
                            "body": "You don’t have to struggle for it to be raped. Look at Harvey Weinstein ... he raped countless women and if you watch their testimonies not one of them fought back or screamed or anything but they were all raped. Rape has many forms. I don’t want to put a label on something you went through that you don’t identify with I’m only trying to point out that rape is violence but it doesn’t always look or sound violent. By definition violence is “strength of emotion or an unpleasant or destructive natural force”. So if not rape id say violence but again I’m sorry I don’t want to sound like I’m correcting you on the verbiage of your own experience. I just want you to know what you went through is serious and so unbelievably wrong.",
                            "author": null,
                            "id": "fyas46g",
                            "parent_id": "t1_fyaq4q2",
                            "score": 2,
                            "created_utc": 1594937277.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry this happened to you. Can I ask a question? How many nonsexual dates did you have with him prior to this incident?",
            "author": null,
            "id": "fy9a2f6",
            "parent_id": "t3_hsattw",
            "score": 2,
            "created_utc": 1594911011.0,
            "replies": [
                {
                    "body": "Just one, but we talked on the phone quite a bit.",
                    "author": "First_Baby",
                    "id": "fy9ad0e",
                    "parent_id": "t1_fy9a2f6",
                    "score": 5,
                    "created_utc": 1594911159.0,
                    "replies": [
                        {
                            "body": "Quite a bit = days/hours/weeks?\n\nHow long was your first meeting and what did y’all do?",
                            "author": null,
                            "id": "fy9ama2",
                            "parent_id": "t1_fy9ad0e",
                            "score": 0,
                            "created_utc": 1594911291.0,
                            "replies": [
                                {
                                    "body": "We talked on the phone for about a week. We met at a park the first time and went for a stroll. I never got any bad vibes from him, even after. He played dumb and said the condom slipped off.",
                                    "author": "First_Baby",
                                    "id": "fy9b8wm",
                                    "parent_id": "t1_fy9ama2",
                                    "score": 5,
                                    "created_utc": 1594911611.0,
                                    "replies": [
                                        {
                                            "body": "Interesting. Park first date, then hotel. I’m asking just to learn more about how to spot red flags in advance. \n\nEither way, he sounds like someone who can’t be trusted. You should void your arrangement and leave him alone.",
                                            "author": null,
                                            "id": "fy9bzaz",
                                            "parent_id": "t1_fy9b8wm",
                                            "score": 3,
                                            "created_utc": 1594911992.0,
                                            "replies": [
                                                {
                                                    "body": "It seems  u/first_baby did almost all the right things to vet this guy before the  intimate date.  \n\nWhen he claimed not to have condoms, that was a yellow flag.  When he magically came up with one when she made it clear she wouldn't go without protection that flag turned red.  By that time, she was in a very compromised situation and I'm sure it would have been difficult to walk out at that point.  This guy is a real creep and clearly knew what he was doing.  This is why stealthing should be sexual assault, but would be near impossible to prove in court.",
                                                    "author": "willfromvb",
                                                    "id": "fy9docm",
                                                    "parent_id": "t1_fy9bzaz",
                                                    "score": 19,
                                                    "created_utc": 1594912849.0,
                                                    "replies": [
                                                        {
                                                            "body": "Agreed on all of this.",
                                                            "author": "mraspencer",
                                                            "id": "fy9erje",
                                                            "parent_id": "t1_fy9docm",
                                                            "score": 2,
                                                            "created_utc": 1594913388.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "You're totally right. I hear the, \"oh I don't have a condom excuse all the time\". I figured he was just being a typical guy so it never registered to me as a red flag. The difference is with vanilla dates I would be at home or a place where I could get to some.",
                                                            "author": "First_Baby",
                                                            "id": "fy9prf6",
                                                            "parent_id": "t1_fy9docm",
                                                            "score": 2,
                                                            "created_utc": 1594918714.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Even if you had some on hand, that wouldn't have stopped him from taking it off without you knowing.\n\nThe guy you met is one of the jackasses that ruin sex (and by extension, dating/sugar dating) for everyone.",
                                                                    "author": "sdthrowaway006",
                                                                    "id": "fy9umyw",
                                                                    "parent_id": "t1_fy9prf6",
                                                                    "score": 2,
                                                                    "created_utc": 1594921021.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Great observation!!!",
                                                            "author": "EMPOWER_not_enable",
                                                            "id": "fy9fxdn",
                                                            "parent_id": "t1_fy9docm",
                                                            "score": 1,
                                                            "created_utc": 1594913963.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Agreed.",
                                                            "author": "sdthrowaway006",
                                                            "id": "fy9lkqi",
                                                            "parent_id": "t1_fy9docm",
                                                            "score": 1,
                                                            "created_utc": 1594916707.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Thank you for this post.",
                                                            "author": null,
                                                            "id": "fy9esrn",
                                                            "parent_id": "t1_fy9docm",
                                                            "score": 0,
                                                            "created_utc": 1594913405.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "park first date in the Covid-times isn't a red flag\n\nNeither is intimacy on the first date post-M&G, that's actually rather standard in a PPM arrangement.\n\nDoesn't sound like the guy gave off any red flags at all, until he turned into an asshole during sex.",
                                                    "author": "mraspencer",
                                                    "id": "fy9dn53",
                                                    "parent_id": "t1_fy9bzaz",
                                                    "score": 3,
                                                    "created_utc": 1594912832.0,
                                                    "replies": [
                                                        {
                                                            "body": "What does COVID have anything to do with this? I’m asking for you to think about the logic before answering....😇\n\nAnd how are you able to speak on a standard? I’m asking because if there’s a SA Center of Excellence that has published a report on standards of practice, let me know because I could learn from it.",
                                                            "author": null,
                                                            "id": "fy9e4sr",
                                                            "parent_id": "t1_fy9dn53",
                                                            "score": 0,
                                                            "created_utc": 1594913077.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Sure...M&G's are taking on different forms due to COVID restrictions. And a stroll in a public park is hardly a red flag. \n\nWhat about it IS a red flag to you? I'll ask you the same condescending question to think about the logic before answering.",
                                                                    "author": "mraspencer",
                                                                    "id": "fy9eclk",
                                                                    "parent_id": "t1_fy9e4sr",
                                                                    "score": 4,
                                                                    "created_utc": 1594913185.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Well, first when you threw in COVID restrictions I chuckled because a hotel was involved. So at that point, adherence to COVID restrictions is kinda irrelevant? \n\nSecond, you assumed I was stating her unfortunate situation was deemed a red flag situation. My statement about red flags was associated with the reason why I was asking (what could seem like a lot of questions). \n\nA horrible action caused by her SD and thank goodness she wasn’t a victim of physical harming or anything violent...I was trying to gain more insight to help (me) take precautionary measures by recognizing potential red flags.  \n\nCondescension directed at you, possibly? But I dislike it when people take my statements and misinterpret them before inquiring—it impedes good dialogue.",
                                                                            "author": null,
                                                                            "id": "fy9g4r0",
                                                                            "parent_id": "t1_fy9eclk",
                                                                            "score": -1,
                                                                            "created_utc": 1594914064.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "\"Condescending, possibly. But I dislike it when people take my statements and misinterpret them before inquiring—it impedes good dialogue.\"\n\nAnd you misinterpreted my statement as well.\n\nThe park and hotel are two separate dates, yes? They are independent of each other, or would you rather the M&G be at the hotel itself.\n\nMy mentioning of COVID is because it's hard to find places to sit inside, at least here there are none. Can't dine in anywhere. So where else would you like to conduct a M&G? A park is perfectly valid (and better than some options).",
                                                                                    "author": "mraspencer",
                                                                                    "id": "fy9gk4z",
                                                                                    "parent_id": "t1_fy9g4r0",
                                                                                    "score": 3,
                                                                                    "created_utc": 1594914274.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I think you’re projecting and amplifying a bit when it comes to meeting locations—again...you gotta try not to take positions that come off as your assuming vice inquiring. \n\nNo one said dining was not an option. YOU assumed that since she picked a park as a first meet up it was due to COVID. \n\nI’m all for having a healthy debate (probably not ideal in this very thread—it’s an unfortunate situation) but please for the love of pumpkin pie minimize the assumptions and taking a position based upon projecting....at least if/when you want to recreationally debate with me. 🥴😄 \n\nYours Truly,\nSG",
                                                                                            "author": null,
                                                                                            "id": "fy9i5ep",
                                                                                            "parent_id": "t1_fy9gk4z",
                                                                                            "score": 1,
                                                                                            "created_utc": 1594915046.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "As a dude I'm so sorry this happened to you. He knew exactly what he was doing and kept pushing your boundaries.   \n\n\nAlso most SB I've dated usually had a condom in their purse just in case.   \n\n\nEither way what he did was wrong and should never have happened to you.",
            "author": "TexasSD",
            "id": "fy9h7re",
            "parent_id": "t3_hsattw",
            "score": 2,
            "created_utc": 1594914593.0,
            "replies": []
        },
        {
            "body": "This is horrifying. Kudos to you for not losing it, I certainly wouldn’t have thought twice about going absolutely berserk.",
            "author": "kristalle21",
            "id": "fy9m0bu",
            "parent_id": "t3_hsattw",
            "score": 1,
            "created_utc": 1594916915.0,
            "replies": [
                {
                    "body": "I did! But I'm really small and if the situation escalated I would have been defenseless. He had a good 150 pounds and an entire foot over me.",
                    "author": "First_Baby",
                    "id": "fy9qlqy",
                    "parent_id": "t1_fy9m0bu",
                    "score": 1,
                    "created_utc": 1594919118.0,
                    "replies": [
                        {
                            "body": "I’m so sorry this happened to you :(",
                            "author": "kristalle21",
                            "id": "fy9w1ag",
                            "parent_id": "t1_fy9qlqy",
                            "score": 1,
                            "created_utc": 1594921683.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Disgusting behavior on this slime ball's part. In addition to the measures others have suggested, I'd report him to SA.",
            "author": "roscoe7585",
            "id": "fy9sitr",
            "parent_id": "t3_hsattw",
            "score": 1,
            "created_utc": 1594920032.0,
            "replies": []
        },
        {
            "body": "I am sorry this happened to you. This definitely risks the spread of STD's.",
            "author": "UnearthlyDinosaur",
            "id": "fy9vlts",
            "parent_id": "t3_hsattw",
            "score": 1,
            "created_utc": 1594921479.0,
            "replies": []
        },
        {
            "body": "I'm shocked that this happened. Call me stupid, but usually guys with assets and the sense to go with them wouldn't do this kind of shit. I couldn't imagine doing it myself, and I've been known to develop a sudden allergy to prophylactics. :D But I'd never stealth someone, that's damn low.\n\nThe guy's a lying scumbag. He deserves to get beat down in a big way.",
            "author": null,
            "id": "fyaspj7",
            "parent_id": "t3_hsattw",
            "score": 1,
            "created_utc": 1594937590.0,
            "replies": []
        },
        {
            "body": "that's pretty lame.  I wouldn't see that guy again unless we cut a lucrative deal.",
            "author": "worldtravel602",
            "id": "fya1gkp",
            "parent_id": "t3_hsattw",
            "score": 1,
            "created_utc": 1594924297.0,
            "replies": [
                {
                    "body": "I thought about that. I feel like men like him don't care about what they're doing to women like me, but they do care about their money. I was thinking I could ask for a large amount of money, but I wouldn't want to extort him either.",
                    "author": "First_Baby",
                    "id": "fyaro1w",
                    "parent_id": "t1_fya1gkp",
                    "score": 1,
                    "created_utc": 1594937045.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm really sorry this happened to you, OP.\n\nIf you decide to continue to Sugar, please always have condoms in your purse.",
            "author": "PioneerExperience",
            "id": "fya3nk1",
            "parent_id": "t3_hsattw",
            "score": 1,
            "created_utc": 1594925340.0,
            "replies": [
                {
                    "body": "I will absolutely do that. I'll make the SDs super glue them on as well...",
                    "author": "First_Baby",
                    "id": "fyarqhw",
                    "parent_id": "t1_fya3nk1",
                    "score": 2,
                    "created_utc": 1594937081.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "HEY I WOULD GO TO THE HOSPITAL ASAP (NOT POLICE) TO GET A RAPE KIT, STI TESTING, AND PLAN B. HAVE YOU WASHED THOSE CLOTHES YET? BRING THEM TO THE HOSPITAL IN A BAG (THEYLL PROBABLY TAKE THEM FROM YOU FOR EVIDENCE) IM ASSUMING YOUVE ALREADY SHOWERED BUT PLEASE REFRAIN FROM SHOWERING AGAIN AND GO STRAIGHT TO A HOSPITAL FOR A RAPE KIT. IF YOU DECIDE TO PRESS CHARGES, YOU NEED AS MUCH AMO AS POSSIBLE AND IT WILL HELP YOU TO HAVE A RAPE KIT AND THE CARE THAT THEY WILL GIVE YOU",
            "author": "bstractig",
            "id": "fyaer1a",
            "parent_id": "t3_hsattw",
            "score": 1,
            "created_utc": 1594930760.0,
            "replies": [
                {
                    "body": "I've made an appointment with my doctor so that I can get the testing done, but I don't think the option to press charges is on the table for me because of the laws about assault in my area. If I could do this without getting myself into trouble, I would, but that doesn't seem like an option at the moment. I reported him to SA though.",
                    "author": "First_Baby",
                    "id": "fyarahp",
                    "parent_id": "t1_fyaer1a",
                    "score": 3,
                    "created_utc": 1594936851.0,
                    "replies": [
                        {
                            "body": "Fuck that. Start a revolution. He is disgusting. You weren’t fucking for money, he was giving you gifts for being his companion",
                            "author": "babylina",
                            "id": "fybjuql",
                            "parent_id": "t1_fyarahp",
                            "score": 2,
                            "created_utc": 1594953255.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I had a friend tell me that too. It didn't feel like an assault, but I definitely feel violated.",
            "author": "First_Baby",
            "id": "fy9aom9",
            "parent_id": "t1_fy9a1gs",
            "score": 36,
            "created_utc": 1594911324.0,
            "replies": [
                {
                    "body": "It was an assault, and completely intentional - your story of how they agreed to the condom, then pretended they did not have one, then magically found one after being told nothing will happen without it makes it crystal clear this was no accident.\n\nDo not ever see this lowlife scum again, and if stealthing is a crime in your jurisdiction, I would consider filing a police report... but that is a decision for you and you alone.",
                    "author": "GDarn",
                    "id": "fy9dpm1",
                    "parent_id": "t1_fy9aom9",
                    "score": 46,
                    "created_utc": 1594912867.0,
                    "replies": [
                        {
                            "body": "Would I get in trouble? I know sugaring isn't illegal, but some people don't see it that way.",
                            "author": "First_Baby",
                            "id": "fy9n9iz",
                            "parent_id": "t1_fy9dpm1",
                            "score": 6,
                            "created_utc": 1594917520.0,
                            "replies": [
                                {
                                    "body": "I cannot answer this question since it is not only jurisdiction specific, but it also depends on a lot of other facts that should not be asked for or disclosed online.\n\nIf you would like to report this assault but are concerned about getting in legal trouble yourself, I would talk to a local attorney so you can get useful legal advice.\n\nMany of them offer short free consultations, or you could find a legal services clinic that offers free legal services.\n\nDo not file a police report without getting a legal opinion first - you do not want to self incriminate.",
                                    "author": "GDarn",
                                    "id": "fy9nqi1",
                                    "parent_id": "t1_fy9n9iz",
                                    "score": 14,
                                    "created_utc": 1594917745.0,
                                    "replies": [
                                        {
                                            "body": "Of course. I know just who to call. Thank you.",
                                            "author": "First_Baby",
                                            "id": "fy9rkvs",
                                            "parent_id": "t1_fy9nqi1",
                                            "score": 6,
                                            "created_utc": 1594919587.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’m so sorry this happened to you. \n\nI had the exact same thing happened to me. Unfortunately it is rape. \nI suggest aside from the plan B, get a full panel of blood and urine exams done to test for STIs.",
                    "author": "wndrlnds",
                    "id": "fy9crc2",
                    "parent_id": "t1_fy9aom9",
                    "score": 24,
                    "created_utc": 1594912391.0,
                    "replies": [
                        {
                            "body": "Oh my goodness. I'm sorry that happened to you too. I hope you're okay. I know the physical part must have been rough, but the mental is really taxing.",
                            "author": "First_Baby",
                            "id": "fy9ndhx",
                            "parent_id": "t1_fy9crc2",
                            "score": 5,
                            "created_utc": 1594917573.0,
                            "replies": [
                                {
                                    "body": "It’s a really terrible experience. You’re vulnerable and try to trust someone you practically don’t know. And they fully take advantage of you. It’s fucking horrible.",
                                    "author": "wndrlnds",
                                    "id": "fy9tzmk",
                                    "parent_id": "t1_fy9ndhx",
                                    "score": 10,
                                    "created_utc": 1594920716.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is why sex work should be legalized.  Even if political leaders accomplish getting this classified as rape or sexual assault. OP would still be worried about prostitution charges if she reported it to police.\n\nIt's akin to someone having some of their weed stolen in a state without legalization, what are they going to do, call the police about half their weed being stolen?",
            "author": "MoreCowbellNeeded",
            "id": "fy9m82c",
            "parent_id": "t1_fy9a1gs",
            "score": 19,
            "created_utc": 1594917019.0,
            "replies": [
                {
                    "body": "You're totally right and I completely agree with you that sex work should be legal. \n\nOur government has always been behind the times so hopefully they'll make stealthing punishable and work towards other laws to protect those in and out of sex work.",
                    "author": "kaitlynnkidd",
                    "id": "fy9mgf9",
                    "parent_id": "t1_fy9m82c",
                    "score": 6,
                    "created_utc": 1594917129.0,
                    "replies": []
                },
                {
                    "body": "Someone mentioned I should go to the police and I was worried about that exact thing. I agree it should be legalized.",
                    "author": "First_Baby",
                    "id": "fy9nh7r",
                    "parent_id": "t1_fy9m82c",
                    "score": 7,
                    "created_utc": 1594917622.0,
                    "replies": [
                        {
                            "body": "I'd also lean towards going to police, there are just so many factors that others far more informed than my self would be able to assist you with, and this is time sensitive.  Rape kit's should be administered as soon as possible to collect evidence. \n\nPossibly a call to a domestic abuse lawyer in your area, or a call to a national sexual assault hotline like [RAINN](https://www.rainn.org/about-national-sexual-assault-telephone-hotline)",
                            "author": "MoreCowbellNeeded",
                            "id": "fy9sgua",
                            "parent_id": "t1_fy9nh7r",
                            "score": 2,
                            "created_utc": 1594920006.0,
                            "replies": [
                                {
                                    "body": "I've talked to my doctor and I have an appointment lined up. Unfortunately, I can't go to the police in my area.",
                                    "author": "First_Baby",
                                    "id": "fy9zo65",
                                    "parent_id": "t1_fy9sgua",
                                    "score": 3,
                                    "created_utc": 1594923442.0,
                                    "replies": [
                                        {
                                            "body": "Good because you should NOT get a rape kit at the police station anyways. They mess it up most of the time and also barely actually complete it, there are thousands of rape kits that have gone untested this way. ALWAYS go to the hospital ASAP for a rape kit (dont shower or wash your clothes). This is valuable information for everyone to know so I figured i would respond here for those that may need to know this info later",
                                            "author": "bstractig",
                                            "id": "fyaf56u",
                                            "parent_id": "t1_fy9zo65",
                                            "score": 4,
                                            "created_utc": 1594930950.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This happened to me, but not in a sugar situation. I was lucky to make it out without any STDs. I understand how painful this is. I am so sorry this happened to you. Where I lived (I can DM you if interested) my friend who works in victim services said that it was sexual assault and I could press charges but unfortunately it was a one night stand.",
            "author": "Jcheerw",
            "id": "fybabru",
            "parent_id": "t1_fy9a1gs",
            "score": 2,
            "created_utc": 1594947488.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fy9px7k",
            "parent_id": "t1_fy9ld2g",
            "score": 23,
            "created_utc": 1594918790.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fya7nld",
                    "parent_id": "t1_fy9px7k",
                    "score": 9,
                    "created_utc": 1594927367.0,
                    "replies": []
                },
                {
                    "body": "I almost said that but I chickened out. Kudos to you for being bold and brave!",
                    "author": "tgibook",
                    "id": "fy9qb8l",
                    "parent_id": "t1_fy9px7k",
                    "score": 5,
                    "created_utc": 1594918977.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What's scary is that I don't know if I have an STD or not. I'll be honest though, I'm not usually one to play games and trick people like that... but I'm 100% down for it this time. I'm really scared, and I bet he's just thinking about how good a fuck I was...",
            "author": "First_Baby",
            "id": "fy9qfgp",
            "parent_id": "t1_fy9ld2g",
            "score": 8,
            "created_utc": 1594919034.0,
            "replies": [
                {
                    "body": "I'm so sorry you are going through this! You're not alone. We are all here with you. You were assaulted, plain and simple. Do you have insurance? If not go to planned parenthood. They charge on a sliding scale. You should also make him pay for you needing to be tested. If you need positive test results, believe it or not there are loads in Google images. DM me if you need to vent or anything and please keep us informed!",
                    "author": "tgibook",
                    "id": "fy9sd0u",
                    "parent_id": "t1_fy9qfgp",
                    "score": 3,
                    "created_utc": 1594919956.0,
                    "replies": [
                        {
                            "body": "I do. I'm going to be examined by my doctor soon. Thank you for the support. I will absolutely keep that in mind if I need to talk to someone.",
                            "author": "First_Baby",
                            "id": "fy9zsvv",
                            "parent_id": "t1_fy9sd0u",
                            "score": 2,
                            "created_utc": 1594923504.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I called my doctor this morning and took a plan B last night. My understanding of assault has definitely shifted.",
            "author": "First_Baby",
            "id": "fy9blva",
            "parent_id": "t1_fy9b33x",
            "score": 17,
            "created_utc": 1594911799.0,
            "replies": []
        },
        {
            "body": "This^",
            "author": "SunnyWinter85",
            "id": "fy9bmw9",
            "parent_id": "t1_fy9b33x",
            "score": 5,
            "created_utc": 1594911815.0,
            "replies": []
        },
        {
            "body": "Absolutely. I'm learning that the men who prey on SA and SBs are incredibly manipulative.   The common line though is that I ignored red flags that would have protected me. I'm still learning what not to do. I've been in this forum for a long time doing as much research as possible, but I guess there isnt anything that can teach you like real-life experience can.",
            "author": "First_Baby",
            "id": "fy9p7ac",
            "parent_id": "t1_fy9edcy",
            "score": 5,
            "created_utc": 1594918450.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fyb0jo5",
                    "parent_id": "t1_fy9p7ac",
                    "score": 4,
                    "created_utc": 1594941856.0,
                    "replies": [
                        {
                            "body": "What is this blacklist people keep mentioning?",
                            "author": "First_Baby",
                            "id": "fyp943i",
                            "parent_id": "t1_fyb0jo5",
                            "score": 1,
                            "created_utc": 1595280768.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That is 100% true. I let my guard down because I had hope that he would stick to our arrangement which included using condoms.  These are all lessons I'm learning the hard way. I've had nothing but \"learnable\" experiences in the sugar dating world.",
            "author": "First_Baby",
            "id": "fy9o29p",
            "parent_id": "t1_fy9dktu",
            "score": 4,
            "created_utc": 1594917903.0,
            "replies": [
                {
                    "body": "As you read through all of these comments, remember that EVERYONE has an agenda.  You have to pick through everything and figure out what's true, what's not and how it applies to you.",
                    "author": "hal99514",
                    "id": "fy9ozog",
                    "parent_id": "t1_fy9o29p",
                    "score": 7,
                    "created_utc": 1594918348.0,
                    "replies": [
                        {
                            "body": "I agree. I take everything accordingly.",
                            "author": "First_Baby",
                            "id": "fy9rhmg",
                            "parent_id": "t1_fy9ozog",
                            "score": 3,
                            "created_utc": 1594919543.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'll talk to my doctor about that. Thank you!",
            "author": "First_Baby",
            "id": "fy9pfwj",
            "parent_id": "t1_fy9iys4",
            "score": 2,
            "created_utc": 1594918563.0,
            "replies": []
        },
        {
            "body": "This is a really good tip. I'm considering this to be strike 2 for my sugar dating experiences, strike 3 and I'm out. What's crazy is that of all the years I spent vanilla dating, I've never had issues like I do in this arena. Its like I'm a minnow in a barrel of mostly sharks.",
            "author": "First_Baby",
            "id": "fy9ohcq",
            "parent_id": "t1_fy9cfv8",
            "score": 6,
            "created_utc": 1594918106.0,
            "replies": []
        },
        {
            "body": "He had put my allowance in my purse beforehand so I was good for that, thank goodness. Idk if I would have had the spine enough to bring it up.",
            "author": "First_Baby",
            "id": "fy9noqn",
            "parent_id": "t1_fy9e1s9",
            "score": 3,
            "created_utc": 1594917722.0,
            "replies": []
        },
        {
            "body": "That's the part that kills me. When I asked for the money for a plan B he said, \"well you're on birth control, right\"? Like I was just going to have to accept that. On top of it, I'm really sensitive to PH changes. I'm going to get a yeast infection and have a messed up cycle, hopefully thats all he left me with...",
            "author": "First_Baby",
            "id": "fy9ougv",
            "parent_id": "t1_fy9drfh",
            "score": 4,
            "created_utc": 1594918278.0,
            "replies": [
                {
                    "body": "Ugh, that's terrible! Hopefully all the side effects will be minor.",
                    "author": "mraspencer",
                    "id": "fy9p2u2",
                    "parent_id": "t1_fy9ougv",
                    "score": 3,
                    "created_utc": 1594918391.0,
                    "replies": [
                        {
                            "body": "I can only pray at this point.",
                            "author": "First_Baby",
                            "id": "fy9rev5",
                            "parent_id": "t1_fy9p2u2",
                            "score": 2,
                            "created_utc": 1594919506.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I plan on it. I asked him and he said he doesn't have anything, but of course, he's a liar.",
            "author": "First_Baby",
            "id": "fy9pbba",
            "parent_id": "t1_fy9fj53",
            "score": 5,
            "created_utc": 1594918503.0,
            "replies": []
        },
        {
            "body": "Thank you for the info. I called an attorney in my city and found out that this was not a crime and I could have caught charges myself if I had reported it. Fortunately, I'm already in therapy from another assault. My therapist actually told me that I would be prone to attract predators, but I struggled to make the connection. I don't see how... but I do..",
            "author": "First_Baby",
            "id": "fy9zjf3",
            "parent_id": "t1_fy9tmnu",
            "score": 6,
            "created_utc": 1594923378.0,
            "replies": [
                {
                    "body": "Well, I'm sure your therapist is better equipped to explain this than I am but: **Do not blame yourself for the actions of those predators**. \n\nThat you're \"prone to attract\" them isn't some character flaw or something you are responsible for, no matter what happens to you. I think the \"trick\" here is to get to know yourself better, understand what's inside you that makes you tick, deal with past trauma, and figure out how to move forward with your guard up, but also the vulnerability necessary to have *any kind* of decent human relationships.\n\nBest to you! Reach out if you need someone to talk to!",
                    "author": "marker3000",
                    "id": "fya1tn4",
                    "parent_id": "t1_fy9zjf3",
                    "score": 6,
                    "created_utc": 1594924469.0,
                    "replies": [
                        {
                            "body": "I agree with this advice heavily. I think it’s spot on and portrays a very realistic outcome. \nThe “prone to attract” thing doesn’t sound like your therapist presented that correctly. I’ve been in therapy a long time and I am very aware of when I am vulnerable and can’t always do much about it other than work harder at putting up boundaries, not that that would prevent this man from doing that to you. @marker3000 is right- not a character flaw just something to be aware of as it is simply fact that women who have been raped/assaulted are MUCH more likely to be subjected to abuse again. I’d say You are on the right track to healing and protecting yourself mentally and physically. Do whatever you need to do but be smart and fuck the police. Until you talk to a few lawyers, get a rape kit (someone said wait but that is definitely wrong as you have to do it within 72 hours), take a full panel STD test, see your psychologist and doctor. \nEdit: I meant do all that before going to the police but then I remembered that the police have to order the rape kit.",
                            "author": null,
                            "id": "fyadsuf",
                            "parent_id": "t1_fya1tn4",
                            "score": 3,
                            "created_utc": 1594930313.0,
                            "replies": [
                                {
                                    "body": "It is 100% this guys fault.\n\nAt the same time, there are a lot of micro-interactions and signals that bad people and predators give off that are often missed by people with trauma history, and it’s good to recognize this.",
                                    "author": "garret6758",
                                    "id": "fyaeo47",
                                    "parent_id": "t1_fyadsuf",
                                    "score": 3,
                                    "created_utc": 1594930721.0,
                                    "replies": [
                                        {
                                            "body": "Yes very true! Well put. You get used to it and become color blind. Trauma that isn’t healed or dealt with in a healthy manner- it internalizes and comes out in a disguise.",
                                            "author": null,
                                            "id": "fyaix98",
                                            "parent_id": "t1_fyaeo47",
                                            "score": 3,
                                            "created_utc": 1594932739.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "> Until you talk to a few lawyers, get a rape kit (someone said wait but that is definitely wrong as you have to do it within 72 hours), take a full panel STD test, see your psychologist and doctor. Edit: I meant do all that before going to the police but then I remembered that the police have to order the rape kit.  \n\n\nI 100% agree if she was assaulted she should get a rape kit.\n\nIn this case, though, getting an immediate STD test is mostly pointless. Nothing incubates fast enough to show up that fast. \n\nWhat I was advocating on \"waiting\" for was the STD test.",
                                    "author": "marker3000",
                                    "id": "fyaxin5",
                                    "parent_id": "t1_fyadsuf",
                                    "score": 1,
                                    "created_utc": 1594940188.0,
                                    "replies": [
                                        {
                                            "body": "oh ok my bad glad you saw this and corrected me.",
                                            "author": null,
                                            "id": "fyb12u5",
                                            "parent_id": "t1_fyaxin5",
                                            "score": 3,
                                            "created_utc": 1594942149.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "***the odds are he is a RAPIST",
            "author": "bstractig",
            "id": "fyafhxj",
            "parent_id": "t1_fy9tmnu",
            "score": 1,
            "created_utc": 1594931120.0,
            "replies": []
        },
        {
            "body": "Thank you. I will absolutely be taking you up on that.",
            "author": "First_Baby",
            "id": "fy9afxk",
            "parent_id": "t1_fy99r3m",
            "score": 3,
            "created_utc": 1594911201.0,
            "replies": [
                {
                    "body": "By all means!!",
                    "author": "SunnyWinter85",
                    "id": "fy9akrz",
                    "parent_id": "t1_fy9afxk",
                    "score": 3,
                    "created_utc": 1594911270.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The track record for SA is 2-0, I was taken advantage of both men that I've met with from the site. At this point, I'm ready to write it off as a haven for predators. Someone sent me a message about trying different methods to find SDs, I think the only way I could proceed is if it's not through SA.",
            "author": "First_Baby",
            "id": "fyaqiq8",
            "parent_id": "t1_fy9c9t4",
            "score": 5,
            "created_utc": 1594936457.0,
            "replies": []
        },
        {
            "body": "It was SA, is that possible?",
            "author": "First_Baby",
            "id": "fy9o44u",
            "parent_id": "t1_fy9fg3g",
            "score": 5,
            "created_utc": 1594917928.0,
            "replies": [
                {
                    "body": "Yes, I'm pretty sure there is a place on his profile that will allow you register a complaint. Even in the event that he has already blocked you, you could still contact SA's customer support and register a complaint. Actually, if you are so inclined, you can still file criminal charges and the police will investigate his identity. \n\nIf this should happen to you again or someone else reading - heaven forfend - you can treat it as a rape in which case you would want to go to the police straight away and have them take semen samples as physical evidence.",
                    "author": "Brashtard",
                    "id": "fya8s1n",
                    "parent_id": "t1_fy9o44u",
                    "score": 2,
                    "created_utc": 1594927912.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would talk to 5 more attorneys.",
            "author": "babylina",
            "id": "fybjyla",
            "parent_id": "t1_fya9nwt",
            "score": 3,
            "created_utc": 1594953324.0,
            "replies": []
        },
        {
            "body": "See post by KnightAnthony - \"stealthing\" or \"accidental (on purpose) cream pie\" fantasy has become popular in porn. So we can call the guys who do this Demon Sheep. Demon because it's evil, Sheep because the fantasy they're acting out isn't even their original idea, but something they picked up from the media.\n\n(BTW if you look up Demon Sheep you'll find something completely different, so don't look it up unless you want to be distracted.)",
            "author": "highfructoseSD",
            "id": "fybuymp",
            "parent_id": "t1_fyb1196",
            "score": 1,
            "created_utc": 1594960607.0,
            "replies": []
        },
        {
            "body": "I hear you. I don't feel like I've been raped. Unfortunately, I know what that feels like, but this is different because he wasn't pinning me down or screaming at me. I feel just as violated though.",
            "author": "First_Baby",
            "id": "fyaq4q2",
            "parent_id": "t1_fyac010",
            "score": 1,
            "created_utc": 1594936257.0,
            "replies": [
                {
                    "body": "You don’t have to struggle for it to be raped. Look at Harvey Weinstein ... he raped countless women and if you watch their testimonies not one of them fought back or screamed or anything but they were all raped. Rape has many forms. I don’t want to put a label on something you went through that you don’t identify with I’m only trying to point out that rape is violence but it doesn’t always look or sound violent. By definition violence is “strength of emotion or an unpleasant or destructive natural force”. So if not rape id say violence but again I’m sorry I don’t want to sound like I’m correcting you on the verbiage of your own experience. I just want you to know what you went through is serious and so unbelievably wrong.",
                    "author": null,
                    "id": "fyas46g",
                    "parent_id": "t1_fyaq4q2",
                    "score": 2,
                    "created_utc": 1594937277.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just one, but we talked on the phone quite a bit.",
            "author": "First_Baby",
            "id": "fy9ad0e",
            "parent_id": "t1_fy9a2f6",
            "score": 5,
            "created_utc": 1594911159.0,
            "replies": [
                {
                    "body": "Quite a bit = days/hours/weeks?\n\nHow long was your first meeting and what did y’all do?",
                    "author": null,
                    "id": "fy9ama2",
                    "parent_id": "t1_fy9ad0e",
                    "score": 0,
                    "created_utc": 1594911291.0,
                    "replies": [
                        {
                            "body": "We talked on the phone for about a week. We met at a park the first time and went for a stroll. I never got any bad vibes from him, even after. He played dumb and said the condom slipped off.",
                            "author": "First_Baby",
                            "id": "fy9b8wm",
                            "parent_id": "t1_fy9ama2",
                            "score": 5,
                            "created_utc": 1594911611.0,
                            "replies": [
                                {
                                    "body": "Interesting. Park first date, then hotel. I’m asking just to learn more about how to spot red flags in advance. \n\nEither way, he sounds like someone who can’t be trusted. You should void your arrangement and leave him alone.",
                                    "author": null,
                                    "id": "fy9bzaz",
                                    "parent_id": "t1_fy9b8wm",
                                    "score": 3,
                                    "created_utc": 1594911992.0,
                                    "replies": [
                                        {
                                            "body": "It seems  u/first_baby did almost all the right things to vet this guy before the  intimate date.  \n\nWhen he claimed not to have condoms, that was a yellow flag.  When he magically came up with one when she made it clear she wouldn't go without protection that flag turned red.  By that time, she was in a very compromised situation and I'm sure it would have been difficult to walk out at that point.  This guy is a real creep and clearly knew what he was doing.  This is why stealthing should be sexual assault, but would be near impossible to prove in court.",
                                            "author": "willfromvb",
                                            "id": "fy9docm",
                                            "parent_id": "t1_fy9bzaz",
                                            "score": 19,
                                            "created_utc": 1594912849.0,
                                            "replies": [
                                                {
                                                    "body": "Agreed on all of this.",
                                                    "author": "mraspencer",
                                                    "id": "fy9erje",
                                                    "parent_id": "t1_fy9docm",
                                                    "score": 2,
                                                    "created_utc": 1594913388.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "You're totally right. I hear the, \"oh I don't have a condom excuse all the time\". I figured he was just being a typical guy so it never registered to me as a red flag. The difference is with vanilla dates I would be at home or a place where I could get to some.",
                                                    "author": "First_Baby",
                                                    "id": "fy9prf6",
                                                    "parent_id": "t1_fy9docm",
                                                    "score": 2,
                                                    "created_utc": 1594918714.0,
                                                    "replies": [
                                                        {
                                                            "body": "Even if you had some on hand, that wouldn't have stopped him from taking it off without you knowing.\n\nThe guy you met is one of the jackasses that ruin sex (and by extension, dating/sugar dating) for everyone.",
                                                            "author": "sdthrowaway006",
                                                            "id": "fy9umyw",
                                                            "parent_id": "t1_fy9prf6",
                                                            "score": 2,
                                                            "created_utc": 1594921021.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Great observation!!!",
                                                    "author": "EMPOWER_not_enable",
                                                    "id": "fy9fxdn",
                                                    "parent_id": "t1_fy9docm",
                                                    "score": 1,
                                                    "created_utc": 1594913963.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Agreed.",
                                                    "author": "sdthrowaway006",
                                                    "id": "fy9lkqi",
                                                    "parent_id": "t1_fy9docm",
                                                    "score": 1,
                                                    "created_utc": 1594916707.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Thank you for this post.",
                                                    "author": null,
                                                    "id": "fy9esrn",
                                                    "parent_id": "t1_fy9docm",
                                                    "score": 0,
                                                    "created_utc": 1594913405.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "park first date in the Covid-times isn't a red flag\n\nNeither is intimacy on the first date post-M&G, that's actually rather standard in a PPM arrangement.\n\nDoesn't sound like the guy gave off any red flags at all, until he turned into an asshole during sex.",
                                            "author": "mraspencer",
                                            "id": "fy9dn53",
                                            "parent_id": "t1_fy9bzaz",
                                            "score": 3,
                                            "created_utc": 1594912832.0,
                                            "replies": [
                                                {
                                                    "body": "What does COVID have anything to do with this? I’m asking for you to think about the logic before answering....😇\n\nAnd how are you able to speak on a standard? I’m asking because if there’s a SA Center of Excellence that has published a report on standards of practice, let me know because I could learn from it.",
                                                    "author": null,
                                                    "id": "fy9e4sr",
                                                    "parent_id": "t1_fy9dn53",
                                                    "score": 0,
                                                    "created_utc": 1594913077.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sure...M&G's are taking on different forms due to COVID restrictions. And a stroll in a public park is hardly a red flag. \n\nWhat about it IS a red flag to you? I'll ask you the same condescending question to think about the logic before answering.",
                                                            "author": "mraspencer",
                                                            "id": "fy9eclk",
                                                            "parent_id": "t1_fy9e4sr",
                                                            "score": 4,
                                                            "created_utc": 1594913185.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Well, first when you threw in COVID restrictions I chuckled because a hotel was involved. So at that point, adherence to COVID restrictions is kinda irrelevant? \n\nSecond, you assumed I was stating her unfortunate situation was deemed a red flag situation. My statement about red flags was associated with the reason why I was asking (what could seem like a lot of questions). \n\nA horrible action caused by her SD and thank goodness she wasn’t a victim of physical harming or anything violent...I was trying to gain more insight to help (me) take precautionary measures by recognizing potential red flags.  \n\nCondescension directed at you, possibly? But I dislike it when people take my statements and misinterpret them before inquiring—it impedes good dialogue.",
                                                                    "author": null,
                                                                    "id": "fy9g4r0",
                                                                    "parent_id": "t1_fy9eclk",
                                                                    "score": -1,
                                                                    "created_utc": 1594914064.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "\"Condescending, possibly. But I dislike it when people take my statements and misinterpret them before inquiring—it impedes good dialogue.\"\n\nAnd you misinterpreted my statement as well.\n\nThe park and hotel are two separate dates, yes? They are independent of each other, or would you rather the M&G be at the hotel itself.\n\nMy mentioning of COVID is because it's hard to find places to sit inside, at least here there are none. Can't dine in anywhere. So where else would you like to conduct a M&G? A park is perfectly valid (and better than some options).",
                                                                            "author": "mraspencer",
                                                                            "id": "fy9gk4z",
                                                                            "parent_id": "t1_fy9g4r0",
                                                                            "score": 3,
                                                                            "created_utc": 1594914274.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I think you’re projecting and amplifying a bit when it comes to meeting locations—again...you gotta try not to take positions that come off as your assuming vice inquiring. \n\nNo one said dining was not an option. YOU assumed that since she picked a park as a first meet up it was due to COVID. \n\nI’m all for having a healthy debate (probably not ideal in this very thread—it’s an unfortunate situation) but please for the love of pumpkin pie minimize the assumptions and taking a position based upon projecting....at least if/when you want to recreationally debate with me. 🥴😄 \n\nYours Truly,\nSG",
                                                                                    "author": null,
                                                                                    "id": "fy9i5ep",
                                                                                    "parent_id": "t1_fy9gk4z",
                                                                                    "score": 1,
                                                                                    "created_utc": 1594915046.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I did! But I'm really small and if the situation escalated I would have been defenseless. He had a good 150 pounds and an entire foot over me.",
            "author": "First_Baby",
            "id": "fy9qlqy",
            "parent_id": "t1_fy9m0bu",
            "score": 1,
            "created_utc": 1594919118.0,
            "replies": [
                {
                    "body": "I’m so sorry this happened to you :(",
                    "author": "kristalle21",
                    "id": "fy9w1ag",
                    "parent_id": "t1_fy9qlqy",
                    "score": 1,
                    "created_utc": 1594921683.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I thought about that. I feel like men like him don't care about what they're doing to women like me, but they do care about their money. I was thinking I could ask for a large amount of money, but I wouldn't want to extort him either.",
            "author": "First_Baby",
            "id": "fyaro1w",
            "parent_id": "t1_fya1gkp",
            "score": 1,
            "created_utc": 1594937045.0,
            "replies": []
        },
        {
            "body": "I will absolutely do that. I'll make the SDs super glue them on as well...",
            "author": "First_Baby",
            "id": "fyarqhw",
            "parent_id": "t1_fya3nk1",
            "score": 2,
            "created_utc": 1594937081.0,
            "replies": []
        },
        {
            "body": "I've made an appointment with my doctor so that I can get the testing done, but I don't think the option to press charges is on the table for me because of the laws about assault in my area. If I could do this without getting myself into trouble, I would, but that doesn't seem like an option at the moment. I reported him to SA though.",
            "author": "First_Baby",
            "id": "fyarahp",
            "parent_id": "t1_fyaer1a",
            "score": 3,
            "created_utc": 1594936851.0,
            "replies": [
                {
                    "body": "Fuck that. Start a revolution. He is disgusting. You weren’t fucking for money, he was giving you gifts for being his companion",
                    "author": "babylina",
                    "id": "fybjuql",
                    "parent_id": "t1_fyarahp",
                    "score": 2,
                    "created_utc": 1594953255.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It was an assault, and completely intentional - your story of how they agreed to the condom, then pretended they did not have one, then magically found one after being told nothing will happen without it makes it crystal clear this was no accident.\n\nDo not ever see this lowlife scum again, and if stealthing is a crime in your jurisdiction, I would consider filing a police report... but that is a decision for you and you alone.",
            "author": "GDarn",
            "id": "fy9dpm1",
            "parent_id": "t1_fy9aom9",
            "score": 46,
            "created_utc": 1594912867.0,
            "replies": [
                {
                    "body": "Would I get in trouble? I know sugaring isn't illegal, but some people don't see it that way.",
                    "author": "First_Baby",
                    "id": "fy9n9iz",
                    "parent_id": "t1_fy9dpm1",
                    "score": 6,
                    "created_utc": 1594917520.0,
                    "replies": [
                        {
                            "body": "I cannot answer this question since it is not only jurisdiction specific, but it also depends on a lot of other facts that should not be asked for or disclosed online.\n\nIf you would like to report this assault but are concerned about getting in legal trouble yourself, I would talk to a local attorney so you can get useful legal advice.\n\nMany of them offer short free consultations, or you could find a legal services clinic that offers free legal services.\n\nDo not file a police report without getting a legal opinion first - you do not want to self incriminate.",
                            "author": "GDarn",
                            "id": "fy9nqi1",
                            "parent_id": "t1_fy9n9iz",
                            "score": 14,
                            "created_utc": 1594917745.0,
                            "replies": [
                                {
                                    "body": "Of course. I know just who to call. Thank you.",
                                    "author": "First_Baby",
                                    "id": "fy9rkvs",
                                    "parent_id": "t1_fy9nqi1",
                                    "score": 6,
                                    "created_utc": 1594919587.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m so sorry this happened to you. \n\nI had the exact same thing happened to me. Unfortunately it is rape. \nI suggest aside from the plan B, get a full panel of blood and urine exams done to test for STIs.",
            "author": "wndrlnds",
            "id": "fy9crc2",
            "parent_id": "t1_fy9aom9",
            "score": 24,
            "created_utc": 1594912391.0,
            "replies": [
                {
                    "body": "Oh my goodness. I'm sorry that happened to you too. I hope you're okay. I know the physical part must have been rough, but the mental is really taxing.",
                    "author": "First_Baby",
                    "id": "fy9ndhx",
                    "parent_id": "t1_fy9crc2",
                    "score": 5,
                    "created_utc": 1594917573.0,
                    "replies": [
                        {
                            "body": "It’s a really terrible experience. You’re vulnerable and try to trust someone you practically don’t know. And they fully take advantage of you. It’s fucking horrible.",
                            "author": "wndrlnds",
                            "id": "fy9tzmk",
                            "parent_id": "t1_fy9ndhx",
                            "score": 10,
                            "created_utc": 1594920716.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You're totally right and I completely agree with you that sex work should be legal. \n\nOur government has always been behind the times so hopefully they'll make stealthing punishable and work towards other laws to protect those in and out of sex work.",
            "author": "kaitlynnkidd",
            "id": "fy9mgf9",
            "parent_id": "t1_fy9m82c",
            "score": 6,
            "created_utc": 1594917129.0,
            "replies": []
        },
        {
            "body": "Someone mentioned I should go to the police and I was worried about that exact thing. I agree it should be legalized.",
            "author": "First_Baby",
            "id": "fy9nh7r",
            "parent_id": "t1_fy9m82c",
            "score": 7,
            "created_utc": 1594917622.0,
            "replies": [
                {
                    "body": "I'd also lean towards going to police, there are just so many factors that others far more informed than my self would be able to assist you with, and this is time sensitive.  Rape kit's should be administered as soon as possible to collect evidence. \n\nPossibly a call to a domestic abuse lawyer in your area, or a call to a national sexual assault hotline like [RAINN](https://www.rainn.org/about-national-sexual-assault-telephone-hotline)",
                    "author": "MoreCowbellNeeded",
                    "id": "fy9sgua",
                    "parent_id": "t1_fy9nh7r",
                    "score": 2,
                    "created_utc": 1594920006.0,
                    "replies": [
                        {
                            "body": "I've talked to my doctor and I have an appointment lined up. Unfortunately, I can't go to the police in my area.",
                            "author": "First_Baby",
                            "id": "fy9zo65",
                            "parent_id": "t1_fy9sgua",
                            "score": 3,
                            "created_utc": 1594923442.0,
                            "replies": [
                                {
                                    "body": "Good because you should NOT get a rape kit at the police station anyways. They mess it up most of the time and also barely actually complete it, there are thousands of rape kits that have gone untested this way. ALWAYS go to the hospital ASAP for a rape kit (dont shower or wash your clothes). This is valuable information for everyone to know so I figured i would respond here for those that may need to know this info later",
                                    "author": "bstractig",
                                    "id": "fyaf56u",
                                    "parent_id": "t1_fy9zo65",
                                    "score": 4,
                                    "created_utc": 1594930950.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fya7nld",
            "parent_id": "t1_fy9px7k",
            "score": 9,
            "created_utc": 1594927367.0,
            "replies": []
        },
        {
            "body": "I almost said that but I chickened out. Kudos to you for being bold and brave!",
            "author": "tgibook",
            "id": "fy9qb8l",
            "parent_id": "t1_fy9px7k",
            "score": 5,
            "created_utc": 1594918977.0,
            "replies": []
        },
        {
            "body": "I'm so sorry you are going through this! You're not alone. We are all here with you. You were assaulted, plain and simple. Do you have insurance? If not go to planned parenthood. They charge on a sliding scale. You should also make him pay for you needing to be tested. If you need positive test results, believe it or not there are loads in Google images. DM me if you need to vent or anything and please keep us informed!",
            "author": "tgibook",
            "id": "fy9sd0u",
            "parent_id": "t1_fy9qfgp",
            "score": 3,
            "created_utc": 1594919956.0,
            "replies": [
                {
                    "body": "I do. I'm going to be examined by my doctor soon. Thank you for the support. I will absolutely keep that in mind if I need to talk to someone.",
                    "author": "First_Baby",
                    "id": "fy9zsvv",
                    "parent_id": "t1_fy9sd0u",
                    "score": 2,
                    "created_utc": 1594923504.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fyb0jo5",
            "parent_id": "t1_fy9p7ac",
            "score": 4,
            "created_utc": 1594941856.0,
            "replies": [
                {
                    "body": "What is this blacklist people keep mentioning?",
                    "author": "First_Baby",
                    "id": "fyp943i",
                    "parent_id": "t1_fyb0jo5",
                    "score": 1,
                    "created_utc": 1595280768.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As you read through all of these comments, remember that EVERYONE has an agenda.  You have to pick through everything and figure out what's true, what's not and how it applies to you.",
            "author": "hal99514",
            "id": "fy9ozog",
            "parent_id": "t1_fy9o29p",
            "score": 7,
            "created_utc": 1594918348.0,
            "replies": [
                {
                    "body": "I agree. I take everything accordingly.",
                    "author": "First_Baby",
                    "id": "fy9rhmg",
                    "parent_id": "t1_fy9ozog",
                    "score": 3,
                    "created_utc": 1594919543.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ugh, that's terrible! Hopefully all the side effects will be minor.",
            "author": "mraspencer",
            "id": "fy9p2u2",
            "parent_id": "t1_fy9ougv",
            "score": 3,
            "created_utc": 1594918391.0,
            "replies": [
                {
                    "body": "I can only pray at this point.",
                    "author": "First_Baby",
                    "id": "fy9rev5",
                    "parent_id": "t1_fy9p2u2",
                    "score": 2,
                    "created_utc": 1594919506.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, I'm sure your therapist is better equipped to explain this than I am but: **Do not blame yourself for the actions of those predators**. \n\nThat you're \"prone to attract\" them isn't some character flaw or something you are responsible for, no matter what happens to you. I think the \"trick\" here is to get to know yourself better, understand what's inside you that makes you tick, deal with past trauma, and figure out how to move forward with your guard up, but also the vulnerability necessary to have *any kind* of decent human relationships.\n\nBest to you! Reach out if you need someone to talk to!",
            "author": "marker3000",
            "id": "fya1tn4",
            "parent_id": "t1_fy9zjf3",
            "score": 6,
            "created_utc": 1594924469.0,
            "replies": [
                {
                    "body": "I agree with this advice heavily. I think it’s spot on and portrays a very realistic outcome. \nThe “prone to attract” thing doesn’t sound like your therapist presented that correctly. I’ve been in therapy a long time and I am very aware of when I am vulnerable and can’t always do much about it other than work harder at putting up boundaries, not that that would prevent this man from doing that to you. @marker3000 is right- not a character flaw just something to be aware of as it is simply fact that women who have been raped/assaulted are MUCH more likely to be subjected to abuse again. I’d say You are on the right track to healing and protecting yourself mentally and physically. Do whatever you need to do but be smart and fuck the police. Until you talk to a few lawyers, get a rape kit (someone said wait but that is definitely wrong as you have to do it within 72 hours), take a full panel STD test, see your psychologist and doctor. \nEdit: I meant do all that before going to the police but then I remembered that the police have to order the rape kit.",
                    "author": null,
                    "id": "fyadsuf",
                    "parent_id": "t1_fya1tn4",
                    "score": 3,
                    "created_utc": 1594930313.0,
                    "replies": [
                        {
                            "body": "It is 100% this guys fault.\n\nAt the same time, there are a lot of micro-interactions and signals that bad people and predators give off that are often missed by people with trauma history, and it’s good to recognize this.",
                            "author": "garret6758",
                            "id": "fyaeo47",
                            "parent_id": "t1_fyadsuf",
                            "score": 3,
                            "created_utc": 1594930721.0,
                            "replies": [
                                {
                                    "body": "Yes very true! Well put. You get used to it and become color blind. Trauma that isn’t healed or dealt with in a healthy manner- it internalizes and comes out in a disguise.",
                                    "author": null,
                                    "id": "fyaix98",
                                    "parent_id": "t1_fyaeo47",
                                    "score": 3,
                                    "created_utc": 1594932739.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "> Until you talk to a few lawyers, get a rape kit (someone said wait but that is definitely wrong as you have to do it within 72 hours), take a full panel STD test, see your psychologist and doctor. Edit: I meant do all that before going to the police but then I remembered that the police have to order the rape kit.  \n\n\nI 100% agree if she was assaulted she should get a rape kit.\n\nIn this case, though, getting an immediate STD test is mostly pointless. Nothing incubates fast enough to show up that fast. \n\nWhat I was advocating on \"waiting\" for was the STD test.",
                            "author": "marker3000",
                            "id": "fyaxin5",
                            "parent_id": "t1_fyadsuf",
                            "score": 1,
                            "created_utc": 1594940188.0,
                            "replies": [
                                {
                                    "body": "oh ok my bad glad you saw this and corrected me.",
                                    "author": null,
                                    "id": "fyb12u5",
                                    "parent_id": "t1_fyaxin5",
                                    "score": 3,
                                    "created_utc": 1594942149.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "By all means!!",
            "author": "SunnyWinter85",
            "id": "fy9akrz",
            "parent_id": "t1_fy9afxk",
            "score": 3,
            "created_utc": 1594911270.0,
            "replies": []
        },
        {
            "body": "Yes, I'm pretty sure there is a place on his profile that will allow you register a complaint. Even in the event that he has already blocked you, you could still contact SA's customer support and register a complaint. Actually, if you are so inclined, you can still file criminal charges and the police will investigate his identity. \n\nIf this should happen to you again or someone else reading - heaven forfend - you can treat it as a rape in which case you would want to go to the police straight away and have them take semen samples as physical evidence.",
            "author": "Brashtard",
            "id": "fya8s1n",
            "parent_id": "t1_fy9o44u",
            "score": 2,
            "created_utc": 1594927912.0,
            "replies": []
        },
        {
            "body": "You don’t have to struggle for it to be raped. Look at Harvey Weinstein ... he raped countless women and if you watch their testimonies not one of them fought back or screamed or anything but they were all raped. Rape has many forms. I don’t want to put a label on something you went through that you don’t identify with I’m only trying to point out that rape is violence but it doesn’t always look or sound violent. By definition violence is “strength of emotion or an unpleasant or destructive natural force”. So if not rape id say violence but again I’m sorry I don’t want to sound like I’m correcting you on the verbiage of your own experience. I just want you to know what you went through is serious and so unbelievably wrong.",
            "author": null,
            "id": "fyas46g",
            "parent_id": "t1_fyaq4q2",
            "score": 2,
            "created_utc": 1594937277.0,
            "replies": []
        },
        {
            "body": "Quite a bit = days/hours/weeks?\n\nHow long was your first meeting and what did y’all do?",
            "author": null,
            "id": "fy9ama2",
            "parent_id": "t1_fy9ad0e",
            "score": 0,
            "created_utc": 1594911291.0,
            "replies": [
                {
                    "body": "We talked on the phone for about a week. We met at a park the first time and went for a stroll. I never got any bad vibes from him, even after. He played dumb and said the condom slipped off.",
                    "author": "First_Baby",
                    "id": "fy9b8wm",
                    "parent_id": "t1_fy9ama2",
                    "score": 5,
                    "created_utc": 1594911611.0,
                    "replies": [
                        {
                            "body": "Interesting. Park first date, then hotel. I’m asking just to learn more about how to spot red flags in advance. \n\nEither way, he sounds like someone who can’t be trusted. You should void your arrangement and leave him alone.",
                            "author": null,
                            "id": "fy9bzaz",
                            "parent_id": "t1_fy9b8wm",
                            "score": 3,
                            "created_utc": 1594911992.0,
                            "replies": [
                                {
                                    "body": "It seems  u/first_baby did almost all the right things to vet this guy before the  intimate date.  \n\nWhen he claimed not to have condoms, that was a yellow flag.  When he magically came up with one when she made it clear she wouldn't go without protection that flag turned red.  By that time, she was in a very compromised situation and I'm sure it would have been difficult to walk out at that point.  This guy is a real creep and clearly knew what he was doing.  This is why stealthing should be sexual assault, but would be near impossible to prove in court.",
                                    "author": "willfromvb",
                                    "id": "fy9docm",
                                    "parent_id": "t1_fy9bzaz",
                                    "score": 19,
                                    "created_utc": 1594912849.0,
                                    "replies": [
                                        {
                                            "body": "Agreed on all of this.",
                                            "author": "mraspencer",
                                            "id": "fy9erje",
                                            "parent_id": "t1_fy9docm",
                                            "score": 2,
                                            "created_utc": 1594913388.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "You're totally right. I hear the, \"oh I don't have a condom excuse all the time\". I figured he was just being a typical guy so it never registered to me as a red flag. The difference is with vanilla dates I would be at home or a place where I could get to some.",
                                            "author": "First_Baby",
                                            "id": "fy9prf6",
                                            "parent_id": "t1_fy9docm",
                                            "score": 2,
                                            "created_utc": 1594918714.0,
                                            "replies": [
                                                {
                                                    "body": "Even if you had some on hand, that wouldn't have stopped him from taking it off without you knowing.\n\nThe guy you met is one of the jackasses that ruin sex (and by extension, dating/sugar dating) for everyone.",
                                                    "author": "sdthrowaway006",
                                                    "id": "fy9umyw",
                                                    "parent_id": "t1_fy9prf6",
                                                    "score": 2,
                                                    "created_utc": 1594921021.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Great observation!!!",
                                            "author": "EMPOWER_not_enable",
                                            "id": "fy9fxdn",
                                            "parent_id": "t1_fy9docm",
                                            "score": 1,
                                            "created_utc": 1594913963.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Agreed.",
                                            "author": "sdthrowaway006",
                                            "id": "fy9lkqi",
                                            "parent_id": "t1_fy9docm",
                                            "score": 1,
                                            "created_utc": 1594916707.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Thank you for this post.",
                                            "author": null,
                                            "id": "fy9esrn",
                                            "parent_id": "t1_fy9docm",
                                            "score": 0,
                                            "created_utc": 1594913405.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "park first date in the Covid-times isn't a red flag\n\nNeither is intimacy on the first date post-M&G, that's actually rather standard in a PPM arrangement.\n\nDoesn't sound like the guy gave off any red flags at all, until he turned into an asshole during sex.",
                                    "author": "mraspencer",
                                    "id": "fy9dn53",
                                    "parent_id": "t1_fy9bzaz",
                                    "score": 3,
                                    "created_utc": 1594912832.0,
                                    "replies": [
                                        {
                                            "body": "What does COVID have anything to do with this? I’m asking for you to think about the logic before answering....😇\n\nAnd how are you able to speak on a standard? I’m asking because if there’s a SA Center of Excellence that has published a report on standards of practice, let me know because I could learn from it.",
                                            "author": null,
                                            "id": "fy9e4sr",
                                            "parent_id": "t1_fy9dn53",
                                            "score": 0,
                                            "created_utc": 1594913077.0,
                                            "replies": [
                                                {
                                                    "body": "Sure...M&G's are taking on different forms due to COVID restrictions. And a stroll in a public park is hardly a red flag. \n\nWhat about it IS a red flag to you? I'll ask you the same condescending question to think about the logic before answering.",
                                                    "author": "mraspencer",
                                                    "id": "fy9eclk",
                                                    "parent_id": "t1_fy9e4sr",
                                                    "score": 4,
                                                    "created_utc": 1594913185.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well, first when you threw in COVID restrictions I chuckled because a hotel was involved. So at that point, adherence to COVID restrictions is kinda irrelevant? \n\nSecond, you assumed I was stating her unfortunate situation was deemed a red flag situation. My statement about red flags was associated with the reason why I was asking (what could seem like a lot of questions). \n\nA horrible action caused by her SD and thank goodness she wasn’t a victim of physical harming or anything violent...I was trying to gain more insight to help (me) take precautionary measures by recognizing potential red flags.  \n\nCondescension directed at you, possibly? But I dislike it when people take my statements and misinterpret them before inquiring—it impedes good dialogue.",
                                                            "author": null,
                                                            "id": "fy9g4r0",
                                                            "parent_id": "t1_fy9eclk",
                                                            "score": -1,
                                                            "created_utc": 1594914064.0,
                                                            "replies": [
                                                                {
                                                                    "body": "\"Condescending, possibly. But I dislike it when people take my statements and misinterpret them before inquiring—it impedes good dialogue.\"\n\nAnd you misinterpreted my statement as well.\n\nThe park and hotel are two separate dates, yes? They are independent of each other, or would you rather the M&G be at the hotel itself.\n\nMy mentioning of COVID is because it's hard to find places to sit inside, at least here there are none. Can't dine in anywhere. So where else would you like to conduct a M&G? A park is perfectly valid (and better than some options).",
                                                                    "author": "mraspencer",
                                                                    "id": "fy9gk4z",
                                                                    "parent_id": "t1_fy9g4r0",
                                                                    "score": 3,
                                                                    "created_utc": 1594914274.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I think you’re projecting and amplifying a bit when it comes to meeting locations—again...you gotta try not to take positions that come off as your assuming vice inquiring. \n\nNo one said dining was not an option. YOU assumed that since she picked a park as a first meet up it was due to COVID. \n\nI’m all for having a healthy debate (probably not ideal in this very thread—it’s an unfortunate situation) but please for the love of pumpkin pie minimize the assumptions and taking a position based upon projecting....at least if/when you want to recreationally debate with me. 🥴😄 \n\nYours Truly,\nSG",
                                                                            "author": null,
                                                                            "id": "fy9i5ep",
                                                                            "parent_id": "t1_fy9gk4z",
                                                                            "score": 1,
                                                                            "created_utc": 1594915046.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m so sorry this happened to you :(",
            "author": "kristalle21",
            "id": "fy9w1ag",
            "parent_id": "t1_fy9qlqy",
            "score": 1,
            "created_utc": 1594921683.0,
            "replies": []
        },
        {
            "body": "Fuck that. Start a revolution. He is disgusting. You weren’t fucking for money, he was giving you gifts for being his companion",
            "author": "babylina",
            "id": "fybjuql",
            "parent_id": "t1_fyarahp",
            "score": 2,
            "created_utc": 1594953255.0,
            "replies": []
        },
        {
            "body": "Would I get in trouble? I know sugaring isn't illegal, but some people don't see it that way.",
            "author": "First_Baby",
            "id": "fy9n9iz",
            "parent_id": "t1_fy9dpm1",
            "score": 6,
            "created_utc": 1594917520.0,
            "replies": [
                {
                    "body": "I cannot answer this question since it is not only jurisdiction specific, but it also depends on a lot of other facts that should not be asked for or disclosed online.\n\nIf you would like to report this assault but are concerned about getting in legal trouble yourself, I would talk to a local attorney so you can get useful legal advice.\n\nMany of them offer short free consultations, or you could find a legal services clinic that offers free legal services.\n\nDo not file a police report without getting a legal opinion first - you do not want to self incriminate.",
                    "author": "GDarn",
                    "id": "fy9nqi1",
                    "parent_id": "t1_fy9n9iz",
                    "score": 14,
                    "created_utc": 1594917745.0,
                    "replies": [
                        {
                            "body": "Of course. I know just who to call. Thank you.",
                            "author": "First_Baby",
                            "id": "fy9rkvs",
                            "parent_id": "t1_fy9nqi1",
                            "score": 6,
                            "created_utc": 1594919587.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh my goodness. I'm sorry that happened to you too. I hope you're okay. I know the physical part must have been rough, but the mental is really taxing.",
            "author": "First_Baby",
            "id": "fy9ndhx",
            "parent_id": "t1_fy9crc2",
            "score": 5,
            "created_utc": 1594917573.0,
            "replies": [
                {
                    "body": "It’s a really terrible experience. You’re vulnerable and try to trust someone you practically don’t know. And they fully take advantage of you. It’s fucking horrible.",
                    "author": "wndrlnds",
                    "id": "fy9tzmk",
                    "parent_id": "t1_fy9ndhx",
                    "score": 10,
                    "created_utc": 1594920716.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'd also lean towards going to police, there are just so many factors that others far more informed than my self would be able to assist you with, and this is time sensitive.  Rape kit's should be administered as soon as possible to collect evidence. \n\nPossibly a call to a domestic abuse lawyer in your area, or a call to a national sexual assault hotline like [RAINN](https://www.rainn.org/about-national-sexual-assault-telephone-hotline)",
            "author": "MoreCowbellNeeded",
            "id": "fy9sgua",
            "parent_id": "t1_fy9nh7r",
            "score": 2,
            "created_utc": 1594920006.0,
            "replies": [
                {
                    "body": "I've talked to my doctor and I have an appointment lined up. Unfortunately, I can't go to the police in my area.",
                    "author": "First_Baby",
                    "id": "fy9zo65",
                    "parent_id": "t1_fy9sgua",
                    "score": 3,
                    "created_utc": 1594923442.0,
                    "replies": [
                        {
                            "body": "Good because you should NOT get a rape kit at the police station anyways. They mess it up most of the time and also barely actually complete it, there are thousands of rape kits that have gone untested this way. ALWAYS go to the hospital ASAP for a rape kit (dont shower or wash your clothes). This is valuable information for everyone to know so I figured i would respond here for those that may need to know this info later",
                            "author": "bstractig",
                            "id": "fyaf56u",
                            "parent_id": "t1_fy9zo65",
                            "score": 4,
                            "created_utc": 1594930950.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I do. I'm going to be examined by my doctor soon. Thank you for the support. I will absolutely keep that in mind if I need to talk to someone.",
            "author": "First_Baby",
            "id": "fy9zsvv",
            "parent_id": "t1_fy9sd0u",
            "score": 2,
            "created_utc": 1594923504.0,
            "replies": []
        },
        {
            "body": "What is this blacklist people keep mentioning?",
            "author": "First_Baby",
            "id": "fyp943i",
            "parent_id": "t1_fyb0jo5",
            "score": 1,
            "created_utc": 1595280768.0,
            "replies": []
        },
        {
            "body": "I agree. I take everything accordingly.",
            "author": "First_Baby",
            "id": "fy9rhmg",
            "parent_id": "t1_fy9ozog",
            "score": 3,
            "created_utc": 1594919543.0,
            "replies": []
        },
        {
            "body": "I can only pray at this point.",
            "author": "First_Baby",
            "id": "fy9rev5",
            "parent_id": "t1_fy9p2u2",
            "score": 2,
            "created_utc": 1594919506.0,
            "replies": []
        },
        {
            "body": "I agree with this advice heavily. I think it’s spot on and portrays a very realistic outcome. \nThe “prone to attract” thing doesn’t sound like your therapist presented that correctly. I’ve been in therapy a long time and I am very aware of when I am vulnerable and can’t always do much about it other than work harder at putting up boundaries, not that that would prevent this man from doing that to you. @marker3000 is right- not a character flaw just something to be aware of as it is simply fact that women who have been raped/assaulted are MUCH more likely to be subjected to abuse again. I’d say You are on the right track to healing and protecting yourself mentally and physically. Do whatever you need to do but be smart and fuck the police. Until you talk to a few lawyers, get a rape kit (someone said wait but that is definitely wrong as you have to do it within 72 hours), take a full panel STD test, see your psychologist and doctor. \nEdit: I meant do all that before going to the police but then I remembered that the police have to order the rape kit.",
            "author": null,
            "id": "fyadsuf",
            "parent_id": "t1_fya1tn4",
            "score": 3,
            "created_utc": 1594930313.0,
            "replies": [
                {
                    "body": "It is 100% this guys fault.\n\nAt the same time, there are a lot of micro-interactions and signals that bad people and predators give off that are often missed by people with trauma history, and it’s good to recognize this.",
                    "author": "garret6758",
                    "id": "fyaeo47",
                    "parent_id": "t1_fyadsuf",
                    "score": 3,
                    "created_utc": 1594930721.0,
                    "replies": [
                        {
                            "body": "Yes very true! Well put. You get used to it and become color blind. Trauma that isn’t healed or dealt with in a healthy manner- it internalizes and comes out in a disguise.",
                            "author": null,
                            "id": "fyaix98",
                            "parent_id": "t1_fyaeo47",
                            "score": 3,
                            "created_utc": 1594932739.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> Until you talk to a few lawyers, get a rape kit (someone said wait but that is definitely wrong as you have to do it within 72 hours), take a full panel STD test, see your psychologist and doctor. Edit: I meant do all that before going to the police but then I remembered that the police have to order the rape kit.  \n\n\nI 100% agree if she was assaulted she should get a rape kit.\n\nIn this case, though, getting an immediate STD test is mostly pointless. Nothing incubates fast enough to show up that fast. \n\nWhat I was advocating on \"waiting\" for was the STD test.",
                    "author": "marker3000",
                    "id": "fyaxin5",
                    "parent_id": "t1_fyadsuf",
                    "score": 1,
                    "created_utc": 1594940188.0,
                    "replies": [
                        {
                            "body": "oh ok my bad glad you saw this and corrected me.",
                            "author": null,
                            "id": "fyb12u5",
                            "parent_id": "t1_fyaxin5",
                            "score": 3,
                            "created_utc": 1594942149.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "We talked on the phone for about a week. We met at a park the first time and went for a stroll. I never got any bad vibes from him, even after. He played dumb and said the condom slipped off.",
            "author": "First_Baby",
            "id": "fy9b8wm",
            "parent_id": "t1_fy9ama2",
            "score": 5,
            "created_utc": 1594911611.0,
            "replies": [
                {
                    "body": "Interesting. Park first date, then hotel. I’m asking just to learn more about how to spot red flags in advance. \n\nEither way, he sounds like someone who can’t be trusted. You should void your arrangement and leave him alone.",
                    "author": null,
                    "id": "fy9bzaz",
                    "parent_id": "t1_fy9b8wm",
                    "score": 3,
                    "created_utc": 1594911992.0,
                    "replies": [
                        {
                            "body": "It seems  u/first_baby did almost all the right things to vet this guy before the  intimate date.  \n\nWhen he claimed not to have condoms, that was a yellow flag.  When he magically came up with one when she made it clear she wouldn't go without protection that flag turned red.  By that time, she was in a very compromised situation and I'm sure it would have been difficult to walk out at that point.  This guy is a real creep and clearly knew what he was doing.  This is why stealthing should be sexual assault, but would be near impossible to prove in court.",
                            "author": "willfromvb",
                            "id": "fy9docm",
                            "parent_id": "t1_fy9bzaz",
                            "score": 19,
                            "created_utc": 1594912849.0,
                            "replies": [
                                {
                                    "body": "Agreed on all of this.",
                                    "author": "mraspencer",
                                    "id": "fy9erje",
                                    "parent_id": "t1_fy9docm",
                                    "score": 2,
                                    "created_utc": 1594913388.0,
                                    "replies": []
                                },
                                {
                                    "body": "You're totally right. I hear the, \"oh I don't have a condom excuse all the time\". I figured he was just being a typical guy so it never registered to me as a red flag. The difference is with vanilla dates I would be at home or a place where I could get to some.",
                                    "author": "First_Baby",
                                    "id": "fy9prf6",
                                    "parent_id": "t1_fy9docm",
                                    "score": 2,
                                    "created_utc": 1594918714.0,
                                    "replies": [
                                        {
                                            "body": "Even if you had some on hand, that wouldn't have stopped him from taking it off without you knowing.\n\nThe guy you met is one of the jackasses that ruin sex (and by extension, dating/sugar dating) for everyone.",
                                            "author": "sdthrowaway006",
                                            "id": "fy9umyw",
                                            "parent_id": "t1_fy9prf6",
                                            "score": 2,
                                            "created_utc": 1594921021.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Great observation!!!",
                                    "author": "EMPOWER_not_enable",
                                    "id": "fy9fxdn",
                                    "parent_id": "t1_fy9docm",
                                    "score": 1,
                                    "created_utc": 1594913963.0,
                                    "replies": []
                                },
                                {
                                    "body": "Agreed.",
                                    "author": "sdthrowaway006",
                                    "id": "fy9lkqi",
                                    "parent_id": "t1_fy9docm",
                                    "score": 1,
                                    "created_utc": 1594916707.0,
                                    "replies": []
                                },
                                {
                                    "body": "Thank you for this post.",
                                    "author": null,
                                    "id": "fy9esrn",
                                    "parent_id": "t1_fy9docm",
                                    "score": 0,
                                    "created_utc": 1594913405.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "park first date in the Covid-times isn't a red flag\n\nNeither is intimacy on the first date post-M&G, that's actually rather standard in a PPM arrangement.\n\nDoesn't sound like the guy gave off any red flags at all, until he turned into an asshole during sex.",
                            "author": "mraspencer",
                            "id": "fy9dn53",
                            "parent_id": "t1_fy9bzaz",
                            "score": 3,
                            "created_utc": 1594912832.0,
                            "replies": [
                                {
                                    "body": "What does COVID have anything to do with this? I’m asking for you to think about the logic before answering....😇\n\nAnd how are you able to speak on a standard? I’m asking because if there’s a SA Center of Excellence that has published a report on standards of practice, let me know because I could learn from it.",
                                    "author": null,
                                    "id": "fy9e4sr",
                                    "parent_id": "t1_fy9dn53",
                                    "score": 0,
                                    "created_utc": 1594913077.0,
                                    "replies": [
                                        {
                                            "body": "Sure...M&G's are taking on different forms due to COVID restrictions. And a stroll in a public park is hardly a red flag. \n\nWhat about it IS a red flag to you? I'll ask you the same condescending question to think about the logic before answering.",
                                            "author": "mraspencer",
                                            "id": "fy9eclk",
                                            "parent_id": "t1_fy9e4sr",
                                            "score": 4,
                                            "created_utc": 1594913185.0,
                                            "replies": [
                                                {
                                                    "body": "Well, first when you threw in COVID restrictions I chuckled because a hotel was involved. So at that point, adherence to COVID restrictions is kinda irrelevant? \n\nSecond, you assumed I was stating her unfortunate situation was deemed a red flag situation. My statement about red flags was associated with the reason why I was asking (what could seem like a lot of questions). \n\nA horrible action caused by her SD and thank goodness she wasn’t a victim of physical harming or anything violent...I was trying to gain more insight to help (me) take precautionary measures by recognizing potential red flags.  \n\nCondescension directed at you, possibly? But I dislike it when people take my statements and misinterpret them before inquiring—it impedes good dialogue.",
                                                    "author": null,
                                                    "id": "fy9g4r0",
                                                    "parent_id": "t1_fy9eclk",
                                                    "score": -1,
                                                    "created_utc": 1594914064.0,
                                                    "replies": [
                                                        {
                                                            "body": "\"Condescending, possibly. But I dislike it when people take my statements and misinterpret them before inquiring—it impedes good dialogue.\"\n\nAnd you misinterpreted my statement as well.\n\nThe park and hotel are two separate dates, yes? They are independent of each other, or would you rather the M&G be at the hotel itself.\n\nMy mentioning of COVID is because it's hard to find places to sit inside, at least here there are none. Can't dine in anywhere. So where else would you like to conduct a M&G? A park is perfectly valid (and better than some options).",
                                                            "author": "mraspencer",
                                                            "id": "fy9gk4z",
                                                            "parent_id": "t1_fy9g4r0",
                                                            "score": 3,
                                                            "created_utc": 1594914274.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I think you’re projecting and amplifying a bit when it comes to meeting locations—again...you gotta try not to take positions that come off as your assuming vice inquiring. \n\nNo one said dining was not an option. YOU assumed that since she picked a park as a first meet up it was due to COVID. \n\nI’m all for having a healthy debate (probably not ideal in this very thread—it’s an unfortunate situation) but please for the love of pumpkin pie minimize the assumptions and taking a position based upon projecting....at least if/when you want to recreationally debate with me. 🥴😄 \n\nYours Truly,\nSG",
                                                                    "author": null,
                                                                    "id": "fy9i5ep",
                                                                    "parent_id": "t1_fy9gk4z",
                                                                    "score": 1,
                                                                    "created_utc": 1594915046.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I cannot answer this question since it is not only jurisdiction specific, but it also depends on a lot of other facts that should not be asked for or disclosed online.\n\nIf you would like to report this assault but are concerned about getting in legal trouble yourself, I would talk to a local attorney so you can get useful legal advice.\n\nMany of them offer short free consultations, or you could find a legal services clinic that offers free legal services.\n\nDo not file a police report without getting a legal opinion first - you do not want to self incriminate.",
            "author": "GDarn",
            "id": "fy9nqi1",
            "parent_id": "t1_fy9n9iz",
            "score": 14,
            "created_utc": 1594917745.0,
            "replies": [
                {
                    "body": "Of course. I know just who to call. Thank you.",
                    "author": "First_Baby",
                    "id": "fy9rkvs",
                    "parent_id": "t1_fy9nqi1",
                    "score": 6,
                    "created_utc": 1594919587.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s a really terrible experience. You’re vulnerable and try to trust someone you practically don’t know. And they fully take advantage of you. It’s fucking horrible.",
            "author": "wndrlnds",
            "id": "fy9tzmk",
            "parent_id": "t1_fy9ndhx",
            "score": 10,
            "created_utc": 1594920716.0,
            "replies": []
        },
        {
            "body": "I've talked to my doctor and I have an appointment lined up. Unfortunately, I can't go to the police in my area.",
            "author": "First_Baby",
            "id": "fy9zo65",
            "parent_id": "t1_fy9sgua",
            "score": 3,
            "created_utc": 1594923442.0,
            "replies": [
                {
                    "body": "Good because you should NOT get a rape kit at the police station anyways. They mess it up most of the time and also barely actually complete it, there are thousands of rape kits that have gone untested this way. ALWAYS go to the hospital ASAP for a rape kit (dont shower or wash your clothes). This is valuable information for everyone to know so I figured i would respond here for those that may need to know this info later",
                    "author": "bstractig",
                    "id": "fyaf56u",
                    "parent_id": "t1_fy9zo65",
                    "score": 4,
                    "created_utc": 1594930950.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It is 100% this guys fault.\n\nAt the same time, there are a lot of micro-interactions and signals that bad people and predators give off that are often missed by people with trauma history, and it’s good to recognize this.",
            "author": "garret6758",
            "id": "fyaeo47",
            "parent_id": "t1_fyadsuf",
            "score": 3,
            "created_utc": 1594930721.0,
            "replies": [
                {
                    "body": "Yes very true! Well put. You get used to it and become color blind. Trauma that isn’t healed or dealt with in a healthy manner- it internalizes and comes out in a disguise.",
                    "author": null,
                    "id": "fyaix98",
                    "parent_id": "t1_fyaeo47",
                    "score": 3,
                    "created_utc": 1594932739.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Until you talk to a few lawyers, get a rape kit (someone said wait but that is definitely wrong as you have to do it within 72 hours), take a full panel STD test, see your psychologist and doctor. Edit: I meant do all that before going to the police but then I remembered that the police have to order the rape kit.  \n\n\nI 100% agree if she was assaulted she should get a rape kit.\n\nIn this case, though, getting an immediate STD test is mostly pointless. Nothing incubates fast enough to show up that fast. \n\nWhat I was advocating on \"waiting\" for was the STD test.",
            "author": "marker3000",
            "id": "fyaxin5",
            "parent_id": "t1_fyadsuf",
            "score": 1,
            "created_utc": 1594940188.0,
            "replies": [
                {
                    "body": "oh ok my bad glad you saw this and corrected me.",
                    "author": null,
                    "id": "fyb12u5",
                    "parent_id": "t1_fyaxin5",
                    "score": 3,
                    "created_utc": 1594942149.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Interesting. Park first date, then hotel. I’m asking just to learn more about how to spot red flags in advance. \n\nEither way, he sounds like someone who can’t be trusted. You should void your arrangement and leave him alone.",
            "author": null,
            "id": "fy9bzaz",
            "parent_id": "t1_fy9b8wm",
            "score": 3,
            "created_utc": 1594911992.0,
            "replies": [
                {
                    "body": "It seems  u/first_baby did almost all the right things to vet this guy before the  intimate date.  \n\nWhen he claimed not to have condoms, that was a yellow flag.  When he magically came up with one when she made it clear she wouldn't go without protection that flag turned red.  By that time, she was in a very compromised situation and I'm sure it would have been difficult to walk out at that point.  This guy is a real creep and clearly knew what he was doing.  This is why stealthing should be sexual assault, but would be near impossible to prove in court.",
                    "author": "willfromvb",
                    "id": "fy9docm",
                    "parent_id": "t1_fy9bzaz",
                    "score": 19,
                    "created_utc": 1594912849.0,
                    "replies": [
                        {
                            "body": "Agreed on all of this.",
                            "author": "mraspencer",
                            "id": "fy9erje",
                            "parent_id": "t1_fy9docm",
                            "score": 2,
                            "created_utc": 1594913388.0,
                            "replies": []
                        },
                        {
                            "body": "You're totally right. I hear the, \"oh I don't have a condom excuse all the time\". I figured he was just being a typical guy so it never registered to me as a red flag. The difference is with vanilla dates I would be at home or a place where I could get to some.",
                            "author": "First_Baby",
                            "id": "fy9prf6",
                            "parent_id": "t1_fy9docm",
                            "score": 2,
                            "created_utc": 1594918714.0,
                            "replies": [
                                {
                                    "body": "Even if you had some on hand, that wouldn't have stopped him from taking it off without you knowing.\n\nThe guy you met is one of the jackasses that ruin sex (and by extension, dating/sugar dating) for everyone.",
                                    "author": "sdthrowaway006",
                                    "id": "fy9umyw",
                                    "parent_id": "t1_fy9prf6",
                                    "score": 2,
                                    "created_utc": 1594921021.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Great observation!!!",
                            "author": "EMPOWER_not_enable",
                            "id": "fy9fxdn",
                            "parent_id": "t1_fy9docm",
                            "score": 1,
                            "created_utc": 1594913963.0,
                            "replies": []
                        },
                        {
                            "body": "Agreed.",
                            "author": "sdthrowaway006",
                            "id": "fy9lkqi",
                            "parent_id": "t1_fy9docm",
                            "score": 1,
                            "created_utc": 1594916707.0,
                            "replies": []
                        },
                        {
                            "body": "Thank you for this post.",
                            "author": null,
                            "id": "fy9esrn",
                            "parent_id": "t1_fy9docm",
                            "score": 0,
                            "created_utc": 1594913405.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "park first date in the Covid-times isn't a red flag\n\nNeither is intimacy on the first date post-M&G, that's actually rather standard in a PPM arrangement.\n\nDoesn't sound like the guy gave off any red flags at all, until he turned into an asshole during sex.",
                    "author": "mraspencer",
                    "id": "fy9dn53",
                    "parent_id": "t1_fy9bzaz",
                    "score": 3,
                    "created_utc": 1594912832.0,
                    "replies": [
                        {
                            "body": "What does COVID have anything to do with this? I’m asking for you to think about the logic before answering....😇\n\nAnd how are you able to speak on a standard? I’m asking because if there’s a SA Center of Excellence that has published a report on standards of practice, let me know because I could learn from it.",
                            "author": null,
                            "id": "fy9e4sr",
                            "parent_id": "t1_fy9dn53",
                            "score": 0,
                            "created_utc": 1594913077.0,
                            "replies": [
                                {
                                    "body": "Sure...M&G's are taking on different forms due to COVID restrictions. And a stroll in a public park is hardly a red flag. \n\nWhat about it IS a red flag to you? I'll ask you the same condescending question to think about the logic before answering.",
                                    "author": "mraspencer",
                                    "id": "fy9eclk",
                                    "parent_id": "t1_fy9e4sr",
                                    "score": 4,
                                    "created_utc": 1594913185.0,
                                    "replies": [
                                        {
                                            "body": "Well, first when you threw in COVID restrictions I chuckled because a hotel was involved. So at that point, adherence to COVID restrictions is kinda irrelevant? \n\nSecond, you assumed I was stating her unfortunate situation was deemed a red flag situation. My statement about red flags was associated with the reason why I was asking (what could seem like a lot of questions). \n\nA horrible action caused by her SD and thank goodness she wasn’t a victim of physical harming or anything violent...I was trying to gain more insight to help (me) take precautionary measures by recognizing potential red flags.  \n\nCondescension directed at you, possibly? But I dislike it when people take my statements and misinterpret them before inquiring—it impedes good dialogue.",
                                            "author": null,
                                            "id": "fy9g4r0",
                                            "parent_id": "t1_fy9eclk",
                                            "score": -1,
                                            "created_utc": 1594914064.0,
                                            "replies": [
                                                {
                                                    "body": "\"Condescending, possibly. But I dislike it when people take my statements and misinterpret them before inquiring—it impedes good dialogue.\"\n\nAnd you misinterpreted my statement as well.\n\nThe park and hotel are two separate dates, yes? They are independent of each other, or would you rather the M&G be at the hotel itself.\n\nMy mentioning of COVID is because it's hard to find places to sit inside, at least here there are none. Can't dine in anywhere. So where else would you like to conduct a M&G? A park is perfectly valid (and better than some options).",
                                                    "author": "mraspencer",
                                                    "id": "fy9gk4z",
                                                    "parent_id": "t1_fy9g4r0",
                                                    "score": 3,
                                                    "created_utc": 1594914274.0,
                                                    "replies": [
                                                        {
                                                            "body": "I think you’re projecting and amplifying a bit when it comes to meeting locations—again...you gotta try not to take positions that come off as your assuming vice inquiring. \n\nNo one said dining was not an option. YOU assumed that since she picked a park as a first meet up it was due to COVID. \n\nI’m all for having a healthy debate (probably not ideal in this very thread—it’s an unfortunate situation) but please for the love of pumpkin pie minimize the assumptions and taking a position based upon projecting....at least if/when you want to recreationally debate with me. 🥴😄 \n\nYours Truly,\nSG",
                                                            "author": null,
                                                            "id": "fy9i5ep",
                                                            "parent_id": "t1_fy9gk4z",
                                                            "score": 1,
                                                            "created_utc": 1594915046.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Of course. I know just who to call. Thank you.",
            "author": "First_Baby",
            "id": "fy9rkvs",
            "parent_id": "t1_fy9nqi1",
            "score": 6,
            "created_utc": 1594919587.0,
            "replies": []
        },
        {
            "body": "Good because you should NOT get a rape kit at the police station anyways. They mess it up most of the time and also barely actually complete it, there are thousands of rape kits that have gone untested this way. ALWAYS go to the hospital ASAP for a rape kit (dont shower or wash your clothes). This is valuable information for everyone to know so I figured i would respond here for those that may need to know this info later",
            "author": "bstractig",
            "id": "fyaf56u",
            "parent_id": "t1_fy9zo65",
            "score": 4,
            "created_utc": 1594930950.0,
            "replies": []
        },
        {
            "body": "Yes very true! Well put. You get used to it and become color blind. Trauma that isn’t healed or dealt with in a healthy manner- it internalizes and comes out in a disguise.",
            "author": null,
            "id": "fyaix98",
            "parent_id": "t1_fyaeo47",
            "score": 3,
            "created_utc": 1594932739.0,
            "replies": []
        },
        {
            "body": "oh ok my bad glad you saw this and corrected me.",
            "author": null,
            "id": "fyb12u5",
            "parent_id": "t1_fyaxin5",
            "score": 3,
            "created_utc": 1594942149.0,
            "replies": []
        },
        {
            "body": "It seems  u/first_baby did almost all the right things to vet this guy before the  intimate date.  \n\nWhen he claimed not to have condoms, that was a yellow flag.  When he magically came up with one when she made it clear she wouldn't go without protection that flag turned red.  By that time, she was in a very compromised situation and I'm sure it would have been difficult to walk out at that point.  This guy is a real creep and clearly knew what he was doing.  This is why stealthing should be sexual assault, but would be near impossible to prove in court.",
            "author": "willfromvb",
            "id": "fy9docm",
            "parent_id": "t1_fy9bzaz",
            "score": 19,
            "created_utc": 1594912849.0,
            "replies": [
                {
                    "body": "Agreed on all of this.",
                    "author": "mraspencer",
                    "id": "fy9erje",
                    "parent_id": "t1_fy9docm",
                    "score": 2,
                    "created_utc": 1594913388.0,
                    "replies": []
                },
                {
                    "body": "You're totally right. I hear the, \"oh I don't have a condom excuse all the time\". I figured he was just being a typical guy so it never registered to me as a red flag. The difference is with vanilla dates I would be at home or a place where I could get to some.",
                    "author": "First_Baby",
                    "id": "fy9prf6",
                    "parent_id": "t1_fy9docm",
                    "score": 2,
                    "created_utc": 1594918714.0,
                    "replies": [
                        {
                            "body": "Even if you had some on hand, that wouldn't have stopped him from taking it off without you knowing.\n\nThe guy you met is one of the jackasses that ruin sex (and by extension, dating/sugar dating) for everyone.",
                            "author": "sdthrowaway006",
                            "id": "fy9umyw",
                            "parent_id": "t1_fy9prf6",
                            "score": 2,
                            "created_utc": 1594921021.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Great observation!!!",
                    "author": "EMPOWER_not_enable",
                    "id": "fy9fxdn",
                    "parent_id": "t1_fy9docm",
                    "score": 1,
                    "created_utc": 1594913963.0,
                    "replies": []
                },
                {
                    "body": "Agreed.",
                    "author": "sdthrowaway006",
                    "id": "fy9lkqi",
                    "parent_id": "t1_fy9docm",
                    "score": 1,
                    "created_utc": 1594916707.0,
                    "replies": []
                },
                {
                    "body": "Thank you for this post.",
                    "author": null,
                    "id": "fy9esrn",
                    "parent_id": "t1_fy9docm",
                    "score": 0,
                    "created_utc": 1594913405.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "park first date in the Covid-times isn't a red flag\n\nNeither is intimacy on the first date post-M&G, that's actually rather standard in a PPM arrangement.\n\nDoesn't sound like the guy gave off any red flags at all, until he turned into an asshole during sex.",
            "author": "mraspencer",
            "id": "fy9dn53",
            "parent_id": "t1_fy9bzaz",
            "score": 3,
            "created_utc": 1594912832.0,
            "replies": [
                {
                    "body": "What does COVID have anything to do with this? I’m asking for you to think about the logic before answering....😇\n\nAnd how are you able to speak on a standard? I’m asking because if there’s a SA Center of Excellence that has published a report on standards of practice, let me know because I could learn from it.",
                    "author": null,
                    "id": "fy9e4sr",
                    "parent_id": "t1_fy9dn53",
                    "score": 0,
                    "created_utc": 1594913077.0,
                    "replies": [
                        {
                            "body": "Sure...M&G's are taking on different forms due to COVID restrictions. And a stroll in a public park is hardly a red flag. \n\nWhat about it IS a red flag to you? I'll ask you the same condescending question to think about the logic before answering.",
                            "author": "mraspencer",
                            "id": "fy9eclk",
                            "parent_id": "t1_fy9e4sr",
                            "score": 4,
                            "created_utc": 1594913185.0,
                            "replies": [
                                {
                                    "body": "Well, first when you threw in COVID restrictions I chuckled because a hotel was involved. So at that point, adherence to COVID restrictions is kinda irrelevant? \n\nSecond, you assumed I was stating her unfortunate situation was deemed a red flag situation. My statement about red flags was associated with the reason why I was asking (what could seem like a lot of questions). \n\nA horrible action caused by her SD and thank goodness she wasn’t a victim of physical harming or anything violent...I was trying to gain more insight to help (me) take precautionary measures by recognizing potential red flags.  \n\nCondescension directed at you, possibly? But I dislike it when people take my statements and misinterpret them before inquiring—it impedes good dialogue.",
                                    "author": null,
                                    "id": "fy9g4r0",
                                    "parent_id": "t1_fy9eclk",
                                    "score": -1,
                                    "created_utc": 1594914064.0,
                                    "replies": [
                                        {
                                            "body": "\"Condescending, possibly. But I dislike it when people take my statements and misinterpret them before inquiring—it impedes good dialogue.\"\n\nAnd you misinterpreted my statement as well.\n\nThe park and hotel are two separate dates, yes? They are independent of each other, or would you rather the M&G be at the hotel itself.\n\nMy mentioning of COVID is because it's hard to find places to sit inside, at least here there are none. Can't dine in anywhere. So where else would you like to conduct a M&G? A park is perfectly valid (and better than some options).",
                                            "author": "mraspencer",
                                            "id": "fy9gk4z",
                                            "parent_id": "t1_fy9g4r0",
                                            "score": 3,
                                            "created_utc": 1594914274.0,
                                            "replies": [
                                                {
                                                    "body": "I think you’re projecting and amplifying a bit when it comes to meeting locations—again...you gotta try not to take positions that come off as your assuming vice inquiring. \n\nNo one said dining was not an option. YOU assumed that since she picked a park as a first meet up it was due to COVID. \n\nI’m all for having a healthy debate (probably not ideal in this very thread—it’s an unfortunate situation) but please for the love of pumpkin pie minimize the assumptions and taking a position based upon projecting....at least if/when you want to recreationally debate with me. 🥴😄 \n\nYours Truly,\nSG",
                                                    "author": null,
                                                    "id": "fy9i5ep",
                                                    "parent_id": "t1_fy9gk4z",
                                                    "score": 1,
                                                    "created_utc": 1594915046.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed on all of this.",
            "author": "mraspencer",
            "id": "fy9erje",
            "parent_id": "t1_fy9docm",
            "score": 2,
            "created_utc": 1594913388.0,
            "replies": []
        },
        {
            "body": "You're totally right. I hear the, \"oh I don't have a condom excuse all the time\". I figured he was just being a typical guy so it never registered to me as a red flag. The difference is with vanilla dates I would be at home or a place where I could get to some.",
            "author": "First_Baby",
            "id": "fy9prf6",
            "parent_id": "t1_fy9docm",
            "score": 2,
            "created_utc": 1594918714.0,
            "replies": [
                {
                    "body": "Even if you had some on hand, that wouldn't have stopped him from taking it off without you knowing.\n\nThe guy you met is one of the jackasses that ruin sex (and by extension, dating/sugar dating) for everyone.",
                    "author": "sdthrowaway006",
                    "id": "fy9umyw",
                    "parent_id": "t1_fy9prf6",
                    "score": 2,
                    "created_utc": 1594921021.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great observation!!!",
            "author": "EMPOWER_not_enable",
            "id": "fy9fxdn",
            "parent_id": "t1_fy9docm",
            "score": 1,
            "created_utc": 1594913963.0,
            "replies": []
        },
        {
            "body": "Agreed.",
            "author": "sdthrowaway006",
            "id": "fy9lkqi",
            "parent_id": "t1_fy9docm",
            "score": 1,
            "created_utc": 1594916707.0,
            "replies": []
        },
        {
            "body": "Thank you for this post.",
            "author": null,
            "id": "fy9esrn",
            "parent_id": "t1_fy9docm",
            "score": 0,
            "created_utc": 1594913405.0,
            "replies": []
        },
        {
            "body": "What does COVID have anything to do with this? I’m asking for you to think about the logic before answering....😇\n\nAnd how are you able to speak on a standard? I’m asking because if there’s a SA Center of Excellence that has published a report on standards of practice, let me know because I could learn from it.",
            "author": null,
            "id": "fy9e4sr",
            "parent_id": "t1_fy9dn53",
            "score": 0,
            "created_utc": 1594913077.0,
            "replies": [
                {
                    "body": "Sure...M&G's are taking on different forms due to COVID restrictions. And a stroll in a public park is hardly a red flag. \n\nWhat about it IS a red flag to you? I'll ask you the same condescending question to think about the logic before answering.",
                    "author": "mraspencer",
                    "id": "fy9eclk",
                    "parent_id": "t1_fy9e4sr",
                    "score": 4,
                    "created_utc": 1594913185.0,
                    "replies": [
                        {
                            "body": "Well, first when you threw in COVID restrictions I chuckled because a hotel was involved. So at that point, adherence to COVID restrictions is kinda irrelevant? \n\nSecond, you assumed I was stating her unfortunate situation was deemed a red flag situation. My statement about red flags was associated with the reason why I was asking (what could seem like a lot of questions). \n\nA horrible action caused by her SD and thank goodness she wasn’t a victim of physical harming or anything violent...I was trying to gain more insight to help (me) take precautionary measures by recognizing potential red flags.  \n\nCondescension directed at you, possibly? But I dislike it when people take my statements and misinterpret them before inquiring—it impedes good dialogue.",
                            "author": null,
                            "id": "fy9g4r0",
                            "parent_id": "t1_fy9eclk",
                            "score": -1,
                            "created_utc": 1594914064.0,
                            "replies": [
                                {
                                    "body": "\"Condescending, possibly. But I dislike it when people take my statements and misinterpret them before inquiring—it impedes good dialogue.\"\n\nAnd you misinterpreted my statement as well.\n\nThe park and hotel are two separate dates, yes? They are independent of each other, or would you rather the M&G be at the hotel itself.\n\nMy mentioning of COVID is because it's hard to find places to sit inside, at least here there are none. Can't dine in anywhere. So where else would you like to conduct a M&G? A park is perfectly valid (and better than some options).",
                                    "author": "mraspencer",
                                    "id": "fy9gk4z",
                                    "parent_id": "t1_fy9g4r0",
                                    "score": 3,
                                    "created_utc": 1594914274.0,
                                    "replies": [
                                        {
                                            "body": "I think you’re projecting and amplifying a bit when it comes to meeting locations—again...you gotta try not to take positions that come off as your assuming vice inquiring. \n\nNo one said dining was not an option. YOU assumed that since she picked a park as a first meet up it was due to COVID. \n\nI’m all for having a healthy debate (probably not ideal in this very thread—it’s an unfortunate situation) but please for the love of pumpkin pie minimize the assumptions and taking a position based upon projecting....at least if/when you want to recreationally debate with me. 🥴😄 \n\nYours Truly,\nSG",
                                            "author": null,
                                            "id": "fy9i5ep",
                                            "parent_id": "t1_fy9gk4z",
                                            "score": 1,
                                            "created_utc": 1594915046.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Even if you had some on hand, that wouldn't have stopped him from taking it off without you knowing.\n\nThe guy you met is one of the jackasses that ruin sex (and by extension, dating/sugar dating) for everyone.",
            "author": "sdthrowaway006",
            "id": "fy9umyw",
            "parent_id": "t1_fy9prf6",
            "score": 2,
            "created_utc": 1594921021.0,
            "replies": []
        },
        {
            "body": "Sure...M&G's are taking on different forms due to COVID restrictions. And a stroll in a public park is hardly a red flag. \n\nWhat about it IS a red flag to you? I'll ask you the same condescending question to think about the logic before answering.",
            "author": "mraspencer",
            "id": "fy9eclk",
            "parent_id": "t1_fy9e4sr",
            "score": 4,
            "created_utc": 1594913185.0,
            "replies": [
                {
                    "body": "Well, first when you threw in COVID restrictions I chuckled because a hotel was involved. So at that point, adherence to COVID restrictions is kinda irrelevant? \n\nSecond, you assumed I was stating her unfortunate situation was deemed a red flag situation. My statement about red flags was associated with the reason why I was asking (what could seem like a lot of questions). \n\nA horrible action caused by her SD and thank goodness she wasn’t a victim of physical harming or anything violent...I was trying to gain more insight to help (me) take precautionary measures by recognizing potential red flags.  \n\nCondescension directed at you, possibly? But I dislike it when people take my statements and misinterpret them before inquiring—it impedes good dialogue.",
                    "author": null,
                    "id": "fy9g4r0",
                    "parent_id": "t1_fy9eclk",
                    "score": -1,
                    "created_utc": 1594914064.0,
                    "replies": [
                        {
                            "body": "\"Condescending, possibly. But I dislike it when people take my statements and misinterpret them before inquiring—it impedes good dialogue.\"\n\nAnd you misinterpreted my statement as well.\n\nThe park and hotel are two separate dates, yes? They are independent of each other, or would you rather the M&G be at the hotel itself.\n\nMy mentioning of COVID is because it's hard to find places to sit inside, at least here there are none. Can't dine in anywhere. So where else would you like to conduct a M&G? A park is perfectly valid (and better than some options).",
                            "author": "mraspencer",
                            "id": "fy9gk4z",
                            "parent_id": "t1_fy9g4r0",
                            "score": 3,
                            "created_utc": 1594914274.0,
                            "replies": [
                                {
                                    "body": "I think you’re projecting and amplifying a bit when it comes to meeting locations—again...you gotta try not to take positions that come off as your assuming vice inquiring. \n\nNo one said dining was not an option. YOU assumed that since she picked a park as a first meet up it was due to COVID. \n\nI’m all for having a healthy debate (probably not ideal in this very thread—it’s an unfortunate situation) but please for the love of pumpkin pie minimize the assumptions and taking a position based upon projecting....at least if/when you want to recreationally debate with me. 🥴😄 \n\nYours Truly,\nSG",
                                    "author": null,
                                    "id": "fy9i5ep",
                                    "parent_id": "t1_fy9gk4z",
                                    "score": 1,
                                    "created_utc": 1594915046.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well, first when you threw in COVID restrictions I chuckled because a hotel was involved. So at that point, adherence to COVID restrictions is kinda irrelevant? \n\nSecond, you assumed I was stating her unfortunate situation was deemed a red flag situation. My statement about red flags was associated with the reason why I was asking (what could seem like a lot of questions). \n\nA horrible action caused by her SD and thank goodness she wasn’t a victim of physical harming or anything violent...I was trying to gain more insight to help (me) take precautionary measures by recognizing potential red flags.  \n\nCondescension directed at you, possibly? But I dislike it when people take my statements and misinterpret them before inquiring—it impedes good dialogue.",
            "author": null,
            "id": "fy9g4r0",
            "parent_id": "t1_fy9eclk",
            "score": -1,
            "created_utc": 1594914064.0,
            "replies": [
                {
                    "body": "\"Condescending, possibly. But I dislike it when people take my statements and misinterpret them before inquiring—it impedes good dialogue.\"\n\nAnd you misinterpreted my statement as well.\n\nThe park and hotel are two separate dates, yes? They are independent of each other, or would you rather the M&G be at the hotel itself.\n\nMy mentioning of COVID is because it's hard to find places to sit inside, at least here there are none. Can't dine in anywhere. So where else would you like to conduct a M&G? A park is perfectly valid (and better than some options).",
                    "author": "mraspencer",
                    "id": "fy9gk4z",
                    "parent_id": "t1_fy9g4r0",
                    "score": 3,
                    "created_utc": 1594914274.0,
                    "replies": [
                        {
                            "body": "I think you’re projecting and amplifying a bit when it comes to meeting locations—again...you gotta try not to take positions that come off as your assuming vice inquiring. \n\nNo one said dining was not an option. YOU assumed that since she picked a park as a first meet up it was due to COVID. \n\nI’m all for having a healthy debate (probably not ideal in this very thread—it’s an unfortunate situation) but please for the love of pumpkin pie minimize the assumptions and taking a position based upon projecting....at least if/when you want to recreationally debate with me. 🥴😄 \n\nYours Truly,\nSG",
                            "author": null,
                            "id": "fy9i5ep",
                            "parent_id": "t1_fy9gk4z",
                            "score": 1,
                            "created_utc": 1594915046.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"Condescending, possibly. But I dislike it when people take my statements and misinterpret them before inquiring—it impedes good dialogue.\"\n\nAnd you misinterpreted my statement as well.\n\nThe park and hotel are two separate dates, yes? They are independent of each other, or would you rather the M&G be at the hotel itself.\n\nMy mentioning of COVID is because it's hard to find places to sit inside, at least here there are none. Can't dine in anywhere. So where else would you like to conduct a M&G? A park is perfectly valid (and better than some options).",
            "author": "mraspencer",
            "id": "fy9gk4z",
            "parent_id": "t1_fy9g4r0",
            "score": 3,
            "created_utc": 1594914274.0,
            "replies": [
                {
                    "body": "I think you’re projecting and amplifying a bit when it comes to meeting locations—again...you gotta try not to take positions that come off as your assuming vice inquiring. \n\nNo one said dining was not an option. YOU assumed that since she picked a park as a first meet up it was due to COVID. \n\nI’m all for having a healthy debate (probably not ideal in this very thread—it’s an unfortunate situation) but please for the love of pumpkin pie minimize the assumptions and taking a position based upon projecting....at least if/when you want to recreationally debate with me. 🥴😄 \n\nYours Truly,\nSG",
                    "author": null,
                    "id": "fy9i5ep",
                    "parent_id": "t1_fy9gk4z",
                    "score": 1,
                    "created_utc": 1594915046.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think you’re projecting and amplifying a bit when it comes to meeting locations—again...you gotta try not to take positions that come off as your assuming vice inquiring. \n\nNo one said dining was not an option. YOU assumed that since she picked a park as a first meet up it was due to COVID. \n\nI’m all for having a healthy debate (probably not ideal in this very thread—it’s an unfortunate situation) but please for the love of pumpkin pie minimize the assumptions and taking a position based upon projecting....at least if/when you want to recreationally debate with me. 🥴😄 \n\nYours Truly,\nSG",
            "author": null,
            "id": "fy9i5ep",
            "parent_id": "t1_fy9gk4z",
            "score": 1,
            "created_utc": 1594915046.0,
            "replies": []
        }
    ]
}