{
    "title": "I’m Tired of The “SB” YouTubers",
    "post_id": "m23ovv",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/m23ovv/im_tired_of_the_sb_youtubers/",
    "author": "messybootski",
    "body": "So I find it really interesting how these self-proclaimed SB YouTubers try so hard to make it seem like they live this glamorous SB lifestyle without providing any sugar. There are two that really come to mind, both are based out of Dallas, TX for those who may have watched their videos. One is clearly a woman who has a history of escorting (which there is nothing wrong with that at all!) and she also seems to provide “sensual massages” to her “clients” who she also claims are her SDs. She disguises these behaviors as a SB lifestyle and shares a variety of digital content and “coaching calls” for girls who want to be “successful SBs” like her. I just think it’s so lame to sell content and basically boast that your content will help girls secure a good SR when in reality what she really does isn’t sugaring at all. I’m very tired of the “finesse these old worthless men” type content on YouTube. I think there’s so many people out there who just really don’t understand how a SR is supposed to work. These content creators just give off a very slut-shaming type of energy when they act like they never had to do anything sexual with their “SDs” and I just think it’s so lame. Especially with the influx of young and possibly naive women who are attracted to the sugar lifestyle as it is heavily glorified. I think it’s harmful to act like sexual intimacy is not required at all. When promoting or discussing a SR these creators should be honest about how most SRs will not be platonic and will indeed involve intimacy but obviously at the discretion of the adults involved. Feeding their viewers fantasies about plantonic arrangements when they are possibly being intimate with their SDs is just so problematic to me.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/m23ovv/im_tired_of_the_sb_youtubers/",
    "score": 113,
    "upvote_ratio": 0.93,
    "created_utc": 1615398698.0,
    "num_comments": 80,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Yeah I feel you, I follow this one youtuber who has great tips on simple things like how to be your best most feminine self and relationship discussions and stuff. I have felt this way for a while also as she’s always saying things that sound kind of slut “shame-y” lol. Basically stating how she hasn’t EVER slept with an SD and how if other women feel that they want to thats “fine” but it’s just not what she “gives up easily”. Now I’m all for makin em “sweat” you at least a little bit before having sex but to truly act like you are getting your rent paid, and expensive gifts and the whole 9 yards just because you’re “cute” is kind of misleading TO ME. But to each their own I just feel like most of these SD’s are not foolish with their money and shouldn’t be treated as such.",
            "author": "sheabutterbunny",
            "id": "gqh5f54",
            "parent_id": "t3_m23ovv",
            "score": 27,
            "created_utc": 1615400875.0,
            "replies": [
                {
                    "body": "Is it Fancy? Haha",
                    "author": "messybootski",
                    "id": "gqhlkf7",
                    "parent_id": "t1_gqh5f54",
                    "score": 2,
                    "created_utc": 1615407592.0,
                    "replies": [
                        {
                            "body": "Lol suppose soo!",
                            "author": "sheabutterbunny",
                            "id": "gqhslle",
                            "parent_id": "t1_gqhlkf7",
                            "score": 2,
                            "created_utc": 1615410592.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think there are some SDs who are still into very old-school, arm candy style of sugaring where you do get paid for being cute. But that's getting rarer and rarer because it is very old school.  \n\n\nedit to add: and this is likely because the world used to be more slut shamey so those traditional values are still in place for some people. I imagine there are more older SDs who are like this - partially low libido, partially those older values.",
                    "author": "hopefulcaterpiller",
                    "id": "gqi5a9b",
                    "parent_id": "t1_gqh5f54",
                    "score": 6,
                    "created_utc": 1615416336.0,
                    "replies": [
                        {
                            "body": "To be honest I would bet that a lot of those “traditional” men just have erectile dysfunction.",
                            "author": "thebestrosie",
                            "id": "gqi8yk4",
                            "parent_id": "t1_gqi5a9b",
                            "score": 18,
                            "created_utc": 1615418149.0,
                            "replies": [
                                {
                                    "body": "That could also be the case too!",
                                    "author": "sheabutterbunny",
                                    "id": "gqiedeh",
                                    "parent_id": "t1_gqi8yk4",
                                    "score": 2,
                                    "created_utc": 1615420940.0,
                                    "replies": []
                                },
                                {
                                    "body": "Maybe? \n\nI really don't mind either way and I don't see why anyone else should either. It doesn't really matter. ED is only a problem if someone is distressed by it - and if a man isn't distressed by it, and a SB isn't distressed by it, then what's the issue? \n\nTraditional or has ED - it's all the same to me! Haha , and if couching it in being traditional protects their feelings then I don't see any reason not to. It's not harming anyone I don't think?\n\nED is quite common so I guess if girls are looking for platonic arrangements they really should consider looking for that in older men.",
                                    "author": "hopefulcaterpiller",
                                    "id": "gqif0f3",
                                    "parent_id": "t1_gqi8yk4",
                                    "score": 0,
                                    "created_utc": 1615421283.0,
                                    "replies": []
                                },
                                {
                                    "body": "Or maybe they can appreciate the sheer beauty of young women and dont have fixed goals in mind",
                                    "author": "djvinc",
                                    "id": "gqiljnb",
                                    "parent_id": "t1_gqi8yk4",
                                    "score": -1,
                                    "created_utc": 1615424776.0,
                                    "replies": []
                                },
                                {
                                    "body": "Lmao",
                                    "author": "Purplecrumpet7",
                                    "id": "gqis235",
                                    "parent_id": "t1_gqi8yk4",
                                    "score": 1,
                                    "created_utc": 1615428147.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I can understand that and Im sure it’s not in the least bit prevalent considering the age we are now in. But wow such gems!🥺",
                            "author": "sheabutterbunny",
                            "id": "gqieb38",
                            "parent_id": "t1_gqi5a9b",
                            "score": 1,
                            "created_utc": 1615420905.0,
                            "replies": [
                                {
                                    "body": "Yeah, times have changed! That's come with positives and negatives. I agree, definitely gems!",
                                    "author": "hopefulcaterpiller",
                                    "id": "gqif8nd",
                                    "parent_id": "t1_gqieb38",
                                    "score": 2,
                                    "created_utc": 1615421404.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I had one arrangement that didn't actually involve penetrative sex and honestly it was the most exhausting and weird setup I've ever had. He had a couple of ppm escorts he would occasionally visit but he'd take me between states, we'd get hotels, I'd work in strip clubs (he'd stop in and buy dances sometimes and throw money at me to get other dudes to throw money too) and then me and him would go to restaurants, or spas, I'd give him dances in the hotel, etc.   \nI made more than the ppm escorts did, and all the perks were great and super fun for me at the time (I was like 22 lol) but honestly I spent so much emotional energy and so much time with him that I burned out super hard, and I basically had no boundaries because since I wasn't giving him sex, he expected WAY more from me on every other level.  I also felt too uncomfortable to really negotiate what he was paying me since I wasn't giving him sex.\n\nI'm also lucky because he was a really great dude and he was fun to be around and wasn't keen on trying to take advantage of me but I could've ended up in a way worse situation tbh.",
            "author": "ColdHeaux",
            "id": "gqi5ulm",
            "parent_id": "t3_m23ovv",
            "score": 11,
            "created_utc": 1615416613.0,
            "replies": [
                {
                    "body": "I think just straight up sugar relationships are easier to navigate tbh.",
                    "author": "ColdHeaux",
                    "id": "gqi5vou",
                    "parent_id": "t1_gqi5ulm",
                    "score": 3,
                    "created_utc": 1615416628.0,
                    "replies": []
                },
                {
                    "body": "I had a very similar scenario. He helped me a lot, but had serious issues and I'm probably traumatized from it and need therapy. Like most actual platonic arrangements it wasn't my choice or preference to be platonic. \n\nReally people should strive to add value in people's lives, not try to avoid it while reaping the benefits because they have hang ups about what it entails on their end. Traditional SRs are simpler because people are honest about what will add value.",
                    "author": "devslashmodelSB",
                    "id": "gqj3ewk",
                    "parent_id": "t1_gqi5ulm",
                    "score": 1,
                    "created_utc": 1615434285.0,
                    "replies": [
                        {
                            "body": "I'm sorry you need therapy- I definitely don't think my arrangement was traumatic, just kind of exhausting. I think experiences as a stripper in the champagne room were much more traumatizing tbh.",
                            "author": "ColdHeaux",
                            "id": "gqj8ohd",
                            "parent_id": "t1_gqj3ewk",
                            "score": 1,
                            "created_utc": 1615437619.0,
                            "replies": [
                                {
                                    "body": "I mean, he was a great guy so no real regrets. Just a lot of mental health issues he didn't want to get help for. And I can only imagine what kind of stuff goes on there :(",
                                    "author": "devslashmodelSB",
                                    "id": "gqj94ju",
                                    "parent_id": "t1_gqj8ohd",
                                    "score": 2,
                                    "created_utc": 1615437899.0,
                                    "replies": [
                                        {
                                            "body": "I mean most of it is fine- it's just the once-in-a-while that you have to watch out for. Also, it really depends on the club. Some bouncers/manangers go to bat for you, some clubs will fire you for getting assaulted essentially.",
                                            "author": "ColdHeaux",
                                            "id": "gqja9ko",
                                            "parent_id": "t1_gqj94ju",
                                            "score": 3,
                                            "created_utc": 1615438685.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ive never really come across these SD scammy videos so I did a search and the found multiple results from a girl called \"K Celyce\".  I was shocked - it was actually very good, very accurate and quite funny.   I almost subscribed !",
            "author": "lookingforlaughter",
            "id": "gqhjked",
            "parent_id": "t3_m23ovv",
            "score": 8,
            "created_utc": 1615406726.0,
            "replies": [
                {
                    "body": "Just watched one of her videos where she explains what types of women shouldn't be SB's and actually tells them to look for something else. It's certainly refreshing, compared to all those who just want to sell an unrealistic dream.",
                    "author": "MyIncognitoMe",
                    "id": "gqibci7",
                    "parent_id": "t1_gqhjked",
                    "score": 7,
                    "created_utc": 1615419354.0,
                    "replies": []
                },
                {
                    "body": "When i didnt know about reddit yet I went to youtube to look for advices about SR and i saw her account. Yes she’s really funny and very helpful. I subscribed!",
                    "author": "slimshLady00",
                    "id": "gqkwf00",
                    "parent_id": "t1_gqhjked",
                    "score": 1,
                    "created_utc": 1615475846.0,
                    "replies": []
                },
                {
                    "body": "Based on the advice she gives being very similar to what i’ve read on this forum, I would definitely recommend any new SBs to check out her videos!",
                    "author": "Gee_n_tonic",
                    "id": "gql7yjd",
                    "parent_id": "t1_gqhjked",
                    "score": 1,
                    "created_utc": 1615481025.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "tinderme: have SB1 whose schedule doesn't mesh with mine often enough, looking for sb2. etc...  \nher: sure I'll be sb2!  \nme: up for a public meet and greet in the next week or 2?  \nher: yes as long as i can make a little money before then. my car insurance is due this weekend  \nme: did you get that from a tiktok SB or a youtube SB? we get a few new to sugar that move from online only to real SBs after they get scammed by a guy who reverse charges them...  \n\\*unmatched\\*\n\nlol",
            "author": "bluelunarmonkey",
            "id": "gqh5qmc",
            "parent_id": "t3_m23ovv",
            "score": 19,
            "created_utc": 1615400998.0,
            "replies": []
        },
        {
            "body": "it’s harmful to act like sexual intimacy is not required at all.\n\nThe thing is,they will all fail and will either bite the bullet and start giving sugar or disappear.",
            "author": "GSSD",
            "id": "gqh46nj",
            "parent_id": "t3_m23ovv",
            "score": 11,
            "created_utc": 1615400394.0,
            "replies": []
        },
        {
            "body": "<3 absolutely correct, very frustrating. I've been told about this happening on tiktok and from this apparently also youtube?   \n\n\nhonestly unacceptable. I think it's part of people just becoming very disrespectful in relationships in general and then bringing that into sugaring. using and abusing people - on both ends - just seems to happen so much these days. Or at least, it's a lot of what I hear about.   \n\n\nUgh, honestly very immature and selfish way to view any relationship - nevermind sugaring.",
            "author": "hopefulcaterpiller",
            "id": "gqi569c",
            "parent_id": "t3_m23ovv",
            "score": 4,
            "created_utc": 1615416281.0,
            "replies": []
        },
        {
            "body": "YESSSSSSSSSS!!!!!!! 1000000X YES!! I watched one woman who, in one video, claimed she hated sleeping with her first SD and said a lot of mean shit about how gross it was sleeping with an old man and then, in a later video, claimed she NEVER slept with a SD.\n\nShe was also heavy on the slut shaming...saying stuff like, \"Nothing against prostitutes, but ladies, dont lower your self and give up your dignity by sleeping with a SD.\" Which is it? You can't say \"nothing against prostitutes\" while also claiming they are \"lowering themselves.\" Also, speak for yourself...I have NEVER, not once, felt I lost an ounce of dignity by engaging in an intimate SR for money. Hell, the fact that a man is willing to pay to be with me is one of the most validating experiences ever.",
            "author": "Pixie_Lizard",
            "id": "gqj2tbx",
            "parent_id": "t3_m23ovv",
            "score": 4,
            "created_utc": 1615433954.0,
            "replies": []
        },
        {
            "body": "Glad I’m not the only one who thought SB youtubers were dishonest af.",
            "author": "hillmechanics",
            "id": "gqh55sr",
            "parent_id": "t3_m23ovv",
            "score": 7,
            "created_utc": 1615400776.0,
            "replies": []
        },
        {
            "body": "Most of them aren’t really SB, they just scamming and don’t even know it lol.",
            "author": "Queen_sandy619",
            "id": "gqi147f",
            "parent_id": "t3_m23ovv",
            "score": 3,
            "created_utc": 1615414352.0,
            "replies": []
        },
        {
            "body": "What are their YouTube channels out of curiosity",
            "author": "Spray_Swimming",
            "id": "gqhckpb",
            "parent_id": "t3_m23ovv",
            "score": 2,
            "created_utc": 1615403770.0,
            "replies": [
                {
                    "body": "Meelizjah is the one with “clients” and Viva La Fancy is much better but comes off as slut-shamey af.",
                    "author": "messybootski",
                    "id": "gqhke4w",
                    "parent_id": "t1_gqhckpb",
                    "score": 4,
                    "created_utc": 1615407086.0,
                    "replies": [
                        {
                            "body": "They both come off as ghetto",
                            "author": "Spray_Swimming",
                            "id": "gqhkmxa",
                            "parent_id": "t1_gqhke4w",
                            "score": 1,
                            "created_utc": 1615407192.0,
                            "replies": [
                                {
                                    "body": "We still calling people ghetto?",
                                    "author": "oneangstybiscuit",
                                    "id": "gqihago",
                                    "parent_id": "t1_gqhkmxa",
                                    "score": 4,
                                    "created_utc": 1615422487.0,
                                    "replies": []
                                },
                                {
                                    "body": "Lol how so?",
                                    "author": "messybootski",
                                    "id": "gqhnl2d",
                                    "parent_id": "t1_gqhkmxa",
                                    "score": 1,
                                    "created_utc": 1615408456.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "These ‘extra curricular activities’ that she is missing out on.... booo!",
                            "author": "SnooDucks4705",
                            "id": "gqibi1m",
                            "parent_id": "t1_gqhke4w",
                            "score": 1,
                            "created_utc": 1615419433.0,
                            "replies": []
                        },
                        {
                            "body": "Or Callikoa on TikTok",
                            "author": "KnottySexAcct",
                            "id": "gqjmepe",
                            "parent_id": "t1_gqhke4w",
                            "score": 1,
                            "created_utc": 1615445927.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Right?? I want to see some of them.  I always hear about it.",
                    "author": "redeye87",
                    "id": "gqhjt3i",
                    "parent_id": "t1_gqhckpb",
                    "score": 2,
                    "created_utc": 1615406831.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Anyone one social media will do anything to get subscribers eg that idiot who calls out ufc fighters",
            "author": "wb19081908",
            "id": "gqhx47o",
            "parent_id": "t3_m23ovv",
            "score": 2,
            "created_utc": 1615412565.0,
            "replies": []
        },
        {
            "body": "That's a good point and I agree. There is probably like .1% of platonic SR 🙄 What a crock lol",
            "author": null,
            "id": "gqi13g0",
            "parent_id": "t3_m23ovv",
            "score": 2,
            "created_utc": 1615414341.0,
            "replies": []
        },
        {
            "body": "Preachhhhh they are such liars that they don’t give up the sugar and still get “fabulously” paid 🙄",
            "author": "yourvalentine14",
            "id": "gqi5nox",
            "parent_id": "t3_m23ovv",
            "score": 2,
            "created_utc": 1615416520.0,
            "replies": []
        },
        {
            "body": "Its advertising man. Because of these (and other) social media workers, girls sign up for seeking, and some percentage of them become real SBs.  Sure, it would be nice if we could get females to sign up without the shenanigans, but that's advertising. You see the same thing with every product under the sun**.  Burger joints \"shaming\" their rivals products; trucks being sold to insecure men, etc...  All advertising is lies, and it works.  The alternative to these youtubers is not a paradise of perfect profiles; its **no one** signing up to be a sb, a death spiral ending with no subscribers online, and we all go back to freestyling (i.e., extremely limited options, and massive waste of time).\n#\n**The one exception being Giordano's. They are just being honest. Pizza is not supposed to look like used toilet paper. I want meat and cheese man; the bread is basically just the plate my food comes on. If you call toast and sauce \"pizza\" than you should be very, very ashamed of yourself.",
            "author": "TastySpermDispenser",
            "id": "gqh3ktm",
            "parent_id": "t3_m23ovv",
            "score": 6,
            "created_utc": 1615400159.0,
            "replies": [
                {
                    "body": "Omg man, I just can't. Were you raised under a rock? The right crust is essential to a good pizza.",
                    "author": "ChapterRelative",
                    "id": "gqhbpkg",
                    "parent_id": "t1_gqh3ktm",
                    "score": 8,
                    "created_utc": 1615403415.0,
                    "replies": [
                        {
                            "body": "Lol, found the toast lover. :)",
                            "author": "TastySpermDispenser",
                            "id": "gqi3gbv",
                            "parent_id": "t1_gqhbpkg",
                            "score": 3,
                            "created_utc": 1615415456.0,
                            "replies": [
                                {
                                    "body": "Sitting here, realizing that my M&G for the evening with an actual real life 22yo soccer chick (I have a fetish for soccer chicks) isn't going to happen because, in all likelihood, she was one of those TikTokers convinced that  I'd throw her some pizza money without slipping her some meat along with the dough, I have zero patience for your desire for institutional mass-market pizza made with meat from cans and cheese from plastic bags. \n\nAs opposed to real pizza.\n\nAlthough, if you're going to eat pizza in the US might as well go Chicago style.",
                                    "author": "ChapterRelative",
                                    "id": "gqi79xh",
                                    "parent_id": "t1_gqi3gbv",
                                    "score": 4,
                                    "created_utc": 1615417309.0,
                                    "replies": [
                                        {
                                            "body": "You lost me with the analogy lol",
                                            "author": "oneangstybiscuit",
                                            "id": "gqihjpj",
                                            "parent_id": "t1_gqi79xh",
                                            "score": 3,
                                            "created_utc": 1615422624.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I agree with that, but if the toppings aren’t good it doesn’t matter what the crust is like",
                            "author": null,
                            "id": "gqi6tz3",
                            "parent_id": "t1_gqhbpkg",
                            "score": 1,
                            "created_utc": 1615417092.0,
                            "replies": [
                                {
                                    "body": "I know a place where they pick the mushrooms wild that morning and shave the cheese off the block right onto the dough. Yes indeed, the toppings need to be the best.",
                                    "author": "ChapterRelative",
                                    "id": "gqi7k1s",
                                    "parent_id": "t1_gqi6tz3",
                                    "score": 1,
                                    "created_utc": 1615417450.0,
                                    "replies": [
                                        {
                                            "body": "Wow where is that?",
                                            "author": null,
                                            "id": "gqi8068",
                                            "parent_id": "t1_gqi7k1s",
                                            "score": 1,
                                            "created_utc": 1615417673.0,
                                            "replies": [
                                                {
                                                    "body": "In Arsiè Italy.",
                                                    "author": "ChapterRelative",
                                                    "id": "gqi8ge1",
                                                    "parent_id": "t1_gqi8068",
                                                    "score": 1,
                                                    "created_utc": 1615417898.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don’t think they’ll deliver over here so I’ll have to keep it in mind if I ever go there. With all the trendy farm to table restaurants nowadays you’d think there would be a us based one that does something like that too",
                                                            "author": null,
                                                            "id": "gqi9aav",
                                                            "parent_id": "t1_gqi8ge1",
                                                            "score": 1,
                                                            "created_utc": 1615418312.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks for your honesty.  There are some non sexual arrangements though.  The guy I’m talking to is 20 something years older than me and says he’s looking for companionship not sex.  So I do think you can find it but they will probably be older.",
            "author": "Greenapplehoneybun",
            "id": "gqj1xxc",
            "parent_id": "t3_m23ovv",
            "score": 1,
            "created_utc": 1615433478.0,
            "replies": [
                {
                    "body": "Chances are Hes a scammer.",
                    "author": "Fun_Focus8159",
                    "id": "gqj9e9c",
                    "parent_id": "t1_gqj1xxc",
                    "score": 3,
                    "created_utc": 1615438081.0,
                    "replies": [
                        {
                            "body": "What is the scam?  Can you give me some ideas?  I’m new to this so I honestly want to know.  Thanks.",
                            "author": "Greenapplehoneybun",
                            "id": "grebdri",
                            "parent_id": "t1_gqj9e9c",
                            "score": 1,
                            "created_utc": 1616095011.0,
                            "replies": [
                                {
                                    "body": "A lot of scammers pose as platonic SD’s and will start asking you for money to verify yourself.",
                                    "author": "Fun_Focus8159",
                                    "id": "gredxan",
                                    "parent_id": "t1_grebdri",
                                    "score": 1,
                                    "created_utc": 1616096237.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You didn’t find anything. You haven’t met him yet. Probably a scammer or liar.",
                    "author": "new_sd_acct",
                    "id": "gqjfff6",
                    "parent_id": "t1_gqj1xxc",
                    "score": 1,
                    "created_utc": 1615441672.0,
                    "replies": []
                },
                {
                    "body": "I mean they certainly exist but they probably won’t last very long or your “allowance” will be relatively low.",
                    "author": "messybootski",
                    "id": "gqk3w2l",
                    "parent_id": "t1_gqj1xxc",
                    "score": 0,
                    "created_utc": 1615458424.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Let me add, since people want to be willfully obtuse that I clearly understand that there are some SRs that don’t involve sexual intimacy. Lol, do you think I haven’t ever had a man spoil me and give me money without being intimate with him? You’re sadly mistaken. My current SD not only gave me a hefty amount of money but also spent a very large amount of money on me before we even moved to intimacy so PLEASE save the pretentious “some women just know how to get it without intimacy” cause assuming definitely makes an ass out of you and me lol. Even as a SB that has had a platonic arrangement before I refuse to stand on some high horse and look down upon other women who’s SRs involved intimacy. Way to support women some of you, NOT! However that’s not the point I was making. My point is that it’s not going to happen for the vast majority of SBs out there. I believe that MOST SDs are not going to throw thousands of dollars at a woman and not expect some form sexual intimacy in return whether it be penetrative or just oral sex. This is a hill I will die on. Of course there are SDs out there who just really need companionship and will pay for that without intimacy being required DUHHHH but for these YouTubers to basically insinuate that you’re a disgusting, low-value slut if you decide to be intimate with your SD is problematic to me and that’s the only point I was trying to make. Especially when they are clearly lying to their viewers about never being intimate with their SD themselves. Sex is also never “required” unless two consenting parties agree.",
            "author": "messybootski",
            "id": "gqk0wsy",
            "parent_id": "t3_m23ovv",
            "score": 1,
            "created_utc": 1615456175.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gqj47mb",
            "parent_id": "t3_m23ovv",
            "score": 0,
            "created_utc": 1615434807.0,
            "replies": [
                {
                    "body": "Please shut up.",
                    "author": "heyjam1",
                    "id": "gqjb5q5",
                    "parent_id": "t1_gqj47mb",
                    "score": 1,
                    "created_utc": 1615439287.0,
                    "replies": []
                },
                {
                    "body": "i agree",
                    "author": "hiiItshelen",
                    "id": "gqjfcgy",
                    "parent_id": "t1_gqj47mb",
                    "score": 1,
                    "created_utc": 1615441627.0,
                    "replies": []
                },
                {
                    "body": "You missed the point so hard lol",
                    "author": "messybootski",
                    "id": "gqk15sx",
                    "parent_id": "t1_gqj47mb",
                    "score": 1,
                    "created_utc": 1615456388.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gqhv6am",
            "parent_id": "t3_m23ovv",
            "score": -2,
            "created_utc": 1615411723.0,
            "replies": [
                {
                    "body": "That would be a hard pass for me. Arrangement websites exist to bypass pretending you are hard to get.",
                    "author": "redstone24",
                    "id": "gqiidhi",
                    "parent_id": "t1_gqhv6am",
                    "score": 5,
                    "created_utc": 1615423072.0,
                    "replies": []
                },
                {
                    "body": "That's a recipe for never having a fulfilling relationship.",
                    "author": "whatever-tata",
                    "id": "gqidooe",
                    "parent_id": "t1_gqhv6am",
                    "score": 3,
                    "created_utc": 1615420579.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gqiio2t",
                            "parent_id": "t1_gqidooe",
                            "score": -1,
                            "created_utc": 1615423234.0,
                            "replies": [
                                {
                                    "body": "Might I suggest that you try and find other SDs? If you have to do that then it might take a huge mental or emotional toll on you over time. I promise there are SDs out there that you will find attractive in at least one way or another, and SDs that actually value you more because you enjoy sex. I'm an SB that has a high sex drive and my SD actually likes me more for it :)",
                                    "author": "galactosegirl",
                                    "id": "gqivmad",
                                    "parent_id": "t1_gqiio2t",
                                    "score": 3,
                                    "created_utc": 1615430015.0,
                                    "replies": []
                                },
                                {
                                    "body": "It's a peculiar masochistic Rube Goldberg thinking to relationships, where if you do this, then he we will do this, and then you'll do this, and he'll do that, and then you will have sex and little does he know you want it as much as him. Why not cut out all that crap and just embrace the fact that you enjoy sex just as much and just ... enjoy it. My best relationship was like that, we had sex everyday for over a year, never fought or argued, enjoyed the great outdoors together as much as possible, etc. You are just depriving yourself of enjoyment, complicating relationships, and playing games for what, to honor the craft of your ancestors?! You must be kidding...",
                                    "author": "whatever-tata",
                                    "id": "gqjo0yh",
                                    "parent_id": "t1_gqiio2t",
                                    "score": 1,
                                    "created_utc": 1615446951.0,
                                    "replies": [
                                        {
                                            "body": "I LOVE this take. Exactly! Like why “play hard to get” in these arrangements? I love being sexual with my SD and we enjoy each other equally both inside and outside the bedroom. I find that it’s like an internalized slut-shaming that we as women do sometimes by thinking that we a devaluing ourselves by “putting out” too fast. That dynamic in theory shouldn’t exist in SRs as intimacy is usually expected anyway. Just sounds like a boring and difficult arrangement to me. My rule of thumb is finding a SD I’m actually attracted to. Idc how much money a man has, I won’t pursue an arrangement if I’m not attracted to him but some women are just different I guess. I’m not that desperate to sleep with a man I’m not attracted to.",
                                            "author": "messybootski",
                                            "id": "gqk39zb",
                                            "parent_id": "t1_gqjo0yh",
                                            "score": 2,
                                            "created_utc": 1615457994.0,
                                            "replies": [
                                                {
                                                    "body": "Exactly! Hey there :) .... But actually, I remember your recent comments and it's unfortunate to think that if we were local you would definitely next me :) I'm a generous SD, but not into the \"finer things in life\". Glad there is more of you though that doesn't play games and simply enjoys time together, you make the world a better place!",
                                                    "author": "whatever-tata",
                                                    "id": "gqkx9aa",
                                                    "parent_id": "t1_gqk39zb",
                                                    "score": 1,
                                                    "created_utc": 1615476229.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Well there's a lot to unpack in that one, lol.",
                    "author": "oneangstybiscuit",
                    "id": "gqihq7f",
                    "parent_id": "t1_gqhv6am",
                    "score": 2,
                    "created_utc": 1615422722.0,
                    "replies": [
                        {
                            "body": "Hahahaa jesus christ, RIGHT!!!!! woof...",
                            "author": "Pixie_Lizard",
                            "id": "gqj4ti0",
                            "parent_id": "t1_gqihq7f",
                            "score": 1,
                            "created_utc": 1615435218.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I’m sure that a decent amount of women know how to make a guy want to spend money on them by using the “holding out” technique. I have personally done it before and reaped the benefits however that’s not what I’m talking about here. I’m talking about SB YouTubers basically shaming women who do decide to be intimate within their SRs. You think real SBs don’t know how to make a man want to empty his wallet by delaying sex? It’s the oldest trick in the book however that dynamic might not be realistic for every SB and so for these content creators to sell this dream to naive and new aspiring SBs is concerning to me especially since they may not be practicing what they preach. What people have got to understand is that most SRs in some way may require some form of sexual intimacy and if that’s “disgusting” for some then they should get out of the bowl.",
                    "author": "messybootski",
                    "id": "gqk2pgi",
                    "parent_id": "t1_gqhv6am",
                    "score": 2,
                    "created_utc": 1615457595.0,
                    "replies": []
                },
                {
                    "body": ">Not enjoying sex is how women have maintained control in this species.\n\nThat's a very negative and biased view. Relationships are not a constant battle for control. That mindset it what *ends* relationships a d turns them sour, it's certainly not going to start any good ones.\n\n>I've had guys not think I'm worth much because I enjoy sex too much.\n\nIt likely had more to do with your negativity and manipulation, rather than how much you do or don't enjoy sex.",
                    "author": "devslashmodelSB",
                    "id": "gqj8r3b",
                    "parent_id": "t1_gqhv6am",
                    "score": 1,
                    "created_utc": 1615437663.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gqjdvor",
                            "parent_id": "t1_gqj8r3b",
                            "score": 2,
                            "created_utc": 1615440800.0,
                            "replies": [
                                {
                                    "body": "Woah, is this some sort of new movement. WGTOW?\n\n>The best way to distract him from the fact that you aren't attracted to him is feigning asexuality.\n\nWell, the point is not to have to distract him. If you aren't attracted to him why is he your SD?\n\n>actually IS what women have been doing for most of human evolution.\n\nThen people wouldn't exist...\n\n>Would a sugar daddy give any money to a woman who's having mind-blowing orgasms with him?\n\nHell yeah they would (and they do), many prefer that she has mind blowing orgasms. Check out this forum, there was a question asking SDs what makes an SB good at sex. Most said that her wanting to have sex and orgasming a lot was a big part of it. Sorry that you had such a negative experience with sexuality, but most people are happy to please the person they are with sexually. \n\nI think if you have such a negative view then you'll attract partners who are negative too. Ofcourse you won't attract a kinky awesome partner if you feign asexuality.",
                                    "author": "devslashmodelSB",
                                    "id": "gqjl0ug",
                                    "parent_id": "t1_gqjdvor",
                                    "score": 1,
                                    "created_utc": 1615445042.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gqjqq9f",
                                            "parent_id": "t1_gqjl0ug",
                                            "score": 1,
                                            "created_utc": 1615448784.0,
                                            "replies": [
                                                {
                                                    "body": "Speak for yourself. I'm probably most attracted to late 30s-mid 40s, and so are many SBs. I just wouldn't vanilla date them because we don't have as much in common as I do with guys my age, plus I'm not looking for vanilla dating now anyways.\n\n>It's kind of rare to meet someone young, rich, and attractive.\n\nWell, that's also true for partners in vanilla dating too. The general rule is to find somebody you connect with on a deeper level so that you'll be happy with whatever 2/3 you value most :)",
                                                    "author": "devslashmodelSB",
                                                    "id": "gqjv3lq",
                                                    "parent_id": "t1_gqjqq9f",
                                                    "score": 1,
                                                    "created_utc": 1615451742.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "gqjw5yz",
                                                            "parent_id": "t1_gqjv3lq",
                                                            "score": 1,
                                                            "created_utc": 1615452531.0,
                                                            "replies": [
                                                                {
                                                                    "body": "We don't have nothing in common. The SD I'm considering now and I connect in our interests in philosophy, literature, and art... But it's not like guys my age where they're into all of that PLUS they'll play videogames with you and send you memes.",
                                                                    "author": "devslashmodelSB",
                                                                    "id": "gqjyiiv",
                                                                    "parent_id": "t1_gqjw5yz",
                                                                    "score": 1,
                                                                    "created_utc": 1615454237.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I remember seeing one laughing about \"manipulating\" (she used that word exactly) older men to give her money without being with them intimately or romantically. Like your alternative to actually adding happiness to people's lives is.. being a super shitty manipulative person? And that's supposed to be better somehow?",
            "author": "devslashmodelSB",
            "id": "gqj2a37",
            "parent_id": "t3_m23ovv",
            "score": 0,
            "created_utc": 1615433662.0,
            "replies": [
                {
                    "body": "Exactly! I don’t like that mentality at all. I also think that it just shows that a lot of “SBs” shouldn’t be in the bowl. If you’re here to manipulate and just take from a person that’s not gonna give you any good karma and sure as hell isn’t a way to maintain a long-term SR.",
                    "author": "messybootski",
                    "id": "gqk1eiz",
                    "parent_id": "t1_gqj2a37",
                    "score": 1,
                    "created_utc": 1615456578.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gqibmpg",
            "parent_id": "t3_m23ovv",
            "score": 1,
            "created_utc": 1615419499.0,
            "replies": [
                {
                    "body": "20 lbs is 9.08 kg",
                    "author": "converter-bot",
                    "id": "gqibnpo",
                    "parent_id": "t1_gqibmpg",
                    "score": 2,
                    "created_utc": 1615419514.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "98% Of them are the worst! Lol before I found this I went searching on there and damn I’m glad i found this forum soon after",
            "author": null,
            "id": "gqigbns",
            "parent_id": "t3_m23ovv",
            "score": 1,
            "created_utc": 1615421977.0,
            "replies": []
        },
        {
            "body": "Most people in sr's live in reality we know damb nothing in free in life.Why would a sugar daddy as myself give a sb money for the art of giving it?Those type of youtubers are going to get someone hurt.If they believe no sexual component is apart of suffering that is delusional naivete.",
            "author": "CombinationThin",
            "id": "gqkfrbz",
            "parent_id": "t3_m23ovv",
            "score": 1,
            "created_utc": 1615466927.0,
            "replies": []
        },
        {
            "body": "Do something",
            "author": null,
            "id": "gqlin90",
            "parent_id": "t3_m23ovv",
            "score": 1,
            "created_utc": 1615485619.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gqmgkbt",
            "parent_id": "t3_m23ovv",
            "score": 1,
            "created_utc": 1615500508.0,
            "replies": [
                {
                    "body": "You can very much still hold onto your sexual agency while putting out in an SR. It's not a zero sum game. You are very much allowed to take your own sexual satisfaction into account when choosing an SD. \n\nNow if you're getting into relationships with people you aren't into at all, that's honestly on you and not on your partner for having sexual needs and wanting those needs met in an adult, romantic relationship. \n\nLet the platonics find each other. But what OP is ranting about are the inflencers that wildly mislead newbie SBs and think being disingenuous and lying their way into an SR is the proper way to be an SB. Or telling SBs that platonic is way more common than they think which just sets them up for failure and more vulnerable to scammers.",
                    "author": "iknowwhatiwantbroski",
                    "id": "gqndb95",
                    "parent_id": "t1_gqmgkbt",
                    "score": 2,
                    "created_utc": 1615517381.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gqnltwq",
                            "parent_id": "t1_gqndb95",
                            "score": 1,
                            "created_utc": 1615522114.0,
                            "replies": [
                                {
                                    "body": "I do understand the difference. That's why I said that the platonics can get together with other platonics. \n\nWhat I don't understand about your argument is the bit about \"using intimacy as a commodity to be sold to anyone who walks up to the counter\". Because that's not what SRs that do have a sexual component are about either? Isn't the vetting process all about NOT being intimate with just anyone who comes up? And how slf in particular advocate for SBs who can't stand having sex with their SDs to end things? \n\nIt just speaks of this weird 60's mindset that men are pigs for wanting sex because women merely tolerate it. That attitude I do find harmful.",
                                    "author": "iknowwhatiwantbroski",
                                    "id": "gqnodxh",
                                    "parent_id": "t1_gqnltwq",
                                    "score": 1,
                                    "created_utc": 1615523668.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I completely agree with you her and “Fancy” are both selling a dream that doesn’t exist. Especially that Fancy girl she claims she just sits pretty and gets a fat check but huney we all know you have to provide the sugar. To sell coaching to girls who don’t know any better is sad and a scam",
            "author": "mister_banks",
            "id": "ijeilhk",
            "parent_id": "t3_m23ovv",
            "score": 1,
            "created_utc": 1659933430.0,
            "replies": []
        },
        {
            "body": "Is it Fancy? Haha",
            "author": "messybootski",
            "id": "gqhlkf7",
            "parent_id": "t1_gqh5f54",
            "score": 2,
            "created_utc": 1615407592.0,
            "replies": [
                {
                    "body": "Lol suppose soo!",
                    "author": "sheabutterbunny",
                    "id": "gqhslle",
                    "parent_id": "t1_gqhlkf7",
                    "score": 2,
                    "created_utc": 1615410592.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think there are some SDs who are still into very old-school, arm candy style of sugaring where you do get paid for being cute. But that's getting rarer and rarer because it is very old school.  \n\n\nedit to add: and this is likely because the world used to be more slut shamey so those traditional values are still in place for some people. I imagine there are more older SDs who are like this - partially low libido, partially those older values.",
            "author": "hopefulcaterpiller",
            "id": "gqi5a9b",
            "parent_id": "t1_gqh5f54",
            "score": 6,
            "created_utc": 1615416336.0,
            "replies": [
                {
                    "body": "To be honest I would bet that a lot of those “traditional” men just have erectile dysfunction.",
                    "author": "thebestrosie",
                    "id": "gqi8yk4",
                    "parent_id": "t1_gqi5a9b",
                    "score": 18,
                    "created_utc": 1615418149.0,
                    "replies": [
                        {
                            "body": "That could also be the case too!",
                            "author": "sheabutterbunny",
                            "id": "gqiedeh",
                            "parent_id": "t1_gqi8yk4",
                            "score": 2,
                            "created_utc": 1615420940.0,
                            "replies": []
                        },
                        {
                            "body": "Maybe? \n\nI really don't mind either way and I don't see why anyone else should either. It doesn't really matter. ED is only a problem if someone is distressed by it - and if a man isn't distressed by it, and a SB isn't distressed by it, then what's the issue? \n\nTraditional or has ED - it's all the same to me! Haha , and if couching it in being traditional protects their feelings then I don't see any reason not to. It's not harming anyone I don't think?\n\nED is quite common so I guess if girls are looking for platonic arrangements they really should consider looking for that in older men.",
                            "author": "hopefulcaterpiller",
                            "id": "gqif0f3",
                            "parent_id": "t1_gqi8yk4",
                            "score": 0,
                            "created_utc": 1615421283.0,
                            "replies": []
                        },
                        {
                            "body": "Or maybe they can appreciate the sheer beauty of young women and dont have fixed goals in mind",
                            "author": "djvinc",
                            "id": "gqiljnb",
                            "parent_id": "t1_gqi8yk4",
                            "score": -1,
                            "created_utc": 1615424776.0,
                            "replies": []
                        },
                        {
                            "body": "Lmao",
                            "author": "Purplecrumpet7",
                            "id": "gqis235",
                            "parent_id": "t1_gqi8yk4",
                            "score": 1,
                            "created_utc": 1615428147.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I can understand that and Im sure it’s not in the least bit prevalent considering the age we are now in. But wow such gems!🥺",
                    "author": "sheabutterbunny",
                    "id": "gqieb38",
                    "parent_id": "t1_gqi5a9b",
                    "score": 1,
                    "created_utc": 1615420905.0,
                    "replies": [
                        {
                            "body": "Yeah, times have changed! That's come with positives and negatives. I agree, definitely gems!",
                            "author": "hopefulcaterpiller",
                            "id": "gqif8nd",
                            "parent_id": "t1_gqieb38",
                            "score": 2,
                            "created_utc": 1615421404.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think just straight up sugar relationships are easier to navigate tbh.",
            "author": "ColdHeaux",
            "id": "gqi5vou",
            "parent_id": "t1_gqi5ulm",
            "score": 3,
            "created_utc": 1615416628.0,
            "replies": []
        },
        {
            "body": "I had a very similar scenario. He helped me a lot, but had serious issues and I'm probably traumatized from it and need therapy. Like most actual platonic arrangements it wasn't my choice or preference to be platonic. \n\nReally people should strive to add value in people's lives, not try to avoid it while reaping the benefits because they have hang ups about what it entails on their end. Traditional SRs are simpler because people are honest about what will add value.",
            "author": "devslashmodelSB",
            "id": "gqj3ewk",
            "parent_id": "t1_gqi5ulm",
            "score": 1,
            "created_utc": 1615434285.0,
            "replies": [
                {
                    "body": "I'm sorry you need therapy- I definitely don't think my arrangement was traumatic, just kind of exhausting. I think experiences as a stripper in the champagne room were much more traumatizing tbh.",
                    "author": "ColdHeaux",
                    "id": "gqj8ohd",
                    "parent_id": "t1_gqj3ewk",
                    "score": 1,
                    "created_utc": 1615437619.0,
                    "replies": [
                        {
                            "body": "I mean, he was a great guy so no real regrets. Just a lot of mental health issues he didn't want to get help for. And I can only imagine what kind of stuff goes on there :(",
                            "author": "devslashmodelSB",
                            "id": "gqj94ju",
                            "parent_id": "t1_gqj8ohd",
                            "score": 2,
                            "created_utc": 1615437899.0,
                            "replies": [
                                {
                                    "body": "I mean most of it is fine- it's just the once-in-a-while that you have to watch out for. Also, it really depends on the club. Some bouncers/manangers go to bat for you, some clubs will fire you for getting assaulted essentially.",
                                    "author": "ColdHeaux",
                                    "id": "gqja9ko",
                                    "parent_id": "t1_gqj94ju",
                                    "score": 3,
                                    "created_utc": 1615438685.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just watched one of her videos where she explains what types of women shouldn't be SB's and actually tells them to look for something else. It's certainly refreshing, compared to all those who just want to sell an unrealistic dream.",
            "author": "MyIncognitoMe",
            "id": "gqibci7",
            "parent_id": "t1_gqhjked",
            "score": 7,
            "created_utc": 1615419354.0,
            "replies": []
        },
        {
            "body": "When i didnt know about reddit yet I went to youtube to look for advices about SR and i saw her account. Yes she’s really funny and very helpful. I subscribed!",
            "author": "slimshLady00",
            "id": "gqkwf00",
            "parent_id": "t1_gqhjked",
            "score": 1,
            "created_utc": 1615475846.0,
            "replies": []
        },
        {
            "body": "Based on the advice she gives being very similar to what i’ve read on this forum, I would definitely recommend any new SBs to check out her videos!",
            "author": "Gee_n_tonic",
            "id": "gql7yjd",
            "parent_id": "t1_gqhjked",
            "score": 1,
            "created_utc": 1615481025.0,
            "replies": []
        },
        {
            "body": "Meelizjah is the one with “clients” and Viva La Fancy is much better but comes off as slut-shamey af.",
            "author": "messybootski",
            "id": "gqhke4w",
            "parent_id": "t1_gqhckpb",
            "score": 4,
            "created_utc": 1615407086.0,
            "replies": [
                {
                    "body": "They both come off as ghetto",
                    "author": "Spray_Swimming",
                    "id": "gqhkmxa",
                    "parent_id": "t1_gqhke4w",
                    "score": 1,
                    "created_utc": 1615407192.0,
                    "replies": [
                        {
                            "body": "We still calling people ghetto?",
                            "author": "oneangstybiscuit",
                            "id": "gqihago",
                            "parent_id": "t1_gqhkmxa",
                            "score": 4,
                            "created_utc": 1615422487.0,
                            "replies": []
                        },
                        {
                            "body": "Lol how so?",
                            "author": "messybootski",
                            "id": "gqhnl2d",
                            "parent_id": "t1_gqhkmxa",
                            "score": 1,
                            "created_utc": 1615408456.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "These ‘extra curricular activities’ that she is missing out on.... booo!",
                    "author": "SnooDucks4705",
                    "id": "gqibi1m",
                    "parent_id": "t1_gqhke4w",
                    "score": 1,
                    "created_utc": 1615419433.0,
                    "replies": []
                },
                {
                    "body": "Or Callikoa on TikTok",
                    "author": "KnottySexAcct",
                    "id": "gqjmepe",
                    "parent_id": "t1_gqhke4w",
                    "score": 1,
                    "created_utc": 1615445927.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right?? I want to see some of them.  I always hear about it.",
            "author": "redeye87",
            "id": "gqhjt3i",
            "parent_id": "t1_gqhckpb",
            "score": 2,
            "created_utc": 1615406831.0,
            "replies": []
        },
        {
            "body": "Omg man, I just can't. Were you raised under a rock? The right crust is essential to a good pizza.",
            "author": "ChapterRelative",
            "id": "gqhbpkg",
            "parent_id": "t1_gqh3ktm",
            "score": 8,
            "created_utc": 1615403415.0,
            "replies": [
                {
                    "body": "Lol, found the toast lover. :)",
                    "author": "TastySpermDispenser",
                    "id": "gqi3gbv",
                    "parent_id": "t1_gqhbpkg",
                    "score": 3,
                    "created_utc": 1615415456.0,
                    "replies": [
                        {
                            "body": "Sitting here, realizing that my M&G for the evening with an actual real life 22yo soccer chick (I have a fetish for soccer chicks) isn't going to happen because, in all likelihood, she was one of those TikTokers convinced that  I'd throw her some pizza money without slipping her some meat along with the dough, I have zero patience for your desire for institutional mass-market pizza made with meat from cans and cheese from plastic bags. \n\nAs opposed to real pizza.\n\nAlthough, if you're going to eat pizza in the US might as well go Chicago style.",
                            "author": "ChapterRelative",
                            "id": "gqi79xh",
                            "parent_id": "t1_gqi3gbv",
                            "score": 4,
                            "created_utc": 1615417309.0,
                            "replies": [
                                {
                                    "body": "You lost me with the analogy lol",
                                    "author": "oneangstybiscuit",
                                    "id": "gqihjpj",
                                    "parent_id": "t1_gqi79xh",
                                    "score": 3,
                                    "created_utc": 1615422624.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I agree with that, but if the toppings aren’t good it doesn’t matter what the crust is like",
                    "author": null,
                    "id": "gqi6tz3",
                    "parent_id": "t1_gqhbpkg",
                    "score": 1,
                    "created_utc": 1615417092.0,
                    "replies": [
                        {
                            "body": "I know a place where they pick the mushrooms wild that morning and shave the cheese off the block right onto the dough. Yes indeed, the toppings need to be the best.",
                            "author": "ChapterRelative",
                            "id": "gqi7k1s",
                            "parent_id": "t1_gqi6tz3",
                            "score": 1,
                            "created_utc": 1615417450.0,
                            "replies": [
                                {
                                    "body": "Wow where is that?",
                                    "author": null,
                                    "id": "gqi8068",
                                    "parent_id": "t1_gqi7k1s",
                                    "score": 1,
                                    "created_utc": 1615417673.0,
                                    "replies": [
                                        {
                                            "body": "In Arsiè Italy.",
                                            "author": "ChapterRelative",
                                            "id": "gqi8ge1",
                                            "parent_id": "t1_gqi8068",
                                            "score": 1,
                                            "created_utc": 1615417898.0,
                                            "replies": [
                                                {
                                                    "body": "I don’t think they’ll deliver over here so I’ll have to keep it in mind if I ever go there. With all the trendy farm to table restaurants nowadays you’d think there would be a us based one that does something like that too",
                                                    "author": null,
                                                    "id": "gqi9aav",
                                                    "parent_id": "t1_gqi8ge1",
                                                    "score": 1,
                                                    "created_utc": 1615418312.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Chances are Hes a scammer.",
            "author": "Fun_Focus8159",
            "id": "gqj9e9c",
            "parent_id": "t1_gqj1xxc",
            "score": 3,
            "created_utc": 1615438081.0,
            "replies": [
                {
                    "body": "What is the scam?  Can you give me some ideas?  I’m new to this so I honestly want to know.  Thanks.",
                    "author": "Greenapplehoneybun",
                    "id": "grebdri",
                    "parent_id": "t1_gqj9e9c",
                    "score": 1,
                    "created_utc": 1616095011.0,
                    "replies": [
                        {
                            "body": "A lot of scammers pose as platonic SD’s and will start asking you for money to verify yourself.",
                            "author": "Fun_Focus8159",
                            "id": "gredxan",
                            "parent_id": "t1_grebdri",
                            "score": 1,
                            "created_utc": 1616096237.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You didn’t find anything. You haven’t met him yet. Probably a scammer or liar.",
            "author": "new_sd_acct",
            "id": "gqjfff6",
            "parent_id": "t1_gqj1xxc",
            "score": 1,
            "created_utc": 1615441672.0,
            "replies": []
        },
        {
            "body": "I mean they certainly exist but they probably won’t last very long or your “allowance” will be relatively low.",
            "author": "messybootski",
            "id": "gqk3w2l",
            "parent_id": "t1_gqj1xxc",
            "score": 0,
            "created_utc": 1615458424.0,
            "replies": []
        },
        {
            "body": "Please shut up.",
            "author": "heyjam1",
            "id": "gqjb5q5",
            "parent_id": "t1_gqj47mb",
            "score": 1,
            "created_utc": 1615439287.0,
            "replies": []
        },
        {
            "body": "i agree",
            "author": "hiiItshelen",
            "id": "gqjfcgy",
            "parent_id": "t1_gqj47mb",
            "score": 1,
            "created_utc": 1615441627.0,
            "replies": []
        },
        {
            "body": "You missed the point so hard lol",
            "author": "messybootski",
            "id": "gqk15sx",
            "parent_id": "t1_gqj47mb",
            "score": 1,
            "created_utc": 1615456388.0,
            "replies": []
        },
        {
            "body": "That would be a hard pass for me. Arrangement websites exist to bypass pretending you are hard to get.",
            "author": "redstone24",
            "id": "gqiidhi",
            "parent_id": "t1_gqhv6am",
            "score": 5,
            "created_utc": 1615423072.0,
            "replies": []
        },
        {
            "body": "That's a recipe for never having a fulfilling relationship.",
            "author": "whatever-tata",
            "id": "gqidooe",
            "parent_id": "t1_gqhv6am",
            "score": 3,
            "created_utc": 1615420579.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gqiio2t",
                    "parent_id": "t1_gqidooe",
                    "score": -1,
                    "created_utc": 1615423234.0,
                    "replies": [
                        {
                            "body": "Might I suggest that you try and find other SDs? If you have to do that then it might take a huge mental or emotional toll on you over time. I promise there are SDs out there that you will find attractive in at least one way or another, and SDs that actually value you more because you enjoy sex. I'm an SB that has a high sex drive and my SD actually likes me more for it :)",
                            "author": "galactosegirl",
                            "id": "gqivmad",
                            "parent_id": "t1_gqiio2t",
                            "score": 3,
                            "created_utc": 1615430015.0,
                            "replies": []
                        },
                        {
                            "body": "It's a peculiar masochistic Rube Goldberg thinking to relationships, where if you do this, then he we will do this, and then you'll do this, and he'll do that, and then you will have sex and little does he know you want it as much as him. Why not cut out all that crap and just embrace the fact that you enjoy sex just as much and just ... enjoy it. My best relationship was like that, we had sex everyday for over a year, never fought or argued, enjoyed the great outdoors together as much as possible, etc. You are just depriving yourself of enjoyment, complicating relationships, and playing games for what, to honor the craft of your ancestors?! You must be kidding...",
                            "author": "whatever-tata",
                            "id": "gqjo0yh",
                            "parent_id": "t1_gqiio2t",
                            "score": 1,
                            "created_utc": 1615446951.0,
                            "replies": [
                                {
                                    "body": "I LOVE this take. Exactly! Like why “play hard to get” in these arrangements? I love being sexual with my SD and we enjoy each other equally both inside and outside the bedroom. I find that it’s like an internalized slut-shaming that we as women do sometimes by thinking that we a devaluing ourselves by “putting out” too fast. That dynamic in theory shouldn’t exist in SRs as intimacy is usually expected anyway. Just sounds like a boring and difficult arrangement to me. My rule of thumb is finding a SD I’m actually attracted to. Idc how much money a man has, I won’t pursue an arrangement if I’m not attracted to him but some women are just different I guess. I’m not that desperate to sleep with a man I’m not attracted to.",
                                    "author": "messybootski",
                                    "id": "gqk39zb",
                                    "parent_id": "t1_gqjo0yh",
                                    "score": 2,
                                    "created_utc": 1615457994.0,
                                    "replies": [
                                        {
                                            "body": "Exactly! Hey there :) .... But actually, I remember your recent comments and it's unfortunate to think that if we were local you would definitely next me :) I'm a generous SD, but not into the \"finer things in life\". Glad there is more of you though that doesn't play games and simply enjoys time together, you make the world a better place!",
                                            "author": "whatever-tata",
                                            "id": "gqkx9aa",
                                            "parent_id": "t1_gqk39zb",
                                            "score": 1,
                                            "created_utc": 1615476229.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well there's a lot to unpack in that one, lol.",
            "author": "oneangstybiscuit",
            "id": "gqihq7f",
            "parent_id": "t1_gqhv6am",
            "score": 2,
            "created_utc": 1615422722.0,
            "replies": [
                {
                    "body": "Hahahaa jesus christ, RIGHT!!!!! woof...",
                    "author": "Pixie_Lizard",
                    "id": "gqj4ti0",
                    "parent_id": "t1_gqihq7f",
                    "score": 1,
                    "created_utc": 1615435218.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m sure that a decent amount of women know how to make a guy want to spend money on them by using the “holding out” technique. I have personally done it before and reaped the benefits however that’s not what I’m talking about here. I’m talking about SB YouTubers basically shaming women who do decide to be intimate within their SRs. You think real SBs don’t know how to make a man want to empty his wallet by delaying sex? It’s the oldest trick in the book however that dynamic might not be realistic for every SB and so for these content creators to sell this dream to naive and new aspiring SBs is concerning to me especially since they may not be practicing what they preach. What people have got to understand is that most SRs in some way may require some form of sexual intimacy and if that’s “disgusting” for some then they should get out of the bowl.",
            "author": "messybootski",
            "id": "gqk2pgi",
            "parent_id": "t1_gqhv6am",
            "score": 2,
            "created_utc": 1615457595.0,
            "replies": []
        },
        {
            "body": ">Not enjoying sex is how women have maintained control in this species.\n\nThat's a very negative and biased view. Relationships are not a constant battle for control. That mindset it what *ends* relationships a d turns them sour, it's certainly not going to start any good ones.\n\n>I've had guys not think I'm worth much because I enjoy sex too much.\n\nIt likely had more to do with your negativity and manipulation, rather than how much you do or don't enjoy sex.",
            "author": "devslashmodelSB",
            "id": "gqj8r3b",
            "parent_id": "t1_gqhv6am",
            "score": 1,
            "created_utc": 1615437663.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gqjdvor",
                    "parent_id": "t1_gqj8r3b",
                    "score": 2,
                    "created_utc": 1615440800.0,
                    "replies": [
                        {
                            "body": "Woah, is this some sort of new movement. WGTOW?\n\n>The best way to distract him from the fact that you aren't attracted to him is feigning asexuality.\n\nWell, the point is not to have to distract him. If you aren't attracted to him why is he your SD?\n\n>actually IS what women have been doing for most of human evolution.\n\nThen people wouldn't exist...\n\n>Would a sugar daddy give any money to a woman who's having mind-blowing orgasms with him?\n\nHell yeah they would (and they do), many prefer that she has mind blowing orgasms. Check out this forum, there was a question asking SDs what makes an SB good at sex. Most said that her wanting to have sex and orgasming a lot was a big part of it. Sorry that you had such a negative experience with sexuality, but most people are happy to please the person they are with sexually. \n\nI think if you have such a negative view then you'll attract partners who are negative too. Ofcourse you won't attract a kinky awesome partner if you feign asexuality.",
                            "author": "devslashmodelSB",
                            "id": "gqjl0ug",
                            "parent_id": "t1_gqjdvor",
                            "score": 1,
                            "created_utc": 1615445042.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gqjqq9f",
                                    "parent_id": "t1_gqjl0ug",
                                    "score": 1,
                                    "created_utc": 1615448784.0,
                                    "replies": [
                                        {
                                            "body": "Speak for yourself. I'm probably most attracted to late 30s-mid 40s, and so are many SBs. I just wouldn't vanilla date them because we don't have as much in common as I do with guys my age, plus I'm not looking for vanilla dating now anyways.\n\n>It's kind of rare to meet someone young, rich, and attractive.\n\nWell, that's also true for partners in vanilla dating too. The general rule is to find somebody you connect with on a deeper level so that you'll be happy with whatever 2/3 you value most :)",
                                            "author": "devslashmodelSB",
                                            "id": "gqjv3lq",
                                            "parent_id": "t1_gqjqq9f",
                                            "score": 1,
                                            "created_utc": 1615451742.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gqjw5yz",
                                                    "parent_id": "t1_gqjv3lq",
                                                    "score": 1,
                                                    "created_utc": 1615452531.0,
                                                    "replies": [
                                                        {
                                                            "body": "We don't have nothing in common. The SD I'm considering now and I connect in our interests in philosophy, literature, and art... But it's not like guys my age where they're into all of that PLUS they'll play videogames with you and send you memes.",
                                                            "author": "devslashmodelSB",
                                                            "id": "gqjyiiv",
                                                            "parent_id": "t1_gqjw5yz",
                                                            "score": 1,
                                                            "created_utc": 1615454237.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly! I don’t like that mentality at all. I also think that it just shows that a lot of “SBs” shouldn’t be in the bowl. If you’re here to manipulate and just take from a person that’s not gonna give you any good karma and sure as hell isn’t a way to maintain a long-term SR.",
            "author": "messybootski",
            "id": "gqk1eiz",
            "parent_id": "t1_gqj2a37",
            "score": 1,
            "created_utc": 1615456578.0,
            "replies": []
        },
        {
            "body": "20 lbs is 9.08 kg",
            "author": "converter-bot",
            "id": "gqibnpo",
            "parent_id": "t1_gqibmpg",
            "score": 2,
            "created_utc": 1615419514.0,
            "replies": []
        },
        {
            "body": "You can very much still hold onto your sexual agency while putting out in an SR. It's not a zero sum game. You are very much allowed to take your own sexual satisfaction into account when choosing an SD. \n\nNow if you're getting into relationships with people you aren't into at all, that's honestly on you and not on your partner for having sexual needs and wanting those needs met in an adult, romantic relationship. \n\nLet the platonics find each other. But what OP is ranting about are the inflencers that wildly mislead newbie SBs and think being disingenuous and lying their way into an SR is the proper way to be an SB. Or telling SBs that platonic is way more common than they think which just sets them up for failure and more vulnerable to scammers.",
            "author": "iknowwhatiwantbroski",
            "id": "gqndb95",
            "parent_id": "t1_gqmgkbt",
            "score": 2,
            "created_utc": 1615517381.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gqnltwq",
                    "parent_id": "t1_gqndb95",
                    "score": 1,
                    "created_utc": 1615522114.0,
                    "replies": [
                        {
                            "body": "I do understand the difference. That's why I said that the platonics can get together with other platonics. \n\nWhat I don't understand about your argument is the bit about \"using intimacy as a commodity to be sold to anyone who walks up to the counter\". Because that's not what SRs that do have a sexual component are about either? Isn't the vetting process all about NOT being intimate with just anyone who comes up? And how slf in particular advocate for SBs who can't stand having sex with their SDs to end things? \n\nIt just speaks of this weird 60's mindset that men are pigs for wanting sex because women merely tolerate it. That attitude I do find harmful.",
                            "author": "iknowwhatiwantbroski",
                            "id": "gqnodxh",
                            "parent_id": "t1_gqnltwq",
                            "score": 1,
                            "created_utc": 1615523668.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol suppose soo!",
            "author": "sheabutterbunny",
            "id": "gqhslle",
            "parent_id": "t1_gqhlkf7",
            "score": 2,
            "created_utc": 1615410592.0,
            "replies": []
        },
        {
            "body": "To be honest I would bet that a lot of those “traditional” men just have erectile dysfunction.",
            "author": "thebestrosie",
            "id": "gqi8yk4",
            "parent_id": "t1_gqi5a9b",
            "score": 18,
            "created_utc": 1615418149.0,
            "replies": [
                {
                    "body": "That could also be the case too!",
                    "author": "sheabutterbunny",
                    "id": "gqiedeh",
                    "parent_id": "t1_gqi8yk4",
                    "score": 2,
                    "created_utc": 1615420940.0,
                    "replies": []
                },
                {
                    "body": "Maybe? \n\nI really don't mind either way and I don't see why anyone else should either. It doesn't really matter. ED is only a problem if someone is distressed by it - and if a man isn't distressed by it, and a SB isn't distressed by it, then what's the issue? \n\nTraditional or has ED - it's all the same to me! Haha , and if couching it in being traditional protects their feelings then I don't see any reason not to. It's not harming anyone I don't think?\n\nED is quite common so I guess if girls are looking for platonic arrangements they really should consider looking for that in older men.",
                    "author": "hopefulcaterpiller",
                    "id": "gqif0f3",
                    "parent_id": "t1_gqi8yk4",
                    "score": 0,
                    "created_utc": 1615421283.0,
                    "replies": []
                },
                {
                    "body": "Or maybe they can appreciate the sheer beauty of young women and dont have fixed goals in mind",
                    "author": "djvinc",
                    "id": "gqiljnb",
                    "parent_id": "t1_gqi8yk4",
                    "score": -1,
                    "created_utc": 1615424776.0,
                    "replies": []
                },
                {
                    "body": "Lmao",
                    "author": "Purplecrumpet7",
                    "id": "gqis235",
                    "parent_id": "t1_gqi8yk4",
                    "score": 1,
                    "created_utc": 1615428147.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can understand that and Im sure it’s not in the least bit prevalent considering the age we are now in. But wow such gems!🥺",
            "author": "sheabutterbunny",
            "id": "gqieb38",
            "parent_id": "t1_gqi5a9b",
            "score": 1,
            "created_utc": 1615420905.0,
            "replies": [
                {
                    "body": "Yeah, times have changed! That's come with positives and negatives. I agree, definitely gems!",
                    "author": "hopefulcaterpiller",
                    "id": "gqif8nd",
                    "parent_id": "t1_gqieb38",
                    "score": 2,
                    "created_utc": 1615421404.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm sorry you need therapy- I definitely don't think my arrangement was traumatic, just kind of exhausting. I think experiences as a stripper in the champagne room were much more traumatizing tbh.",
            "author": "ColdHeaux",
            "id": "gqj8ohd",
            "parent_id": "t1_gqj3ewk",
            "score": 1,
            "created_utc": 1615437619.0,
            "replies": [
                {
                    "body": "I mean, he was a great guy so no real regrets. Just a lot of mental health issues he didn't want to get help for. And I can only imagine what kind of stuff goes on there :(",
                    "author": "devslashmodelSB",
                    "id": "gqj94ju",
                    "parent_id": "t1_gqj8ohd",
                    "score": 2,
                    "created_utc": 1615437899.0,
                    "replies": [
                        {
                            "body": "I mean most of it is fine- it's just the once-in-a-while that you have to watch out for. Also, it really depends on the club. Some bouncers/manangers go to bat for you, some clubs will fire you for getting assaulted essentially.",
                            "author": "ColdHeaux",
                            "id": "gqja9ko",
                            "parent_id": "t1_gqj94ju",
                            "score": 3,
                            "created_utc": 1615438685.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "They both come off as ghetto",
            "author": "Spray_Swimming",
            "id": "gqhkmxa",
            "parent_id": "t1_gqhke4w",
            "score": 1,
            "created_utc": 1615407192.0,
            "replies": [
                {
                    "body": "We still calling people ghetto?",
                    "author": "oneangstybiscuit",
                    "id": "gqihago",
                    "parent_id": "t1_gqhkmxa",
                    "score": 4,
                    "created_utc": 1615422487.0,
                    "replies": []
                },
                {
                    "body": "Lol how so?",
                    "author": "messybootski",
                    "id": "gqhnl2d",
                    "parent_id": "t1_gqhkmxa",
                    "score": 1,
                    "created_utc": 1615408456.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "These ‘extra curricular activities’ that she is missing out on.... booo!",
            "author": "SnooDucks4705",
            "id": "gqibi1m",
            "parent_id": "t1_gqhke4w",
            "score": 1,
            "created_utc": 1615419433.0,
            "replies": []
        },
        {
            "body": "Or Callikoa on TikTok",
            "author": "KnottySexAcct",
            "id": "gqjmepe",
            "parent_id": "t1_gqhke4w",
            "score": 1,
            "created_utc": 1615445927.0,
            "replies": []
        },
        {
            "body": "Lol, found the toast lover. :)",
            "author": "TastySpermDispenser",
            "id": "gqi3gbv",
            "parent_id": "t1_gqhbpkg",
            "score": 3,
            "created_utc": 1615415456.0,
            "replies": [
                {
                    "body": "Sitting here, realizing that my M&G for the evening with an actual real life 22yo soccer chick (I have a fetish for soccer chicks) isn't going to happen because, in all likelihood, she was one of those TikTokers convinced that  I'd throw her some pizza money without slipping her some meat along with the dough, I have zero patience for your desire for institutional mass-market pizza made with meat from cans and cheese from plastic bags. \n\nAs opposed to real pizza.\n\nAlthough, if you're going to eat pizza in the US might as well go Chicago style.",
                    "author": "ChapterRelative",
                    "id": "gqi79xh",
                    "parent_id": "t1_gqi3gbv",
                    "score": 4,
                    "created_utc": 1615417309.0,
                    "replies": [
                        {
                            "body": "You lost me with the analogy lol",
                            "author": "oneangstybiscuit",
                            "id": "gqihjpj",
                            "parent_id": "t1_gqi79xh",
                            "score": 3,
                            "created_utc": 1615422624.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree with that, but if the toppings aren’t good it doesn’t matter what the crust is like",
            "author": null,
            "id": "gqi6tz3",
            "parent_id": "t1_gqhbpkg",
            "score": 1,
            "created_utc": 1615417092.0,
            "replies": [
                {
                    "body": "I know a place where they pick the mushrooms wild that morning and shave the cheese off the block right onto the dough. Yes indeed, the toppings need to be the best.",
                    "author": "ChapterRelative",
                    "id": "gqi7k1s",
                    "parent_id": "t1_gqi6tz3",
                    "score": 1,
                    "created_utc": 1615417450.0,
                    "replies": [
                        {
                            "body": "Wow where is that?",
                            "author": null,
                            "id": "gqi8068",
                            "parent_id": "t1_gqi7k1s",
                            "score": 1,
                            "created_utc": 1615417673.0,
                            "replies": [
                                {
                                    "body": "In Arsiè Italy.",
                                    "author": "ChapterRelative",
                                    "id": "gqi8ge1",
                                    "parent_id": "t1_gqi8068",
                                    "score": 1,
                                    "created_utc": 1615417898.0,
                                    "replies": [
                                        {
                                            "body": "I don’t think they’ll deliver over here so I’ll have to keep it in mind if I ever go there. With all the trendy farm to table restaurants nowadays you’d think there would be a us based one that does something like that too",
                                            "author": null,
                                            "id": "gqi9aav",
                                            "parent_id": "t1_gqi8ge1",
                                            "score": 1,
                                            "created_utc": 1615418312.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What is the scam?  Can you give me some ideas?  I’m new to this so I honestly want to know.  Thanks.",
            "author": "Greenapplehoneybun",
            "id": "grebdri",
            "parent_id": "t1_gqj9e9c",
            "score": 1,
            "created_utc": 1616095011.0,
            "replies": [
                {
                    "body": "A lot of scammers pose as platonic SD’s and will start asking you for money to verify yourself.",
                    "author": "Fun_Focus8159",
                    "id": "gredxan",
                    "parent_id": "t1_grebdri",
                    "score": 1,
                    "created_utc": 1616096237.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gqiio2t",
            "parent_id": "t1_gqidooe",
            "score": -1,
            "created_utc": 1615423234.0,
            "replies": [
                {
                    "body": "Might I suggest that you try and find other SDs? If you have to do that then it might take a huge mental or emotional toll on you over time. I promise there are SDs out there that you will find attractive in at least one way or another, and SDs that actually value you more because you enjoy sex. I'm an SB that has a high sex drive and my SD actually likes me more for it :)",
                    "author": "galactosegirl",
                    "id": "gqivmad",
                    "parent_id": "t1_gqiio2t",
                    "score": 3,
                    "created_utc": 1615430015.0,
                    "replies": []
                },
                {
                    "body": "It's a peculiar masochistic Rube Goldberg thinking to relationships, where if you do this, then he we will do this, and then you'll do this, and he'll do that, and then you will have sex and little does he know you want it as much as him. Why not cut out all that crap and just embrace the fact that you enjoy sex just as much and just ... enjoy it. My best relationship was like that, we had sex everyday for over a year, never fought or argued, enjoyed the great outdoors together as much as possible, etc. You are just depriving yourself of enjoyment, complicating relationships, and playing games for what, to honor the craft of your ancestors?! You must be kidding...",
                    "author": "whatever-tata",
                    "id": "gqjo0yh",
                    "parent_id": "t1_gqiio2t",
                    "score": 1,
                    "created_utc": 1615446951.0,
                    "replies": [
                        {
                            "body": "I LOVE this take. Exactly! Like why “play hard to get” in these arrangements? I love being sexual with my SD and we enjoy each other equally both inside and outside the bedroom. I find that it’s like an internalized slut-shaming that we as women do sometimes by thinking that we a devaluing ourselves by “putting out” too fast. That dynamic in theory shouldn’t exist in SRs as intimacy is usually expected anyway. Just sounds like a boring and difficult arrangement to me. My rule of thumb is finding a SD I’m actually attracted to. Idc how much money a man has, I won’t pursue an arrangement if I’m not attracted to him but some women are just different I guess. I’m not that desperate to sleep with a man I’m not attracted to.",
                            "author": "messybootski",
                            "id": "gqk39zb",
                            "parent_id": "t1_gqjo0yh",
                            "score": 2,
                            "created_utc": 1615457994.0,
                            "replies": [
                                {
                                    "body": "Exactly! Hey there :) .... But actually, I remember your recent comments and it's unfortunate to think that if we were local you would definitely next me :) I'm a generous SD, but not into the \"finer things in life\". Glad there is more of you though that doesn't play games and simply enjoys time together, you make the world a better place!",
                                    "author": "whatever-tata",
                                    "id": "gqkx9aa",
                                    "parent_id": "t1_gqk39zb",
                                    "score": 1,
                                    "created_utc": 1615476229.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hahahaa jesus christ, RIGHT!!!!! woof...",
            "author": "Pixie_Lizard",
            "id": "gqj4ti0",
            "parent_id": "t1_gqihq7f",
            "score": 1,
            "created_utc": 1615435218.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gqjdvor",
            "parent_id": "t1_gqj8r3b",
            "score": 2,
            "created_utc": 1615440800.0,
            "replies": [
                {
                    "body": "Woah, is this some sort of new movement. WGTOW?\n\n>The best way to distract him from the fact that you aren't attracted to him is feigning asexuality.\n\nWell, the point is not to have to distract him. If you aren't attracted to him why is he your SD?\n\n>actually IS what women have been doing for most of human evolution.\n\nThen people wouldn't exist...\n\n>Would a sugar daddy give any money to a woman who's having mind-blowing orgasms with him?\n\nHell yeah they would (and they do), many prefer that she has mind blowing orgasms. Check out this forum, there was a question asking SDs what makes an SB good at sex. Most said that her wanting to have sex and orgasming a lot was a big part of it. Sorry that you had such a negative experience with sexuality, but most people are happy to please the person they are with sexually. \n\nI think if you have such a negative view then you'll attract partners who are negative too. Ofcourse you won't attract a kinky awesome partner if you feign asexuality.",
                    "author": "devslashmodelSB",
                    "id": "gqjl0ug",
                    "parent_id": "t1_gqjdvor",
                    "score": 1,
                    "created_utc": 1615445042.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gqjqq9f",
                            "parent_id": "t1_gqjl0ug",
                            "score": 1,
                            "created_utc": 1615448784.0,
                            "replies": [
                                {
                                    "body": "Speak for yourself. I'm probably most attracted to late 30s-mid 40s, and so are many SBs. I just wouldn't vanilla date them because we don't have as much in common as I do with guys my age, plus I'm not looking for vanilla dating now anyways.\n\n>It's kind of rare to meet someone young, rich, and attractive.\n\nWell, that's also true for partners in vanilla dating too. The general rule is to find somebody you connect with on a deeper level so that you'll be happy with whatever 2/3 you value most :)",
                                    "author": "devslashmodelSB",
                                    "id": "gqjv3lq",
                                    "parent_id": "t1_gqjqq9f",
                                    "score": 1,
                                    "created_utc": 1615451742.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gqjw5yz",
                                            "parent_id": "t1_gqjv3lq",
                                            "score": 1,
                                            "created_utc": 1615452531.0,
                                            "replies": [
                                                {
                                                    "body": "We don't have nothing in common. The SD I'm considering now and I connect in our interests in philosophy, literature, and art... But it's not like guys my age where they're into all of that PLUS they'll play videogames with you and send you memes.",
                                                    "author": "devslashmodelSB",
                                                    "id": "gqjyiiv",
                                                    "parent_id": "t1_gqjw5yz",
                                                    "score": 1,
                                                    "created_utc": 1615454237.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gqnltwq",
            "parent_id": "t1_gqndb95",
            "score": 1,
            "created_utc": 1615522114.0,
            "replies": [
                {
                    "body": "I do understand the difference. That's why I said that the platonics can get together with other platonics. \n\nWhat I don't understand about your argument is the bit about \"using intimacy as a commodity to be sold to anyone who walks up to the counter\". Because that's not what SRs that do have a sexual component are about either? Isn't the vetting process all about NOT being intimate with just anyone who comes up? And how slf in particular advocate for SBs who can't stand having sex with their SDs to end things? \n\nIt just speaks of this weird 60's mindset that men are pigs for wanting sex because women merely tolerate it. That attitude I do find harmful.",
                    "author": "iknowwhatiwantbroski",
                    "id": "gqnodxh",
                    "parent_id": "t1_gqnltwq",
                    "score": 1,
                    "created_utc": 1615523668.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That could also be the case too!",
            "author": "sheabutterbunny",
            "id": "gqiedeh",
            "parent_id": "t1_gqi8yk4",
            "score": 2,
            "created_utc": 1615420940.0,
            "replies": []
        },
        {
            "body": "Maybe? \n\nI really don't mind either way and I don't see why anyone else should either. It doesn't really matter. ED is only a problem if someone is distressed by it - and if a man isn't distressed by it, and a SB isn't distressed by it, then what's the issue? \n\nTraditional or has ED - it's all the same to me! Haha , and if couching it in being traditional protects their feelings then I don't see any reason not to. It's not harming anyone I don't think?\n\nED is quite common so I guess if girls are looking for platonic arrangements they really should consider looking for that in older men.",
            "author": "hopefulcaterpiller",
            "id": "gqif0f3",
            "parent_id": "t1_gqi8yk4",
            "score": 0,
            "created_utc": 1615421283.0,
            "replies": []
        },
        {
            "body": "Or maybe they can appreciate the sheer beauty of young women and dont have fixed goals in mind",
            "author": "djvinc",
            "id": "gqiljnb",
            "parent_id": "t1_gqi8yk4",
            "score": -1,
            "created_utc": 1615424776.0,
            "replies": []
        },
        {
            "body": "Lmao",
            "author": "Purplecrumpet7",
            "id": "gqis235",
            "parent_id": "t1_gqi8yk4",
            "score": 1,
            "created_utc": 1615428147.0,
            "replies": []
        },
        {
            "body": "Yeah, times have changed! That's come with positives and negatives. I agree, definitely gems!",
            "author": "hopefulcaterpiller",
            "id": "gqif8nd",
            "parent_id": "t1_gqieb38",
            "score": 2,
            "created_utc": 1615421404.0,
            "replies": []
        },
        {
            "body": "I mean, he was a great guy so no real regrets. Just a lot of mental health issues he didn't want to get help for. And I can only imagine what kind of stuff goes on there :(",
            "author": "devslashmodelSB",
            "id": "gqj94ju",
            "parent_id": "t1_gqj8ohd",
            "score": 2,
            "created_utc": 1615437899.0,
            "replies": [
                {
                    "body": "I mean most of it is fine- it's just the once-in-a-while that you have to watch out for. Also, it really depends on the club. Some bouncers/manangers go to bat for you, some clubs will fire you for getting assaulted essentially.",
                    "author": "ColdHeaux",
                    "id": "gqja9ko",
                    "parent_id": "t1_gqj94ju",
                    "score": 3,
                    "created_utc": 1615438685.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We still calling people ghetto?",
            "author": "oneangstybiscuit",
            "id": "gqihago",
            "parent_id": "t1_gqhkmxa",
            "score": 4,
            "created_utc": 1615422487.0,
            "replies": []
        },
        {
            "body": "Lol how so?",
            "author": "messybootski",
            "id": "gqhnl2d",
            "parent_id": "t1_gqhkmxa",
            "score": 1,
            "created_utc": 1615408456.0,
            "replies": []
        },
        {
            "body": "Sitting here, realizing that my M&G for the evening with an actual real life 22yo soccer chick (I have a fetish for soccer chicks) isn't going to happen because, in all likelihood, she was one of those TikTokers convinced that  I'd throw her some pizza money without slipping her some meat along with the dough, I have zero patience for your desire for institutional mass-market pizza made with meat from cans and cheese from plastic bags. \n\nAs opposed to real pizza.\n\nAlthough, if you're going to eat pizza in the US might as well go Chicago style.",
            "author": "ChapterRelative",
            "id": "gqi79xh",
            "parent_id": "t1_gqi3gbv",
            "score": 4,
            "created_utc": 1615417309.0,
            "replies": [
                {
                    "body": "You lost me with the analogy lol",
                    "author": "oneangstybiscuit",
                    "id": "gqihjpj",
                    "parent_id": "t1_gqi79xh",
                    "score": 3,
                    "created_utc": 1615422624.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know a place where they pick the mushrooms wild that morning and shave the cheese off the block right onto the dough. Yes indeed, the toppings need to be the best.",
            "author": "ChapterRelative",
            "id": "gqi7k1s",
            "parent_id": "t1_gqi6tz3",
            "score": 1,
            "created_utc": 1615417450.0,
            "replies": [
                {
                    "body": "Wow where is that?",
                    "author": null,
                    "id": "gqi8068",
                    "parent_id": "t1_gqi7k1s",
                    "score": 1,
                    "created_utc": 1615417673.0,
                    "replies": [
                        {
                            "body": "In Arsiè Italy.",
                            "author": "ChapterRelative",
                            "id": "gqi8ge1",
                            "parent_id": "t1_gqi8068",
                            "score": 1,
                            "created_utc": 1615417898.0,
                            "replies": [
                                {
                                    "body": "I don’t think they’ll deliver over here so I’ll have to keep it in mind if I ever go there. With all the trendy farm to table restaurants nowadays you’d think there would be a us based one that does something like that too",
                                    "author": null,
                                    "id": "gqi9aav",
                                    "parent_id": "t1_gqi8ge1",
                                    "score": 1,
                                    "created_utc": 1615418312.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "A lot of scammers pose as platonic SD’s and will start asking you for money to verify yourself.",
            "author": "Fun_Focus8159",
            "id": "gredxan",
            "parent_id": "t1_grebdri",
            "score": 1,
            "created_utc": 1616096237.0,
            "replies": []
        },
        {
            "body": "Might I suggest that you try and find other SDs? If you have to do that then it might take a huge mental or emotional toll on you over time. I promise there are SDs out there that you will find attractive in at least one way or another, and SDs that actually value you more because you enjoy sex. I'm an SB that has a high sex drive and my SD actually likes me more for it :)",
            "author": "galactosegirl",
            "id": "gqivmad",
            "parent_id": "t1_gqiio2t",
            "score": 3,
            "created_utc": 1615430015.0,
            "replies": []
        },
        {
            "body": "It's a peculiar masochistic Rube Goldberg thinking to relationships, where if you do this, then he we will do this, and then you'll do this, and he'll do that, and then you will have sex and little does he know you want it as much as him. Why not cut out all that crap and just embrace the fact that you enjoy sex just as much and just ... enjoy it. My best relationship was like that, we had sex everyday for over a year, never fought or argued, enjoyed the great outdoors together as much as possible, etc. You are just depriving yourself of enjoyment, complicating relationships, and playing games for what, to honor the craft of your ancestors?! You must be kidding...",
            "author": "whatever-tata",
            "id": "gqjo0yh",
            "parent_id": "t1_gqiio2t",
            "score": 1,
            "created_utc": 1615446951.0,
            "replies": [
                {
                    "body": "I LOVE this take. Exactly! Like why “play hard to get” in these arrangements? I love being sexual with my SD and we enjoy each other equally both inside and outside the bedroom. I find that it’s like an internalized slut-shaming that we as women do sometimes by thinking that we a devaluing ourselves by “putting out” too fast. That dynamic in theory shouldn’t exist in SRs as intimacy is usually expected anyway. Just sounds like a boring and difficult arrangement to me. My rule of thumb is finding a SD I’m actually attracted to. Idc how much money a man has, I won’t pursue an arrangement if I’m not attracted to him but some women are just different I guess. I’m not that desperate to sleep with a man I’m not attracted to.",
                    "author": "messybootski",
                    "id": "gqk39zb",
                    "parent_id": "t1_gqjo0yh",
                    "score": 2,
                    "created_utc": 1615457994.0,
                    "replies": [
                        {
                            "body": "Exactly! Hey there :) .... But actually, I remember your recent comments and it's unfortunate to think that if we were local you would definitely next me :) I'm a generous SD, but not into the \"finer things in life\". Glad there is more of you though that doesn't play games and simply enjoys time together, you make the world a better place!",
                            "author": "whatever-tata",
                            "id": "gqkx9aa",
                            "parent_id": "t1_gqk39zb",
                            "score": 1,
                            "created_utc": 1615476229.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Woah, is this some sort of new movement. WGTOW?\n\n>The best way to distract him from the fact that you aren't attracted to him is feigning asexuality.\n\nWell, the point is not to have to distract him. If you aren't attracted to him why is he your SD?\n\n>actually IS what women have been doing for most of human evolution.\n\nThen people wouldn't exist...\n\n>Would a sugar daddy give any money to a woman who's having mind-blowing orgasms with him?\n\nHell yeah they would (and they do), many prefer that she has mind blowing orgasms. Check out this forum, there was a question asking SDs what makes an SB good at sex. Most said that her wanting to have sex and orgasming a lot was a big part of it. Sorry that you had such a negative experience with sexuality, but most people are happy to please the person they are with sexually. \n\nI think if you have such a negative view then you'll attract partners who are negative too. Ofcourse you won't attract a kinky awesome partner if you feign asexuality.",
            "author": "devslashmodelSB",
            "id": "gqjl0ug",
            "parent_id": "t1_gqjdvor",
            "score": 1,
            "created_utc": 1615445042.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gqjqq9f",
                    "parent_id": "t1_gqjl0ug",
                    "score": 1,
                    "created_utc": 1615448784.0,
                    "replies": [
                        {
                            "body": "Speak for yourself. I'm probably most attracted to late 30s-mid 40s, and so are many SBs. I just wouldn't vanilla date them because we don't have as much in common as I do with guys my age, plus I'm not looking for vanilla dating now anyways.\n\n>It's kind of rare to meet someone young, rich, and attractive.\n\nWell, that's also true for partners in vanilla dating too. The general rule is to find somebody you connect with on a deeper level so that you'll be happy with whatever 2/3 you value most :)",
                            "author": "devslashmodelSB",
                            "id": "gqjv3lq",
                            "parent_id": "t1_gqjqq9f",
                            "score": 1,
                            "created_utc": 1615451742.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gqjw5yz",
                                    "parent_id": "t1_gqjv3lq",
                                    "score": 1,
                                    "created_utc": 1615452531.0,
                                    "replies": [
                                        {
                                            "body": "We don't have nothing in common. The SD I'm considering now and I connect in our interests in philosophy, literature, and art... But it's not like guys my age where they're into all of that PLUS they'll play videogames with you and send you memes.",
                                            "author": "devslashmodelSB",
                                            "id": "gqjyiiv",
                                            "parent_id": "t1_gqjw5yz",
                                            "score": 1,
                                            "created_utc": 1615454237.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I do understand the difference. That's why I said that the platonics can get together with other platonics. \n\nWhat I don't understand about your argument is the bit about \"using intimacy as a commodity to be sold to anyone who walks up to the counter\". Because that's not what SRs that do have a sexual component are about either? Isn't the vetting process all about NOT being intimate with just anyone who comes up? And how slf in particular advocate for SBs who can't stand having sex with their SDs to end things? \n\nIt just speaks of this weird 60's mindset that men are pigs for wanting sex because women merely tolerate it. That attitude I do find harmful.",
            "author": "iknowwhatiwantbroski",
            "id": "gqnodxh",
            "parent_id": "t1_gqnltwq",
            "score": 1,
            "created_utc": 1615523668.0,
            "replies": []
        },
        {
            "body": "I mean most of it is fine- it's just the once-in-a-while that you have to watch out for. Also, it really depends on the club. Some bouncers/manangers go to bat for you, some clubs will fire you for getting assaulted essentially.",
            "author": "ColdHeaux",
            "id": "gqja9ko",
            "parent_id": "t1_gqj94ju",
            "score": 3,
            "created_utc": 1615438685.0,
            "replies": []
        },
        {
            "body": "You lost me with the analogy lol",
            "author": "oneangstybiscuit",
            "id": "gqihjpj",
            "parent_id": "t1_gqi79xh",
            "score": 3,
            "created_utc": 1615422624.0,
            "replies": []
        },
        {
            "body": "Wow where is that?",
            "author": null,
            "id": "gqi8068",
            "parent_id": "t1_gqi7k1s",
            "score": 1,
            "created_utc": 1615417673.0,
            "replies": [
                {
                    "body": "In Arsiè Italy.",
                    "author": "ChapterRelative",
                    "id": "gqi8ge1",
                    "parent_id": "t1_gqi8068",
                    "score": 1,
                    "created_utc": 1615417898.0,
                    "replies": [
                        {
                            "body": "I don’t think they’ll deliver over here so I’ll have to keep it in mind if I ever go there. With all the trendy farm to table restaurants nowadays you’d think there would be a us based one that does something like that too",
                            "author": null,
                            "id": "gqi9aav",
                            "parent_id": "t1_gqi8ge1",
                            "score": 1,
                            "created_utc": 1615418312.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I LOVE this take. Exactly! Like why “play hard to get” in these arrangements? I love being sexual with my SD and we enjoy each other equally both inside and outside the bedroom. I find that it’s like an internalized slut-shaming that we as women do sometimes by thinking that we a devaluing ourselves by “putting out” too fast. That dynamic in theory shouldn’t exist in SRs as intimacy is usually expected anyway. Just sounds like a boring and difficult arrangement to me. My rule of thumb is finding a SD I’m actually attracted to. Idc how much money a man has, I won’t pursue an arrangement if I’m not attracted to him but some women are just different I guess. I’m not that desperate to sleep with a man I’m not attracted to.",
            "author": "messybootski",
            "id": "gqk39zb",
            "parent_id": "t1_gqjo0yh",
            "score": 2,
            "created_utc": 1615457994.0,
            "replies": [
                {
                    "body": "Exactly! Hey there :) .... But actually, I remember your recent comments and it's unfortunate to think that if we were local you would definitely next me :) I'm a generous SD, but not into the \"finer things in life\". Glad there is more of you though that doesn't play games and simply enjoys time together, you make the world a better place!",
                    "author": "whatever-tata",
                    "id": "gqkx9aa",
                    "parent_id": "t1_gqk39zb",
                    "score": 1,
                    "created_utc": 1615476229.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gqjqq9f",
            "parent_id": "t1_gqjl0ug",
            "score": 1,
            "created_utc": 1615448784.0,
            "replies": [
                {
                    "body": "Speak for yourself. I'm probably most attracted to late 30s-mid 40s, and so are many SBs. I just wouldn't vanilla date them because we don't have as much in common as I do with guys my age, plus I'm not looking for vanilla dating now anyways.\n\n>It's kind of rare to meet someone young, rich, and attractive.\n\nWell, that's also true for partners in vanilla dating too. The general rule is to find somebody you connect with on a deeper level so that you'll be happy with whatever 2/3 you value most :)",
                    "author": "devslashmodelSB",
                    "id": "gqjv3lq",
                    "parent_id": "t1_gqjqq9f",
                    "score": 1,
                    "created_utc": 1615451742.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gqjw5yz",
                            "parent_id": "t1_gqjv3lq",
                            "score": 1,
                            "created_utc": 1615452531.0,
                            "replies": [
                                {
                                    "body": "We don't have nothing in common. The SD I'm considering now and I connect in our interests in philosophy, literature, and art... But it's not like guys my age where they're into all of that PLUS they'll play videogames with you and send you memes.",
                                    "author": "devslashmodelSB",
                                    "id": "gqjyiiv",
                                    "parent_id": "t1_gqjw5yz",
                                    "score": 1,
                                    "created_utc": 1615454237.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "In Arsiè Italy.",
            "author": "ChapterRelative",
            "id": "gqi8ge1",
            "parent_id": "t1_gqi8068",
            "score": 1,
            "created_utc": 1615417898.0,
            "replies": [
                {
                    "body": "I don’t think they’ll deliver over here so I’ll have to keep it in mind if I ever go there. With all the trendy farm to table restaurants nowadays you’d think there would be a us based one that does something like that too",
                    "author": null,
                    "id": "gqi9aav",
                    "parent_id": "t1_gqi8ge1",
                    "score": 1,
                    "created_utc": 1615418312.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly! Hey there :) .... But actually, I remember your recent comments and it's unfortunate to think that if we were local you would definitely next me :) I'm a generous SD, but not into the \"finer things in life\". Glad there is more of you though that doesn't play games and simply enjoys time together, you make the world a better place!",
            "author": "whatever-tata",
            "id": "gqkx9aa",
            "parent_id": "t1_gqk39zb",
            "score": 1,
            "created_utc": 1615476229.0,
            "replies": []
        },
        {
            "body": "Speak for yourself. I'm probably most attracted to late 30s-mid 40s, and so are many SBs. I just wouldn't vanilla date them because we don't have as much in common as I do with guys my age, plus I'm not looking for vanilla dating now anyways.\n\n>It's kind of rare to meet someone young, rich, and attractive.\n\nWell, that's also true for partners in vanilla dating too. The general rule is to find somebody you connect with on a deeper level so that you'll be happy with whatever 2/3 you value most :)",
            "author": "devslashmodelSB",
            "id": "gqjv3lq",
            "parent_id": "t1_gqjqq9f",
            "score": 1,
            "created_utc": 1615451742.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gqjw5yz",
                    "parent_id": "t1_gqjv3lq",
                    "score": 1,
                    "created_utc": 1615452531.0,
                    "replies": [
                        {
                            "body": "We don't have nothing in common. The SD I'm considering now and I connect in our interests in philosophy, literature, and art... But it's not like guys my age where they're into all of that PLUS they'll play videogames with you and send you memes.",
                            "author": "devslashmodelSB",
                            "id": "gqjyiiv",
                            "parent_id": "t1_gqjw5yz",
                            "score": 1,
                            "created_utc": 1615454237.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t think they’ll deliver over here so I’ll have to keep it in mind if I ever go there. With all the trendy farm to table restaurants nowadays you’d think there would be a us based one that does something like that too",
            "author": null,
            "id": "gqi9aav",
            "parent_id": "t1_gqi8ge1",
            "score": 1,
            "created_utc": 1615418312.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gqjw5yz",
            "parent_id": "t1_gqjv3lq",
            "score": 1,
            "created_utc": 1615452531.0,
            "replies": [
                {
                    "body": "We don't have nothing in common. The SD I'm considering now and I connect in our interests in philosophy, literature, and art... But it's not like guys my age where they're into all of that PLUS they'll play videogames with you and send you memes.",
                    "author": "devslashmodelSB",
                    "id": "gqjyiiv",
                    "parent_id": "t1_gqjw5yz",
                    "score": 1,
                    "created_utc": 1615454237.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We don't have nothing in common. The SD I'm considering now and I connect in our interests in philosophy, literature, and art... But it's not like guys my age where they're into all of that PLUS they'll play videogames with you and send you memes.",
            "author": "devslashmodelSB",
            "id": "gqjyiiv",
            "parent_id": "t1_gqjw5yz",
            "score": 1,
            "created_utc": 1615454237.0,
            "replies": []
        }
    ]
}