{
    "title": "JEON SOMIN PROTECTION SQUAD",
    "post_id": "hzx1h0",
    "post_url": "https://www.reddit.com/r/runningman/comments/hzx1h0/jeon_somin_protection_squad/",
    "author": "httpsomin",
    "body": "I really just want people to appreciate Somin more and not hate her for being the show's \"focus.\" She's literally just doing her best to be funny and she's actually naturally cute and funny, that's why she gets lots of screen time. I've been watching Running Man since 2012 and when she joined, I never felt anything negative towards her. I love how she can be pretty, cute, funny and crazy at the same time. She never holds back to avoid being embarrassing. She's crazy but in a fun way and I really believe she deserves all the good things. I don't get why people hate her, it must be because of their insecurities. Anyway, whoever is reading this, please protect Jeon Somin at all costs. Leave positive comments on her IG posts and give her lots of appreciation and love! As well as the other members, but I really just have a soft spot for Somin, I feel like she's so pure and she doesn't deserve the hate she's receiving ever since she joined.",
    "url": "https://www.reddit.com/r/runningman/comments/hzx1h0/jeon_somin_protection_squad/",
    "score": 301,
    "upvote_ratio": 0.94,
    "created_utc": 1596011416.0,
    "num_comments": 66,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "jeon somin is the popular girl in school for being herself but kdramas will turn ppl like her into the ‘2nd female lead’ and pit her against the ‘female lead’ as if there cant be positive female interactions.\n\nJEON SOMIN PROTECTION SQUAD #2 REPORTING 🙋🏻‍♀️🙋🏻‍♀️🙋🏻‍♀️\n\nis there a user flair where i can add a ‘jeon somin protection squad’ next to my username? 😂",
            "author": "wontaks",
            "id": "fzlr6oz",
            "parent_id": "t3_hzx1h0",
            "score": 80,
            "created_utc": 1596012860.0,
            "replies": [
                {
                    "body": "Fact is shes not at all like sjh who most of the haters habe chosen to identify with.\n\nShes less pretty (societally at large SJH is considered prettier), not aloof, not winning everything and clearly into lovey dovey girly stuff.\n\nYet shes the carry of the show. The people who hate on her dont understand it cause theyre mindset is still in the early 2010s when winnig was all that mattered on the show.\n\nNow they see in their minds an inferior in every way girl do better than the ideal female in SJH in terms of air time and their peanut brains cant comprehend it.\n\nThey shit on her and believe she sleeps around with the PDs cause apparently they have no sense of humor or personality cause theyre blind to why everyone loves Somin",
                    "author": "Finklemeire",
                    "id": "fzmub14",
                    "parent_id": "t1_fzlr6oz",
                    "score": 26,
                    "created_utc": 1596039978.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ive been saying this since i saw the first article of her being bombarded with negative comments and attacks:\n\nI WILL FIGHT AND SHIT ON YOU F\\*CKS FOR EVERYTHING NEGATIVE YOU DID ONTO HER.\n\n&#x200B;\n\nJEON SOMIN is so F\\*CKING PRECIOUS AND ADORABLE.\n\n&#x200B;\n\nNO she is not there to replace JIHYO\n\nNO she is not there to destroy RUNNING MAN\n\nGET that into your pathetic head.\n\nShe brings the craziness/aloofness/laughter of what the original cast has been doing ever since the 1st episode. Obviously the original cast is tired and frankly their age is catching up to them. They cant always bring you the hardknock comedy that we all love and adore!\n\nShe and also Sechan is a wonderful addition to the show and brings in new flavour but with the same recipe. You dont like it, then stop watching. Watching and complaining wont change anything. Throwing negative comments and attacking her wont CHANGE A THING. The only thing that will change is a person's life. OBVIOUSLY yall will feel remorse and regret ONLY after \"bad things\" happen. YOU dont have to go there. No one will gain anything. NOT the show, NOT the cast, NOT the fans.\n\nSo either shut the hell up and stop watching or give her a chance. SHE will grown onto you.\n\n&#x200B;\n\nJEON SOMIN FTW",
            "author": "dufchaxcx",
            "id": "fzluuos",
            "parent_id": "t3_hzx1h0",
            "score": 57,
            "created_utc": 1596016552.0,
            "replies": [
                {
                    "body": "honestly yes i dont get why people pit somin against jihyo?? they are two different people who both play important roles in rm!!",
                    "author": "rscpctals",
                    "id": "fzm23fy",
                    "parent_id": "t1_fzluuos",
                    "score": 10,
                    "created_utc": 1596023265.0,
                    "replies": [
                        {
                            "body": "Theyre incapable of seeing two women with one who happens to be doing better without assuming its a competition between the two of them\n\n\nIts typical pitting two women with no quarrels against each other, in fact these two get along, against each other and most of them had chosen SJH ten years ago.\n\nThey dont see SJH inability to garner screentime on her own as a weakness of her because theyre so sure shes perfect that they have to blame outside factors, Somin and the PDs",
                            "author": "Finklemeire",
                            "id": "fzmuk25",
                            "parent_id": "t1_fzm23fy",
                            "score": 11,
                            "created_utc": 1596040110.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love jeon somin too. She's the reason I started watching Running Man again. She just seems like such a natural comedian. Along the lines of yoo jae suk and lee kwang soo, actually.",
            "author": "chicheart",
            "id": "fzltu95",
            "parent_id": "t3_hzx1h0",
            "score": 41,
            "created_utc": 1596015531.0,
            "replies": []
        },
        {
            "body": "The haters really don’t realise that why she and Sechan seem to be ‘too much’ and ‘annoying’ is because when they joined, both of them are obviously feeling the pressure to perform well in a show that is already established. \n\nAnd they did well.",
            "author": "ckristeclairr",
            "id": "fzlxush",
            "parent_id": "t3_hzx1h0",
            "score": 32,
            "created_utc": 1596019525.0,
            "replies": [
                {
                    "body": "And I remember Jae Suk has to grade them too as mentioned in the Japan episode.",
                    "author": "mitchytan92",
                    "id": "fzlyd6l",
                    "parent_id": "t1_fzlxush",
                    "score": 5,
                    "created_utc": 1596020008.0,
                    "replies": [
                        {
                            "body": "which episode?",
                            "author": "awkwardchoshi",
                            "id": "gao5wsw",
                            "parent_id": "t1_fzlyd6l",
                            "score": 1,
                            "created_utc": 1604117305.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've literally just been battling all the hate comments on youtube comment sections from the latest episode! \nPeople make me sick. I will always defend her but I'm literally so sick and tired of those idiots.",
            "author": "Hanabi1993",
            "id": "fzluo7m",
            "parent_id": "t3_hzx1h0",
            "score": 30,
            "created_utc": 1596016371.0,
            "replies": [
                {
                    "body": "Fighting the good fight✊",
                    "author": "chicheart",
                    "id": "fzmb8q9",
                    "parent_id": "t1_fzluo7m",
                    "score": 7,
                    "created_utc": 1596029582.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "One factor that they never give her credit for (haters) is that through Somin, everyone has a chance to renew their relationship with the show, and even add fuel to those characters they used to portray.\n\nI.e\n\nTiger Moth Gang: With the addition of Somin, Lee Kwang Soo and Yoo Jae Suk don’t have to hard carry episodes that are boring between just their craziness. It’s also diversified now with Somin’s craziness. It allows for every team to have an opportunity to always be teamed with a crazy one.\n\nLove Frog: With Lee Kwang Soo being in a relationship, he definitely has taken a back seat for the one initiating love lines. It has also gotten dry since most female guest don’t respond as much. But with Somin fervently chasing men, there becomes a new life for the character.\n\nLetting SJH be SJH:  With the majority of cast being males, it is assumed that when there is a male guest it will ALWAYS be partnered for Jihyo. But with Somin’s addition, JiHyo can be simply partnered with Haha or JSJ which probably allows her more screen time anyways.\n\n\nBut y’all get the idea.\n\nNo Somin No Life.\n\n\nTL;DR Somin’s addition to the runningman has more pros than cons.",
            "author": "barbellsupertotal",
            "id": "fzm4kzq",
            "parent_id": "t3_hzx1h0",
            "score": 37,
            "created_utc": 1596025190.0,
            "replies": []
        },
        {
            "body": "I have no idea why they have so much hate towards her hmmm... is that some kind of obligatory thing or culture to have that much hate towards someone? smh",
            "author": "RevolutionaryCost59",
            "id": "fzlxej1",
            "parent_id": "t3_hzx1h0",
            "score": 12,
            "created_utc": 1596019087.0,
            "replies": []
        },
        {
            "body": "I love and appreciate Somin since the start because she's outgoing and isn't shy to perform the same embarrassing comedic acts as the guys dubbed comedians (Jae Suk, Se Chan, HaHa) .\n\nI feel like her haters are people who have not seen her growth through all the RM episodes, people who have watched RM since the beginning and feel bad Ji Hyo lost her spotlight when Gary left the show and got married and might think it was unfair for her, and a lot of people who believe a lady shouldn't act a certain way with male guests. Somin acts all shy and cute and flirty around male guests and that can be triggering to some, but then that's not fair because when the guys act a certain way with the female guests they don't get hate for that. She's trying her best to be equal to the males on the show and people should give her more respect for that.\n\n&#x200B;\n\nI wish there was a way to show her this thread and let her know that there are smarter people out there who appreciate her and want to see her continue on the show.",
            "author": "jaddiya",
            "id": "fznb365",
            "parent_id": "t3_hzx1h0",
            "score": 11,
            "created_utc": 1596048212.0,
            "replies": []
        },
        {
            "body": "Her comedic timing and instinct are really great. \n\nRemember how Kwang Soo put water in her bowl when they had the fall-backwards chair penalty? And how she immediately put her feet into her bowl? \nThere’s lots of examples of stuff like this.",
            "author": "GG-Duo",
            "id": "fzooj32",
            "parent_id": "t3_hzx1h0",
            "score": 12,
            "created_utc": 1596073429.0,
            "replies": [
                {
                    "body": "One of my favorites is WHen Kwangsoo snatched the hint and ran away with it and she sulked. Then KS said the hint says the spy is a beauty and she suddenly quipped that it is her. In that sense, both she and KS has great comedic timing.  \n\nAnother one where she said she is a man and removed her towel, and the bus game b/w her and Sechan where YJS said this was the best witty lines (?) are some of my favs.",
                    "author": "rainsunicecream",
                    "id": "fzpcho8",
                    "parent_id": "t1_fzooj32",
                    "score": 9,
                    "created_utc": 1596089363.0,
                    "replies": []
                },
                {
                    "body": "its too much,of course, some people love to lick a foot,or drinking water with foot of women,but not everybody,with me some joke of somin its to much,and problem its not every member join it,i dont know about this but somin do joke alone,it sick,with screentime always look her face not about her joke,work,something like that,they just send her face,2 min one times,its very sick,i know its not her problem but when jaesuk and kwang soo do joke,or pd said who win,i just want to know who win or joke or jeasuk kwangsoo,and running man send somin face 3-4 times,with every one saw her pretty,or feel ok with her joke it will fine,but with me,i dont saw her beuty,and her joke its too much and every not join it.u know somin its girl,they not join her joke like kwang soo,kickass,slap,yell,scream,throw.they need something do this like kwangsoo to release anger.its not same,its make me look like everyone not dare do anything,yes u love to drink water after foot dip of pretty girl,its okey,but i not so i hate somin,i want runningman used screenskip for kwangsoo and jaesuk face and joke ,than somin face",
                    "author": "Accomplished_Vast874",
                    "id": "im4ix68",
                    "parent_id": "t1_fzooj32",
                    "score": 1,
                    "created_utc": 1661693307.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "can't believe people actually dislike her on the show. she's grown on me and brings a lot of crazy to the table. she's so unpredictable and just cute at the same time how can you hate her",
            "author": "parkerzzz_",
            "id": "fzo522o",
            "parent_id": "t3_hzx1h0",
            "score": 8,
            "created_utc": 1596062822.0,
            "replies": []
        },
        {
            "body": "For those that didn't pay attention to it. Remember last episode, when she was just standing quiet minding her own business, KJK scolded her \"aren't you going to work?!?!! “ and YJS joined him in it. So yeah, that's how much they depend on her to lift some of their burden, and that's what she has been doing since joining RM... And I know them well enough, to say that they really appreciate her efforts and expect a lot more from her.\n\nPeople with taste and a brain, had already figured it out, others started groups where they brainwash those who cannot think for themselves, lack a proper vision of their own life, into thinking that she is a \"the villain\" in all of this. \n\nSo unless you want to do the same, I recomand to not fight or try to convince them... it's vain, and you will waste your precious time. Instead, be positive, leave her good comments and encouragements. She has the best seniors in the industry, who knows all of the ugly side of fans just too well, so I'm not worried about her mental health, but instead I want her to know that she is loved and cheered on.",
            "author": "Minguri22",
            "id": "fzlze3a",
            "parent_id": "t3_hzx1h0",
            "score": 27,
            "created_utc": 1596020959.0,
            "replies": []
        },
        {
            "body": "Honestly, I don't think you should feed into it unless you're sure you can change that person's mind. Every public person will have haters, and they tend to be so mentally and emotionally damaged, your opposition to them will just fuel their hatred. Just downvote, report, and get these posts deleted. Just keep showing your love for Somin on her projects and her social media pages. There will always be hate comments no matter what. Instead of arguing against them, drown them out with positive comments. \n\nAlso, I hope Somin finds true love soon. She deserves it and so much more!",
            "author": "wumikomiko",
            "id": "fzm9pfr",
            "parent_id": "t3_hzx1h0",
            "score": 18,
            "created_utc": 1596028637.0,
            "replies": []
        },
        {
            "body": "Go to her inst and leave some good comments. 👍",
            "author": "sonertimotei",
            "id": "fzmns1q",
            "parent_id": "t3_hzx1h0",
            "score": 8,
            "created_utc": 1596036505.0,
            "replies": []
        },
        {
            "body": "Sign me in",
            "author": "iLobeaa",
            "id": "fzpnp3j",
            "parent_id": "t3_hzx1h0",
            "score": 8,
            "created_utc": 1596100136.0,
            "replies": []
        },
        {
            "body": "Oh my mum and i love Somin too! We found her a great addition to the show! She is crazy, betrays (less than KS, so it is more fun) and up for anything.\n\nI dont get why people post so much hate on her insta. There are accounts posting the hate message and actively promoting others to do the same. They really need to find something better to do with their time. Not to mention the fact that it is very hurtful... I tried reporting the accounts for bullying but Im not sure if instagram did anything.",
            "author": "moriatea",
            "id": "fzmtf5w",
            "parent_id": "t3_hzx1h0",
            "score": 9,
            "created_utc": 1596039515.0,
            "replies": []
        },
        {
            "body": "I'm really sooo proud that a lot of people grow to love Sominie now 😭💜 I have my own bias aside from Somin but to see how many people appreciate her and her hardwork, it's so sweet 🙌🏻♥️",
            "author": null,
            "id": "fzmxty3",
            "parent_id": "t3_hzx1h0",
            "score": 6,
            "created_utc": 1596041808.0,
            "replies": []
        },
        {
            "body": "I agree that she doesn’t deserve the hate! Poor SoMin is so funny and goofy, so it’s refreshing. The people that hate on her but love JiHyo really make it awkward since both girls love each other. There’s no point in hating one when both are valuable to the show. SoMin fighting!!!!",
            "author": "varjen03",
            "id": "fznan6h",
            "parent_id": "t3_hzx1h0",
            "score": 6,
            "created_utc": 1596048003.0,
            "replies": []
        },
        {
            "body": "YAS OMG YAS! I’ve actually stopped watching running man for many years already and suddenly I got a YouTube video recommendation of funny scenes on Running Man and I immediately fell in love with Somin! \n\nI honestly don’t know why people can hate on her so much. If you don’t like her so be it, just keep those negative opinions and comments to yourself. We don’t need anymore negativity in the world. Just imagine how lousy you’ll feel if you posted something online and everyone just takes a dump on it. \n\nI’d imagine it must be tough to be in Somin’s shoes. She’s just trying her best and giving her all in the things that she’s doing. \n\nBtw is there like a Jeon Somin reddit thread? She’s such a lovable being and the only content I can get of her apart from her Instagram account are the short running man scenes on YouTube.",
            "author": "Cactuslife95",
            "id": "fzmcneg",
            "parent_id": "t3_hzx1h0",
            "score": 11,
            "created_utc": 1596030414.0,
            "replies": [
                {
                    "body": "Lowkey this subreddit is a jeon somin appreciation subreddit cause shes fking amazing.",
                    "author": "Finklemeire",
                    "id": "fzmuvfy",
                    "parent_id": "t1_fzmcneg",
                    "score": 9,
                    "created_utc": 1596040278.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why dont we start everyday of the week, posting what a good person each of the RM member are starting from Jeon Seo Min? It would be a great idea, as well as reminiscing the old episodes",
            "author": "Indomietelor",
            "id": "fzm23ow",
            "parent_id": "t3_hzx1h0",
            "score": 9,
            "created_utc": 1596023270.0,
            "replies": [
                {
                    "body": "i love this idea!! ♡",
                    "author": "httpsomin",
                    "id": "fzm2f2x",
                    "parent_id": "t1_fzm23ow",
                    "score": 3,
                    "created_utc": 1596023522.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't believe in protection squads as they sound slightly kpop-ish with its overtones of stanning and hero-worshipping an idol who cannot stand up for themselves. I believe SM antis also consider themselves as a protection squad in their twisted way. But I don't think that is what the OP intended since you are talking about leaving positive comments.\n\nUnlike some section of the RM fandom, I don't believe SM saved RM. That is discrediting the work of all the RM members and the PDs, in particular, Chul Min PD who came up with great ideas that made RM trendy again. But Chul Min PD wasn't so great at planned missions and would often leave it up to the members to create content. SM was able to blend in and create great content on her own that made RM exciting and fun to watch. More importantly, she was the breath of fresh air RM needed.\n\nI have a thing against stan culture and personality cults, especially around RM members. The hate on JSM is largely a result of insecurities of some SJH fans who have built a personality cult around her and consider her the best RM member.  They don't get it that being an entertainer is a job and a job you have to get better at like all jobs. For them, being an entertainer and star are one and the same. By this logic, their bias has to get everything, screen time, members' attention and male guests who fawn over her. JSM being a fellow female member and the latest addition to the team has been getting the brunt of it over the last three years, but truth to tell, it has always existed in some way or other even before. Female guests on RM used to be the recipients from time to time and any member who playfully hit or punched JH used to get it and so did the PDs who got accused of editing JH out with malicious intent. JSM came around with better talking skills and fewer inhibitions and she became the convenient target for all of JH's problems. That is how this cycle started.",
            "author": "springaugust",
            "id": "fzmy7hl",
            "parent_id": "t3_hzx1h0",
            "score": 9,
            "created_utc": 1596041998.0,
            "replies": [
                {
                    "body": "To be fair to SJH, she is doing much better than before, takes more initiative and her screen time is much more even now. Shouldn't some of the haters stop their campaigns seeing her improvement? But that is not the point for them. They think eliminating competition will make SJH shine better when that is not the way the variety scene works at all. There is so much for them to learn from each other and from others.\n\nWith all the hate propaganda, the two girls will never become as close as they could have been. JSM is weak at physical games and could have learnt from SJH how to fight back and strategize . SJH could have finally learnt from JSM to shed her inhibitions and make her  screen time. Instead of being someone who has to be carried in variety, she could have become someone capable of carrying a show. Outside the show, JH could have become a cool unnie for So Min who would teach her how to manage her health and longevity and not be the indirect cause of So Min's suffering. Sadly, these fans never think of what JH could have gained, only what she has lost, but that is something she would have lost anyway. \n\nI don't believe in raising one to put another down. What is happening with a section of JH fans can happen with a section of SM fans in the future if she joins a new show and someone better than her comes along. I hope that doesn't happen. So Min is definitely talented, but she will have to get a lot better with all the competition among female entertainers. There are so many stand out entertainers like Park Na Rae and Jang Da Yeon who have made it on their own. But many people think she can grow into a great entertainer with the right shows, PDs and mentors.\n\nFor JH to become better as an entertainer, she will have to change her attitude towards variety, let go more and be more willing to engage with others. But that will need a lot more effort on her part and doesn't have much to do with So Min, her colleagues or PDs That is what SM's antis never ever get.",
                    "author": "springaugust",
                    "id": "fzmyxxr",
                    "parent_id": "t1_fzmy7hl",
                    "score": 9,
                    "created_utc": 1596042364.0,
                    "replies": [
                        {
                            "body": "Agree with you about the stan-cult culture. As of now, JSM fans are not that big but I worry when I hear these 'need to protect her' kind of things even though I myself love her and support her. I think the best way to support her is to do it in positive ways and not get involved with the haters. It really affects the person's mental health and it is hard to stay on line at times because of the bitter feelings resulting from the quarrels.\n\nI am also looking forward to  Sm's new projects. But I kinda wonder if Kwangsoo's worry is becoming SM's reality about a variety image affecting acting career. Hope it is not so because I really miss her in acting roles.",
                            "author": "rainsunicecream",
                            "id": "fzpdyue",
                            "parent_id": "t1_fzmyxxr",
                            "score": 7,
                            "created_utc": 1596090669.0,
                            "replies": [
                                {
                                    "body": "I agree about not going overboard with the protection though so far, fans have mostly stayed within lines. Her fans generally appreciate her with other women. It would be interesting to see how the fandom behaves with the new tvn show where there are other female entertainers along with So Min and  inevitable comparisons will spring up.  As long as she performs like she has been doing, there won't arise a situation where fans have to defend her by bashing someone else. If she can also establish a good rapport with the women in the cast and put it out for fans to see and root for, stan far wars involving her will be minimal. Public acknowledgements of sismances in variety shows have always helped the fans stay within lines.\n\nKS had a lot of trouble with viewers accepting him in a serious role, but he has been finally acknowledged. Hope that happens with So Min.",
                                    "author": "springaugust",
                                    "id": "fzqe1s7",
                                    "parent_id": "t1_fzpdyue",
                                    "score": 4,
                                    "created_utc": 1596119967.0,
                                    "replies": [
                                        {
                                            "body": "I am curious about her and Jessi because Jessi has a really strong personality and  SM could become timid in front of her. This is only a thought and could easily be solved in the coming RM ep. I have only seen her in RM, some eps of unpretty rapstar, and her interview program. I don't know if it is the character she plays, but she is mostly this celeb who doesn't abide by the 'laws of variety' and comedy ensues from people like YJS and KS rein her in. I find her entertaining but just really curious about this pair. Ah, it doesn't help that *I have no* idea what kind of program this is.",
                                            "author": "rainsunicecream",
                                            "id": "fzriny4",
                                            "parent_id": "t1_fzqe1s7",
                                            "score": 2,
                                            "created_utc": 1596136555.0,
                                            "replies": [
                                                {
                                                    "body": "I think they’ll get along well off screen since Jessi is actually very sweet and Somin has a similar rep but I dunno about on screen chemistry yet. Like you said we’ll have to find out on the next RM ep that’s if they even interact much. It’s interesting because both are outlandish and tend to have no filter but in completely different ways. It’s rumoured the main cast might be 5-8 members so if their dynamic doesn’t quite work there will be several buffers to help out lol.",
                                                    "author": "RumblesFish",
                                                    "id": "fzwddp6",
                                                    "parent_id": "t1_fzriny4",
                                                    "score": 3,
                                                    "created_utc": 1596221490.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "i believe what Somin doing right now is exactly the same thing YJS, LKS, Haha did years ago. Trying so hard to be funny and act exaggeratedly (obviously it worked, they ARE funny). \n\nsome fans are just bitter because it 'overshadowed' Jihyo - which it isn't duh. fans should stop comparing Somin and Jihyo because they both have different character in the show...",
            "author": "najmiii",
            "id": "fzm2g72",
            "parent_id": "t3_hzx1h0",
            "score": 11,
            "created_utc": 1596023547.0,
            "replies": []
        },
        {
            "body": "honestly at first, i was totally okay with somin then i started to like her and get fond of her. but there was this day where i saw hate comments and for some reason, i was convinced and started to dislike her. i never wrote any hate comments whatsoever but in my mind i was annoyed and skipped her parts. but after like a month, i realized that somin is really the most mistreated member of the team by fans so far and i realized that the haters were just stupid and didn’t have a life, hating on an innocent person whos just doing their job. and i can’t believe i was one of them for a period of time. the haters somehow convinced me since there were so much comments and i started to believe in the majority’s decision but that was just stupid. as of now somin started growing on me and i realized that thats her job and she works really hard and always stays positive even when theres so much hate. i started to respect and look up to her and soon she became one of my favorites. seeing that she can handle all that hate and stay positive all the time and still continues to work hard no matter what people say, thats just amazing. \n\nshe gets hate when she does nothing, but she also gets hate for doing something. i also realized that it’s not somin’s fault that she’s disliked for screentime. honestly, i blame the pds for being so biased and making too much specials. so much less people wouldve disliked her if the pd wasnt so biased. i also get that she does many things for screentime but what i’m saying is her having too much specials is practically the only thing that made me dislike her at first.\n\nbut i will always support somin and her career! hopefully the hate will lessen even more and toxic fans will get a life rather than following her every move to hate on her.",
            "author": "reonningmaenfan",
            "id": "fzlwfgj",
            "parent_id": "t3_hzx1h0",
            "score": 3,
            "created_utc": 1596018132.0,
            "replies": []
        },
        {
            "body": "Its always those kids that are still in school on Thailand and Philippines that are real hardcore of Kpop having gang wars on BTS vs EXO vs Twice etc. No kidding they are real fked up. IMO just ignore those brats. There is no point arguing or discuss in reddit here because redditors are all intelligent beings with at least PhD.",
            "author": "mvrckgmr",
            "id": "fzm5fsy",
            "parent_id": "t3_hzx1h0",
            "score": 1,
            "created_utc": 1596025812.0,
            "replies": [
                {
                    "body": "RM is a 10 year old show, i don't think they're kids at all.",
                    "author": "NiallCraig",
                    "id": "fzoi77y",
                    "parent_id": "t1_fzm5fsy",
                    "score": 8,
                    "created_utc": 1596069916.0,
                    "replies": [
                        {
                            "body": "Not sure about that I saw a bunch of IG/fb accounts at least who were 10-14 year old making sexual jokes and saying that SM is very disrespectful. TI wonder how they fell into all these.",
                            "author": "rainsunicecream",
                            "id": "fzpet7t",
                            "parent_id": "t1_fzoi77y",
                            "score": 3,
                            "created_utc": 1596091422.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Agree about the last part. I saw posts here like these but haven't seen much haters interacting in the reddit. The haters are in FB and iG but I wonder how much will this reach them.",
                    "author": "rainsunicecream",
                    "id": "fzpf3od",
                    "parent_id": "t1_fzm5fsy",
                    "score": 1,
                    "created_utc": 1596091684.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "ELI5 and out of the loop....WTH is going on?",
            "author": "levintofu_WTF",
            "id": "fzmw555",
            "parent_id": "t3_hzx1h0",
            "score": 1,
            "created_utc": 1596040951.0,
            "replies": [
                {
                    "body": "People leave a lot of hate comments for So-min (including harassing her brother) and have since she started on the show. These comments include a lot of malicious rumors that are really misogynist in nature. I think this has potentially gotten worse with the announcement of her new show, and a lot of people are worried for her.\n\nA lot of her antis are Jihyo stans (I guess because they think two women can't exist in the same space without being enemies). Some of them are also fans of other members (I saw a really vitriolic comment once from a LKS fan because she betrayed LKS in an episode and he got a penalty. Which is the whole point of the show, but also, it wasn't even her fault that he got the penalty that episode), or can't deal with the fact that the show changed, or are just looking for people to bully.",
                    "author": "TopCoconut2",
                    "id": "fznnqk6",
                    "parent_id": "t1_fzmw555",
                    "score": 11,
                    "created_utc": 1596054189.0,
                    "replies": [
                        {
                            "body": "Cheers for the explanation. This explains her month off. Also, this is so ridiculous. If anything the show has gone back to its roots.",
                            "author": "levintofu_WTF",
                            "id": "fzr6qgc",
                            "parent_id": "t1_fznnqk6",
                            "score": 7,
                            "created_utc": 1596132813.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "do they still post hate craps on ig or twitter?\n\ni dont follow social media",
            "author": "yukyakyuk",
            "id": "fznbpt5",
            "parent_id": "t3_hzx1h0",
            "score": 1,
            "created_utc": 1596048508.0,
            "replies": [
                {
                    "body": "There's still the vocal bunch... Many are shippers for jihyo-kookie and Monday couple or those still living in the old running man...",
                    "author": "LifeSad07041997",
                    "id": "fznhq7s",
                    "parent_id": "t1_fznbpt5",
                    "score": 5,
                    "created_utc": 1596051316.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "fzrszml",
                            "parent_id": "t1_fznhq7s",
                            "score": 2,
                            "created_utc": 1596139272.0,
                            "replies": [
                                {
                                    "body": "It's like that crazy obsessive GF ... They have a particular focus on things...",
                                    "author": "LifeSad07041997",
                                    "id": "fzs11y5",
                                    "parent_id": "t1_fzrszml",
                                    "score": 1,
                                    "created_utc": 1596141019.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've watched every episode of RM (have seen all at least twice, except for the last year-ish). I first started watching when they were around episode 80-something, immediately got a hold of all the older episodes, and have been watching weekly since. \nMy favourite member has always been Song Ji Hyo, but I love all the members. She is usually quiet and doesn't get a lot of screen time, but I think that Ji Hyo really shines when she has a spy mission, she is really great at fooling the others imo. I also like hearing about and seeing the moments where she is taking care of the others and the guests. She just sounds like a caring, but quiet person (at least on RM). \n\nI do not understand why people hate on Jeon So Min so much. When So Min started, I did find her a bit annoying, but I certainly don't and have never hated her or hated on her. She has grown on me, and I do enjoy her a lot more. \n\nI do wonder if the level of protectiveness they feel for Ji Hyo comes from a specific incident in the past where she and Kim Jong Kook were almost fired. Then, with no other female coming close to being a regular (other than Lizzy, and that didn't last long) with another female coming into play they instead see her as a threat to Ji Hyo's position on the show. Not that it excuses the current behaviour.",
            "author": "uvanga",
            "id": "fznl6gb",
            "parent_id": "t3_hzx1h0",
            "score": 1,
            "created_utc": 1596052964.0,
            "replies": []
        },
        {
            "body": "Why are people just INCAPABLE of seeing two woman and NOT putting them against each other?\n\nWTH is wrong with these people, Jihyo is amazing and so is Somin!  \nSomin is not a replacement for Jihyo, and Jihyo is not getting less screentime because of Somin!!!\n\nJihyo is clearly not that bright anymore ( but I do think she's really getting better these days and I'm loving it), but Jihyo and Somin relantionship is good, they are on good terms, why can't the fandom see this simple thing?\n\nAlso, SJH is doing A LOT better nowadays, I really mean it, she's talking more, she is taking more iniciative, she's really getting back to her old self! But some \"\"JIhyo stans\"\" STILL claims somin is stealing her screentime??? Wth? If they say it like this it's the same as saying Jihyo's efforts are useless! Instead of hating on Somin they could cheer Jihyo by commenting they're glad she's a lot brighter now",
            "author": null,
            "id": "g2iqqfl",
            "parent_id": "t3_hzx1h0",
            "score": 1,
            "created_utc": 1598131234.0,
            "replies": []
        },
        {
            "body": "I think you should start a sub for Sominnie, so that her news and any help needed can be discussed there and not  here, as it adds to the negativity people hold for her. It would be good to have a consolidated and positive place for her.",
            "author": "real_highlight_reel",
            "id": "fzmf4ja",
            "parent_id": "t3_hzx1h0",
            "score": -7,
            "created_utc": 1596031830.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzlx9lv",
            "parent_id": "t3_hzx1h0",
            "score": -38,
            "created_utc": 1596018954.0,
            "replies": [
                {
                    "body": "Let's be honest here... SJH changed way before the addition of the maknaes... It got nothing to do with greed.\n\n2 points: 1st, your logic can apply to any other member, not only Somin. LKS and YJS for example, how many times when they carried the whole episode just by themselves? you call them greedy too for screen time?? I call them giving always their 100% no matter their condition, nor role on that day.\nOne is willing to run till north Korea on mud, breaking all rules and stealing the spotlight from 4 of the best guests RM has even known.\n\n2nd, there never been a quota that says, more screen time for one member mean less for another. They edit out what's useless and not funny, because the general public is merciless, they are not fans who just enjoy the routine of watching the members... You need to keep them on the channel, so no dull moment, or it's over!! We saw many times when an episode finish until the next week, that's just how good the footage was, it would be a waste to edit any of it. Which Btw didn't happen for a long time now... That should send you a clear message.\n\nThe Pd team is struggling, between giving in to the fans and loosing the general public, or try to appeal again to the masses and face the wrath of \"some\" fans.\nYou can clearly see what they choosed, and what's the result....",
                    "author": "Minguri22",
                    "id": "fzm0kpa",
                    "parent_id": "t1_fzlx9lv",
                    "score": 26,
                    "created_utc": 1596022000.0,
                    "replies": [
                        {
                            "body": "This shits only a problem with people cause shes a girl. If she were a boy nobody would bat an eye",
                            "author": "Finklemeire",
                            "id": "fzmv16x",
                            "parent_id": "t1_fzm0kpa",
                            "score": 17,
                            "created_utc": 1596040363.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">Song Ji Hyo became more bright and cheerful (I don't mean she dislikes Somin)\n\nYou may not mean this to sound like you're painting SJH as a bad person, but to say \"SJH got happier because her colleague was ill\" makes SJH sound like she's heartless.\n\nIt's also not true, she was improving with her new persona before JSM left, and (while she's had some quiet episodes) she's been doing well in this era of the new PD, including the episode where she and JSM were a team (I think they might be a team again next episode? I'm excited about that). I think SJH fans (to be clear, I'm an everyone fan) need to accept that Jihyo had a slump, she's working her way out of it, and be proud of her for that without making it about anyone else.",
                    "author": "TopCoconut2",
                    "id": "fznq34x",
                    "parent_id": "t1_fzlx9lv",
                    "score": 13,
                    "created_utc": 1596055308.0,
                    "replies": []
                },
                {
                    "body": "Song Jihyos lack of airtime is because of her lack of personality not cause of the existence of Somin's",
                    "author": "Finklemeire",
                    "id": "fzmuyxj",
                    "parent_id": "t1_fzlx9lv",
                    "score": 18,
                    "created_utc": 1596040330.0,
                    "replies": []
                },
                {
                    "body": ">The members aren't counting their screen time or telling the PDs/editors what to edit in or out, every member has their own camera & cameraman & is doing their own thing, some better than others in creating content that is entertaining enough to be aired. Pretty sure the low screen time members do not watch the show at all, either too busy or don't care to review their performance to improve. There's many posts on Reddit before JSM & YSC joined that discuss SJH's lack of screen time & why, even before Gary left, back then PDs weren't blamed for being bias toward the male members who earned more screen time than SJH. At the end of the day, RM is a job, like any job performance depends on the person who has that job, being active means screen time, ep513 you see SJH earn screen time because she took initiative in choosing JSJ who in turn would create good chemistry for her to work with where Angry Jihyo returned, SJH was acting playful which is rare, like pranking SoYu, something that JSM said she would've done to MiJoo if they were close. If SJH is happier without JSM being present, maybe because she was trying to fill the gap JSM left, why would SJH be the one who contacted JSM the most asking when she'd return, there's got to be a burden to SJH being the only girl member for years, JSM lifted that burden from SJH. The reason why new members JSM & YSC joined the show is because of their personalities & presence, you need that for a show that's been on many years which naturally can get stale, they in turn help the members reinvent their characters too.",
                    "author": "jhdnhc",
                    "id": "fzqpi6r",
                    "parent_id": "t1_fzlx9lv",
                    "score": 9,
                    "created_utc": 1596125444.0,
                    "replies": []
                },
                {
                    "body": ">she can be a bit greedy for the screentime and overwhelming sometimes\n\nWhy are we blaming her for getting so much screentime when she doesn't even edit the freaking show? The members make a lot of funny scenes, the editors and directors pick and choose what to put on the show. Somin is just doing her job, a job SJH is supposed to be good at as she has been on the show for 10 years but STILL struggles to find a role on the show.\n\n>to the point that other casts don't get enough screentime. \n\nI'm sorry what? I don't understand this. Most of the time when Somin makes a scene, it creates an opportunity for the other members to feed on.  Witty members like LKS, YJS, or JSJ wait for these moments to attacks her with snarky comments which results in more screen time for them as well. SJH gets little to no screen time because she is not as witty and spontaneous as the members so she relies on others to create a scene for her. (i.e YSC or JSJ). But unfortunately, as YJS mentioned before \"Sometimes Jihyo's answer is so bad, we can't even air them on the show.\"\n\n>You guys can see the effect of her overwhelming presence when she temporarily stopped filming due to her health.  \n\nYou can also see the effect before Somin and YSC joined the show when it was on the brink of getting canceled. But thank god to KJK, the show is still here to stay and its also thanks to the new members as well. They reignited the flame the show lost. I love Somin's energy and I love Sechan's awkwardness. IMO, it safe to say they saved the show. Btw, ratings don't matter, nobody watches tv that much nowadays.\n\nSo yeah, I love SJH but ever since Gary left and she lost her Monday couple role, she has only been in the background with only little memorable scenes. People need to stop kissing SJH's ass and blaming the other members for her lack of presence on the show. Instead, SJH needs to pull her own weight and not rely on others to get screentime if she wants to stay relevant on the show.",
                    "author": "SYLVASTRIAS",
                    "id": "fzm4gln",
                    "parent_id": "t1_fzlx9lv",
                    "score": 23,
                    "created_utc": 1596025099.0,
                    "replies": [
                        {
                            "body": ">SJH needs to pull her own weight and not rely on others to get screentime if she wants to stay relevant on the show\n\n\nThis 🙌🏻 no one gets blamed for one's screentime except for the person only. It really irks me that her fans hate on members because they're not \"helping sjh\" when she should be the one helping herself. I stan people who work their asses off and even defy situations that try to drag them down. For that, I stan all of the members since day 1. Now, sjh fell behind. It would be okay to see her trying even if she fails because everyone always gives her the stage when she suddenly want to say something but she's gotten so comfortable it doesn't feel like she's working anymore. I seriously want her fans to read this because there's a vast difference with the output they're giving.\n\nThey said not to compare them but the characters I see is the hardworking Somin and the wallflower Jihyo.",
                            "author": null,
                            "id": "fzmzx4g",
                            "parent_id": "t1_fzm4gln",
                            "score": 15,
                            "created_utc": 1596042853.0,
                            "replies": [
                                {
                                    "body": "Well, to be fair, Jihyo is working hard nowadays. I'll always say this, I was really disappointed w her because she's my favorite...But seeing how hard she's working now, taking more iniciative, talking more and getting back to \"Angry Jihyo\" \"Mong Jihyo\" and all that stuff makes me proud of her.\n\nThis doesn't mean she didn't have a bad era, she relies too much on the members since forever, you can see it on couple races because the pair w Jihyo almost never gets any screen time, sometimes they even skipped them 'till the last game. She's always been like this because she had Gary to rely on, so she felt confortable in just acting as a Monday Girlfriend, but then, Gary left and she lost this presence she had, even on episodes where the Monday Couple \"broke up\" she almost never have any screen time, althought, in the past, she would talk a lot more than nowadays.\n\nShe is obviously struggling to find a way to be active again, and I think she's fouding it since the new PD joined the show, you can see she's becomming a lot brighter and it has NOTHING to do with Somin being out of the show... When Somin took a break, Jihyo was already getting back to her old self and when Somin was \"gone\" she had to fill the void for her so she overdid it.\n\nWhen Somin got back to the show, both girls showed viewers how much they missed each other, and I think some toxic fans should appreciate this scene more and be proud of Jihyo for starting to work a little bit harder nowadays. I know she's an introvert and has said several times that she doesn't know how to take the iniciative, and I as an introvert know too how hard it is to finally be the one to start talking or joking around EVEN with friends I've known for years. Somin has 0 fault for her lack of screen time, the only one to be blamed is Jihyo herself and it really hurts me to say this, but I don't think it's a bad thing to say the truth.\n\nAlso, I am 100% sure the new PD talked to her about this, because the change is so noticible since the new PD joined that it's the only explanation, and I think these so called Jihyo fans should be praising her for it and not attacking Somin. As I said before, If people don't stop attacking Somin EVEN WHEN Jihyo is CLEARLY IMPROVING, it's the same thing as saying all the hardwork Jihyo is doing is useless",
                                    "author": null,
                                    "id": "g2itb62",
                                    "parent_id": "t1_fzmzx4g",
                                    "score": 1,
                                    "created_utc": 1598132675.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "No they dislike her because she’s a woman on the same show as Jihyo but she isn’t irrelevant or in the background. She can get screentime without winning games, is considered “girly” but still fit in with the rest of cast almost instantly. They loved the idea of Jihyo not only being the main woman on the show but also her being considered “one of the boys”. Seeing Somin get treated positively by them in the same way they treat Jihyo without her doing any of what she did is an issue for them. \n\nI dunno whether it’s because they vicariously live through Jihyo or because they’re still clinging onto the ace character and inaccurately believe it’s all she has to offer. Either way its the reason why they love the idea of the members secretly hating Somin and when the members prove otherwise they start attacking them. It’s the reason why they act as if the other members stopped caring about Jihyo and mistreat her in favour of Somin.\n\nIf Somin was a man and behaved the exact same way they wouldn’t be complaining this much. I mean look at all the hate she gets from flirting with male guests as part of her character. As if 3 different members didn’t used to do that regularly. This has nothing to do with the same old lie that Somin is greedy for screentime and everything to do with specific fans not understanding that two women can exist on one show and have their own merits and/or strengths that earn them screentime.",
                    "author": "RumblesFish",
                    "id": "fzw8tt3",
                    "parent_id": "t1_fzlx9lv",
                    "score": 4,
                    "created_utc": 1596219972.0,
                    "replies": []
                },
                {
                    "body": "I think SJH is just more cheerful and talking more these days with or without JSM. I feel like it is a switch of the PD that changed that actually.",
                    "author": "mitchytan92",
                    "id": "fzly2o7",
                    "parent_id": "t1_fzlx9lv",
                    "score": 9,
                    "created_utc": 1596019733.0,
                    "replies": [
                        {
                            "body": "Exactly, I truly believed the new PD talked to her about the situation...And they're not blind, they can see all the hate and they can clearly see that most of them are comming from Jihyo \"fans\"\n\nThese toxic people are truly brainless, I mean, If you look at the bigger picture, the one who's getting burdened out is Jihyo herself, her calling Somin the most often shows how much she cares about Somin, now imagine being the main reason as to why she had to take a break?\n\nI don't believe they are SJH fans at all, I see little to 0 comments on how Jihyo has been improving episode by episode, but I see A LOT of hate comments towards Somin. Where's all this energy when Jihyo is clearly trying her best nowadays? If they were truly Jihyo fans they would be praising her",
                            "author": null,
                            "id": "g2itrg8",
                            "parent_id": "t1_fzly2o7",
                            "score": 1,
                            "created_utc": 1598132925.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fzp6ce2",
                    "parent_id": "t1_fzlx9lv",
                    "score": -7,
                    "created_utc": 1596084492.0,
                    "replies": [
                        {
                            "body": "Really??!! Everyone has their own sense of humor, this is ok. What’s not ok is forming conspiracy theories from thin air and presenting them as facts. This is exactly why her fans feel the need to protect her.",
                            "author": "naniwewe",
                            "id": "fzp7ljy",
                            "parent_id": "t1_fzp6ce2",
                            "score": 13,
                            "created_utc": 1596085415.0,
                            "replies": []
                        },
                        {
                            "body": ">If screen time equates happiness, then look at SJH for 5 years, way before JSM even joined the show, SJH earned the least screen time back then & now whether it was 6,7,8 or 9 members, so SJH must be super sad since she's not the center of attention anymore, you make SJH look bad, don't be a SJH hater, SJH's actually nice like the other members you try to portray as villains, in ep513 JSJ even said the other members have a good personality like YSC, KJK, JSM, people who actually work with them, who know them, not some biased random viewer.",
                            "author": "jhdnhc",
                            "id": "fzqupww",
                            "parent_id": "t1_fzp6ce2",
                            "score": 9,
                            "created_utc": 1596127930.0,
                            "replies": []
                        },
                        {
                            "body": "I’m sorry but your comment is just laughable to me. I’ll address the first half only since the second half is too ridiculous for me to respond to.\n\nIt’s amazing how you guys have convinced yourselves that Somin cares about how much screentime she gets because she has the nerve to actually do her job. Making up scenarios to fit your “greedy for screentime/stealing screentime” narrative. All while still complaining about her when she’s more reserved. \n\nI will say the weirdest thing about this is people like you complaining about the screentime Somin gets but will still monitor her every move on the show when she’s less active.",
                            "author": "RumblesFish",
                            "id": "fzw2ig7",
                            "parent_id": "t1_fzp6ce2",
                            "score": 5,
                            "created_utc": 1596217888.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Fact is shes not at all like sjh who most of the haters habe chosen to identify with.\n\nShes less pretty (societally at large SJH is considered prettier), not aloof, not winning everything and clearly into lovey dovey girly stuff.\n\nYet shes the carry of the show. The people who hate on her dont understand it cause theyre mindset is still in the early 2010s when winnig was all that mattered on the show.\n\nNow they see in their minds an inferior in every way girl do better than the ideal female in SJH in terms of air time and their peanut brains cant comprehend it.\n\nThey shit on her and believe she sleeps around with the PDs cause apparently they have no sense of humor or personality cause theyre blind to why everyone loves Somin",
            "author": "Finklemeire",
            "id": "fzmub14",
            "parent_id": "t1_fzlr6oz",
            "score": 26,
            "created_utc": 1596039978.0,
            "replies": []
        },
        {
            "body": "honestly yes i dont get why people pit somin against jihyo?? they are two different people who both play important roles in rm!!",
            "author": "rscpctals",
            "id": "fzm23fy",
            "parent_id": "t1_fzluuos",
            "score": 10,
            "created_utc": 1596023265.0,
            "replies": [
                {
                    "body": "Theyre incapable of seeing two women with one who happens to be doing better without assuming its a competition between the two of them\n\n\nIts typical pitting two women with no quarrels against each other, in fact these two get along, against each other and most of them had chosen SJH ten years ago.\n\nThey dont see SJH inability to garner screentime on her own as a weakness of her because theyre so sure shes perfect that they have to blame outside factors, Somin and the PDs",
                    "author": "Finklemeire",
                    "id": "fzmuk25",
                    "parent_id": "t1_fzm23fy",
                    "score": 11,
                    "created_utc": 1596040110.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And I remember Jae Suk has to grade them too as mentioned in the Japan episode.",
            "author": "mitchytan92",
            "id": "fzlyd6l",
            "parent_id": "t1_fzlxush",
            "score": 5,
            "created_utc": 1596020008.0,
            "replies": [
                {
                    "body": "which episode?",
                    "author": "awkwardchoshi",
                    "id": "gao5wsw",
                    "parent_id": "t1_fzlyd6l",
                    "score": 1,
                    "created_utc": 1604117305.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fighting the good fight✊",
            "author": "chicheart",
            "id": "fzmb8q9",
            "parent_id": "t1_fzluo7m",
            "score": 7,
            "created_utc": 1596029582.0,
            "replies": []
        },
        {
            "body": "One of my favorites is WHen Kwangsoo snatched the hint and ran away with it and she sulked. Then KS said the hint says the spy is a beauty and she suddenly quipped that it is her. In that sense, both she and KS has great comedic timing.  \n\nAnother one where she said she is a man and removed her towel, and the bus game b/w her and Sechan where YJS said this was the best witty lines (?) are some of my favs.",
            "author": "rainsunicecream",
            "id": "fzpcho8",
            "parent_id": "t1_fzooj32",
            "score": 9,
            "created_utc": 1596089363.0,
            "replies": []
        },
        {
            "body": "its too much,of course, some people love to lick a foot,or drinking water with foot of women,but not everybody,with me some joke of somin its to much,and problem its not every member join it,i dont know about this but somin do joke alone,it sick,with screentime always look her face not about her joke,work,something like that,they just send her face,2 min one times,its very sick,i know its not her problem but when jaesuk and kwang soo do joke,or pd said who win,i just want to know who win or joke or jeasuk kwangsoo,and running man send somin face 3-4 times,with every one saw her pretty,or feel ok with her joke it will fine,but with me,i dont saw her beuty,and her joke its too much and every not join it.u know somin its girl,they not join her joke like kwang soo,kickass,slap,yell,scream,throw.they need something do this like kwangsoo to release anger.its not same,its make me look like everyone not dare do anything,yes u love to drink water after foot dip of pretty girl,its okey,but i not so i hate somin,i want runningman used screenskip for kwangsoo and jaesuk face and joke ,than somin face",
            "author": "Accomplished_Vast874",
            "id": "im4ix68",
            "parent_id": "t1_fzooj32",
            "score": 1,
            "created_utc": 1661693307.0,
            "replies": []
        },
        {
            "body": "Lowkey this subreddit is a jeon somin appreciation subreddit cause shes fking amazing.",
            "author": "Finklemeire",
            "id": "fzmuvfy",
            "parent_id": "t1_fzmcneg",
            "score": 9,
            "created_utc": 1596040278.0,
            "replies": []
        },
        {
            "body": "i love this idea!! ♡",
            "author": "httpsomin",
            "id": "fzm2f2x",
            "parent_id": "t1_fzm23ow",
            "score": 3,
            "created_utc": 1596023522.0,
            "replies": []
        },
        {
            "body": "To be fair to SJH, she is doing much better than before, takes more initiative and her screen time is much more even now. Shouldn't some of the haters stop their campaigns seeing her improvement? But that is not the point for them. They think eliminating competition will make SJH shine better when that is not the way the variety scene works at all. There is so much for them to learn from each other and from others.\n\nWith all the hate propaganda, the two girls will never become as close as they could have been. JSM is weak at physical games and could have learnt from SJH how to fight back and strategize . SJH could have finally learnt from JSM to shed her inhibitions and make her  screen time. Instead of being someone who has to be carried in variety, she could have become someone capable of carrying a show. Outside the show, JH could have become a cool unnie for So Min who would teach her how to manage her health and longevity and not be the indirect cause of So Min's suffering. Sadly, these fans never think of what JH could have gained, only what she has lost, but that is something she would have lost anyway. \n\nI don't believe in raising one to put another down. What is happening with a section of JH fans can happen with a section of SM fans in the future if she joins a new show and someone better than her comes along. I hope that doesn't happen. So Min is definitely talented, but she will have to get a lot better with all the competition among female entertainers. There are so many stand out entertainers like Park Na Rae and Jang Da Yeon who have made it on their own. But many people think she can grow into a great entertainer with the right shows, PDs and mentors.\n\nFor JH to become better as an entertainer, she will have to change her attitude towards variety, let go more and be more willing to engage with others. But that will need a lot more effort on her part and doesn't have much to do with So Min, her colleagues or PDs That is what SM's antis never ever get.",
            "author": "springaugust",
            "id": "fzmyxxr",
            "parent_id": "t1_fzmy7hl",
            "score": 9,
            "created_utc": 1596042364.0,
            "replies": [
                {
                    "body": "Agree with you about the stan-cult culture. As of now, JSM fans are not that big but I worry when I hear these 'need to protect her' kind of things even though I myself love her and support her. I think the best way to support her is to do it in positive ways and not get involved with the haters. It really affects the person's mental health and it is hard to stay on line at times because of the bitter feelings resulting from the quarrels.\n\nI am also looking forward to  Sm's new projects. But I kinda wonder if Kwangsoo's worry is becoming SM's reality about a variety image affecting acting career. Hope it is not so because I really miss her in acting roles.",
                    "author": "rainsunicecream",
                    "id": "fzpdyue",
                    "parent_id": "t1_fzmyxxr",
                    "score": 7,
                    "created_utc": 1596090669.0,
                    "replies": [
                        {
                            "body": "I agree about not going overboard with the protection though so far, fans have mostly stayed within lines. Her fans generally appreciate her with other women. It would be interesting to see how the fandom behaves with the new tvn show where there are other female entertainers along with So Min and  inevitable comparisons will spring up.  As long as she performs like she has been doing, there won't arise a situation where fans have to defend her by bashing someone else. If she can also establish a good rapport with the women in the cast and put it out for fans to see and root for, stan far wars involving her will be minimal. Public acknowledgements of sismances in variety shows have always helped the fans stay within lines.\n\nKS had a lot of trouble with viewers accepting him in a serious role, but he has been finally acknowledged. Hope that happens with So Min.",
                            "author": "springaugust",
                            "id": "fzqe1s7",
                            "parent_id": "t1_fzpdyue",
                            "score": 4,
                            "created_utc": 1596119967.0,
                            "replies": [
                                {
                                    "body": "I am curious about her and Jessi because Jessi has a really strong personality and  SM could become timid in front of her. This is only a thought and could easily be solved in the coming RM ep. I have only seen her in RM, some eps of unpretty rapstar, and her interview program. I don't know if it is the character she plays, but she is mostly this celeb who doesn't abide by the 'laws of variety' and comedy ensues from people like YJS and KS rein her in. I find her entertaining but just really curious about this pair. Ah, it doesn't help that *I have no* idea what kind of program this is.",
                                    "author": "rainsunicecream",
                                    "id": "fzriny4",
                                    "parent_id": "t1_fzqe1s7",
                                    "score": 2,
                                    "created_utc": 1596136555.0,
                                    "replies": [
                                        {
                                            "body": "I think they’ll get along well off screen since Jessi is actually very sweet and Somin has a similar rep but I dunno about on screen chemistry yet. Like you said we’ll have to find out on the next RM ep that’s if they even interact much. It’s interesting because both are outlandish and tend to have no filter but in completely different ways. It’s rumoured the main cast might be 5-8 members so if their dynamic doesn’t quite work there will be several buffers to help out lol.",
                                            "author": "RumblesFish",
                                            "id": "fzwddp6",
                                            "parent_id": "t1_fzriny4",
                                            "score": 3,
                                            "created_utc": 1596221490.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "RM is a 10 year old show, i don't think they're kids at all.",
            "author": "NiallCraig",
            "id": "fzoi77y",
            "parent_id": "t1_fzm5fsy",
            "score": 8,
            "created_utc": 1596069916.0,
            "replies": [
                {
                    "body": "Not sure about that I saw a bunch of IG/fb accounts at least who were 10-14 year old making sexual jokes and saying that SM is very disrespectful. TI wonder how they fell into all these.",
                    "author": "rainsunicecream",
                    "id": "fzpet7t",
                    "parent_id": "t1_fzoi77y",
                    "score": 3,
                    "created_utc": 1596091422.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agree about the last part. I saw posts here like these but haven't seen much haters interacting in the reddit. The haters are in FB and iG but I wonder how much will this reach them.",
            "author": "rainsunicecream",
            "id": "fzpf3od",
            "parent_id": "t1_fzm5fsy",
            "score": 1,
            "created_utc": 1596091684.0,
            "replies": []
        },
        {
            "body": "People leave a lot of hate comments for So-min (including harassing her brother) and have since she started on the show. These comments include a lot of malicious rumors that are really misogynist in nature. I think this has potentially gotten worse with the announcement of her new show, and a lot of people are worried for her.\n\nA lot of her antis are Jihyo stans (I guess because they think two women can't exist in the same space without being enemies). Some of them are also fans of other members (I saw a really vitriolic comment once from a LKS fan because she betrayed LKS in an episode and he got a penalty. Which is the whole point of the show, but also, it wasn't even her fault that he got the penalty that episode), or can't deal with the fact that the show changed, or are just looking for people to bully.",
            "author": "TopCoconut2",
            "id": "fznnqk6",
            "parent_id": "t1_fzmw555",
            "score": 11,
            "created_utc": 1596054189.0,
            "replies": [
                {
                    "body": "Cheers for the explanation. This explains her month off. Also, this is so ridiculous. If anything the show has gone back to its roots.",
                    "author": "levintofu_WTF",
                    "id": "fzr6qgc",
                    "parent_id": "t1_fznnqk6",
                    "score": 7,
                    "created_utc": 1596132813.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There's still the vocal bunch... Many are shippers for jihyo-kookie and Monday couple or those still living in the old running man...",
            "author": "LifeSad07041997",
            "id": "fznhq7s",
            "parent_id": "t1_fznbpt5",
            "score": 5,
            "created_utc": 1596051316.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fzrszml",
                    "parent_id": "t1_fznhq7s",
                    "score": 2,
                    "created_utc": 1596139272.0,
                    "replies": [
                        {
                            "body": "It's like that crazy obsessive GF ... They have a particular focus on things...",
                            "author": "LifeSad07041997",
                            "id": "fzs11y5",
                            "parent_id": "t1_fzrszml",
                            "score": 1,
                            "created_utc": 1596141019.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Let's be honest here... SJH changed way before the addition of the maknaes... It got nothing to do with greed.\n\n2 points: 1st, your logic can apply to any other member, not only Somin. LKS and YJS for example, how many times when they carried the whole episode just by themselves? you call them greedy too for screen time?? I call them giving always their 100% no matter their condition, nor role on that day.\nOne is willing to run till north Korea on mud, breaking all rules and stealing the spotlight from 4 of the best guests RM has even known.\n\n2nd, there never been a quota that says, more screen time for one member mean less for another. They edit out what's useless and not funny, because the general public is merciless, they are not fans who just enjoy the routine of watching the members... You need to keep them on the channel, so no dull moment, or it's over!! We saw many times when an episode finish until the next week, that's just how good the footage was, it would be a waste to edit any of it. Which Btw didn't happen for a long time now... That should send you a clear message.\n\nThe Pd team is struggling, between giving in to the fans and loosing the general public, or try to appeal again to the masses and face the wrath of \"some\" fans.\nYou can clearly see what they choosed, and what's the result....",
            "author": "Minguri22",
            "id": "fzm0kpa",
            "parent_id": "t1_fzlx9lv",
            "score": 26,
            "created_utc": 1596022000.0,
            "replies": [
                {
                    "body": "This shits only a problem with people cause shes a girl. If she were a boy nobody would bat an eye",
                    "author": "Finklemeire",
                    "id": "fzmv16x",
                    "parent_id": "t1_fzm0kpa",
                    "score": 17,
                    "created_utc": 1596040363.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Song Ji Hyo became more bright and cheerful (I don't mean she dislikes Somin)\n\nYou may not mean this to sound like you're painting SJH as a bad person, but to say \"SJH got happier because her colleague was ill\" makes SJH sound like she's heartless.\n\nIt's also not true, she was improving with her new persona before JSM left, and (while she's had some quiet episodes) she's been doing well in this era of the new PD, including the episode where she and JSM were a team (I think they might be a team again next episode? I'm excited about that). I think SJH fans (to be clear, I'm an everyone fan) need to accept that Jihyo had a slump, she's working her way out of it, and be proud of her for that without making it about anyone else.",
            "author": "TopCoconut2",
            "id": "fznq34x",
            "parent_id": "t1_fzlx9lv",
            "score": 13,
            "created_utc": 1596055308.0,
            "replies": []
        },
        {
            "body": "Song Jihyos lack of airtime is because of her lack of personality not cause of the existence of Somin's",
            "author": "Finklemeire",
            "id": "fzmuyxj",
            "parent_id": "t1_fzlx9lv",
            "score": 18,
            "created_utc": 1596040330.0,
            "replies": []
        },
        {
            "body": ">The members aren't counting their screen time or telling the PDs/editors what to edit in or out, every member has their own camera & cameraman & is doing their own thing, some better than others in creating content that is entertaining enough to be aired. Pretty sure the low screen time members do not watch the show at all, either too busy or don't care to review their performance to improve. There's many posts on Reddit before JSM & YSC joined that discuss SJH's lack of screen time & why, even before Gary left, back then PDs weren't blamed for being bias toward the male members who earned more screen time than SJH. At the end of the day, RM is a job, like any job performance depends on the person who has that job, being active means screen time, ep513 you see SJH earn screen time because she took initiative in choosing JSJ who in turn would create good chemistry for her to work with where Angry Jihyo returned, SJH was acting playful which is rare, like pranking SoYu, something that JSM said she would've done to MiJoo if they were close. If SJH is happier without JSM being present, maybe because she was trying to fill the gap JSM left, why would SJH be the one who contacted JSM the most asking when she'd return, there's got to be a burden to SJH being the only girl member for years, JSM lifted that burden from SJH. The reason why new members JSM & YSC joined the show is because of their personalities & presence, you need that for a show that's been on many years which naturally can get stale, they in turn help the members reinvent their characters too.",
            "author": "jhdnhc",
            "id": "fzqpi6r",
            "parent_id": "t1_fzlx9lv",
            "score": 9,
            "created_utc": 1596125444.0,
            "replies": []
        },
        {
            "body": ">she can be a bit greedy for the screentime and overwhelming sometimes\n\nWhy are we blaming her for getting so much screentime when she doesn't even edit the freaking show? The members make a lot of funny scenes, the editors and directors pick and choose what to put on the show. Somin is just doing her job, a job SJH is supposed to be good at as she has been on the show for 10 years but STILL struggles to find a role on the show.\n\n>to the point that other casts don't get enough screentime. \n\nI'm sorry what? I don't understand this. Most of the time when Somin makes a scene, it creates an opportunity for the other members to feed on.  Witty members like LKS, YJS, or JSJ wait for these moments to attacks her with snarky comments which results in more screen time for them as well. SJH gets little to no screen time because she is not as witty and spontaneous as the members so she relies on others to create a scene for her. (i.e YSC or JSJ). But unfortunately, as YJS mentioned before \"Sometimes Jihyo's answer is so bad, we can't even air them on the show.\"\n\n>You guys can see the effect of her overwhelming presence when she temporarily stopped filming due to her health.  \n\nYou can also see the effect before Somin and YSC joined the show when it was on the brink of getting canceled. But thank god to KJK, the show is still here to stay and its also thanks to the new members as well. They reignited the flame the show lost. I love Somin's energy and I love Sechan's awkwardness. IMO, it safe to say they saved the show. Btw, ratings don't matter, nobody watches tv that much nowadays.\n\nSo yeah, I love SJH but ever since Gary left and she lost her Monday couple role, she has only been in the background with only little memorable scenes. People need to stop kissing SJH's ass and blaming the other members for her lack of presence on the show. Instead, SJH needs to pull her own weight and not rely on others to get screentime if she wants to stay relevant on the show.",
            "author": "SYLVASTRIAS",
            "id": "fzm4gln",
            "parent_id": "t1_fzlx9lv",
            "score": 23,
            "created_utc": 1596025099.0,
            "replies": [
                {
                    "body": ">SJH needs to pull her own weight and not rely on others to get screentime if she wants to stay relevant on the show\n\n\nThis 🙌🏻 no one gets blamed for one's screentime except for the person only. It really irks me that her fans hate on members because they're not \"helping sjh\" when she should be the one helping herself. I stan people who work their asses off and even defy situations that try to drag them down. For that, I stan all of the members since day 1. Now, sjh fell behind. It would be okay to see her trying even if she fails because everyone always gives her the stage when she suddenly want to say something but she's gotten so comfortable it doesn't feel like she's working anymore. I seriously want her fans to read this because there's a vast difference with the output they're giving.\n\nThey said not to compare them but the characters I see is the hardworking Somin and the wallflower Jihyo.",
                    "author": null,
                    "id": "fzmzx4g",
                    "parent_id": "t1_fzm4gln",
                    "score": 15,
                    "created_utc": 1596042853.0,
                    "replies": [
                        {
                            "body": "Well, to be fair, Jihyo is working hard nowadays. I'll always say this, I was really disappointed w her because she's my favorite...But seeing how hard she's working now, taking more iniciative, talking more and getting back to \"Angry Jihyo\" \"Mong Jihyo\" and all that stuff makes me proud of her.\n\nThis doesn't mean she didn't have a bad era, she relies too much on the members since forever, you can see it on couple races because the pair w Jihyo almost never gets any screen time, sometimes they even skipped them 'till the last game. She's always been like this because she had Gary to rely on, so she felt confortable in just acting as a Monday Girlfriend, but then, Gary left and she lost this presence she had, even on episodes where the Monday Couple \"broke up\" she almost never have any screen time, althought, in the past, she would talk a lot more than nowadays.\n\nShe is obviously struggling to find a way to be active again, and I think she's fouding it since the new PD joined the show, you can see she's becomming a lot brighter and it has NOTHING to do with Somin being out of the show... When Somin took a break, Jihyo was already getting back to her old self and when Somin was \"gone\" she had to fill the void for her so she overdid it.\n\nWhen Somin got back to the show, both girls showed viewers how much they missed each other, and I think some toxic fans should appreciate this scene more and be proud of Jihyo for starting to work a little bit harder nowadays. I know she's an introvert and has said several times that she doesn't know how to take the iniciative, and I as an introvert know too how hard it is to finally be the one to start talking or joking around EVEN with friends I've known for years. Somin has 0 fault for her lack of screen time, the only one to be blamed is Jihyo herself and it really hurts me to say this, but I don't think it's a bad thing to say the truth.\n\nAlso, I am 100% sure the new PD talked to her about this, because the change is so noticible since the new PD joined that it's the only explanation, and I think these so called Jihyo fans should be praising her for it and not attacking Somin. As I said before, If people don't stop attacking Somin EVEN WHEN Jihyo is CLEARLY IMPROVING, it's the same thing as saying all the hardwork Jihyo is doing is useless",
                            "author": null,
                            "id": "g2itb62",
                            "parent_id": "t1_fzmzx4g",
                            "score": 1,
                            "created_utc": 1598132675.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No they dislike her because she’s a woman on the same show as Jihyo but she isn’t irrelevant or in the background. She can get screentime without winning games, is considered “girly” but still fit in with the rest of cast almost instantly. They loved the idea of Jihyo not only being the main woman on the show but also her being considered “one of the boys”. Seeing Somin get treated positively by them in the same way they treat Jihyo without her doing any of what she did is an issue for them. \n\nI dunno whether it’s because they vicariously live through Jihyo or because they’re still clinging onto the ace character and inaccurately believe it’s all she has to offer. Either way its the reason why they love the idea of the members secretly hating Somin and when the members prove otherwise they start attacking them. It’s the reason why they act as if the other members stopped caring about Jihyo and mistreat her in favour of Somin.\n\nIf Somin was a man and behaved the exact same way they wouldn’t be complaining this much. I mean look at all the hate she gets from flirting with male guests as part of her character. As if 3 different members didn’t used to do that regularly. This has nothing to do with the same old lie that Somin is greedy for screentime and everything to do with specific fans not understanding that two women can exist on one show and have their own merits and/or strengths that earn them screentime.",
            "author": "RumblesFish",
            "id": "fzw8tt3",
            "parent_id": "t1_fzlx9lv",
            "score": 4,
            "created_utc": 1596219972.0,
            "replies": []
        },
        {
            "body": "I think SJH is just more cheerful and talking more these days with or without JSM. I feel like it is a switch of the PD that changed that actually.",
            "author": "mitchytan92",
            "id": "fzly2o7",
            "parent_id": "t1_fzlx9lv",
            "score": 9,
            "created_utc": 1596019733.0,
            "replies": [
                {
                    "body": "Exactly, I truly believed the new PD talked to her about the situation...And they're not blind, they can see all the hate and they can clearly see that most of them are comming from Jihyo \"fans\"\n\nThese toxic people are truly brainless, I mean, If you look at the bigger picture, the one who's getting burdened out is Jihyo herself, her calling Somin the most often shows how much she cares about Somin, now imagine being the main reason as to why she had to take a break?\n\nI don't believe they are SJH fans at all, I see little to 0 comments on how Jihyo has been improving episode by episode, but I see A LOT of hate comments towards Somin. Where's all this energy when Jihyo is clearly trying her best nowadays? If they were truly Jihyo fans they would be praising her",
                    "author": null,
                    "id": "g2itrg8",
                    "parent_id": "t1_fzly2o7",
                    "score": 1,
                    "created_utc": 1598132925.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzp6ce2",
            "parent_id": "t1_fzlx9lv",
            "score": -7,
            "created_utc": 1596084492.0,
            "replies": [
                {
                    "body": "Really??!! Everyone has their own sense of humor, this is ok. What’s not ok is forming conspiracy theories from thin air and presenting them as facts. This is exactly why her fans feel the need to protect her.",
                    "author": "naniwewe",
                    "id": "fzp7ljy",
                    "parent_id": "t1_fzp6ce2",
                    "score": 13,
                    "created_utc": 1596085415.0,
                    "replies": []
                },
                {
                    "body": ">If screen time equates happiness, then look at SJH for 5 years, way before JSM even joined the show, SJH earned the least screen time back then & now whether it was 6,7,8 or 9 members, so SJH must be super sad since she's not the center of attention anymore, you make SJH look bad, don't be a SJH hater, SJH's actually nice like the other members you try to portray as villains, in ep513 JSJ even said the other members have a good personality like YSC, KJK, JSM, people who actually work with them, who know them, not some biased random viewer.",
                    "author": "jhdnhc",
                    "id": "fzqupww",
                    "parent_id": "t1_fzp6ce2",
                    "score": 9,
                    "created_utc": 1596127930.0,
                    "replies": []
                },
                {
                    "body": "I’m sorry but your comment is just laughable to me. I’ll address the first half only since the second half is too ridiculous for me to respond to.\n\nIt’s amazing how you guys have convinced yourselves that Somin cares about how much screentime she gets because she has the nerve to actually do her job. Making up scenarios to fit your “greedy for screentime/stealing screentime” narrative. All while still complaining about her when she’s more reserved. \n\nI will say the weirdest thing about this is people like you complaining about the screentime Somin gets but will still monitor her every move on the show when she’s less active.",
                    "author": "RumblesFish",
                    "id": "fzw2ig7",
                    "parent_id": "t1_fzp6ce2",
                    "score": 5,
                    "created_utc": 1596217888.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Theyre incapable of seeing two women with one who happens to be doing better without assuming its a competition between the two of them\n\n\nIts typical pitting two women with no quarrels against each other, in fact these two get along, against each other and most of them had chosen SJH ten years ago.\n\nThey dont see SJH inability to garner screentime on her own as a weakness of her because theyre so sure shes perfect that they have to blame outside factors, Somin and the PDs",
            "author": "Finklemeire",
            "id": "fzmuk25",
            "parent_id": "t1_fzm23fy",
            "score": 11,
            "created_utc": 1596040110.0,
            "replies": []
        },
        {
            "body": "which episode?",
            "author": "awkwardchoshi",
            "id": "gao5wsw",
            "parent_id": "t1_fzlyd6l",
            "score": 1,
            "created_utc": 1604117305.0,
            "replies": []
        },
        {
            "body": "Agree with you about the stan-cult culture. As of now, JSM fans are not that big but I worry when I hear these 'need to protect her' kind of things even though I myself love her and support her. I think the best way to support her is to do it in positive ways and not get involved with the haters. It really affects the person's mental health and it is hard to stay on line at times because of the bitter feelings resulting from the quarrels.\n\nI am also looking forward to  Sm's new projects. But I kinda wonder if Kwangsoo's worry is becoming SM's reality about a variety image affecting acting career. Hope it is not so because I really miss her in acting roles.",
            "author": "rainsunicecream",
            "id": "fzpdyue",
            "parent_id": "t1_fzmyxxr",
            "score": 7,
            "created_utc": 1596090669.0,
            "replies": [
                {
                    "body": "I agree about not going overboard with the protection though so far, fans have mostly stayed within lines. Her fans generally appreciate her with other women. It would be interesting to see how the fandom behaves with the new tvn show where there are other female entertainers along with So Min and  inevitable comparisons will spring up.  As long as she performs like she has been doing, there won't arise a situation where fans have to defend her by bashing someone else. If she can also establish a good rapport with the women in the cast and put it out for fans to see and root for, stan far wars involving her will be minimal. Public acknowledgements of sismances in variety shows have always helped the fans stay within lines.\n\nKS had a lot of trouble with viewers accepting him in a serious role, but he has been finally acknowledged. Hope that happens with So Min.",
                    "author": "springaugust",
                    "id": "fzqe1s7",
                    "parent_id": "t1_fzpdyue",
                    "score": 4,
                    "created_utc": 1596119967.0,
                    "replies": [
                        {
                            "body": "I am curious about her and Jessi because Jessi has a really strong personality and  SM could become timid in front of her. This is only a thought and could easily be solved in the coming RM ep. I have only seen her in RM, some eps of unpretty rapstar, and her interview program. I don't know if it is the character she plays, but she is mostly this celeb who doesn't abide by the 'laws of variety' and comedy ensues from people like YJS and KS rein her in. I find her entertaining but just really curious about this pair. Ah, it doesn't help that *I have no* idea what kind of program this is.",
                            "author": "rainsunicecream",
                            "id": "fzriny4",
                            "parent_id": "t1_fzqe1s7",
                            "score": 2,
                            "created_utc": 1596136555.0,
                            "replies": [
                                {
                                    "body": "I think they’ll get along well off screen since Jessi is actually very sweet and Somin has a similar rep but I dunno about on screen chemistry yet. Like you said we’ll have to find out on the next RM ep that’s if they even interact much. It’s interesting because both are outlandish and tend to have no filter but in completely different ways. It’s rumoured the main cast might be 5-8 members so if their dynamic doesn’t quite work there will be several buffers to help out lol.",
                                    "author": "RumblesFish",
                                    "id": "fzwddp6",
                                    "parent_id": "t1_fzriny4",
                                    "score": 3,
                                    "created_utc": 1596221490.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not sure about that I saw a bunch of IG/fb accounts at least who were 10-14 year old making sexual jokes and saying that SM is very disrespectful. TI wonder how they fell into all these.",
            "author": "rainsunicecream",
            "id": "fzpet7t",
            "parent_id": "t1_fzoi77y",
            "score": 3,
            "created_utc": 1596091422.0,
            "replies": []
        },
        {
            "body": "Cheers for the explanation. This explains her month off. Also, this is so ridiculous. If anything the show has gone back to its roots.",
            "author": "levintofu_WTF",
            "id": "fzr6qgc",
            "parent_id": "t1_fznnqk6",
            "score": 7,
            "created_utc": 1596132813.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fzrszml",
            "parent_id": "t1_fznhq7s",
            "score": 2,
            "created_utc": 1596139272.0,
            "replies": [
                {
                    "body": "It's like that crazy obsessive GF ... They have a particular focus on things...",
                    "author": "LifeSad07041997",
                    "id": "fzs11y5",
                    "parent_id": "t1_fzrszml",
                    "score": 1,
                    "created_utc": 1596141019.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This shits only a problem with people cause shes a girl. If she were a boy nobody would bat an eye",
            "author": "Finklemeire",
            "id": "fzmv16x",
            "parent_id": "t1_fzm0kpa",
            "score": 17,
            "created_utc": 1596040363.0,
            "replies": []
        },
        {
            "body": ">SJH needs to pull her own weight and not rely on others to get screentime if she wants to stay relevant on the show\n\n\nThis 🙌🏻 no one gets blamed for one's screentime except for the person only. It really irks me that her fans hate on members because they're not \"helping sjh\" when she should be the one helping herself. I stan people who work their asses off and even defy situations that try to drag them down. For that, I stan all of the members since day 1. Now, sjh fell behind. It would be okay to see her trying even if she fails because everyone always gives her the stage when she suddenly want to say something but she's gotten so comfortable it doesn't feel like she's working anymore. I seriously want her fans to read this because there's a vast difference with the output they're giving.\n\nThey said not to compare them but the characters I see is the hardworking Somin and the wallflower Jihyo.",
            "author": null,
            "id": "fzmzx4g",
            "parent_id": "t1_fzm4gln",
            "score": 15,
            "created_utc": 1596042853.0,
            "replies": [
                {
                    "body": "Well, to be fair, Jihyo is working hard nowadays. I'll always say this, I was really disappointed w her because she's my favorite...But seeing how hard she's working now, taking more iniciative, talking more and getting back to \"Angry Jihyo\" \"Mong Jihyo\" and all that stuff makes me proud of her.\n\nThis doesn't mean she didn't have a bad era, she relies too much on the members since forever, you can see it on couple races because the pair w Jihyo almost never gets any screen time, sometimes they even skipped them 'till the last game. She's always been like this because she had Gary to rely on, so she felt confortable in just acting as a Monday Girlfriend, but then, Gary left and she lost this presence she had, even on episodes where the Monday Couple \"broke up\" she almost never have any screen time, althought, in the past, she would talk a lot more than nowadays.\n\nShe is obviously struggling to find a way to be active again, and I think she's fouding it since the new PD joined the show, you can see she's becomming a lot brighter and it has NOTHING to do with Somin being out of the show... When Somin took a break, Jihyo was already getting back to her old self and when Somin was \"gone\" she had to fill the void for her so she overdid it.\n\nWhen Somin got back to the show, both girls showed viewers how much they missed each other, and I think some toxic fans should appreciate this scene more and be proud of Jihyo for starting to work a little bit harder nowadays. I know she's an introvert and has said several times that she doesn't know how to take the iniciative, and I as an introvert know too how hard it is to finally be the one to start talking or joking around EVEN with friends I've known for years. Somin has 0 fault for her lack of screen time, the only one to be blamed is Jihyo herself and it really hurts me to say this, but I don't think it's a bad thing to say the truth.\n\nAlso, I am 100% sure the new PD talked to her about this, because the change is so noticible since the new PD joined that it's the only explanation, and I think these so called Jihyo fans should be praising her for it and not attacking Somin. As I said before, If people don't stop attacking Somin EVEN WHEN Jihyo is CLEARLY IMPROVING, it's the same thing as saying all the hardwork Jihyo is doing is useless",
                    "author": null,
                    "id": "g2itb62",
                    "parent_id": "t1_fzmzx4g",
                    "score": 1,
                    "created_utc": 1598132675.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly, I truly believed the new PD talked to her about the situation...And they're not blind, they can see all the hate and they can clearly see that most of them are comming from Jihyo \"fans\"\n\nThese toxic people are truly brainless, I mean, If you look at the bigger picture, the one who's getting burdened out is Jihyo herself, her calling Somin the most often shows how much she cares about Somin, now imagine being the main reason as to why she had to take a break?\n\nI don't believe they are SJH fans at all, I see little to 0 comments on how Jihyo has been improving episode by episode, but I see A LOT of hate comments towards Somin. Where's all this energy when Jihyo is clearly trying her best nowadays? If they were truly Jihyo fans they would be praising her",
            "author": null,
            "id": "g2itrg8",
            "parent_id": "t1_fzly2o7",
            "score": 1,
            "created_utc": 1598132925.0,
            "replies": []
        },
        {
            "body": "Really??!! Everyone has their own sense of humor, this is ok. What’s not ok is forming conspiracy theories from thin air and presenting them as facts. This is exactly why her fans feel the need to protect her.",
            "author": "naniwewe",
            "id": "fzp7ljy",
            "parent_id": "t1_fzp6ce2",
            "score": 13,
            "created_utc": 1596085415.0,
            "replies": []
        },
        {
            "body": ">If screen time equates happiness, then look at SJH for 5 years, way before JSM even joined the show, SJH earned the least screen time back then & now whether it was 6,7,8 or 9 members, so SJH must be super sad since she's not the center of attention anymore, you make SJH look bad, don't be a SJH hater, SJH's actually nice like the other members you try to portray as villains, in ep513 JSJ even said the other members have a good personality like YSC, KJK, JSM, people who actually work with them, who know them, not some biased random viewer.",
            "author": "jhdnhc",
            "id": "fzqupww",
            "parent_id": "t1_fzp6ce2",
            "score": 9,
            "created_utc": 1596127930.0,
            "replies": []
        },
        {
            "body": "I’m sorry but your comment is just laughable to me. I’ll address the first half only since the second half is too ridiculous for me to respond to.\n\nIt’s amazing how you guys have convinced yourselves that Somin cares about how much screentime she gets because she has the nerve to actually do her job. Making up scenarios to fit your “greedy for screentime/stealing screentime” narrative. All while still complaining about her when she’s more reserved. \n\nI will say the weirdest thing about this is people like you complaining about the screentime Somin gets but will still monitor her every move on the show when she’s less active.",
            "author": "RumblesFish",
            "id": "fzw2ig7",
            "parent_id": "t1_fzp6ce2",
            "score": 5,
            "created_utc": 1596217888.0,
            "replies": []
        },
        {
            "body": "I agree about not going overboard with the protection though so far, fans have mostly stayed within lines. Her fans generally appreciate her with other women. It would be interesting to see how the fandom behaves with the new tvn show where there are other female entertainers along with So Min and  inevitable comparisons will spring up.  As long as she performs like she has been doing, there won't arise a situation where fans have to defend her by bashing someone else. If she can also establish a good rapport with the women in the cast and put it out for fans to see and root for, stan far wars involving her will be minimal. Public acknowledgements of sismances in variety shows have always helped the fans stay within lines.\n\nKS had a lot of trouble with viewers accepting him in a serious role, but he has been finally acknowledged. Hope that happens with So Min.",
            "author": "springaugust",
            "id": "fzqe1s7",
            "parent_id": "t1_fzpdyue",
            "score": 4,
            "created_utc": 1596119967.0,
            "replies": [
                {
                    "body": "I am curious about her and Jessi because Jessi has a really strong personality and  SM could become timid in front of her. This is only a thought and could easily be solved in the coming RM ep. I have only seen her in RM, some eps of unpretty rapstar, and her interview program. I don't know if it is the character she plays, but she is mostly this celeb who doesn't abide by the 'laws of variety' and comedy ensues from people like YJS and KS rein her in. I find her entertaining but just really curious about this pair. Ah, it doesn't help that *I have no* idea what kind of program this is.",
                    "author": "rainsunicecream",
                    "id": "fzriny4",
                    "parent_id": "t1_fzqe1s7",
                    "score": 2,
                    "created_utc": 1596136555.0,
                    "replies": [
                        {
                            "body": "I think they’ll get along well off screen since Jessi is actually very sweet and Somin has a similar rep but I dunno about on screen chemistry yet. Like you said we’ll have to find out on the next RM ep that’s if they even interact much. It’s interesting because both are outlandish and tend to have no filter but in completely different ways. It’s rumoured the main cast might be 5-8 members so if their dynamic doesn’t quite work there will be several buffers to help out lol.",
                            "author": "RumblesFish",
                            "id": "fzwddp6",
                            "parent_id": "t1_fzriny4",
                            "score": 3,
                            "created_utc": 1596221490.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's like that crazy obsessive GF ... They have a particular focus on things...",
            "author": "LifeSad07041997",
            "id": "fzs11y5",
            "parent_id": "t1_fzrszml",
            "score": 1,
            "created_utc": 1596141019.0,
            "replies": []
        },
        {
            "body": "Well, to be fair, Jihyo is working hard nowadays. I'll always say this, I was really disappointed w her because she's my favorite...But seeing how hard she's working now, taking more iniciative, talking more and getting back to \"Angry Jihyo\" \"Mong Jihyo\" and all that stuff makes me proud of her.\n\nThis doesn't mean she didn't have a bad era, she relies too much on the members since forever, you can see it on couple races because the pair w Jihyo almost never gets any screen time, sometimes they even skipped them 'till the last game. She's always been like this because she had Gary to rely on, so she felt confortable in just acting as a Monday Girlfriend, but then, Gary left and she lost this presence she had, even on episodes where the Monday Couple \"broke up\" she almost never have any screen time, althought, in the past, she would talk a lot more than nowadays.\n\nShe is obviously struggling to find a way to be active again, and I think she's fouding it since the new PD joined the show, you can see she's becomming a lot brighter and it has NOTHING to do with Somin being out of the show... When Somin took a break, Jihyo was already getting back to her old self and when Somin was \"gone\" she had to fill the void for her so she overdid it.\n\nWhen Somin got back to the show, both girls showed viewers how much they missed each other, and I think some toxic fans should appreciate this scene more and be proud of Jihyo for starting to work a little bit harder nowadays. I know she's an introvert and has said several times that she doesn't know how to take the iniciative, and I as an introvert know too how hard it is to finally be the one to start talking or joking around EVEN with friends I've known for years. Somin has 0 fault for her lack of screen time, the only one to be blamed is Jihyo herself and it really hurts me to say this, but I don't think it's a bad thing to say the truth.\n\nAlso, I am 100% sure the new PD talked to her about this, because the change is so noticible since the new PD joined that it's the only explanation, and I think these so called Jihyo fans should be praising her for it and not attacking Somin. As I said before, If people don't stop attacking Somin EVEN WHEN Jihyo is CLEARLY IMPROVING, it's the same thing as saying all the hardwork Jihyo is doing is useless",
            "author": null,
            "id": "g2itb62",
            "parent_id": "t1_fzmzx4g",
            "score": 1,
            "created_utc": 1598132675.0,
            "replies": []
        },
        {
            "body": "I am curious about her and Jessi because Jessi has a really strong personality and  SM could become timid in front of her. This is only a thought and could easily be solved in the coming RM ep. I have only seen her in RM, some eps of unpretty rapstar, and her interview program. I don't know if it is the character she plays, but she is mostly this celeb who doesn't abide by the 'laws of variety' and comedy ensues from people like YJS and KS rein her in. I find her entertaining but just really curious about this pair. Ah, it doesn't help that *I have no* idea what kind of program this is.",
            "author": "rainsunicecream",
            "id": "fzriny4",
            "parent_id": "t1_fzqe1s7",
            "score": 2,
            "created_utc": 1596136555.0,
            "replies": [
                {
                    "body": "I think they’ll get along well off screen since Jessi is actually very sweet and Somin has a similar rep but I dunno about on screen chemistry yet. Like you said we’ll have to find out on the next RM ep that’s if they even interact much. It’s interesting because both are outlandish and tend to have no filter but in completely different ways. It’s rumoured the main cast might be 5-8 members so if their dynamic doesn’t quite work there will be several buffers to help out lol.",
                    "author": "RumblesFish",
                    "id": "fzwddp6",
                    "parent_id": "t1_fzriny4",
                    "score": 3,
                    "created_utc": 1596221490.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think they’ll get along well off screen since Jessi is actually very sweet and Somin has a similar rep but I dunno about on screen chemistry yet. Like you said we’ll have to find out on the next RM ep that’s if they even interact much. It’s interesting because both are outlandish and tend to have no filter but in completely different ways. It’s rumoured the main cast might be 5-8 members so if their dynamic doesn’t quite work there will be several buffers to help out lol.",
            "author": "RumblesFish",
            "id": "fzwddp6",
            "parent_id": "t1_fzriny4",
            "score": 3,
            "created_utc": 1596221490.0,
            "replies": []
        }
    ]
}