{
    "title": "Gym Jong Kook new Video with Somin",
    "post_id": "vit1on",
    "post_url": "https://www.reddit.com/r/runningman/comments/vit1on/gym_jong_kook_new_video_with_somin/",
    "author": "LuNaTiC_25",
    "body": "",
    "url": "https://youtu.be/CzXzBnYTjW0",
    "score": 217,
    "upvote_ratio": 0.96,
    "created_utc": 1655977217.0,
    "num_comments": 45,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "He finally got Somin on the show!",
            "author": "justambrose",
            "id": "idevthe",
            "parent_id": "t3_vit1on",
            "score": 63,
            "created_utc": 1655978630.0,
            "replies": []
        },
        {
            "body": "Everybody else doing better job than JTBC to promote Cleaning Up.",
            "author": "NavdeepNSG",
            "id": "ideyq3t",
            "parent_id": "t3_vit1on",
            "score": 66,
            "created_utc": 1655980967.0,
            "replies": [
                {
                    "body": "It's pretty disappointing, stopped watching it last week.    maybe i can come back to it if it improves, but til last week show was not funny and depressing, and main lead is pretty toxic (not somin's character), in fact everyone around Somin's character is toxic and takes advantage of her.",
                    "author": "gyojoo",
                    "id": "idhl98s",
                    "parent_id": "t1_ideyq3t",
                    "score": 4,
                    "created_utc": 1656023379.0,
                    "replies": [
                        {
                            "body": "It improves by  around episode 4 . The three ladies bonding is heartwarming.",
                            "author": "Mission-Loquat9290",
                            "id": "idi7ty4",
                            "parent_id": "t1_idhl98s",
                            "score": 12,
                            "created_utc": 1656034083.0,
                            "replies": [
                                {
                                    "body": "They should be bonding, they are bout to be prison mates. *And then the story continues in 2037.*",
                                    "author": "Arktoscircle",
                                    "id": "idiy90j",
                                    "parent_id": "t1_idi7ty4",
                                    "score": 14,
                                    "created_utc": 1656048772.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I haven't watched yet, because I was waiting for Netflix or other platforms, but I might just use one of the random online viewings later when it's fully out. However, the premise didn't sound like a comedy to me. Three people from the lower classes of society; one is a struggling single mother of two with an addiction, one in an abusive relationship, one inexperienced and completely naïve... In addition, the lead actress is the mother from Sky Castle (I only watched a few episode) and JSM, who has mostly done dramas and not comedies. Unless the show was marketed as a comedy series, I don't think any of the signs from the cast to the storyline point to it being one. A dramedy perhaps, but it mostly sounds like a drama about the society, class differences, family dynamics and friendships. \n\nI also haven't watched the original UK versio in full, but from what I did see, the lead character is in fact a selfish and horrible person. I watched world of marriage (because of Dreamcatcher making a parody of it!) and quickly realized it's based on Dr Foster, which was fantastic. (I'm a huge fan of Suranne and Jodie) The Korean remake actually followed the show almost exactly, so I'm thinking they won't deviate from the story that much. which means, that is the character: A person who lies and cheats others with a justification that sounds convincing only to prove she can't be trusted because she will then gamble it all away or just waste it all.",
                            "author": null,
                            "id": "idk5tvv",
                            "parent_id": "t1_idhl98s",
                            "score": 9,
                            "created_utc": 1656079600.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Do you know where its possible to watch it in North America by any chance?",
                    "author": "evieteafox",
                    "id": "idgff8h",
                    "parent_id": "t1_ideyq3t",
                    "score": 1,
                    "created_utc": 1656005911.0,
                    "replies": [
                        {
                            "body": "There are ways, but better not to say here.\n\nThis sub promotes only legal options.",
                            "author": "NavdeepNSG",
                            "id": "idgfvyq",
                            "parent_id": "t1_idgff8h",
                            "score": 2,
                            "created_utc": 1656006100.0,
                            "replies": [
                                {
                                    "body": "Aaahh.. thank you for the info 😅",
                                    "author": "evieteafox",
                                    "id": "idgxupq",
                                    "parent_id": "t1_idgfvyq",
                                    "score": 1,
                                    "created_utc": 1656013470.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "As expected of Jong Kook. Always keen on keeping up with and supporting the members' (including our giraffe, Kwangsoo) latest activities.",
            "author": "Arktoscircle",
            "id": "idg65k6",
            "parent_id": "t3_vit1on",
            "score": 35,
            "created_utc": 1656002203.0,
            "replies": []
        },
        {
            "body": "Finally he got Somin on the show! Waiting for subs.",
            "author": "IAmShe10",
            "id": "idgn97s",
            "parent_id": "t3_vit1on",
            "score": 26,
            "created_utc": 1656009106.0,
            "replies": []
        },
        {
            "body": "a jongkook us trip is a rite of passage for all his sidekicks lol, but yeah it'd be weird if somin goes alone. sechan busy with work, haha probably busy with his family, and kwangsoo already left rm. he needs to find new underlings lol.\n\ntoo bad the spartace loveline ruined what could've been a girls trip lol.",
            "author": "botolsusu",
            "id": "idl33r2",
            "parent_id": "t3_vit1on",
            "score": 20,
            "created_utc": 1656092387.0,
            "replies": [
                {
                    "body": "They could've used the LA trip for two that SJH won as prize before (but never happened) for a girls' trip! Also, I think it could've worked out if they treated the Spartace loveline like the Chanmin loveline. It's too bad that they seem to be really using it more for fanservice for shippers.",
                    "author": "Infinite-Check4574",
                    "id": "idm241g",
                    "parent_id": "t1_idl33r2",
                    "score": 12,
                    "created_utc": 1656106445.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I never would of thought SoMin was a introvert but I would have never thought it of JaeSuk or MiJoo either.",
            "author": "stevienik",
            "id": "idfnyv0",
            "parent_id": "t3_vit1on",
            "score": 27,
            "created_utc": 1655994794.0,
            "replies": [
                {
                    "body": "She's an amazing actress, fooled a lot of people. I knew instantly that she was an introvert, because I just happened to see her first in another show and watched a few interviews and behind the scenes from that and it is so apparent that she's actually quiet, shy and introverted.",
                    "author": null,
                    "id": "idk5z2g",
                    "parent_id": "t1_idfnyv0",
                    "score": 13,
                    "created_utc": 1656079666.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Looking at the instagram post of Somin, I think this was after they win the early out in this week's episode.",
            "author": "Chuck0089",
            "id": "idh6qkj",
            "parent_id": "t3_vit1on",
            "score": 11,
            "created_utc": 1656017095.0,
            "replies": []
        },
        {
            "body": "Video is subbed",
            "author": "LuNaTiC_25",
            "id": "idjo9ed",
            "parent_id": "t3_vit1on",
            "score": 6,
            "created_utc": 1656070109.0,
            "replies": []
        },
        {
            "body": "Im curious. Are korean really care about bloodtype, horoscope, mbti etc as small talk? Or it is exaggerated in tv show as one of the content?",
            "author": "st_arch",
            "id": "idpb8ce",
            "parent_id": "t3_vit1on",
            "score": 8,
            "created_utc": 1656174453.0,
            "replies": [
                {
                    "body": "MBTI, Zodiac, and blood type are popular topics for Korean people. When meeting someone for the first time and getting to know them, using MBTI, Zodiac, and blood type as a conversation starter is a great way to ask someone what their personality is like without literally saying \"What is your personality like?\". For a culture that hates wasted time, it opens up the discussion to talk about whether someone is more outgoing, logical, reserved, confrontational, and etc.\n\n\n**this is from last year (2020) ..i dont follow this news but read it by coincident .👇\n\n\"We hire by checking your MBTI type. We hope to receive applications from many people with extraversion (E) tendencies. Exceptions: ENTJ, ESFJ types cannot apply.”\n\nThis was part of a notice for a part-time job opening posted by a café in Mapo-gu, Seoul. People showed mixed reactions to this notice. Some said they could understand since the MBTI has firmly taken root as a common topic of interest, while others argued that it was just a leisure activity and that a personality test should not be applied as a recruitment standard.",
                    "author": "Next_Topic3790",
                    "id": "idq0pxd",
                    "parent_id": "t1_idpb8ce",
                    "score": 5,
                    "created_utc": 1656186010.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I saw a comment saying only JSM can show up on his channel and still not workout! Which is such a mood. Her eyes shook when he suggested they workout next time. She is me and I am her, there is nothing worse than working out, and it is even worse when everyone in your family is super athletic and then there's you, needing 7 days of full on rest because you went swimming last week for 20 minutes!\n\nEdit: Interesting thing I noticed, which may sound like gossip or anything bad - but I didn't get a sense of it being anything negative. They talked about JSM ripping a nametag of someone she disliked very early in a game at one point. I'm trying to rack my brain as to when she's ever done this, and all I can think of is her ripping LKS's nametag in the TWICE episode literally 2 minutes into the game. Were there any other instances?",
            "author": null,
            "id": "idk4hns",
            "parent_id": "t3_vit1on",
            "score": 14,
            "created_utc": 1656078993.0,
            "replies": [
                {
                    "body": "I agree with u, not everyone can incorperate workout in their life, like u mention, some ppl barely has enough energy to get by w/ their daily activity. Imo, JSM is suited for more minimal exercise that can be done between breaks but help improve mobility of the body to lessen chances of injuries(ex. the ones recommend by physical therapist) . Whereas KJK tend to teach mostly squat to female guest, so i don't see her missin out much.\n\nat the end of the day, JSM is a grown up person n if KJK type of workout isn't her thing is w.e",
                    "author": "MeepnBeep",
                    "id": "idl6nst",
                    "parent_id": "t1_idk4hns",
                    "score": 16,
                    "created_utc": 1656093754.0,
                    "replies": [
                        {
                            "body": "There are a ton of other workouts people like us (non-athletic, frail) can enjoy. She's a great dancer, and she enjoys it and music as well, so she can always just do that for some movement. I would love to see a workout video with her, but entirely for the laughs.",
                            "author": null,
                            "id": "idlcted",
                            "parent_id": "t1_idl6nst",
                            "score": 12,
                            "created_utc": 1656096185.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "She did it to JSJ in the episode that had San as a guest (soapy mountain slope challenge), but that was for laughs and not out of hate",
                    "author": "DN1097",
                    "id": "idk7cpr",
                    "parent_id": "t1_idk4hns",
                    "score": 12,
                    "created_utc": 1656080284.0,
                    "replies": [
                        {
                            "body": "I love how she's so unpredictable. I am not insinuating that she hates LKS, though. That's just what the subtitles said. I was intrigued because I can't remember many instances of JSM actually removing nametags. haha",
                            "author": null,
                            "id": "idlcixq",
                            "parent_id": "t1_idk7cpr",
                            "score": 5,
                            "created_utc": 1656096072.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I went to rewatch that part and I think they are talking about hypothetical situation. Because the question is: I often feel like I have to justify myself to others.\n\nSo KJK give a situation where you are clearly in the wrong (e.g. in the heat of the moment, you hastily ripped off a person tag because you dislike them. Which in turn completely ruined the mission). In this situation would you admit your mistake or would you try to justify your action. JSM then said that she would admit her mistake but she would still justify it. So, she is the type to explain herself.",
                    "author": "Arktoscircle",
                    "id": "idootza",
                    "parent_id": "t1_idk4hns",
                    "score": 11,
                    "created_utc": 1656163945.0,
                    "replies": [
                        {
                            "body": "makes sense. As a fellow INFP/INTP, I'll admit I've done wrong but I want the person to understand why and why I thought I was justified.",
                            "author": null,
                            "id": "idpjzkk",
                            "parent_id": "t1_idootza",
                            "score": 6,
                            "created_utc": 1656178329.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yay! I've been waiting for this 🐯🐸",
            "author": "UMR_9012",
            "id": "idjf6oe",
            "parent_id": "t3_vit1on",
            "score": 4,
            "created_utc": 1656062806.0,
            "replies": []
        },
        {
            "body": "I see no one's talking about kjk's mbti results 😂",
            "author": "Tueuses",
            "id": "idss4v1",
            "parent_id": "t3_vit1on",
            "score": 2,
            "created_utc": 1656246527.0,
            "replies": [
                {
                    "body": "I mean his result is kinda expected. The only mildly surprising part might be the P",
                    "author": "Arktoscircle",
                    "id": "ie6ixu4",
                    "parent_id": "t1_idss4v1",
                    "score": 2,
                    "created_utc": 1656507913.0,
                    "replies": [
                        {
                            "body": "Is it? I've only seen people type him as ESTJ for years, with some rare ENTJ here and there lol so I wouldn't say it was expected",
                            "author": "Tueuses",
                            "id": "iee0q7k",
                            "parent_id": "t1_ie6ixu4",
                            "score": 1,
                            "created_utc": 1656634282.0,
                            "replies": [
                                {
                                    "body": "Oh, I've never really pay attention to the discussions about the members' MBTI. That is news to me that people type him as ESTJ/ENTJ. I always thought of him as a more introvert and feeling type. How about you? Do you think it's weird that he got ISFP?",
                                    "author": "Arktoscircle",
                                    "id": "iee97rn",
                                    "parent_id": "t1_iee0q7k",
                                    "score": 2,
                                    "created_utc": 1656638320.0,
                                    "replies": [
                                        {
                                            "body": "I think it's fine, I am not really a fan of the mbti so I think any type gives a false and limited view of someone tbh. I just find it interesting that people were so convinced just based on the characters he showed on tv... Same happened with Yoo Jaesuk I think he used to be typed as Enfj/really extraverted but he ended up having a very different type 😄",
                                            "author": "Tueuses",
                                            "id": "iesufie",
                                            "parent_id": "t1_iee97rn",
                                            "score": 2,
                                            "created_utc": 1656928313.0,
                                            "replies": [
                                                {
                                                    "body": "YJS should be ISFJ in my opinion 🤣. His Si and Fe is very noticeable for him to be ISFP.",
                                                    "author": "Kylaste",
                                                    "id": "ih7nj5v",
                                                    "parent_id": "t1_iesufie",
                                                    "score": 1,
                                                    "created_utc": 1658509678.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "As someone who used to be interested in mbti, ISFP makes no sense at all lmao. It's because they use letters instead of cognitive functions which is the basis for mbti.",
                                            "author": "Kylaste",
                                            "id": "ih7nbt8",
                                            "parent_id": "t1_iee97rn",
                                            "score": 1,
                                            "created_utc": 1658509597.0,
                                            "replies": [
                                                {
                                                    "body": "Fi, Se, Ni, Te. I don't find any of it as surprising. But that's just me",
                                                    "author": "Arktoscircle",
                                                    "id": "ihep3ot",
                                                    "parent_id": "t1_ih7nbt8",
                                                    "score": 1,
                                                    "created_utc": 1658634951.0,
                                                    "replies": [
                                                        {
                                                            "body": "Te inferior is just impossible. It's a function so visible in him. He should be ISTJ in my opinion (Si, Te, Fi, Ne). Si because of his routinely life and attention to details, Te because of his efficient approach in things which cannot not be his inf function, tert fi because he is very principled but he appears tsudereish at times, and Ne inf because he finds it difficult to adjust to new things and possibilities.",
                                                            "author": "Kylaste",
                                                            "id": "ihm014p",
                                                            "parent_id": "t1_ihep3ot",
                                                            "score": 2,
                                                            "created_utc": 1658773983.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I see, that is insightful. I wouldn't dispute that because oftentimes people are mistypes. It does requires a level of self-awareness to know for sure as I, myself, took a long time to find mine. Thank you for your answer, I will keep that in mind.",
                                                                    "author": "Arktoscircle",
                                                                    "id": "ihnh4bs",
                                                                    "parent_id": "t1_ihm014p",
                                                                    "score": 2,
                                                                    "created_utc": 1658795296.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "idfghaj",
            "parent_id": "t3_vit1on",
            "score": -39,
            "created_utc": 1655991415.0,
            "replies": [
                {
                    "body": "Who cares about shippers and ships? Everyone knows they’re just friends so why bring up a ship that has less than 20 people in it? Stop being negative and just enjoy the video.",
                    "author": "stevienik",
                    "id": "idfnn1v",
                    "parent_id": "t1_idfghaj",
                    "score": 39,
                    "created_utc": 1655994653.0,
                    "replies": []
                },
                {
                    "body": "Honestly, anti-shippers are bringing more attention to ships than actual shippers on this sub. It's better not to mention ships at all. Otherwise, you might just be giving them the recognition they want.",
                    "author": "Infinite-Check4574",
                    "id": "idg1eh9",
                    "parent_id": "t1_idfghaj",
                    "score": 24,
                    "created_utc": 1656000319.0,
                    "replies": []
                },
                {
                    "body": "They literally say their personalities are worst match as couple in the video, and they both agree.  \nIn fact that’s what caption on the thumbnail is saying lol",
                    "author": "gyojoo",
                    "id": "idfs66u",
                    "parent_id": "t1_idfghaj",
                    "score": 29,
                    "created_utc": 1655996559.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "idftc4q",
                            "parent_id": "t1_idfs66u",
                            "score": -17,
                            "created_utc": 1655997047.0,
                            "replies": [
                                {
                                    "body": "Mods, can u deleted the comment please. This is getting annoying",
                                    "author": "AkifSafwan02",
                                    "id": "idh49p8",
                                    "parent_id": "t1_idftc4q",
                                    "score": 7,
                                    "created_utc": 1656016069.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Hello, \n\nThank you for your participation in r/runningman. Your post/comment violates our subreddit's rules, specifically Rule No. 5 regarding \"toxicity, toxic-baiting, or drama-baiting\" that states:\n\n> Users must not engage in toxicity, flaming, toxic-baiting, and drama-baiting. E.g., discriminating against or disparaging any RM member or staff, fan wars of any kind, and referring to opposing fan bases in a negative light to elicit a negative response.\n\nTo learn more about how we tackle toxicity in this community, click [here](https://www.reddit.com/r/runningman/comments/uqp4sh/how_to_tackle_toxicity_in_our_community/).\n\nPlease review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules).\n\nThis notice does **not** indicate that the moderator performed a punitive function. However, violations of our subreddit's rules are subject to the appropriate disciplinary process at the moderator's discretion.",
                    "author": "BoneToBeWild",
                    "id": "idipykc",
                    "parent_id": "t1_idfghaj",
                    "score": 3,
                    "created_utc": 1656043426.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's pretty disappointing, stopped watching it last week.    maybe i can come back to it if it improves, but til last week show was not funny and depressing, and main lead is pretty toxic (not somin's character), in fact everyone around Somin's character is toxic and takes advantage of her.",
            "author": "gyojoo",
            "id": "idhl98s",
            "parent_id": "t1_ideyq3t",
            "score": 4,
            "created_utc": 1656023379.0,
            "replies": [
                {
                    "body": "It improves by  around episode 4 . The three ladies bonding is heartwarming.",
                    "author": "Mission-Loquat9290",
                    "id": "idi7ty4",
                    "parent_id": "t1_idhl98s",
                    "score": 12,
                    "created_utc": 1656034083.0,
                    "replies": [
                        {
                            "body": "They should be bonding, they are bout to be prison mates. *And then the story continues in 2037.*",
                            "author": "Arktoscircle",
                            "id": "idiy90j",
                            "parent_id": "t1_idi7ty4",
                            "score": 14,
                            "created_utc": 1656048772.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I haven't watched yet, because I was waiting for Netflix or other platforms, but I might just use one of the random online viewings later when it's fully out. However, the premise didn't sound like a comedy to me. Three people from the lower classes of society; one is a struggling single mother of two with an addiction, one in an abusive relationship, one inexperienced and completely naïve... In addition, the lead actress is the mother from Sky Castle (I only watched a few episode) and JSM, who has mostly done dramas and not comedies. Unless the show was marketed as a comedy series, I don't think any of the signs from the cast to the storyline point to it being one. A dramedy perhaps, but it mostly sounds like a drama about the society, class differences, family dynamics and friendships. \n\nI also haven't watched the original UK versio in full, but from what I did see, the lead character is in fact a selfish and horrible person. I watched world of marriage (because of Dreamcatcher making a parody of it!) and quickly realized it's based on Dr Foster, which was fantastic. (I'm a huge fan of Suranne and Jodie) The Korean remake actually followed the show almost exactly, so I'm thinking they won't deviate from the story that much. which means, that is the character: A person who lies and cheats others with a justification that sounds convincing only to prove she can't be trusted because she will then gamble it all away or just waste it all.",
                    "author": null,
                    "id": "idk5tvv",
                    "parent_id": "t1_idhl98s",
                    "score": 9,
                    "created_utc": 1656079600.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do you know where its possible to watch it in North America by any chance?",
            "author": "evieteafox",
            "id": "idgff8h",
            "parent_id": "t1_ideyq3t",
            "score": 1,
            "created_utc": 1656005911.0,
            "replies": [
                {
                    "body": "There are ways, but better not to say here.\n\nThis sub promotes only legal options.",
                    "author": "NavdeepNSG",
                    "id": "idgfvyq",
                    "parent_id": "t1_idgff8h",
                    "score": 2,
                    "created_utc": 1656006100.0,
                    "replies": [
                        {
                            "body": "Aaahh.. thank you for the info 😅",
                            "author": "evieteafox",
                            "id": "idgxupq",
                            "parent_id": "t1_idgfvyq",
                            "score": 1,
                            "created_utc": 1656013470.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "They could've used the LA trip for two that SJH won as prize before (but never happened) for a girls' trip! Also, I think it could've worked out if they treated the Spartace loveline like the Chanmin loveline. It's too bad that they seem to be really using it more for fanservice for shippers.",
            "author": "Infinite-Check4574",
            "id": "idm241g",
            "parent_id": "t1_idl33r2",
            "score": 12,
            "created_utc": 1656106445.0,
            "replies": []
        },
        {
            "body": "She's an amazing actress, fooled a lot of people. I knew instantly that she was an introvert, because I just happened to see her first in another show and watched a few interviews and behind the scenes from that and it is so apparent that she's actually quiet, shy and introverted.",
            "author": null,
            "id": "idk5z2g",
            "parent_id": "t1_idfnyv0",
            "score": 13,
            "created_utc": 1656079666.0,
            "replies": []
        },
        {
            "body": "MBTI, Zodiac, and blood type are popular topics for Korean people. When meeting someone for the first time and getting to know them, using MBTI, Zodiac, and blood type as a conversation starter is a great way to ask someone what their personality is like without literally saying \"What is your personality like?\". For a culture that hates wasted time, it opens up the discussion to talk about whether someone is more outgoing, logical, reserved, confrontational, and etc.\n\n\n**this is from last year (2020) ..i dont follow this news but read it by coincident .👇\n\n\"We hire by checking your MBTI type. We hope to receive applications from many people with extraversion (E) tendencies. Exceptions: ENTJ, ESFJ types cannot apply.”\n\nThis was part of a notice for a part-time job opening posted by a café in Mapo-gu, Seoul. People showed mixed reactions to this notice. Some said they could understand since the MBTI has firmly taken root as a common topic of interest, while others argued that it was just a leisure activity and that a personality test should not be applied as a recruitment standard.",
            "author": "Next_Topic3790",
            "id": "idq0pxd",
            "parent_id": "t1_idpb8ce",
            "score": 5,
            "created_utc": 1656186010.0,
            "replies": []
        },
        {
            "body": "I agree with u, not everyone can incorperate workout in their life, like u mention, some ppl barely has enough energy to get by w/ their daily activity. Imo, JSM is suited for more minimal exercise that can be done between breaks but help improve mobility of the body to lessen chances of injuries(ex. the ones recommend by physical therapist) . Whereas KJK tend to teach mostly squat to female guest, so i don't see her missin out much.\n\nat the end of the day, JSM is a grown up person n if KJK type of workout isn't her thing is w.e",
            "author": "MeepnBeep",
            "id": "idl6nst",
            "parent_id": "t1_idk4hns",
            "score": 16,
            "created_utc": 1656093754.0,
            "replies": [
                {
                    "body": "There are a ton of other workouts people like us (non-athletic, frail) can enjoy. She's a great dancer, and she enjoys it and music as well, so she can always just do that for some movement. I would love to see a workout video with her, but entirely for the laughs.",
                    "author": null,
                    "id": "idlcted",
                    "parent_id": "t1_idl6nst",
                    "score": 12,
                    "created_utc": 1656096185.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She did it to JSJ in the episode that had San as a guest (soapy mountain slope challenge), but that was for laughs and not out of hate",
            "author": "DN1097",
            "id": "idk7cpr",
            "parent_id": "t1_idk4hns",
            "score": 12,
            "created_utc": 1656080284.0,
            "replies": [
                {
                    "body": "I love how she's so unpredictable. I am not insinuating that she hates LKS, though. That's just what the subtitles said. I was intrigued because I can't remember many instances of JSM actually removing nametags. haha",
                    "author": null,
                    "id": "idlcixq",
                    "parent_id": "t1_idk7cpr",
                    "score": 5,
                    "created_utc": 1656096072.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I went to rewatch that part and I think they are talking about hypothetical situation. Because the question is: I often feel like I have to justify myself to others.\n\nSo KJK give a situation where you are clearly in the wrong (e.g. in the heat of the moment, you hastily ripped off a person tag because you dislike them. Which in turn completely ruined the mission). In this situation would you admit your mistake or would you try to justify your action. JSM then said that she would admit her mistake but she would still justify it. So, she is the type to explain herself.",
            "author": "Arktoscircle",
            "id": "idootza",
            "parent_id": "t1_idk4hns",
            "score": 11,
            "created_utc": 1656163945.0,
            "replies": [
                {
                    "body": "makes sense. As a fellow INFP/INTP, I'll admit I've done wrong but I want the person to understand why and why I thought I was justified.",
                    "author": null,
                    "id": "idpjzkk",
                    "parent_id": "t1_idootza",
                    "score": 6,
                    "created_utc": 1656178329.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean his result is kinda expected. The only mildly surprising part might be the P",
            "author": "Arktoscircle",
            "id": "ie6ixu4",
            "parent_id": "t1_idss4v1",
            "score": 2,
            "created_utc": 1656507913.0,
            "replies": [
                {
                    "body": "Is it? I've only seen people type him as ESTJ for years, with some rare ENTJ here and there lol so I wouldn't say it was expected",
                    "author": "Tueuses",
                    "id": "iee0q7k",
                    "parent_id": "t1_ie6ixu4",
                    "score": 1,
                    "created_utc": 1656634282.0,
                    "replies": [
                        {
                            "body": "Oh, I've never really pay attention to the discussions about the members' MBTI. That is news to me that people type him as ESTJ/ENTJ. I always thought of him as a more introvert and feeling type. How about you? Do you think it's weird that he got ISFP?",
                            "author": "Arktoscircle",
                            "id": "iee97rn",
                            "parent_id": "t1_iee0q7k",
                            "score": 2,
                            "created_utc": 1656638320.0,
                            "replies": [
                                {
                                    "body": "I think it's fine, I am not really a fan of the mbti so I think any type gives a false and limited view of someone tbh. I just find it interesting that people were so convinced just based on the characters he showed on tv... Same happened with Yoo Jaesuk I think he used to be typed as Enfj/really extraverted but he ended up having a very different type 😄",
                                    "author": "Tueuses",
                                    "id": "iesufie",
                                    "parent_id": "t1_iee97rn",
                                    "score": 2,
                                    "created_utc": 1656928313.0,
                                    "replies": [
                                        {
                                            "body": "YJS should be ISFJ in my opinion 🤣. His Si and Fe is very noticeable for him to be ISFP.",
                                            "author": "Kylaste",
                                            "id": "ih7nj5v",
                                            "parent_id": "t1_iesufie",
                                            "score": 1,
                                            "created_utc": 1658509678.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "As someone who used to be interested in mbti, ISFP makes no sense at all lmao. It's because they use letters instead of cognitive functions which is the basis for mbti.",
                                    "author": "Kylaste",
                                    "id": "ih7nbt8",
                                    "parent_id": "t1_iee97rn",
                                    "score": 1,
                                    "created_utc": 1658509597.0,
                                    "replies": [
                                        {
                                            "body": "Fi, Se, Ni, Te. I don't find any of it as surprising. But that's just me",
                                            "author": "Arktoscircle",
                                            "id": "ihep3ot",
                                            "parent_id": "t1_ih7nbt8",
                                            "score": 1,
                                            "created_utc": 1658634951.0,
                                            "replies": [
                                                {
                                                    "body": "Te inferior is just impossible. It's a function so visible in him. He should be ISTJ in my opinion (Si, Te, Fi, Ne). Si because of his routinely life and attention to details, Te because of his efficient approach in things which cannot not be his inf function, tert fi because he is very principled but he appears tsudereish at times, and Ne inf because he finds it difficult to adjust to new things and possibilities.",
                                                    "author": "Kylaste",
                                                    "id": "ihm014p",
                                                    "parent_id": "t1_ihep3ot",
                                                    "score": 2,
                                                    "created_utc": 1658773983.0,
                                                    "replies": [
                                                        {
                                                            "body": "I see, that is insightful. I wouldn't dispute that because oftentimes people are mistypes. It does requires a level of self-awareness to know for sure as I, myself, took a long time to find mine. Thank you for your answer, I will keep that in mind.",
                                                            "author": "Arktoscircle",
                                                            "id": "ihnh4bs",
                                                            "parent_id": "t1_ihm014p",
                                                            "score": 2,
                                                            "created_utc": 1658795296.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Who cares about shippers and ships? Everyone knows they’re just friends so why bring up a ship that has less than 20 people in it? Stop being negative and just enjoy the video.",
            "author": "stevienik",
            "id": "idfnn1v",
            "parent_id": "t1_idfghaj",
            "score": 39,
            "created_utc": 1655994653.0,
            "replies": []
        },
        {
            "body": "Honestly, anti-shippers are bringing more attention to ships than actual shippers on this sub. It's better not to mention ships at all. Otherwise, you might just be giving them the recognition they want.",
            "author": "Infinite-Check4574",
            "id": "idg1eh9",
            "parent_id": "t1_idfghaj",
            "score": 24,
            "created_utc": 1656000319.0,
            "replies": []
        },
        {
            "body": "They literally say their personalities are worst match as couple in the video, and they both agree.  \nIn fact that’s what caption on the thumbnail is saying lol",
            "author": "gyojoo",
            "id": "idfs66u",
            "parent_id": "t1_idfghaj",
            "score": 29,
            "created_utc": 1655996559.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "idftc4q",
                    "parent_id": "t1_idfs66u",
                    "score": -17,
                    "created_utc": 1655997047.0,
                    "replies": [
                        {
                            "body": "Mods, can u deleted the comment please. This is getting annoying",
                            "author": "AkifSafwan02",
                            "id": "idh49p8",
                            "parent_id": "t1_idftc4q",
                            "score": 7,
                            "created_utc": 1656016069.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hello, \n\nThank you for your participation in r/runningman. Your post/comment violates our subreddit's rules, specifically Rule No. 5 regarding \"toxicity, toxic-baiting, or drama-baiting\" that states:\n\n> Users must not engage in toxicity, flaming, toxic-baiting, and drama-baiting. E.g., discriminating against or disparaging any RM member or staff, fan wars of any kind, and referring to opposing fan bases in a negative light to elicit a negative response.\n\nTo learn more about how we tackle toxicity in this community, click [here](https://www.reddit.com/r/runningman/comments/uqp4sh/how_to_tackle_toxicity_in_our_community/).\n\nPlease review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules).\n\nThis notice does **not** indicate that the moderator performed a punitive function. However, violations of our subreddit's rules are subject to the appropriate disciplinary process at the moderator's discretion.",
            "author": "BoneToBeWild",
            "id": "idipykc",
            "parent_id": "t1_idfghaj",
            "score": 3,
            "created_utc": 1656043426.0,
            "replies": []
        },
        {
            "body": "It improves by  around episode 4 . The three ladies bonding is heartwarming.",
            "author": "Mission-Loquat9290",
            "id": "idi7ty4",
            "parent_id": "t1_idhl98s",
            "score": 12,
            "created_utc": 1656034083.0,
            "replies": [
                {
                    "body": "They should be bonding, they are bout to be prison mates. *And then the story continues in 2037.*",
                    "author": "Arktoscircle",
                    "id": "idiy90j",
                    "parent_id": "t1_idi7ty4",
                    "score": 14,
                    "created_utc": 1656048772.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I haven't watched yet, because I was waiting for Netflix or other platforms, but I might just use one of the random online viewings later when it's fully out. However, the premise didn't sound like a comedy to me. Three people from the lower classes of society; one is a struggling single mother of two with an addiction, one in an abusive relationship, one inexperienced and completely naïve... In addition, the lead actress is the mother from Sky Castle (I only watched a few episode) and JSM, who has mostly done dramas and not comedies. Unless the show was marketed as a comedy series, I don't think any of the signs from the cast to the storyline point to it being one. A dramedy perhaps, but it mostly sounds like a drama about the society, class differences, family dynamics and friendships. \n\nI also haven't watched the original UK versio in full, but from what I did see, the lead character is in fact a selfish and horrible person. I watched world of marriage (because of Dreamcatcher making a parody of it!) and quickly realized it's based on Dr Foster, which was fantastic. (I'm a huge fan of Suranne and Jodie) The Korean remake actually followed the show almost exactly, so I'm thinking they won't deviate from the story that much. which means, that is the character: A person who lies and cheats others with a justification that sounds convincing only to prove she can't be trusted because she will then gamble it all away or just waste it all.",
            "author": null,
            "id": "idk5tvv",
            "parent_id": "t1_idhl98s",
            "score": 9,
            "created_utc": 1656079600.0,
            "replies": []
        },
        {
            "body": "There are ways, but better not to say here.\n\nThis sub promotes only legal options.",
            "author": "NavdeepNSG",
            "id": "idgfvyq",
            "parent_id": "t1_idgff8h",
            "score": 2,
            "created_utc": 1656006100.0,
            "replies": [
                {
                    "body": "Aaahh.. thank you for the info 😅",
                    "author": "evieteafox",
                    "id": "idgxupq",
                    "parent_id": "t1_idgfvyq",
                    "score": 1,
                    "created_utc": 1656013470.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There are a ton of other workouts people like us (non-athletic, frail) can enjoy. She's a great dancer, and she enjoys it and music as well, so she can always just do that for some movement. I would love to see a workout video with her, but entirely for the laughs.",
            "author": null,
            "id": "idlcted",
            "parent_id": "t1_idl6nst",
            "score": 12,
            "created_utc": 1656096185.0,
            "replies": []
        },
        {
            "body": "I love how she's so unpredictable. I am not insinuating that she hates LKS, though. That's just what the subtitles said. I was intrigued because I can't remember many instances of JSM actually removing nametags. haha",
            "author": null,
            "id": "idlcixq",
            "parent_id": "t1_idk7cpr",
            "score": 5,
            "created_utc": 1656096072.0,
            "replies": []
        },
        {
            "body": "makes sense. As a fellow INFP/INTP, I'll admit I've done wrong but I want the person to understand why and why I thought I was justified.",
            "author": null,
            "id": "idpjzkk",
            "parent_id": "t1_idootza",
            "score": 6,
            "created_utc": 1656178329.0,
            "replies": []
        },
        {
            "body": "Is it? I've only seen people type him as ESTJ for years, with some rare ENTJ here and there lol so I wouldn't say it was expected",
            "author": "Tueuses",
            "id": "iee0q7k",
            "parent_id": "t1_ie6ixu4",
            "score": 1,
            "created_utc": 1656634282.0,
            "replies": [
                {
                    "body": "Oh, I've never really pay attention to the discussions about the members' MBTI. That is news to me that people type him as ESTJ/ENTJ. I always thought of him as a more introvert and feeling type. How about you? Do you think it's weird that he got ISFP?",
                    "author": "Arktoscircle",
                    "id": "iee97rn",
                    "parent_id": "t1_iee0q7k",
                    "score": 2,
                    "created_utc": 1656638320.0,
                    "replies": [
                        {
                            "body": "I think it's fine, I am not really a fan of the mbti so I think any type gives a false and limited view of someone tbh. I just find it interesting that people were so convinced just based on the characters he showed on tv... Same happened with Yoo Jaesuk I think he used to be typed as Enfj/really extraverted but he ended up having a very different type 😄",
                            "author": "Tueuses",
                            "id": "iesufie",
                            "parent_id": "t1_iee97rn",
                            "score": 2,
                            "created_utc": 1656928313.0,
                            "replies": [
                                {
                                    "body": "YJS should be ISFJ in my opinion 🤣. His Si and Fe is very noticeable for him to be ISFP.",
                                    "author": "Kylaste",
                                    "id": "ih7nj5v",
                                    "parent_id": "t1_iesufie",
                                    "score": 1,
                                    "created_utc": 1658509678.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "As someone who used to be interested in mbti, ISFP makes no sense at all lmao. It's because they use letters instead of cognitive functions which is the basis for mbti.",
                            "author": "Kylaste",
                            "id": "ih7nbt8",
                            "parent_id": "t1_iee97rn",
                            "score": 1,
                            "created_utc": 1658509597.0,
                            "replies": [
                                {
                                    "body": "Fi, Se, Ni, Te. I don't find any of it as surprising. But that's just me",
                                    "author": "Arktoscircle",
                                    "id": "ihep3ot",
                                    "parent_id": "t1_ih7nbt8",
                                    "score": 1,
                                    "created_utc": 1658634951.0,
                                    "replies": [
                                        {
                                            "body": "Te inferior is just impossible. It's a function so visible in him. He should be ISTJ in my opinion (Si, Te, Fi, Ne). Si because of his routinely life and attention to details, Te because of his efficient approach in things which cannot not be his inf function, tert fi because he is very principled but he appears tsudereish at times, and Ne inf because he finds it difficult to adjust to new things and possibilities.",
                                            "author": "Kylaste",
                                            "id": "ihm014p",
                                            "parent_id": "t1_ihep3ot",
                                            "score": 2,
                                            "created_utc": 1658773983.0,
                                            "replies": [
                                                {
                                                    "body": "I see, that is insightful. I wouldn't dispute that because oftentimes people are mistypes. It does requires a level of self-awareness to know for sure as I, myself, took a long time to find mine. Thank you for your answer, I will keep that in mind.",
                                                    "author": "Arktoscircle",
                                                    "id": "ihnh4bs",
                                                    "parent_id": "t1_ihm014p",
                                                    "score": 2,
                                                    "created_utc": 1658795296.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "idftc4q",
            "parent_id": "t1_idfs66u",
            "score": -17,
            "created_utc": 1655997047.0,
            "replies": [
                {
                    "body": "Mods, can u deleted the comment please. This is getting annoying",
                    "author": "AkifSafwan02",
                    "id": "idh49p8",
                    "parent_id": "t1_idftc4q",
                    "score": 7,
                    "created_utc": 1656016069.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They should be bonding, they are bout to be prison mates. *And then the story continues in 2037.*",
            "author": "Arktoscircle",
            "id": "idiy90j",
            "parent_id": "t1_idi7ty4",
            "score": 14,
            "created_utc": 1656048772.0,
            "replies": []
        },
        {
            "body": "Aaahh.. thank you for the info 😅",
            "author": "evieteafox",
            "id": "idgxupq",
            "parent_id": "t1_idgfvyq",
            "score": 1,
            "created_utc": 1656013470.0,
            "replies": []
        },
        {
            "body": "Oh, I've never really pay attention to the discussions about the members' MBTI. That is news to me that people type him as ESTJ/ENTJ. I always thought of him as a more introvert and feeling type. How about you? Do you think it's weird that he got ISFP?",
            "author": "Arktoscircle",
            "id": "iee97rn",
            "parent_id": "t1_iee0q7k",
            "score": 2,
            "created_utc": 1656638320.0,
            "replies": [
                {
                    "body": "I think it's fine, I am not really a fan of the mbti so I think any type gives a false and limited view of someone tbh. I just find it interesting that people were so convinced just based on the characters he showed on tv... Same happened with Yoo Jaesuk I think he used to be typed as Enfj/really extraverted but he ended up having a very different type 😄",
                    "author": "Tueuses",
                    "id": "iesufie",
                    "parent_id": "t1_iee97rn",
                    "score": 2,
                    "created_utc": 1656928313.0,
                    "replies": [
                        {
                            "body": "YJS should be ISFJ in my opinion 🤣. His Si and Fe is very noticeable for him to be ISFP.",
                            "author": "Kylaste",
                            "id": "ih7nj5v",
                            "parent_id": "t1_iesufie",
                            "score": 1,
                            "created_utc": 1658509678.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "As someone who used to be interested in mbti, ISFP makes no sense at all lmao. It's because they use letters instead of cognitive functions which is the basis for mbti.",
                    "author": "Kylaste",
                    "id": "ih7nbt8",
                    "parent_id": "t1_iee97rn",
                    "score": 1,
                    "created_utc": 1658509597.0,
                    "replies": [
                        {
                            "body": "Fi, Se, Ni, Te. I don't find any of it as surprising. But that's just me",
                            "author": "Arktoscircle",
                            "id": "ihep3ot",
                            "parent_id": "t1_ih7nbt8",
                            "score": 1,
                            "created_utc": 1658634951.0,
                            "replies": [
                                {
                                    "body": "Te inferior is just impossible. It's a function so visible in him. He should be ISTJ in my opinion (Si, Te, Fi, Ne). Si because of his routinely life and attention to details, Te because of his efficient approach in things which cannot not be his inf function, tert fi because he is very principled but he appears tsudereish at times, and Ne inf because he finds it difficult to adjust to new things and possibilities.",
                                    "author": "Kylaste",
                                    "id": "ihm014p",
                                    "parent_id": "t1_ihep3ot",
                                    "score": 2,
                                    "created_utc": 1658773983.0,
                                    "replies": [
                                        {
                                            "body": "I see, that is insightful. I wouldn't dispute that because oftentimes people are mistypes. It does requires a level of self-awareness to know for sure as I, myself, took a long time to find mine. Thank you for your answer, I will keep that in mind.",
                                            "author": "Arktoscircle",
                                            "id": "ihnh4bs",
                                            "parent_id": "t1_ihm014p",
                                            "score": 2,
                                            "created_utc": 1658795296.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Mods, can u deleted the comment please. This is getting annoying",
            "author": "AkifSafwan02",
            "id": "idh49p8",
            "parent_id": "t1_idftc4q",
            "score": 7,
            "created_utc": 1656016069.0,
            "replies": []
        },
        {
            "body": "I think it's fine, I am not really a fan of the mbti so I think any type gives a false and limited view of someone tbh. I just find it interesting that people were so convinced just based on the characters he showed on tv... Same happened with Yoo Jaesuk I think he used to be typed as Enfj/really extraverted but he ended up having a very different type 😄",
            "author": "Tueuses",
            "id": "iesufie",
            "parent_id": "t1_iee97rn",
            "score": 2,
            "created_utc": 1656928313.0,
            "replies": [
                {
                    "body": "YJS should be ISFJ in my opinion 🤣. His Si and Fe is very noticeable for him to be ISFP.",
                    "author": "Kylaste",
                    "id": "ih7nj5v",
                    "parent_id": "t1_iesufie",
                    "score": 1,
                    "created_utc": 1658509678.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As someone who used to be interested in mbti, ISFP makes no sense at all lmao. It's because they use letters instead of cognitive functions which is the basis for mbti.",
            "author": "Kylaste",
            "id": "ih7nbt8",
            "parent_id": "t1_iee97rn",
            "score": 1,
            "created_utc": 1658509597.0,
            "replies": [
                {
                    "body": "Fi, Se, Ni, Te. I don't find any of it as surprising. But that's just me",
                    "author": "Arktoscircle",
                    "id": "ihep3ot",
                    "parent_id": "t1_ih7nbt8",
                    "score": 1,
                    "created_utc": 1658634951.0,
                    "replies": [
                        {
                            "body": "Te inferior is just impossible. It's a function so visible in him. He should be ISTJ in my opinion (Si, Te, Fi, Ne). Si because of his routinely life and attention to details, Te because of his efficient approach in things which cannot not be his inf function, tert fi because he is very principled but he appears tsudereish at times, and Ne inf because he finds it difficult to adjust to new things and possibilities.",
                            "author": "Kylaste",
                            "id": "ihm014p",
                            "parent_id": "t1_ihep3ot",
                            "score": 2,
                            "created_utc": 1658773983.0,
                            "replies": [
                                {
                                    "body": "I see, that is insightful. I wouldn't dispute that because oftentimes people are mistypes. It does requires a level of self-awareness to know for sure as I, myself, took a long time to find mine. Thank you for your answer, I will keep that in mind.",
                                    "author": "Arktoscircle",
                                    "id": "ihnh4bs",
                                    "parent_id": "t1_ihm014p",
                                    "score": 2,
                                    "created_utc": 1658795296.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "YJS should be ISFJ in my opinion 🤣. His Si and Fe is very noticeable for him to be ISFP.",
            "author": "Kylaste",
            "id": "ih7nj5v",
            "parent_id": "t1_iesufie",
            "score": 1,
            "created_utc": 1658509678.0,
            "replies": []
        },
        {
            "body": "Fi, Se, Ni, Te. I don't find any of it as surprising. But that's just me",
            "author": "Arktoscircle",
            "id": "ihep3ot",
            "parent_id": "t1_ih7nbt8",
            "score": 1,
            "created_utc": 1658634951.0,
            "replies": [
                {
                    "body": "Te inferior is just impossible. It's a function so visible in him. He should be ISTJ in my opinion (Si, Te, Fi, Ne). Si because of his routinely life and attention to details, Te because of his efficient approach in things which cannot not be his inf function, tert fi because he is very principled but he appears tsudereish at times, and Ne inf because he finds it difficult to adjust to new things and possibilities.",
                    "author": "Kylaste",
                    "id": "ihm014p",
                    "parent_id": "t1_ihep3ot",
                    "score": 2,
                    "created_utc": 1658773983.0,
                    "replies": [
                        {
                            "body": "I see, that is insightful. I wouldn't dispute that because oftentimes people are mistypes. It does requires a level of self-awareness to know for sure as I, myself, took a long time to find mine. Thank you for your answer, I will keep that in mind.",
                            "author": "Arktoscircle",
                            "id": "ihnh4bs",
                            "parent_id": "t1_ihm014p",
                            "score": 2,
                            "created_utc": 1658795296.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Te inferior is just impossible. It's a function so visible in him. He should be ISTJ in my opinion (Si, Te, Fi, Ne). Si because of his routinely life and attention to details, Te because of his efficient approach in things which cannot not be his inf function, tert fi because he is very principled but he appears tsudereish at times, and Ne inf because he finds it difficult to adjust to new things and possibilities.",
            "author": "Kylaste",
            "id": "ihm014p",
            "parent_id": "t1_ihep3ot",
            "score": 2,
            "created_utc": 1658773983.0,
            "replies": [
                {
                    "body": "I see, that is insightful. I wouldn't dispute that because oftentimes people are mistypes. It does requires a level of self-awareness to know for sure as I, myself, took a long time to find mine. Thank you for your answer, I will keep that in mind.",
                    "author": "Arktoscircle",
                    "id": "ihnh4bs",
                    "parent_id": "t1_ihm014p",
                    "score": 2,
                    "created_utc": 1658795296.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see, that is insightful. I wouldn't dispute that because oftentimes people are mistypes. It does requires a level of self-awareness to know for sure as I, myself, took a long time to find mine. Thank you for your answer, I will keep that in mind.",
            "author": "Arktoscircle",
            "id": "ihnh4bs",
            "parent_id": "t1_ihm014p",
            "score": 2,
            "created_utc": 1658795296.0,
            "replies": []
        }
    ]
}