{
    "title": "A comprehensive (and a bit extensive) guide to taking pictures for a Seeking Profile, for Sugar Babies",
    "post_id": "mfo79a",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mfo79a/a_comprehensive_and_a_bit_extensive_guide_to/",
    "author": "amaneeee",
    "body": "So, I finally got some spare time to write this post the way I intended.\n\nA few disclaimers, I'm a zoomer SB, English is not really my first language (pardon any typos or grammar mistakes) and maybe some of these won't be the cup of tea for everyone, but I tried to keep it as neutral and helpful to any girl who needs to update their profile pictures and doesn't know where to start. A fun thing is, this can also be applied to pictures posted to normal social media (yay).\n\nAll things cited at the end of each part are YouTube Videos I recommend regarding the topics.\n\n&#x200B;\n\n&#x200B;\n\n***PART I: CHOOSING THE LOCATION***\n\n**Indoors:** Make sure to be in front of a window and have good natural lighting. You may prefer taking the photos during the morning or the magic hour (sunset). If doing it with artificial lighting, make sure it is bright enough and can focus on your face, like one of these light rings used by beauty gurus. Make the background interesting, or at least tidy enough! Basically, clean your room. If you have a bookshelf with plenty of books, or a nice mirror or anything that can seem visually interesting in a photo, use it as a prop or in your background.\n\n**Outdoors:** Same thing about times to take the pictures, I would personally go with the magic hour (sunset or sunrise), since it gives such a beautiful tone to the skin. Same thing as indoors, choose an interesting background. If you have a garden or live next to a park, use it in your favor. Since now it's spring (at least in the north hemisphere, heh), definitely some cute pics could be taken near the flowers (if you don't have any allergies, of course). If you have a beach near, it's the perfect excuse to show off a bit of skin without seeming too vulgar.\n\n&#x200B;\n\n***PART II: PREPARING YOURSELF***\n\nFor me, this is the fun part. Don't overthink your outfit, specially considering that you should wear stuff you probably would like to use near your future sugar daddy. Be sure it's flattering on your body type, and you feel comfortable with. Trust me, wearing something you like will definitely give you more confidence for posing and showing yourself off during the \"photoshoot\". If you're still doubting, go check Pinterest for outfit ideas, and YouTube has plenty of videos lecturing on body types and the best way to dress them. Regardless, as lots of SDs pointed on this sub, wear something bodycon or tight enough to show your form. Personally, I think the classic little black dress always do the trick.\n\n(*how to dress for your body type, by* Jenny Mustard)\n\n&#x200B;\n\n***PART II RETURNS: OH MY GOD, HOW DO I DO MY MAKEUP?***\n\nFrom what I could gather on this sub, most SDs prefer natural looks and stuff that enhance your beauty, not cover it completely. Combining the fact you should have a nice and solid skincare routine and already know stuff that works for you, check Pinterest and YouTube for specific inspiration regarding your skin tone and face shape. I got your back here, and I selected a few of my personal favorites in makeup tutorials. I find them very easy to follow, and is still a very good watch to procrastinate :)\n\n(This is mostly for a night out! *Sophia Loren makeup tutorial* by Picturresque)\n\n(*Glowy coral makeup* by Pony Syndrome).\n\n(*Japanese 'igari' makeup* by Shane Vang)\n\n(*Maquillaje natural* by Fabi Puffle, in Spanish)\n\n(*PURE.*, also by Picturresque. I really like her looks, ok?)\n\nIf you're not having any of this makeup bs, just slap on a BB cream or some face cream in general and be good to go!\n\n&#x200B;\n\n***PART III: HOW TF SHOULD I TAKE THE PICTURE?***\n\nSelfies are always nice, but daddies want to see that sexy body! You may not have a tripod, but I'm sure God gave you a brain, creativity and a bit of logical thinking (I hope), and I'm pretty sure you might have a phone with a camera and timer (Well, otherwise you might not be reading this). I'm here to help a bit:\n\n\\- You can use your window (and the glass) to support your phone while taking pictures indoors,\n\n\\- Use a box, or a book to give a bit more of height (so you can catch the whole body in the frame, and a bottle or a can to support it)\n\n\\- Your laptop\n\n\\- A shelf\n\nWhen outdoors, I like to take a book inside my backpack and when I find a place to sit, I take my phone to take the pictures and use the backpack as a support. The book always helps to keep things in place.\n\nOr just buy a phone support, for god's Sake.\n\nPersonally, I like to have the camera more or less in the line of my bust or chin. But you do you.\n\n&#x200B;\n\n***PART IV: I LITERALLY DON'T KNOW HOW TO POSE***\n\nMy main advice is: Spend some time in front of a mirror. Gather your better angles, expressions and gestures. If you have some type of body dysmorphia, or are feeling lazy, YouTube also knows how to help.\n\n(*How to pose in photos*, by Sorelle Amore)\n\n(*Petite model tip: Expressions and poses*, by Andrea Ventura)\n\n(*How to pose*, but make it thicc!, by Javi)\n\n(*How to take your own travel photos*, by Sorelle Amore as well)\n\n(*How to pose - people who are not models*, by Anita Sadowska)\n\n&#x200B;\n\n***PART V: OK, CAN I AIRBRUSH IT A LITTLE?...***\n\nNO! Don't do it! Same thing for insta filters. Don't alter your face or body substantially, that could probably cost you a POT. We all know you're human (at least, we expect so), and pimples, pores, marks, scars, and stretch marks are all a consequence of literally existing. Also, sometimes it can be very noticeable. Not anyone has furniture, doors or floors with... curves. Unless you really are into Art Nouveau decor.\n\n&#x200B;\n\n***PART VI: BUT THE COLORS AND LIGHTING ARE AWFUL!***\n\nOk, fine! Altering the exposure, contrast and saturation is totally ok, specially to make the details pop out and the colors. As someone who dyes their hair ginger, I totally get someone who turns up the saturation a little to make it really stand out. I would avoid photo filters entirely, but if you *reeeally* want to do it, I recommend using it on a 20%-30% intensity to have a more natural appeal.\n\nThe mobile apps I recommend (And are available in Google Play and App Store) are these:\n\n\\- VSCO CAM\n\n\\- POLARR\n\n\\- LIGHTROOM\n\n\\- SNAPSEED\n\n\\- MEITU (Resist the temptation of retouching your skin!)\n\n\\- - -\n\nSo, that's it! I hope you actually learned something nice reading this. I got the idea after maybe reading too many posts here asking for advice on some of those topics. Feel free to add something, or ask if I didn't make myself that clear.\n\nHave a nice time sugaring!",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mfo79a/a_comprehensive_and_a_bit_extensive_guide_to/",
    "score": 94,
    "upvote_ratio": 0.95,
    "created_utc": 1617019955.0,
    "num_comments": 15,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Great post! I’ve also heard that the lightroom (?) app is really good for retouching photos + a lot of professionals/influencers use it just to even out the lighting etc. but I’ve never used it myself... Also a huge thank you for including tips for petite + full figured ladies! I’m a short busty girl myself and always found it SO HARD to pose and style my curves with this unfortunate (lack of) height lol. Hopefully other SBs find this helpful as well. 😊",
            "author": "curly_spice",
            "id": "gsoopsb",
            "parent_id": "t3_mfo79a",
            "score": 7,
            "created_utc": 1617024694.0,
            "replies": [
                {
                    "body": "Yes, Lightroom and even Snapseed do the work nicely. I'll include them on the list!",
                    "author": "amaneeee",
                    "id": "gsovxj7",
                    "parent_id": "t1_gsoopsb",
                    "score": 3,
                    "created_utc": 1617028398.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is outstanding!  Could be used by SD's as well for their profile photos.",
            "author": "jeffzeke",
            "id": "gsptpm9",
            "parent_id": "t3_mfo79a",
            "score": 4,
            "created_utc": 1617043853.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gsozdec",
            "parent_id": "t3_mfo79a",
            "score": 6,
            "created_utc": 1617030009.0,
            "replies": [
                {
                    "body": "Well, you do you! I included tips that I find useful to make someone blossom in front of the camera. It may seem dumb, but feeling that you look good really helps in creating a nice presence in photos.",
                    "author": "amaneeee",
                    "id": "gsozzpv",
                    "parent_id": "t1_gsozdec",
                    "score": 7,
                    "created_utc": 1617030300.0,
                    "replies": []
                },
                {
                    "body": "Great recommendations in the original post, \nI'm in the middle,  both should be excellent.  \n\nNothing says low effort more than a messy bedroom or as was the case with one classic , the dim image of a guy pulling up his pants in the background.  \n\nYou took the photo with you phone, sent it to your Ipad and on to SA   STOP   put the picture on a large monitor and look carefully.  Too often those taken in the bathroom mirror have unacceptable clutter in the background from messy to horror. \n\nBased on the discussion of the very unsecure nature of SA information I am a great fan of photos that are not recognizable but do accurately and favorably convey the SB.  \n\nCheating -  Opportunities abound,  from interrogations and experiences over more than a decade....  a silk blouse with recently ice chilled nipples (secret was extracted only after several Bombay Saphire martinis),  a smile in every photo ( I asked a married friend who sugared what was the primary reward and his comment - knowing that I will always be met with a smile) \n\nLaunching a great sugar relationship can result in very sizable financial benefits over a couple of years. The quality of the photos and text should reflect that. \n\nSimplicity is the ultimate sophistication",
                    "author": "pinotandsugar",
                    "id": "gsq86w0",
                    "parent_id": "t1_gsozdec",
                    "score": 3,
                    "created_utc": 1617050509.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you!!",
            "author": "InnocentSweetTooth",
            "id": "gspbgcd",
            "parent_id": "t3_mfo79a",
            "score": 2,
            "created_utc": 1617035630.0,
            "replies": []
        },
        {
            "body": "Yesss igari makeup, that’s my favourite",
            "author": "kirathekira",
            "id": "gspsue8",
            "parent_id": "t3_mfo79a",
            "score": 2,
            "created_utc": 1617043459.0,
            "replies": []
        },
        {
            "body": "Solid. Thanks. And so ya know. This is gonna help at least one sd in the future:)",
            "author": "Diditall4thecookie",
            "id": "gsqcb1s",
            "parent_id": "t3_mfo79a",
            "score": 2,
            "created_utc": 1617052437.0,
            "replies": [
                {
                    "body": "Ooh, thanks! I'm thinking about doing a post with more suggestions focused to SDs, since their main problem probably is with selfies :P",
                    "author": "amaneeee",
                    "id": "gsqu7u3",
                    "parent_id": "t1_gsqcb1s",
                    "score": 2,
                    "created_utc": 1617061513.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great post and don't worry about your English, it's just great.",
            "author": "No-Reveal8042",
            "id": "gsqh7d4",
            "parent_id": "t3_mfo79a",
            "score": 2,
            "created_utc": 1617054814.0,
            "replies": []
        },
        {
            "body": "This is great. Thanks for putting this together!!",
            "author": null,
            "id": "gsr9xh2",
            "parent_id": "t3_mfo79a",
            "score": 2,
            "created_utc": 1617070002.0,
            "replies": []
        },
        {
            "body": "Let me also cross reference this from last year... \n\n[https://www.reddit.com/r/sugarlifestyleforum/comments/ggn9is/profile\\_picture\\_tutorial/](https://www.reddit.com/r/sugarlifestyleforum/comments/ggn9is/profile_picture_tutorial/)",
            "author": "BinghamtonSD",
            "id": "gsssipj",
            "parent_id": "t3_mfo79a",
            "score": 2,
            "created_utc": 1617111817.0,
            "replies": []
        },
        {
            "body": "BRAVO! This is very good advice, hopefully those that need it take it to heart.",
            "author": "mraspencer",
            "id": "gsos7wc",
            "parent_id": "t3_mfo79a",
            "score": 2,
            "created_utc": 1617026552.0,
            "replies": [
                {
                    "body": "Thank you!",
                    "author": "amaneeee",
                    "id": "gsowtcy",
                    "parent_id": "t1_gsos7wc",
                    "score": 3,
                    "created_utc": 1617028818.0,
                    "replies": []
                },
                {
                    "body": "Oh my god, thank you for the award! You're too kind  ( ´ ω \\` )",
                    "author": "amaneeee",
                    "id": "gsp0cdc",
                    "parent_id": "t1_gsos7wc",
                    "score": 1,
                    "created_utc": 1617030464.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, Lightroom and even Snapseed do the work nicely. I'll include them on the list!",
            "author": "amaneeee",
            "id": "gsovxj7",
            "parent_id": "t1_gsoopsb",
            "score": 3,
            "created_utc": 1617028398.0,
            "replies": []
        },
        {
            "body": "Well, you do you! I included tips that I find useful to make someone blossom in front of the camera. It may seem dumb, but feeling that you look good really helps in creating a nice presence in photos.",
            "author": "amaneeee",
            "id": "gsozzpv",
            "parent_id": "t1_gsozdec",
            "score": 7,
            "created_utc": 1617030300.0,
            "replies": []
        },
        {
            "body": "Great recommendations in the original post, \nI'm in the middle,  both should be excellent.  \n\nNothing says low effort more than a messy bedroom or as was the case with one classic , the dim image of a guy pulling up his pants in the background.  \n\nYou took the photo with you phone, sent it to your Ipad and on to SA   STOP   put the picture on a large monitor and look carefully.  Too often those taken in the bathroom mirror have unacceptable clutter in the background from messy to horror. \n\nBased on the discussion of the very unsecure nature of SA information I am a great fan of photos that are not recognizable but do accurately and favorably convey the SB.  \n\nCheating -  Opportunities abound,  from interrogations and experiences over more than a decade....  a silk blouse with recently ice chilled nipples (secret was extracted only after several Bombay Saphire martinis),  a smile in every photo ( I asked a married friend who sugared what was the primary reward and his comment - knowing that I will always be met with a smile) \n\nLaunching a great sugar relationship can result in very sizable financial benefits over a couple of years. The quality of the photos and text should reflect that. \n\nSimplicity is the ultimate sophistication",
            "author": "pinotandsugar",
            "id": "gsq86w0",
            "parent_id": "t1_gsozdec",
            "score": 3,
            "created_utc": 1617050509.0,
            "replies": []
        },
        {
            "body": "Ooh, thanks! I'm thinking about doing a post with more suggestions focused to SDs, since their main problem probably is with selfies :P",
            "author": "amaneeee",
            "id": "gsqu7u3",
            "parent_id": "t1_gsqcb1s",
            "score": 2,
            "created_utc": 1617061513.0,
            "replies": []
        },
        {
            "body": "Thank you!",
            "author": "amaneeee",
            "id": "gsowtcy",
            "parent_id": "t1_gsos7wc",
            "score": 3,
            "created_utc": 1617028818.0,
            "replies": []
        },
        {
            "body": "Oh my god, thank you for the award! You're too kind  ( ´ ω \\` )",
            "author": "amaneeee",
            "id": "gsp0cdc",
            "parent_id": "t1_gsos7wc",
            "score": 1,
            "created_utc": 1617030464.0,
            "replies": []
        }
    ]
}