{
    "title": "(Late) 1-Year Results w/ Finasteride & Minoxidil",
    "post_id": "s126fs",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/s126fs/late_1year_results_w_finasteride_minoxidil/",
    "author": "zacboring",
    "body": "",
    "url": "https://www.reddit.com/gallery/s126fs",
    "score": 735,
    "upvote_ratio": 0.99,
    "created_utc": 1641869308.0,
    "num_comments": 134,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Crazy results, well done.\n\nAlthough the crown is likely as good as its going to get on your current drugs, I'd bet that those low quality hairs that you have up front will get better with time. When the hair is thinning or gone in an area, the follicles have moved towards the top layer of the skin, and it takes many shedding cycles for the hair to move back down and become healthy again.",
            "author": "No-FreeLunch",
            "id": "hs5t1o5",
            "parent_id": "t3_s126fs",
            "score": 120,
            "created_utc": 1641872657.0,
            "replies": [
                {
                    "body": "I was not aware of that! Thanks for the insight, I sure hope you’re right!",
                    "author": "zacboring",
                    "id": "hs611gc",
                    "parent_id": "t1_hs5t1o5",
                    "score": 32,
                    "created_utc": 1641876161.0,
                    "replies": [
                        {
                            "body": "What was your age when you started this? Thanx",
                            "author": "Man_of_desert",
                            "id": "ilpn0nx",
                            "parent_id": "t1_hs611gc",
                            "score": 2,
                            "created_utc": 1661419759.0,
                            "replies": [
                                {
                                    "body": "24",
                                    "author": "zacboring",
                                    "id": "imazmbe",
                                    "parent_id": "t1_ilpn0nx",
                                    "score": 3,
                                    "created_utc": 1661807115.0,
                                    "replies": [
                                        {
                                            "body": "Thanx man. Did finasteride tablets cause any side effects?",
                                            "author": "Man_of_desert",
                                            "id": "imc90eb",
                                            "parent_id": "t1_imazmbe",
                                            "score": 2,
                                            "created_utc": 1661827896.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You back from the dead bro",
            "author": "FastGooner77",
            "id": "hs60lbh",
            "parent_id": "t3_s126fs",
            "score": 96,
            "created_utc": 1641875955.0,
            "replies": [
                {
                    "body": "😂",
                    "author": "zacboring",
                    "id": "hs61fi5",
                    "parent_id": "t1_hs60lbh",
                    "score": 18,
                    "created_utc": 1641876346.0,
                    "replies": []
                },
                {
                    "body": "yoo hahahaha",
                    "author": "asdfcrow",
                    "id": "hs6comi",
                    "parent_id": "t1_hs60lbh",
                    "score": 4,
                    "created_utc": 1641882406.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry this is so late fellas. Started a new job and moved into my first apartment recently, so I’ve been a bit distracted. \n\nI was honestly hesitant to post this 1-year update because I figured you guys would be a little disappointed, but I wanted to be honest with everyone. To me it appears my results reached their peak around month 8. I haven’t noticed any further results since then (granted; I did have to stop taking Minoxidil for about a month back in October when I was in-between jobs and didn’t want to spare the money), but I really shouldn’t complain considering how bad things had gotten back in November of 2020 for my hair. I’ve also missed a few doses of Finasteride and neglected to use Minoxidil 2x per day on several occasions the last three months, so I’m sure that hasn’t helped. I just got really busy and kept forgetting at times.\n\nSO— here is what I’ve learned over the last year of this experiment:\n\n1.) The side effects are NOT a guarantee. I never once had E.D. in any capacity throughout this whole thing.\n2.) I certainly noticed a difference when I would derma-roll before putting on the Minoxidil. I’d do it once a month after showering and before my nightly application. I eventually stopped, thinking it wasn’t doing anything, but then noticed that my scalp didn’t seem to be absorbing the medicine as well so I started doing it again. \n3.) If using Minoxidil; your results will be better if you keep your hair shorter. I noticed that when I grew my hair longer it made it more difficult for the minoxidil to actually saturate my scalp because most of it was just soaking into the hair itself. It might just be my application process, so who knows. Just thought I’d make it known. \n4.) The longer you wait to start on this, the smaller your results will be. My crown began thinning at the end of 2016. The rest started to go early 2019, and got REALLY bad mid-2020. Even after an entire year of medicinal therapy my crown is still pretty thin. MUCH better than the last few years of my life, but still not where I want it to be comfortable. My hairline and top density is doing well and I’m satisfied enough. \n5.) Even if your hair grows back it will never be the same. My current texture is far different than it ever has been. My coverage is decent but the actual *quality* of those hairs leaves a lot to be desired. The new hairs I’ve regrown are thin, wiry, and seem to flat-out REFUSE to grow past a certain length. I had a natural mullet from months 5-8.\n6.) I’ve been informed that Minoxidil is poisonous to cats (?) if ingested, so if you have a cat PLEASE make sure you lock it out of the bathroom while applying. Not sure if that is true, but I don’t think it’s worth the risk by ignoring it. Any time I spend the night at a friend’s house who owns a cat I sleep in a beanie to be extra safe. \n7.) Missing a dose of Finasteride from time-to-time isn’t a huge deal. It takes 3-5 months for it to start working in your system, missing one day every month or so won’t derail your progress. Don’t stress about it, and don’t double-up on doses if you missed the day before. You’ll be ok. \n\nAnd to answer a few questions that I will inevitably get: NO, I did not get erectile dysfunction at any point during this. NO, I did not get a hair transplant (but I totally would if I could afford it). YES, the pictures are all of the same guy (me). YES, this stuff will need to be taken for the rest of my life if I wish to keep my hair, unless they develop a cure for MPB. YES, I intend on taking this for as long as I can pay for the pills. \n\nI’m happy to answer any questions you may have, but if you ask me a question I’ve already addressed in this post I will ignore it. I’m tired of typing the same response to people on a daily basis. \n\nHang in there guys!",
            "author": "zacboring",
            "id": "hs5l2ry",
            "parent_id": "t3_s126fs",
            "score": 45,
            "created_utc": 1641869322.0,
            "replies": [
                {
                    "body": "Dude your before pic is worse than me right now, and your after pick is better than my hair was when I was 20.\n\nNot sure how anyone would be disappointed by your results.\n\nI’m just disappointed fin didn’t do shit for me. Meanwhile you got most of your hair back.",
                    "author": "Xaxxus",
                    "id": "hs6r0cz",
                    "parent_id": "t1_hs5l2ry",
                    "score": 29,
                    "created_utc": 1641892966.0,
                    "replies": [
                        {
                            "body": "I guess I was just feeling a lot of pressure for my results to be “perfect”. I’ve had a lot of people on Reddit following my progress this year and I was worried they’d be discouraged about seeing it not fully fix the problem. I didn’t want to let anyone down. I, myself, am very happy with the results",
                            "author": "zacboring",
                            "id": "hs8lh55",
                            "parent_id": "t1_hs6r0cz",
                            "score": 5,
                            "created_utc": 1641925331.0,
                            "replies": []
                        },
                        {
                            "body": "Finestaride did not help you? why?",
                            "author": "Will_Cheung1979",
                            "id": "iccgwln",
                            "parent_id": "t1_hs6r0cz",
                            "score": 1,
                            "created_utc": 1655224189.0,
                            "replies": [
                                {
                                    "body": "Didn’t get any results after 8 months of taking it. Not much else to elaborate on.",
                                    "author": "Xaxxus",
                                    "id": "icch76u",
                                    "parent_id": "t1_iccgwln",
                                    "score": 2,
                                    "created_utc": 1655224309.0,
                                    "replies": [
                                        {
                                            "body": "Did you find any other solution? I did a expensive hair transplant that didnt work. The clinic are clueless. I am afraid we are the 1% that are not responsible for any treatment..",
                                            "author": "Will_Cheung1979",
                                            "id": "iccsh3p",
                                            "parent_id": "t1_icch76u",
                                            "score": 1,
                                            "created_utc": 1655228865.0,
                                            "replies": [
                                                {
                                                    "body": "Nope. I just shaved my head and went bald.",
                                                    "author": "Xaxxus",
                                                    "id": "icd15oq",
                                                    "parent_id": "t1_iccsh3p",
                                                    "score": 1,
                                                    "created_utc": 1655232439.0,
                                                    "replies": [
                                                        {
                                                            "body": "Hm, did you get any side effects? Did you take everyday or every third day? 1 mg.",
                                                            "author": "Will_Cheung1979",
                                                            "id": "icl6qby",
                                                            "parent_id": "t1_icd15oq",
                                                            "score": 1,
                                                            "created_utc": 1655391112.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Took it daily.\n\nI occasionally had mild pain in my balls. But I don’t know if that was related.\n\nOther than that no side effects.",
                                                                    "author": "Xaxxus",
                                                                    "id": "icn0f7x",
                                                                    "parent_id": "t1_icl6qby",
                                                                    "score": 1,
                                                                    "created_utc": 1655419143.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Ok, thanks",
                                                                            "author": "Will_Cheung1979",
                                                                            "id": "id3asb8",
                                                                            "parent_id": "t1_icn0f7x",
                                                                            "score": 1,
                                                                            "created_utc": 1655751552.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Foam or liquid minox? Which shampoos?",
                    "author": "Nochestbrahh",
                    "id": "hs6k9un",
                    "parent_id": "t1_hs5l2ry",
                    "score": 3,
                    "created_utc": 1641887637.0,
                    "replies": [
                        {
                            "body": "Liquid. 1-2x per day. I hardly ever use shampoo (maybe once per month), but when I would I’d just use whatever my mom had sitting around",
                            "author": "zacboring",
                            "id": "hs8lr10",
                            "parent_id": "t1_hs6k9un",
                            "score": 4,
                            "created_utc": 1641925428.0,
                            "replies": [
                                {
                                    "body": "Hey man. How many times a day do u put fin/min on your scalp and is it a daily thing? Do you shampoo it off everyday too? And do u take any additional pills? thanks",
                                    "author": "Avowed_Precursor",
                                    "id": "hstz4kr",
                                    "parent_id": "t1_hs8lr10",
                                    "score": 2,
                                    "created_utc": 1642290537.0,
                                    "replies": [
                                        {
                                            "body": "I take a Finasteride pill once per day, and try to put Minoxidil on my scalp twice per day. I hardly ever use shampoo, so I don’t wash it off that often. I also take vitamin D, and sometimes biotin",
                                            "author": "zacboring",
                                            "id": "hsuw8it",
                                            "parent_id": "t1_hstz4kr",
                                            "score": 1,
                                            "created_utc": 1642304790.0,
                                            "replies": [
                                                {
                                                    "body": "How much are the pills and do u have to go to a doctor to get them? Same question for the minoxidil. Thanks",
                                                    "author": "Chalkywhite007",
                                                    "id": "htzdfp3",
                                                    "parent_id": "t1_hsuw8it",
                                                    "score": 1,
                                                    "created_utc": 1643000440.0,
                                                    "replies": [
                                                        {
                                                            "body": "Finasteride requires a prescription, and I pay about $40 for a 3-month supply at my local pharmacy. Minoxidil is available off-the-shelf and I pay around $20 for a 3-month supply of that",
                                                            "author": "zacboring",
                                                            "id": "hu2ie79",
                                                            "parent_id": "t1_htzdfp3",
                                                            "score": 1,
                                                            "created_utc": 1643058194.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "When you roll a derma roller and then apply the minoxidil, does it not hurt? since its alcohol?",
                                    "author": "Will_Cheung1979",
                                    "id": "icch0gg",
                                    "parent_id": "t1_hs8lr10",
                                    "score": 1,
                                    "created_utc": 1655224232.0,
                                    "replies": [
                                        {
                                            "body": "Sometimes it feels a little “warm” on the scalp after derma rolling, but not too bad. It stung the first time I ever tried it, but now I barely notice it.",
                                            "author": "zacboring",
                                            "id": "icd3ihb",
                                            "parent_id": "t1_icch0gg",
                                            "score": 1,
                                            "created_utc": 1655233416.0,
                                            "replies": [
                                                {
                                                    "body": "Ok, that length was your dermaroller?",
                                                    "author": "Will_Cheung1979",
                                                    "id": "icl75o9",
                                                    "parent_id": "t1_icd3ihb",
                                                    "score": 1,
                                                    "created_utc": 1655391296.0,
                                                    "replies": [
                                                        {
                                                            "body": ".05mm, I think? It’s been a while since I’ve bought it\n\nCORRECTION: I found the sticker. It’s 0.5mm",
                                                            "author": "zacboring",
                                                            "id": "icli83f",
                                                            "parent_id": "t1_icl75o9",
                                                            "score": 1,
                                                            "created_utc": 1655396001.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Ok, thanks. I see you were pretty bald before. Was your hair just sleeping and the Finestaride woke them up? How long can hairs be sleeping before its too late?",
                                                                    "author": "Will_Cheung1979",
                                                                    "id": "id3api0",
                                                                    "parent_id": "t1_icli83f",
                                                                    "score": 1,
                                                                    "created_utc": 1655751519.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "This is where my knowledge runs out. I have zero clue how any of this actually works",
                                                                            "author": "zacboring",
                                                                            "id": "id4pu6e",
                                                                            "parent_id": "t1_id3api0",
                                                                            "score": 1,
                                                                            "created_utc": 1655775227.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "just for your information , hair tranplant is not a miracle and in your case it won't fixe all the problems since you have a large balding area so u need a considerable amount of grafts +  you will still have the treatement after hair transplant . the treatement showed that you are an excellent candidate for medical treatement so stick to that , in 4 5 years finasterid will have less effect , so then you can have a hair tranplant to help.",
                    "author": "Odd_Challenge7239",
                    "id": "i2k9rq5",
                    "parent_id": "t1_hs5l2ry",
                    "score": 1,
                    "created_utc": 1648561237.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "From Jack Nickelson to Niel Patrick Harris.",
            "author": "Mirapple",
            "id": "hs7n4zh",
            "parent_id": "t3_s126fs",
            "score": 8,
            "created_utc": 1641912521.0,
            "replies": [
                {
                    "body": "Never heard that one before 😂",
                    "author": "zacboring",
                    "id": "hs8jzmv",
                    "parent_id": "t1_hs7n4zh",
                    "score": 3,
                    "created_utc": 1641924793.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Insane progress brother! Keep it up looking good",
            "author": "Monchi_21",
            "id": "hs5uf66",
            "parent_id": "t3_s126fs",
            "score": 6,
            "created_utc": 1641873249.0,
            "replies": []
        },
        {
            "body": "Great results! Do you think finasteride on its own would have been enough or the minoxidil + derma-roll was needed to regrow? I’m currently on finasteride and it doesn’t seem to be working that great for me (6 months in). I’ve even hesitant to start minoxidil because I have kitty cats.",
            "author": "larryinpdx",
            "id": "hs6epy2",
            "parent_id": "t3_s126fs",
            "score": 7,
            "created_utc": 1641883720.0,
            "replies": [
                {
                    "body": "While fin can regrow hair for some men, it’s not even really advertised to do so as it’s main function is preventing loss. It is rare for fin to regrow a significant amount of hair",
                    "author": "talkingspacecoyote",
                    "id": "hs7h0ke",
                    "parent_id": "t1_hs6epy2",
                    "score": 8,
                    "created_utc": 1641909886.0,
                    "replies": [
                        {
                            "body": "Agreed. Fin is good for keeping what you got. Minoxidil helps regrowth. The two together were absolutely necessary in my case",
                            "author": "zacboring",
                            "id": "hs8lzle",
                            "parent_id": "t1_hs7h0ke",
                            "score": 4,
                            "created_utc": 1641925513.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "My bf has a cat, I'm a dog person. His cat doesn't climb all over us though. She rarely sleeps in the bed with us. She's just not interested in attention too often. So maybe because she is this way she doesn't run the risk of ever consuming my minoxidil. I think even if my bf used minoxidil she wouldn't bother him too often while putting it on. Men also happen to be less careful when applying things to their hair than women. I wouldn't drop any on the floor, but my bf would for sure.",
                    "author": "NASTYHEARTBREAKER",
                    "id": "hsa7d2d",
                    "parent_id": "t1_hs6epy2",
                    "score": 3,
                    "created_utc": 1641947323.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow, this is pretty nuts. It's awesome that somethin like this exists.",
            "author": "ThisIsGoobly",
            "id": "hs6tkuu",
            "parent_id": "t3_s126fs",
            "score": 5,
            "created_utc": 1641895076.0,
            "replies": [
                {
                    "body": "Still feels too good to be true. I’m trying not to get in my head about it, haha",
                    "author": "zacboring",
                    "id": "hs8m62z",
                    "parent_id": "t1_hs6tkuu",
                    "score": 2,
                    "created_utc": 1641925577.0,
                    "replies": [
                        {
                            "body": "Congrats man\nWhat brand of finasteride are you using, I mean which generic\nAlso do you think brand matters because merck propecia is expensive af\nAgain\nCongrats about your hair :)",
                            "author": "Vegetable_Sorbet6219",
                            "id": "htau0qu",
                            "parent_id": "t1_hs8m62z",
                            "score": 2,
                            "created_utc": 1642586891.0,
                            "replies": [
                                {
                                    "body": "Thank you! And the pills I take are so generic they’re literally just called “Finasteride”, the bottle has no other name on the label other than the pharmacy itself. So I don’t think the brand really matters as long as it’s the 1mg pill. I went as cheap as possible (Propecia is most popular but it’s super expensive). I’m paying about $40 for a 3-month supply",
                                    "author": "zacboring",
                                    "id": "htbw7we",
                                    "parent_id": "t1_htau0qu",
                                    "score": 1,
                                    "created_utc": 1642607373.0,
                                    "replies": [
                                        {
                                            "body": "You're right. I worked at a pharmacy for a while and learnt a trick. Always buy the generic brand because it's exactly the same as the branded version. Just cheaper. You're literally paying for the brand when you choose expensive medicine",
                                            "author": "AlexanderNova",
                                            "id": "ifbuxld",
                                            "parent_id": "t1_htbw7we",
                                            "score": 2,
                                            "created_utc": 1657278096.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "hey, impressive results btw, do you need a prescription every time you buy finasteride? or just went to the dermatologist once and always bought with no problem since then?",
                                            "author": "royal_watermelon",
                                            "id": "ibnerz0",
                                            "parent_id": "t1_htbw7we",
                                            "score": 1,
                                            "created_utc": 1654719216.0,
                                            "replies": [
                                                {
                                                    "body": "Very good question. Typically when I’ve been written a prescription that script specifies the number of pills and how many refills. My first prescription I was written was for a 9-month supply. So I was given 3 refills with 90 pills in each bottle (3 month supply per bottle). Once that prescription runs out you’ll need to have your doctor write a new one. Since then it’s been a bit more random for me. I’ve been written one month supplies, and three month supplies. Not sure why it’s all over the place, but I’m just happy to get it. Haha",
                                                    "author": "zacboring",
                                                    "id": "ibrm8iw",
                                                    "parent_id": "t1_ibnerz0",
                                                    "score": 2,
                                                    "created_utc": 1654802314.0,
                                                    "replies": [
                                                        {
                                                            "body": "ohh ok thank you!! is that prescribed by your regular doctor or a dermatologist? I'm going go the dermatologist in 2 weeks and im paying a full appointment so that he would give me the prescription, but I don't want to pay for more appointments everytime i need a refill 😭😭",
                                                            "author": "royal_watermelon",
                                                            "id": "icejagy",
                                                            "parent_id": "t1_ibrm8iw",
                                                            "score": 1,
                                                            "created_utc": 1655257277.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Your dermatologist will write you one if they agree that you could benefit from it! I ended up getting mine through a consultation via an app (covid times). Maybe you could talk to them about the renewal process (or go with a company like “Hims” or “Keeps” where they send you what you need every month)",
                                                                    "author": "zacboring",
                                                                    "id": "ichicjm",
                                                                    "parent_id": "t1_icejagy",
                                                                    "score": 2,
                                                                    "created_utc": 1655317827.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "sorry, what are those companies really?",
                                                                            "author": "royal_watermelon",
                                                                            "id": "icj4ljh",
                                                                            "parent_id": "t1_ichicjm",
                                                                            "score": 1,
                                                                            "created_utc": 1655343759.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "They just sell kits with hair stuff in them like Finasteride and Minoxidil along with shampoos or whatever. I’ve never tried them, but people seem to like the convenience of it",
                                                                                    "author": "zacboring",
                                                                                    "id": "icli4kf",
                                                                                    "parent_id": "t1_icj4ljh",
                                                                                    "score": 2,
                                                                                    "created_utc": 1655395961.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "so that would work like topical finasteride right? but oral must be more efficient",
                                                                                            "author": "royal_watermelon",
                                                                                            "id": "icll2yy",
                                                                                            "parent_id": "t1_icli4kf",
                                                                                            "score": 1,
                                                                                            "created_utc": 1655397172.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "No idea. Haven’t tried any of those options",
                                                                                                    "author": "zacboring",
                                                                                                    "id": "icm12ef",
                                                                                                    "parent_id": "t1_icll2yy",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1655403727.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Holy shit nice comeback",
            "author": "PM-ME-UR-DESKTOP",
            "id": "hs6ood8",
            "parent_id": "t3_s126fs",
            "score": 4,
            "created_utc": 1641891065.0,
            "replies": []
        },
        {
            "body": "Fuck yeah dude",
            "author": "bootyboixD",
            "id": "hs60fze",
            "parent_id": "t3_s126fs",
            "score": 3,
            "created_utc": 1641875886.0,
            "replies": []
        },
        {
            "body": "Hell yeah dude.  Good on you.",
            "author": "ShutterHawk",
            "id": "hs65sqf",
            "parent_id": "t3_s126fs",
            "score": 3,
            "created_utc": 1641878448.0,
            "replies": []
        },
        {
            "body": "Bro that's insane.",
            "author": "Every-Candidate9963",
            "id": "hs6j0zz",
            "parent_id": "t3_s126fs",
            "score": 3,
            "created_utc": 1641886713.0,
            "replies": []
        },
        {
            "body": "WOW, that's crazy! Congratulations on regaining your hair. How does it feel?",
            "author": "obsessivesquirrel",
            "id": "hs7rwk8",
            "parent_id": "t3_s126fs",
            "score": 3,
            "created_utc": 1641914427.0,
            "replies": [
                {
                    "body": "Thank you! It feels great, man. Still a bit insecure about the crown area, but I just try to remind myself that it was once MUCH worse and I should calm down. Over all I’m very pleased with the results and it has made a positive impact on my life",
                    "author": "zacboring",
                    "id": "hs8jroj",
                    "parent_id": "t1_hs7rwk8",
                    "score": 3,
                    "created_utc": 1641924712.0,
                    "replies": [
                        {
                            "body": "You're welcome. That's awesome to hear. Keep up the positive attitude!",
                            "author": "obsessivesquirrel",
                            "id": "hs8ye3w",
                            "parent_id": "t1_hs8jroj",
                            "score": 2,
                            "created_utc": 1641930054.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow, crazy results. Also, it’s 416 days.",
            "author": "Trevard",
            "id": "hs8dbxp",
            "parent_id": "t3_s126fs",
            "score": 3,
            "created_utc": 1641922380.0,
            "replies": [
                {
                    "body": "Thanks! I’m terrible at math, so I gave up on keeping track of the days at one point",
                    "author": "zacboring",
                    "id": "hs8j7d1",
                    "parent_id": "t1_hs8dbxp",
                    "score": 1,
                    "created_utc": 1641924505.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How old are you? I started the growth cocktail in my mid 40's. Not seeing the same results.",
            "author": "004dogwhistle",
            "id": "hs6sn64",
            "parent_id": "t3_s126fs",
            "score": 2,
            "created_utc": 1641894304.0,
            "replies": [
                {
                    "body": "25",
                    "author": "zacboring",
                    "id": "hs8kvqi",
                    "parent_id": "t1_hs6sn64",
                    "score": 4,
                    "created_utc": 1641925115.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\\-30 years",
            "author": "ivan_dhs",
            "id": "hs7ebq3",
            "parent_id": "t3_s126fs",
            "score": 2,
            "created_utc": 1641908639.0,
            "replies": [
                {
                    "body": "Since I’m only 25, I’m very happy to hear that. Haha",
                    "author": "zacboring",
                    "id": "hs8kp6y",
                    "parent_id": "t1_hs7ebq3",
                    "score": 2,
                    "created_utc": 1641925051.0,
                    "replies": [
                        {
                            "body": "I'm sure the angle wasn't helping but in the first pic it even looked like the hair was whitish, Happy for you, you look so much better now",
                            "author": "ivan_dhs",
                            "id": "hs8lffe",
                            "parent_id": "t1_hs8kp6y",
                            "score": 3,
                            "created_utc": 1641925314.0,
                            "replies": [
                                {
                                    "body": "Thank you! I think the first picture was closer to the light source in the bathroom. Thin hair + bright light does look very whitish",
                                    "author": "zacboring",
                                    "id": "hs8mgio",
                                    "parent_id": "t1_hs8lffe",
                                    "score": 1,
                                    "created_utc": 1641925682.0,
                                    "replies": [
                                        {
                                            "body": "Hey bro at what length were you dermarolling? and frequency?",
                                            "author": "SuccotashClassic6713",
                                            "id": "i921570",
                                            "parent_id": "t1_hs8mgio",
                                            "score": 1,
                                            "created_utc": 1652868537.0,
                                            "replies": [
                                                {
                                                    "body": "I believe .05mm? Can’t remember for sure. But I do it once or twice a month",
                                                    "author": "zacboring",
                                                    "id": "i94jnkk",
                                                    "parent_id": "t1_i921570",
                                                    "score": 1,
                                                    "created_utc": 1652909992.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "wtf! I just added minoxidil to my regimen.. hope i get half the results as yours",
            "author": "imagaruna",
            "id": "hs7ofwy",
            "parent_id": "t3_s126fs",
            "score": 2,
            "created_utc": 1641913049.0,
            "replies": [
                {
                    "body": "Best of luck! Just keep at it",
                    "author": "zacboring",
                    "id": "hs8jv72",
                    "parent_id": "t1_hs7ofwy",
                    "score": 1,
                    "created_utc": 1641924748.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just epic",
            "author": "schwol",
            "id": "hs810hk",
            "parent_id": "t3_s126fs",
            "score": 2,
            "created_utc": 1641917871.0,
            "replies": []
        },
        {
            "body": "Crazy results",
            "author": "Shoddy_Series_6451",
            "id": "hs8m9q6",
            "parent_id": "t3_s126fs",
            "score": 2,
            "created_utc": 1641925614.0,
            "replies": []
        },
        {
            "body": "That's very encouraging. I haven't had any severe or notable loss yet since I'm only 26, but I've been doing both of these mentioned treatments thru Roman for like 2 years now for maintenance. Hairline staying strong 🤙",
            "author": "PunsAkimbo69",
            "id": "hs8qbdg",
            "parent_id": "t3_s126fs",
            "score": 2,
            "created_utc": 1641927080.0,
            "replies": [
                {
                    "body": "That’s good to hear! I’m only 25, so you’re already doing better than me if you’ve made it to 26 without losing it, haha. Preventative measures now will definitely pay off down the line. Good luck!",
                    "author": "zacboring",
                    "id": "hscz8tu",
                    "parent_id": "t1_hs8qbdg",
                    "score": 2,
                    "created_utc": 1642002508.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Incredible progress. I’ve just been using minoxidil myself. Might consider asking my doctor for a prescription for finasteride",
            "author": "NerdyKeith",
            "id": "hs8vmcy",
            "parent_id": "t3_s126fs",
            "score": 2,
            "created_utc": 1641929036.0,
            "replies": []
        },
        {
            "body": "Do these medicines causes any side effects other than growth??",
            "author": "GalacticNerd88",
            "id": "hs9301e",
            "parent_id": "t3_s126fs",
            "score": 2,
            "created_utc": 1641931743.0,
            "replies": []
        },
        {
            "body": "Looks amazing. \n1. Is their any particular brand of Minoxidil? \n2. You don’t shampoo? And that’s works? I’ve heard that before but didn’t really think about it much until seeing this.",
            "author": null,
            "id": "hs9lxbh",
            "parent_id": "t3_s126fs",
            "score": 2,
            "created_utc": 1641938667.0,
            "replies": [
                {
                    "body": "Thank you!\n\n1. I just use the generic Equate brand from Walmart. It’s much cheaper than Rogain \n\n2. I mostly don’t because shampoo seems to dry my hair out REALLY bad. So I only do it about once a month to clean any buildup of product or dirt to allow the Minoxidil to keep working. I do use conditioner more often though",
                    "author": "zacboring",
                    "id": "hscydqu",
                    "parent_id": "t1_hs9lxbh",
                    "score": 2,
                    "created_utc": 1642002168.0,
                    "replies": [
                        {
                            "body": "Thank for explaining that man. I shampoo everyday and have my doubts about that. \n\n1. How often do you use conditioner?\n2. Any particular brand you feel that helps?",
                            "author": null,
                            "id": "hsfu5hf",
                            "parent_id": "t1_hscydqu",
                            "score": 2,
                            "created_utc": 1642043637.0,
                            "replies": [
                                {
                                    "body": "Still searching for the right kind, honestly. Lately I’ve been trying the Paul Mitchell conditioner and so far I’m liking it. But it’s too soon to tell if it’s actually repairing anything",
                                    "author": "zacboring",
                                    "id": "hsfw03q",
                                    "parent_id": "t1_hsfu5hf",
                                    "score": 1,
                                    "created_utc": 1642044493.0,
                                    "replies": [
                                        {
                                            "body": "Cool. How often do you use it? Is it like a daily thing?",
                                            "author": null,
                                            "id": "hsg3e2m",
                                            "parent_id": "t1_hsfw03q",
                                            "score": 1,
                                            "created_utc": 1642048028.0,
                                            "replies": [
                                                {
                                                    "body": "No, maybe twice a week. I don’t wash my hair every time I shower",
                                                    "author": "zacboring",
                                                    "id": "hshx55e",
                                                    "parent_id": "t1_hsg3e2m",
                                                    "score": 1,
                                                    "created_utc": 1642088320.0,
                                                    "replies": [
                                                        {
                                                            "body": "Got it thanks man!",
                                                            "author": null,
                                                            "id": "hsj92s4",
                                                            "parent_id": "t1_hshx55e",
                                                            "score": 2,
                                                            "created_utc": 1642106114.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Day 417, according to timeanddate.com",
            "author": "MercuryAI",
            "id": "hsa4en6",
            "parent_id": "t3_s126fs",
            "score": 2,
            "created_utc": 1641946073.0,
            "replies": []
        },
        {
            "body": "Very very huge progress, btw I remember your original post",
            "author": "yerm1",
            "id": "hsd7bxs",
            "parent_id": "t3_s126fs",
            "score": 2,
            "created_utc": 1642005608.0,
            "replies": [
                {
                    "body": "Welcome back to my big ol’ forehead!",
                    "author": "zacboring",
                    "id": "hsdl0r5",
                    "parent_id": "t1_hsd7bxs",
                    "score": 1,
                    "created_utc": 1642010693.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congratulations!\n\nMinoxidil is said to cause dark circles under eyes and other skin quality issues (destroying collagen?). This doesn't sound good. I've seen people saying they had zero issues, others it was visible and prompted people to tell them about it.\n\nWhat about you?",
            "author": "According_Nature_495",
            "id": "hsdlobs",
            "parent_id": "t3_s126fs",
            "score": 2,
            "created_utc": 1642010935.0,
            "replies": [
                {
                    "body": "Hmmm. Haven’t noticed anything myself, but I’ve always had darker under-eyes from having a poor sleep schedule. And my skin isn’t really any different from before (as far as I can tell). But thanks for the heads-up! I’ll keep an eye on that",
                    "author": "zacboring",
                    "id": "hsewtrw",
                    "parent_id": "t1_hsdlobs",
                    "score": 1,
                    "created_utc": 1642028711.0,
                    "replies": [
                        {
                            "body": "Try to fix your sleep schedule it will change your life! (I'm saying this as my sleep is also severely disregulated)\n\nDo everything you can. If want to improve your sleep look into magnesium it will help. And of course avoid screens at night for several hours... This is what's causing the issues for me, along with not working out. Working out daily (but avoid late afternoon and evening) + magnesium + good light environment + no screens at night = great sleep",
                            "author": "According_Nature_495",
                            "id": "hsexirw",
                            "parent_id": "t1_hsewtrw",
                            "score": 2,
                            "created_utc": 1642028993.0,
                            "replies": [
                                {
                                    "body": "The “no screens before bed” is probably my biggest issue. I’m a sucker for some late-night TV and Instagram scrolling. But thank you for the tip!",
                                    "author": "zacboring",
                                    "id": "hsfvqyw",
                                    "parent_id": "t1_hsexirw",
                                    "score": 1,
                                    "created_utc": 1642044373.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Handsome chap. What a decision to go the route you have",
            "author": "Craigrofo",
            "id": "ht3deoy",
            "parent_id": "t3_s126fs",
            "score": 2,
            "created_utc": 1642456456.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hthmna3",
            "parent_id": "t3_s126fs",
            "score": 2,
            "created_utc": 1642702647.0,
            "replies": [
                {
                    "body": "Whatever works for you, man!",
                    "author": "zacboring",
                    "id": "htm7s8y",
                    "parent_id": "t1_hthmna3",
                    "score": 1,
                    "created_utc": 1642783094.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Went from lady killer to lady killer",
            "author": null,
            "id": "i09x0e8",
            "parent_id": "t3_s126fs",
            "score": 2,
            "created_utc": 1647025167.0,
            "replies": [
                {
                    "body": "😂",
                    "author": "zacboring",
                    "id": "i0gxcb8",
                    "parent_id": "t1_i09x0e8",
                    "score": 1,
                    "created_utc": 1647158420.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Excellent results! How old are you btw?",
            "author": "Interesting-Mobile91",
            "id": "ilyuy7w",
            "parent_id": "t3_s126fs",
            "score": 2,
            "created_utc": 1661578160.0,
            "replies": [
                {
                    "body": "Thanks! I’m 26",
                    "author": "zacboring",
                    "id": "imazt7m",
                    "parent_id": "t1_ilyuy7w",
                    "score": 1,
                    "created_utc": 1661807200.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "HOW?",
            "author": "Penguin8Lord",
            "id": "hs7h058",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1641909881.0,
            "replies": [
                {
                    "body": "Total luck, I’m guessing. I’ve been told numerous times that my results are abnormal (mostly the speed of response to the drugs). But I’m holding out hope that I’m just a good responder and the results will stick",
                    "author": "zacboring",
                    "id": "hs8kh8u",
                    "parent_id": "t1_hs7h058",
                    "score": 1,
                    "created_utc": 1641924972.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow, have you had any sideeffects?",
            "author": "Miguel_the_honest",
            "id": "hs9ou7g",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1641939777.0,
            "replies": [
                {
                    "body": "Nothing alarming, but I did have a few in the early months. Brief heart flutters, dandruff, and “watery” sperm. I’d also get nauseous if I took Finasteride without eating first. But none of those side effects lasted longer than a month. Currently not experiencing any",
                    "author": "zacboring",
                    "id": "hscxq36",
                    "parent_id": "t1_hs9ou7g",
                    "score": 1,
                    "created_utc": 1642001912.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hsa276j",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1641945140.0,
            "replies": [
                {
                    "body": "Nothing alarming, but I did have a few in the early months. Brief heart flutters, dandruff, and “watery” sperm. I’d also get nauseous if I took Finasteride without eating first. But none of those side effects lasted longer than a month. Currently not experiencing any",
                    "author": "zacboring",
                    "id": "hscxnfh",
                    "parent_id": "t1_hsa276j",
                    "score": 1,
                    "created_utc": 1642001882.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "any sideeffects from fina?",
            "author": "GerritTheBerrit",
            "id": "hsllqsb",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1642143859.0,
            "replies": []
        },
        {
            "body": "Does anyone else here experience frequent loss of train of thought in period of taking finasteride because it was happening for me and it really bothered me thats why i stopped and my hair receded even more since then",
            "author": "Defiler786",
            "id": "hu1zhh5",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1643051003.0,
            "replies": []
        },
        {
            "body": "Great results. \n\nCould you let me know how you applied the minoxidil for the best results?",
            "author": "Admirable-Ad5397",
            "id": "hvuxtsw",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1644181542.0,
            "replies": [
                {
                    "body": "Thanks!\n\nAll I do is put it on my head twice per day (morning and night). I get the eye dropper close to the scalp, pour it on, then I try to rotate my head around to let it flow over the scalp (you want as much on your skin as possible, rather than soaking it all into your hair). Then I just rub it in with my fingers until it feels evenly wet. And about once or twice a month I will derma roll my scalp after a shower before I put the Minoxidil on.",
                    "author": "zacboring",
                    "id": "hvw4wji",
                    "parent_id": "t1_hvuxtsw",
                    "score": 1,
                    "created_utc": 1644200357.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "very impressive results , keep in mind that you're very lucky , the response from finasterid is not same as you for anyone , 86% will stabilize their hairloss but only 16% can regrow and have a good results , you can try some PRP injections for the crown area that will help or maybe an smp. but yeah i see that your hair before starting the treatment was in really bad shape so it came back to life .",
            "author": "Odd_Challenge7239",
            "id": "i2k8lxk",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1648560721.0,
            "replies": []
        },
        {
            "body": "\"Sup choomes\"",
            "author": "SuccotashClassic6713",
            "id": "i920mr8",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1652868093.0,
            "replies": []
        },
        {
            "body": "amazing progress man, congrats and thanks for the motivation, whats the dosage of fin you're taking ?",
            "author": "Sufficient_Baker_623",
            "id": "icudzzu",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1655567897.0,
            "replies": [
                {
                    "body": "Thank you! I’m just taking the regular 1mg pill",
                    "author": "zacboring",
                    "id": "id4pnph",
                    "parent_id": "t1_icudzzu",
                    "score": 1,
                    "created_utc": 1655775138.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Did u use oral MINOXIDIL or topical MINOXIDIL??",
            "author": "abbzy07",
            "id": "ifn91rj",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1657489211.0,
            "replies": [
                {
                    "body": "Topical",
                    "author": "zacboring",
                    "id": "igqbozq",
                    "parent_id": "t1_ifn91rj",
                    "score": 1,
                    "created_utc": 1658200172.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hey there! I just started finasteride 1mg a day and was thinking about getting minoxidil as well, how often do you apply minoxidil?",
            "author": "Shirtless_Spider-Man",
            "id": "ih729jp",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1658501465.0,
            "replies": [
                {
                    "body": "Twice per day! When I wake up, and right before I go to bed",
                    "author": "zacboring",
                    "id": "ihf1neq",
                    "parent_id": "t1_ih729jp",
                    "score": 1,
                    "created_utc": 1658642737.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nice reuslts.",
            "author": "RoAccutaneBald88",
            "id": "imsknax",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1662124835.0,
            "replies": []
        },
        {
            "body": "Hey man I was wondering if you could show us a photo that focuses more on your temples like the before picture ? So it seems like you regained some what was missing from your temples back right ?",
            "author": "Parad0xxxx",
            "id": "iph9zzc",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1663860552.0,
            "replies": []
        },
        {
            "body": "Do you have to take it for the rest of your life? Any side effects?",
            "author": "Budget-Pie-2446",
            "id": "iuid8fc",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1667230975.0,
            "replies": []
        },
        {
            "body": "Hey man, been awhile. How you holding up? Results still looking good or have they regressed a bit?",
            "author": "GreasyMustardTiger_",
            "id": "j2gvxix",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1672548247.0,
            "replies": [
                {
                    "body": "My hair situation has gotten worse actually, but it’s my fault. Got a bit depressed recently and got pretty lazy with taking care of myself. I basically quit taking any medicine for about 2 months at one point, so my hair started falling out pretty bad again. Been back on it faithfully for over a month now, so hoping I didn’t do any permanent damage and will see some of that loss coming back in a month or two…",
                    "author": "zacboring",
                    "id": "j2kqlnx",
                    "parent_id": "t1_j2gvxix",
                    "score": 1,
                    "created_utc": 1672622913.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j5zhmhs",
                            "parent_id": "t1_j2kqlnx",
                            "score": 1,
                            "created_utc": 1674753848.0,
                            "replies": [
                                {
                                    "body": "1. Can’t remember the Minoxidil dosage, but I use that twice a day. I’m on 1mg of Finasteride, and I was told to only take that once per day. I have no insight into the combo solutions unfortunately. \n\n2. I derma roll maybe twice a month. Usually after a shower, right before I apply my nightly dosage of Minoxidil. \n\n3. I’m sorry, not entirely sure what you mean\n\n4. It could help, but my temples are still pretty thin. I usually only apply Minoxidil to my scalp though, so maybe if I used it on my temples I’d grow more. I’ve always had pretty thin hair around that area anyway though",
                                    "author": "zacboring",
                                    "id": "j64tmdi",
                                    "parent_id": "t1_j5zhmhs",
                                    "score": 1,
                                    "created_utc": 1674845030.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "2 year update?",
            "author": "One_Operation_6863",
            "id": "j2pbe0i",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1672705879.0,
            "replies": []
        },
        {
            "body": "can I have an update on how this is going?",
            "author": "DawsonHendrix",
            "id": "j7ftpgk",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1675693323.0,
            "replies": []
        },
        {
            "body": "So impressive!",
            "author": "getayd",
            "id": "j8ckuba",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1676276361.0,
            "replies": []
        },
        {
            "body": "All the guys listen up! Do you want this to happen to you, have results like this? I know the 100% tested recipe. Anyone who's trying to find solutions, just comment here, and I will tell you exactly what to do to get results like this and even better!\n\n&#x200B;\n\nZackborg congratz, if you want even better results just write me here, I know how is done\n\nP.S yes there is minoxidil and fin/dutasteride included in my ultimate recipe, but the industry keeps from letting you know that there is something else, some very ancient secret ingridients,  because they make money of the products you are using :D haha , ok guys just comment if you want my help.",
            "author": "External-Conflict-47",
            "id": "j93g6tc",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1676762141.0,
            "replies": [
                {
                    "body": "oh extanal-conflict-47, please enlighten me with your ancient secret wisdom so I can become sexy boy with all the chicky chicks again, please!!",
                    "author": "barkie3000",
                    "id": "jd3cn2c",
                    "parent_id": "t1_j93g6tc",
                    "score": 1,
                    "created_utc": 1679412332.0,
                    "replies": [
                        {
                            "body": "Hi. sure. how old are you tho?",
                            "author": "External-Conflict-47",
                            "id": "jdifl5y",
                            "parent_id": "t1_jd3cn2c",
                            "score": 1,
                            "created_utc": 1679676637.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'd tried using finasteride topically before, but it hadn't worked.\n\n  \nEven though it did, it stopped working after three months.\n\n  \nProvillus was recommended to me by a friend, and I found it to be 100 percent effective. It made my hair look younger and thicker.",
            "author": "thegiftedcolleague46",
            "id": "jdzwdx8",
            "parent_id": "t3_s126fs",
            "score": 1,
            "created_utc": 1680006984.0,
            "replies": []
        },
        {
            "body": "I was not aware of that! Thanks for the insight, I sure hope you’re right!",
            "author": "zacboring",
            "id": "hs611gc",
            "parent_id": "t1_hs5t1o5",
            "score": 32,
            "created_utc": 1641876161.0,
            "replies": [
                {
                    "body": "What was your age when you started this? Thanx",
                    "author": "Man_of_desert",
                    "id": "ilpn0nx",
                    "parent_id": "t1_hs611gc",
                    "score": 2,
                    "created_utc": 1661419759.0,
                    "replies": [
                        {
                            "body": "24",
                            "author": "zacboring",
                            "id": "imazmbe",
                            "parent_id": "t1_ilpn0nx",
                            "score": 3,
                            "created_utc": 1661807115.0,
                            "replies": [
                                {
                                    "body": "Thanx man. Did finasteride tablets cause any side effects?",
                                    "author": "Man_of_desert",
                                    "id": "imc90eb",
                                    "parent_id": "t1_imazmbe",
                                    "score": 2,
                                    "created_utc": 1661827896.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "😂",
            "author": "zacboring",
            "id": "hs61fi5",
            "parent_id": "t1_hs60lbh",
            "score": 18,
            "created_utc": 1641876346.0,
            "replies": []
        },
        {
            "body": "yoo hahahaha",
            "author": "asdfcrow",
            "id": "hs6comi",
            "parent_id": "t1_hs60lbh",
            "score": 4,
            "created_utc": 1641882406.0,
            "replies": []
        },
        {
            "body": "Dude your before pic is worse than me right now, and your after pick is better than my hair was when I was 20.\n\nNot sure how anyone would be disappointed by your results.\n\nI’m just disappointed fin didn’t do shit for me. Meanwhile you got most of your hair back.",
            "author": "Xaxxus",
            "id": "hs6r0cz",
            "parent_id": "t1_hs5l2ry",
            "score": 29,
            "created_utc": 1641892966.0,
            "replies": [
                {
                    "body": "I guess I was just feeling a lot of pressure for my results to be “perfect”. I’ve had a lot of people on Reddit following my progress this year and I was worried they’d be discouraged about seeing it not fully fix the problem. I didn’t want to let anyone down. I, myself, am very happy with the results",
                    "author": "zacboring",
                    "id": "hs8lh55",
                    "parent_id": "t1_hs6r0cz",
                    "score": 5,
                    "created_utc": 1641925331.0,
                    "replies": []
                },
                {
                    "body": "Finestaride did not help you? why?",
                    "author": "Will_Cheung1979",
                    "id": "iccgwln",
                    "parent_id": "t1_hs6r0cz",
                    "score": 1,
                    "created_utc": 1655224189.0,
                    "replies": [
                        {
                            "body": "Didn’t get any results after 8 months of taking it. Not much else to elaborate on.",
                            "author": "Xaxxus",
                            "id": "icch76u",
                            "parent_id": "t1_iccgwln",
                            "score": 2,
                            "created_utc": 1655224309.0,
                            "replies": [
                                {
                                    "body": "Did you find any other solution? I did a expensive hair transplant that didnt work. The clinic are clueless. I am afraid we are the 1% that are not responsible for any treatment..",
                                    "author": "Will_Cheung1979",
                                    "id": "iccsh3p",
                                    "parent_id": "t1_icch76u",
                                    "score": 1,
                                    "created_utc": 1655228865.0,
                                    "replies": [
                                        {
                                            "body": "Nope. I just shaved my head and went bald.",
                                            "author": "Xaxxus",
                                            "id": "icd15oq",
                                            "parent_id": "t1_iccsh3p",
                                            "score": 1,
                                            "created_utc": 1655232439.0,
                                            "replies": [
                                                {
                                                    "body": "Hm, did you get any side effects? Did you take everyday or every third day? 1 mg.",
                                                    "author": "Will_Cheung1979",
                                                    "id": "icl6qby",
                                                    "parent_id": "t1_icd15oq",
                                                    "score": 1,
                                                    "created_utc": 1655391112.0,
                                                    "replies": [
                                                        {
                                                            "body": "Took it daily.\n\nI occasionally had mild pain in my balls. But I don’t know if that was related.\n\nOther than that no side effects.",
                                                            "author": "Xaxxus",
                                                            "id": "icn0f7x",
                                                            "parent_id": "t1_icl6qby",
                                                            "score": 1,
                                                            "created_utc": 1655419143.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Ok, thanks",
                                                                    "author": "Will_Cheung1979",
                                                                    "id": "id3asb8",
                                                                    "parent_id": "t1_icn0f7x",
                                                                    "score": 1,
                                                                    "created_utc": 1655751552.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Foam or liquid minox? Which shampoos?",
            "author": "Nochestbrahh",
            "id": "hs6k9un",
            "parent_id": "t1_hs5l2ry",
            "score": 3,
            "created_utc": 1641887637.0,
            "replies": [
                {
                    "body": "Liquid. 1-2x per day. I hardly ever use shampoo (maybe once per month), but when I would I’d just use whatever my mom had sitting around",
                    "author": "zacboring",
                    "id": "hs8lr10",
                    "parent_id": "t1_hs6k9un",
                    "score": 4,
                    "created_utc": 1641925428.0,
                    "replies": [
                        {
                            "body": "Hey man. How many times a day do u put fin/min on your scalp and is it a daily thing? Do you shampoo it off everyday too? And do u take any additional pills? thanks",
                            "author": "Avowed_Precursor",
                            "id": "hstz4kr",
                            "parent_id": "t1_hs8lr10",
                            "score": 2,
                            "created_utc": 1642290537.0,
                            "replies": [
                                {
                                    "body": "I take a Finasteride pill once per day, and try to put Minoxidil on my scalp twice per day. I hardly ever use shampoo, so I don’t wash it off that often. I also take vitamin D, and sometimes biotin",
                                    "author": "zacboring",
                                    "id": "hsuw8it",
                                    "parent_id": "t1_hstz4kr",
                                    "score": 1,
                                    "created_utc": 1642304790.0,
                                    "replies": [
                                        {
                                            "body": "How much are the pills and do u have to go to a doctor to get them? Same question for the minoxidil. Thanks",
                                            "author": "Chalkywhite007",
                                            "id": "htzdfp3",
                                            "parent_id": "t1_hsuw8it",
                                            "score": 1,
                                            "created_utc": 1643000440.0,
                                            "replies": [
                                                {
                                                    "body": "Finasteride requires a prescription, and I pay about $40 for a 3-month supply at my local pharmacy. Minoxidil is available off-the-shelf and I pay around $20 for a 3-month supply of that",
                                                    "author": "zacboring",
                                                    "id": "hu2ie79",
                                                    "parent_id": "t1_htzdfp3",
                                                    "score": 1,
                                                    "created_utc": 1643058194.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "When you roll a derma roller and then apply the minoxidil, does it not hurt? since its alcohol?",
                            "author": "Will_Cheung1979",
                            "id": "icch0gg",
                            "parent_id": "t1_hs8lr10",
                            "score": 1,
                            "created_utc": 1655224232.0,
                            "replies": [
                                {
                                    "body": "Sometimes it feels a little “warm” on the scalp after derma rolling, but not too bad. It stung the first time I ever tried it, but now I barely notice it.",
                                    "author": "zacboring",
                                    "id": "icd3ihb",
                                    "parent_id": "t1_icch0gg",
                                    "score": 1,
                                    "created_utc": 1655233416.0,
                                    "replies": [
                                        {
                                            "body": "Ok, that length was your dermaroller?",
                                            "author": "Will_Cheung1979",
                                            "id": "icl75o9",
                                            "parent_id": "t1_icd3ihb",
                                            "score": 1,
                                            "created_utc": 1655391296.0,
                                            "replies": [
                                                {
                                                    "body": ".05mm, I think? It’s been a while since I’ve bought it\n\nCORRECTION: I found the sticker. It’s 0.5mm",
                                                    "author": "zacboring",
                                                    "id": "icli83f",
                                                    "parent_id": "t1_icl75o9",
                                                    "score": 1,
                                                    "created_utc": 1655396001.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ok, thanks. I see you were pretty bald before. Was your hair just sleeping and the Finestaride woke them up? How long can hairs be sleeping before its too late?",
                                                            "author": "Will_Cheung1979",
                                                            "id": "id3api0",
                                                            "parent_id": "t1_icli83f",
                                                            "score": 1,
                                                            "created_utc": 1655751519.0,
                                                            "replies": [
                                                                {
                                                                    "body": "This is where my knowledge runs out. I have zero clue how any of this actually works",
                                                                    "author": "zacboring",
                                                                    "id": "id4pu6e",
                                                                    "parent_id": "t1_id3api0",
                                                                    "score": 1,
                                                                    "created_utc": 1655775227.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "just for your information , hair tranplant is not a miracle and in your case it won't fixe all the problems since you have a large balding area so u need a considerable amount of grafts +  you will still have the treatement after hair transplant . the treatement showed that you are an excellent candidate for medical treatement so stick to that , in 4 5 years finasterid will have less effect , so then you can have a hair tranplant to help.",
            "author": "Odd_Challenge7239",
            "id": "i2k9rq5",
            "parent_id": "t1_hs5l2ry",
            "score": 1,
            "created_utc": 1648561237.0,
            "replies": []
        },
        {
            "body": "Never heard that one before 😂",
            "author": "zacboring",
            "id": "hs8jzmv",
            "parent_id": "t1_hs7n4zh",
            "score": 3,
            "created_utc": 1641924793.0,
            "replies": []
        },
        {
            "body": "While fin can regrow hair for some men, it’s not even really advertised to do so as it’s main function is preventing loss. It is rare for fin to regrow a significant amount of hair",
            "author": "talkingspacecoyote",
            "id": "hs7h0ke",
            "parent_id": "t1_hs6epy2",
            "score": 8,
            "created_utc": 1641909886.0,
            "replies": [
                {
                    "body": "Agreed. Fin is good for keeping what you got. Minoxidil helps regrowth. The two together were absolutely necessary in my case",
                    "author": "zacboring",
                    "id": "hs8lzle",
                    "parent_id": "t1_hs7h0ke",
                    "score": 4,
                    "created_utc": 1641925513.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My bf has a cat, I'm a dog person. His cat doesn't climb all over us though. She rarely sleeps in the bed with us. She's just not interested in attention too often. So maybe because she is this way she doesn't run the risk of ever consuming my minoxidil. I think even if my bf used minoxidil she wouldn't bother him too often while putting it on. Men also happen to be less careful when applying things to their hair than women. I wouldn't drop any on the floor, but my bf would for sure.",
            "author": "NASTYHEARTBREAKER",
            "id": "hsa7d2d",
            "parent_id": "t1_hs6epy2",
            "score": 3,
            "created_utc": 1641947323.0,
            "replies": []
        },
        {
            "body": "Still feels too good to be true. I’m trying not to get in my head about it, haha",
            "author": "zacboring",
            "id": "hs8m62z",
            "parent_id": "t1_hs6tkuu",
            "score": 2,
            "created_utc": 1641925577.0,
            "replies": [
                {
                    "body": "Congrats man\nWhat brand of finasteride are you using, I mean which generic\nAlso do you think brand matters because merck propecia is expensive af\nAgain\nCongrats about your hair :)",
                    "author": "Vegetable_Sorbet6219",
                    "id": "htau0qu",
                    "parent_id": "t1_hs8m62z",
                    "score": 2,
                    "created_utc": 1642586891.0,
                    "replies": [
                        {
                            "body": "Thank you! And the pills I take are so generic they’re literally just called “Finasteride”, the bottle has no other name on the label other than the pharmacy itself. So I don’t think the brand really matters as long as it’s the 1mg pill. I went as cheap as possible (Propecia is most popular but it’s super expensive). I’m paying about $40 for a 3-month supply",
                            "author": "zacboring",
                            "id": "htbw7we",
                            "parent_id": "t1_htau0qu",
                            "score": 1,
                            "created_utc": 1642607373.0,
                            "replies": [
                                {
                                    "body": "You're right. I worked at a pharmacy for a while and learnt a trick. Always buy the generic brand because it's exactly the same as the branded version. Just cheaper. You're literally paying for the brand when you choose expensive medicine",
                                    "author": "AlexanderNova",
                                    "id": "ifbuxld",
                                    "parent_id": "t1_htbw7we",
                                    "score": 2,
                                    "created_utc": 1657278096.0,
                                    "replies": []
                                },
                                {
                                    "body": "hey, impressive results btw, do you need a prescription every time you buy finasteride? or just went to the dermatologist once and always bought with no problem since then?",
                                    "author": "royal_watermelon",
                                    "id": "ibnerz0",
                                    "parent_id": "t1_htbw7we",
                                    "score": 1,
                                    "created_utc": 1654719216.0,
                                    "replies": [
                                        {
                                            "body": "Very good question. Typically when I’ve been written a prescription that script specifies the number of pills and how many refills. My first prescription I was written was for a 9-month supply. So I was given 3 refills with 90 pills in each bottle (3 month supply per bottle). Once that prescription runs out you’ll need to have your doctor write a new one. Since then it’s been a bit more random for me. I’ve been written one month supplies, and three month supplies. Not sure why it’s all over the place, but I’m just happy to get it. Haha",
                                            "author": "zacboring",
                                            "id": "ibrm8iw",
                                            "parent_id": "t1_ibnerz0",
                                            "score": 2,
                                            "created_utc": 1654802314.0,
                                            "replies": [
                                                {
                                                    "body": "ohh ok thank you!! is that prescribed by your regular doctor or a dermatologist? I'm going go the dermatologist in 2 weeks and im paying a full appointment so that he would give me the prescription, but I don't want to pay for more appointments everytime i need a refill 😭😭",
                                                    "author": "royal_watermelon",
                                                    "id": "icejagy",
                                                    "parent_id": "t1_ibrm8iw",
                                                    "score": 1,
                                                    "created_utc": 1655257277.0,
                                                    "replies": [
                                                        {
                                                            "body": "Your dermatologist will write you one if they agree that you could benefit from it! I ended up getting mine through a consultation via an app (covid times). Maybe you could talk to them about the renewal process (or go with a company like “Hims” or “Keeps” where they send you what you need every month)",
                                                            "author": "zacboring",
                                                            "id": "ichicjm",
                                                            "parent_id": "t1_icejagy",
                                                            "score": 2,
                                                            "created_utc": 1655317827.0,
                                                            "replies": [
                                                                {
                                                                    "body": "sorry, what are those companies really?",
                                                                    "author": "royal_watermelon",
                                                                    "id": "icj4ljh",
                                                                    "parent_id": "t1_ichicjm",
                                                                    "score": 1,
                                                                    "created_utc": 1655343759.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "They just sell kits with hair stuff in them like Finasteride and Minoxidil along with shampoos or whatever. I’ve never tried them, but people seem to like the convenience of it",
                                                                            "author": "zacboring",
                                                                            "id": "icli4kf",
                                                                            "parent_id": "t1_icj4ljh",
                                                                            "score": 2,
                                                                            "created_utc": 1655395961.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "so that would work like topical finasteride right? but oral must be more efficient",
                                                                                    "author": "royal_watermelon",
                                                                                    "id": "icll2yy",
                                                                                    "parent_id": "t1_icli4kf",
                                                                                    "score": 1,
                                                                                    "created_utc": 1655397172.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "No idea. Haven’t tried any of those options",
                                                                                            "author": "zacboring",
                                                                                            "id": "icm12ef",
                                                                                            "parent_id": "t1_icll2yy",
                                                                                            "score": 2,
                                                                                            "created_utc": 1655403727.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you! It feels great, man. Still a bit insecure about the crown area, but I just try to remind myself that it was once MUCH worse and I should calm down. Over all I’m very pleased with the results and it has made a positive impact on my life",
            "author": "zacboring",
            "id": "hs8jroj",
            "parent_id": "t1_hs7rwk8",
            "score": 3,
            "created_utc": 1641924712.0,
            "replies": [
                {
                    "body": "You're welcome. That's awesome to hear. Keep up the positive attitude!",
                    "author": "obsessivesquirrel",
                    "id": "hs8ye3w",
                    "parent_id": "t1_hs8jroj",
                    "score": 2,
                    "created_utc": 1641930054.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks! I’m terrible at math, so I gave up on keeping track of the days at one point",
            "author": "zacboring",
            "id": "hs8j7d1",
            "parent_id": "t1_hs8dbxp",
            "score": 1,
            "created_utc": 1641924505.0,
            "replies": []
        },
        {
            "body": "25",
            "author": "zacboring",
            "id": "hs8kvqi",
            "parent_id": "t1_hs6sn64",
            "score": 4,
            "created_utc": 1641925115.0,
            "replies": []
        },
        {
            "body": "Since I’m only 25, I’m very happy to hear that. Haha",
            "author": "zacboring",
            "id": "hs8kp6y",
            "parent_id": "t1_hs7ebq3",
            "score": 2,
            "created_utc": 1641925051.0,
            "replies": [
                {
                    "body": "I'm sure the angle wasn't helping but in the first pic it even looked like the hair was whitish, Happy for you, you look so much better now",
                    "author": "ivan_dhs",
                    "id": "hs8lffe",
                    "parent_id": "t1_hs8kp6y",
                    "score": 3,
                    "created_utc": 1641925314.0,
                    "replies": [
                        {
                            "body": "Thank you! I think the first picture was closer to the light source in the bathroom. Thin hair + bright light does look very whitish",
                            "author": "zacboring",
                            "id": "hs8mgio",
                            "parent_id": "t1_hs8lffe",
                            "score": 1,
                            "created_utc": 1641925682.0,
                            "replies": [
                                {
                                    "body": "Hey bro at what length were you dermarolling? and frequency?",
                                    "author": "SuccotashClassic6713",
                                    "id": "i921570",
                                    "parent_id": "t1_hs8mgio",
                                    "score": 1,
                                    "created_utc": 1652868537.0,
                                    "replies": [
                                        {
                                            "body": "I believe .05mm? Can’t remember for sure. But I do it once or twice a month",
                                            "author": "zacboring",
                                            "id": "i94jnkk",
                                            "parent_id": "t1_i921570",
                                            "score": 1,
                                            "created_utc": 1652909992.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Best of luck! Just keep at it",
            "author": "zacboring",
            "id": "hs8jv72",
            "parent_id": "t1_hs7ofwy",
            "score": 1,
            "created_utc": 1641924748.0,
            "replies": []
        },
        {
            "body": "That’s good to hear! I’m only 25, so you’re already doing better than me if you’ve made it to 26 without losing it, haha. Preventative measures now will definitely pay off down the line. Good luck!",
            "author": "zacboring",
            "id": "hscz8tu",
            "parent_id": "t1_hs8qbdg",
            "score": 2,
            "created_utc": 1642002508.0,
            "replies": []
        },
        {
            "body": "Thank you!\n\n1. I just use the generic Equate brand from Walmart. It’s much cheaper than Rogain \n\n2. I mostly don’t because shampoo seems to dry my hair out REALLY bad. So I only do it about once a month to clean any buildup of product or dirt to allow the Minoxidil to keep working. I do use conditioner more often though",
            "author": "zacboring",
            "id": "hscydqu",
            "parent_id": "t1_hs9lxbh",
            "score": 2,
            "created_utc": 1642002168.0,
            "replies": [
                {
                    "body": "Thank for explaining that man. I shampoo everyday and have my doubts about that. \n\n1. How often do you use conditioner?\n2. Any particular brand you feel that helps?",
                    "author": null,
                    "id": "hsfu5hf",
                    "parent_id": "t1_hscydqu",
                    "score": 2,
                    "created_utc": 1642043637.0,
                    "replies": [
                        {
                            "body": "Still searching for the right kind, honestly. Lately I’ve been trying the Paul Mitchell conditioner and so far I’m liking it. But it’s too soon to tell if it’s actually repairing anything",
                            "author": "zacboring",
                            "id": "hsfw03q",
                            "parent_id": "t1_hsfu5hf",
                            "score": 1,
                            "created_utc": 1642044493.0,
                            "replies": [
                                {
                                    "body": "Cool. How often do you use it? Is it like a daily thing?",
                                    "author": null,
                                    "id": "hsg3e2m",
                                    "parent_id": "t1_hsfw03q",
                                    "score": 1,
                                    "created_utc": 1642048028.0,
                                    "replies": [
                                        {
                                            "body": "No, maybe twice a week. I don’t wash my hair every time I shower",
                                            "author": "zacboring",
                                            "id": "hshx55e",
                                            "parent_id": "t1_hsg3e2m",
                                            "score": 1,
                                            "created_utc": 1642088320.0,
                                            "replies": [
                                                {
                                                    "body": "Got it thanks man!",
                                                    "author": null,
                                                    "id": "hsj92s4",
                                                    "parent_id": "t1_hshx55e",
                                                    "score": 2,
                                                    "created_utc": 1642106114.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Welcome back to my big ol’ forehead!",
            "author": "zacboring",
            "id": "hsdl0r5",
            "parent_id": "t1_hsd7bxs",
            "score": 1,
            "created_utc": 1642010693.0,
            "replies": []
        },
        {
            "body": "Hmmm. Haven’t noticed anything myself, but I’ve always had darker under-eyes from having a poor sleep schedule. And my skin isn’t really any different from before (as far as I can tell). But thanks for the heads-up! I’ll keep an eye on that",
            "author": "zacboring",
            "id": "hsewtrw",
            "parent_id": "t1_hsdlobs",
            "score": 1,
            "created_utc": 1642028711.0,
            "replies": [
                {
                    "body": "Try to fix your sleep schedule it will change your life! (I'm saying this as my sleep is also severely disregulated)\n\nDo everything you can. If want to improve your sleep look into magnesium it will help. And of course avoid screens at night for several hours... This is what's causing the issues for me, along with not working out. Working out daily (but avoid late afternoon and evening) + magnesium + good light environment + no screens at night = great sleep",
                    "author": "According_Nature_495",
                    "id": "hsexirw",
                    "parent_id": "t1_hsewtrw",
                    "score": 2,
                    "created_utc": 1642028993.0,
                    "replies": [
                        {
                            "body": "The “no screens before bed” is probably my biggest issue. I’m a sucker for some late-night TV and Instagram scrolling. But thank you for the tip!",
                            "author": "zacboring",
                            "id": "hsfvqyw",
                            "parent_id": "t1_hsexirw",
                            "score": 1,
                            "created_utc": 1642044373.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Whatever works for you, man!",
            "author": "zacboring",
            "id": "htm7s8y",
            "parent_id": "t1_hthmna3",
            "score": 1,
            "created_utc": 1642783094.0,
            "replies": []
        },
        {
            "body": "😂",
            "author": "zacboring",
            "id": "i0gxcb8",
            "parent_id": "t1_i09x0e8",
            "score": 1,
            "created_utc": 1647158420.0,
            "replies": []
        },
        {
            "body": "Thanks! I’m 26",
            "author": "zacboring",
            "id": "imazt7m",
            "parent_id": "t1_ilyuy7w",
            "score": 1,
            "created_utc": 1661807200.0,
            "replies": []
        },
        {
            "body": "Total luck, I’m guessing. I’ve been told numerous times that my results are abnormal (mostly the speed of response to the drugs). But I’m holding out hope that I’m just a good responder and the results will stick",
            "author": "zacboring",
            "id": "hs8kh8u",
            "parent_id": "t1_hs7h058",
            "score": 1,
            "created_utc": 1641924972.0,
            "replies": []
        },
        {
            "body": "Nothing alarming, but I did have a few in the early months. Brief heart flutters, dandruff, and “watery” sperm. I’d also get nauseous if I took Finasteride without eating first. But none of those side effects lasted longer than a month. Currently not experiencing any",
            "author": "zacboring",
            "id": "hscxq36",
            "parent_id": "t1_hs9ou7g",
            "score": 1,
            "created_utc": 1642001912.0,
            "replies": []
        },
        {
            "body": "Nothing alarming, but I did have a few in the early months. Brief heart flutters, dandruff, and “watery” sperm. I’d also get nauseous if I took Finasteride without eating first. But none of those side effects lasted longer than a month. Currently not experiencing any",
            "author": "zacboring",
            "id": "hscxnfh",
            "parent_id": "t1_hsa276j",
            "score": 1,
            "created_utc": 1642001882.0,
            "replies": []
        },
        {
            "body": "Thanks!\n\nAll I do is put it on my head twice per day (morning and night). I get the eye dropper close to the scalp, pour it on, then I try to rotate my head around to let it flow over the scalp (you want as much on your skin as possible, rather than soaking it all into your hair). Then I just rub it in with my fingers until it feels evenly wet. And about once or twice a month I will derma roll my scalp after a shower before I put the Minoxidil on.",
            "author": "zacboring",
            "id": "hvw4wji",
            "parent_id": "t1_hvuxtsw",
            "score": 1,
            "created_utc": 1644200357.0,
            "replies": []
        },
        {
            "body": "Thank you! I’m just taking the regular 1mg pill",
            "author": "zacboring",
            "id": "id4pnph",
            "parent_id": "t1_icudzzu",
            "score": 1,
            "created_utc": 1655775138.0,
            "replies": []
        },
        {
            "body": "Topical",
            "author": "zacboring",
            "id": "igqbozq",
            "parent_id": "t1_ifn91rj",
            "score": 1,
            "created_utc": 1658200172.0,
            "replies": []
        },
        {
            "body": "Twice per day! When I wake up, and right before I go to bed",
            "author": "zacboring",
            "id": "ihf1neq",
            "parent_id": "t1_ih729jp",
            "score": 1,
            "created_utc": 1658642737.0,
            "replies": []
        },
        {
            "body": "My hair situation has gotten worse actually, but it’s my fault. Got a bit depressed recently and got pretty lazy with taking care of myself. I basically quit taking any medicine for about 2 months at one point, so my hair started falling out pretty bad again. Been back on it faithfully for over a month now, so hoping I didn’t do any permanent damage and will see some of that loss coming back in a month or two…",
            "author": "zacboring",
            "id": "j2kqlnx",
            "parent_id": "t1_j2gvxix",
            "score": 1,
            "created_utc": 1672622913.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j5zhmhs",
                    "parent_id": "t1_j2kqlnx",
                    "score": 1,
                    "created_utc": 1674753848.0,
                    "replies": [
                        {
                            "body": "1. Can’t remember the Minoxidil dosage, but I use that twice a day. I’m on 1mg of Finasteride, and I was told to only take that once per day. I have no insight into the combo solutions unfortunately. \n\n2. I derma roll maybe twice a month. Usually after a shower, right before I apply my nightly dosage of Minoxidil. \n\n3. I’m sorry, not entirely sure what you mean\n\n4. It could help, but my temples are still pretty thin. I usually only apply Minoxidil to my scalp though, so maybe if I used it on my temples I’d grow more. I’ve always had pretty thin hair around that area anyway though",
                            "author": "zacboring",
                            "id": "j64tmdi",
                            "parent_id": "t1_j5zhmhs",
                            "score": 1,
                            "created_utc": 1674845030.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "oh extanal-conflict-47, please enlighten me with your ancient secret wisdom so I can become sexy boy with all the chicky chicks again, please!!",
            "author": "barkie3000",
            "id": "jd3cn2c",
            "parent_id": "t1_j93g6tc",
            "score": 1,
            "created_utc": 1679412332.0,
            "replies": [
                {
                    "body": "Hi. sure. how old are you tho?",
                    "author": "External-Conflict-47",
                    "id": "jdifl5y",
                    "parent_id": "t1_jd3cn2c",
                    "score": 1,
                    "created_utc": 1679676637.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What was your age when you started this? Thanx",
            "author": "Man_of_desert",
            "id": "ilpn0nx",
            "parent_id": "t1_hs611gc",
            "score": 2,
            "created_utc": 1661419759.0,
            "replies": [
                {
                    "body": "24",
                    "author": "zacboring",
                    "id": "imazmbe",
                    "parent_id": "t1_ilpn0nx",
                    "score": 3,
                    "created_utc": 1661807115.0,
                    "replies": [
                        {
                            "body": "Thanx man. Did finasteride tablets cause any side effects?",
                            "author": "Man_of_desert",
                            "id": "imc90eb",
                            "parent_id": "t1_imazmbe",
                            "score": 2,
                            "created_utc": 1661827896.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I guess I was just feeling a lot of pressure for my results to be “perfect”. I’ve had a lot of people on Reddit following my progress this year and I was worried they’d be discouraged about seeing it not fully fix the problem. I didn’t want to let anyone down. I, myself, am very happy with the results",
            "author": "zacboring",
            "id": "hs8lh55",
            "parent_id": "t1_hs6r0cz",
            "score": 5,
            "created_utc": 1641925331.0,
            "replies": []
        },
        {
            "body": "Finestaride did not help you? why?",
            "author": "Will_Cheung1979",
            "id": "iccgwln",
            "parent_id": "t1_hs6r0cz",
            "score": 1,
            "created_utc": 1655224189.0,
            "replies": [
                {
                    "body": "Didn’t get any results after 8 months of taking it. Not much else to elaborate on.",
                    "author": "Xaxxus",
                    "id": "icch76u",
                    "parent_id": "t1_iccgwln",
                    "score": 2,
                    "created_utc": 1655224309.0,
                    "replies": [
                        {
                            "body": "Did you find any other solution? I did a expensive hair transplant that didnt work. The clinic are clueless. I am afraid we are the 1% that are not responsible for any treatment..",
                            "author": "Will_Cheung1979",
                            "id": "iccsh3p",
                            "parent_id": "t1_icch76u",
                            "score": 1,
                            "created_utc": 1655228865.0,
                            "replies": [
                                {
                                    "body": "Nope. I just shaved my head and went bald.",
                                    "author": "Xaxxus",
                                    "id": "icd15oq",
                                    "parent_id": "t1_iccsh3p",
                                    "score": 1,
                                    "created_utc": 1655232439.0,
                                    "replies": [
                                        {
                                            "body": "Hm, did you get any side effects? Did you take everyday or every third day? 1 mg.",
                                            "author": "Will_Cheung1979",
                                            "id": "icl6qby",
                                            "parent_id": "t1_icd15oq",
                                            "score": 1,
                                            "created_utc": 1655391112.0,
                                            "replies": [
                                                {
                                                    "body": "Took it daily.\n\nI occasionally had mild pain in my balls. But I don’t know if that was related.\n\nOther than that no side effects.",
                                                    "author": "Xaxxus",
                                                    "id": "icn0f7x",
                                                    "parent_id": "t1_icl6qby",
                                                    "score": 1,
                                                    "created_utc": 1655419143.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ok, thanks",
                                                            "author": "Will_Cheung1979",
                                                            "id": "id3asb8",
                                                            "parent_id": "t1_icn0f7x",
                                                            "score": 1,
                                                            "created_utc": 1655751552.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Liquid. 1-2x per day. I hardly ever use shampoo (maybe once per month), but when I would I’d just use whatever my mom had sitting around",
            "author": "zacboring",
            "id": "hs8lr10",
            "parent_id": "t1_hs6k9un",
            "score": 4,
            "created_utc": 1641925428.0,
            "replies": [
                {
                    "body": "Hey man. How many times a day do u put fin/min on your scalp and is it a daily thing? Do you shampoo it off everyday too? And do u take any additional pills? thanks",
                    "author": "Avowed_Precursor",
                    "id": "hstz4kr",
                    "parent_id": "t1_hs8lr10",
                    "score": 2,
                    "created_utc": 1642290537.0,
                    "replies": [
                        {
                            "body": "I take a Finasteride pill once per day, and try to put Minoxidil on my scalp twice per day. I hardly ever use shampoo, so I don’t wash it off that often. I also take vitamin D, and sometimes biotin",
                            "author": "zacboring",
                            "id": "hsuw8it",
                            "parent_id": "t1_hstz4kr",
                            "score": 1,
                            "created_utc": 1642304790.0,
                            "replies": [
                                {
                                    "body": "How much are the pills and do u have to go to a doctor to get them? Same question for the minoxidil. Thanks",
                                    "author": "Chalkywhite007",
                                    "id": "htzdfp3",
                                    "parent_id": "t1_hsuw8it",
                                    "score": 1,
                                    "created_utc": 1643000440.0,
                                    "replies": [
                                        {
                                            "body": "Finasteride requires a prescription, and I pay about $40 for a 3-month supply at my local pharmacy. Minoxidil is available off-the-shelf and I pay around $20 for a 3-month supply of that",
                                            "author": "zacboring",
                                            "id": "hu2ie79",
                                            "parent_id": "t1_htzdfp3",
                                            "score": 1,
                                            "created_utc": 1643058194.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "When you roll a derma roller and then apply the minoxidil, does it not hurt? since its alcohol?",
                    "author": "Will_Cheung1979",
                    "id": "icch0gg",
                    "parent_id": "t1_hs8lr10",
                    "score": 1,
                    "created_utc": 1655224232.0,
                    "replies": [
                        {
                            "body": "Sometimes it feels a little “warm” on the scalp after derma rolling, but not too bad. It stung the first time I ever tried it, but now I barely notice it.",
                            "author": "zacboring",
                            "id": "icd3ihb",
                            "parent_id": "t1_icch0gg",
                            "score": 1,
                            "created_utc": 1655233416.0,
                            "replies": [
                                {
                                    "body": "Ok, that length was your dermaroller?",
                                    "author": "Will_Cheung1979",
                                    "id": "icl75o9",
                                    "parent_id": "t1_icd3ihb",
                                    "score": 1,
                                    "created_utc": 1655391296.0,
                                    "replies": [
                                        {
                                            "body": ".05mm, I think? It’s been a while since I’ve bought it\n\nCORRECTION: I found the sticker. It’s 0.5mm",
                                            "author": "zacboring",
                                            "id": "icli83f",
                                            "parent_id": "t1_icl75o9",
                                            "score": 1,
                                            "created_utc": 1655396001.0,
                                            "replies": [
                                                {
                                                    "body": "Ok, thanks. I see you were pretty bald before. Was your hair just sleeping and the Finestaride woke them up? How long can hairs be sleeping before its too late?",
                                                    "author": "Will_Cheung1979",
                                                    "id": "id3api0",
                                                    "parent_id": "t1_icli83f",
                                                    "score": 1,
                                                    "created_utc": 1655751519.0,
                                                    "replies": [
                                                        {
                                                            "body": "This is where my knowledge runs out. I have zero clue how any of this actually works",
                                                            "author": "zacboring",
                                                            "id": "id4pu6e",
                                                            "parent_id": "t1_id3api0",
                                                            "score": 1,
                                                            "created_utc": 1655775227.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed. Fin is good for keeping what you got. Minoxidil helps regrowth. The two together were absolutely necessary in my case",
            "author": "zacboring",
            "id": "hs8lzle",
            "parent_id": "t1_hs7h0ke",
            "score": 4,
            "created_utc": 1641925513.0,
            "replies": []
        },
        {
            "body": "Congrats man\nWhat brand of finasteride are you using, I mean which generic\nAlso do you think brand matters because merck propecia is expensive af\nAgain\nCongrats about your hair :)",
            "author": "Vegetable_Sorbet6219",
            "id": "htau0qu",
            "parent_id": "t1_hs8m62z",
            "score": 2,
            "created_utc": 1642586891.0,
            "replies": [
                {
                    "body": "Thank you! And the pills I take are so generic they’re literally just called “Finasteride”, the bottle has no other name on the label other than the pharmacy itself. So I don’t think the brand really matters as long as it’s the 1mg pill. I went as cheap as possible (Propecia is most popular but it’s super expensive). I’m paying about $40 for a 3-month supply",
                    "author": "zacboring",
                    "id": "htbw7we",
                    "parent_id": "t1_htau0qu",
                    "score": 1,
                    "created_utc": 1642607373.0,
                    "replies": [
                        {
                            "body": "You're right. I worked at a pharmacy for a while and learnt a trick. Always buy the generic brand because it's exactly the same as the branded version. Just cheaper. You're literally paying for the brand when you choose expensive medicine",
                            "author": "AlexanderNova",
                            "id": "ifbuxld",
                            "parent_id": "t1_htbw7we",
                            "score": 2,
                            "created_utc": 1657278096.0,
                            "replies": []
                        },
                        {
                            "body": "hey, impressive results btw, do you need a prescription every time you buy finasteride? or just went to the dermatologist once and always bought with no problem since then?",
                            "author": "royal_watermelon",
                            "id": "ibnerz0",
                            "parent_id": "t1_htbw7we",
                            "score": 1,
                            "created_utc": 1654719216.0,
                            "replies": [
                                {
                                    "body": "Very good question. Typically when I’ve been written a prescription that script specifies the number of pills and how many refills. My first prescription I was written was for a 9-month supply. So I was given 3 refills with 90 pills in each bottle (3 month supply per bottle). Once that prescription runs out you’ll need to have your doctor write a new one. Since then it’s been a bit more random for me. I’ve been written one month supplies, and three month supplies. Not sure why it’s all over the place, but I’m just happy to get it. Haha",
                                    "author": "zacboring",
                                    "id": "ibrm8iw",
                                    "parent_id": "t1_ibnerz0",
                                    "score": 2,
                                    "created_utc": 1654802314.0,
                                    "replies": [
                                        {
                                            "body": "ohh ok thank you!! is that prescribed by your regular doctor or a dermatologist? I'm going go the dermatologist in 2 weeks and im paying a full appointment so that he would give me the prescription, but I don't want to pay for more appointments everytime i need a refill 😭😭",
                                            "author": "royal_watermelon",
                                            "id": "icejagy",
                                            "parent_id": "t1_ibrm8iw",
                                            "score": 1,
                                            "created_utc": 1655257277.0,
                                            "replies": [
                                                {
                                                    "body": "Your dermatologist will write you one if they agree that you could benefit from it! I ended up getting mine through a consultation via an app (covid times). Maybe you could talk to them about the renewal process (or go with a company like “Hims” or “Keeps” where they send you what you need every month)",
                                                    "author": "zacboring",
                                                    "id": "ichicjm",
                                                    "parent_id": "t1_icejagy",
                                                    "score": 2,
                                                    "created_utc": 1655317827.0,
                                                    "replies": [
                                                        {
                                                            "body": "sorry, what are those companies really?",
                                                            "author": "royal_watermelon",
                                                            "id": "icj4ljh",
                                                            "parent_id": "t1_ichicjm",
                                                            "score": 1,
                                                            "created_utc": 1655343759.0,
                                                            "replies": [
                                                                {
                                                                    "body": "They just sell kits with hair stuff in them like Finasteride and Minoxidil along with shampoos or whatever. I’ve never tried them, but people seem to like the convenience of it",
                                                                    "author": "zacboring",
                                                                    "id": "icli4kf",
                                                                    "parent_id": "t1_icj4ljh",
                                                                    "score": 2,
                                                                    "created_utc": 1655395961.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "so that would work like topical finasteride right? but oral must be more efficient",
                                                                            "author": "royal_watermelon",
                                                                            "id": "icll2yy",
                                                                            "parent_id": "t1_icli4kf",
                                                                            "score": 1,
                                                                            "created_utc": 1655397172.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "No idea. Haven’t tried any of those options",
                                                                                    "author": "zacboring",
                                                                                    "id": "icm12ef",
                                                                                    "parent_id": "t1_icll2yy",
                                                                                    "score": 2,
                                                                                    "created_utc": 1655403727.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You're welcome. That's awesome to hear. Keep up the positive attitude!",
            "author": "obsessivesquirrel",
            "id": "hs8ye3w",
            "parent_id": "t1_hs8jroj",
            "score": 2,
            "created_utc": 1641930054.0,
            "replies": []
        },
        {
            "body": "I'm sure the angle wasn't helping but in the first pic it even looked like the hair was whitish, Happy for you, you look so much better now",
            "author": "ivan_dhs",
            "id": "hs8lffe",
            "parent_id": "t1_hs8kp6y",
            "score": 3,
            "created_utc": 1641925314.0,
            "replies": [
                {
                    "body": "Thank you! I think the first picture was closer to the light source in the bathroom. Thin hair + bright light does look very whitish",
                    "author": "zacboring",
                    "id": "hs8mgio",
                    "parent_id": "t1_hs8lffe",
                    "score": 1,
                    "created_utc": 1641925682.0,
                    "replies": [
                        {
                            "body": "Hey bro at what length were you dermarolling? and frequency?",
                            "author": "SuccotashClassic6713",
                            "id": "i921570",
                            "parent_id": "t1_hs8mgio",
                            "score": 1,
                            "created_utc": 1652868537.0,
                            "replies": [
                                {
                                    "body": "I believe .05mm? Can’t remember for sure. But I do it once or twice a month",
                                    "author": "zacboring",
                                    "id": "i94jnkk",
                                    "parent_id": "t1_i921570",
                                    "score": 1,
                                    "created_utc": 1652909992.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank for explaining that man. I shampoo everyday and have my doubts about that. \n\n1. How often do you use conditioner?\n2. Any particular brand you feel that helps?",
            "author": null,
            "id": "hsfu5hf",
            "parent_id": "t1_hscydqu",
            "score": 2,
            "created_utc": 1642043637.0,
            "replies": [
                {
                    "body": "Still searching for the right kind, honestly. Lately I’ve been trying the Paul Mitchell conditioner and so far I’m liking it. But it’s too soon to tell if it’s actually repairing anything",
                    "author": "zacboring",
                    "id": "hsfw03q",
                    "parent_id": "t1_hsfu5hf",
                    "score": 1,
                    "created_utc": 1642044493.0,
                    "replies": [
                        {
                            "body": "Cool. How often do you use it? Is it like a daily thing?",
                            "author": null,
                            "id": "hsg3e2m",
                            "parent_id": "t1_hsfw03q",
                            "score": 1,
                            "created_utc": 1642048028.0,
                            "replies": [
                                {
                                    "body": "No, maybe twice a week. I don’t wash my hair every time I shower",
                                    "author": "zacboring",
                                    "id": "hshx55e",
                                    "parent_id": "t1_hsg3e2m",
                                    "score": 1,
                                    "created_utc": 1642088320.0,
                                    "replies": [
                                        {
                                            "body": "Got it thanks man!",
                                            "author": null,
                                            "id": "hsj92s4",
                                            "parent_id": "t1_hshx55e",
                                            "score": 2,
                                            "created_utc": 1642106114.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Try to fix your sleep schedule it will change your life! (I'm saying this as my sleep is also severely disregulated)\n\nDo everything you can. If want to improve your sleep look into magnesium it will help. And of course avoid screens at night for several hours... This is what's causing the issues for me, along with not working out. Working out daily (but avoid late afternoon and evening) + magnesium + good light environment + no screens at night = great sleep",
            "author": "According_Nature_495",
            "id": "hsexirw",
            "parent_id": "t1_hsewtrw",
            "score": 2,
            "created_utc": 1642028993.0,
            "replies": [
                {
                    "body": "The “no screens before bed” is probably my biggest issue. I’m a sucker for some late-night TV and Instagram scrolling. But thank you for the tip!",
                    "author": "zacboring",
                    "id": "hsfvqyw",
                    "parent_id": "t1_hsexirw",
                    "score": 1,
                    "created_utc": 1642044373.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j5zhmhs",
            "parent_id": "t1_j2kqlnx",
            "score": 1,
            "created_utc": 1674753848.0,
            "replies": [
                {
                    "body": "1. Can’t remember the Minoxidil dosage, but I use that twice a day. I’m on 1mg of Finasteride, and I was told to only take that once per day. I have no insight into the combo solutions unfortunately. \n\n2. I derma roll maybe twice a month. Usually after a shower, right before I apply my nightly dosage of Minoxidil. \n\n3. I’m sorry, not entirely sure what you mean\n\n4. It could help, but my temples are still pretty thin. I usually only apply Minoxidil to my scalp though, so maybe if I used it on my temples I’d grow more. I’ve always had pretty thin hair around that area anyway though",
                    "author": "zacboring",
                    "id": "j64tmdi",
                    "parent_id": "t1_j5zhmhs",
                    "score": 1,
                    "created_utc": 1674845030.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hi. sure. how old are you tho?",
            "author": "External-Conflict-47",
            "id": "jdifl5y",
            "parent_id": "t1_jd3cn2c",
            "score": 1,
            "created_utc": 1679676637.0,
            "replies": []
        },
        {
            "body": "24",
            "author": "zacboring",
            "id": "imazmbe",
            "parent_id": "t1_ilpn0nx",
            "score": 3,
            "created_utc": 1661807115.0,
            "replies": [
                {
                    "body": "Thanx man. Did finasteride tablets cause any side effects?",
                    "author": "Man_of_desert",
                    "id": "imc90eb",
                    "parent_id": "t1_imazmbe",
                    "score": 2,
                    "created_utc": 1661827896.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Didn’t get any results after 8 months of taking it. Not much else to elaborate on.",
            "author": "Xaxxus",
            "id": "icch76u",
            "parent_id": "t1_iccgwln",
            "score": 2,
            "created_utc": 1655224309.0,
            "replies": [
                {
                    "body": "Did you find any other solution? I did a expensive hair transplant that didnt work. The clinic are clueless. I am afraid we are the 1% that are not responsible for any treatment..",
                    "author": "Will_Cheung1979",
                    "id": "iccsh3p",
                    "parent_id": "t1_icch76u",
                    "score": 1,
                    "created_utc": 1655228865.0,
                    "replies": [
                        {
                            "body": "Nope. I just shaved my head and went bald.",
                            "author": "Xaxxus",
                            "id": "icd15oq",
                            "parent_id": "t1_iccsh3p",
                            "score": 1,
                            "created_utc": 1655232439.0,
                            "replies": [
                                {
                                    "body": "Hm, did you get any side effects? Did you take everyday or every third day? 1 mg.",
                                    "author": "Will_Cheung1979",
                                    "id": "icl6qby",
                                    "parent_id": "t1_icd15oq",
                                    "score": 1,
                                    "created_utc": 1655391112.0,
                                    "replies": [
                                        {
                                            "body": "Took it daily.\n\nI occasionally had mild pain in my balls. But I don’t know if that was related.\n\nOther than that no side effects.",
                                            "author": "Xaxxus",
                                            "id": "icn0f7x",
                                            "parent_id": "t1_icl6qby",
                                            "score": 1,
                                            "created_utc": 1655419143.0,
                                            "replies": [
                                                {
                                                    "body": "Ok, thanks",
                                                    "author": "Will_Cheung1979",
                                                    "id": "id3asb8",
                                                    "parent_id": "t1_icn0f7x",
                                                    "score": 1,
                                                    "created_utc": 1655751552.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hey man. How many times a day do u put fin/min on your scalp and is it a daily thing? Do you shampoo it off everyday too? And do u take any additional pills? thanks",
            "author": "Avowed_Precursor",
            "id": "hstz4kr",
            "parent_id": "t1_hs8lr10",
            "score": 2,
            "created_utc": 1642290537.0,
            "replies": [
                {
                    "body": "I take a Finasteride pill once per day, and try to put Minoxidil on my scalp twice per day. I hardly ever use shampoo, so I don’t wash it off that often. I also take vitamin D, and sometimes biotin",
                    "author": "zacboring",
                    "id": "hsuw8it",
                    "parent_id": "t1_hstz4kr",
                    "score": 1,
                    "created_utc": 1642304790.0,
                    "replies": [
                        {
                            "body": "How much are the pills and do u have to go to a doctor to get them? Same question for the minoxidil. Thanks",
                            "author": "Chalkywhite007",
                            "id": "htzdfp3",
                            "parent_id": "t1_hsuw8it",
                            "score": 1,
                            "created_utc": 1643000440.0,
                            "replies": [
                                {
                                    "body": "Finasteride requires a prescription, and I pay about $40 for a 3-month supply at my local pharmacy. Minoxidil is available off-the-shelf and I pay around $20 for a 3-month supply of that",
                                    "author": "zacboring",
                                    "id": "hu2ie79",
                                    "parent_id": "t1_htzdfp3",
                                    "score": 1,
                                    "created_utc": 1643058194.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "When you roll a derma roller and then apply the minoxidil, does it not hurt? since its alcohol?",
            "author": "Will_Cheung1979",
            "id": "icch0gg",
            "parent_id": "t1_hs8lr10",
            "score": 1,
            "created_utc": 1655224232.0,
            "replies": [
                {
                    "body": "Sometimes it feels a little “warm” on the scalp after derma rolling, but not too bad. It stung the first time I ever tried it, but now I barely notice it.",
                    "author": "zacboring",
                    "id": "icd3ihb",
                    "parent_id": "t1_icch0gg",
                    "score": 1,
                    "created_utc": 1655233416.0,
                    "replies": [
                        {
                            "body": "Ok, that length was your dermaroller?",
                            "author": "Will_Cheung1979",
                            "id": "icl75o9",
                            "parent_id": "t1_icd3ihb",
                            "score": 1,
                            "created_utc": 1655391296.0,
                            "replies": [
                                {
                                    "body": ".05mm, I think? It’s been a while since I’ve bought it\n\nCORRECTION: I found the sticker. It’s 0.5mm",
                                    "author": "zacboring",
                                    "id": "icli83f",
                                    "parent_id": "t1_icl75o9",
                                    "score": 1,
                                    "created_utc": 1655396001.0,
                                    "replies": [
                                        {
                                            "body": "Ok, thanks. I see you were pretty bald before. Was your hair just sleeping and the Finestaride woke them up? How long can hairs be sleeping before its too late?",
                                            "author": "Will_Cheung1979",
                                            "id": "id3api0",
                                            "parent_id": "t1_icli83f",
                                            "score": 1,
                                            "created_utc": 1655751519.0,
                                            "replies": [
                                                {
                                                    "body": "This is where my knowledge runs out. I have zero clue how any of this actually works",
                                                    "author": "zacboring",
                                                    "id": "id4pu6e",
                                                    "parent_id": "t1_id3api0",
                                                    "score": 1,
                                                    "created_utc": 1655775227.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you! And the pills I take are so generic they’re literally just called “Finasteride”, the bottle has no other name on the label other than the pharmacy itself. So I don’t think the brand really matters as long as it’s the 1mg pill. I went as cheap as possible (Propecia is most popular but it’s super expensive). I’m paying about $40 for a 3-month supply",
            "author": "zacboring",
            "id": "htbw7we",
            "parent_id": "t1_htau0qu",
            "score": 1,
            "created_utc": 1642607373.0,
            "replies": [
                {
                    "body": "You're right. I worked at a pharmacy for a while and learnt a trick. Always buy the generic brand because it's exactly the same as the branded version. Just cheaper. You're literally paying for the brand when you choose expensive medicine",
                    "author": "AlexanderNova",
                    "id": "ifbuxld",
                    "parent_id": "t1_htbw7we",
                    "score": 2,
                    "created_utc": 1657278096.0,
                    "replies": []
                },
                {
                    "body": "hey, impressive results btw, do you need a prescription every time you buy finasteride? or just went to the dermatologist once and always bought with no problem since then?",
                    "author": "royal_watermelon",
                    "id": "ibnerz0",
                    "parent_id": "t1_htbw7we",
                    "score": 1,
                    "created_utc": 1654719216.0,
                    "replies": [
                        {
                            "body": "Very good question. Typically when I’ve been written a prescription that script specifies the number of pills and how many refills. My first prescription I was written was for a 9-month supply. So I was given 3 refills with 90 pills in each bottle (3 month supply per bottle). Once that prescription runs out you’ll need to have your doctor write a new one. Since then it’s been a bit more random for me. I’ve been written one month supplies, and three month supplies. Not sure why it’s all over the place, but I’m just happy to get it. Haha",
                            "author": "zacboring",
                            "id": "ibrm8iw",
                            "parent_id": "t1_ibnerz0",
                            "score": 2,
                            "created_utc": 1654802314.0,
                            "replies": [
                                {
                                    "body": "ohh ok thank you!! is that prescribed by your regular doctor or a dermatologist? I'm going go the dermatologist in 2 weeks and im paying a full appointment so that he would give me the prescription, but I don't want to pay for more appointments everytime i need a refill 😭😭",
                                    "author": "royal_watermelon",
                                    "id": "icejagy",
                                    "parent_id": "t1_ibrm8iw",
                                    "score": 1,
                                    "created_utc": 1655257277.0,
                                    "replies": [
                                        {
                                            "body": "Your dermatologist will write you one if they agree that you could benefit from it! I ended up getting mine through a consultation via an app (covid times). Maybe you could talk to them about the renewal process (or go with a company like “Hims” or “Keeps” where they send you what you need every month)",
                                            "author": "zacboring",
                                            "id": "ichicjm",
                                            "parent_id": "t1_icejagy",
                                            "score": 2,
                                            "created_utc": 1655317827.0,
                                            "replies": [
                                                {
                                                    "body": "sorry, what are those companies really?",
                                                    "author": "royal_watermelon",
                                                    "id": "icj4ljh",
                                                    "parent_id": "t1_ichicjm",
                                                    "score": 1,
                                                    "created_utc": 1655343759.0,
                                                    "replies": [
                                                        {
                                                            "body": "They just sell kits with hair stuff in them like Finasteride and Minoxidil along with shampoos or whatever. I’ve never tried them, but people seem to like the convenience of it",
                                                            "author": "zacboring",
                                                            "id": "icli4kf",
                                                            "parent_id": "t1_icj4ljh",
                                                            "score": 2,
                                                            "created_utc": 1655395961.0,
                                                            "replies": [
                                                                {
                                                                    "body": "so that would work like topical finasteride right? but oral must be more efficient",
                                                                    "author": "royal_watermelon",
                                                                    "id": "icll2yy",
                                                                    "parent_id": "t1_icli4kf",
                                                                    "score": 1,
                                                                    "created_utc": 1655397172.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "No idea. Haven’t tried any of those options",
                                                                            "author": "zacboring",
                                                                            "id": "icm12ef",
                                                                            "parent_id": "t1_icll2yy",
                                                                            "score": 2,
                                                                            "created_utc": 1655403727.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you! I think the first picture was closer to the light source in the bathroom. Thin hair + bright light does look very whitish",
            "author": "zacboring",
            "id": "hs8mgio",
            "parent_id": "t1_hs8lffe",
            "score": 1,
            "created_utc": 1641925682.0,
            "replies": [
                {
                    "body": "Hey bro at what length were you dermarolling? and frequency?",
                    "author": "SuccotashClassic6713",
                    "id": "i921570",
                    "parent_id": "t1_hs8mgio",
                    "score": 1,
                    "created_utc": 1652868537.0,
                    "replies": [
                        {
                            "body": "I believe .05mm? Can’t remember for sure. But I do it once or twice a month",
                            "author": "zacboring",
                            "id": "i94jnkk",
                            "parent_id": "t1_i921570",
                            "score": 1,
                            "created_utc": 1652909992.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Still searching for the right kind, honestly. Lately I’ve been trying the Paul Mitchell conditioner and so far I’m liking it. But it’s too soon to tell if it’s actually repairing anything",
            "author": "zacboring",
            "id": "hsfw03q",
            "parent_id": "t1_hsfu5hf",
            "score": 1,
            "created_utc": 1642044493.0,
            "replies": [
                {
                    "body": "Cool. How often do you use it? Is it like a daily thing?",
                    "author": null,
                    "id": "hsg3e2m",
                    "parent_id": "t1_hsfw03q",
                    "score": 1,
                    "created_utc": 1642048028.0,
                    "replies": [
                        {
                            "body": "No, maybe twice a week. I don’t wash my hair every time I shower",
                            "author": "zacboring",
                            "id": "hshx55e",
                            "parent_id": "t1_hsg3e2m",
                            "score": 1,
                            "created_utc": 1642088320.0,
                            "replies": [
                                {
                                    "body": "Got it thanks man!",
                                    "author": null,
                                    "id": "hsj92s4",
                                    "parent_id": "t1_hshx55e",
                                    "score": 2,
                                    "created_utc": 1642106114.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The “no screens before bed” is probably my biggest issue. I’m a sucker for some late-night TV and Instagram scrolling. But thank you for the tip!",
            "author": "zacboring",
            "id": "hsfvqyw",
            "parent_id": "t1_hsexirw",
            "score": 1,
            "created_utc": 1642044373.0,
            "replies": []
        },
        {
            "body": "1. Can’t remember the Minoxidil dosage, but I use that twice a day. I’m on 1mg of Finasteride, and I was told to only take that once per day. I have no insight into the combo solutions unfortunately. \n\n2. I derma roll maybe twice a month. Usually after a shower, right before I apply my nightly dosage of Minoxidil. \n\n3. I’m sorry, not entirely sure what you mean\n\n4. It could help, but my temples are still pretty thin. I usually only apply Minoxidil to my scalp though, so maybe if I used it on my temples I’d grow more. I’ve always had pretty thin hair around that area anyway though",
            "author": "zacboring",
            "id": "j64tmdi",
            "parent_id": "t1_j5zhmhs",
            "score": 1,
            "created_utc": 1674845030.0,
            "replies": []
        },
        {
            "body": "Thanx man. Did finasteride tablets cause any side effects?",
            "author": "Man_of_desert",
            "id": "imc90eb",
            "parent_id": "t1_imazmbe",
            "score": 2,
            "created_utc": 1661827896.0,
            "replies": []
        },
        {
            "body": "Did you find any other solution? I did a expensive hair transplant that didnt work. The clinic are clueless. I am afraid we are the 1% that are not responsible for any treatment..",
            "author": "Will_Cheung1979",
            "id": "iccsh3p",
            "parent_id": "t1_icch76u",
            "score": 1,
            "created_utc": 1655228865.0,
            "replies": [
                {
                    "body": "Nope. I just shaved my head and went bald.",
                    "author": "Xaxxus",
                    "id": "icd15oq",
                    "parent_id": "t1_iccsh3p",
                    "score": 1,
                    "created_utc": 1655232439.0,
                    "replies": [
                        {
                            "body": "Hm, did you get any side effects? Did you take everyday or every third day? 1 mg.",
                            "author": "Will_Cheung1979",
                            "id": "icl6qby",
                            "parent_id": "t1_icd15oq",
                            "score": 1,
                            "created_utc": 1655391112.0,
                            "replies": [
                                {
                                    "body": "Took it daily.\n\nI occasionally had mild pain in my balls. But I don’t know if that was related.\n\nOther than that no side effects.",
                                    "author": "Xaxxus",
                                    "id": "icn0f7x",
                                    "parent_id": "t1_icl6qby",
                                    "score": 1,
                                    "created_utc": 1655419143.0,
                                    "replies": [
                                        {
                                            "body": "Ok, thanks",
                                            "author": "Will_Cheung1979",
                                            "id": "id3asb8",
                                            "parent_id": "t1_icn0f7x",
                                            "score": 1,
                                            "created_utc": 1655751552.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I take a Finasteride pill once per day, and try to put Minoxidil on my scalp twice per day. I hardly ever use shampoo, so I don’t wash it off that often. I also take vitamin D, and sometimes biotin",
            "author": "zacboring",
            "id": "hsuw8it",
            "parent_id": "t1_hstz4kr",
            "score": 1,
            "created_utc": 1642304790.0,
            "replies": [
                {
                    "body": "How much are the pills and do u have to go to a doctor to get them? Same question for the minoxidil. Thanks",
                    "author": "Chalkywhite007",
                    "id": "htzdfp3",
                    "parent_id": "t1_hsuw8it",
                    "score": 1,
                    "created_utc": 1643000440.0,
                    "replies": [
                        {
                            "body": "Finasteride requires a prescription, and I pay about $40 for a 3-month supply at my local pharmacy. Minoxidil is available off-the-shelf and I pay around $20 for a 3-month supply of that",
                            "author": "zacboring",
                            "id": "hu2ie79",
                            "parent_id": "t1_htzdfp3",
                            "score": 1,
                            "created_utc": 1643058194.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sometimes it feels a little “warm” on the scalp after derma rolling, but not too bad. It stung the first time I ever tried it, but now I barely notice it.",
            "author": "zacboring",
            "id": "icd3ihb",
            "parent_id": "t1_icch0gg",
            "score": 1,
            "created_utc": 1655233416.0,
            "replies": [
                {
                    "body": "Ok, that length was your dermaroller?",
                    "author": "Will_Cheung1979",
                    "id": "icl75o9",
                    "parent_id": "t1_icd3ihb",
                    "score": 1,
                    "created_utc": 1655391296.0,
                    "replies": [
                        {
                            "body": ".05mm, I think? It’s been a while since I’ve bought it\n\nCORRECTION: I found the sticker. It’s 0.5mm",
                            "author": "zacboring",
                            "id": "icli83f",
                            "parent_id": "t1_icl75o9",
                            "score": 1,
                            "created_utc": 1655396001.0,
                            "replies": [
                                {
                                    "body": "Ok, thanks. I see you were pretty bald before. Was your hair just sleeping and the Finestaride woke them up? How long can hairs be sleeping before its too late?",
                                    "author": "Will_Cheung1979",
                                    "id": "id3api0",
                                    "parent_id": "t1_icli83f",
                                    "score": 1,
                                    "created_utc": 1655751519.0,
                                    "replies": [
                                        {
                                            "body": "This is where my knowledge runs out. I have zero clue how any of this actually works",
                                            "author": "zacboring",
                                            "id": "id4pu6e",
                                            "parent_id": "t1_id3api0",
                                            "score": 1,
                                            "created_utc": 1655775227.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You're right. I worked at a pharmacy for a while and learnt a trick. Always buy the generic brand because it's exactly the same as the branded version. Just cheaper. You're literally paying for the brand when you choose expensive medicine",
            "author": "AlexanderNova",
            "id": "ifbuxld",
            "parent_id": "t1_htbw7we",
            "score": 2,
            "created_utc": 1657278096.0,
            "replies": []
        },
        {
            "body": "hey, impressive results btw, do you need a prescription every time you buy finasteride? or just went to the dermatologist once and always bought with no problem since then?",
            "author": "royal_watermelon",
            "id": "ibnerz0",
            "parent_id": "t1_htbw7we",
            "score": 1,
            "created_utc": 1654719216.0,
            "replies": [
                {
                    "body": "Very good question. Typically when I’ve been written a prescription that script specifies the number of pills and how many refills. My first prescription I was written was for a 9-month supply. So I was given 3 refills with 90 pills in each bottle (3 month supply per bottle). Once that prescription runs out you’ll need to have your doctor write a new one. Since then it’s been a bit more random for me. I’ve been written one month supplies, and three month supplies. Not sure why it’s all over the place, but I’m just happy to get it. Haha",
                    "author": "zacboring",
                    "id": "ibrm8iw",
                    "parent_id": "t1_ibnerz0",
                    "score": 2,
                    "created_utc": 1654802314.0,
                    "replies": [
                        {
                            "body": "ohh ok thank you!! is that prescribed by your regular doctor or a dermatologist? I'm going go the dermatologist in 2 weeks and im paying a full appointment so that he would give me the prescription, but I don't want to pay for more appointments everytime i need a refill 😭😭",
                            "author": "royal_watermelon",
                            "id": "icejagy",
                            "parent_id": "t1_ibrm8iw",
                            "score": 1,
                            "created_utc": 1655257277.0,
                            "replies": [
                                {
                                    "body": "Your dermatologist will write you one if they agree that you could benefit from it! I ended up getting mine through a consultation via an app (covid times). Maybe you could talk to them about the renewal process (or go with a company like “Hims” or “Keeps” where they send you what you need every month)",
                                    "author": "zacboring",
                                    "id": "ichicjm",
                                    "parent_id": "t1_icejagy",
                                    "score": 2,
                                    "created_utc": 1655317827.0,
                                    "replies": [
                                        {
                                            "body": "sorry, what are those companies really?",
                                            "author": "royal_watermelon",
                                            "id": "icj4ljh",
                                            "parent_id": "t1_ichicjm",
                                            "score": 1,
                                            "created_utc": 1655343759.0,
                                            "replies": [
                                                {
                                                    "body": "They just sell kits with hair stuff in them like Finasteride and Minoxidil along with shampoos or whatever. I’ve never tried them, but people seem to like the convenience of it",
                                                    "author": "zacboring",
                                                    "id": "icli4kf",
                                                    "parent_id": "t1_icj4ljh",
                                                    "score": 2,
                                                    "created_utc": 1655395961.0,
                                                    "replies": [
                                                        {
                                                            "body": "so that would work like topical finasteride right? but oral must be more efficient",
                                                            "author": "royal_watermelon",
                                                            "id": "icll2yy",
                                                            "parent_id": "t1_icli4kf",
                                                            "score": 1,
                                                            "created_utc": 1655397172.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No idea. Haven’t tried any of those options",
                                                                    "author": "zacboring",
                                                                    "id": "icm12ef",
                                                                    "parent_id": "t1_icll2yy",
                                                                    "score": 2,
                                                                    "created_utc": 1655403727.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hey bro at what length were you dermarolling? and frequency?",
            "author": "SuccotashClassic6713",
            "id": "i921570",
            "parent_id": "t1_hs8mgio",
            "score": 1,
            "created_utc": 1652868537.0,
            "replies": [
                {
                    "body": "I believe .05mm? Can’t remember for sure. But I do it once or twice a month",
                    "author": "zacboring",
                    "id": "i94jnkk",
                    "parent_id": "t1_i921570",
                    "score": 1,
                    "created_utc": 1652909992.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Cool. How often do you use it? Is it like a daily thing?",
            "author": null,
            "id": "hsg3e2m",
            "parent_id": "t1_hsfw03q",
            "score": 1,
            "created_utc": 1642048028.0,
            "replies": [
                {
                    "body": "No, maybe twice a week. I don’t wash my hair every time I shower",
                    "author": "zacboring",
                    "id": "hshx55e",
                    "parent_id": "t1_hsg3e2m",
                    "score": 1,
                    "created_utc": 1642088320.0,
                    "replies": [
                        {
                            "body": "Got it thanks man!",
                            "author": null,
                            "id": "hsj92s4",
                            "parent_id": "t1_hshx55e",
                            "score": 2,
                            "created_utc": 1642106114.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nope. I just shaved my head and went bald.",
            "author": "Xaxxus",
            "id": "icd15oq",
            "parent_id": "t1_iccsh3p",
            "score": 1,
            "created_utc": 1655232439.0,
            "replies": [
                {
                    "body": "Hm, did you get any side effects? Did you take everyday or every third day? 1 mg.",
                    "author": "Will_Cheung1979",
                    "id": "icl6qby",
                    "parent_id": "t1_icd15oq",
                    "score": 1,
                    "created_utc": 1655391112.0,
                    "replies": [
                        {
                            "body": "Took it daily.\n\nI occasionally had mild pain in my balls. But I don’t know if that was related.\n\nOther than that no side effects.",
                            "author": "Xaxxus",
                            "id": "icn0f7x",
                            "parent_id": "t1_icl6qby",
                            "score": 1,
                            "created_utc": 1655419143.0,
                            "replies": [
                                {
                                    "body": "Ok, thanks",
                                    "author": "Will_Cheung1979",
                                    "id": "id3asb8",
                                    "parent_id": "t1_icn0f7x",
                                    "score": 1,
                                    "created_utc": 1655751552.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How much are the pills and do u have to go to a doctor to get them? Same question for the minoxidil. Thanks",
            "author": "Chalkywhite007",
            "id": "htzdfp3",
            "parent_id": "t1_hsuw8it",
            "score": 1,
            "created_utc": 1643000440.0,
            "replies": [
                {
                    "body": "Finasteride requires a prescription, and I pay about $40 for a 3-month supply at my local pharmacy. Minoxidil is available off-the-shelf and I pay around $20 for a 3-month supply of that",
                    "author": "zacboring",
                    "id": "hu2ie79",
                    "parent_id": "t1_htzdfp3",
                    "score": 1,
                    "created_utc": 1643058194.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ok, that length was your dermaroller?",
            "author": "Will_Cheung1979",
            "id": "icl75o9",
            "parent_id": "t1_icd3ihb",
            "score": 1,
            "created_utc": 1655391296.0,
            "replies": [
                {
                    "body": ".05mm, I think? It’s been a while since I’ve bought it\n\nCORRECTION: I found the sticker. It’s 0.5mm",
                    "author": "zacboring",
                    "id": "icli83f",
                    "parent_id": "t1_icl75o9",
                    "score": 1,
                    "created_utc": 1655396001.0,
                    "replies": [
                        {
                            "body": "Ok, thanks. I see you were pretty bald before. Was your hair just sleeping and the Finestaride woke them up? How long can hairs be sleeping before its too late?",
                            "author": "Will_Cheung1979",
                            "id": "id3api0",
                            "parent_id": "t1_icli83f",
                            "score": 1,
                            "created_utc": 1655751519.0,
                            "replies": [
                                {
                                    "body": "This is where my knowledge runs out. I have zero clue how any of this actually works",
                                    "author": "zacboring",
                                    "id": "id4pu6e",
                                    "parent_id": "t1_id3api0",
                                    "score": 1,
                                    "created_utc": 1655775227.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Very good question. Typically when I’ve been written a prescription that script specifies the number of pills and how many refills. My first prescription I was written was for a 9-month supply. So I was given 3 refills with 90 pills in each bottle (3 month supply per bottle). Once that prescription runs out you’ll need to have your doctor write a new one. Since then it’s been a bit more random for me. I’ve been written one month supplies, and three month supplies. Not sure why it’s all over the place, but I’m just happy to get it. Haha",
            "author": "zacboring",
            "id": "ibrm8iw",
            "parent_id": "t1_ibnerz0",
            "score": 2,
            "created_utc": 1654802314.0,
            "replies": [
                {
                    "body": "ohh ok thank you!! is that prescribed by your regular doctor or a dermatologist? I'm going go the dermatologist in 2 weeks and im paying a full appointment so that he would give me the prescription, but I don't want to pay for more appointments everytime i need a refill 😭😭",
                    "author": "royal_watermelon",
                    "id": "icejagy",
                    "parent_id": "t1_ibrm8iw",
                    "score": 1,
                    "created_utc": 1655257277.0,
                    "replies": [
                        {
                            "body": "Your dermatologist will write you one if they agree that you could benefit from it! I ended up getting mine through a consultation via an app (covid times). Maybe you could talk to them about the renewal process (or go with a company like “Hims” or “Keeps” where they send you what you need every month)",
                            "author": "zacboring",
                            "id": "ichicjm",
                            "parent_id": "t1_icejagy",
                            "score": 2,
                            "created_utc": 1655317827.0,
                            "replies": [
                                {
                                    "body": "sorry, what are those companies really?",
                                    "author": "royal_watermelon",
                                    "id": "icj4ljh",
                                    "parent_id": "t1_ichicjm",
                                    "score": 1,
                                    "created_utc": 1655343759.0,
                                    "replies": [
                                        {
                                            "body": "They just sell kits with hair stuff in them like Finasteride and Minoxidil along with shampoos or whatever. I’ve never tried them, but people seem to like the convenience of it",
                                            "author": "zacboring",
                                            "id": "icli4kf",
                                            "parent_id": "t1_icj4ljh",
                                            "score": 2,
                                            "created_utc": 1655395961.0,
                                            "replies": [
                                                {
                                                    "body": "so that would work like topical finasteride right? but oral must be more efficient",
                                                    "author": "royal_watermelon",
                                                    "id": "icll2yy",
                                                    "parent_id": "t1_icli4kf",
                                                    "score": 1,
                                                    "created_utc": 1655397172.0,
                                                    "replies": [
                                                        {
                                                            "body": "No idea. Haven’t tried any of those options",
                                                            "author": "zacboring",
                                                            "id": "icm12ef",
                                                            "parent_id": "t1_icll2yy",
                                                            "score": 2,
                                                            "created_utc": 1655403727.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I believe .05mm? Can’t remember for sure. But I do it once or twice a month",
            "author": "zacboring",
            "id": "i94jnkk",
            "parent_id": "t1_i921570",
            "score": 1,
            "created_utc": 1652909992.0,
            "replies": []
        },
        {
            "body": "No, maybe twice a week. I don’t wash my hair every time I shower",
            "author": "zacboring",
            "id": "hshx55e",
            "parent_id": "t1_hsg3e2m",
            "score": 1,
            "created_utc": 1642088320.0,
            "replies": [
                {
                    "body": "Got it thanks man!",
                    "author": null,
                    "id": "hsj92s4",
                    "parent_id": "t1_hshx55e",
                    "score": 2,
                    "created_utc": 1642106114.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hm, did you get any side effects? Did you take everyday or every third day? 1 mg.",
            "author": "Will_Cheung1979",
            "id": "icl6qby",
            "parent_id": "t1_icd15oq",
            "score": 1,
            "created_utc": 1655391112.0,
            "replies": [
                {
                    "body": "Took it daily.\n\nI occasionally had mild pain in my balls. But I don’t know if that was related.\n\nOther than that no side effects.",
                    "author": "Xaxxus",
                    "id": "icn0f7x",
                    "parent_id": "t1_icl6qby",
                    "score": 1,
                    "created_utc": 1655419143.0,
                    "replies": [
                        {
                            "body": "Ok, thanks",
                            "author": "Will_Cheung1979",
                            "id": "id3asb8",
                            "parent_id": "t1_icn0f7x",
                            "score": 1,
                            "created_utc": 1655751552.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Finasteride requires a prescription, and I pay about $40 for a 3-month supply at my local pharmacy. Minoxidil is available off-the-shelf and I pay around $20 for a 3-month supply of that",
            "author": "zacboring",
            "id": "hu2ie79",
            "parent_id": "t1_htzdfp3",
            "score": 1,
            "created_utc": 1643058194.0,
            "replies": []
        },
        {
            "body": ".05mm, I think? It’s been a while since I’ve bought it\n\nCORRECTION: I found the sticker. It’s 0.5mm",
            "author": "zacboring",
            "id": "icli83f",
            "parent_id": "t1_icl75o9",
            "score": 1,
            "created_utc": 1655396001.0,
            "replies": [
                {
                    "body": "Ok, thanks. I see you were pretty bald before. Was your hair just sleeping and the Finestaride woke them up? How long can hairs be sleeping before its too late?",
                    "author": "Will_Cheung1979",
                    "id": "id3api0",
                    "parent_id": "t1_icli83f",
                    "score": 1,
                    "created_utc": 1655751519.0,
                    "replies": [
                        {
                            "body": "This is where my knowledge runs out. I have zero clue how any of this actually works",
                            "author": "zacboring",
                            "id": "id4pu6e",
                            "parent_id": "t1_id3api0",
                            "score": 1,
                            "created_utc": 1655775227.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "ohh ok thank you!! is that prescribed by your regular doctor or a dermatologist? I'm going go the dermatologist in 2 weeks and im paying a full appointment so that he would give me the prescription, but I don't want to pay for more appointments everytime i need a refill 😭😭",
            "author": "royal_watermelon",
            "id": "icejagy",
            "parent_id": "t1_ibrm8iw",
            "score": 1,
            "created_utc": 1655257277.0,
            "replies": [
                {
                    "body": "Your dermatologist will write you one if they agree that you could benefit from it! I ended up getting mine through a consultation via an app (covid times). Maybe you could talk to them about the renewal process (or go with a company like “Hims” or “Keeps” where they send you what you need every month)",
                    "author": "zacboring",
                    "id": "ichicjm",
                    "parent_id": "t1_icejagy",
                    "score": 2,
                    "created_utc": 1655317827.0,
                    "replies": [
                        {
                            "body": "sorry, what are those companies really?",
                            "author": "royal_watermelon",
                            "id": "icj4ljh",
                            "parent_id": "t1_ichicjm",
                            "score": 1,
                            "created_utc": 1655343759.0,
                            "replies": [
                                {
                                    "body": "They just sell kits with hair stuff in them like Finasteride and Minoxidil along with shampoos or whatever. I’ve never tried them, but people seem to like the convenience of it",
                                    "author": "zacboring",
                                    "id": "icli4kf",
                                    "parent_id": "t1_icj4ljh",
                                    "score": 2,
                                    "created_utc": 1655395961.0,
                                    "replies": [
                                        {
                                            "body": "so that would work like topical finasteride right? but oral must be more efficient",
                                            "author": "royal_watermelon",
                                            "id": "icll2yy",
                                            "parent_id": "t1_icli4kf",
                                            "score": 1,
                                            "created_utc": 1655397172.0,
                                            "replies": [
                                                {
                                                    "body": "No idea. Haven’t tried any of those options",
                                                    "author": "zacboring",
                                                    "id": "icm12ef",
                                                    "parent_id": "t1_icll2yy",
                                                    "score": 2,
                                                    "created_utc": 1655403727.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Got it thanks man!",
            "author": null,
            "id": "hsj92s4",
            "parent_id": "t1_hshx55e",
            "score": 2,
            "created_utc": 1642106114.0,
            "replies": []
        },
        {
            "body": "Took it daily.\n\nI occasionally had mild pain in my balls. But I don’t know if that was related.\n\nOther than that no side effects.",
            "author": "Xaxxus",
            "id": "icn0f7x",
            "parent_id": "t1_icl6qby",
            "score": 1,
            "created_utc": 1655419143.0,
            "replies": [
                {
                    "body": "Ok, thanks",
                    "author": "Will_Cheung1979",
                    "id": "id3asb8",
                    "parent_id": "t1_icn0f7x",
                    "score": 1,
                    "created_utc": 1655751552.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ok, thanks. I see you were pretty bald before. Was your hair just sleeping and the Finestaride woke them up? How long can hairs be sleeping before its too late?",
            "author": "Will_Cheung1979",
            "id": "id3api0",
            "parent_id": "t1_icli83f",
            "score": 1,
            "created_utc": 1655751519.0,
            "replies": [
                {
                    "body": "This is where my knowledge runs out. I have zero clue how any of this actually works",
                    "author": "zacboring",
                    "id": "id4pu6e",
                    "parent_id": "t1_id3api0",
                    "score": 1,
                    "created_utc": 1655775227.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your dermatologist will write you one if they agree that you could benefit from it! I ended up getting mine through a consultation via an app (covid times). Maybe you could talk to them about the renewal process (or go with a company like “Hims” or “Keeps” where they send you what you need every month)",
            "author": "zacboring",
            "id": "ichicjm",
            "parent_id": "t1_icejagy",
            "score": 2,
            "created_utc": 1655317827.0,
            "replies": [
                {
                    "body": "sorry, what are those companies really?",
                    "author": "royal_watermelon",
                    "id": "icj4ljh",
                    "parent_id": "t1_ichicjm",
                    "score": 1,
                    "created_utc": 1655343759.0,
                    "replies": [
                        {
                            "body": "They just sell kits with hair stuff in them like Finasteride and Minoxidil along with shampoos or whatever. I’ve never tried them, but people seem to like the convenience of it",
                            "author": "zacboring",
                            "id": "icli4kf",
                            "parent_id": "t1_icj4ljh",
                            "score": 2,
                            "created_utc": 1655395961.0,
                            "replies": [
                                {
                                    "body": "so that would work like topical finasteride right? but oral must be more efficient",
                                    "author": "royal_watermelon",
                                    "id": "icll2yy",
                                    "parent_id": "t1_icli4kf",
                                    "score": 1,
                                    "created_utc": 1655397172.0,
                                    "replies": [
                                        {
                                            "body": "No idea. Haven’t tried any of those options",
                                            "author": "zacboring",
                                            "id": "icm12ef",
                                            "parent_id": "t1_icll2yy",
                                            "score": 2,
                                            "created_utc": 1655403727.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ok, thanks",
            "author": "Will_Cheung1979",
            "id": "id3asb8",
            "parent_id": "t1_icn0f7x",
            "score": 1,
            "created_utc": 1655751552.0,
            "replies": []
        },
        {
            "body": "This is where my knowledge runs out. I have zero clue how any of this actually works",
            "author": "zacboring",
            "id": "id4pu6e",
            "parent_id": "t1_id3api0",
            "score": 1,
            "created_utc": 1655775227.0,
            "replies": []
        },
        {
            "body": "sorry, what are those companies really?",
            "author": "royal_watermelon",
            "id": "icj4ljh",
            "parent_id": "t1_ichicjm",
            "score": 1,
            "created_utc": 1655343759.0,
            "replies": [
                {
                    "body": "They just sell kits with hair stuff in them like Finasteride and Minoxidil along with shampoos or whatever. I’ve never tried them, but people seem to like the convenience of it",
                    "author": "zacboring",
                    "id": "icli4kf",
                    "parent_id": "t1_icj4ljh",
                    "score": 2,
                    "created_utc": 1655395961.0,
                    "replies": [
                        {
                            "body": "so that would work like topical finasteride right? but oral must be more efficient",
                            "author": "royal_watermelon",
                            "id": "icll2yy",
                            "parent_id": "t1_icli4kf",
                            "score": 1,
                            "created_utc": 1655397172.0,
                            "replies": [
                                {
                                    "body": "No idea. Haven’t tried any of those options",
                                    "author": "zacboring",
                                    "id": "icm12ef",
                                    "parent_id": "t1_icll2yy",
                                    "score": 2,
                                    "created_utc": 1655403727.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "They just sell kits with hair stuff in them like Finasteride and Minoxidil along with shampoos or whatever. I’ve never tried them, but people seem to like the convenience of it",
            "author": "zacboring",
            "id": "icli4kf",
            "parent_id": "t1_icj4ljh",
            "score": 2,
            "created_utc": 1655395961.0,
            "replies": [
                {
                    "body": "so that would work like topical finasteride right? but oral must be more efficient",
                    "author": "royal_watermelon",
                    "id": "icll2yy",
                    "parent_id": "t1_icli4kf",
                    "score": 1,
                    "created_utc": 1655397172.0,
                    "replies": [
                        {
                            "body": "No idea. Haven’t tried any of those options",
                            "author": "zacboring",
                            "id": "icm12ef",
                            "parent_id": "t1_icll2yy",
                            "score": 2,
                            "created_utc": 1655403727.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "so that would work like topical finasteride right? but oral must be more efficient",
            "author": "royal_watermelon",
            "id": "icll2yy",
            "parent_id": "t1_icli4kf",
            "score": 1,
            "created_utc": 1655397172.0,
            "replies": [
                {
                    "body": "No idea. Haven’t tried any of those options",
                    "author": "zacboring",
                    "id": "icm12ef",
                    "parent_id": "t1_icll2yy",
                    "score": 2,
                    "created_utc": 1655403727.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No idea. Haven’t tried any of those options",
            "author": "zacboring",
            "id": "icm12ef",
            "parent_id": "t1_icll2yy",
            "score": 2,
            "created_utc": 1655403727.0,
            "replies": []
        }
    ]
}