{
    "title": "SD lied about Covid test results, to quote Adele ''This is the end''",
    "post_id": "rhrpcj",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/rhrpcj/sd_lied_about_covid_test_results_to_quote_adele/",
    "author": "Dublinliberty",
    "body": "EDIT: First of all a MASSIVE thank you for all the really lovely comments, the advice, the DMS asking how I am etc.. I know some days our little SLF family can seem a little dysfunctional but yesterday when I felt sick with stress this community really helped me ( also mince pies helped...so many mince pies) \n\nOh..to the commenter who suggested that I need to get over myself and was over reacting to Covid.. Are your parents cousins? Perhaps even brother and sister? As it's the only explanation I have for your stupidity.\n\nAs of 10pm last night I'm still negative so it's looking like I've been lucky, I will keep testing every day until my flight.\n\nSD sent messages and voice tags asking for my test results, I have responded that I'm negative but have asked him to give me some space until after Christmas and we will chat then, the relationship is over but I want our final conversation to come at a time when I'm less hurt and angry.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nOn Tuesday my SD ( of 14 months) booked the beautiful Corinthia Hotel London to celebrate our Christmas date. Our plan was to order room service, drink champagne, watch ''It's a wonderful life'' and unwrap our Christmas presents, the reality however was a sleepless night which I am 99.9% sure has ended our SR.When I arrived he was already in our room and I noticed immediately that he wasn't looking well, he was pale and coughing..badly..Before I had even taken my coat off I asked him if he was feeling alright, if he wanted me to go home and to reschedule, I would have completely understood. He assured me that..A. He just had a cough he'd picked up from his daughters schoolB. He'd taken 2 lateral flow tests and was showing negativeC. He felt fine..it was just a cough.\n\nWe settled into the room, I ordered room service, some champagne for me and a hot whiskey for him..I ran him a hot bath and also asked the wonderful hotel team so send up some ginger herbal tea for later, we tried to enjoy our night but by 10pm he was a lot worse, he was coughing like a small alien being was tying to escape his chest..everytime he tired to lay down the coughing was worse.He told me if I wanted to leave or to get another room he's completely understand and he kept apologising for ''ruining our Christmas'.Of course I stayed, this was a man I have been in an intimate relationship for more than a year, a man who has supported me, treated me with nothing but kindness and respect..why wouldn't I stay and take care of him? After all it was just a cough his daughter brought home from school..\n\nSo I stayed up all night with him, I made tea, rubbed his back, got him water and even used an online 24 hour pharmacy to order cough medicine to the hotel.At 4 am he became very emotional and again kept telling me how sorry he was..how he was a ''selfish idiot'' finally he admitting to me that he hadn't in fact taken any lateral flow tests and that he'd been feeling sick since a party he'd attended on Saturday night, that he'd ''chosen ignorance so we could still have our date''\n\nI just sat there feeling numb and sick and exhausted, he knew I was flying back to Ireland this weekend to see my family for Christmas, that I haven't been home for 2 years and that I need an negative PCR test to board my flight. He knew it would devastate me to spend Christmas alone again this year. I have lateral flowed everyday for the past 2 weeks and have not stepped foot outside my door without my mask.\n\nI silently packed up and ordered my own Uber home, he kept saying sorry but I just left..He messaged me yesterday to say he's tested Positive ( of course he has)  and he's incredibly sorry.I have not responded yet.I tested negative last night and will test again today as I realise it can take a few days to show up.I am sick with worry, feel so sad and hurt he could have done this and have no idea how to even approach a conversation with him. I don't feel I can ghost after a year long relationship..I feel a conversation is needed but perhaps I should wait until after Christmas.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/rhrpcj/sd_lied_about_covid_test_results_to_quote_adele/",
    "score": 211,
    "upvote_ratio": 0.95,
    "created_utc": 1639664430.0,
    "num_comments": 101,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "hosbypp",
            "parent_id": "t3_rhrpcj",
            "score": 110,
            "created_utc": 1639666776.0,
            "replies": [
                {
                    "body": "Thank you..I have all limbs I could possibly cross crossed!",
                    "author": "Dublinliberty",
                    "id": "hoscn6o",
                    "parent_id": "t1_hosbypp",
                    "score": 29,
                    "created_utc": 1639667064.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is ghost worthy. Not to be an alarmist but he could have potentially put your life at risk due to his selfishness (I’m sure it’s fine, you’re young, I’m just saying) and ruined your Christmas… make like the ghost of Christmas past and disappear. Honestly. He doesn’t even deserve a conversation.",
            "author": "WestCoastCompanion",
            "id": "hosjw6o",
            "parent_id": "t3_rhrpcj",
            "score": 68,
            "created_utc": 1639670019.0,
            "replies": [
                {
                    "body": "And not to be alarmist either but the potential lingering, possibly lifelong health effects after getting and recovering from Covid are really what would push me into never seeing this man again territory. The fact that OP is young and vaccinated and pretty much certain to recover is not the only variable in the equation here.\n\nThank goodness OP is vaccinated.",
                    "author": "SBerryTrifle",
                    "id": "hotg2d3",
                    "parent_id": "t1_hosjw6o",
                    "score": 28,
                    "created_utc": 1639682533.0,
                    "replies": [
                        {
                            "body": "Exactly that. He’s perfectly willing to your health and life at risk. There are many other potential situations where he could risk your health for selfish reasons as well…. think potential STD exposure etc Sorry to say but he was not considering your well being at all. He knew he had it, he just didn’t get the rest because then he’d feel less guilty with plausible deniability…. But he knew. Leave him.\nI also don’t want CoVid, esp not long covid. I’m young and vaccinated and most likely wouldn’t die but people forget there’s a whole mess of other things, potentially long lasting or even permanent, as you said, that fall in between “dead” and “not dead”.\nAnd also… her Christmas!! 😭😭😭😭",
                            "author": "WestCoastCompanion",
                            "id": "hotghb0",
                            "parent_id": "t1_hotg2d3",
                            "score": 20,
                            "created_utc": 1639682696.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hose7ml",
            "parent_id": "t3_rhrpcj",
            "score": 69,
            "created_utc": 1639667718.0,
            "replies": [
                {
                    "body": "I wont deny it..I'm incredibly tempted to release my full redhead Irish temper on him..",
                    "author": "Dublinliberty",
                    "id": "hosizu6",
                    "parent_id": "t1_hose7ml",
                    "score": 45,
                    "created_utc": 1639669660.0,
                    "replies": [
                        {
                            "body": "I think you should give him both barrels and then ghost.  It might make you feel a little better. I hope you can get home.  He doesn’t deserve you.  Look at the efforts you put in that night. He is risking your trip but more importantly your life.  If my SB did that it would definitely be over. The SR is based on some level of trust and he doesn’t deserve yours ever.",
                            "author": "Ruralgrumpy1",
                            "id": "hot95qm",
                            "parent_id": "t1_hosizu6",
                            "score": 23,
                            "created_utc": 1639679827.0,
                            "replies": []
                        },
                        {
                            "body": "I'm surprised you haven't. I would be livid.",
                            "author": "AnSteall",
                            "id": "houf130",
                            "parent_id": "t1_hosizu6",
                            "score": 6,
                            "created_utc": 1639696531.0,
                            "replies": []
                        },
                        {
                            "body": "Do iiiit",
                            "author": "oneangstybiscuit",
                            "id": "hov5fev",
                            "parent_id": "t1_hosizu6",
                            "score": 2,
                            "created_utc": 1639708376.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hoslb2z",
            "parent_id": "t3_rhrpcj",
            "score": 32,
            "created_utc": 1639670584.0,
            "replies": [
                {
                    "body": "Thank you, he has sent another message saying he know he deserves the silent treatment and to let him know if I need anything etc..   \nHe's double vaxxed so I think he'll be sick but shall recover, to be honest I was so wrapped up in my own head I didn't even think about the hotel..I will call them now as I don't trust him too.",
                    "author": "Dublinliberty",
                    "id": "hosmdmg",
                    "parent_id": "t1_hoslb2z",
                    "score": 20,
                    "created_utc": 1639671007.0,
                    "replies": [
                        {
                            "body": "Tell him you need an extra big Christmas bonus and then ghost him",
                            "author": "Starberrybb",
                            "id": "hosp3bb",
                            "parent_id": "t1_hosmdmg",
                            "score": 20,
                            "created_utc": 1639672075.0,
                            "replies": []
                        },
                        {
                            "body": ">He's double vaxxed\n\nAre you sure he's double vaxxed? Or is that just something he told you? \n\nIt's of course very possible for a fully-vaccinated person to have a lot of bad COVID symptoms, but...idk. I guess you'll find out how it goes for him. I'm so sorry you got put into this.",
                            "author": "emptyoverflow",
                            "id": "hot209d",
                            "parent_id": "t1_hosmdmg",
                            "score": 14,
                            "created_utc": 1639677029.0,
                            "replies": [
                                {
                                    "body": "Breakthrough cases of vaccinated people are not uncommon but usually their case is not very severe.",
                                    "author": "SouthernGentSD",
                                    "id": "hot3byl",
                                    "parent_id": "t1_hot209d",
                                    "score": 11,
                                    "created_utc": 1639677540.0,
                                    "replies": [
                                        {
                                            "body": "Yep that's what I was thinking. Eg he could totally get it but it sounds like he was coughing up a lung.",
                                            "author": "emptyoverflow",
                                            "id": "hot4ncd",
                                            "parent_id": "t1_hot3byl",
                                            "score": 6,
                                            "created_utc": 1639678058.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I’m young and very healthy - had a breakthrough case and it was *awful*. I wasn’t hospitalized but I wouldn’t have been able to hang out comfortably during something like this Christmas celebration hotel-stay he planned. Hopefully for OP’s sake he was double vaxxed and it just hit him hard. \n\nFor what it’s worth (OP, if you see this) my friend was with me the entire time I could’ve caught my case of Covid - I even sneezed around him a TON when my symptoms first started - and he never got any symptoms or tested positive. It is possible that you’ll test negative and remain Covid-free despite being in close quarters! Fingers crossed!",
                                            "author": "softlytrampled",
                                            "id": "hovbefx",
                                            "parent_id": "t1_hot3byl",
                                            "score": 5,
                                            "created_utc": 1639711069.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh my goodness. I am so sorry. This would be a deal breaker for me, too. Him knowing you’re going to see family and still being that selfish is so horrible. :(",
            "author": "Cdnsugarr",
            "id": "hosk991",
            "parent_id": "t3_rhrpcj",
            "score": 13,
            "created_utc": 1639670163.0,
            "replies": []
        },
        {
            "body": "He’s a DICK. End it NOW. \n\nHe jeopardized your health for his own personal gratification. If an SD did this to me I would have ended it right then and there but not before reaming him a new asshole.",
            "author": "chantal7510",
            "id": "hosv6oo",
            "parent_id": "t3_rhrpcj",
            "score": 12,
            "created_utc": 1639674429.0,
            "replies": []
        },
        {
            "body": "Another self absorbed SD. If you don't get it it will be a surprise but hopefully you will be OK.",
            "author": "GSSD",
            "id": "hos7dw5",
            "parent_id": "t3_rhrpcj",
            "score": 27,
            "created_utc": 1639664769.0,
            "replies": []
        },
        {
            "body": "Sounds like a real asshole sweetie. You simply don’t do that to another person. Let alone your dear SB. Next him!",
            "author": "Regular_Phone3261",
            "id": "hoshwpm",
            "parent_id": "t3_rhrpcj",
            "score": 13,
            "created_utc": 1639669233.0,
            "replies": []
        },
        {
            "body": "That’s awful. I’m so sorry. Here’s hoping you test negative and get to go see your family",
            "author": "Rainmanbutcute",
            "id": "hos7f5b",
            "parent_id": "t3_rhrpcj",
            "score": 10,
            "created_utc": 1639664784.0,
            "replies": []
        },
        {
            "body": "He’s a selfish prig. Ghost him, dump him, whatever. Just get him out of your life.",
            "author": "throwawayaccount0327",
            "id": "hosb1hl",
            "parent_id": "t3_rhrpcj",
            "score": 20,
            "created_utc": 1639666386.0,
            "replies": []
        },
        {
            "body": "This asshole put your health and the health of those you come in contact with at risk for his own selfish needs. I think Dante reserved a special ring in hell for arrogant shits like him.",
            "author": "AFSMSgt",
            "id": "hosrf5h",
            "parent_id": "t3_rhrpcj",
            "score": 11,
            "created_utc": 1639672982.0,
            "replies": []
        },
        {
            "body": "Holy fucking shit. That’s some real psychopathic antisocial behavior. \n\nI never recommend ghosting anyone… but if anyone deserves it, it’s this guy. \n\nI’m so sorry this happened to you. :(",
            "author": "tossedwanker",
            "id": "hosgezw",
            "parent_id": "t3_rhrpcj",
            "score": 28,
            "created_utc": 1639668627.0,
            "replies": [
                {
                    "body": "Thank you..currently I'm undecided between complete ghosting or go full Irish on him and release the redhead temper.",
                    "author": "Dublinliberty",
                    "id": "hosieq1",
                    "parent_id": "t1_hosgezw",
                    "score": 11,
                    "created_utc": 1639669428.0,
                    "replies": [
                        {
                            "body": "Release the temper lol",
                            "author": "Cdnsugarr",
                            "id": "hoskdro",
                            "parent_id": "t1_hosieq1",
                            "score": 10,
                            "created_utc": 1639670213.0,
                            "replies": []
                        },
                        {
                            "body": "As a fellow Irish lady, I vote for going full Irish on him.  He'll certainly learn his lesson from it! 😉",
                            "author": "lithany1066",
                            "id": "hosl9xz",
                            "parent_id": "t1_hosieq1",
                            "score": 9,
                            "created_utc": 1639670571.0,
                            "replies": [
                                {
                                    "body": "As an American, I don't know what full Irish means but now I want to know!",
                                    "author": "emptyoverflow",
                                    "id": "hot26n6",
                                    "parent_id": "t1_hosl9xz",
                                    "score": 3,
                                    "created_utc": 1639677098.0,
                                    "replies": [
                                        {
                                            "body": "Irish women are very well known for their tempers when pushed.  We have barbed tongues and know exactly how to use them, but not in a way a guy would find pleasurable 🤣 ....unless that's his kink 😉",
                                            "author": "lithany1066",
                                            "id": "houpxlb",
                                            "parent_id": "t1_hot26n6",
                                            "score": 1,
                                            "created_utc": 1639701425.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Release the Kraken!",
                            "author": "pointe_d_toes",
                            "id": "hosmqg6",
                            "parent_id": "t1_hosieq1",
                            "score": 2,
                            "created_utc": 1639671146.0,
                            "replies": []
                        },
                        {
                            "body": "Burn the bridge after you've torn him a new one. I'm so sorry he did this to you sis 🥺",
                            "author": null,
                            "id": "hosxawl",
                            "parent_id": "t1_hosieq1",
                            "score": 4,
                            "created_utc": 1639675241.0,
                            "replies": []
                        },
                        {
                            "body": "OP, what did you end up doing?",
                            "author": "emptyoverflow",
                            "id": "hqdlyee",
                            "parent_id": "t1_hosieq1",
                            "score": 1,
                            "created_utc": 1640756755.0,
                            "replies": [
                                {
                                    "body": "I did get to Ireland (thankfully) and have asked him for some space to enjoy the holidays and that we would speak again in the New Year. The relationship is over, I just did not want to have that conversation while he's ill.",
                                    "author": "Dublinliberty",
                                    "id": "hqfa64t",
                                    "parent_id": "t1_hqdlyee",
                                    "score": 1,
                                    "created_utc": 1640794658.0,
                                    "replies": [
                                        {
                                            "body": "So, no full Irish until the new year?",
                                            "author": "emptyoverflow",
                                            "id": "hqinr8h",
                                            "parent_id": "t1_hqfa64t",
                                            "score": 1,
                                            "created_utc": 1640846856.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That was incredibly selfish. You have every right to dump him, before or after Christmas. I'm sorry that happened to you. My trust would be fundamentally broken with anyone who knowingly exposed me to Covid.",
            "author": "missthingmariah",
            "id": "hosdm8v",
            "parent_id": "t3_rhrpcj",
            "score": 13,
            "created_utc": 1639667471.0,
            "replies": []
        },
        {
            "body": ">I don't feel I can ghost after a year long relationship\n\nUh, this guy lied, threatened your health, and jeopardized your holiday time with your family. You can do WHATEVER YOU WANT to this dude.\n\nHe KNEW he probably had COVID, but he still saw you. And that wasn't enough -- he encouraged you to stick around all night with him. Good lord.",
            "author": "emptyoverflow",
            "id": "hot1t65",
            "parent_id": "t3_rhrpcj",
            "score": 4,
            "created_utc": 1639676955.0,
            "replies": []
        },
        {
            "body": "First the way you conducted yourself is so lovely and kind. You are sensitive, proactive and nurturing. Second, the tiny alien comment made me LOL! Third, I’m sorry - what a waste of time. I would have offered max dose of Ambien, and a double shot whiskey. Good night. And then I would have left. What a mess.",
            "author": null,
            "id": "hostriv",
            "parent_id": "t3_rhrpcj",
            "score": 5,
            "created_utc": 1639673877.0,
            "replies": []
        },
        {
            "body": "Sorry that happened to you. I did not have an experience like this.\n\n However, a new POT I had back in August shows up with COVID to our 2nd date. She looked like shite, felt like shite. She had all the symptoms. She was NOT vaccinated. And she did test positive the next day.  Needless to say I nexted her super fast after that date. I am vaccinated so I was not worried, just irritated mostly. That is the second POT that had had covid while we were on a date.",
            "author": "CenTexFunGuy",
            "id": "hos99rh",
            "parent_id": "t3_rhrpcj",
            "score": 9,
            "created_utc": 1639665614.0,
            "replies": [
                {
                    "body": "What the fuck? Why would someone show up to a date with COVID. People are seriously wack out there.",
                    "author": "Starberrybb",
                    "id": "hosovgf",
                    "parent_id": "t1_hos99rh",
                    "score": 9,
                    "created_utc": 1639671988.0,
                    "replies": [
                        {
                            "body": "I really do not know why she showed up. It was just a lunch date.",
                            "author": "CenTexFunGuy",
                            "id": "hotcxaq",
                            "parent_id": "t1_hosovgf",
                            "score": 1,
                            "created_utc": 1639681294.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeash what a fucking asshole, from one redhead to another; release your temper! \n\nIf it helps you, since you're vaccinated and even have the booster shot there is a chance you might not get it and keep on testing negative. Two weeks ago my bf and I saw a friend who tested positive shortly afterwards, and after 2 days he tested positive as well. While I still was at his place and he started getting quite sick. I am vaxxed but haven't had the booster yet as my government is shite, and am a risk group. So I went home assuming I would test positive for certain. But a week of quarantaine, 1 pcr and 7 hometests later still a negative bitch! So there might be hope for you that you can go home 🤗",
            "author": "Competitive_Earth",
            "id": "hosmmyv",
            "parent_id": "t3_rhrpcj",
            "score": 3,
            "created_utc": 1639671109.0,
            "replies": []
        },
        {
            "body": "He couldn't just cancel the date if he wasn't sure? That's so terrible. I'd ghost.",
            "author": "Leading-Captain-5312",
            "id": "hoswyfw",
            "parent_id": "t3_rhrpcj",
            "score": 3,
            "created_utc": 1639675111.0,
            "replies": []
        },
        {
            "body": "I would absolutely kill him - this is beyond being an 'asshole' or 'self involved' - knowing how much your upcoming trip to see your family was and...... aaaaahhhhhhhhhhh!!! I am so mad for you.\n\nI am so so sorry you are in the anxious state - I hope things will work out and your trip will not be affected - fingers crossed --- he'd owe you so very much, 1000's if he fucked this up for you - not like that would make up for it...\n\n&#x200B;\n\nfor me it would be unforgivable and I'd be done - there is no excuse for him. none for this behavior.",
            "author": "thereadinessisall",
            "id": "hosyisr",
            "parent_id": "t3_rhrpcj",
            "score": 3,
            "created_utc": 1639675702.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hovw17c",
            "parent_id": "t3_rhrpcj",
            "score": 3,
            "created_utc": 1639721625.0,
            "replies": [
                {
                    "body": "I asked for some Charlotte Tilbury creams and make up..I haven't even opened the boxes..they are sitting in my spare room.",
                    "author": "Dublinliberty",
                    "id": "howsfhe",
                    "parent_id": "t1_hovw17c",
                    "score": 2,
                    "created_utc": 1639744535.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Signal that virtue harder daddy",
            "author": null,
            "id": "howvi1v",
            "parent_id": "t3_rhrpcj",
            "score": 3,
            "created_utc": 1639746216.0,
            "replies": []
        },
        {
            "body": "I am so sorry. This is so messed up.",
            "author": "throwawaybaybee23",
            "id": "hoskqj6",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639670355.0,
            "replies": []
        },
        {
            "body": "Hopefully you won’t have caught it!!!",
            "author": "tom26461",
            "id": "hosl6al",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639670529.0,
            "replies": []
        },
        {
            "body": "Fingers crossed your tests keep coming back negative and you can have a nice holiday with the family/friends. What this guy did in this day & age is inexcusable. I think you're right to have a conversation, but hold off on that until after Christmas. You don't need the stress, and he deserves to be left twisting in the wind a bit.",
            "author": "roscoe7585",
            "id": "hoss3fi",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639673240.0,
            "replies": []
        },
        {
            "body": "That is some next level shit .. at the same time, please update us and let us know if you ever were positive and if you were able to make it home so this terrible story can have a happy ending.",
            "author": "vince539839",
            "id": "hosug18",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639674141.0,
            "replies": []
        },
        {
            "body": "I’m sorry that he couldn’t respect your boundaries. You have ever right to want to end it. \nIt was selfish of him to put his need to see you over your safety. Sending good vibes that you stay negative and can go see your family for Christmas",
            "author": "Dmariee9",
            "id": "hoszlb4",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639676113.0,
            "replies": []
        },
        {
            "body": "Fuck this selfish asshole. Run away and never look back. That is complete bullshit.",
            "author": "SD1070",
            "id": "hot0mee",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639676505.0,
            "replies": []
        },
        {
            "body": "i would roll at \"coughing badly\" see ya :)",
            "author": "bookworm010101",
            "id": "hot6rsg",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639678884.0,
            "replies": []
        },
        {
            "body": "Oh my gosh. He sure did ruin everything.  Exposed himself as a selfish liar, too.   It’s understandable to feel distraught about possibly missing your family plans.  How dare he?  I would end it also. So disrespectful.  Hope your holiday plans work out safely and you find a new SD quickly",
            "author": "morphine-me",
            "id": "hotayez",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639680523.0,
            "replies": []
        },
        {
            "body": "Task 1; Take best care of yourself \n\nTask 2; Yes. Let the little boy go. What he did was beyond irresponsible. \n\nIf it gives you some comfort this strain is not hitting everyone. So who knows you may not have gotten it after all \n\nMoral : Let that little boy go!\n\nThe sugar community needs to take care of itself. Lord knows how many are endangering lives of others as we speak because of the desperation for sex and companionship or desperation for money.",
            "author": null,
            "id": "hotbs14",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639680844.0,
            "replies": []
        },
        {
            "body": "Finger crossed you stay negative and you get to go home. But yeah fck him.",
            "author": "frpaulstone",
            "id": "hotg45h",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639682553.0,
            "replies": []
        },
        {
            "body": "Wow… that is incredibly selfish of him. I hope you never speak to him again. He doesn’t deserve a word.",
            "author": "doglover_12345",
            "id": "hotkvd7",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639684423.0,
            "replies": []
        },
        {
            "body": "He’s so selfish.",
            "author": "wb19081908",
            "id": "hotz4wi",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639689987.0,
            "replies": []
        },
        {
            "body": "I'm so sorry this happened to you. You need to do whatever's best for your own mental health, but I'd recommend one of 3 options:\n\n1. Ghost him. I'm not a fan of this normally, but in this situation he'd deserve it if it'll bring you healing after this.\n\n2. Send him some type of text (as long or short as you need) explaining how you feel and why what he did was so shitty and that you're ending the relationship. Then, after you've said what you need to, block him.\n\n3. Text him and have a conversation with him.\n\nPersonally, I'd go with 1 or 2, but only you know what's best for you.",
            "author": "baj1597",
            "id": "houdf5l",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639695836.0,
            "replies": []
        },
        {
            "body": "Risks your life. 100% get some funds from this asshole and block him forever. It's the least he could do",
            "author": "1-800-PizzaSlut",
            "id": "houeua1",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639696449.0,
            "replies": []
        },
        {
            "body": "I had a moderate case of covid in November 2021.\n\nI didn't have to be hospitalized but I spent three weeks in bed,coughed my lungs out, and lost 30 pounds.\n\nMy live in sb nursed me through the ordeal (she is a nursing student and no, she did not get inected. She was careful.)\n\nGet this selfish monster out of your life and don't look back.\n\nHe put your life at risk.",
            "author": "LuckyINTJ",
            "id": "hove9ty",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639712353.0,
            "replies": []
        },
        {
            "body": "I hope that you stay healthy!  Indeed it takes a few days post-exposure :(",
            "author": null,
            "id": "hovef36",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639712419.0,
            "replies": []
        },
        {
            "body": "\nHe needs to go point blank period. Ghost him",
            "author": "LunaRachel0709",
            "id": "hovkqe8",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639715338.0,
            "replies": []
        },
        {
            "body": "So this man is capable of lying about his health for his own enjoyment... I hope you're not having unprotected sex with him!",
            "author": "WiseRequirement9277",
            "id": "hovsd3g",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639719416.0,
            "replies": []
        },
        {
            "body": "Terrible news.  I carry a few 10 minute Antigen tests everywhere. $10 in the US.",
            "author": "MasterAcct2020",
            "id": "how22g9",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639725537.0,
            "replies": []
        },
        {
            "body": "Please ask him to pay for all your pcr tests and for a trip back home at another time!",
            "author": "StormY_GS",
            "id": "how49bs",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639727041.0,
            "replies": []
        },
        {
            "body": "This is really terrible . . . I caught COVID last year just before a planned trip with my SB to Key West and had to cancel the entire thing 😭😭😭",
            "author": "Raven_runner",
            "id": "howgmag",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639736612.0,
            "replies": []
        },
        {
            "body": "Before breaking it off wait to see if you make your trip or not. If not he owes you reimbursement for your flight etc so you can book a new one later. Then dump him.",
            "author": "pugglebutt914",
            "id": "howy1wu",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639747524.0,
            "replies": []
        },
        {
            "body": "Covid aside, if you don’t feel well, stay home.  Your partner should understand.",
            "author": "RedHeavyG603",
            "id": "hosg0us",
            "parent_id": "t3_rhrpcj",
            "score": 4,
            "created_utc": 1639668466.0,
            "replies": []
        },
        {
            "body": "In general, I think people like this deserve the Herman Cain Award.",
            "author": "captcreamfiller",
            "id": "hotfa7i",
            "parent_id": "t3_rhrpcj",
            "score": 3,
            "created_utc": 1639682224.0,
            "replies": []
        },
        {
            "body": "That's pretty shit. Hopefully you've been double jabbed and won't get it. Corinthia - nice, I can see why he might not have wanted to cancel.",
            "author": "Batman1628",
            "id": "hosazlp",
            "parent_id": "t3_rhrpcj",
            "score": 3,
            "created_utc": 1639666364.0,
            "replies": [
                {
                    "body": "I am thank goodness and I recently had my booster..but I also know so many people that have still caught it regardless of vaccine status.   \nIt is a gorgeous hotel but no beautiful room is worth throwing away your relationship for.",
                    "author": "Dublinliberty",
                    "id": "hoscc3v",
                    "parent_id": "t1_hosazlp",
                    "score": 11,
                    "created_utc": 1639666936.0,
                    "replies": [
                        {
                            "body": "After the 3rd shot has a chance to take effect you have a 75% chance of not contracting  the new Omicron variant.  It's well over 90% chance for the delta variant which is still the majority one in the states at least for a week or two.  Omicron is what's taking over in London right now but delta is still present.  I am sorry for the position this puts you in and for what a selfish idiot your likely ex-SD was.  Fingers crossed you will remain negative.",
                            "author": "soicansaywhatiwant",
                            "id": "hosiniq",
                            "parent_id": "t1_hoscc3v",
                            "score": 2,
                            "created_utc": 1639669525.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don't disagree with most of the comments about his selfish behavior. My suggestion for you will be to see how your results stay, hopefully you will be negative and will be able to go home and enjoy Christmas with family. When you get back after the holidays, with the time that has elapsed and perspectve, you can decide to give him the full irish treatment, ghost him, or get back with him, with or without giving the full irish treatment. Give it time. I probably will get flamed for saying this but as selfish and callous and stupid as his actions were, at least a small part of his motivation was that he wanted to see you and spend time with you during the holidays.",
            "author": "Monte_Sailor",
            "id": "hotmzak",
            "parent_id": "t3_rhrpcj",
            "score": 0,
            "created_utc": 1639685251.0,
            "replies": []
        },
        {
            "body": "What if that shit was HIV?  This is not a game or a joke, report him to the health department and delete his number",
            "author": "ninadymond",
            "id": "hov3bfd",
            "parent_id": "t3_rhrpcj",
            "score": 2,
            "created_utc": 1639707426.0,
            "replies": []
        },
        {
            "body": "Funny things I have the symptoms last week. I told my sb don’t come cause I’m not feeling well. But I tested negative all along. She insisted but I refuse to let her stay the night and Uber her off. Luckily both of us still negative.",
            "author": "Micnicmy",
            "id": "hosgozd",
            "parent_id": "t3_rhrpcj",
            "score": 1,
            "created_utc": 1639668741.0,
            "replies": [
                {
                    "body": "Once you are with someone unmasked and indoors for 15 minutes who is in the early stages of COVID19  the risk of transmission of COVID19 is really high.  After a few hours together she might as well have stayed the night.  Glad you tested negative.",
                    "author": "soicansaywhatiwant",
                    "id": "hosj9kf",
                    "parent_id": "t1_hosgozd",
                    "score": 6,
                    "created_utc": 1639669768.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He didn’t know he was COVID positive prior to your date did he?",
            "author": "Quirky_Satisfaction6",
            "id": "houmns6",
            "parent_id": "t3_rhrpcj",
            "score": -1,
            "created_utc": 1639699927.0,
            "replies": [
                {
                    "body": "No, he knew he was sick and had symptoms..he lied that it was a cough his daughter brought home from school..he also lied that he'd take an antigen test before the date and that it was negative",
                    "author": "Dublinliberty",
                    "id": "howsmki",
                    "parent_id": "t1_houmns6",
                    "score": 3,
                    "created_utc": 1639744644.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You left him to die...",
            "author": "Montypython2010",
            "id": "hosxf08",
            "parent_id": "t3_rhrpcj",
            "score": -12,
            "created_utc": 1639675283.0,
            "replies": [
                {
                    "body": "This is the most fucked-up comment I have ever seen on Reddit. You must be a troll.",
                    "author": "SouthernGentSD",
                    "id": "hot2oit",
                    "parent_id": "t1_hosxf08",
                    "score": 4,
                    "created_utc": 1639677290.0,
                    "replies": [
                        {
                            "body": " understandably so, she could have realized he could have died of covid  and got him to an hospital.. instead she left him to fend for himself. No matter what he did take $$ of he while she was sugaring for him..at least for humanity sake..  Not that he was a dick for not playing safe just to get laid.",
                            "author": "Montypython2010",
                            "id": "hote9g7",
                            "parent_id": "t1_hot2oit",
                            "score": -2,
                            "created_utc": 1639681819.0,
                            "replies": [
                                {
                                    "body": "Did you know that if you pick up a phone and press 3 numbers, people will come to your residence, help you get on a stretcher, and take you to the hospital?",
                                    "author": "crystaltorta",
                                    "id": "howbbk1",
                                    "parent_id": "t1_hote9g7",
                                    "score": 4,
                                    "created_utc": 1639732463.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hounp8t",
            "parent_id": "t3_rhrpcj",
            "score": -7,
            "created_utc": 1639700402.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hov011k",
                    "parent_id": "t1_hounp8t",
                    "score": 2,
                    "created_utc": 1639705945.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hovhc5l",
                            "parent_id": "t1_hov011k",
                            "score": -2,
                            "created_utc": 1639713720.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "how3jdz",
                                    "parent_id": "t1_hovhc5l",
                                    "score": 0,
                                    "created_utc": 1639726539.0,
                                    "replies": [
                                        {
                                            "body": "Great way to respond to an argument you lost 🤣🤣🤣",
                                            "author": "DeathKnight76o",
                                            "id": "howbr46",
                                            "parent_id": "t1_how3jdz",
                                            "score": 0,
                                            "created_utc": 1639732798.0,
                                            "replies": [
                                                {
                                                    "body": "Using emojis doesn’t make you win an argument\n\nSome of us recognize there’s no point on wasting energy on someone with their head stuck so incredibly far up their ass.",
                                                    "author": "crystaltorta",
                                                    "id": "howdl5f",
                                                    "parent_id": "t1_howbr46",
                                                    "score": 2,
                                                    "created_utc": 1639734256.0,
                                                    "replies": [
                                                        {
                                                            "body": "Nice way to deflect. Doesnt change the facts. And great point. I should stop wasting my energy on you 😂",
                                                            "author": "DeathKnight76o",
                                                            "id": "howh5lm",
                                                            "parent_id": "t1_howdl5f",
                                                            "score": 0,
                                                            "created_utc": 1639737026.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Did you miss the part where 40% of people have long-Covid or are you just willfully ignorant",
                                    "author": "crystaltorta",
                                    "id": "howb0nb",
                                    "parent_id": "t1_hovhc5l",
                                    "score": 0,
                                    "created_utc": 1639732222.0,
                                    "replies": [
                                        {
                                            "body": "Did you miss the part where they have a vague definition of “long covid” varies? Or how about the fact that “long covid” isnt permanent? Or are you willfully ignorant? 🤣🤣🤣",
                                            "author": "DeathKnight76o",
                                            "id": "howca4n",
                                            "parent_id": "t1_howb0nb",
                                            "score": 1,
                                            "created_utc": 1639733219.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">youre crying around for no reason\n\nThat might all be true. But that wasn't the point.\n\nThe point was the lying, and when positive testing not being able to fly to her family for Christmas.\n\nPlus; OP could have undiscovered preexisting conditions too. Everyone can. \n\nSo she is 'crying' for a lot of reasons!",
                    "author": "A-touchofreality",
                    "id": "hoyxecb",
                    "parent_id": "t1_hounp8t",
                    "score": 1,
                    "created_utc": 1639776155.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hp0sjw3",
                            "parent_id": "t1_hoyxecb",
                            "score": 1,
                            "created_utc": 1639809504.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hp17ure",
                                    "parent_id": "t1_hp0sjw3",
                                    "score": 1,
                                    "created_utc": 1639822140.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hp18597",
                                            "parent_id": "t1_hp17ure",
                                            "score": 1,
                                            "created_utc": 1639822385.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "hp1b7yv",
                                                    "parent_id": "t1_hp18597",
                                                    "score": 1,
                                                    "created_utc": 1639825015.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry to hear that.\n\nI had \"the virus\", and it's completely preventable and reversible (don't listen to the fake medical info on CNN or the BBC). If you can't get that censored medication that begins with 'I', then here's what I did to reverse it, with clinical proof:\n\nNAC, Melatonin, Vitamin C, K2, D3, Zinc, and Quercetin\n\nIn your situation, this protocol will lower your risk of it turning into an active infection.\n\nFor those who know how to read \\*actual\\* medical science, see here (hundreds of studies): c19vitaminc dot com",
            "author": "Nomad_Bill",
            "id": "hosrjxm",
            "parent_id": "t3_rhrpcj",
            "score": -18,
            "created_utc": 1639673032.0,
            "replies": [
                {
                    "body": "Wow. An honest to goddess anti-science, conspiracy-theorist asshole right here in SLF.",
                    "author": "SouthernGentSD",
                    "id": "hot31du",
                    "parent_id": "t1_hosrjxm",
                    "score": 4,
                    "created_utc": 1639677428.0,
                    "replies": [
                        {
                            "body": "Real medical science says otherwise, and isn't a \"conspiracy theory\". See here (hundreds of studies):\n\nc19vitaminc dot com\n\n(your post was reported to admins for verbal abuse by the way)",
                            "author": "Nomad_Bill",
                            "id": "hot5454",
                            "parent_id": "t1_hot31du",
                            "score": -9,
                            "created_utc": 1639678239.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is where I have to mention that he's in far more danger from it than you are. If he survives...and the odds are high if he was vaccinated...then why wouldnt you continue the relationship? \n\nFinding an SD who is financially capable and willing to go long term is tough. A lot tougher than forgiving a moment of selfishness. \n\nPersonally as a guy who had covid almost two years ago now, I have never worried about it since. Surviving a bad encounter with it when there was no vaccine and the entire medical advice amounted to stay home and take sudafed until you are almost dead then come to the hospital where we will kill you.....means There isnt much left to worry about unless there is a deadly mutation that my immune system cannot recognize or I develop a more serious comorbidity than being middle aged and somewhat fat. \n\nI understand it's a big deal when there are rules that effect your travel etc....but Where I live we have few mandatory rules left....and the ones that remain no one pays attention to unless it's getting a test to see a concert. Im financially capable of avoiding any business or agency that wants to boss me around. So take my comment in context. \n\nThe SD crowd of older men are at the highest risk for death from covid of anyone. And that realization can make them make poor choices. \n\nIt's Christmas, maybe forgive and forget.",
            "author": "squareC1999",
            "id": "hot64qq",
            "parent_id": "t3_rhrpcj",
            "score": -13,
            "created_utc": 1639678635.0,
            "replies": [
                {
                    "body": "Nope. Completely disagree. The complete disregard of her feelings, not caring that she might not see her family, and not knowing if she had any additional factors that make her more vulnerable are each a HUGE red flag, and together would lead me to end the relationship. How can she trust him again about anything if he so easily lied (multiple times)?????",
                    "author": "baj1597",
                    "id": "houbofy",
                    "parent_id": "t1_hot64qq",
                    "score": 7,
                    "created_utc": 1639695094.0,
                    "replies": [
                        {
                            "body": "Lots of emotional issues there, which sometimes doesnt exist in SR. \n\nIt would be a 1 in a million chance that she had a serious comorbidity risk of death at her age and assumed HW ratio. \n\nDuring 2020 Billions of people continued to work because they did the basic risk equation and decided to carry on. In 2021 you have ten different vaccine and prophylactic options to address risk. If you are responsible then you dont need to load your emotional baggage on other peoples backs over Covid. \n\nNaturally if she wanted 100% guarantee of no exposure for 2 weeks before travelling it was her option to self isolate. She met for a date, and got exposed. He could have just as easily been asymptomatic.",
                            "author": "squareC1999",
                            "id": "hoxlht1",
                            "parent_id": "t1_houbofy",
                            "score": 1,
                            "created_utc": 1639757499.0,
                            "replies": [
                                {
                                    "body": "You get to decide how much risk you take on in regards to covid. That's your choice. OP's SD took away her choice when he assured her that it was just a cough and that he tested negative twice. Plus, it seems like her SD knew that she wouldn't want to meet if he possibly had covid, otherwise why would he lie about getting tested?!? There's no excuses for what he did.\n\nThe more and more I think about it, the more similarities I see between this and someone who lies about getting an std test and has symptoms of an std... Sure, most STIs are curable and the ones that aren't have more and more meds for long term management, but still no one wants one and they can have long term effects. \n\nIn both cases, the person would be a major asshole, but I can't imagine there'd be people on here defending someone who lied about an std test and knowingly exposed their partner.",
                                    "author": "baj1597",
                                    "id": "hoz0mtf",
                                    "parent_id": "t1_hoxlht1",
                                    "score": 2,
                                    "created_utc": 1639777467.0,
                                    "replies": [
                                        {
                                            "body": "Covid is an aerosol coronavirus which often presents with no symptoms and the early symptoms are identical to a cold or flu.\n\nThe only way to guarantee you arent exposed is to stay isolated. Naturally thats an obscene imposition on anyones life so it's necessary....when your government limits your rights based on covid....to take extreme or obscene measures to avoid exposure.\n\n(as an aside I can recommend all sorts of industrial grade respirators that would make you nearly immune to Covid exposure in the wild, but who wants to wear a Storm Trooper mask all day long if they arent working with dangerous materials?)\n\nMy point is only that finding an SD who is genuine and can afford to keep you in luxury is hard enough....if you start applying political and pandemic filters to the relationship...you are back to shopping in an ever shrinking market. Maybe you forgive and forget?\n\n&#x200B;\n\nAlso, sorry for the delay in answering, I dont use this acct often.",
                                            "author": "squareC1999",
                                            "id": "hpe89ng",
                                            "parent_id": "t1_hoz0mtf",
                                            "score": 1,
                                            "created_utc": 1640067215.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> A lot tougher than forgiving a moment of selfishness.\n\nShe'll never be able to trust him again, as he's demonstrated the willingness to lie in order to be selfish, and put OP at physical risk as well as put her at logistical risk.",
                    "author": "sexytimeinseattle",
                    "id": "hou37yb",
                    "parent_id": "t1_hot64qq",
                    "score": 3,
                    "created_utc": 1639691601.0,
                    "replies": [
                        {
                            "body": "Her zero risk plan would have been to avoid dates and exposure for 2 weeks prior. She went on a date. He could have been asymptomatic and still exposed her just by meeting. You can either be personally responsible or not in this lifestyle, because so much of it is built on lies anyway.",
                            "author": "squareC1999",
                            "id": "hoxls0a",
                            "parent_id": "t1_hou37yb",
                            "score": 1,
                            "created_utc": 1639757607.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dump his sorry ass ASAP.",
            "author": "TexTH",
            "id": "houps37",
            "parent_id": "t3_rhrpcj",
            "score": 1,
            "created_utc": 1639701356.0,
            "replies": []
        },
        {
            "body": "Did he lie about his STDS too? I wouldn’t be surprised",
            "author": "ninadymond",
            "id": "hov2h5a",
            "parent_id": "t3_rhrpcj",
            "score": 1,
            "created_utc": 1639707054.0,
            "replies": []
        },
        {
            "body": "He put your life at risk, he cares nothing about you",
            "author": "ninadymond",
            "id": "hov2rcr",
            "parent_id": "t3_rhrpcj",
            "score": 1,
            "created_utc": 1639707177.0,
            "replies": []
        },
        {
            "body": "What a selfish asshole. I'm so sorry, I hope you made it clear and you'll keep testing negative. \n\nI wouldn't have stayed though. I would've left and told him to give me a clear negative test result before we saw each other again. It doesn't matter how intimate we are with people, it puts your life at risk and your ability to see your family. Shame on him. \n\nI'm working with the results of covid deaths every day and people are still so infuriating. They refuse to take it seriously. My city rates are jumping and everyone i know is basically in quarantine because of possible exposures. I'm so tired",
            "author": "oneangstybiscuit",
            "id": "hov5egi",
            "parent_id": "t3_rhrpcj",
            "score": 1,
            "created_utc": 1639708363.0,
            "replies": []
        },
        {
            "body": "GHOST HIM! he lied knowing that 1.) it could put your family visit in jeopardy and 2.) it could put YOUR HEALTH in jeopardy.  he didn't think about anything except getting his beak wet. this person doesn't deserve any kindness or closure from you.",
            "author": "jinjinb",
            "id": "hova9a9",
            "parent_id": "t3_rhrpcj",
            "score": 1,
            "created_utc": 1639710548.0,
            "replies": []
        },
        {
            "body": "Thank you..I have all limbs I could possibly cross crossed!",
            "author": "Dublinliberty",
            "id": "hoscn6o",
            "parent_id": "t1_hosbypp",
            "score": 29,
            "created_utc": 1639667064.0,
            "replies": []
        },
        {
            "body": "And not to be alarmist either but the potential lingering, possibly lifelong health effects after getting and recovering from Covid are really what would push me into never seeing this man again territory. The fact that OP is young and vaccinated and pretty much certain to recover is not the only variable in the equation here.\n\nThank goodness OP is vaccinated.",
            "author": "SBerryTrifle",
            "id": "hotg2d3",
            "parent_id": "t1_hosjw6o",
            "score": 28,
            "created_utc": 1639682533.0,
            "replies": [
                {
                    "body": "Exactly that. He’s perfectly willing to your health and life at risk. There are many other potential situations where he could risk your health for selfish reasons as well…. think potential STD exposure etc Sorry to say but he was not considering your well being at all. He knew he had it, he just didn’t get the rest because then he’d feel less guilty with plausible deniability…. But he knew. Leave him.\nI also don’t want CoVid, esp not long covid. I’m young and vaccinated and most likely wouldn’t die but people forget there’s a whole mess of other things, potentially long lasting or even permanent, as you said, that fall in between “dead” and “not dead”.\nAnd also… her Christmas!! 😭😭😭😭",
                    "author": "WestCoastCompanion",
                    "id": "hotghb0",
                    "parent_id": "t1_hotg2d3",
                    "score": 20,
                    "created_utc": 1639682696.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wont deny it..I'm incredibly tempted to release my full redhead Irish temper on him..",
            "author": "Dublinliberty",
            "id": "hosizu6",
            "parent_id": "t1_hose7ml",
            "score": 45,
            "created_utc": 1639669660.0,
            "replies": [
                {
                    "body": "I think you should give him both barrels and then ghost.  It might make you feel a little better. I hope you can get home.  He doesn’t deserve you.  Look at the efforts you put in that night. He is risking your trip but more importantly your life.  If my SB did that it would definitely be over. The SR is based on some level of trust and he doesn’t deserve yours ever.",
                    "author": "Ruralgrumpy1",
                    "id": "hot95qm",
                    "parent_id": "t1_hosizu6",
                    "score": 23,
                    "created_utc": 1639679827.0,
                    "replies": []
                },
                {
                    "body": "I'm surprised you haven't. I would be livid.",
                    "author": "AnSteall",
                    "id": "houf130",
                    "parent_id": "t1_hosizu6",
                    "score": 6,
                    "created_utc": 1639696531.0,
                    "replies": []
                },
                {
                    "body": "Do iiiit",
                    "author": "oneangstybiscuit",
                    "id": "hov5fev",
                    "parent_id": "t1_hosizu6",
                    "score": 2,
                    "created_utc": 1639708376.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you, he has sent another message saying he know he deserves the silent treatment and to let him know if I need anything etc..   \nHe's double vaxxed so I think he'll be sick but shall recover, to be honest I was so wrapped up in my own head I didn't even think about the hotel..I will call them now as I don't trust him too.",
            "author": "Dublinliberty",
            "id": "hosmdmg",
            "parent_id": "t1_hoslb2z",
            "score": 20,
            "created_utc": 1639671007.0,
            "replies": [
                {
                    "body": "Tell him you need an extra big Christmas bonus and then ghost him",
                    "author": "Starberrybb",
                    "id": "hosp3bb",
                    "parent_id": "t1_hosmdmg",
                    "score": 20,
                    "created_utc": 1639672075.0,
                    "replies": []
                },
                {
                    "body": ">He's double vaxxed\n\nAre you sure he's double vaxxed? Or is that just something he told you? \n\nIt's of course very possible for a fully-vaccinated person to have a lot of bad COVID symptoms, but...idk. I guess you'll find out how it goes for him. I'm so sorry you got put into this.",
                    "author": "emptyoverflow",
                    "id": "hot209d",
                    "parent_id": "t1_hosmdmg",
                    "score": 14,
                    "created_utc": 1639677029.0,
                    "replies": [
                        {
                            "body": "Breakthrough cases of vaccinated people are not uncommon but usually their case is not very severe.",
                            "author": "SouthernGentSD",
                            "id": "hot3byl",
                            "parent_id": "t1_hot209d",
                            "score": 11,
                            "created_utc": 1639677540.0,
                            "replies": [
                                {
                                    "body": "Yep that's what I was thinking. Eg he could totally get it but it sounds like he was coughing up a lung.",
                                    "author": "emptyoverflow",
                                    "id": "hot4ncd",
                                    "parent_id": "t1_hot3byl",
                                    "score": 6,
                                    "created_utc": 1639678058.0,
                                    "replies": []
                                },
                                {
                                    "body": "I’m young and very healthy - had a breakthrough case and it was *awful*. I wasn’t hospitalized but I wouldn’t have been able to hang out comfortably during something like this Christmas celebration hotel-stay he planned. Hopefully for OP’s sake he was double vaxxed and it just hit him hard. \n\nFor what it’s worth (OP, if you see this) my friend was with me the entire time I could’ve caught my case of Covid - I even sneezed around him a TON when my symptoms first started - and he never got any symptoms or tested positive. It is possible that you’ll test negative and remain Covid-free despite being in close quarters! Fingers crossed!",
                                    "author": "softlytrampled",
                                    "id": "hovbefx",
                                    "parent_id": "t1_hot3byl",
                                    "score": 5,
                                    "created_utc": 1639711069.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you..currently I'm undecided between complete ghosting or go full Irish on him and release the redhead temper.",
            "author": "Dublinliberty",
            "id": "hosieq1",
            "parent_id": "t1_hosgezw",
            "score": 11,
            "created_utc": 1639669428.0,
            "replies": [
                {
                    "body": "Release the temper lol",
                    "author": "Cdnsugarr",
                    "id": "hoskdro",
                    "parent_id": "t1_hosieq1",
                    "score": 10,
                    "created_utc": 1639670213.0,
                    "replies": []
                },
                {
                    "body": "As a fellow Irish lady, I vote for going full Irish on him.  He'll certainly learn his lesson from it! 😉",
                    "author": "lithany1066",
                    "id": "hosl9xz",
                    "parent_id": "t1_hosieq1",
                    "score": 9,
                    "created_utc": 1639670571.0,
                    "replies": [
                        {
                            "body": "As an American, I don't know what full Irish means but now I want to know!",
                            "author": "emptyoverflow",
                            "id": "hot26n6",
                            "parent_id": "t1_hosl9xz",
                            "score": 3,
                            "created_utc": 1639677098.0,
                            "replies": [
                                {
                                    "body": "Irish women are very well known for their tempers when pushed.  We have barbed tongues and know exactly how to use them, but not in a way a guy would find pleasurable 🤣 ....unless that's his kink 😉",
                                    "author": "lithany1066",
                                    "id": "houpxlb",
                                    "parent_id": "t1_hot26n6",
                                    "score": 1,
                                    "created_utc": 1639701425.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Release the Kraken!",
                    "author": "pointe_d_toes",
                    "id": "hosmqg6",
                    "parent_id": "t1_hosieq1",
                    "score": 2,
                    "created_utc": 1639671146.0,
                    "replies": []
                },
                {
                    "body": "Burn the bridge after you've torn him a new one. I'm so sorry he did this to you sis 🥺",
                    "author": null,
                    "id": "hosxawl",
                    "parent_id": "t1_hosieq1",
                    "score": 4,
                    "created_utc": 1639675241.0,
                    "replies": []
                },
                {
                    "body": "OP, what did you end up doing?",
                    "author": "emptyoverflow",
                    "id": "hqdlyee",
                    "parent_id": "t1_hosieq1",
                    "score": 1,
                    "created_utc": 1640756755.0,
                    "replies": [
                        {
                            "body": "I did get to Ireland (thankfully) and have asked him for some space to enjoy the holidays and that we would speak again in the New Year. The relationship is over, I just did not want to have that conversation while he's ill.",
                            "author": "Dublinliberty",
                            "id": "hqfa64t",
                            "parent_id": "t1_hqdlyee",
                            "score": 1,
                            "created_utc": 1640794658.0,
                            "replies": [
                                {
                                    "body": "So, no full Irish until the new year?",
                                    "author": "emptyoverflow",
                                    "id": "hqinr8h",
                                    "parent_id": "t1_hqfa64t",
                                    "score": 1,
                                    "created_utc": 1640846856.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What the fuck? Why would someone show up to a date with COVID. People are seriously wack out there.",
            "author": "Starberrybb",
            "id": "hosovgf",
            "parent_id": "t1_hos99rh",
            "score": 9,
            "created_utc": 1639671988.0,
            "replies": [
                {
                    "body": "I really do not know why she showed up. It was just a lunch date.",
                    "author": "CenTexFunGuy",
                    "id": "hotcxaq",
                    "parent_id": "t1_hosovgf",
                    "score": 1,
                    "created_utc": 1639681294.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I asked for some Charlotte Tilbury creams and make up..I haven't even opened the boxes..they are sitting in my spare room.",
            "author": "Dublinliberty",
            "id": "howsfhe",
            "parent_id": "t1_hovw17c",
            "score": 2,
            "created_utc": 1639744535.0,
            "replies": []
        },
        {
            "body": "I am thank goodness and I recently had my booster..but I also know so many people that have still caught it regardless of vaccine status.   \nIt is a gorgeous hotel but no beautiful room is worth throwing away your relationship for.",
            "author": "Dublinliberty",
            "id": "hoscc3v",
            "parent_id": "t1_hosazlp",
            "score": 11,
            "created_utc": 1639666936.0,
            "replies": [
                {
                    "body": "After the 3rd shot has a chance to take effect you have a 75% chance of not contracting  the new Omicron variant.  It's well over 90% chance for the delta variant which is still the majority one in the states at least for a week or two.  Omicron is what's taking over in London right now but delta is still present.  I am sorry for the position this puts you in and for what a selfish idiot your likely ex-SD was.  Fingers crossed you will remain negative.",
                    "author": "soicansaywhatiwant",
                    "id": "hosiniq",
                    "parent_id": "t1_hoscc3v",
                    "score": 2,
                    "created_utc": 1639669525.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Once you are with someone unmasked and indoors for 15 minutes who is in the early stages of COVID19  the risk of transmission of COVID19 is really high.  After a few hours together she might as well have stayed the night.  Glad you tested negative.",
            "author": "soicansaywhatiwant",
            "id": "hosj9kf",
            "parent_id": "t1_hosgozd",
            "score": 6,
            "created_utc": 1639669768.0,
            "replies": []
        },
        {
            "body": "No, he knew he was sick and had symptoms..he lied that it was a cough his daughter brought home from school..he also lied that he'd take an antigen test before the date and that it was negative",
            "author": "Dublinliberty",
            "id": "howsmki",
            "parent_id": "t1_houmns6",
            "score": 3,
            "created_utc": 1639744644.0,
            "replies": []
        },
        {
            "body": "This is the most fucked-up comment I have ever seen on Reddit. You must be a troll.",
            "author": "SouthernGentSD",
            "id": "hot2oit",
            "parent_id": "t1_hosxf08",
            "score": 4,
            "created_utc": 1639677290.0,
            "replies": [
                {
                    "body": " understandably so, she could have realized he could have died of covid  and got him to an hospital.. instead she left him to fend for himself. No matter what he did take $$ of he while she was sugaring for him..at least for humanity sake..  Not that he was a dick for not playing safe just to get laid.",
                    "author": "Montypython2010",
                    "id": "hote9g7",
                    "parent_id": "t1_hot2oit",
                    "score": -2,
                    "created_utc": 1639681819.0,
                    "replies": [
                        {
                            "body": "Did you know that if you pick up a phone and press 3 numbers, people will come to your residence, help you get on a stretcher, and take you to the hospital?",
                            "author": "crystaltorta",
                            "id": "howbbk1",
                            "parent_id": "t1_hote9g7",
                            "score": 4,
                            "created_utc": 1639732463.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hov011k",
            "parent_id": "t1_hounp8t",
            "score": 2,
            "created_utc": 1639705945.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hovhc5l",
                    "parent_id": "t1_hov011k",
                    "score": -2,
                    "created_utc": 1639713720.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "how3jdz",
                            "parent_id": "t1_hovhc5l",
                            "score": 0,
                            "created_utc": 1639726539.0,
                            "replies": [
                                {
                                    "body": "Great way to respond to an argument you lost 🤣🤣🤣",
                                    "author": "DeathKnight76o",
                                    "id": "howbr46",
                                    "parent_id": "t1_how3jdz",
                                    "score": 0,
                                    "created_utc": 1639732798.0,
                                    "replies": [
                                        {
                                            "body": "Using emojis doesn’t make you win an argument\n\nSome of us recognize there’s no point on wasting energy on someone with their head stuck so incredibly far up their ass.",
                                            "author": "crystaltorta",
                                            "id": "howdl5f",
                                            "parent_id": "t1_howbr46",
                                            "score": 2,
                                            "created_utc": 1639734256.0,
                                            "replies": [
                                                {
                                                    "body": "Nice way to deflect. Doesnt change the facts. And great point. I should stop wasting my energy on you 😂",
                                                    "author": "DeathKnight76o",
                                                    "id": "howh5lm",
                                                    "parent_id": "t1_howdl5f",
                                                    "score": 0,
                                                    "created_utc": 1639737026.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Did you miss the part where 40% of people have long-Covid or are you just willfully ignorant",
                            "author": "crystaltorta",
                            "id": "howb0nb",
                            "parent_id": "t1_hovhc5l",
                            "score": 0,
                            "created_utc": 1639732222.0,
                            "replies": [
                                {
                                    "body": "Did you miss the part where they have a vague definition of “long covid” varies? Or how about the fact that “long covid” isnt permanent? Or are you willfully ignorant? 🤣🤣🤣",
                                    "author": "DeathKnight76o",
                                    "id": "howca4n",
                                    "parent_id": "t1_howb0nb",
                                    "score": 1,
                                    "created_utc": 1639733219.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">youre crying around for no reason\n\nThat might all be true. But that wasn't the point.\n\nThe point was the lying, and when positive testing not being able to fly to her family for Christmas.\n\nPlus; OP could have undiscovered preexisting conditions too. Everyone can. \n\nSo she is 'crying' for a lot of reasons!",
            "author": "A-touchofreality",
            "id": "hoyxecb",
            "parent_id": "t1_hounp8t",
            "score": 1,
            "created_utc": 1639776155.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hp0sjw3",
                    "parent_id": "t1_hoyxecb",
                    "score": 1,
                    "created_utc": 1639809504.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hp17ure",
                            "parent_id": "t1_hp0sjw3",
                            "score": 1,
                            "created_utc": 1639822140.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hp18597",
                                    "parent_id": "t1_hp17ure",
                                    "score": 1,
                                    "created_utc": 1639822385.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hp1b7yv",
                                            "parent_id": "t1_hp18597",
                                            "score": 1,
                                            "created_utc": 1639825015.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow. An honest to goddess anti-science, conspiracy-theorist asshole right here in SLF.",
            "author": "SouthernGentSD",
            "id": "hot31du",
            "parent_id": "t1_hosrjxm",
            "score": 4,
            "created_utc": 1639677428.0,
            "replies": [
                {
                    "body": "Real medical science says otherwise, and isn't a \"conspiracy theory\". See here (hundreds of studies):\n\nc19vitaminc dot com\n\n(your post was reported to admins for verbal abuse by the way)",
                    "author": "Nomad_Bill",
                    "id": "hot5454",
                    "parent_id": "t1_hot31du",
                    "score": -9,
                    "created_utc": 1639678239.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nope. Completely disagree. The complete disregard of her feelings, not caring that she might not see her family, and not knowing if she had any additional factors that make her more vulnerable are each a HUGE red flag, and together would lead me to end the relationship. How can she trust him again about anything if he so easily lied (multiple times)?????",
            "author": "baj1597",
            "id": "houbofy",
            "parent_id": "t1_hot64qq",
            "score": 7,
            "created_utc": 1639695094.0,
            "replies": [
                {
                    "body": "Lots of emotional issues there, which sometimes doesnt exist in SR. \n\nIt would be a 1 in a million chance that she had a serious comorbidity risk of death at her age and assumed HW ratio. \n\nDuring 2020 Billions of people continued to work because they did the basic risk equation and decided to carry on. In 2021 you have ten different vaccine and prophylactic options to address risk. If you are responsible then you dont need to load your emotional baggage on other peoples backs over Covid. \n\nNaturally if she wanted 100% guarantee of no exposure for 2 weeks before travelling it was her option to self isolate. She met for a date, and got exposed. He could have just as easily been asymptomatic.",
                    "author": "squareC1999",
                    "id": "hoxlht1",
                    "parent_id": "t1_houbofy",
                    "score": 1,
                    "created_utc": 1639757499.0,
                    "replies": [
                        {
                            "body": "You get to decide how much risk you take on in regards to covid. That's your choice. OP's SD took away her choice when he assured her that it was just a cough and that he tested negative twice. Plus, it seems like her SD knew that she wouldn't want to meet if he possibly had covid, otherwise why would he lie about getting tested?!? There's no excuses for what he did.\n\nThe more and more I think about it, the more similarities I see between this and someone who lies about getting an std test and has symptoms of an std... Sure, most STIs are curable and the ones that aren't have more and more meds for long term management, but still no one wants one and they can have long term effects. \n\nIn both cases, the person would be a major asshole, but I can't imagine there'd be people on here defending someone who lied about an std test and knowingly exposed their partner.",
                            "author": "baj1597",
                            "id": "hoz0mtf",
                            "parent_id": "t1_hoxlht1",
                            "score": 2,
                            "created_utc": 1639777467.0,
                            "replies": [
                                {
                                    "body": "Covid is an aerosol coronavirus which often presents with no symptoms and the early symptoms are identical to a cold or flu.\n\nThe only way to guarantee you arent exposed is to stay isolated. Naturally thats an obscene imposition on anyones life so it's necessary....when your government limits your rights based on covid....to take extreme or obscene measures to avoid exposure.\n\n(as an aside I can recommend all sorts of industrial grade respirators that would make you nearly immune to Covid exposure in the wild, but who wants to wear a Storm Trooper mask all day long if they arent working with dangerous materials?)\n\nMy point is only that finding an SD who is genuine and can afford to keep you in luxury is hard enough....if you start applying political and pandemic filters to the relationship...you are back to shopping in an ever shrinking market. Maybe you forgive and forget?\n\n&#x200B;\n\nAlso, sorry for the delay in answering, I dont use this acct often.",
                                    "author": "squareC1999",
                                    "id": "hpe89ng",
                                    "parent_id": "t1_hoz0mtf",
                                    "score": 1,
                                    "created_utc": 1640067215.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> A lot tougher than forgiving a moment of selfishness.\n\nShe'll never be able to trust him again, as he's demonstrated the willingness to lie in order to be selfish, and put OP at physical risk as well as put her at logistical risk.",
            "author": "sexytimeinseattle",
            "id": "hou37yb",
            "parent_id": "t1_hot64qq",
            "score": 3,
            "created_utc": 1639691601.0,
            "replies": [
                {
                    "body": "Her zero risk plan would have been to avoid dates and exposure for 2 weeks prior. She went on a date. He could have been asymptomatic and still exposed her just by meeting. You can either be personally responsible or not in this lifestyle, because so much of it is built on lies anyway.",
                    "author": "squareC1999",
                    "id": "hoxls0a",
                    "parent_id": "t1_hou37yb",
                    "score": 1,
                    "created_utc": 1639757607.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly that. He’s perfectly willing to your health and life at risk. There are many other potential situations where he could risk your health for selfish reasons as well…. think potential STD exposure etc Sorry to say but he was not considering your well being at all. He knew he had it, he just didn’t get the rest because then he’d feel less guilty with plausible deniability…. But he knew. Leave him.\nI also don’t want CoVid, esp not long covid. I’m young and vaccinated and most likely wouldn’t die but people forget there’s a whole mess of other things, potentially long lasting or even permanent, as you said, that fall in between “dead” and “not dead”.\nAnd also… her Christmas!! 😭😭😭😭",
            "author": "WestCoastCompanion",
            "id": "hotghb0",
            "parent_id": "t1_hotg2d3",
            "score": 20,
            "created_utc": 1639682696.0,
            "replies": []
        },
        {
            "body": "I think you should give him both barrels and then ghost.  It might make you feel a little better. I hope you can get home.  He doesn’t deserve you.  Look at the efforts you put in that night. He is risking your trip but more importantly your life.  If my SB did that it would definitely be over. The SR is based on some level of trust and he doesn’t deserve yours ever.",
            "author": "Ruralgrumpy1",
            "id": "hot95qm",
            "parent_id": "t1_hosizu6",
            "score": 23,
            "created_utc": 1639679827.0,
            "replies": []
        },
        {
            "body": "I'm surprised you haven't. I would be livid.",
            "author": "AnSteall",
            "id": "houf130",
            "parent_id": "t1_hosizu6",
            "score": 6,
            "created_utc": 1639696531.0,
            "replies": []
        },
        {
            "body": "Do iiiit",
            "author": "oneangstybiscuit",
            "id": "hov5fev",
            "parent_id": "t1_hosizu6",
            "score": 2,
            "created_utc": 1639708376.0,
            "replies": []
        },
        {
            "body": "Tell him you need an extra big Christmas bonus and then ghost him",
            "author": "Starberrybb",
            "id": "hosp3bb",
            "parent_id": "t1_hosmdmg",
            "score": 20,
            "created_utc": 1639672075.0,
            "replies": []
        },
        {
            "body": ">He's double vaxxed\n\nAre you sure he's double vaxxed? Or is that just something he told you? \n\nIt's of course very possible for a fully-vaccinated person to have a lot of bad COVID symptoms, but...idk. I guess you'll find out how it goes for him. I'm so sorry you got put into this.",
            "author": "emptyoverflow",
            "id": "hot209d",
            "parent_id": "t1_hosmdmg",
            "score": 14,
            "created_utc": 1639677029.0,
            "replies": [
                {
                    "body": "Breakthrough cases of vaccinated people are not uncommon but usually their case is not very severe.",
                    "author": "SouthernGentSD",
                    "id": "hot3byl",
                    "parent_id": "t1_hot209d",
                    "score": 11,
                    "created_utc": 1639677540.0,
                    "replies": [
                        {
                            "body": "Yep that's what I was thinking. Eg he could totally get it but it sounds like he was coughing up a lung.",
                            "author": "emptyoverflow",
                            "id": "hot4ncd",
                            "parent_id": "t1_hot3byl",
                            "score": 6,
                            "created_utc": 1639678058.0,
                            "replies": []
                        },
                        {
                            "body": "I’m young and very healthy - had a breakthrough case and it was *awful*. I wasn’t hospitalized but I wouldn’t have been able to hang out comfortably during something like this Christmas celebration hotel-stay he planned. Hopefully for OP’s sake he was double vaxxed and it just hit him hard. \n\nFor what it’s worth (OP, if you see this) my friend was with me the entire time I could’ve caught my case of Covid - I even sneezed around him a TON when my symptoms first started - and he never got any symptoms or tested positive. It is possible that you’ll test negative and remain Covid-free despite being in close quarters! Fingers crossed!",
                            "author": "softlytrampled",
                            "id": "hovbefx",
                            "parent_id": "t1_hot3byl",
                            "score": 5,
                            "created_utc": 1639711069.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Release the temper lol",
            "author": "Cdnsugarr",
            "id": "hoskdro",
            "parent_id": "t1_hosieq1",
            "score": 10,
            "created_utc": 1639670213.0,
            "replies": []
        },
        {
            "body": "As a fellow Irish lady, I vote for going full Irish on him.  He'll certainly learn his lesson from it! 😉",
            "author": "lithany1066",
            "id": "hosl9xz",
            "parent_id": "t1_hosieq1",
            "score": 9,
            "created_utc": 1639670571.0,
            "replies": [
                {
                    "body": "As an American, I don't know what full Irish means but now I want to know!",
                    "author": "emptyoverflow",
                    "id": "hot26n6",
                    "parent_id": "t1_hosl9xz",
                    "score": 3,
                    "created_utc": 1639677098.0,
                    "replies": [
                        {
                            "body": "Irish women are very well known for their tempers when pushed.  We have barbed tongues and know exactly how to use them, but not in a way a guy would find pleasurable 🤣 ....unless that's his kink 😉",
                            "author": "lithany1066",
                            "id": "houpxlb",
                            "parent_id": "t1_hot26n6",
                            "score": 1,
                            "created_utc": 1639701425.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Release the Kraken!",
            "author": "pointe_d_toes",
            "id": "hosmqg6",
            "parent_id": "t1_hosieq1",
            "score": 2,
            "created_utc": 1639671146.0,
            "replies": []
        },
        {
            "body": "Burn the bridge after you've torn him a new one. I'm so sorry he did this to you sis 🥺",
            "author": null,
            "id": "hosxawl",
            "parent_id": "t1_hosieq1",
            "score": 4,
            "created_utc": 1639675241.0,
            "replies": []
        },
        {
            "body": "OP, what did you end up doing?",
            "author": "emptyoverflow",
            "id": "hqdlyee",
            "parent_id": "t1_hosieq1",
            "score": 1,
            "created_utc": 1640756755.0,
            "replies": [
                {
                    "body": "I did get to Ireland (thankfully) and have asked him for some space to enjoy the holidays and that we would speak again in the New Year. The relationship is over, I just did not want to have that conversation while he's ill.",
                    "author": "Dublinliberty",
                    "id": "hqfa64t",
                    "parent_id": "t1_hqdlyee",
                    "score": 1,
                    "created_utc": 1640794658.0,
                    "replies": [
                        {
                            "body": "So, no full Irish until the new year?",
                            "author": "emptyoverflow",
                            "id": "hqinr8h",
                            "parent_id": "t1_hqfa64t",
                            "score": 1,
                            "created_utc": 1640846856.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I really do not know why she showed up. It was just a lunch date.",
            "author": "CenTexFunGuy",
            "id": "hotcxaq",
            "parent_id": "t1_hosovgf",
            "score": 1,
            "created_utc": 1639681294.0,
            "replies": []
        },
        {
            "body": "After the 3rd shot has a chance to take effect you have a 75% chance of not contracting  the new Omicron variant.  It's well over 90% chance for the delta variant which is still the majority one in the states at least for a week or two.  Omicron is what's taking over in London right now but delta is still present.  I am sorry for the position this puts you in and for what a selfish idiot your likely ex-SD was.  Fingers crossed you will remain negative.",
            "author": "soicansaywhatiwant",
            "id": "hosiniq",
            "parent_id": "t1_hoscc3v",
            "score": 2,
            "created_utc": 1639669525.0,
            "replies": []
        },
        {
            "body": " understandably so, she could have realized he could have died of covid  and got him to an hospital.. instead she left him to fend for himself. No matter what he did take $$ of he while she was sugaring for him..at least for humanity sake..  Not that he was a dick for not playing safe just to get laid.",
            "author": "Montypython2010",
            "id": "hote9g7",
            "parent_id": "t1_hot2oit",
            "score": -2,
            "created_utc": 1639681819.0,
            "replies": [
                {
                    "body": "Did you know that if you pick up a phone and press 3 numbers, people will come to your residence, help you get on a stretcher, and take you to the hospital?",
                    "author": "crystaltorta",
                    "id": "howbbk1",
                    "parent_id": "t1_hote9g7",
                    "score": 4,
                    "created_utc": 1639732463.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hovhc5l",
            "parent_id": "t1_hov011k",
            "score": -2,
            "created_utc": 1639713720.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "how3jdz",
                    "parent_id": "t1_hovhc5l",
                    "score": 0,
                    "created_utc": 1639726539.0,
                    "replies": [
                        {
                            "body": "Great way to respond to an argument you lost 🤣🤣🤣",
                            "author": "DeathKnight76o",
                            "id": "howbr46",
                            "parent_id": "t1_how3jdz",
                            "score": 0,
                            "created_utc": 1639732798.0,
                            "replies": [
                                {
                                    "body": "Using emojis doesn’t make you win an argument\n\nSome of us recognize there’s no point on wasting energy on someone with their head stuck so incredibly far up their ass.",
                                    "author": "crystaltorta",
                                    "id": "howdl5f",
                                    "parent_id": "t1_howbr46",
                                    "score": 2,
                                    "created_utc": 1639734256.0,
                                    "replies": [
                                        {
                                            "body": "Nice way to deflect. Doesnt change the facts. And great point. I should stop wasting my energy on you 😂",
                                            "author": "DeathKnight76o",
                                            "id": "howh5lm",
                                            "parent_id": "t1_howdl5f",
                                            "score": 0,
                                            "created_utc": 1639737026.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Did you miss the part where 40% of people have long-Covid or are you just willfully ignorant",
                    "author": "crystaltorta",
                    "id": "howb0nb",
                    "parent_id": "t1_hovhc5l",
                    "score": 0,
                    "created_utc": 1639732222.0,
                    "replies": [
                        {
                            "body": "Did you miss the part where they have a vague definition of “long covid” varies? Or how about the fact that “long covid” isnt permanent? Or are you willfully ignorant? 🤣🤣🤣",
                            "author": "DeathKnight76o",
                            "id": "howca4n",
                            "parent_id": "t1_howb0nb",
                            "score": 1,
                            "created_utc": 1639733219.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hp0sjw3",
            "parent_id": "t1_hoyxecb",
            "score": 1,
            "created_utc": 1639809504.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hp17ure",
                    "parent_id": "t1_hp0sjw3",
                    "score": 1,
                    "created_utc": 1639822140.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hp18597",
                            "parent_id": "t1_hp17ure",
                            "score": 1,
                            "created_utc": 1639822385.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hp1b7yv",
                                    "parent_id": "t1_hp18597",
                                    "score": 1,
                                    "created_utc": 1639825015.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Real medical science says otherwise, and isn't a \"conspiracy theory\". See here (hundreds of studies):\n\nc19vitaminc dot com\n\n(your post was reported to admins for verbal abuse by the way)",
            "author": "Nomad_Bill",
            "id": "hot5454",
            "parent_id": "t1_hot31du",
            "score": -9,
            "created_utc": 1639678239.0,
            "replies": []
        },
        {
            "body": "Lots of emotional issues there, which sometimes doesnt exist in SR. \n\nIt would be a 1 in a million chance that she had a serious comorbidity risk of death at her age and assumed HW ratio. \n\nDuring 2020 Billions of people continued to work because they did the basic risk equation and decided to carry on. In 2021 you have ten different vaccine and prophylactic options to address risk. If you are responsible then you dont need to load your emotional baggage on other peoples backs over Covid. \n\nNaturally if she wanted 100% guarantee of no exposure for 2 weeks before travelling it was her option to self isolate. She met for a date, and got exposed. He could have just as easily been asymptomatic.",
            "author": "squareC1999",
            "id": "hoxlht1",
            "parent_id": "t1_houbofy",
            "score": 1,
            "created_utc": 1639757499.0,
            "replies": [
                {
                    "body": "You get to decide how much risk you take on in regards to covid. That's your choice. OP's SD took away her choice when he assured her that it was just a cough and that he tested negative twice. Plus, it seems like her SD knew that she wouldn't want to meet if he possibly had covid, otherwise why would he lie about getting tested?!? There's no excuses for what he did.\n\nThe more and more I think about it, the more similarities I see between this and someone who lies about getting an std test and has symptoms of an std... Sure, most STIs are curable and the ones that aren't have more and more meds for long term management, but still no one wants one and they can have long term effects. \n\nIn both cases, the person would be a major asshole, but I can't imagine there'd be people on here defending someone who lied about an std test and knowingly exposed their partner.",
                    "author": "baj1597",
                    "id": "hoz0mtf",
                    "parent_id": "t1_hoxlht1",
                    "score": 2,
                    "created_utc": 1639777467.0,
                    "replies": [
                        {
                            "body": "Covid is an aerosol coronavirus which often presents with no symptoms and the early symptoms are identical to a cold or flu.\n\nThe only way to guarantee you arent exposed is to stay isolated. Naturally thats an obscene imposition on anyones life so it's necessary....when your government limits your rights based on covid....to take extreme or obscene measures to avoid exposure.\n\n(as an aside I can recommend all sorts of industrial grade respirators that would make you nearly immune to Covid exposure in the wild, but who wants to wear a Storm Trooper mask all day long if they arent working with dangerous materials?)\n\nMy point is only that finding an SD who is genuine and can afford to keep you in luxury is hard enough....if you start applying political and pandemic filters to the relationship...you are back to shopping in an ever shrinking market. Maybe you forgive and forget?\n\n&#x200B;\n\nAlso, sorry for the delay in answering, I dont use this acct often.",
                            "author": "squareC1999",
                            "id": "hpe89ng",
                            "parent_id": "t1_hoz0mtf",
                            "score": 1,
                            "created_utc": 1640067215.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Her zero risk plan would have been to avoid dates and exposure for 2 weeks prior. She went on a date. He could have been asymptomatic and still exposed her just by meeting. You can either be personally responsible or not in this lifestyle, because so much of it is built on lies anyway.",
            "author": "squareC1999",
            "id": "hoxls0a",
            "parent_id": "t1_hou37yb",
            "score": 1,
            "created_utc": 1639757607.0,
            "replies": []
        },
        {
            "body": "Breakthrough cases of vaccinated people are not uncommon but usually their case is not very severe.",
            "author": "SouthernGentSD",
            "id": "hot3byl",
            "parent_id": "t1_hot209d",
            "score": 11,
            "created_utc": 1639677540.0,
            "replies": [
                {
                    "body": "Yep that's what I was thinking. Eg he could totally get it but it sounds like he was coughing up a lung.",
                    "author": "emptyoverflow",
                    "id": "hot4ncd",
                    "parent_id": "t1_hot3byl",
                    "score": 6,
                    "created_utc": 1639678058.0,
                    "replies": []
                },
                {
                    "body": "I’m young and very healthy - had a breakthrough case and it was *awful*. I wasn’t hospitalized but I wouldn’t have been able to hang out comfortably during something like this Christmas celebration hotel-stay he planned. Hopefully for OP’s sake he was double vaxxed and it just hit him hard. \n\nFor what it’s worth (OP, if you see this) my friend was with me the entire time I could’ve caught my case of Covid - I even sneezed around him a TON when my symptoms first started - and he never got any symptoms or tested positive. It is possible that you’ll test negative and remain Covid-free despite being in close quarters! Fingers crossed!",
                    "author": "softlytrampled",
                    "id": "hovbefx",
                    "parent_id": "t1_hot3byl",
                    "score": 5,
                    "created_utc": 1639711069.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As an American, I don't know what full Irish means but now I want to know!",
            "author": "emptyoverflow",
            "id": "hot26n6",
            "parent_id": "t1_hosl9xz",
            "score": 3,
            "created_utc": 1639677098.0,
            "replies": [
                {
                    "body": "Irish women are very well known for their tempers when pushed.  We have barbed tongues and know exactly how to use them, but not in a way a guy would find pleasurable 🤣 ....unless that's his kink 😉",
                    "author": "lithany1066",
                    "id": "houpxlb",
                    "parent_id": "t1_hot26n6",
                    "score": 1,
                    "created_utc": 1639701425.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I did get to Ireland (thankfully) and have asked him for some space to enjoy the holidays and that we would speak again in the New Year. The relationship is over, I just did not want to have that conversation while he's ill.",
            "author": "Dublinliberty",
            "id": "hqfa64t",
            "parent_id": "t1_hqdlyee",
            "score": 1,
            "created_utc": 1640794658.0,
            "replies": [
                {
                    "body": "So, no full Irish until the new year?",
                    "author": "emptyoverflow",
                    "id": "hqinr8h",
                    "parent_id": "t1_hqfa64t",
                    "score": 1,
                    "created_utc": 1640846856.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Did you know that if you pick up a phone and press 3 numbers, people will come to your residence, help you get on a stretcher, and take you to the hospital?",
            "author": "crystaltorta",
            "id": "howbbk1",
            "parent_id": "t1_hote9g7",
            "score": 4,
            "created_utc": 1639732463.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "how3jdz",
            "parent_id": "t1_hovhc5l",
            "score": 0,
            "created_utc": 1639726539.0,
            "replies": [
                {
                    "body": "Great way to respond to an argument you lost 🤣🤣🤣",
                    "author": "DeathKnight76o",
                    "id": "howbr46",
                    "parent_id": "t1_how3jdz",
                    "score": 0,
                    "created_utc": 1639732798.0,
                    "replies": [
                        {
                            "body": "Using emojis doesn’t make you win an argument\n\nSome of us recognize there’s no point on wasting energy on someone with their head stuck so incredibly far up their ass.",
                            "author": "crystaltorta",
                            "id": "howdl5f",
                            "parent_id": "t1_howbr46",
                            "score": 2,
                            "created_utc": 1639734256.0,
                            "replies": [
                                {
                                    "body": "Nice way to deflect. Doesnt change the facts. And great point. I should stop wasting my energy on you 😂",
                                    "author": "DeathKnight76o",
                                    "id": "howh5lm",
                                    "parent_id": "t1_howdl5f",
                                    "score": 0,
                                    "created_utc": 1639737026.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did you miss the part where 40% of people have long-Covid or are you just willfully ignorant",
            "author": "crystaltorta",
            "id": "howb0nb",
            "parent_id": "t1_hovhc5l",
            "score": 0,
            "created_utc": 1639732222.0,
            "replies": [
                {
                    "body": "Did you miss the part where they have a vague definition of “long covid” varies? Or how about the fact that “long covid” isnt permanent? Or are you willfully ignorant? 🤣🤣🤣",
                    "author": "DeathKnight76o",
                    "id": "howca4n",
                    "parent_id": "t1_howb0nb",
                    "score": 1,
                    "created_utc": 1639733219.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hp17ure",
            "parent_id": "t1_hp0sjw3",
            "score": 1,
            "created_utc": 1639822140.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hp18597",
                    "parent_id": "t1_hp17ure",
                    "score": 1,
                    "created_utc": 1639822385.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hp1b7yv",
                            "parent_id": "t1_hp18597",
                            "score": 1,
                            "created_utc": 1639825015.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You get to decide how much risk you take on in regards to covid. That's your choice. OP's SD took away her choice when he assured her that it was just a cough and that he tested negative twice. Plus, it seems like her SD knew that she wouldn't want to meet if he possibly had covid, otherwise why would he lie about getting tested?!? There's no excuses for what he did.\n\nThe more and more I think about it, the more similarities I see between this and someone who lies about getting an std test and has symptoms of an std... Sure, most STIs are curable and the ones that aren't have more and more meds for long term management, but still no one wants one and they can have long term effects. \n\nIn both cases, the person would be a major asshole, but I can't imagine there'd be people on here defending someone who lied about an std test and knowingly exposed their partner.",
            "author": "baj1597",
            "id": "hoz0mtf",
            "parent_id": "t1_hoxlht1",
            "score": 2,
            "created_utc": 1639777467.0,
            "replies": [
                {
                    "body": "Covid is an aerosol coronavirus which often presents with no symptoms and the early symptoms are identical to a cold or flu.\n\nThe only way to guarantee you arent exposed is to stay isolated. Naturally thats an obscene imposition on anyones life so it's necessary....when your government limits your rights based on covid....to take extreme or obscene measures to avoid exposure.\n\n(as an aside I can recommend all sorts of industrial grade respirators that would make you nearly immune to Covid exposure in the wild, but who wants to wear a Storm Trooper mask all day long if they arent working with dangerous materials?)\n\nMy point is only that finding an SD who is genuine and can afford to keep you in luxury is hard enough....if you start applying political and pandemic filters to the relationship...you are back to shopping in an ever shrinking market. Maybe you forgive and forget?\n\n&#x200B;\n\nAlso, sorry for the delay in answering, I dont use this acct often.",
                    "author": "squareC1999",
                    "id": "hpe89ng",
                    "parent_id": "t1_hoz0mtf",
                    "score": 1,
                    "created_utc": 1640067215.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep that's what I was thinking. Eg he could totally get it but it sounds like he was coughing up a lung.",
            "author": "emptyoverflow",
            "id": "hot4ncd",
            "parent_id": "t1_hot3byl",
            "score": 6,
            "created_utc": 1639678058.0,
            "replies": []
        },
        {
            "body": "I’m young and very healthy - had a breakthrough case and it was *awful*. I wasn’t hospitalized but I wouldn’t have been able to hang out comfortably during something like this Christmas celebration hotel-stay he planned. Hopefully for OP’s sake he was double vaxxed and it just hit him hard. \n\nFor what it’s worth (OP, if you see this) my friend was with me the entire time I could’ve caught my case of Covid - I even sneezed around him a TON when my symptoms first started - and he never got any symptoms or tested positive. It is possible that you’ll test negative and remain Covid-free despite being in close quarters! Fingers crossed!",
            "author": "softlytrampled",
            "id": "hovbefx",
            "parent_id": "t1_hot3byl",
            "score": 5,
            "created_utc": 1639711069.0,
            "replies": []
        },
        {
            "body": "Irish women are very well known for their tempers when pushed.  We have barbed tongues and know exactly how to use them, but not in a way a guy would find pleasurable 🤣 ....unless that's his kink 😉",
            "author": "lithany1066",
            "id": "houpxlb",
            "parent_id": "t1_hot26n6",
            "score": 1,
            "created_utc": 1639701425.0,
            "replies": []
        },
        {
            "body": "So, no full Irish until the new year?",
            "author": "emptyoverflow",
            "id": "hqinr8h",
            "parent_id": "t1_hqfa64t",
            "score": 1,
            "created_utc": 1640846856.0,
            "replies": []
        },
        {
            "body": "Great way to respond to an argument you lost 🤣🤣🤣",
            "author": "DeathKnight76o",
            "id": "howbr46",
            "parent_id": "t1_how3jdz",
            "score": 0,
            "created_utc": 1639732798.0,
            "replies": [
                {
                    "body": "Using emojis doesn’t make you win an argument\n\nSome of us recognize there’s no point on wasting energy on someone with their head stuck so incredibly far up their ass.",
                    "author": "crystaltorta",
                    "id": "howdl5f",
                    "parent_id": "t1_howbr46",
                    "score": 2,
                    "created_utc": 1639734256.0,
                    "replies": [
                        {
                            "body": "Nice way to deflect. Doesnt change the facts. And great point. I should stop wasting my energy on you 😂",
                            "author": "DeathKnight76o",
                            "id": "howh5lm",
                            "parent_id": "t1_howdl5f",
                            "score": 0,
                            "created_utc": 1639737026.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did you miss the part where they have a vague definition of “long covid” varies? Or how about the fact that “long covid” isnt permanent? Or are you willfully ignorant? 🤣🤣🤣",
            "author": "DeathKnight76o",
            "id": "howca4n",
            "parent_id": "t1_howb0nb",
            "score": 1,
            "created_utc": 1639733219.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hp18597",
            "parent_id": "t1_hp17ure",
            "score": 1,
            "created_utc": 1639822385.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hp1b7yv",
                    "parent_id": "t1_hp18597",
                    "score": 1,
                    "created_utc": 1639825015.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Covid is an aerosol coronavirus which often presents with no symptoms and the early symptoms are identical to a cold or flu.\n\nThe only way to guarantee you arent exposed is to stay isolated. Naturally thats an obscene imposition on anyones life so it's necessary....when your government limits your rights based on covid....to take extreme or obscene measures to avoid exposure.\n\n(as an aside I can recommend all sorts of industrial grade respirators that would make you nearly immune to Covid exposure in the wild, but who wants to wear a Storm Trooper mask all day long if they arent working with dangerous materials?)\n\nMy point is only that finding an SD who is genuine and can afford to keep you in luxury is hard enough....if you start applying political and pandemic filters to the relationship...you are back to shopping in an ever shrinking market. Maybe you forgive and forget?\n\n&#x200B;\n\nAlso, sorry for the delay in answering, I dont use this acct often.",
            "author": "squareC1999",
            "id": "hpe89ng",
            "parent_id": "t1_hoz0mtf",
            "score": 1,
            "created_utc": 1640067215.0,
            "replies": []
        },
        {
            "body": "Using emojis doesn’t make you win an argument\n\nSome of us recognize there’s no point on wasting energy on someone with their head stuck so incredibly far up their ass.",
            "author": "crystaltorta",
            "id": "howdl5f",
            "parent_id": "t1_howbr46",
            "score": 2,
            "created_utc": 1639734256.0,
            "replies": [
                {
                    "body": "Nice way to deflect. Doesnt change the facts. And great point. I should stop wasting my energy on you 😂",
                    "author": "DeathKnight76o",
                    "id": "howh5lm",
                    "parent_id": "t1_howdl5f",
                    "score": 0,
                    "created_utc": 1639737026.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hp1b7yv",
            "parent_id": "t1_hp18597",
            "score": 1,
            "created_utc": 1639825015.0,
            "replies": []
        },
        {
            "body": "Nice way to deflect. Doesnt change the facts. And great point. I should stop wasting my energy on you 😂",
            "author": "DeathKnight76o",
            "id": "howh5lm",
            "parent_id": "t1_howdl5f",
            "score": 0,
            "created_utc": 1639737026.0,
            "replies": []
        }
    ]
}