{
    "title": "Don't fucking work for your SD",
    "post_id": "eryllk",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/eryllk/dont_fucking_work_for_your_sd/",
    "author": "Ineedathrowaway18",
    "body": "I always saw all the warnings here that you shouldn't work for your SD, but I thought I wouldn't fall into the trap. Well, here I am. I knew my SD for about a year before I become his personal assistant, and it worked great. The first few months of me working for him were great, flexible hours, good pay, a fun environment. It was good. \n\nBut being around him all the time started to take a toll on me. We don't have an employee-boss relationship, it started to become a very 1 sided friendship of which he has become more and more reliant on me. It started with calling me multiple times a day, on my days off, to complain and use me as his personal therapist. Then when I said I wanted things to be a bit more professional when I wasn't working, he got mad. Accused me of not caring about him, of not being a good friend, not being there for him when he needed it. \n\nI'm a 19 year old girl. He's a 59 year old man. It is not my job to be his personal therapist, his closest friend, or even anything more than an employee with some benefits. That's how I hoped this would work out. Its gotten to the point where I can't handle it anymore. He's become an emotional black hole in my life. I'm doing well mentally for the first time ever, and he seems to resent that. I swear if I have one more 1am call about him whining that he's sad because of some stupid ass reason only an extremely wealthy semi-retired person could come up with, I'm going to lose it. \n\nI want to quit, but there's no where else hiring at the moment at the wage I am getting, and I need to use him as a reference so we can't end on bad terms. \n\nSo take this as a warning, please sugar babies, don't work for your SD. It may seem great and elusive with all the travel and benefits that come along with it, but the dynamic is destined to fail. Its not worth it. Because suddenly you'll find yourself in a position where your job may be in jeopardy, or you want to quit, but there's no out, and it really really fucking sucks.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/eryllk/dont_fucking_work_for_your_sd/",
    "score": 138,
    "upvote_ratio": 0.95,
    "created_utc": 1579630569.0,
    "num_comments": 42,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "You're the personal assistant, just schedule the meeting and don't tell him it's a therapy session! 😂",
            "author": "falecf4",
            "id": "ff6p4j2",
            "parent_id": "t3_eryllk",
            "score": 123,
            "created_utc": 1579631945.0,
            "replies": [
                {
                    "body": "HAHAHAHA I totally should",
                    "author": "Ineedathrowaway18",
                    "id": "ff6pp8b",
                    "parent_id": "t1_ff6p4j2",
                    "score": 41,
                    "created_utc": 1579632287.0,
                    "replies": []
                },
                {
                    "body": "> it started to become a very 1 sided friendship\n\nThe fundamental question is if your current compensation is fair pay for the work you do plus a reasonable SB allowance considering what he expects.  If the answer to that is yes then you have a relationship issue that may be solvable ,  if no then you have a relationship issue AND an economic issue which is probably unsolvable.  Beyond that is the usual question ,  is this relationship good for your soul and something you will look back on in 20 years and think it was overall a good relationship or something that was bad for your soul . \n\nWhen my former LT   SB did some work for me it was entirely separate from her sugar and worked great.  I tried to pick tasks where the experience would provide her with long term benefits including editing reports. I doubt it would have worked had we been in the office together all day .  \n\nIt was my firm so there were no stockholders being abused,  the sugar portion came out of my funds so there was no tax question  and the sugar relationship started before the working relationship. Most corporations can not afford the associated risks in today's world.",
                    "author": "pinotandsugar",
                    "id": "ff706fs",
                    "parent_id": "t1_ff6p4j2",
                    "score": 15,
                    "created_utc": 1579638483.0,
                    "replies": [
                        {
                            "body": "My current compensation, official salary and allowance are definitely not fair for the work I'm doing. I was hired originally as a personal assistant to do work in the realm of video editing for his company, but at this point, I am doing all of the marketing, web development, video editing, and daily tasks on top of that. My allowance is honestly a joke, but combined with the slight salary increase, it was better than my current job at the time. \n\nThe sugar portion comes out of his own funds, but I think he is abusing the fact that I am around him every single day, and my allowance hasn't increased whatsoever from when we were seeing each other 3 times a month. And on top of that, the emotional effort I am now having to put in is honestly 100 times more than my boyfriend expects from me. \n\nIts really something I don't want to fix at this point. Financially and relationship wise, it is not worth it for me. It's just tricky to leave when nowhere else is hiring at what I am making currently. I should've just stuck with my other job as I was approaching a raise, but the short term raise seemed better than hanging around for a couple more months. I've definitely learned not to mix business and sugaring.",
                            "author": "Ineedathrowaway18",
                            "id": "ff7brqd",
                            "parent_id": "t1_ff706fs",
                            "score": 10,
                            "created_utc": 1579645798.0,
                            "replies": [
                                {
                                    "body": "I think you should treat this like any workplace and ask for a raise commensurate with your increase in responsibilities (ideally for the sugar part, too).  Of course if you're reliant on this income, it might not be worth it to risk rocking the boat if you think he'll react poorly.  Good luck!\n\nEdit: on reading your comments, sounds like an iffy proposition.",
                                    "author": null,
                                    "id": "ff7r7v4",
                                    "parent_id": "t1_ff7brqd",
                                    "score": 11,
                                    "created_utc": 1579656396.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Intervention time.  Nice.",
                    "author": "nemo69_1999",
                    "id": "ff6pfcp",
                    "parent_id": "t1_ff6p4j2",
                    "score": 12,
                    "created_utc": 1579632124.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have to question the judgment of an SD who would even consider this. The legal liability alone is potentially crushing.",
            "author": "-Horatio-",
            "id": "ff6qsp8",
            "parent_id": "t3_eryllk",
            "score": 54,
            "created_utc": 1579632940.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ff712tt",
                    "parent_id": "t1_ff6qsp8",
                    "score": 50,
                    "created_utc": 1579639010.0,
                    "replies": [
                        {
                            "body": "His sanity and maturity has definitely come into question the more time I spent around him. When I came on to work with him, he seemed relatively normal and stable, but I've come to seriously question his mental state as time goes on. \n\nHe called me at 8am this morning, waking me up, because he had conflict with a friend and decided to start a fight with me accusing me of how I don't care about him because I didn't answer one of his calls on the weekend as I was with friends. He has begun to talk about \"microwaves\" messing with his brain, how his depression is because of an ex-employee sending \"psychic attacks\" his way, along with other crazy conspiracy theories. \n\nIts gotten so damn crazy, I don't even believe it sometimes. And that's on top of 100 more things. I really\nneed to get out at some point soon here.",
                            "author": "Ineedathrowaway18",
                            "id": "ff7cf9e",
                            "parent_id": "t1_ff712tt",
                            "score": 19,
                            "created_utc": 1579646302.0,
                            "replies": [
                                {
                                    "body": "Holy shit. I was reading this thread thinking how bad could it be, but the microwaves thing puts it over the top. \n\nTake the advice of the poster above to sweetly ask for a recommendation letter now (write your own and have him sign it) and quietly start looking for another job. This is beyond your scope of abilities — he needs professional help.",
                                    "author": "iixder",
                                    "id": "ff7d621",
                                    "parent_id": "t1_ff7cf9e",
                                    "score": 8,
                                    "created_utc": 1579646812.0,
                                    "replies": [
                                        {
                                            "body": "yeah hahaha, its gotten way out of hand. He was always a little bit spiritual and eccentric, but its gotten so much worse in the recent months. \n\nI think that's exactly what I'm going to do. Get him to write a solid letter of recommendation (which he will, I told him I was thinking of picking up a weekend serving job and wanted a reference letter), and then I'm going to get my ass out of there the second I find something else.",
                                            "author": "Ineedathrowaway18",
                                            "id": "ff7di75",
                                            "parent_id": "t1_ff7d621",
                                            "score": 8,
                                            "created_utc": 1579647040.0,
                                            "replies": [
                                                {
                                                    "body": "Good luck!",
                                                    "author": "iixder",
                                                    "id": "ff7dkfj",
                                                    "parent_id": "t1_ff7di75",
                                                    "score": 2,
                                                    "created_utc": 1579647082.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "He sounds....... yeaaaaaaah, jeez. He needs a psychiatrist, and if you somehow stick around, he either has to give a higher raise or you should find a much more sane potential employer/SD. Sorry youre dealing with crap like this...",
                                    "author": "sbgonebroke",
                                    "id": "ff82pyv",
                                    "parent_id": "t1_ff7cf9e",
                                    "score": 1,
                                    "created_utc": 1579664428.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes, it’s an HR nightmare waiting to happen.",
                    "author": "garret6758",
                    "id": "ff6xl27",
                    "parent_id": "t1_ff6qsp8",
                    "score": 11,
                    "created_utc": 1579636963.0,
                    "replies": []
                },
                {
                    "body": "What's the legal liability issue?  People hire girlfriends all the time.",
                    "author": "nerojt",
                    "id": "ff8gi7p",
                    "parent_id": "t1_ff6qsp8",
                    "score": 1,
                    "created_utc": 1579677441.0,
                    "replies": [
                        {
                            "body": "People do all kinds of stupid shit all the time, doesn’t mean it’s a good idea. When you break up with a SB she’s not going to get pissed and sue your company for sexual harassment, exposing your affair to the world. But if she works for you...we’ll, you do the math.",
                            "author": "-Horatio-",
                            "id": "ff989z8",
                            "parent_id": "t1_ff8gi7p",
                            "score": 1,
                            "created_utc": 1579707145.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ff6qkxo",
            "parent_id": "t3_eryllk",
            "score": 21,
            "created_utc": 1579632814.0,
            "replies": [
                {
                    "body": "These guys don’t seek out therapy because therapy is hard work and requires self reflection. These are selfish man babies who want to be coddled and use their money and the financial vulnerability and emotional inexperience of some young women to feed the empty black whole of their souls. Sir your wife and kids can’t stand you for a reason. NEVER work for a SD!",
                    "author": "missmandyloves",
                    "id": "ff8rxqs",
                    "parent_id": "t1_ff6qkxo",
                    "score": 6,
                    "created_utc": 1579693709.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ff6niei",
            "parent_id": "t3_eryllk",
            "score": 14,
            "created_utc": 1579630972.0,
            "replies": [
                {
                    "body": "He definitely needs to seek out professional help, but he would never ever do it. I've tried so many times. There's only so much you can do before it begins to take a toll on your own mental health",
                    "author": "Ineedathrowaway18",
                    "id": "ff6od0h",
                    "parent_id": "t1_ff6niei",
                    "score": 10,
                    "created_utc": 1579631483.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do you get a separate allowance as his SD or just a wage from work? What are you official hours? Do you still sleep with him ? \n\nI need to use him as a reference -not a problem. He is sexually molesting an employee no matter what the \"arrangement\" is. You have leverage even if you wouldn't do anything to hurt him. \n\nSo, here are a few ideas. I don't have enough info to go on,so I'll guess at a few. You need to set boundaries. Have a discussion with him about what you told us here. \" (Daddy) ,I really appreciate the job with you but the lines are getting too blurred by being available 24/7.   \n\n1)  I will be available for work (9-5),but when I am off I want to have my own time to get personal things done, visit my friends and family,and just have some lone time .   \n2) Our sugar dates will be scheduled and separate from work at the usually (PPM).     \n3) I am available (X) days /week for our sugar dates   \n4) I am worried about you because you are so unhappy. I would like to be your lover and office assistant,not your therapist. I wish you could see a therapist.    \n5) I would like you to write me a recommendation for my work with you.  I want to still work with you but it will be nice to have for the future.  Regarding that, you should write your own letter and ask him to sign it.    \n6) continue quietly looking for a job. The wage you are getting is beefed up because of your \"other\" work I presume. You can get another job and another SD if you need to. You are 19 yrs old. How \"big\" a job could you get?",
            "author": "GSSD",
            "id": "ff6wdc6",
            "parent_id": "t3_eryllk",
            "score": 31,
            "created_utc": 1579636248.0,
            "replies": [
                {
                    "body": "This....all this!",
                    "author": "BratinaHat",
                    "id": "ff7hvf8",
                    "parent_id": "t1_ff6wdc6",
                    "score": 2,
                    "created_utc": 1579649917.0,
                    "replies": [
                        {
                            "body": "Unfortunately someone like this will be most likely incredibly offended that OP isn’t willing to be a good friend and is recommending he see a therapist instead. I know from experience. This is a needy, emotionally unstable and entitled person.",
                            "author": "thehottubistoohawt",
                            "id": "ff7uejd",
                            "parent_id": "t1_ff7hvf8",
                            "score": 5,
                            "created_utc": 1579658604.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This man just needs actual professional help. I can understand how \"hot\" it is to be fucking your personal assistant, but at the end of the day, I'm sure he wouldn't treat a personal assistant at work he isn't fucking this badly.\n\nThe foolishness of some of these guys who are able to make 7+ figures a year yet lack common sense astonishes me. I hope I'm not like that when I'm older.",
            "author": null,
            "id": "ff6ydhc",
            "parent_id": "t3_eryllk",
            "score": 9,
            "created_utc": 1579637427.0,
            "replies": []
        },
        {
            "body": "My SD owns his own small business, and I hated my job so I ended up working for him over the summer. It was only for a few months, and we are still together, but man things sure were difficult those few months! Definitely not something I'd ever recommend. You gotta keep your personal life and work life separate! But I feel you on the wage thing. I took a paycut when I got a different job, but I get insurance so I felt it evened out a little",
            "author": null,
            "id": "ff6s5gl",
            "parent_id": "t3_eryllk",
            "score": 8,
            "created_utc": 1579633752.0,
            "replies": []
        },
        {
            "body": "This guy sounds needy enough that these issues would have arisen even without the work relationship.  If the only way to continue the arrangement was to work for him you have adapted well and are wise to move on once you find a good alternative.",
            "author": "MidwestAmMan",
            "id": "ff6s9fg",
            "parent_id": "t3_eryllk",
            "score": 8,
            "created_utc": 1579633819.0,
            "replies": []
        },
        {
            "body": "I have never even considered having a current SB work for me.  Arrangements are supposed to be simple, fun and drama free... a full time employment arrangement is none of those things.   I have worked with ex SB’s on projects and even had one as a EA but the arrangements had been over for awhile and we were strictly business at that time.",
            "author": "LotBuilder",
            "id": "ff6to9c",
            "parent_id": "t3_eryllk",
            "score": 9,
            "created_utc": 1579634659.0,
            "replies": []
        },
        {
            "body": "Sex and work - not a good combo.",
            "author": null,
            "id": "ff77taq",
            "parent_id": "t3_eryllk",
            "score": 6,
            "created_utc": 1579642814.0,
            "replies": []
        },
        {
            "body": "Yah but \"this time is different\"",
            "author": "MarakTheSD",
            "id": "ff6ve3u",
            "parent_id": "t3_eryllk",
            "score": 5,
            "created_utc": 1579635668.0,
            "replies": []
        },
        {
            "body": "As an SD that's toyed with this idea (as a fantasy only .. *cough*) I am highly curious: What was it like when it was great?\n\nAnd do you think it could have stayed great if the guy was better able to handle this situation and make sure you had what you needed (including personal space and boundaries) ?",
            "author": "Gemini-Fox",
            "id": "ff75bnj",
            "parent_id": "t3_eryllk",
            "score": 5,
            "created_utc": 1579641422.0,
            "replies": [
                {
                    "body": "When it's great, it's fun. You get to see each other every day, skip out on work and spend the day at a hotel if you want, sex in the middle of the day, etc. But it doesn't last long. It's a completely different dynamic and I really don't think anyone could make it work, working directly with their SB.",
                    "author": null,
                    "id": "ff76yy8",
                    "parent_id": "t1_ff75bnj",
                    "score": 5,
                    "created_utc": 1579642346.0,
                    "replies": []
                },
                {
                    "body": "No matter how fond one is of their SD, it’s still a form of work. I think some SDs miss this point. You are never really your real self. You’re catering to his needs. Hence the arrangement. So the idea of working for him at his business while also working for him as his SB is a bad idea for the SB. Every minute, every action she takes at work, has to be carried out by the two roles (SB and employee). That is A LOT of work psychologically. Boundaries are needed and this is a bad idea all  around.",
                    "author": "missmandyloves",
                    "id": "ff8sckz",
                    "parent_id": "t1_ff75bnj",
                    "score": 2,
                    "created_utc": 1579694199.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The dynamic is not destined to fail. Just because it didn't work out with yours doesnt mean that's true for everyone. My SD employed me when I lost my job and it was the best time I've ever had working. I worked with him 5 days a week for over a year. He was emotionally mature and mentally stable, so my experience was completely different from yours.",
            "author": "SamTheWhiteRabbit",
            "id": "ff8bkrk",
            "parent_id": "t3_eryllk",
            "score": 5,
            "created_utc": 1579671960.0,
            "replies": []
        },
        {
            "body": "You need to run away fast from this lunatic. NO amount of money is worth your safety or sanity.  You cannot buy happiness.  This hombre is totally loco and and short of a breakfast burrito 🌯.",
            "author": null,
            "id": "ff7hkn6",
            "parent_id": "t3_eryllk",
            "score": 3,
            "created_utc": 1579649716.0,
            "replies": []
        },
        {
            "body": "I don’t think I could ever do that. It becomes such a gray area with the dynamic before and then of course, the merging of the therapist/gf/friend bullshit. \n\nI’m glad you’ve been feeling better, but there are jobs out there. Ask around. Ask friends. Maybe someone can hook you up with a job that will get you through while you work on where you want to go and at the same time is good for your health mentally. \n\nI’m sorry you are experiencing this, but know your worth and take care of yourself first ❤️",
            "author": "ShortButterCake",
            "id": "ff7eupf",
            "parent_id": "t3_eryllk",
            "score": 2,
            "created_utc": 1579647925.0,
            "replies": []
        },
        {
            "body": "grrr..\n\nnever mind.. i read the rest of the thread.. I am wrong /i go hide now be gentle.",
            "author": "craa141",
            "id": "ff7jltb",
            "parent_id": "t3_eryllk",
            "score": 2,
            "created_utc": 1579651087.0,
            "replies": []
        },
        {
            "body": "I would never hire an SB for a number of reasons, this being one of them. Too much dependency and interaction. \n\nThe only time I regretting this rule was when I had an SB who expressed a casual interest in working for me, and she was one of the sharpest, reliable, organized, get-it-done type people I'd met. Miles above anyone I had interviewed for the position. But...not worth the risk, for either of us.",
            "author": "emptyoverflow",
            "id": "ff7m84o",
            "parent_id": "t3_eryllk",
            "score": 2,
            "created_utc": 1579652902.0,
            "replies": []
        },
        {
            "body": "i had been offered twice before by previous sds to work for them. I knew better to say no, though i couldve used a better job and the money, i just knew better not to mix business with pleasure. Thank goodness too because both of those sds ended and woudlv'e become so awkward. I wouldve been in your situation too. One sd wanted a vanilla relationship. Anyways, hugs to you. I think you should just quit for your sanity. forget the reference.",
            "author": null,
            "id": "ff8c6ky",
            "parent_id": "t3_eryllk",
            "score": 2,
            "created_utc": 1579672574.0,
            "replies": []
        },
        {
            "body": "Being his employee gives you a ton of rights and leverage under labor laws\n\nEspecially if you are sexually involved with him...\n\nSeriously, you could walk away with a huge settlement if you feel like you are being abused. Don't quit, change things and make it a healthy environment",
            "author": "KnocDown",
            "id": "ff8k8c2",
            "parent_id": "t3_eryllk",
            "score": 2,
            "created_utc": 1579682433.0,
            "replies": [
                {
                    "body": "This!  She needs to start recording these late night phone calls.  You have all the power OP.",
                    "author": "sugarsenior",
                    "id": "ffcaggq",
                    "parent_id": "t1_ff8k8c2",
                    "score": 2,
                    "created_utc": 1579795202.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The best time to look for a new job is when you have a job and they will understand that you can't give your current employer as a reference.   There is no reason not to explore other job opportunities now. \n\nWay too many red flags in the d re description of your relationship not to suggest you find a way out of it. \n\nBest of luck.",
            "author": "willfromvb",
            "id": "ff8mo4c",
            "parent_id": "t3_eryllk",
            "score": 2,
            "created_utc": 1579686157.0,
            "replies": []
        },
        {
            "body": ">That's how I hoped this would work out.\n\nThis is the problem. You didn't make it clear for both of you.\n\nExpectations need to be set with Sugar Relationships and Work Relationships.",
            "author": "daddyst0nk",
            "id": "ff6ukv0",
            "parent_id": "t3_eryllk",
            "score": 2,
            "created_utc": 1579635190.0,
            "replies": []
        },
        {
            "body": "I had a man offer me this once before. It was intriguing, but honestly, I figured either he could either terminate me when bored, or it would lead to gossip, sexual harrassment paaaast the boundaries of keeping things light and fun in a taboo sexy secretary dynamic..... and never accepted it.\n\nGood for the sake of a free job, but I'd feel terrible I guess. Sorry to hear things are getting rough over there. I hope you do score a good job soon.",
            "author": "sbgonebroke",
            "id": "ff82kuo",
            "parent_id": "t3_eryllk",
            "score": 1,
            "created_utc": 1579664324.0,
            "replies": []
        },
        {
            "body": "Stop answering the phone and tell him not to call past a certain hour. You have the right to set up boundaries and have a private personal life. Just stop enabling him.",
            "author": "_hello_sugar_",
            "id": "ffbb6tp",
            "parent_id": "t3_eryllk",
            "score": 1,
            "created_utc": 1579758222.0,
            "replies": []
        },
        {
            "body": "Write your letter of reference with/for him and retain a copy.  Negotiate a raise for you PA work, based on the increased workload, and start job searching!  He can't fire you and even a crazy like him probably realizes it on some level.  If your SB allowance is a joke, ask for a raise there too, if he doesn't comply, then you'd just like to continue your professional relationship, but sadly can't be his SB anymore.  I'd also record some of these interactions for good measure.\n\nHe's exploiting you, it's completely fine to protect yourself.",
            "author": "sugarsenior",
            "id": "ffc9zrd",
            "parent_id": "t3_eryllk",
            "score": 1,
            "created_utc": 1579794912.0,
            "replies": []
        },
        {
            "body": "HAHAHAHA I totally should",
            "author": "Ineedathrowaway18",
            "id": "ff6pp8b",
            "parent_id": "t1_ff6p4j2",
            "score": 41,
            "created_utc": 1579632287.0,
            "replies": []
        },
        {
            "body": "> it started to become a very 1 sided friendship\n\nThe fundamental question is if your current compensation is fair pay for the work you do plus a reasonable SB allowance considering what he expects.  If the answer to that is yes then you have a relationship issue that may be solvable ,  if no then you have a relationship issue AND an economic issue which is probably unsolvable.  Beyond that is the usual question ,  is this relationship good for your soul and something you will look back on in 20 years and think it was overall a good relationship or something that was bad for your soul . \n\nWhen my former LT   SB did some work for me it was entirely separate from her sugar and worked great.  I tried to pick tasks where the experience would provide her with long term benefits including editing reports. I doubt it would have worked had we been in the office together all day .  \n\nIt was my firm so there were no stockholders being abused,  the sugar portion came out of my funds so there was no tax question  and the sugar relationship started before the working relationship. Most corporations can not afford the associated risks in today's world.",
            "author": "pinotandsugar",
            "id": "ff706fs",
            "parent_id": "t1_ff6p4j2",
            "score": 15,
            "created_utc": 1579638483.0,
            "replies": [
                {
                    "body": "My current compensation, official salary and allowance are definitely not fair for the work I'm doing. I was hired originally as a personal assistant to do work in the realm of video editing for his company, but at this point, I am doing all of the marketing, web development, video editing, and daily tasks on top of that. My allowance is honestly a joke, but combined with the slight salary increase, it was better than my current job at the time. \n\nThe sugar portion comes out of his own funds, but I think he is abusing the fact that I am around him every single day, and my allowance hasn't increased whatsoever from when we were seeing each other 3 times a month. And on top of that, the emotional effort I am now having to put in is honestly 100 times more than my boyfriend expects from me. \n\nIts really something I don't want to fix at this point. Financially and relationship wise, it is not worth it for me. It's just tricky to leave when nowhere else is hiring at what I am making currently. I should've just stuck with my other job as I was approaching a raise, but the short term raise seemed better than hanging around for a couple more months. I've definitely learned not to mix business and sugaring.",
                    "author": "Ineedathrowaway18",
                    "id": "ff7brqd",
                    "parent_id": "t1_ff706fs",
                    "score": 10,
                    "created_utc": 1579645798.0,
                    "replies": [
                        {
                            "body": "I think you should treat this like any workplace and ask for a raise commensurate with your increase in responsibilities (ideally for the sugar part, too).  Of course if you're reliant on this income, it might not be worth it to risk rocking the boat if you think he'll react poorly.  Good luck!\n\nEdit: on reading your comments, sounds like an iffy proposition.",
                            "author": null,
                            "id": "ff7r7v4",
                            "parent_id": "t1_ff7brqd",
                            "score": 11,
                            "created_utc": 1579656396.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Intervention time.  Nice.",
            "author": "nemo69_1999",
            "id": "ff6pfcp",
            "parent_id": "t1_ff6p4j2",
            "score": 12,
            "created_utc": 1579632124.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ff712tt",
            "parent_id": "t1_ff6qsp8",
            "score": 50,
            "created_utc": 1579639010.0,
            "replies": [
                {
                    "body": "His sanity and maturity has definitely come into question the more time I spent around him. When I came on to work with him, he seemed relatively normal and stable, but I've come to seriously question his mental state as time goes on. \n\nHe called me at 8am this morning, waking me up, because he had conflict with a friend and decided to start a fight with me accusing me of how I don't care about him because I didn't answer one of his calls on the weekend as I was with friends. He has begun to talk about \"microwaves\" messing with his brain, how his depression is because of an ex-employee sending \"psychic attacks\" his way, along with other crazy conspiracy theories. \n\nIts gotten so damn crazy, I don't even believe it sometimes. And that's on top of 100 more things. I really\nneed to get out at some point soon here.",
                    "author": "Ineedathrowaway18",
                    "id": "ff7cf9e",
                    "parent_id": "t1_ff712tt",
                    "score": 19,
                    "created_utc": 1579646302.0,
                    "replies": [
                        {
                            "body": "Holy shit. I was reading this thread thinking how bad could it be, but the microwaves thing puts it over the top. \n\nTake the advice of the poster above to sweetly ask for a recommendation letter now (write your own and have him sign it) and quietly start looking for another job. This is beyond your scope of abilities — he needs professional help.",
                            "author": "iixder",
                            "id": "ff7d621",
                            "parent_id": "t1_ff7cf9e",
                            "score": 8,
                            "created_utc": 1579646812.0,
                            "replies": [
                                {
                                    "body": "yeah hahaha, its gotten way out of hand. He was always a little bit spiritual and eccentric, but its gotten so much worse in the recent months. \n\nI think that's exactly what I'm going to do. Get him to write a solid letter of recommendation (which he will, I told him I was thinking of picking up a weekend serving job and wanted a reference letter), and then I'm going to get my ass out of there the second I find something else.",
                                    "author": "Ineedathrowaway18",
                                    "id": "ff7di75",
                                    "parent_id": "t1_ff7d621",
                                    "score": 8,
                                    "created_utc": 1579647040.0,
                                    "replies": [
                                        {
                                            "body": "Good luck!",
                                            "author": "iixder",
                                            "id": "ff7dkfj",
                                            "parent_id": "t1_ff7di75",
                                            "score": 2,
                                            "created_utc": 1579647082.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "He sounds....... yeaaaaaaah, jeez. He needs a psychiatrist, and if you somehow stick around, he either has to give a higher raise or you should find a much more sane potential employer/SD. Sorry youre dealing with crap like this...",
                            "author": "sbgonebroke",
                            "id": "ff82pyv",
                            "parent_id": "t1_ff7cf9e",
                            "score": 1,
                            "created_utc": 1579664428.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, it’s an HR nightmare waiting to happen.",
            "author": "garret6758",
            "id": "ff6xl27",
            "parent_id": "t1_ff6qsp8",
            "score": 11,
            "created_utc": 1579636963.0,
            "replies": []
        },
        {
            "body": "What's the legal liability issue?  People hire girlfriends all the time.",
            "author": "nerojt",
            "id": "ff8gi7p",
            "parent_id": "t1_ff6qsp8",
            "score": 1,
            "created_utc": 1579677441.0,
            "replies": [
                {
                    "body": "People do all kinds of stupid shit all the time, doesn’t mean it’s a good idea. When you break up with a SB she’s not going to get pissed and sue your company for sexual harassment, exposing your affair to the world. But if she works for you...we’ll, you do the math.",
                    "author": "-Horatio-",
                    "id": "ff989z8",
                    "parent_id": "t1_ff8gi7p",
                    "score": 1,
                    "created_utc": 1579707145.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "These guys don’t seek out therapy because therapy is hard work and requires self reflection. These are selfish man babies who want to be coddled and use their money and the financial vulnerability and emotional inexperience of some young women to feed the empty black whole of their souls. Sir your wife and kids can’t stand you for a reason. NEVER work for a SD!",
            "author": "missmandyloves",
            "id": "ff8rxqs",
            "parent_id": "t1_ff6qkxo",
            "score": 6,
            "created_utc": 1579693709.0,
            "replies": []
        },
        {
            "body": "He definitely needs to seek out professional help, but he would never ever do it. I've tried so many times. There's only so much you can do before it begins to take a toll on your own mental health",
            "author": "Ineedathrowaway18",
            "id": "ff6od0h",
            "parent_id": "t1_ff6niei",
            "score": 10,
            "created_utc": 1579631483.0,
            "replies": []
        },
        {
            "body": "This....all this!",
            "author": "BratinaHat",
            "id": "ff7hvf8",
            "parent_id": "t1_ff6wdc6",
            "score": 2,
            "created_utc": 1579649917.0,
            "replies": [
                {
                    "body": "Unfortunately someone like this will be most likely incredibly offended that OP isn’t willing to be a good friend and is recommending he see a therapist instead. I know from experience. This is a needy, emotionally unstable and entitled person.",
                    "author": "thehottubistoohawt",
                    "id": "ff7uejd",
                    "parent_id": "t1_ff7hvf8",
                    "score": 5,
                    "created_utc": 1579658604.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When it's great, it's fun. You get to see each other every day, skip out on work and spend the day at a hotel if you want, sex in the middle of the day, etc. But it doesn't last long. It's a completely different dynamic and I really don't think anyone could make it work, working directly with their SB.",
            "author": null,
            "id": "ff76yy8",
            "parent_id": "t1_ff75bnj",
            "score": 5,
            "created_utc": 1579642346.0,
            "replies": []
        },
        {
            "body": "No matter how fond one is of their SD, it’s still a form of work. I think some SDs miss this point. You are never really your real self. You’re catering to his needs. Hence the arrangement. So the idea of working for him at his business while also working for him as his SB is a bad idea for the SB. Every minute, every action she takes at work, has to be carried out by the two roles (SB and employee). That is A LOT of work psychologically. Boundaries are needed and this is a bad idea all  around.",
            "author": "missmandyloves",
            "id": "ff8sckz",
            "parent_id": "t1_ff75bnj",
            "score": 2,
            "created_utc": 1579694199.0,
            "replies": []
        },
        {
            "body": "This!  She needs to start recording these late night phone calls.  You have all the power OP.",
            "author": "sugarsenior",
            "id": "ffcaggq",
            "parent_id": "t1_ff8k8c2",
            "score": 2,
            "created_utc": 1579795202.0,
            "replies": []
        },
        {
            "body": "My current compensation, official salary and allowance are definitely not fair for the work I'm doing. I was hired originally as a personal assistant to do work in the realm of video editing for his company, but at this point, I am doing all of the marketing, web development, video editing, and daily tasks on top of that. My allowance is honestly a joke, but combined with the slight salary increase, it was better than my current job at the time. \n\nThe sugar portion comes out of his own funds, but I think he is abusing the fact that I am around him every single day, and my allowance hasn't increased whatsoever from when we were seeing each other 3 times a month. And on top of that, the emotional effort I am now having to put in is honestly 100 times more than my boyfriend expects from me. \n\nIts really something I don't want to fix at this point. Financially and relationship wise, it is not worth it for me. It's just tricky to leave when nowhere else is hiring at what I am making currently. I should've just stuck with my other job as I was approaching a raise, but the short term raise seemed better than hanging around for a couple more months. I've definitely learned not to mix business and sugaring.",
            "author": "Ineedathrowaway18",
            "id": "ff7brqd",
            "parent_id": "t1_ff706fs",
            "score": 10,
            "created_utc": 1579645798.0,
            "replies": [
                {
                    "body": "I think you should treat this like any workplace and ask for a raise commensurate with your increase in responsibilities (ideally for the sugar part, too).  Of course if you're reliant on this income, it might not be worth it to risk rocking the boat if you think he'll react poorly.  Good luck!\n\nEdit: on reading your comments, sounds like an iffy proposition.",
                    "author": null,
                    "id": "ff7r7v4",
                    "parent_id": "t1_ff7brqd",
                    "score": 11,
                    "created_utc": 1579656396.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "His sanity and maturity has definitely come into question the more time I spent around him. When I came on to work with him, he seemed relatively normal and stable, but I've come to seriously question his mental state as time goes on. \n\nHe called me at 8am this morning, waking me up, because he had conflict with a friend and decided to start a fight with me accusing me of how I don't care about him because I didn't answer one of his calls on the weekend as I was with friends. He has begun to talk about \"microwaves\" messing with his brain, how his depression is because of an ex-employee sending \"psychic attacks\" his way, along with other crazy conspiracy theories. \n\nIts gotten so damn crazy, I don't even believe it sometimes. And that's on top of 100 more things. I really\nneed to get out at some point soon here.",
            "author": "Ineedathrowaway18",
            "id": "ff7cf9e",
            "parent_id": "t1_ff712tt",
            "score": 19,
            "created_utc": 1579646302.0,
            "replies": [
                {
                    "body": "Holy shit. I was reading this thread thinking how bad could it be, but the microwaves thing puts it over the top. \n\nTake the advice of the poster above to sweetly ask for a recommendation letter now (write your own and have him sign it) and quietly start looking for another job. This is beyond your scope of abilities — he needs professional help.",
                    "author": "iixder",
                    "id": "ff7d621",
                    "parent_id": "t1_ff7cf9e",
                    "score": 8,
                    "created_utc": 1579646812.0,
                    "replies": [
                        {
                            "body": "yeah hahaha, its gotten way out of hand. He was always a little bit spiritual and eccentric, but its gotten so much worse in the recent months. \n\nI think that's exactly what I'm going to do. Get him to write a solid letter of recommendation (which he will, I told him I was thinking of picking up a weekend serving job and wanted a reference letter), and then I'm going to get my ass out of there the second I find something else.",
                            "author": "Ineedathrowaway18",
                            "id": "ff7di75",
                            "parent_id": "t1_ff7d621",
                            "score": 8,
                            "created_utc": 1579647040.0,
                            "replies": [
                                {
                                    "body": "Good luck!",
                                    "author": "iixder",
                                    "id": "ff7dkfj",
                                    "parent_id": "t1_ff7di75",
                                    "score": 2,
                                    "created_utc": 1579647082.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "He sounds....... yeaaaaaaah, jeez. He needs a psychiatrist, and if you somehow stick around, he either has to give a higher raise or you should find a much more sane potential employer/SD. Sorry youre dealing with crap like this...",
                    "author": "sbgonebroke",
                    "id": "ff82pyv",
                    "parent_id": "t1_ff7cf9e",
                    "score": 1,
                    "created_utc": 1579664428.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "People do all kinds of stupid shit all the time, doesn’t mean it’s a good idea. When you break up with a SB she’s not going to get pissed and sue your company for sexual harassment, exposing your affair to the world. But if she works for you...we’ll, you do the math.",
            "author": "-Horatio-",
            "id": "ff989z8",
            "parent_id": "t1_ff8gi7p",
            "score": 1,
            "created_utc": 1579707145.0,
            "replies": []
        },
        {
            "body": "Unfortunately someone like this will be most likely incredibly offended that OP isn’t willing to be a good friend and is recommending he see a therapist instead. I know from experience. This is a needy, emotionally unstable and entitled person.",
            "author": "thehottubistoohawt",
            "id": "ff7uejd",
            "parent_id": "t1_ff7hvf8",
            "score": 5,
            "created_utc": 1579658604.0,
            "replies": []
        },
        {
            "body": "I think you should treat this like any workplace and ask for a raise commensurate with your increase in responsibilities (ideally for the sugar part, too).  Of course if you're reliant on this income, it might not be worth it to risk rocking the boat if you think he'll react poorly.  Good luck!\n\nEdit: on reading your comments, sounds like an iffy proposition.",
            "author": null,
            "id": "ff7r7v4",
            "parent_id": "t1_ff7brqd",
            "score": 11,
            "created_utc": 1579656396.0,
            "replies": []
        },
        {
            "body": "Holy shit. I was reading this thread thinking how bad could it be, but the microwaves thing puts it over the top. \n\nTake the advice of the poster above to sweetly ask for a recommendation letter now (write your own and have him sign it) and quietly start looking for another job. This is beyond your scope of abilities — he needs professional help.",
            "author": "iixder",
            "id": "ff7d621",
            "parent_id": "t1_ff7cf9e",
            "score": 8,
            "created_utc": 1579646812.0,
            "replies": [
                {
                    "body": "yeah hahaha, its gotten way out of hand. He was always a little bit spiritual and eccentric, but its gotten so much worse in the recent months. \n\nI think that's exactly what I'm going to do. Get him to write a solid letter of recommendation (which he will, I told him I was thinking of picking up a weekend serving job and wanted a reference letter), and then I'm going to get my ass out of there the second I find something else.",
                    "author": "Ineedathrowaway18",
                    "id": "ff7di75",
                    "parent_id": "t1_ff7d621",
                    "score": 8,
                    "created_utc": 1579647040.0,
                    "replies": [
                        {
                            "body": "Good luck!",
                            "author": "iixder",
                            "id": "ff7dkfj",
                            "parent_id": "t1_ff7di75",
                            "score": 2,
                            "created_utc": 1579647082.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He sounds....... yeaaaaaaah, jeez. He needs a psychiatrist, and if you somehow stick around, he either has to give a higher raise or you should find a much more sane potential employer/SD. Sorry youre dealing with crap like this...",
            "author": "sbgonebroke",
            "id": "ff82pyv",
            "parent_id": "t1_ff7cf9e",
            "score": 1,
            "created_utc": 1579664428.0,
            "replies": []
        },
        {
            "body": "yeah hahaha, its gotten way out of hand. He was always a little bit spiritual and eccentric, but its gotten so much worse in the recent months. \n\nI think that's exactly what I'm going to do. Get him to write a solid letter of recommendation (which he will, I told him I was thinking of picking up a weekend serving job and wanted a reference letter), and then I'm going to get my ass out of there the second I find something else.",
            "author": "Ineedathrowaway18",
            "id": "ff7di75",
            "parent_id": "t1_ff7d621",
            "score": 8,
            "created_utc": 1579647040.0,
            "replies": [
                {
                    "body": "Good luck!",
                    "author": "iixder",
                    "id": "ff7dkfj",
                    "parent_id": "t1_ff7di75",
                    "score": 2,
                    "created_utc": 1579647082.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good luck!",
            "author": "iixder",
            "id": "ff7dkfj",
            "parent_id": "t1_ff7di75",
            "score": 2,
            "created_utc": 1579647082.0,
            "replies": []
        }
    ]
}