{
    "title": "Ok ma'am",
    "post_id": "i18pox",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/i18pox/ok_maam/",
    "author": "kittiesntrees",
    "body": "So I had a meet & greet with a POT at a coffee shop today. I got there early, ordered my drink, and waited for the POT to come while I read. All was well...until an older lady sat down next to me. Let me tell you, she radiated Karen vibes to the sun and back and I desperately hoped she was just setting her stuff down at the table next to me, but alas, she was there to stay. Anyways fast forward a couple minutes, and my POT gets there. He's cute, charming, and looks like he's just hittin forty--in short the most attractive guy I've seen on SA by far. Anyways, we're talking through what got him into this kind of dating and what got me into it, and Karen behind me is CLEARLY eavesdropping but she seemed suss from the second my POT came to the table. So after two minutes of us talking (with lowered voices, no less) she gets up and makes a show of gathering up her things, dropping little mutterings like \"well I WAS having a good time\" and \"disgusting,\" all the while grimacing and glaring at me. THEN, she goes outside and talks to some seemingly random older couple sitting by the window outside (on the other side from me & pot, who are inside). She seems to be telling them what she suspects is going and she's gesticulating wildly, so I glance out the window at her. At this point she points at me accusatorially, and the entire table turns to look at us, which, like, awkward as hell. Anyways she leaves and we wrap up our date pretty quickly but it just left me with this sinking feeling. Why, oh, why are people like this?? What the FUCK Karen! Mind your own beeswax!\n\nEDIT: just got this lovely message from a member of our sub who then blocked me lmao. She really is just proving my point 😂 \nhttp://imgur.com/a/dFv1FuF",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/i18pox/ok_maam/",
    "score": 126,
    "upvote_ratio": 0.94,
    "created_utc": 1596206695.0,
    "num_comments": 92,
    "links": [
        [
            "http://imgur.com/a/dFv1FuF"
        ]
    ],
    "comments": [
        {
            "body": "I have taken the occasional SB out to meet my friends, office or birthday party or the like. The women all hate her. Every damn one except for one time the office manager chatted my SB up for an hour. The office manager was an SB 30 years before. They were called kept women in those days.",
            "author": "AFSMSgt",
            "id": "fzvnnzc",
            "parent_id": "t3_i18pox",
            "score": 43,
            "created_utc": 1596211765.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fzw27wn",
                    "parent_id": "t1_fzvnnzc",
                    "score": 34,
                    "created_utc": 1596217780.0,
                    "replies": [
                        {
                            "body": "BINGO",
                            "author": "AFSMSgt",
                            "id": "fzweoc7",
                            "parent_id": "t1_fzw27wn",
                            "score": 8,
                            "created_utc": 1596221963.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "She is jealous she can't get a Willy with $ on the top",
            "author": "shamloo77",
            "id": "fzvafjn",
            "parent_id": "t3_i18pox",
            "score": 68,
            "created_utc": 1596207278.0,
            "replies": [
                {
                    "body": "Honestly! If I weren't with my POT, I'd have given that woman a talking to, smh this woman needs to mind my temper",
                    "author": "kittiesntrees",
                    "id": "fzvaxrd",
                    "parent_id": "t1_fzvafjn",
                    "score": 15,
                    "created_utc": 1596207442.0,
                    "replies": []
                },
                {
                    "body": "No dear, she is not jealous--who knows, she might have a 'wealthy' husband who spends much more on her than a few hundred, or even thousand a week ;-)\n\nSex work is looked down on..always has and most likely always will be. I do not think she should have been rude (and, eavesdropping is rude), to the young girl but maybe, they were talking about money, details of the arrangement or he was married..and, those tables at coffee shops are close and it is usually quiet? The fact is that if you put it out in the open people will judge. It is the nature of the beast.\n\nI went out with obnoxious man 'SD' at a classy bar once. I frequented it often, so I was ashamed to ever go back for a LONG time. He was very good looking guy, too...my age but he was LOUD. He brought me FIVE BENJAMINS (Ben Franklin's) for meeting for a drink (no, I did not ask), then handed it to me in an envelope. When I went to the bathroom, he asked loudly, 'did you count it in the bathroom?'...I was mortified as a group of young people (men AND women--my/ our age) were sitting next to us listening. They were not \"karen's\" but a group of people trying to have a nice night out without hearing about 'an arrangement' being discussed at the next table. I would have been giggling and listening, too.\n\nMy advice: Go somewhere the tables are far enough apart from snooping nosy ears and speak quietly...",
                    "author": null,
                    "id": "fzwxji9",
                    "parent_id": "t1_fzvafjn",
                    "score": 14,
                    "created_utc": 1596230250.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fzx8vni",
                            "parent_id": "t1_fzwxji9",
                            "score": 7,
                            "created_utc": 1596233887.0,
                            "replies": [
                                {
                                    "body": "Yes! It was so embarrassing and even though he 'gifted' a 'meet and greet' gift that so many 'SD's' are against, it still was NOT worth it. \n\nScreen girls...screen. Screen with the finest mesh screen you can use.",
                                    "author": null,
                                    "id": "fzxcsj1",
                                    "parent_id": "t1_fzx8vni",
                                    "score": 10,
                                    "created_utc": 1596235185.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "This^^^",
                            "author": "testing1to3",
                            "id": "fzx15s1",
                            "parent_id": "t1_fzwxji9",
                            "score": 4,
                            "created_utc": 1596231349.0,
                            "replies": []
                        },
                        {
                            "body": "Honestly yeah thank God I never go to this coffee shop. I won't be going there again without a big makeover",
                            "author": "kittiesntrees",
                            "id": "fzx2l2b",
                            "parent_id": "t1_fzwxji9",
                            "score": 3,
                            "created_utc": 1596231786.0,
                            "replies": [
                                {
                                    "body": "Yes, the men need to understand that we need our discretion, too. Our careers might be on the line and people judge...A very high allowance helps this problem somewhat.",
                                    "author": null,
                                    "id": "fzxdbkc",
                                    "parent_id": "t1_fzx2l2b",
                                    "score": 7,
                                    "created_utc": 1596235378.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">He brought me five hundred benjis for meeting for a drink\n\nHe brought you $50,000 in cash just for meeting for a drink?",
                            "author": "Sanctemagne",
                            "id": "fzxed6m",
                            "parent_id": "t1_fzwxji9",
                            "score": 1,
                            "created_utc": 1596235835.0,
                            "replies": [
                                {
                                    "body": "typo....I got in trouble for typing an amount. You will, too, so better change it.",
                                    "author": null,
                                    "id": "fzxfmzr",
                                    "parent_id": "t1_fzxed6m",
                                    "score": 3,
                                    "created_utc": 1596236430.0,
                                    "replies": [
                                        {
                                            "body": "Ah, true. Thanks for the heads up :)",
                                            "author": "Sanctemagne",
                                            "id": "fzxg3sq",
                                            "parent_id": "t1_fzxfmzr",
                                            "score": 1,
                                            "created_utc": 1596236655.0,
                                            "replies": [
                                                {
                                                    "body": "You're welcome. (: Although, this reddit sub might not count it with an extra zero or two, lol.",
                                                    "author": null,
                                                    "id": "fzxgaam",
                                                    "parent_id": "t1_fzxg3sq",
                                                    "score": 3,
                                                    "created_utc": 1596236738.0,
                                                    "replies": [
                                                        {
                                                            "body": "You never know, haha. Maybe I'll just leave it then and see ;)",
                                                            "author": "Sanctemagne",
                                                            "id": "fzxgs5w",
                                                            "parent_id": "t1_fzxgaam",
                                                            "score": 1,
                                                            "created_utc": 1596236979.0,
                                                            "replies": [
                                                                {
                                                                    "body": "haha! (((: Extra zeros make all of us girls so happy!",
                                                                    "author": null,
                                                                    "id": "fzxhqkk",
                                                                    "parent_id": "t1_fzxgs5w",
                                                                    "score": 3,
                                                                    "created_utc": 1596237435.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Well I do make it my business to always give my girls plenty of extra 0s and extra Os ;)",
                                                                            "author": "Sanctemagne",
                                                                            "id": "fzxie2x",
                                                                            "parent_id": "t1_fzxhqkk",
                                                                            "score": 2,
                                                                            "created_utc": 1596237741.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fzwwg39",
                    "parent_id": "t1_fzvafjn",
                    "score": 1,
                    "created_utc": 1596229936.0,
                    "replies": [
                        {
                            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                            "author": "AutoModerator",
                            "id": "fzwwg65",
                            "parent_id": "t1_fzwwg39",
                            "score": 1,
                            "created_utc": 1596229937.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Saltier than the dead sea",
            "author": "macaroonqueen",
            "id": "fzvbmgl",
            "parent_id": "t3_i18pox",
            "score": 33,
            "created_utc": 1596207662.0,
            "replies": [
                {
                    "body": "You know the vibes",
                    "author": "kittiesntrees",
                    "id": "fzvd6up",
                    "parent_id": "t1_fzvbmgl",
                    "score": 8,
                    "created_utc": 1596208185.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I had a SB look around a restaurant one time and grin to me, “Every person in here either wants to: be me, be you, kill me, or kill you.” lol",
            "author": "LaGriffeDuLion",
            "id": "fzvr4te",
            "parent_id": "t3_i18pox",
            "score": 43,
            "created_utc": 1596213186.0,
            "replies": [
                {
                    "body": "Omg that's so true. Should be the SA catchphrase",
                    "author": "kittiesntrees",
                    "id": "fzvrhe5",
                    "parent_id": "t1_fzvr4te",
                    "score": 13,
                    "created_utc": 1596213335.0,
                    "replies": []
                },
                {
                    "body": "HAVE Y'ALL NEVER HEARD OF EXAGGERATION?? This woman was just trying to make the point that she's gorgeous  cachet to many men, who are jealous, and threatening to many women, who are also jealous. She knows her self worth. Why do we have to shit on a woman every time she expresses that she's beautiful and desirable? \n\nALSO this is a cute line. Stop being literalists please. These kinds of \"women are so vain\" comments harm self esteem when we've already got enough keeping us down. That goes for men and women alike. We can all be dapper queens who appreciate our self worth and physical standing.",
                    "author": "kittiesntrees",
                    "id": "fzxf3kg",
                    "parent_id": "t1_fzvr4te",
                    "score": 5,
                    "created_utc": 1596236177.0,
                    "replies": [
                        {
                            "body": "You’re shitting on women saying we are “jealous” of this rando narc",
                            "author": "Driftwould92",
                            "id": "fzzdxpa",
                            "parent_id": "t1_fzxf3kg",
                            "score": 0,
                            "created_utc": 1596289289.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Well now.. that is definitely a self absorbed way of feeling out a room",
                    "author": "shadadada",
                    "id": "fzwj34t",
                    "parent_id": "t1_fzvr4te",
                    "score": 1,
                    "created_utc": 1596223807.0,
                    "replies": [
                        {
                            "body": "Implying that any level of being self absorbed is bad? Implying that you think this phrase isn't true 99% of the time for a M&G?",
                            "author": "yeehaw_yall",
                            "id": "fzwmb0n",
                            "parent_id": "t1_fzwj34t",
                            "score": 6,
                            "created_utc": 1596225360.0,
                            "replies": [
                                {
                                    "body": "This isn’t any level though.. this seems like a very high level of being self obsessed. So no i don’t think you have to be conceited in order to meet someone.. \n\nTo each their own; do and enjoy the things you enjoy if that’s what you want out of life. But when this conceited “life mantra” is presented here to influence the narrative of this social interaction i think it’s important to remind that very same person that hey; a good amount of people in this restaurant are not competitively comparing their life to yours as you maybe. \n\nI suppose it probably helps ease himself into thinking better of himself? But i can confidently say most people are not immediately envious of a dude they saw for 30 seconds at a bar with a girl half his senior.",
                                    "author": "shadadada",
                                    "id": "fzwoin1",
                                    "parent_id": "t1_fzwmb0n",
                                    "score": -1,
                                    "created_utc": 1596226485.0,
                                    "replies": [
                                        {
                                            "body": "Depends on the girl, non? When this one walked into a bar with a live band, sometimes a drummer would lose his rhythm. 😉",
                                            "author": "LaGriffeDuLion",
                                            "id": "fzws679",
                                            "parent_id": "t1_fzwoin1",
                                            "score": 9,
                                            "created_utc": 1596228249.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Man what a bunch of sour grapes-consuming grumplestiltskins smh.  I would've thought the \"grin to me\" bit would've been enough to indicate a certain level of facetiousness, but here we are.\n\nAlso v true and I lol'd.  She sounds like a fun lady.",
                    "author": null,
                    "id": "fzyyzrp",
                    "parent_id": "t1_fzvr4te",
                    "score": 1,
                    "created_utc": 1596275839.0,
                    "replies": []
                },
                {
                    "body": "Yuck it’s off putting to think so highly of ones self . It’s bordering narcissistic. No one cares",
                    "author": "Driftwould92",
                    "id": "fzx957r",
                    "parent_id": "t1_fzvr4te",
                    "score": -3,
                    "created_utc": 1596233975.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzvel5o",
            "parent_id": "t3_i18pox",
            "score": 13,
            "created_utc": 1596208636.0,
            "replies": [
                {
                    "body": "Yeah :(( my POT picked the place. It probably should have been more private given that we met pretty early in the morning but ah well! She doesn't know either of our names so I figure we're ok.",
                    "author": "kittiesntrees",
                    "id": "fzvfop8",
                    "parent_id": "t1_fzvel5o",
                    "score": 6,
                    "created_utc": 1596209015.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I had a GF (not SB) 20 years younger than me on my arm for almost 5 years. \n\n* Younger women had no problem with it. \n* Put together younger men had no problem with it. \n* Loser young men and older women hated it, eye daggers galore. \n* Older men loved it, shooting me grins and the occasional thumbs up.",
            "author": null,
            "id": "fzvqtsp",
            "parent_id": "t3_i18pox",
            "score": 28,
            "created_utc": 1596213060.0,
            "replies": [
                {
                    "body": "Exactly my experience over the years.",
                    "author": "LotBuilder",
                    "id": "fzwggu8",
                    "parent_id": "t1_fzvqtsp",
                    "score": 11,
                    "created_utc": 1596222677.0,
                    "replies": [
                        {
                            "body": "Same as well. Well this past year.",
                            "author": "Color_Me_Blue",
                            "id": "fzy0v84",
                            "parent_id": "t1_fzwggu8",
                            "score": 1,
                            "created_utc": 1596247812.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Certain men on here love to imagine the fantasy that women in their peer group, or close to it, are envious or give a care of their obvious paid date discrepancy. No, sorry, dude, unless you are Brad Pitt attractive for an older man, we do not care or take the time to notice other than have a laugh. If we do notice, we feel sorry for the young girl with her old, pot bellied or dad bod date. If we sugar, we hope they are getting a hefty allowance to compensate for the obvious though.",
                    "author": "honey-_bunny",
                    "id": "g027jby",
                    "parent_id": "t1_fzvqtsp",
                    "score": 3,
                    "created_utc": 1596347255.0,
                    "replies": [
                        {
                            "body": "> No, sorry, dude, unless you are Brad Pitt attractive for an older man\n\nGuilty as charged. I wouldn't have had such a young, hot, and smart girlfriend through the poorest time of my life it I wasn't at least well above average looking, smart, and in the sack. Since she left, I've taken fitness much more seriously. I'm sporting a visible v-taper at a normal BMI, even though I'm pushing 50. \n\n> Certain men on here love to imagine the fantasy that women in their peer group, or close to it, are envious\n\nWomen in my peer group were blindingly envious, because....\n\n> obvious paid date discrepancy\n\nIt was never about the money for me, and still isn't, not least because it's a place I'll never be competitive. \n\nDuring the glory years with that wonderful girl I'm still close with, and will be for life, we were poor as hell. Although, to be fair, her family was 5 miles away. She had a permanent invite back home and money in her purse to get there. \n\n>  If we do notice, we feel sorry for the young girl with her old, pot bellied or dad bod date. If we sugar, we hope they are getting a hefty allowance to compensate for the obvious though.\n\nI joined this sub to probe about \"salt daddy\" game, and your comment kind of nailed it down for me. Keep in mind, *I'm extremely busy, way too busy to present as anything that I'm not*. **I'm not talking about deception in any way.** I'm adulting through this plague like a goddamned warlord. Do you want to come over to drink Coronas and play Pandemic, or not? \n\nI've read the stories about men \"needing a break\" due to a lack of conditioning during sex. I've read the stories of the porn obsessed young men having ED issues. And I read the wonder, on this very sub, about how sugaring sex is so good. \n\nIt's because we older dudes know how to slow our rolls and let our fingers do the talking. She cums first. Always. Unlike many dudes in my cohort, I can follow that with an enthusiastic and athletic railing. \n\nSorry to bang on, but I got the answer I needed from this sub. Women have admitted to me how safe they feel in my arms. I have a brown belt in judo and am active in BJJ. Women feel safe in my arms because if I have to go hands on someone in an altercation, I'm going to be effective. When it comes good looking older men, we don't age like wine, we age like warlords. \n\nTo sum up: Your comment about an allowance to compensate for the obvious crystallized in my mind that it's not so obvious that anyone would need compensation from me. \n\nThen why use Seeking? To put my profile in front of younger women who are open to older lovers, obviously. I'm guessing the ones who would only be with an older man in a sugar arrangement would skip me without batting an eye. I'm seeking the bored and curious, not the desperate. \n\nIf I do sign back up on Seeking, it will be unapologetically salty, straight up, no PPM, no allowance, just a brief respite with a rock amongst raging waters.\n\n\"Unconcerned, mocking, violent: such Wisdom wants us; For she is a woman, and always loves only a warrior.\" *Thus Spoke Zarathustra*",
                            "author": null,
                            "id": "g03vbkb",
                            "parent_id": "t1_g027jby",
                            "score": 2,
                            "created_utc": 1596381102.0,
                            "replies": [
                                {
                                    "body": "5 miles is 8.05 km",
                                    "author": "converter-bot",
                                    "id": "g03vcsh",
                                    "parent_id": "t1_g03vbkb",
                                    "score": 1,
                                    "created_utc": 1596381117.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Reason eight billion I never have MnGs in coffee shops. I always try to go public places we have privacy to actually talk. Restaurants with big booths, banquettes, and plenty of space between us and other people.",
            "author": null,
            "id": "fzwxw5f",
            "parent_id": "t3_i18pox",
            "score": 5,
            "created_utc": 1596230361.0,
            "replies": [
                {
                    "body": "Exactly, terrible place for a m&g.",
                    "author": "sirthunksalot",
                    "id": "fzytrko",
                    "parent_id": "t1_fzwxw5f",
                    "score": 1,
                    "created_utc": 1596270254.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Understand that sugar babies are an existential threat to Karens’ dating prospects. When I did some reading on female intrasexual competition in the context of evolutionary biology it brought clarity to a lot of things. Women police other women’s sexual behavior ruthlessly. It’s not the men who want laws against women going topless, or men protesting outside brothels in Europe. I’d even go so far as to say that much of FOSTA/SESTA comes from the wellspring of female intrasexual competition — or at least the support for it does. After viewing news stories showing smoking hot Russian girls as examples of “illegal immigrants”, American women’s support for more restrictions on illegal immigration jumped from “low” to “high”. This was an actual psych experiment, and it was replicated several times. \n\nI’ve always enjoyed chatting up the waitress or whomever and then watching the expression on their face change when my SB shows up and she’s 300 times hotter than they are.",
            "author": "LaGriffeDuLion",
            "id": "fzvkgg8",
            "parent_id": "t3_i18pox",
            "score": 21,
            "created_utc": 1596210638.0,
            "replies": [
                {
                    "body": "That totally makes sense. This woman was older maybe like 60-70 and honestly I think she just had a regressive mindset. Just wish she wouldn't externalize that w/o provocation when I don't do the same to her.",
                    "author": "kittiesntrees",
                    "id": "fzvlx63",
                    "parent_id": "t1_fzvkgg8",
                    "score": 11,
                    "created_utc": 1596211151.0,
                    "replies": [
                        {
                            "body": "Understanding that behavior likes this comes from the part of the brain we share with lizards makes it easier for me to put up with people when they engage in it. I remind myself that people are hard-wired for some behavior and can’t really help themselves. It’s made my life a lot more Zen.",
                            "author": "LaGriffeDuLion",
                            "id": "fzvqnzc",
                            "parent_id": "t1_fzvlx63",
                            "score": 15,
                            "created_utc": 1596212994.0,
                            "replies": [
                                {
                                    "body": "HAHAHA I love it. They truly are just acting like lizard people lmao",
                                    "author": "kittiesntrees",
                                    "id": "fzvr3k2",
                                    "parent_id": "t1_fzvqnzc",
                                    "score": 6,
                                    "created_utc": 1596213173.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Your comment got me thinking.  \n\n\nI recently subscribed to a subreddit called \"Female Dating Strategy\", because it **seemed** like a worthwhile resource to have while navigating this next chapter of my life. What I ended up finding there was a bitter community of women who use racist terms to describe the behavior of other women (\"Pickmeisha\", if you're curious), called men who behaved poorly \"scrotes\", and banned me after I posted a comment asking where I fit into the community, if I didn't want to get married, didn't want to have kids, but DID want healthy sexual relationships with multiple men?   \n\n\nWhat you said matches with policing behavior - the subreddit is very aggressive, very strict, and pecks endlessly at behavior it doesn't agree with. I bet they read this comment and ban me for good.   \n\n\nIt's tough, because I surely get jealous, myself - but not to the extent of interrupting someone's day or pushing my agenda on anyone else. I wonder what the rest of my thirties are going to look like, now that I'm just more aware of all of this.",
                    "author": "little_bean_bun",
                    "id": "fzvx19o",
                    "parent_id": "t1_fzvkgg8",
                    "score": 9,
                    "created_utc": 1596215817.0,
                    "replies": [
                        {
                            "body": "I'm so sorry that happened to you love, stuff like that can cut deep. I'm young but I'm in the same boat wrt not wanting a traditional family or kids, and I'm already starting to get policing comments about it. When I step back from the hurt for a minute, it's easier to see how ridiculous these people are. Like ummm y'all really know me after like 10 minutes of chatting or eavesdropping, huh? People like this interact with us like symbols instead of real people, and knowing that they're not actually against me as a person (how could they be? They don't know me!) helps me with some perspective. Sending light and love! Always down to chat if you want support!",
                            "author": "kittiesntrees",
                            "id": "fzvyfut",
                            "parent_id": "t1_fzvx19o",
                            "score": 4,
                            "created_utc": 1596216424.0,
                            "replies": [
                                {
                                    "body": "\"People like this interact with us like symbols instead of real people, and knowing that they're not actually against me as a person (how could they be? They don't know me!) helps me with some perspective.\"  \n\n\nThis is true, and kind, and lovely. I'm guessing those are also qualities you possess! Not hard to see how you found such a cute and cool SD, congratulations to you! I just might reach out, thank you <3 And good for you, knowing what you want and don't want.   \n\n\nAlso, I would like to point out that this is a far more human reply than I ever got in that dang subreddit. Thanks for being legit.",
                                    "author": "little_bean_bun",
                                    "id": "fzwc6rg",
                                    "parent_id": "t1_fzvyfut",
                                    "score": 2,
                                    "created_utc": 1596221069.0,
                                    "replies": [
                                        {
                                            "body": "❤️",
                                            "author": "kittiesntrees",
                                            "id": "fzwx0go",
                                            "parent_id": "t1_fzwc6rg",
                                            "score": 1,
                                            "created_utc": 1596230089.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "What do you imagine they think of Meghan Markle?",
                            "author": "TY2022",
                            "id": "fzw23i2",
                            "parent_id": "t1_fzvx19o",
                            "score": 5,
                            "created_utc": 1596217736.0,
                            "replies": [
                                {
                                    "body": "I don't even want to know.",
                                    "author": "little_bean_bun",
                                    "id": "fzwc8k2",
                                    "parent_id": "t1_fzw23i2",
                                    "score": 2,
                                    "created_utc": 1596221087.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "For all the talk in the sisterhood about “empowering” each other, women’s actual behavior is more like “crabs in a basket”. You don’t actually have to put a cover on a basket of crabs because any time a crab climbs up to get out of the basket the other crabs will pull it back down. Part of the key to getting past that is to understand and accept that it is deeply hard-wired behavior and when you’re being judgy about it, really it’s Mother Nature who’s being the biatch and less so the actual person.",
                            "author": "LaGriffeDuLion",
                            "id": "fzvyo9k",
                            "parent_id": "t1_fzvx19o",
                            "score": 3,
                            "created_utc": 1596216507.0,
                            "replies": [
                                {
                                    "body": "Hmm, even more to think about. I have several long-standing strong female friendships, but none of us are in competition with each other. I think because we each have different \"zones of power\" if that makes sense. Our careers are in separate arenas, some of us value children and family, some of us value travel, some of us value time alone! I would say we see each other as equals, and I think it helps us all feel valued.   \n\n\nHOWEVER, I sure have seen what it's like when a woman feels threatened by another. It's not cute. I'll keep my inner Mother Nature in mind, thanks! Haha.",
                                    "author": "little_bean_bun",
                                    "id": "fzwcnv2",
                                    "parent_id": "t1_fzvyo9k",
                                    "score": 3,
                                    "created_utc": 1596221237.0,
                                    "replies": []
                                },
                                {
                                    "body": "Excellent point - the behavior of one female (or male) crab is pretty much the same as the behavior of another female (or male) crab. Likewise, the behavior of one female (or male) human is pretty much the same as the behavior of another female (or male) human.\n\nSophie Scholl the same as Ilse Koch.",
                                    "author": "highfructoseSD",
                                    "id": "fzyc82a",
                                    "parent_id": "t1_fzvyo9k",
                                    "score": -2,
                                    "created_utc": 1596255086.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That experiment had to be hilarious to run.",
                    "author": "LotBuilder",
                    "id": "fzwfsk9",
                    "parent_id": "t1_fzvkgg8",
                    "score": 2,
                    "created_utc": 1596222403.0,
                    "replies": []
                },
                {
                    "body": "> I’d even go so far as to say that much of FOSTA/SESTA comes from the wellspring of female intrasexual competition — or at least the support for it does\n\n100%",
                    "author": null,
                    "id": "fzwhzuf",
                    "parent_id": "t1_fzvkgg8",
                    "score": 2,
                    "created_utc": 1596223332.0,
                    "replies": []
                },
                {
                    "body": "I was just thinking of this idea yesterday and wondering if I could read a concept on it and now you presented it to me! Thank you!",
                    "author": "bluebarebear",
                    "id": "fzxe72e",
                    "parent_id": "t1_fzvkgg8",
                    "score": 2,
                    "created_utc": 1596235756.0,
                    "replies": []
                },
                {
                    "body": "Karens...what an ageist term. What is the male version of the Karen bc I see many men in life and online constantly whining away. Is he the Mike or Ken.. Saggy old wrinkly balled Ken who is mad he cannot get his PPM cheaper or whines that his platonic date is expected to be compensated. \n\nYour SB is 300 times hotter than the waitress and she is so envious?...umm hmmm. What a load of fiction fantasy writing delusion going on in your Ken head. 😂",
                    "author": "honey-_bunny",
                    "id": "g029env",
                    "parent_id": "t1_fzvkgg8",
                    "score": 1,
                    "created_utc": 1596348899.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Depending on the location, this is a real problem. You want to make it even more explosive, sit with a older guy of a different race. IMO, SD's should be street smart to figure out locales/times where such meetings would fly below the radar.",
            "author": "nthcoming",
            "id": "fzwj1c7",
            "parent_id": "t3_i18pox",
            "score": 3,
            "created_utc": 1596223784.0,
            "replies": [
                {
                    "body": "HAHAHAH it's funny you say that because I outwardly look black and the pot was white oops",
                    "author": "kittiesntrees",
                    "id": "fzx30qr",
                    "parent_id": "t1_fzwj1c7",
                    "score": 2,
                    "created_utc": 1596231932.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Would have been great to see their reaction had you two walked out and you gave him a deep kiss in full view of them. The pearl-clutching would have been epic.",
            "author": "mraspencer",
            "id": "fzvakur",
            "parent_id": "t3_i18pox",
            "score": 8,
            "created_utc": 1596207327.0,
            "replies": [
                {
                    "body": "Right? Lmao, now I wish I had!",
                    "author": "kittiesntrees",
                    "id": "fzvb0g2",
                    "parent_id": "t1_fzvakur",
                    "score": 2,
                    "created_utc": 1596207465.0,
                    "replies": []
                },
                {
                    "body": "Then you double down and in your most sex kitten voice say, “I missed you, Daddy/Uncle/Father/whatever other male title that will skeeve Karen our”",
                    "author": "weirdling_dreams",
                    "id": "fzvpay4",
                    "parent_id": "t1_fzvakur",
                    "score": 5,
                    "created_utc": 1596212448.0,
                    "replies": []
                },
                {
                    "body": "It takes a certain boldness, but if ever someone from \"conservative mainstream\" society ever tries to sugar shame me or my SB/SGF, I really hope I'll be able to throw it in their face w an epic speech and lewd pda",
                    "author": "Gemini-Fox",
                    "id": "fzvhrdj",
                    "parent_id": "t1_fzvakur",
                    "score": 7,
                    "created_utc": 1596209748.0,
                    "replies": [
                        {
                            "body": "Ayyy, you'd get nothing but snaps from me! Love to see it!",
                            "author": "kittiesntrees",
                            "id": "fzvhztm",
                            "parent_id": "t1_fzvhrdj",
                            "score": 3,
                            "created_utc": 1596209836.0,
                            "replies": []
                        },
                        {
                            "body": "I was in a luxury box at a warriors game with my SB and her best friend.  Our host got us settled in but left in the first quarter .  The box next to us had a few Karen’s and their husbands.  The Karen’s got mad because their husbands were staring at my girls.  Both girls  looked hot with ripped jeans, thigh high boots and low cut silk blouses.   My SB strattled me on a love seat and her GF jumped on behind her for a triple kiss.  I think their heads almost exploded.",
                            "author": "LotBuilder",
                            "id": "fzwhmgj",
                            "parent_id": "t1_fzvhrdj",
                            "score": 5,
                            "created_utc": 1596223168.0,
                            "replies": [
                                {
                                    "body": "Oh my God I LOVE THIS!!!! Once, just once in my life, I want to have that sort of undiluted pleasure",
                                    "author": "kittiesntrees",
                                    "id": "fzwxwq3",
                                    "parent_id": "t1_fzwhmgj",
                                    "score": 1,
                                    "created_utc": 1596230366.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "In the moment sometimes it’s hard to find the perfect solution to those types of situations, but at the heart of things at least you 1. Aren’t doing anything illegal 2. Are enjoying yourself 3. And we’re respectful to the people around you (with lowered voices) at that point I think she just hasn’t got laid or maybe she’s having a rough life.",
            "author": null,
            "id": "fzvz7ju",
            "parent_id": "t3_i18pox",
            "score": 4,
            "created_utc": 1596216691.0,
            "replies": []
        },
        {
            "body": "Honestly, I've gone to the outside tables if it's too crowded inside. I dont like too many people listening either.",
            "author": "dade_murphy1",
            "id": "fzwhitw",
            "parent_id": "t3_i18pox",
            "score": 2,
            "created_utc": 1596223129.0,
            "replies": [
                {
                    "body": "Mmm that's a good idea! Might try asking by POT to move next time!",
                    "author": "kittiesntrees",
                    "id": "fzwy5bk",
                    "parent_id": "t1_fzwhitw",
                    "score": 3,
                    "created_utc": 1596230443.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ugh I’ve had a similar situation in a coffee shop. So embarrassing.",
            "author": "OpheliaArtBaby",
            "id": "fzx9eui",
            "parent_id": "t3_i18pox",
            "score": 2,
            "created_utc": 1596234061.0,
            "replies": [
                {
                    "body": "Oof I'm sorry. Welcome to the never going back gang, nice to meet u!",
                    "author": "kittiesntrees",
                    "id": "fzxf898",
                    "parent_id": "t1_fzx9eui",
                    "score": 2,
                    "created_utc": 1596236238.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow. A Karen and an incel. Those are rare. I hope you got a photo.",
            "author": "TastySpermDispenser",
            "id": "fzvcpml",
            "parent_id": "t3_i18pox",
            "score": 4,
            "created_utc": 1596208035.0,
            "replies": [
                {
                    "body": "I didn't even think of that. Wish I'd either winked at her or taken a picture of her when she pointed that finger at me. These women really have no boundaries!",
                    "author": "kittiesntrees",
                    "id": "fzvd4sf",
                    "parent_id": "t1_fzvcpml",
                    "score": 5,
                    "created_utc": 1596208169.0,
                    "replies": []
                },
                {
                    "body": "start a new sub for karencels. lmaooo",
                    "author": "poofymon",
                    "id": "fzw115c",
                    "parent_id": "t1_fzvcpml",
                    "score": 4,
                    "created_utc": 1596217348.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Would it be trashy if I leaned in to kiss the POT and showed Karen the finger as I gave him a passionate kiss?",
            "author": "InnocentSweetTooth",
            "id": "fzveq64",
            "parent_id": "t3_i18pox",
            "score": 5,
            "created_utc": 1596208681.0,
            "replies": [
                {
                    "body": "Trashy was a word invented by women that wish they could, straight loving these vibes",
                    "author": "kittiesntrees",
                    "id": "fzvfhly",
                    "parent_id": "t1_fzveq64",
                    "score": 9,
                    "created_utc": 1596208941.0,
                    "replies": []
                },
                {
                    "body": "Omg y'all this thread is life!! Love the idea, screw Karen!!!",
                    "author": "banananinja786",
                    "id": "fzvliff",
                    "parent_id": "t1_fzveq64",
                    "score": 3,
                    "created_utc": 1596211011.0,
                    "replies": [
                        {
                            "body": "Right? Let's get some empowerment going up in here 😤 😩",
                            "author": "kittiesntrees",
                            "id": "fzvpeyb",
                            "parent_id": "t1_fzvliff",
                            "score": 3,
                            "created_utc": 1596212492.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That picture is something else. I am very certain that was a female poster who does not have any luck with SDs.\n\n----\n\nSorry about the Karen. I hate Karens.",
            "author": "BigBearSD",
            "id": "fzwhzwt",
            "parent_id": "t3_i18pox",
            "score": 4,
            "created_utc": 1596223333.0,
            "replies": []
        },
        {
            "body": "Standing at the host stand with my SD years ago, a lady at a nearby table exclaimed rather loudly how she wished she had a sugar daddy too! When the host led us past their table I squeezed my Daddy’s hand and told him how sad I felt for the women that had to go Dutch if they ever wanted a date, bless her poor heart.",
            "author": null,
            "id": "fzvgqds",
            "parent_id": "t3_i18pox",
            "score": 3,
            "created_utc": 1596209382.0,
            "replies": []
        },
        {
            "body": "Would it have been wrong to text your POT along the lines of \"Follow my lead, I want to play this up to our audience to my right\" and just start talking a \\*bit\\* louder and a \\*bit\\* more graphically/in detail just to see Karen's reaction?\n\nOn second thought, maybe not with a pot, but with someone a bit more established lol",
            "author": "Patrucio71",
            "id": "fzvr054",
            "parent_id": "t3_i18pox",
            "score": 4,
            "created_utc": 1596213133.0,
            "replies": [
                {
                    "body": "Yeah, I would probably do this with an SD over a POT but if I thought he might be with the shit's I'd go for it",
                    "author": "kittiesntrees",
                    "id": "fzvrdpq",
                    "parent_id": "t1_fzvr054",
                    "score": 3,
                    "created_utc": 1596213290.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Next time a \"Karen\" glares at you give her the \"lollipop sucking maneuver with a nice smile behind that mouthful",
            "author": "GSSD",
            "id": "fzwdjzj",
            "parent_id": "t3_i18pox",
            "score": 3,
            "created_utc": 1596221553.0,
            "replies": []
        },
        {
            "body": "Wishes she was young again.",
            "author": "TY2022",
            "id": "fzvli9b",
            "parent_id": "t3_i18pox",
            "score": 2,
            "created_utc": 1596211009.0,
            "replies": []
        },
        {
            "body": "They would give you the stink eye whether money was invoked or not.",
            "author": "TY2022",
            "id": "fzw1i21",
            "parent_id": "t3_i18pox",
            "score": 2,
            "created_utc": 1596217526.0,
            "replies": [
                {
                    "body": "Honestly, you know, I think you're right. Looks like the younger generations will be changing that and I'm here for it!",
                    "author": "kittiesntrees",
                    "id": "fzwy2eg",
                    "parent_id": "t1_fzw1i21",
                    "score": 2,
                    "created_utc": 1596230416.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is why all my meetings are places that I can have a semi private conversation.",
            "author": "EvilDomGM",
            "id": "fzwfssw",
            "parent_id": "t3_i18pox",
            "score": 2,
            "created_utc": 1596222406.0,
            "replies": []
        },
        {
            "body": "\"I could care less.\" Didn't even read the wall of text Karen 2 sent you, that line invalidated it all anyways.",
            "author": "yeehaw_yall",
            "id": "fzwm12b",
            "parent_id": "t3_i18pox",
            "score": 2,
            "created_utc": 1596225221.0,
            "replies": [
                {
                    "body": "AHHAHAHAAHA AND THAT'S ON KARMA",
                    "author": "kittiesntrees",
                    "id": "fzx399l",
                    "parent_id": "t1_fzwm12b",
                    "score": 2,
                    "created_utc": 1596232011.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My wife has taken to watching “Karen videos” of women having face mask tantrums.  \n\nThe combination of giggles & shocked look of horror reminds me of why I married her. \n\nThese women are so bitter & full of self hatred I actually find myself feeling sorry for them more then hating them (which I do a little)",
            "author": "BGDDDY1",
            "id": "fzy0t2b",
            "parent_id": "t3_i18pox",
            "score": 2,
            "created_utc": 1596247776.0,
            "replies": []
        },
        {
            "body": "I have asked this question to people like this before:\n\n“Are you offended, or are you jealous?”",
            "author": "TheRockateer75",
            "id": "fzzaqwl",
            "parent_id": "t3_i18pox",
            "score": 1,
            "created_utc": 1596286990.0,
            "replies": []
        },
        {
            "body": "Social distancing is falling you if that Karen was older and could hear you from 2 metres away. 😂",
            "author": "InnerRadio7",
            "id": "g055my6",
            "parent_id": "t3_i18pox",
            "score": 1,
            "created_utc": 1596402811.0,
            "replies": []
        },
        {
            "body": "I’ve noticed that from my 30s and now to my late 30s that my dating prospects have increased greatly.  Seems like the opposite is true for women who age into their 30s.  If men like me are reaching into girls in their 20s then it makes sense bitter Karen’s would hate this.",
            "author": "midwestsweetking",
            "id": "g083580",
            "parent_id": "t3_i18pox",
            "score": 1,
            "created_utc": 1596472256.0,
            "replies": []
        },
        {
            "body": "Live and let live!  We are all adults. We make our own choices.  Good or bad just mind ya business K.",
            "author": "Beesweet1976",
            "id": "fzw39ce",
            "parent_id": "t3_i18pox",
            "score": 1,
            "created_utc": 1596218159.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzw27wn",
            "parent_id": "t1_fzvnnzc",
            "score": 34,
            "created_utc": 1596217780.0,
            "replies": [
                {
                    "body": "BINGO",
                    "author": "AFSMSgt",
                    "id": "fzweoc7",
                    "parent_id": "t1_fzw27wn",
                    "score": 8,
                    "created_utc": 1596221963.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly! If I weren't with my POT, I'd have given that woman a talking to, smh this woman needs to mind my temper",
            "author": "kittiesntrees",
            "id": "fzvaxrd",
            "parent_id": "t1_fzvafjn",
            "score": 15,
            "created_utc": 1596207442.0,
            "replies": []
        },
        {
            "body": "No dear, she is not jealous--who knows, she might have a 'wealthy' husband who spends much more on her than a few hundred, or even thousand a week ;-)\n\nSex work is looked down on..always has and most likely always will be. I do not think she should have been rude (and, eavesdropping is rude), to the young girl but maybe, they were talking about money, details of the arrangement or he was married..and, those tables at coffee shops are close and it is usually quiet? The fact is that if you put it out in the open people will judge. It is the nature of the beast.\n\nI went out with obnoxious man 'SD' at a classy bar once. I frequented it often, so I was ashamed to ever go back for a LONG time. He was very good looking guy, too...my age but he was LOUD. He brought me FIVE BENJAMINS (Ben Franklin's) for meeting for a drink (no, I did not ask), then handed it to me in an envelope. When I went to the bathroom, he asked loudly, 'did you count it in the bathroom?'...I was mortified as a group of young people (men AND women--my/ our age) were sitting next to us listening. They were not \"karen's\" but a group of people trying to have a nice night out without hearing about 'an arrangement' being discussed at the next table. I would have been giggling and listening, too.\n\nMy advice: Go somewhere the tables are far enough apart from snooping nosy ears and speak quietly...",
            "author": null,
            "id": "fzwxji9",
            "parent_id": "t1_fzvafjn",
            "score": 14,
            "created_utc": 1596230250.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fzx8vni",
                    "parent_id": "t1_fzwxji9",
                    "score": 7,
                    "created_utc": 1596233887.0,
                    "replies": [
                        {
                            "body": "Yes! It was so embarrassing and even though he 'gifted' a 'meet and greet' gift that so many 'SD's' are against, it still was NOT worth it. \n\nScreen girls...screen. Screen with the finest mesh screen you can use.",
                            "author": null,
                            "id": "fzxcsj1",
                            "parent_id": "t1_fzx8vni",
                            "score": 10,
                            "created_utc": 1596235185.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This^^^",
                    "author": "testing1to3",
                    "id": "fzx15s1",
                    "parent_id": "t1_fzwxji9",
                    "score": 4,
                    "created_utc": 1596231349.0,
                    "replies": []
                },
                {
                    "body": "Honestly yeah thank God I never go to this coffee shop. I won't be going there again without a big makeover",
                    "author": "kittiesntrees",
                    "id": "fzx2l2b",
                    "parent_id": "t1_fzwxji9",
                    "score": 3,
                    "created_utc": 1596231786.0,
                    "replies": [
                        {
                            "body": "Yes, the men need to understand that we need our discretion, too. Our careers might be on the line and people judge...A very high allowance helps this problem somewhat.",
                            "author": null,
                            "id": "fzxdbkc",
                            "parent_id": "t1_fzx2l2b",
                            "score": 7,
                            "created_utc": 1596235378.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">He brought me five hundred benjis for meeting for a drink\n\nHe brought you $50,000 in cash just for meeting for a drink?",
                    "author": "Sanctemagne",
                    "id": "fzxed6m",
                    "parent_id": "t1_fzwxji9",
                    "score": 1,
                    "created_utc": 1596235835.0,
                    "replies": [
                        {
                            "body": "typo....I got in trouble for typing an amount. You will, too, so better change it.",
                            "author": null,
                            "id": "fzxfmzr",
                            "parent_id": "t1_fzxed6m",
                            "score": 3,
                            "created_utc": 1596236430.0,
                            "replies": [
                                {
                                    "body": "Ah, true. Thanks for the heads up :)",
                                    "author": "Sanctemagne",
                                    "id": "fzxg3sq",
                                    "parent_id": "t1_fzxfmzr",
                                    "score": 1,
                                    "created_utc": 1596236655.0,
                                    "replies": [
                                        {
                                            "body": "You're welcome. (: Although, this reddit sub might not count it with an extra zero or two, lol.",
                                            "author": null,
                                            "id": "fzxgaam",
                                            "parent_id": "t1_fzxg3sq",
                                            "score": 3,
                                            "created_utc": 1596236738.0,
                                            "replies": [
                                                {
                                                    "body": "You never know, haha. Maybe I'll just leave it then and see ;)",
                                                    "author": "Sanctemagne",
                                                    "id": "fzxgs5w",
                                                    "parent_id": "t1_fzxgaam",
                                                    "score": 1,
                                                    "created_utc": 1596236979.0,
                                                    "replies": [
                                                        {
                                                            "body": "haha! (((: Extra zeros make all of us girls so happy!",
                                                            "author": null,
                                                            "id": "fzxhqkk",
                                                            "parent_id": "t1_fzxgs5w",
                                                            "score": 3,
                                                            "created_utc": 1596237435.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Well I do make it my business to always give my girls plenty of extra 0s and extra Os ;)",
                                                                    "author": "Sanctemagne",
                                                                    "id": "fzxie2x",
                                                                    "parent_id": "t1_fzxhqkk",
                                                                    "score": 2,
                                                                    "created_utc": 1596237741.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fzwwg39",
            "parent_id": "t1_fzvafjn",
            "score": 1,
            "created_utc": 1596229936.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "fzwwg65",
                    "parent_id": "t1_fzwwg39",
                    "score": 1,
                    "created_utc": 1596229937.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You know the vibes",
            "author": "kittiesntrees",
            "id": "fzvd6up",
            "parent_id": "t1_fzvbmgl",
            "score": 8,
            "created_utc": 1596208185.0,
            "replies": []
        },
        {
            "body": "Omg that's so true. Should be the SA catchphrase",
            "author": "kittiesntrees",
            "id": "fzvrhe5",
            "parent_id": "t1_fzvr4te",
            "score": 13,
            "created_utc": 1596213335.0,
            "replies": []
        },
        {
            "body": "HAVE Y'ALL NEVER HEARD OF EXAGGERATION?? This woman was just trying to make the point that she's gorgeous  cachet to many men, who are jealous, and threatening to many women, who are also jealous. She knows her self worth. Why do we have to shit on a woman every time she expresses that she's beautiful and desirable? \n\nALSO this is a cute line. Stop being literalists please. These kinds of \"women are so vain\" comments harm self esteem when we've already got enough keeping us down. That goes for men and women alike. We can all be dapper queens who appreciate our self worth and physical standing.",
            "author": "kittiesntrees",
            "id": "fzxf3kg",
            "parent_id": "t1_fzvr4te",
            "score": 5,
            "created_utc": 1596236177.0,
            "replies": [
                {
                    "body": "You’re shitting on women saying we are “jealous” of this rando narc",
                    "author": "Driftwould92",
                    "id": "fzzdxpa",
                    "parent_id": "t1_fzxf3kg",
                    "score": 0,
                    "created_utc": 1596289289.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well now.. that is definitely a self absorbed way of feeling out a room",
            "author": "shadadada",
            "id": "fzwj34t",
            "parent_id": "t1_fzvr4te",
            "score": 1,
            "created_utc": 1596223807.0,
            "replies": [
                {
                    "body": "Implying that any level of being self absorbed is bad? Implying that you think this phrase isn't true 99% of the time for a M&G?",
                    "author": "yeehaw_yall",
                    "id": "fzwmb0n",
                    "parent_id": "t1_fzwj34t",
                    "score": 6,
                    "created_utc": 1596225360.0,
                    "replies": [
                        {
                            "body": "This isn’t any level though.. this seems like a very high level of being self obsessed. So no i don’t think you have to be conceited in order to meet someone.. \n\nTo each their own; do and enjoy the things you enjoy if that’s what you want out of life. But when this conceited “life mantra” is presented here to influence the narrative of this social interaction i think it’s important to remind that very same person that hey; a good amount of people in this restaurant are not competitively comparing their life to yours as you maybe. \n\nI suppose it probably helps ease himself into thinking better of himself? But i can confidently say most people are not immediately envious of a dude they saw for 30 seconds at a bar with a girl half his senior.",
                            "author": "shadadada",
                            "id": "fzwoin1",
                            "parent_id": "t1_fzwmb0n",
                            "score": -1,
                            "created_utc": 1596226485.0,
                            "replies": [
                                {
                                    "body": "Depends on the girl, non? When this one walked into a bar with a live band, sometimes a drummer would lose his rhythm. 😉",
                                    "author": "LaGriffeDuLion",
                                    "id": "fzws679",
                                    "parent_id": "t1_fzwoin1",
                                    "score": 9,
                                    "created_utc": 1596228249.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Man what a bunch of sour grapes-consuming grumplestiltskins smh.  I would've thought the \"grin to me\" bit would've been enough to indicate a certain level of facetiousness, but here we are.\n\nAlso v true and I lol'd.  She sounds like a fun lady.",
            "author": null,
            "id": "fzyyzrp",
            "parent_id": "t1_fzvr4te",
            "score": 1,
            "created_utc": 1596275839.0,
            "replies": []
        },
        {
            "body": "Yuck it’s off putting to think so highly of ones self . It’s bordering narcissistic. No one cares",
            "author": "Driftwould92",
            "id": "fzx957r",
            "parent_id": "t1_fzvr4te",
            "score": -3,
            "created_utc": 1596233975.0,
            "replies": []
        },
        {
            "body": "Yeah :(( my POT picked the place. It probably should have been more private given that we met pretty early in the morning but ah well! She doesn't know either of our names so I figure we're ok.",
            "author": "kittiesntrees",
            "id": "fzvfop8",
            "parent_id": "t1_fzvel5o",
            "score": 6,
            "created_utc": 1596209015.0,
            "replies": []
        },
        {
            "body": "Exactly my experience over the years.",
            "author": "LotBuilder",
            "id": "fzwggu8",
            "parent_id": "t1_fzvqtsp",
            "score": 11,
            "created_utc": 1596222677.0,
            "replies": [
                {
                    "body": "Same as well. Well this past year.",
                    "author": "Color_Me_Blue",
                    "id": "fzy0v84",
                    "parent_id": "t1_fzwggu8",
                    "score": 1,
                    "created_utc": 1596247812.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Certain men on here love to imagine the fantasy that women in their peer group, or close to it, are envious or give a care of their obvious paid date discrepancy. No, sorry, dude, unless you are Brad Pitt attractive for an older man, we do not care or take the time to notice other than have a laugh. If we do notice, we feel sorry for the young girl with her old, pot bellied or dad bod date. If we sugar, we hope they are getting a hefty allowance to compensate for the obvious though.",
            "author": "honey-_bunny",
            "id": "g027jby",
            "parent_id": "t1_fzvqtsp",
            "score": 3,
            "created_utc": 1596347255.0,
            "replies": [
                {
                    "body": "> No, sorry, dude, unless you are Brad Pitt attractive for an older man\n\nGuilty as charged. I wouldn't have had such a young, hot, and smart girlfriend through the poorest time of my life it I wasn't at least well above average looking, smart, and in the sack. Since she left, I've taken fitness much more seriously. I'm sporting a visible v-taper at a normal BMI, even though I'm pushing 50. \n\n> Certain men on here love to imagine the fantasy that women in their peer group, or close to it, are envious\n\nWomen in my peer group were blindingly envious, because....\n\n> obvious paid date discrepancy\n\nIt was never about the money for me, and still isn't, not least because it's a place I'll never be competitive. \n\nDuring the glory years with that wonderful girl I'm still close with, and will be for life, we were poor as hell. Although, to be fair, her family was 5 miles away. She had a permanent invite back home and money in her purse to get there. \n\n>  If we do notice, we feel sorry for the young girl with her old, pot bellied or dad bod date. If we sugar, we hope they are getting a hefty allowance to compensate for the obvious though.\n\nI joined this sub to probe about \"salt daddy\" game, and your comment kind of nailed it down for me. Keep in mind, *I'm extremely busy, way too busy to present as anything that I'm not*. **I'm not talking about deception in any way.** I'm adulting through this plague like a goddamned warlord. Do you want to come over to drink Coronas and play Pandemic, or not? \n\nI've read the stories about men \"needing a break\" due to a lack of conditioning during sex. I've read the stories of the porn obsessed young men having ED issues. And I read the wonder, on this very sub, about how sugaring sex is so good. \n\nIt's because we older dudes know how to slow our rolls and let our fingers do the talking. She cums first. Always. Unlike many dudes in my cohort, I can follow that with an enthusiastic and athletic railing. \n\nSorry to bang on, but I got the answer I needed from this sub. Women have admitted to me how safe they feel in my arms. I have a brown belt in judo and am active in BJJ. Women feel safe in my arms because if I have to go hands on someone in an altercation, I'm going to be effective. When it comes good looking older men, we don't age like wine, we age like warlords. \n\nTo sum up: Your comment about an allowance to compensate for the obvious crystallized in my mind that it's not so obvious that anyone would need compensation from me. \n\nThen why use Seeking? To put my profile in front of younger women who are open to older lovers, obviously. I'm guessing the ones who would only be with an older man in a sugar arrangement would skip me without batting an eye. I'm seeking the bored and curious, not the desperate. \n\nIf I do sign back up on Seeking, it will be unapologetically salty, straight up, no PPM, no allowance, just a brief respite with a rock amongst raging waters.\n\n\"Unconcerned, mocking, violent: such Wisdom wants us; For she is a woman, and always loves only a warrior.\" *Thus Spoke Zarathustra*",
                    "author": null,
                    "id": "g03vbkb",
                    "parent_id": "t1_g027jby",
                    "score": 2,
                    "created_utc": 1596381102.0,
                    "replies": [
                        {
                            "body": "5 miles is 8.05 km",
                            "author": "converter-bot",
                            "id": "g03vcsh",
                            "parent_id": "t1_g03vbkb",
                            "score": 1,
                            "created_utc": 1596381117.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly, terrible place for a m&g.",
            "author": "sirthunksalot",
            "id": "fzytrko",
            "parent_id": "t1_fzwxw5f",
            "score": 1,
            "created_utc": 1596270254.0,
            "replies": []
        },
        {
            "body": "That totally makes sense. This woman was older maybe like 60-70 and honestly I think she just had a regressive mindset. Just wish she wouldn't externalize that w/o provocation when I don't do the same to her.",
            "author": "kittiesntrees",
            "id": "fzvlx63",
            "parent_id": "t1_fzvkgg8",
            "score": 11,
            "created_utc": 1596211151.0,
            "replies": [
                {
                    "body": "Understanding that behavior likes this comes from the part of the brain we share with lizards makes it easier for me to put up with people when they engage in it. I remind myself that people are hard-wired for some behavior and can’t really help themselves. It’s made my life a lot more Zen.",
                    "author": "LaGriffeDuLion",
                    "id": "fzvqnzc",
                    "parent_id": "t1_fzvlx63",
                    "score": 15,
                    "created_utc": 1596212994.0,
                    "replies": [
                        {
                            "body": "HAHAHA I love it. They truly are just acting like lizard people lmao",
                            "author": "kittiesntrees",
                            "id": "fzvr3k2",
                            "parent_id": "t1_fzvqnzc",
                            "score": 6,
                            "created_utc": 1596213173.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Your comment got me thinking.  \n\n\nI recently subscribed to a subreddit called \"Female Dating Strategy\", because it **seemed** like a worthwhile resource to have while navigating this next chapter of my life. What I ended up finding there was a bitter community of women who use racist terms to describe the behavior of other women (\"Pickmeisha\", if you're curious), called men who behaved poorly \"scrotes\", and banned me after I posted a comment asking where I fit into the community, if I didn't want to get married, didn't want to have kids, but DID want healthy sexual relationships with multiple men?   \n\n\nWhat you said matches with policing behavior - the subreddit is very aggressive, very strict, and pecks endlessly at behavior it doesn't agree with. I bet they read this comment and ban me for good.   \n\n\nIt's tough, because I surely get jealous, myself - but not to the extent of interrupting someone's day or pushing my agenda on anyone else. I wonder what the rest of my thirties are going to look like, now that I'm just more aware of all of this.",
            "author": "little_bean_bun",
            "id": "fzvx19o",
            "parent_id": "t1_fzvkgg8",
            "score": 9,
            "created_utc": 1596215817.0,
            "replies": [
                {
                    "body": "I'm so sorry that happened to you love, stuff like that can cut deep. I'm young but I'm in the same boat wrt not wanting a traditional family or kids, and I'm already starting to get policing comments about it. When I step back from the hurt for a minute, it's easier to see how ridiculous these people are. Like ummm y'all really know me after like 10 minutes of chatting or eavesdropping, huh? People like this interact with us like symbols instead of real people, and knowing that they're not actually against me as a person (how could they be? They don't know me!) helps me with some perspective. Sending light and love! Always down to chat if you want support!",
                    "author": "kittiesntrees",
                    "id": "fzvyfut",
                    "parent_id": "t1_fzvx19o",
                    "score": 4,
                    "created_utc": 1596216424.0,
                    "replies": [
                        {
                            "body": "\"People like this interact with us like symbols instead of real people, and knowing that they're not actually against me as a person (how could they be? They don't know me!) helps me with some perspective.\"  \n\n\nThis is true, and kind, and lovely. I'm guessing those are also qualities you possess! Not hard to see how you found such a cute and cool SD, congratulations to you! I just might reach out, thank you <3 And good for you, knowing what you want and don't want.   \n\n\nAlso, I would like to point out that this is a far more human reply than I ever got in that dang subreddit. Thanks for being legit.",
                            "author": "little_bean_bun",
                            "id": "fzwc6rg",
                            "parent_id": "t1_fzvyfut",
                            "score": 2,
                            "created_utc": 1596221069.0,
                            "replies": [
                                {
                                    "body": "❤️",
                                    "author": "kittiesntrees",
                                    "id": "fzwx0go",
                                    "parent_id": "t1_fzwc6rg",
                                    "score": 1,
                                    "created_utc": 1596230089.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "What do you imagine they think of Meghan Markle?",
                    "author": "TY2022",
                    "id": "fzw23i2",
                    "parent_id": "t1_fzvx19o",
                    "score": 5,
                    "created_utc": 1596217736.0,
                    "replies": [
                        {
                            "body": "I don't even want to know.",
                            "author": "little_bean_bun",
                            "id": "fzwc8k2",
                            "parent_id": "t1_fzw23i2",
                            "score": 2,
                            "created_utc": 1596221087.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "For all the talk in the sisterhood about “empowering” each other, women’s actual behavior is more like “crabs in a basket”. You don’t actually have to put a cover on a basket of crabs because any time a crab climbs up to get out of the basket the other crabs will pull it back down. Part of the key to getting past that is to understand and accept that it is deeply hard-wired behavior and when you’re being judgy about it, really it’s Mother Nature who’s being the biatch and less so the actual person.",
                    "author": "LaGriffeDuLion",
                    "id": "fzvyo9k",
                    "parent_id": "t1_fzvx19o",
                    "score": 3,
                    "created_utc": 1596216507.0,
                    "replies": [
                        {
                            "body": "Hmm, even more to think about. I have several long-standing strong female friendships, but none of us are in competition with each other. I think because we each have different \"zones of power\" if that makes sense. Our careers are in separate arenas, some of us value children and family, some of us value travel, some of us value time alone! I would say we see each other as equals, and I think it helps us all feel valued.   \n\n\nHOWEVER, I sure have seen what it's like when a woman feels threatened by another. It's not cute. I'll keep my inner Mother Nature in mind, thanks! Haha.",
                            "author": "little_bean_bun",
                            "id": "fzwcnv2",
                            "parent_id": "t1_fzvyo9k",
                            "score": 3,
                            "created_utc": 1596221237.0,
                            "replies": []
                        },
                        {
                            "body": "Excellent point - the behavior of one female (or male) crab is pretty much the same as the behavior of another female (or male) crab. Likewise, the behavior of one female (or male) human is pretty much the same as the behavior of another female (or male) human.\n\nSophie Scholl the same as Ilse Koch.",
                            "author": "highfructoseSD",
                            "id": "fzyc82a",
                            "parent_id": "t1_fzvyo9k",
                            "score": -2,
                            "created_utc": 1596255086.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That experiment had to be hilarious to run.",
            "author": "LotBuilder",
            "id": "fzwfsk9",
            "parent_id": "t1_fzvkgg8",
            "score": 2,
            "created_utc": 1596222403.0,
            "replies": []
        },
        {
            "body": "> I’d even go so far as to say that much of FOSTA/SESTA comes from the wellspring of female intrasexual competition — or at least the support for it does\n\n100%",
            "author": null,
            "id": "fzwhzuf",
            "parent_id": "t1_fzvkgg8",
            "score": 2,
            "created_utc": 1596223332.0,
            "replies": []
        },
        {
            "body": "I was just thinking of this idea yesterday and wondering if I could read a concept on it and now you presented it to me! Thank you!",
            "author": "bluebarebear",
            "id": "fzxe72e",
            "parent_id": "t1_fzvkgg8",
            "score": 2,
            "created_utc": 1596235756.0,
            "replies": []
        },
        {
            "body": "Karens...what an ageist term. What is the male version of the Karen bc I see many men in life and online constantly whining away. Is he the Mike or Ken.. Saggy old wrinkly balled Ken who is mad he cannot get his PPM cheaper or whines that his platonic date is expected to be compensated. \n\nYour SB is 300 times hotter than the waitress and she is so envious?...umm hmmm. What a load of fiction fantasy writing delusion going on in your Ken head. 😂",
            "author": "honey-_bunny",
            "id": "g029env",
            "parent_id": "t1_fzvkgg8",
            "score": 1,
            "created_utc": 1596348899.0,
            "replies": []
        },
        {
            "body": "HAHAHAH it's funny you say that because I outwardly look black and the pot was white oops",
            "author": "kittiesntrees",
            "id": "fzx30qr",
            "parent_id": "t1_fzwj1c7",
            "score": 2,
            "created_utc": 1596231932.0,
            "replies": []
        },
        {
            "body": "Right? Lmao, now I wish I had!",
            "author": "kittiesntrees",
            "id": "fzvb0g2",
            "parent_id": "t1_fzvakur",
            "score": 2,
            "created_utc": 1596207465.0,
            "replies": []
        },
        {
            "body": "Then you double down and in your most sex kitten voice say, “I missed you, Daddy/Uncle/Father/whatever other male title that will skeeve Karen our”",
            "author": "weirdling_dreams",
            "id": "fzvpay4",
            "parent_id": "t1_fzvakur",
            "score": 5,
            "created_utc": 1596212448.0,
            "replies": []
        },
        {
            "body": "It takes a certain boldness, but if ever someone from \"conservative mainstream\" society ever tries to sugar shame me or my SB/SGF, I really hope I'll be able to throw it in their face w an epic speech and lewd pda",
            "author": "Gemini-Fox",
            "id": "fzvhrdj",
            "parent_id": "t1_fzvakur",
            "score": 7,
            "created_utc": 1596209748.0,
            "replies": [
                {
                    "body": "Ayyy, you'd get nothing but snaps from me! Love to see it!",
                    "author": "kittiesntrees",
                    "id": "fzvhztm",
                    "parent_id": "t1_fzvhrdj",
                    "score": 3,
                    "created_utc": 1596209836.0,
                    "replies": []
                },
                {
                    "body": "I was in a luxury box at a warriors game with my SB and her best friend.  Our host got us settled in but left in the first quarter .  The box next to us had a few Karen’s and their husbands.  The Karen’s got mad because their husbands were staring at my girls.  Both girls  looked hot with ripped jeans, thigh high boots and low cut silk blouses.   My SB strattled me on a love seat and her GF jumped on behind her for a triple kiss.  I think their heads almost exploded.",
                    "author": "LotBuilder",
                    "id": "fzwhmgj",
                    "parent_id": "t1_fzvhrdj",
                    "score": 5,
                    "created_utc": 1596223168.0,
                    "replies": [
                        {
                            "body": "Oh my God I LOVE THIS!!!! Once, just once in my life, I want to have that sort of undiluted pleasure",
                            "author": "kittiesntrees",
                            "id": "fzwxwq3",
                            "parent_id": "t1_fzwhmgj",
                            "score": 1,
                            "created_utc": 1596230366.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Mmm that's a good idea! Might try asking by POT to move next time!",
            "author": "kittiesntrees",
            "id": "fzwy5bk",
            "parent_id": "t1_fzwhitw",
            "score": 3,
            "created_utc": 1596230443.0,
            "replies": []
        },
        {
            "body": "Oof I'm sorry. Welcome to the never going back gang, nice to meet u!",
            "author": "kittiesntrees",
            "id": "fzxf898",
            "parent_id": "t1_fzx9eui",
            "score": 2,
            "created_utc": 1596236238.0,
            "replies": []
        },
        {
            "body": "I didn't even think of that. Wish I'd either winked at her or taken a picture of her when she pointed that finger at me. These women really have no boundaries!",
            "author": "kittiesntrees",
            "id": "fzvd4sf",
            "parent_id": "t1_fzvcpml",
            "score": 5,
            "created_utc": 1596208169.0,
            "replies": []
        },
        {
            "body": "start a new sub for karencels. lmaooo",
            "author": "poofymon",
            "id": "fzw115c",
            "parent_id": "t1_fzvcpml",
            "score": 4,
            "created_utc": 1596217348.0,
            "replies": []
        },
        {
            "body": "Trashy was a word invented by women that wish they could, straight loving these vibes",
            "author": "kittiesntrees",
            "id": "fzvfhly",
            "parent_id": "t1_fzveq64",
            "score": 9,
            "created_utc": 1596208941.0,
            "replies": []
        },
        {
            "body": "Omg y'all this thread is life!! Love the idea, screw Karen!!!",
            "author": "banananinja786",
            "id": "fzvliff",
            "parent_id": "t1_fzveq64",
            "score": 3,
            "created_utc": 1596211011.0,
            "replies": [
                {
                    "body": "Right? Let's get some empowerment going up in here 😤 😩",
                    "author": "kittiesntrees",
                    "id": "fzvpeyb",
                    "parent_id": "t1_fzvliff",
                    "score": 3,
                    "created_utc": 1596212492.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, I would probably do this with an SD over a POT but if I thought he might be with the shit's I'd go for it",
            "author": "kittiesntrees",
            "id": "fzvrdpq",
            "parent_id": "t1_fzvr054",
            "score": 3,
            "created_utc": 1596213290.0,
            "replies": []
        },
        {
            "body": "Honestly, you know, I think you're right. Looks like the younger generations will be changing that and I'm here for it!",
            "author": "kittiesntrees",
            "id": "fzwy2eg",
            "parent_id": "t1_fzw1i21",
            "score": 2,
            "created_utc": 1596230416.0,
            "replies": []
        },
        {
            "body": "AHHAHAHAAHA AND THAT'S ON KARMA",
            "author": "kittiesntrees",
            "id": "fzx399l",
            "parent_id": "t1_fzwm12b",
            "score": 2,
            "created_utc": 1596232011.0,
            "replies": []
        },
        {
            "body": "BINGO",
            "author": "AFSMSgt",
            "id": "fzweoc7",
            "parent_id": "t1_fzw27wn",
            "score": 8,
            "created_utc": 1596221963.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzx8vni",
            "parent_id": "t1_fzwxji9",
            "score": 7,
            "created_utc": 1596233887.0,
            "replies": [
                {
                    "body": "Yes! It was so embarrassing and even though he 'gifted' a 'meet and greet' gift that so many 'SD's' are against, it still was NOT worth it. \n\nScreen girls...screen. Screen with the finest mesh screen you can use.",
                    "author": null,
                    "id": "fzxcsj1",
                    "parent_id": "t1_fzx8vni",
                    "score": 10,
                    "created_utc": 1596235185.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This^^^",
            "author": "testing1to3",
            "id": "fzx15s1",
            "parent_id": "t1_fzwxji9",
            "score": 4,
            "created_utc": 1596231349.0,
            "replies": []
        },
        {
            "body": "Honestly yeah thank God I never go to this coffee shop. I won't be going there again without a big makeover",
            "author": "kittiesntrees",
            "id": "fzx2l2b",
            "parent_id": "t1_fzwxji9",
            "score": 3,
            "created_utc": 1596231786.0,
            "replies": [
                {
                    "body": "Yes, the men need to understand that we need our discretion, too. Our careers might be on the line and people judge...A very high allowance helps this problem somewhat.",
                    "author": null,
                    "id": "fzxdbkc",
                    "parent_id": "t1_fzx2l2b",
                    "score": 7,
                    "created_utc": 1596235378.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">He brought me five hundred benjis for meeting for a drink\n\nHe brought you $50,000 in cash just for meeting for a drink?",
            "author": "Sanctemagne",
            "id": "fzxed6m",
            "parent_id": "t1_fzwxji9",
            "score": 1,
            "created_utc": 1596235835.0,
            "replies": [
                {
                    "body": "typo....I got in trouble for typing an amount. You will, too, so better change it.",
                    "author": null,
                    "id": "fzxfmzr",
                    "parent_id": "t1_fzxed6m",
                    "score": 3,
                    "created_utc": 1596236430.0,
                    "replies": [
                        {
                            "body": "Ah, true. Thanks for the heads up :)",
                            "author": "Sanctemagne",
                            "id": "fzxg3sq",
                            "parent_id": "t1_fzxfmzr",
                            "score": 1,
                            "created_utc": 1596236655.0,
                            "replies": [
                                {
                                    "body": "You're welcome. (: Although, this reddit sub might not count it with an extra zero or two, lol.",
                                    "author": null,
                                    "id": "fzxgaam",
                                    "parent_id": "t1_fzxg3sq",
                                    "score": 3,
                                    "created_utc": 1596236738.0,
                                    "replies": [
                                        {
                                            "body": "You never know, haha. Maybe I'll just leave it then and see ;)",
                                            "author": "Sanctemagne",
                                            "id": "fzxgs5w",
                                            "parent_id": "t1_fzxgaam",
                                            "score": 1,
                                            "created_utc": 1596236979.0,
                                            "replies": [
                                                {
                                                    "body": "haha! (((: Extra zeros make all of us girls so happy!",
                                                    "author": null,
                                                    "id": "fzxhqkk",
                                                    "parent_id": "t1_fzxgs5w",
                                                    "score": 3,
                                                    "created_utc": 1596237435.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well I do make it my business to always give my girls plenty of extra 0s and extra Os ;)",
                                                            "author": "Sanctemagne",
                                                            "id": "fzxie2x",
                                                            "parent_id": "t1_fzxhqkk",
                                                            "score": 2,
                                                            "created_utc": 1596237741.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "fzwwg65",
            "parent_id": "t1_fzwwg39",
            "score": 1,
            "created_utc": 1596229937.0,
            "replies": []
        },
        {
            "body": "You’re shitting on women saying we are “jealous” of this rando narc",
            "author": "Driftwould92",
            "id": "fzzdxpa",
            "parent_id": "t1_fzxf3kg",
            "score": 0,
            "created_utc": 1596289289.0,
            "replies": []
        },
        {
            "body": "Implying that any level of being self absorbed is bad? Implying that you think this phrase isn't true 99% of the time for a M&G?",
            "author": "yeehaw_yall",
            "id": "fzwmb0n",
            "parent_id": "t1_fzwj34t",
            "score": 6,
            "created_utc": 1596225360.0,
            "replies": [
                {
                    "body": "This isn’t any level though.. this seems like a very high level of being self obsessed. So no i don’t think you have to be conceited in order to meet someone.. \n\nTo each their own; do and enjoy the things you enjoy if that’s what you want out of life. But when this conceited “life mantra” is presented here to influence the narrative of this social interaction i think it’s important to remind that very same person that hey; a good amount of people in this restaurant are not competitively comparing their life to yours as you maybe. \n\nI suppose it probably helps ease himself into thinking better of himself? But i can confidently say most people are not immediately envious of a dude they saw for 30 seconds at a bar with a girl half his senior.",
                    "author": "shadadada",
                    "id": "fzwoin1",
                    "parent_id": "t1_fzwmb0n",
                    "score": -1,
                    "created_utc": 1596226485.0,
                    "replies": [
                        {
                            "body": "Depends on the girl, non? When this one walked into a bar with a live band, sometimes a drummer would lose his rhythm. 😉",
                            "author": "LaGriffeDuLion",
                            "id": "fzws679",
                            "parent_id": "t1_fzwoin1",
                            "score": 9,
                            "created_utc": 1596228249.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Same as well. Well this past year.",
            "author": "Color_Me_Blue",
            "id": "fzy0v84",
            "parent_id": "t1_fzwggu8",
            "score": 1,
            "created_utc": 1596247812.0,
            "replies": []
        },
        {
            "body": "> No, sorry, dude, unless you are Brad Pitt attractive for an older man\n\nGuilty as charged. I wouldn't have had such a young, hot, and smart girlfriend through the poorest time of my life it I wasn't at least well above average looking, smart, and in the sack. Since she left, I've taken fitness much more seriously. I'm sporting a visible v-taper at a normal BMI, even though I'm pushing 50. \n\n> Certain men on here love to imagine the fantasy that women in their peer group, or close to it, are envious\n\nWomen in my peer group were blindingly envious, because....\n\n> obvious paid date discrepancy\n\nIt was never about the money for me, and still isn't, not least because it's a place I'll never be competitive. \n\nDuring the glory years with that wonderful girl I'm still close with, and will be for life, we were poor as hell. Although, to be fair, her family was 5 miles away. She had a permanent invite back home and money in her purse to get there. \n\n>  If we do notice, we feel sorry for the young girl with her old, pot bellied or dad bod date. If we sugar, we hope they are getting a hefty allowance to compensate for the obvious though.\n\nI joined this sub to probe about \"salt daddy\" game, and your comment kind of nailed it down for me. Keep in mind, *I'm extremely busy, way too busy to present as anything that I'm not*. **I'm not talking about deception in any way.** I'm adulting through this plague like a goddamned warlord. Do you want to come over to drink Coronas and play Pandemic, or not? \n\nI've read the stories about men \"needing a break\" due to a lack of conditioning during sex. I've read the stories of the porn obsessed young men having ED issues. And I read the wonder, on this very sub, about how sugaring sex is so good. \n\nIt's because we older dudes know how to slow our rolls and let our fingers do the talking. She cums first. Always. Unlike many dudes in my cohort, I can follow that with an enthusiastic and athletic railing. \n\nSorry to bang on, but I got the answer I needed from this sub. Women have admitted to me how safe they feel in my arms. I have a brown belt in judo and am active in BJJ. Women feel safe in my arms because if I have to go hands on someone in an altercation, I'm going to be effective. When it comes good looking older men, we don't age like wine, we age like warlords. \n\nTo sum up: Your comment about an allowance to compensate for the obvious crystallized in my mind that it's not so obvious that anyone would need compensation from me. \n\nThen why use Seeking? To put my profile in front of younger women who are open to older lovers, obviously. I'm guessing the ones who would only be with an older man in a sugar arrangement would skip me without batting an eye. I'm seeking the bored and curious, not the desperate. \n\nIf I do sign back up on Seeking, it will be unapologetically salty, straight up, no PPM, no allowance, just a brief respite with a rock amongst raging waters.\n\n\"Unconcerned, mocking, violent: such Wisdom wants us; For she is a woman, and always loves only a warrior.\" *Thus Spoke Zarathustra*",
            "author": null,
            "id": "g03vbkb",
            "parent_id": "t1_g027jby",
            "score": 2,
            "created_utc": 1596381102.0,
            "replies": [
                {
                    "body": "5 miles is 8.05 km",
                    "author": "converter-bot",
                    "id": "g03vcsh",
                    "parent_id": "t1_g03vbkb",
                    "score": 1,
                    "created_utc": 1596381117.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Understanding that behavior likes this comes from the part of the brain we share with lizards makes it easier for me to put up with people when they engage in it. I remind myself that people are hard-wired for some behavior and can’t really help themselves. It’s made my life a lot more Zen.",
            "author": "LaGriffeDuLion",
            "id": "fzvqnzc",
            "parent_id": "t1_fzvlx63",
            "score": 15,
            "created_utc": 1596212994.0,
            "replies": [
                {
                    "body": "HAHAHA I love it. They truly are just acting like lizard people lmao",
                    "author": "kittiesntrees",
                    "id": "fzvr3k2",
                    "parent_id": "t1_fzvqnzc",
                    "score": 6,
                    "created_utc": 1596213173.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm so sorry that happened to you love, stuff like that can cut deep. I'm young but I'm in the same boat wrt not wanting a traditional family or kids, and I'm already starting to get policing comments about it. When I step back from the hurt for a minute, it's easier to see how ridiculous these people are. Like ummm y'all really know me after like 10 minutes of chatting or eavesdropping, huh? People like this interact with us like symbols instead of real people, and knowing that they're not actually against me as a person (how could they be? They don't know me!) helps me with some perspective. Sending light and love! Always down to chat if you want support!",
            "author": "kittiesntrees",
            "id": "fzvyfut",
            "parent_id": "t1_fzvx19o",
            "score": 4,
            "created_utc": 1596216424.0,
            "replies": [
                {
                    "body": "\"People like this interact with us like symbols instead of real people, and knowing that they're not actually against me as a person (how could they be? They don't know me!) helps me with some perspective.\"  \n\n\nThis is true, and kind, and lovely. I'm guessing those are also qualities you possess! Not hard to see how you found such a cute and cool SD, congratulations to you! I just might reach out, thank you <3 And good for you, knowing what you want and don't want.   \n\n\nAlso, I would like to point out that this is a far more human reply than I ever got in that dang subreddit. Thanks for being legit.",
                    "author": "little_bean_bun",
                    "id": "fzwc6rg",
                    "parent_id": "t1_fzvyfut",
                    "score": 2,
                    "created_utc": 1596221069.0,
                    "replies": [
                        {
                            "body": "❤️",
                            "author": "kittiesntrees",
                            "id": "fzwx0go",
                            "parent_id": "t1_fzwc6rg",
                            "score": 1,
                            "created_utc": 1596230089.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What do you imagine they think of Meghan Markle?",
            "author": "TY2022",
            "id": "fzw23i2",
            "parent_id": "t1_fzvx19o",
            "score": 5,
            "created_utc": 1596217736.0,
            "replies": [
                {
                    "body": "I don't even want to know.",
                    "author": "little_bean_bun",
                    "id": "fzwc8k2",
                    "parent_id": "t1_fzw23i2",
                    "score": 2,
                    "created_utc": 1596221087.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For all the talk in the sisterhood about “empowering” each other, women’s actual behavior is more like “crabs in a basket”. You don’t actually have to put a cover on a basket of crabs because any time a crab climbs up to get out of the basket the other crabs will pull it back down. Part of the key to getting past that is to understand and accept that it is deeply hard-wired behavior and when you’re being judgy about it, really it’s Mother Nature who’s being the biatch and less so the actual person.",
            "author": "LaGriffeDuLion",
            "id": "fzvyo9k",
            "parent_id": "t1_fzvx19o",
            "score": 3,
            "created_utc": 1596216507.0,
            "replies": [
                {
                    "body": "Hmm, even more to think about. I have several long-standing strong female friendships, but none of us are in competition with each other. I think because we each have different \"zones of power\" if that makes sense. Our careers are in separate arenas, some of us value children and family, some of us value travel, some of us value time alone! I would say we see each other as equals, and I think it helps us all feel valued.   \n\n\nHOWEVER, I sure have seen what it's like when a woman feels threatened by another. It's not cute. I'll keep my inner Mother Nature in mind, thanks! Haha.",
                    "author": "little_bean_bun",
                    "id": "fzwcnv2",
                    "parent_id": "t1_fzvyo9k",
                    "score": 3,
                    "created_utc": 1596221237.0,
                    "replies": []
                },
                {
                    "body": "Excellent point - the behavior of one female (or male) crab is pretty much the same as the behavior of another female (or male) crab. Likewise, the behavior of one female (or male) human is pretty much the same as the behavior of another female (or male) human.\n\nSophie Scholl the same as Ilse Koch.",
                    "author": "highfructoseSD",
                    "id": "fzyc82a",
                    "parent_id": "t1_fzvyo9k",
                    "score": -2,
                    "created_utc": 1596255086.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ayyy, you'd get nothing but snaps from me! Love to see it!",
            "author": "kittiesntrees",
            "id": "fzvhztm",
            "parent_id": "t1_fzvhrdj",
            "score": 3,
            "created_utc": 1596209836.0,
            "replies": []
        },
        {
            "body": "I was in a luxury box at a warriors game with my SB and her best friend.  Our host got us settled in but left in the first quarter .  The box next to us had a few Karen’s and their husbands.  The Karen’s got mad because their husbands were staring at my girls.  Both girls  looked hot with ripped jeans, thigh high boots and low cut silk blouses.   My SB strattled me on a love seat and her GF jumped on behind her for a triple kiss.  I think their heads almost exploded.",
            "author": "LotBuilder",
            "id": "fzwhmgj",
            "parent_id": "t1_fzvhrdj",
            "score": 5,
            "created_utc": 1596223168.0,
            "replies": [
                {
                    "body": "Oh my God I LOVE THIS!!!! Once, just once in my life, I want to have that sort of undiluted pleasure",
                    "author": "kittiesntrees",
                    "id": "fzwxwq3",
                    "parent_id": "t1_fzwhmgj",
                    "score": 1,
                    "created_utc": 1596230366.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right? Let's get some empowerment going up in here 😤 😩",
            "author": "kittiesntrees",
            "id": "fzvpeyb",
            "parent_id": "t1_fzvliff",
            "score": 3,
            "created_utc": 1596212492.0,
            "replies": []
        },
        {
            "body": "Yes! It was so embarrassing and even though he 'gifted' a 'meet and greet' gift that so many 'SD's' are against, it still was NOT worth it. \n\nScreen girls...screen. Screen with the finest mesh screen you can use.",
            "author": null,
            "id": "fzxcsj1",
            "parent_id": "t1_fzx8vni",
            "score": 10,
            "created_utc": 1596235185.0,
            "replies": []
        },
        {
            "body": "Yes, the men need to understand that we need our discretion, too. Our careers might be on the line and people judge...A very high allowance helps this problem somewhat.",
            "author": null,
            "id": "fzxdbkc",
            "parent_id": "t1_fzx2l2b",
            "score": 7,
            "created_utc": 1596235378.0,
            "replies": []
        },
        {
            "body": "typo....I got in trouble for typing an amount. You will, too, so better change it.",
            "author": null,
            "id": "fzxfmzr",
            "parent_id": "t1_fzxed6m",
            "score": 3,
            "created_utc": 1596236430.0,
            "replies": [
                {
                    "body": "Ah, true. Thanks for the heads up :)",
                    "author": "Sanctemagne",
                    "id": "fzxg3sq",
                    "parent_id": "t1_fzxfmzr",
                    "score": 1,
                    "created_utc": 1596236655.0,
                    "replies": [
                        {
                            "body": "You're welcome. (: Although, this reddit sub might not count it with an extra zero or two, lol.",
                            "author": null,
                            "id": "fzxgaam",
                            "parent_id": "t1_fzxg3sq",
                            "score": 3,
                            "created_utc": 1596236738.0,
                            "replies": [
                                {
                                    "body": "You never know, haha. Maybe I'll just leave it then and see ;)",
                                    "author": "Sanctemagne",
                                    "id": "fzxgs5w",
                                    "parent_id": "t1_fzxgaam",
                                    "score": 1,
                                    "created_utc": 1596236979.0,
                                    "replies": [
                                        {
                                            "body": "haha! (((: Extra zeros make all of us girls so happy!",
                                            "author": null,
                                            "id": "fzxhqkk",
                                            "parent_id": "t1_fzxgs5w",
                                            "score": 3,
                                            "created_utc": 1596237435.0,
                                            "replies": [
                                                {
                                                    "body": "Well I do make it my business to always give my girls plenty of extra 0s and extra Os ;)",
                                                    "author": "Sanctemagne",
                                                    "id": "fzxie2x",
                                                    "parent_id": "t1_fzxhqkk",
                                                    "score": 2,
                                                    "created_utc": 1596237741.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This isn’t any level though.. this seems like a very high level of being self obsessed. So no i don’t think you have to be conceited in order to meet someone.. \n\nTo each their own; do and enjoy the things you enjoy if that’s what you want out of life. But when this conceited “life mantra” is presented here to influence the narrative of this social interaction i think it’s important to remind that very same person that hey; a good amount of people in this restaurant are not competitively comparing their life to yours as you maybe. \n\nI suppose it probably helps ease himself into thinking better of himself? But i can confidently say most people are not immediately envious of a dude they saw for 30 seconds at a bar with a girl half his senior.",
            "author": "shadadada",
            "id": "fzwoin1",
            "parent_id": "t1_fzwmb0n",
            "score": -1,
            "created_utc": 1596226485.0,
            "replies": [
                {
                    "body": "Depends on the girl, non? When this one walked into a bar with a live band, sometimes a drummer would lose his rhythm. 😉",
                    "author": "LaGriffeDuLion",
                    "id": "fzws679",
                    "parent_id": "t1_fzwoin1",
                    "score": 9,
                    "created_utc": 1596228249.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "5 miles is 8.05 km",
            "author": "converter-bot",
            "id": "g03vcsh",
            "parent_id": "t1_g03vbkb",
            "score": 1,
            "created_utc": 1596381117.0,
            "replies": []
        },
        {
            "body": "HAHAHA I love it. They truly are just acting like lizard people lmao",
            "author": "kittiesntrees",
            "id": "fzvr3k2",
            "parent_id": "t1_fzvqnzc",
            "score": 6,
            "created_utc": 1596213173.0,
            "replies": []
        },
        {
            "body": "\"People like this interact with us like symbols instead of real people, and knowing that they're not actually against me as a person (how could they be? They don't know me!) helps me with some perspective.\"  \n\n\nThis is true, and kind, and lovely. I'm guessing those are also qualities you possess! Not hard to see how you found such a cute and cool SD, congratulations to you! I just might reach out, thank you <3 And good for you, knowing what you want and don't want.   \n\n\nAlso, I would like to point out that this is a far more human reply than I ever got in that dang subreddit. Thanks for being legit.",
            "author": "little_bean_bun",
            "id": "fzwc6rg",
            "parent_id": "t1_fzvyfut",
            "score": 2,
            "created_utc": 1596221069.0,
            "replies": [
                {
                    "body": "❤️",
                    "author": "kittiesntrees",
                    "id": "fzwx0go",
                    "parent_id": "t1_fzwc6rg",
                    "score": 1,
                    "created_utc": 1596230089.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't even want to know.",
            "author": "little_bean_bun",
            "id": "fzwc8k2",
            "parent_id": "t1_fzw23i2",
            "score": 2,
            "created_utc": 1596221087.0,
            "replies": []
        },
        {
            "body": "Hmm, even more to think about. I have several long-standing strong female friendships, but none of us are in competition with each other. I think because we each have different \"zones of power\" if that makes sense. Our careers are in separate arenas, some of us value children and family, some of us value travel, some of us value time alone! I would say we see each other as equals, and I think it helps us all feel valued.   \n\n\nHOWEVER, I sure have seen what it's like when a woman feels threatened by another. It's not cute. I'll keep my inner Mother Nature in mind, thanks! Haha.",
            "author": "little_bean_bun",
            "id": "fzwcnv2",
            "parent_id": "t1_fzvyo9k",
            "score": 3,
            "created_utc": 1596221237.0,
            "replies": []
        },
        {
            "body": "Excellent point - the behavior of one female (or male) crab is pretty much the same as the behavior of another female (or male) crab. Likewise, the behavior of one female (or male) human is pretty much the same as the behavior of another female (or male) human.\n\nSophie Scholl the same as Ilse Koch.",
            "author": "highfructoseSD",
            "id": "fzyc82a",
            "parent_id": "t1_fzvyo9k",
            "score": -2,
            "created_utc": 1596255086.0,
            "replies": []
        },
        {
            "body": "Oh my God I LOVE THIS!!!! Once, just once in my life, I want to have that sort of undiluted pleasure",
            "author": "kittiesntrees",
            "id": "fzwxwq3",
            "parent_id": "t1_fzwhmgj",
            "score": 1,
            "created_utc": 1596230366.0,
            "replies": []
        },
        {
            "body": "Ah, true. Thanks for the heads up :)",
            "author": "Sanctemagne",
            "id": "fzxg3sq",
            "parent_id": "t1_fzxfmzr",
            "score": 1,
            "created_utc": 1596236655.0,
            "replies": [
                {
                    "body": "You're welcome. (: Although, this reddit sub might not count it with an extra zero or two, lol.",
                    "author": null,
                    "id": "fzxgaam",
                    "parent_id": "t1_fzxg3sq",
                    "score": 3,
                    "created_utc": 1596236738.0,
                    "replies": [
                        {
                            "body": "You never know, haha. Maybe I'll just leave it then and see ;)",
                            "author": "Sanctemagne",
                            "id": "fzxgs5w",
                            "parent_id": "t1_fzxgaam",
                            "score": 1,
                            "created_utc": 1596236979.0,
                            "replies": [
                                {
                                    "body": "haha! (((: Extra zeros make all of us girls so happy!",
                                    "author": null,
                                    "id": "fzxhqkk",
                                    "parent_id": "t1_fzxgs5w",
                                    "score": 3,
                                    "created_utc": 1596237435.0,
                                    "replies": [
                                        {
                                            "body": "Well I do make it my business to always give my girls plenty of extra 0s and extra Os ;)",
                                            "author": "Sanctemagne",
                                            "id": "fzxie2x",
                                            "parent_id": "t1_fzxhqkk",
                                            "score": 2,
                                            "created_utc": 1596237741.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Depends on the girl, non? When this one walked into a bar with a live band, sometimes a drummer would lose his rhythm. 😉",
            "author": "LaGriffeDuLion",
            "id": "fzws679",
            "parent_id": "t1_fzwoin1",
            "score": 9,
            "created_utc": 1596228249.0,
            "replies": []
        },
        {
            "body": "❤️",
            "author": "kittiesntrees",
            "id": "fzwx0go",
            "parent_id": "t1_fzwc6rg",
            "score": 1,
            "created_utc": 1596230089.0,
            "replies": []
        },
        {
            "body": "You're welcome. (: Although, this reddit sub might not count it with an extra zero or two, lol.",
            "author": null,
            "id": "fzxgaam",
            "parent_id": "t1_fzxg3sq",
            "score": 3,
            "created_utc": 1596236738.0,
            "replies": [
                {
                    "body": "You never know, haha. Maybe I'll just leave it then and see ;)",
                    "author": "Sanctemagne",
                    "id": "fzxgs5w",
                    "parent_id": "t1_fzxgaam",
                    "score": 1,
                    "created_utc": 1596236979.0,
                    "replies": [
                        {
                            "body": "haha! (((: Extra zeros make all of us girls so happy!",
                            "author": null,
                            "id": "fzxhqkk",
                            "parent_id": "t1_fzxgs5w",
                            "score": 3,
                            "created_utc": 1596237435.0,
                            "replies": [
                                {
                                    "body": "Well I do make it my business to always give my girls plenty of extra 0s and extra Os ;)",
                                    "author": "Sanctemagne",
                                    "id": "fzxie2x",
                                    "parent_id": "t1_fzxhqkk",
                                    "score": 2,
                                    "created_utc": 1596237741.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You never know, haha. Maybe I'll just leave it then and see ;)",
            "author": "Sanctemagne",
            "id": "fzxgs5w",
            "parent_id": "t1_fzxgaam",
            "score": 1,
            "created_utc": 1596236979.0,
            "replies": [
                {
                    "body": "haha! (((: Extra zeros make all of us girls so happy!",
                    "author": null,
                    "id": "fzxhqkk",
                    "parent_id": "t1_fzxgs5w",
                    "score": 3,
                    "created_utc": 1596237435.0,
                    "replies": [
                        {
                            "body": "Well I do make it my business to always give my girls plenty of extra 0s and extra Os ;)",
                            "author": "Sanctemagne",
                            "id": "fzxie2x",
                            "parent_id": "t1_fzxhqkk",
                            "score": 2,
                            "created_utc": 1596237741.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "haha! (((: Extra zeros make all of us girls so happy!",
            "author": null,
            "id": "fzxhqkk",
            "parent_id": "t1_fzxgs5w",
            "score": 3,
            "created_utc": 1596237435.0,
            "replies": [
                {
                    "body": "Well I do make it my business to always give my girls plenty of extra 0s and extra Os ;)",
                    "author": "Sanctemagne",
                    "id": "fzxie2x",
                    "parent_id": "t1_fzxhqkk",
                    "score": 2,
                    "created_utc": 1596237741.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well I do make it my business to always give my girls plenty of extra 0s and extra Os ;)",
            "author": "Sanctemagne",
            "id": "fzxie2x",
            "parent_id": "t1_fzxhqkk",
            "score": 2,
            "created_utc": 1596237741.0,
            "replies": []
        }
    ]
}