{
    "title": "Pot SB tried to give me a hand job in public during M&G",
    "post_id": "12neu79",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/12neu79/pot_sb_tried_to_give_me_a_hand_job_in_public/",
    "author": "SD_Dinosaur",
    "body": "Hello fellow sugar people! Long time lurker here. I've enjoyed reading about your experiences in the bowl but was hesitant to share my own because they were never quite as entertaining. Until recently!\n\nSo I guess it was only a matter of time before I had my own strange M&G story. Beautiful girl who works in a similar profession as me. No red flags that I see prior to our M&G. Her profile says she's single and got no kids.\n\nSo when we meet, one of the first things she says to me is that she's recently divorced. Which is fine, that still counts as single. Then she tells me she's locked in a custody dispute over the kid. Kid wouldn't be a deal breaker for me but it wasn't in her profile so that's at least a yellow flag. Then again, she's been on Seeking for a few years now and the kid is young, so maybe she just forgot to update it.\n\nThen she tells me she had to leave her husband because of a DV situation. I feel terrible for her and am really sympathetic, and tell her it's good she got out of that relationship. Her response is that she's not out of the woods yet because the divorce isn't finalized.\n\nAt this point I can't reconcile \"recently divorced\" with \"not yet finalized.\" I'm starting to sense that I'm dealing with someone who's not being entirely honest. There were other little things too that were inconsistent but these were the big ones.\n\nMaybe sensing that I'm losing interest, she excuses herself and goes to the restroom. When she comes back she sits on my side of the booth and starts making out with me, tongue and everything. Which I gotta say is kinda nice. She's a good kisser.\n\nThen she sticks her hands down my pants and starts stroking me. Which also feels really good, so I stupidly let this go on for a little while. Until she starts unzipping my pants.\n\nI have no idea if she's seriously intending to whip my dick out in the middle of the restaurant but I'm not about to find out and get arrested for indecent exposure. So I gently remove her hands, tell her I was uncomfortable, and ask her to sit back across from me.\n\nRest of the M&G was awkward but relatively uneventful after that. She asks when we're going to see each other again so I tell her I'll check my schedule, but I give her a little gift before she gets into the Uber because I feel bad about the kid and marital situation, assuming it's true.\n\nWhen I get home I politely inform her that I don't feel we're a good match, wish her well, and block. Then I finish the job that she started.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/12neu79/pot_sb_tried_to_give_me_a_hand_job_in_public/",
    "score": 119,
    "upvote_ratio": 0.94,
    "created_utc": 1681585368.0,
    "num_comments": 92,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "So she’s available?",
            "author": "SD_Big_PP",
            "id": "jge6gi9",
            "parent_id": "t3_12neu79",
            "score": 117,
            "created_utc": 1681586819.0,
            "replies": [
                {
                    "body": "I'll cue up 😂",
                    "author": "wtfamidoinghere4829",
                    "id": "jgecqrr",
                    "parent_id": "t1_jge6gi9",
                    "score": 23,
                    "created_utc": 1681589552.0,
                    "replies": [
                        {
                            "body": "Damn you guys are some horny mfers. Ok, I get it, I should've bent her over the table and banged her right there in the restaurant.",
                            "author": "SD_Dinosaur",
                            "id": "jgely5v",
                            "parent_id": "t1_jgecqrr",
                            "score": 75,
                            "created_utc": 1681593573.0,
                            "replies": [
                                {
                                    "body": "Now you're talking.",
                                    "author": "wildhorses6565",
                                    "id": "jgeqf4i",
                                    "parent_id": "t1_jgely5v",
                                    "score": 12,
                                    "created_utc": 1681595594.0,
                                    "replies": []
                                },
                                {
                                    "body": "Your response 😂😂😂\n\nPs you did the RIGHT thing by not playing her desperation game 🤢🤢🤢",
                                    "author": "SassyBabe6939",
                                    "id": "jgfs5xo",
                                    "parent_id": "t1_jgely5v",
                                    "score": 15,
                                    "created_utc": 1681614136.0,
                                    "replies": []
                                },
                                {
                                    "body": "All in good fun! You have to do what's right for you. Good on you for maintaining your self value.\n\nI am a horny mf but I'd have stopped her as well.",
                                    "author": "wtfamidoinghere4829",
                                    "id": "jgemcji",
                                    "parent_id": "t1_jgely5v",
                                    "score": 17,
                                    "created_utc": 1681593749.0,
                                    "replies": []
                                },
                                {
                                    "body": "I see you Mr. Pitino!",
                                    "author": "MrPipeKC",
                                    "id": "jgfg955",
                                    "parent_id": "t1_jgely5v",
                                    "score": 2,
                                    "created_utc": 1681607986.0,
                                    "replies": []
                                },
                                {
                                    "body": "😂😂😂",
                                    "author": "kittymethh",
                                    "id": "jgh2ria",
                                    "parent_id": "t1_jgely5v",
                                    "score": 2,
                                    "created_utc": 1681647885.0,
                                    "replies": []
                                },
                                {
                                    "body": ">Damn you guys are some horny mfers. Ok, I get it, I should've bent her over the table and banged her right there in the restaurant.\n\nno, but you could have taken her out to the car or SUV and had amazing sex in the backseat like a teenager. You would never have forgotten that experience for the rest of your life ;)",
                                    "author": "NickPfromYuma",
                                    "id": "jghra3n",
                                    "parent_id": "t1_jgely5v",
                                    "score": 1,
                                    "created_utc": 1681659619.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah - which restaurant was this? We could have a viewing party of future M&Gs",
                    "author": "quietgrey1",
                    "id": "jgid81e",
                    "parent_id": "t1_jge6gi9",
                    "score": 3,
                    "created_utc": 1681668724.0,
                    "replies": []
                },
                {
                    "body": "😆",
                    "author": "P0sitiveViibes777",
                    "id": "jgep19b",
                    "parent_id": "t1_jge6gi9",
                    "score": 2,
                    "created_utc": 1681594968.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Waiter...I'll have what he's having please.",
            "author": "Teejaynj",
            "id": "jged019",
            "parent_id": "t3_12neu79",
            "score": 72,
            "created_utc": 1681589662.0,
            "replies": [
                {
                    "body": "Bonus points for that great reference 😂😂",
                    "author": "ColdHeartXWarmFeet",
                    "id": "jgerpqf",
                    "parent_id": "t1_jged019",
                    "score": 9,
                    "created_utc": 1681596187.0,
                    "replies": []
                },
                {
                    "body": "Lol😂😂",
                    "author": "bobafoba1243",
                    "id": "jgeh01g",
                    "parent_id": "t1_jged019",
                    "score": 5,
                    "created_utc": 1681591388.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OMG, that's disgusting.   \nCan I have her number?",
            "author": "val_br",
            "id": "jgeje9z",
            "parent_id": "t3_12neu79",
            "score": 72,
            "created_utc": 1681592431.0,
            "replies": []
        },
        {
            "body": "Bro, she was the one.",
            "author": "Downtown_Astronauts",
            "id": "jgeatdq",
            "parent_id": "t3_12neu79",
            "score": 49,
            "created_utc": 1681588707.0,
            "replies": [
                {
                    "body": "Right? \nShe seems desperate to find a guy and being desperate is never attractive. \n\nFrom her POV, she may have been out of the dating pool for sometime, nervous about how she was going to survive without a bill payer and thought maybe being overly sexual would help in locking down OP. \n\nIf I were OP, then I would give the lady another chance. Normal women are never this forward so there is more to her story.",
                    "author": "professorxc",
                    "id": "jgnbzvg",
                    "parent_id": "t1_jgeatdq",
                    "score": 2,
                    "created_utc": 1681758611.0,
                    "replies": [
                        {
                            "body": "I fully agree with you. She did nothing egregious.\n \nDear OP: 1. Failing to mention that she has a child is not a yellow flag. It's not a flag. There are too many creeps out there who groom women to get to their children and it's standard sugar practice to only share in person if/when comfortable unless asked point blank beforehand. \n\nAnd 2. \"Recently divorced\" is something women generally tend to say regardless of where we are in the divorce. I did exactly what you described while dating during my divorce. When a woman says, \"I'm in the process of a divorce\", there's too much we might be asked to divulge that isn't anyone else's business unless and until we're securely in an arrangement down the line. Even then it's a discretionary mattet. Overall, this woman was impressively honest and straightforward with you and I think you're hypercritical honestly. \n\nEager single mother wrapping a stressful divorce - is into exhibitionism and has a little financial pain to be eased..... you really dropped the ball on this one.",
                            "author": "hazehagin",
                            "id": "jgnfbqz",
                            "parent_id": "t1_jgnbzvg",
                            "score": 3,
                            "created_utc": 1681759909.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Let's give this man a hand for successfully beating off some stiff competition.\n\nWe have this guy at work that never picks up the tab for anything, and we call him t-rex. (\"He has deep pockets but short arms, so he can't reach his wallet.\")  Maybe she thought you couldn't reach all the way down yourself?\n\nIn any case you did the right thing, mainly because public indecency charges are **always assumed to be solo.**  I write my state senators every day because I want my crimes properly classified between times that a hot person was involved and times when it was just me. The injustice is real.",
            "author": "TastySpermDevice",
            "id": "jge7myd",
            "parent_id": "t3_12neu79",
            "score": 39,
            "created_utc": 1681587328.0,
            "replies": [
                {
                    "body": ">Let's give this man a hand for successfully beating off some stiff competition.\n\nSounds like he already gave himself a hand",
                    "author": "Church42",
                    "id": "jge93fy",
                    "parent_id": "t1_jge7myd",
                    "score": 19,
                    "created_utc": 1681587969.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've heard that recent divorcees are usually horny af. I can understand if you felt uncomfortable with her aggressiveness but I think you missed out on a fun night.",
            "author": "TheStoicbrother",
            "id": "jge54dg",
            "parent_id": "t3_12neu79",
            "score": 36,
            "created_utc": 1681586243.0,
            "replies": [
                {
                    "body": "Nahh she was def sensing that he was losing interest because of her bull.. it was a desperation move for sure",
                    "author": "SassyBabe6939",
                    "id": "jgftu2j",
                    "parent_id": "t1_jge54dg",
                    "score": 13,
                    "created_utc": 1681615017.0,
                    "replies": [
                        {
                            "body": "You say it like you were right there next to them. 🤣",
                            "author": "TheStoicbrother",
                            "id": "jgfy168",
                            "parent_id": "t1_jgftu2j",
                            "score": -4,
                            "created_utc": 1681617262.0,
                            "replies": [
                                {
                                    "body": "More like common sense from the description of the encounter…. It screams desperation",
                                    "author": "SassyBabe6939",
                                    "id": "jgmx1lr",
                                    "parent_id": "t1_jgfy168",
                                    "score": 1,
                                    "created_utc": 1681752804.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I agree. Rehearse/practice the convo with yourself in the mirror for your own comfort. Unblock her.  tell her you were  overwhelmed with her boldness in PUBLIC HOWEVER  you would like to explore her adventurous side IN the bedroom. If it works it makes for a great RomCom. If It still doesn't work after intimacy you learned something new about yourself. You seem ambivalent (there's pro and cons) versus a hell no!",
                    "author": "odalis_nyc",
                    "id": "jgf0nlh",
                    "parent_id": "t1_jge54dg",
                    "score": 12,
                    "created_utc": 1681600394.0,
                    "replies": [
                        {
                            "body": "Nah, it's too late. She probably met up with someone else by now lol.",
                            "author": "TheStoicbrother",
                            "id": "jgfb2e1",
                            "parent_id": "t1_jgf0nlh",
                            "score": 5,
                            "created_utc": 1681605419.0,
                            "replies": [
                                {
                                    "body": "Maybe ... maybe not ... sugar relationships last weeks to months. Based on evidence in the forum a smaller percentage last for a few years. Unless BOTH of you require exclusivity there is some wiggle room. She may not have anyone yet AND or she might be looking to juggle a few SDs before fully committing to one SD. Give her a chance to finish what she started. 🤌... not for you but for her kids 🤗",
                                    "author": "odalis_nyc",
                                    "id": "jgflcs4",
                                    "parent_id": "t1_jgfb2e1",
                                    "score": 1,
                                    "created_utc": 1681610581.0,
                                    "replies": [
                                        {
                                            "body": "Women, especially ones attractive enough to be an SB, don't wait around after a rejection. She 100% has moved on bud. 😂",
                                            "author": "TheStoicbrother",
                                            "id": "jgfrcbg",
                                            "parent_id": "t1_jgflcs4",
                                            "score": 7,
                                            "created_utc": 1681613693.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "OP! Take this horny bastards advice! I would be more than happy to eat crow if it meant getting another at-bat with this lovely lady. Maybe this time pick a restaurant with a high booth or private section, no more having to finish at home - LMAO",
                            "author": "pfc_6ixgodconsumer",
                            "id": "jgf30m4",
                            "parent_id": "t1_jgf0nlh",
                            "score": 8,
                            "created_utc": 1681601520.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Then I finish the job that she started.\n\nMade me laugh.\n\nRegardless, it does not sound fun, I'm sorry. Good on you for establishing boundaries, and your red flag indicator seems on point regarding the divorce warning signs. \n\nYou seem to have a good heart to give the gift after (I've had three M&G's without one so far), and you seem to communicate clearly. \n\nWelcome to the strange M&G's, it's a lot of fun here.",
            "author": "coffeebeanbookgal",
            "id": "jge3u1u",
            "parent_id": "t3_12neu79",
            "score": 27,
            "created_utc": 1681585688.0,
            "replies": []
        },
        {
            "body": "Great story, and I know everyone's giving you a friendly ribbing for this, but I appreciate you for sticking to your guns and doing what you felt was right. Im not a fan of too much PDA, so I can imagine how flustered you must have felt. 😁",
            "author": "SeekingInToronto",
            "id": "jgeu0sp",
            "parent_id": "t3_12neu79",
            "score": 9,
            "created_utc": 1681597275.0,
            "replies": []
        },
        {
            "body": "This is stripper 101. MAny have learned that they can bypass the upper brain by reaching over and rubbing your crotch when you are making decisions. I've experienced it on two meets, both with former strippers.\n\nAnd it worked both times...",
            "author": "TwerkingAvocado",
            "id": "jgexgzv",
            "parent_id": "t3_12neu79",
            "score": 16,
            "created_utc": 1681598901.0,
            "replies": []
        },
        {
            "body": "Both incredible and also quite awkward lmao. Never had that happen although a SB once did grope/feel up my package while we were sitting at the bar",
            "author": "Hungboy6969420",
            "id": "jgedtvi",
            "parent_id": "t3_12neu79",
            "score": 7,
            "created_utc": 1681590024.0,
            "replies": []
        },
        {
            "body": "Hahahaaha love the ending my man!",
            "author": null,
            "id": "jgeszyn",
            "parent_id": "t3_12neu79",
            "score": 5,
            "created_utc": 1681596794.0,
            "replies": []
        },
        {
            "body": ">Which also feels really good, so I stupidly let this go on for a little while. Until she starts unzipping my pants.\n\n\"Check please!\"\n\nand go find somewhere more private",
            "author": "joc13",
            "id": "jge9sur",
            "parent_id": "t3_12neu79",
            "score": 16,
            "created_utc": 1681588274.0,
            "replies": [
                {
                    "body": "Not an option, she had to go back home and take care of the kid I didn't know about until the M&G.",
                    "author": "SD_Dinosaur",
                    "id": "jgeprwv",
                    "parent_id": "t1_jge9sur",
                    "score": 8,
                    "created_utc": 1681595305.0,
                    "replies": [
                        {
                            "body": "You could at least let her take care of your little guy before she took care of hers.",
                            "author": "timrid",
                            "id": "jgfgpnk",
                            "parent_id": "t1_jgeprwv",
                            "score": -3,
                            "created_utc": 1681608217.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can understand being separated and calling it divorced, but I'm not interested in the possible drama from ex. \n\nI can understand not putting that you have children on SA. I would be worried about predators. That being said children are a deal breaker for me. Spontaneity is so much harder with a child. \n\nGood on you for knowing you were nexting her and not pump and dumping.",
            "author": "Filledwithoysters",
            "id": "jgf4f7h",
            "parent_id": "t3_12neu79",
            "score": 4,
            "created_utc": 1681602197.0,
            "replies": []
        },
        {
            "body": "I can respect you keeping your wits about you...hard to do with Mr. Happy has all the blood flowing to him.   And respect for you to consider the lines great enough to not want to move forward with an SR.  You geld to your own boundaries, and you'll be a great SD for some lucky SB.\n\nI think most of what you said was minor, except the husband has DV on her.  That would make me wonder if he would some how follow her and cause a scene with you (or worse). For me, it would depend on the Hot to Crazy ratio if I would have started an SR.  \n\nBut, again, respect for sticking to your guns.",
            "author": "MrRhoarke",
            "id": "jgeys9n",
            "parent_id": "t3_12neu79",
            "score": 4,
            "created_utc": 1681599512.0,
            "replies": []
        },
        {
            "body": "She wasn’t honest and it wasn’t your vibe that’s fair. Props to you for being a gentleman about it and letting her know that you guys weren’t a good match instead of ghosting her.",
            "author": "LocksmithOk7266",
            "id": "jgg9ova",
            "parent_id": "t3_12neu79",
            "score": 4,
            "created_utc": 1681624805.0,
            "replies": []
        },
        {
            "body": "Hand jobs are cool and all, but not *entirely* honest young women, divorce in progress with custody battle, ex-husband prone to violence...yeah I think maybe that drama could spill over into your life :-)",
            "author": "sothisisntreallyme",
            "id": "jgh5te3",
            "parent_id": "t3_12neu79",
            "score": 3,
            "created_utc": 1681649677.0,
            "replies": []
        },
        {
            "body": "You should have kept seeing her just for the updates. What would have happened on date 2?  Date 3?",
            "author": "mike_o212",
            "id": "jgekn3a",
            "parent_id": "t3_12neu79",
            "score": 6,
            "created_utc": 1681592985.0,
            "replies": []
        },
        {
            "body": "Why doesn't this shit never happen to me?! Ugh!\n\nIt's just like all of these insanely hot teachers, none of my teachers ever tried to sleep with me when I was in high school. I feel like I missed out on so many things!\n\nI totally would have stopped her and said hey why don't we get out of here!",
            "author": "ThrowAwayGuy1945",
            "id": "jgel4zv",
            "parent_id": "t3_12neu79",
            "score": 12,
            "created_utc": 1681593208.0,
            "replies": [
                {
                    "body": "jokes like this suck and you are the reason why more male victims of SA aren’t taken seriously and don’t report. have a nice day 💕",
                    "author": "DVLCINEA",
                    "id": "jghqhyr",
                    "parent_id": "t1_jgel4zv",
                    "score": 5,
                    "created_utc": 1681659295.0,
                    "replies": []
                },
                {
                    "body": "Couldn't we just not have made a joke minimizing sexual assault of kids from a teacher? That's pretty messed up.",
                    "author": "CrankyPelicans",
                    "id": "jgfuq4m",
                    "parent_id": "t1_jgel4zv",
                    "score": 13,
                    "created_utc": 1681615464.0,
                    "replies": []
                },
                {
                    "body": "I stood in a wedding with a woman that was arrested for sleeping with her student, then we share the same name to boot😂",
                    "author": "Fleurdegirl",
                    "id": "jgfn6n1",
                    "parent_id": "t1_jgel4zv",
                    "score": 1,
                    "created_utc": 1681611540.0,
                    "replies": [
                        {
                            "body": "Is that awkward? Lol",
                            "author": "Great-Character-9960",
                            "id": "jgqhcqp",
                            "parent_id": "t1_jgfn6n1",
                            "score": 1,
                            "created_utc": 1681819864.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is a very serious case that deserves investigation.  I'm sure a call for voluntary researchers will not  be ignored. \n\nIt is certainly not unheard of  and add to that the drama of divorce, the casualness of marriage.  I imagine for a substantial percentage of SD it would have ended the search so long as she was a good prospect.....  Although, there is a certain craziness often associated with marriage and the dissolution thereof. \n\nI had awesome sex during my marriage but the craziest off the wall sex was the night after our divorce was finalized and the mover was arriving at sunrise.\n\nAssuming that she had the other desired benefits of an SB my guess is that he will wake up one night muttering a loud expletive.",
            "author": "pinotandsugar",
            "id": "jge9prp",
            "parent_id": "t3_12neu79",
            "score": 4,
            "created_utc": 1681588237.0,
            "replies": [
                {
                    "body": "This! So much this. The boldness and eagerness - gotta ride (giggity) that out. \n\nTo each their own, but I see so many green flags here.",
                    "author": "GenIISD",
                    "id": "jgec61j",
                    "parent_id": "t1_jge9prp",
                    "score": 4,
                    "created_utc": 1681589302.0,
                    "replies": []
                },
                {
                    "body": "*\"I had awesome sex during my marriage but the craziest off the wall sex was the night after our divorce was finalized and the mover was arriving at sunrise.\"*\n\n\nWas it you that moved, or the earth? \n\nIn the UK 'arriving' is what posh people call the 'happy ending'. I'm glad it took the removal guy until dawn for you 😉",
                    "author": "Sunhillian",
                    "id": "jgg8wk1",
                    "parent_id": "t1_jge9prp",
                    "score": 2,
                    "created_utc": 1681624238.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "jges6c5",
            "parent_id": "t3_12neu79",
            "score": 4,
            "created_utc": 1681596403.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "jgestxy",
                    "parent_id": "t1_jges6c5",
                    "score": 2,
                    "created_utc": 1681596714.0,
                    "replies": [
                        {
                            "body": "I was her at one time.  With very young kids and entering the bowl.  Left DV.  Our litigation took 2.5 years!!!  It’s a very sensitive topic when dealing with dv.  You are already judged.  It’s not something you would disclose in a profile or in a first conversation.  So I wouldn’t personally call it a red flag.  I absolutely would say I was divorced, partway through litigation!  She wasn’t planning to go back to him.  They weren’t just “separated”…They’re not together.  Does the ink signed, dry, stamped and sealed really matter?",
                            "author": "MagneticMila",
                            "id": "jgf7pe4",
                            "parent_id": "t1_jgestxy",
                            "score": 2,
                            "created_utc": 1681603782.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Is very rare and once or twice when she is keen but think the M&G is not going well, she might try harder. I am not a PDA person so it is kind of a no no for me anyway. Once, drive her home after M&G and she stuck my hand to make sure I can felt she is wet. Another time, one gave me a full on French kiss before she step out of my car. Never a hand job haha! Good on you to finish the job yourself! The same reason I hate stirp clubs... I have to go home and finish the job.",
            "author": "SD_AU",
            "id": "jgg6qyp",
            "parent_id": "t3_12neu79",
            "score": 2,
            "created_utc": 1681622724.0,
            "replies": []
        },
        {
            "body": "The fact she discussed her personal situation/circumstances was the first red flag for me. Rule number one, whether its a M&G, 1st Vanilla Date, or Job Interview. KISS - Keep It Simple Stupid, high level conversations, light-hearted, surface level details about career, life, and aspirations. There is no need to peel back the layers of your life on a first date. With that being said, you're a gentleman (and an idiot) for not at the VERY least moving forward with that handy.....If you enjoyed it, like you said you did, then no reason to stop when I'm sure you can access a car (or even a last-minute hotel).... We will never know.....might have been the one LMAO.",
            "author": "pfc_6ixgodconsumer",
            "id": "jgf2j2g",
            "parent_id": "t3_12neu79",
            "score": 4,
            "created_utc": 1681601287.0,
            "replies": [
                {
                    "body": ">The fact she discussed her personal situation\n\nThat is just wrong. You have no idea how a conversation will go, what level of comfort will be reached etc.",
                    "author": "sdbythebeach",
                    "id": "jghf5mc",
                    "parent_id": "t1_jgf2j2g",
                    "score": 1,
                    "created_utc": 1681654406.0,
                    "replies": [
                        {
                            "body": "You may think its wrong, but as someone on the other side of the table during the first date, i have no desire to discuss a POTs private life. On the 4th date if you want to unload your personal problems then be my guest as we can enter the trust tree. Date number one is honeymoon phase, let me enjoy the illusion of our time together.\n\nTalking about your ex and previous relationship drama on a 1st date is buzzkill.",
                            "author": "pfc_6ixgodconsumer",
                            "id": "jghqh8a",
                            "parent_id": "t1_jghf5mc",
                            "score": 1,
                            "created_utc": 1681659286.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "In finishing what she started did you fantasize about not stopping her & she whipping out your dick in the middle of the restaurant. She sounds preferable to the platonic SBs people are always running into. I'd keep it going.",
            "author": "Electronic_Yam5838",
            "id": "jgeu7x9",
            "parent_id": "t3_12neu79",
            "score": 2,
            "created_utc": 1681597369.0,
            "replies": []
        },
        {
            "body": "Chances are she 'took something' in the ladies room lol. If you were game you should have taken her back into a stall in the mens room and let her finish the job.",
            "author": "KindAd6988",
            "id": "jghgdec",
            "parent_id": "t3_12neu79",
            "score": 2,
            "created_utc": 1681654950.0,
            "replies": []
        },
        {
            "body": "To address the concerns in the first part of your post, when one spouse or the other files a petition to divorce with the court (typically family court), in the eyes of the law that is when you divorced, even though it may take months or years to work out the details of the marriage settlement agreement to everyone's satisfaction (both the couple and the state).\n\nIn my case it took nearly two years to get from divorce petition to MSA. Typically when children and/or significant, jointly-held assets are involved it can be quite complicated - even for no-fault divorces.\n\nOne of the most important things about filing a petition is that it sets a clear date between jointly-held and singly-held property. If POT SB filed for petition and won the lottery or got a huge gift from SD, that would not be considered communal property, even though the divorce is not finalized.",
            "author": "kingporterstomp",
            "id": "jge7leg",
            "parent_id": "t3_12neu79",
            "score": 2,
            "created_utc": 1681587309.0,
            "replies": [
                {
                    "body": ">when one spouse or the other files a petition to divorce with the court (typically family court), in the eyes of the law that is when you divorced\n\nNot in CA, it's legally a divorce on the date the judge enters the dissolution decree, and every divorce proceeding has a mandatory six-month waiting period even uncontested ones. Not sure how it works elsewhere but I'd be surprised if any state considers a divorce effective without a court order being entered. Maybe the date for legal separation, but not the divorce.",
                    "author": "SD_Dinosaur",
                    "id": "jge9ama",
                    "parent_id": "t1_jge7leg",
                    "score": 5,
                    "created_utc": 1681588055.0,
                    "replies": [
                        {
                            "body": "Correct. Until the divorce decree you are separated. In some states you can have a legal separation if there’s a question of violence but the property part comes with the final order.",
                            "author": "Spartan44BB",
                            "id": "jgef5k2",
                            "parent_id": "t1_jge9ama",
                            "score": 5,
                            "created_utc": 1681590593.0,
                            "replies": [
                                {
                                    "body": "I was divorced in CA. If the property part came with the final order, I would not be a SD because I made 99.9999% of my wealth in the period between initial petition and final MSA.",
                                    "author": "kingporterstomp",
                                    "id": "jgelhdy",
                                    "parent_id": "t1_jgef5k2",
                                    "score": -1,
                                    "created_utc": 1681593361.0,
                                    "replies": [
                                        {
                                            "body": "So that's the difference between date of separation and date of dissolution. Your date of separation may be when community property ends, but none of that becomes official until the judge enters an order with a date of dissolution.",
                                            "author": "SD_Dinosaur",
                                            "id": "jgervyf",
                                            "parent_id": "t1_jgelhdy",
                                            "score": 4,
                                            "created_utc": 1681596269.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, you are right. The point I was trying to make, albeit badly, is that submitting a petition to divorce is the official start of a lengthy process that most likely will end in divorce. In terms of OP's situation, there's a difference between someone who has merely separated but hasn't started the legal process and one who has. I'd have little reservation seeing the latter, not so much the former.",
                                                    "author": "kingporterstomp",
                                                    "id": "jgewavs",
                                                    "parent_id": "t1_jgervyf",
                                                    "score": -1,
                                                    "created_utc": 1681598354.0,
                                                    "replies": [
                                                        {
                                                            "body": "In the UK a former spouse can make a financial claim right up to the point she remarries. In this case,  https://www.supremecourt.uk/cases/uksc-2013-0186.html  18 years after, unless there is a Clean Beak or Financial Court order.",
                                                            "author": "Sunhillian",
                                                            "id": "jgg864f",
                                                            "parent_id": "t1_jgewavs",
                                                            "score": 1,
                                                            "created_utc": 1681623715.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "gd i wish that was me. the risk of getting caught is such a turn on",
            "author": "cjtheshutter",
            "id": "jgev3ff",
            "parent_id": "t3_12neu79",
            "score": 1,
            "created_utc": 1681597783.0,
            "replies": []
        },
        {
            "body": "If this is real send me contact information so I can stay away from her, if this is a fantasy tell me exactly which medications you took so I can avoid them.",
            "author": "highfructoseSD",
            "id": "jgg18as",
            "parent_id": "t3_12neu79",
            "score": 1,
            "created_utc": 1681619152.0,
            "replies": []
        },
        {
            "body": "She wasn’t messing around!",
            "author": "JSBelle",
            "id": "jgenkuy",
            "parent_id": "t3_12neu79",
            "score": 1,
            "created_utc": 1681594306.0,
            "replies": []
        },
        {
            "body": "Damn! Ummm she was into you. You might’ve moved it to another location if you couldn’t focus!",
            "author": "daddoms",
            "id": "jgfo1th",
            "parent_id": "t3_12neu79",
            "score": 1,
            "created_utc": 1681611994.0,
            "replies": []
        },
        {
            "body": "When I was about 12, my parents got a divorce. It was the straightforward kind, they agreed on property separation, shared custody. They just had one lawyer since there was no dispute.\n\nAbout 6 years later, my mum told me the divorce papers had finally come through. It just took the courts that long to process it. Granted, it took longer because there was child custody involved which made it slower, but it still took YEARS.\n\nDuring those 6 years, if any of them met someone and said they're divorced, would they have been dishonest? I mean, in practice they were, it was just that the paper hadn't come through.\n\nI don't want to imply this girl has been fully honest with you, nor that she's lied for that matter. I'm just providing what I hope can be some useful perspective.",
            "author": "IReallyLikeFlan",
            "id": "jggzgib",
            "parent_id": "t3_12neu79",
            "score": 1,
            "created_utc": 1681645773.0,
            "replies": []
        },
        {
            "body": "What's wrong with you?",
            "author": null,
            "id": "jgeps51",
            "parent_id": "t3_12neu79",
            "score": -1,
            "created_utc": 1681595308.0,
            "replies": [
                {
                    "body": "I can't help but think the same.  Why are you concerned about her divorce papers being signed or not?!?  \n\nThis girl is a keeper just say hey baby let's move this party back to my place!!",
                    "author": "andrew_david",
                    "id": "jgewzm1",
                    "parent_id": "t1_jgeps51",
                    "score": 0,
                    "created_utc": 1681598674.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "At the risk of seeming insensitive to your feelings and sensibilities, I sense a missed opportunity there.  You mentioned she was beautiful and obviously she was willing.  Tbh I might very well have rolled that M&G into a full date format.  Who cares what her domestic situation is?  Those are her burdens to bear, not yours.\n\nI'm not saying that she was a L/T SB in the making, but many of them aren't anyway.  Might as well have had a little fun while your search continued.  Just sayin.",
            "author": "RickDugan",
            "id": "jgeg0d5",
            "parent_id": "t3_12neu79",
            "score": 0,
            "created_utc": 1681590963.0,
            "replies": [
                {
                    "body": "I had the impression many SDs are married as well as many SBs. It's not assumed to be a love relatiobship.",
                    "author": "Electronic_Yam5838",
                    "id": "jgets8y",
                    "parent_id": "t1_jgeg0d5",
                    "score": 2,
                    "created_utc": 1681597164.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "*At this point I can't reconcile \"recently divorced\" with \"not yet finalized.\"*\n\nDivorce proceedings underway. Legal battling is still ongoing. The judge hasn't signed off on final paperwork. Calling herself \"recently divorced\" was a lil white lie her eyes. \"Not yet finalized\" is the honest truth.\n\n*Then she sticks her hands down my pants and starts stroking me. Which also feels really good, so I stupidly let this go on for a little while. Until she starts unzipping my pants.*\n\n*I have no idea if she's seriously intending to whip my dick out in the middle of the restaurant but I'm not about to find out and get arrested for indecent exposure. So I gently remove her hands, tell her I was uncomfortable, and ask her to sit back across from me.*\n\nLesson learned. Next time, she should bring a sex toy to the meet & greet as a gift.",
            "author": "BinghamtonSD",
            "id": "jgenpyl",
            "parent_id": "t3_12neu79",
            "score": 0,
            "created_utc": 1681594370.0,
            "replies": [
                {
                    "body": "Wasn’t there a post somewhere with an sb who gifted some panties? \nIs there a trend going on I missed because that would be good entertainment here 😂",
                    "author": "ColdHeartXWarmFeet",
                    "id": "jgesg6y",
                    "parent_id": "t1_jgenpyl",
                    "score": 2,
                    "created_utc": 1681596532.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Actually - please call her back so we can hear more adventures!",
            "author": "HappyBear1952",
            "id": "jgf8sga",
            "parent_id": "t3_12neu79",
            "score": 0,
            "created_utc": 1681604310.0,
            "replies": []
        },
        {
            "body": "So as a female; I would do that but not at a meet and greet. As for your red/yellow flags. I totally see them; being honest about what is going on in your situation is important for trust. I haven’t always been honest and it smacked me in my face. Now I might overshare and they lose interest.",
            "author": "KatRoseForever",
            "id": "jgfp6xj",
            "parent_id": "t3_12neu79",
            "score": 0,
            "created_utc": 1681612590.0,
            "replies": []
        },
        {
            "body": "She’s the one most SDs are looking for! What’s the link to her SA profile? 😂",
            "author": "SugarSugar1968",
            "id": "jgfvchf",
            "parent_id": "t3_12neu79",
            "score": 0,
            "created_utc": 1681615792.0,
            "replies": []
        },
        {
            "body": "The crazy ones are the fun ones...",
            "author": "andrewmanhattan",
            "id": "jgh09gc",
            "parent_id": "t3_12neu79",
            "score": 0,
            "created_utc": 1681646300.0,
            "replies": []
        },
        {
            "body": "Sounds like a setup for a rape charge",
            "author": "BraveBull15",
            "id": "jgiytnb",
            "parent_id": "t3_12neu79",
            "score": 0,
            "created_utc": 1681677564.0,
            "replies": []
        },
        {
            "body": "How dare she take such liberties!   Does she think you are some kind of 2 bit strumpet!",
            "author": "HappyBear1952",
            "id": "jgf8m4s",
            "parent_id": "t3_12neu79",
            "score": 1,
            "created_utc": 1681604226.0,
            "replies": []
        },
        {
            "body": "Perfectly right in your decision, forget the comments",
            "author": "Lengthiness-Opposite",
            "id": "jgfaka4",
            "parent_id": "t3_12neu79",
            "score": 1,
            "created_utc": 1681605177.0,
            "replies": []
        },
        {
            "body": "As it should be 👌",
            "author": "SnooCupcakes7133",
            "id": "jgffp30",
            "parent_id": "t3_12neu79",
            "score": 1,
            "created_utc": 1681607709.0,
            "replies": []
        },
        {
            "body": "Vat scandal!\n\nBro, send me her number.",
            "author": "Majesticpork",
            "id": "jgfligp",
            "parent_id": "t3_12neu79",
            "score": 1,
            "created_utc": 1681610662.0,
            "replies": []
        },
        {
            "body": "Hell .. you got her number ? 😂",
            "author": "Manofsteel-69",
            "id": "jgh8ekm",
            "parent_id": "t3_12neu79",
            "score": 1,
            "created_utc": 1681651097.0,
            "replies": []
        },
        {
            "body": "Haha too funny but that must have been awkward, You handled it nicely though.",
            "author": "39sherry",
            "id": "jghwlx2",
            "parent_id": "t3_12neu79",
            "score": 1,
            "created_utc": 1681661863.0,
            "replies": []
        },
        {
            "body": "A sugar baby not only lying but also dumping their baggage on the first meet and not being able to read the vibes. \n\nLadies stop giving us a bad name. You're making it so much harder for the real ones. 😭",
            "author": "lolaloca6669",
            "id": "jgidaqp",
            "parent_id": "t3_12neu79",
            "score": 1,
            "created_utc": 1681668755.0,
            "replies": []
        },
        {
            "body": "Good call. She's either freaking out, wondering how she's going to cover expenses after the divorce, or maybe the horny freshly divorced type, or perhaps a general liar and wasn't married in the first place, but definitely has the kid. Some combo of all of that.\n\nSingle moms aren't my thing, but always sad how easy it is (for some) to take advantage of them...",
            "author": "quietgrey1",
            "id": "jgie4ga",
            "parent_id": "t3_12neu79",
            "score": 1,
            "created_utc": 1681669095.0,
            "replies": []
        },
        {
            "body": "Quite frankly any time I hear of a dv situation red flags go up. The hj after the bathroom reeks of desperation. And quite frankly you welter right to cut it off.",
            "author": "Chase808888",
            "id": "jgihilt",
            "parent_id": "t3_12neu79",
            "score": 1,
            "created_utc": 1681670478.0,
            "replies": []
        },
        {
            "body": "That would turn me off. I still want my Pot to be somewhat demure. If I want an escort then I expect that sort of behavior,but not a stranger trying to make a good impression mentally and emotionally. But then again, I am old fashioned.",
            "author": "GSSD",
            "id": "jglx5az",
            "parent_id": "t3_12neu79",
            "score": 1,
            "created_utc": 1681738090.0,
            "replies": []
        },
        {
            "body": "She is an escort playing you bro",
            "author": "Secret_Diet7053",
            "id": "jgm77pr",
            "parent_id": "t3_12neu79",
            "score": 1,
            "created_utc": 1681742563.0,
            "replies": []
        },
        {
            "body": "I'll cue up 😂",
            "author": "wtfamidoinghere4829",
            "id": "jgecqrr",
            "parent_id": "t1_jge6gi9",
            "score": 23,
            "created_utc": 1681589552.0,
            "replies": [
                {
                    "body": "Damn you guys are some horny mfers. Ok, I get it, I should've bent her over the table and banged her right there in the restaurant.",
                    "author": "SD_Dinosaur",
                    "id": "jgely5v",
                    "parent_id": "t1_jgecqrr",
                    "score": 75,
                    "created_utc": 1681593573.0,
                    "replies": [
                        {
                            "body": "Now you're talking.",
                            "author": "wildhorses6565",
                            "id": "jgeqf4i",
                            "parent_id": "t1_jgely5v",
                            "score": 12,
                            "created_utc": 1681595594.0,
                            "replies": []
                        },
                        {
                            "body": "Your response 😂😂😂\n\nPs you did the RIGHT thing by not playing her desperation game 🤢🤢🤢",
                            "author": "SassyBabe6939",
                            "id": "jgfs5xo",
                            "parent_id": "t1_jgely5v",
                            "score": 15,
                            "created_utc": 1681614136.0,
                            "replies": []
                        },
                        {
                            "body": "All in good fun! You have to do what's right for you. Good on you for maintaining your self value.\n\nI am a horny mf but I'd have stopped her as well.",
                            "author": "wtfamidoinghere4829",
                            "id": "jgemcji",
                            "parent_id": "t1_jgely5v",
                            "score": 17,
                            "created_utc": 1681593749.0,
                            "replies": []
                        },
                        {
                            "body": "I see you Mr. Pitino!",
                            "author": "MrPipeKC",
                            "id": "jgfg955",
                            "parent_id": "t1_jgely5v",
                            "score": 2,
                            "created_utc": 1681607986.0,
                            "replies": []
                        },
                        {
                            "body": "😂😂😂",
                            "author": "kittymethh",
                            "id": "jgh2ria",
                            "parent_id": "t1_jgely5v",
                            "score": 2,
                            "created_utc": 1681647885.0,
                            "replies": []
                        },
                        {
                            "body": ">Damn you guys are some horny mfers. Ok, I get it, I should've bent her over the table and banged her right there in the restaurant.\n\nno, but you could have taken her out to the car or SUV and had amazing sex in the backseat like a teenager. You would never have forgotten that experience for the rest of your life ;)",
                            "author": "NickPfromYuma",
                            "id": "jghra3n",
                            "parent_id": "t1_jgely5v",
                            "score": 1,
                            "created_utc": 1681659619.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah - which restaurant was this? We could have a viewing party of future M&Gs",
            "author": "quietgrey1",
            "id": "jgid81e",
            "parent_id": "t1_jge6gi9",
            "score": 3,
            "created_utc": 1681668724.0,
            "replies": []
        },
        {
            "body": "😆",
            "author": "P0sitiveViibes777",
            "id": "jgep19b",
            "parent_id": "t1_jge6gi9",
            "score": 2,
            "created_utc": 1681594968.0,
            "replies": []
        },
        {
            "body": "Bonus points for that great reference 😂😂",
            "author": "ColdHeartXWarmFeet",
            "id": "jgerpqf",
            "parent_id": "t1_jged019",
            "score": 9,
            "created_utc": 1681596187.0,
            "replies": []
        },
        {
            "body": "Lol😂😂",
            "author": "bobafoba1243",
            "id": "jgeh01g",
            "parent_id": "t1_jged019",
            "score": 5,
            "created_utc": 1681591388.0,
            "replies": []
        },
        {
            "body": "Right? \nShe seems desperate to find a guy and being desperate is never attractive. \n\nFrom her POV, she may have been out of the dating pool for sometime, nervous about how she was going to survive without a bill payer and thought maybe being overly sexual would help in locking down OP. \n\nIf I were OP, then I would give the lady another chance. Normal women are never this forward so there is more to her story.",
            "author": "professorxc",
            "id": "jgnbzvg",
            "parent_id": "t1_jgeatdq",
            "score": 2,
            "created_utc": 1681758611.0,
            "replies": [
                {
                    "body": "I fully agree with you. She did nothing egregious.\n \nDear OP: 1. Failing to mention that she has a child is not a yellow flag. It's not a flag. There are too many creeps out there who groom women to get to their children and it's standard sugar practice to only share in person if/when comfortable unless asked point blank beforehand. \n\nAnd 2. \"Recently divorced\" is something women generally tend to say regardless of where we are in the divorce. I did exactly what you described while dating during my divorce. When a woman says, \"I'm in the process of a divorce\", there's too much we might be asked to divulge that isn't anyone else's business unless and until we're securely in an arrangement down the line. Even then it's a discretionary mattet. Overall, this woman was impressively honest and straightforward with you and I think you're hypercritical honestly. \n\nEager single mother wrapping a stressful divorce - is into exhibitionism and has a little financial pain to be eased..... you really dropped the ball on this one.",
                    "author": "hazehagin",
                    "id": "jgnfbqz",
                    "parent_id": "t1_jgnbzvg",
                    "score": 3,
                    "created_utc": 1681759909.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Let's give this man a hand for successfully beating off some stiff competition.\n\nSounds like he already gave himself a hand",
            "author": "Church42",
            "id": "jge93fy",
            "parent_id": "t1_jge7myd",
            "score": 19,
            "created_utc": 1681587969.0,
            "replies": []
        },
        {
            "body": "Nahh she was def sensing that he was losing interest because of her bull.. it was a desperation move for sure",
            "author": "SassyBabe6939",
            "id": "jgftu2j",
            "parent_id": "t1_jge54dg",
            "score": 13,
            "created_utc": 1681615017.0,
            "replies": [
                {
                    "body": "You say it like you were right there next to them. 🤣",
                    "author": "TheStoicbrother",
                    "id": "jgfy168",
                    "parent_id": "t1_jgftu2j",
                    "score": -4,
                    "created_utc": 1681617262.0,
                    "replies": [
                        {
                            "body": "More like common sense from the description of the encounter…. It screams desperation",
                            "author": "SassyBabe6939",
                            "id": "jgmx1lr",
                            "parent_id": "t1_jgfy168",
                            "score": 1,
                            "created_utc": 1681752804.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree. Rehearse/practice the convo with yourself in the mirror for your own comfort. Unblock her.  tell her you were  overwhelmed with her boldness in PUBLIC HOWEVER  you would like to explore her adventurous side IN the bedroom. If it works it makes for a great RomCom. If It still doesn't work after intimacy you learned something new about yourself. You seem ambivalent (there's pro and cons) versus a hell no!",
            "author": "odalis_nyc",
            "id": "jgf0nlh",
            "parent_id": "t1_jge54dg",
            "score": 12,
            "created_utc": 1681600394.0,
            "replies": [
                {
                    "body": "Nah, it's too late. She probably met up with someone else by now lol.",
                    "author": "TheStoicbrother",
                    "id": "jgfb2e1",
                    "parent_id": "t1_jgf0nlh",
                    "score": 5,
                    "created_utc": 1681605419.0,
                    "replies": [
                        {
                            "body": "Maybe ... maybe not ... sugar relationships last weeks to months. Based on evidence in the forum a smaller percentage last for a few years. Unless BOTH of you require exclusivity there is some wiggle room. She may not have anyone yet AND or she might be looking to juggle a few SDs before fully committing to one SD. Give her a chance to finish what she started. 🤌... not for you but for her kids 🤗",
                            "author": "odalis_nyc",
                            "id": "jgflcs4",
                            "parent_id": "t1_jgfb2e1",
                            "score": 1,
                            "created_utc": 1681610581.0,
                            "replies": [
                                {
                                    "body": "Women, especially ones attractive enough to be an SB, don't wait around after a rejection. She 100% has moved on bud. 😂",
                                    "author": "TheStoicbrother",
                                    "id": "jgfrcbg",
                                    "parent_id": "t1_jgflcs4",
                                    "score": 7,
                                    "created_utc": 1681613693.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "OP! Take this horny bastards advice! I would be more than happy to eat crow if it meant getting another at-bat with this lovely lady. Maybe this time pick a restaurant with a high booth or private section, no more having to finish at home - LMAO",
                    "author": "pfc_6ixgodconsumer",
                    "id": "jgf30m4",
                    "parent_id": "t1_jgf0nlh",
                    "score": 8,
                    "created_utc": 1681601520.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not an option, she had to go back home and take care of the kid I didn't know about until the M&G.",
            "author": "SD_Dinosaur",
            "id": "jgeprwv",
            "parent_id": "t1_jge9sur",
            "score": 8,
            "created_utc": 1681595305.0,
            "replies": [
                {
                    "body": "You could at least let her take care of your little guy before she took care of hers.",
                    "author": "timrid",
                    "id": "jgfgpnk",
                    "parent_id": "t1_jgeprwv",
                    "score": -3,
                    "created_utc": 1681608217.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "jokes like this suck and you are the reason why more male victims of SA aren’t taken seriously and don’t report. have a nice day 💕",
            "author": "DVLCINEA",
            "id": "jghqhyr",
            "parent_id": "t1_jgel4zv",
            "score": 5,
            "created_utc": 1681659295.0,
            "replies": []
        },
        {
            "body": "Couldn't we just not have made a joke minimizing sexual assault of kids from a teacher? That's pretty messed up.",
            "author": "CrankyPelicans",
            "id": "jgfuq4m",
            "parent_id": "t1_jgel4zv",
            "score": 13,
            "created_utc": 1681615464.0,
            "replies": []
        },
        {
            "body": "I stood in a wedding with a woman that was arrested for sleeping with her student, then we share the same name to boot😂",
            "author": "Fleurdegirl",
            "id": "jgfn6n1",
            "parent_id": "t1_jgel4zv",
            "score": 1,
            "created_utc": 1681611540.0,
            "replies": [
                {
                    "body": "Is that awkward? Lol",
                    "author": "Great-Character-9960",
                    "id": "jgqhcqp",
                    "parent_id": "t1_jgfn6n1",
                    "score": 1,
                    "created_utc": 1681819864.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This! So much this. The boldness and eagerness - gotta ride (giggity) that out. \n\nTo each their own, but I see so many green flags here.",
            "author": "GenIISD",
            "id": "jgec61j",
            "parent_id": "t1_jge9prp",
            "score": 4,
            "created_utc": 1681589302.0,
            "replies": []
        },
        {
            "body": "*\"I had awesome sex during my marriage but the craziest off the wall sex was the night after our divorce was finalized and the mover was arriving at sunrise.\"*\n\n\nWas it you that moved, or the earth? \n\nIn the UK 'arriving' is what posh people call the 'happy ending'. I'm glad it took the removal guy until dawn for you 😉",
            "author": "Sunhillian",
            "id": "jgg8wk1",
            "parent_id": "t1_jge9prp",
            "score": 2,
            "created_utc": 1681624238.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "jgestxy",
            "parent_id": "t1_jges6c5",
            "score": 2,
            "created_utc": 1681596714.0,
            "replies": [
                {
                    "body": "I was her at one time.  With very young kids and entering the bowl.  Left DV.  Our litigation took 2.5 years!!!  It’s a very sensitive topic when dealing with dv.  You are already judged.  It’s not something you would disclose in a profile or in a first conversation.  So I wouldn’t personally call it a red flag.  I absolutely would say I was divorced, partway through litigation!  She wasn’t planning to go back to him.  They weren’t just “separated”…They’re not together.  Does the ink signed, dry, stamped and sealed really matter?",
                    "author": "MagneticMila",
                    "id": "jgf7pe4",
                    "parent_id": "t1_jgestxy",
                    "score": 2,
                    "created_utc": 1681603782.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">The fact she discussed her personal situation\n\nThat is just wrong. You have no idea how a conversation will go, what level of comfort will be reached etc.",
            "author": "sdbythebeach",
            "id": "jghf5mc",
            "parent_id": "t1_jgf2j2g",
            "score": 1,
            "created_utc": 1681654406.0,
            "replies": [
                {
                    "body": "You may think its wrong, but as someone on the other side of the table during the first date, i have no desire to discuss a POTs private life. On the 4th date if you want to unload your personal problems then be my guest as we can enter the trust tree. Date number one is honeymoon phase, let me enjoy the illusion of our time together.\n\nTalking about your ex and previous relationship drama on a 1st date is buzzkill.",
                    "author": "pfc_6ixgodconsumer",
                    "id": "jghqh8a",
                    "parent_id": "t1_jghf5mc",
                    "score": 1,
                    "created_utc": 1681659286.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">when one spouse or the other files a petition to divorce with the court (typically family court), in the eyes of the law that is when you divorced\n\nNot in CA, it's legally a divorce on the date the judge enters the dissolution decree, and every divorce proceeding has a mandatory six-month waiting period even uncontested ones. Not sure how it works elsewhere but I'd be surprised if any state considers a divorce effective without a court order being entered. Maybe the date for legal separation, but not the divorce.",
            "author": "SD_Dinosaur",
            "id": "jge9ama",
            "parent_id": "t1_jge7leg",
            "score": 5,
            "created_utc": 1681588055.0,
            "replies": [
                {
                    "body": "Correct. Until the divorce decree you are separated. In some states you can have a legal separation if there’s a question of violence but the property part comes with the final order.",
                    "author": "Spartan44BB",
                    "id": "jgef5k2",
                    "parent_id": "t1_jge9ama",
                    "score": 5,
                    "created_utc": 1681590593.0,
                    "replies": [
                        {
                            "body": "I was divorced in CA. If the property part came with the final order, I would not be a SD because I made 99.9999% of my wealth in the period between initial petition and final MSA.",
                            "author": "kingporterstomp",
                            "id": "jgelhdy",
                            "parent_id": "t1_jgef5k2",
                            "score": -1,
                            "created_utc": 1681593361.0,
                            "replies": [
                                {
                                    "body": "So that's the difference between date of separation and date of dissolution. Your date of separation may be when community property ends, but none of that becomes official until the judge enters an order with a date of dissolution.",
                                    "author": "SD_Dinosaur",
                                    "id": "jgervyf",
                                    "parent_id": "t1_jgelhdy",
                                    "score": 4,
                                    "created_utc": 1681596269.0,
                                    "replies": [
                                        {
                                            "body": "Yes, you are right. The point I was trying to make, albeit badly, is that submitting a petition to divorce is the official start of a lengthy process that most likely will end in divorce. In terms of OP's situation, there's a difference between someone who has merely separated but hasn't started the legal process and one who has. I'd have little reservation seeing the latter, not so much the former.",
                                            "author": "kingporterstomp",
                                            "id": "jgewavs",
                                            "parent_id": "t1_jgervyf",
                                            "score": -1,
                                            "created_utc": 1681598354.0,
                                            "replies": [
                                                {
                                                    "body": "In the UK a former spouse can make a financial claim right up to the point she remarries. In this case,  https://www.supremecourt.uk/cases/uksc-2013-0186.html  18 years after, unless there is a Clean Beak or Financial Court order.",
                                                    "author": "Sunhillian",
                                                    "id": "jgg864f",
                                                    "parent_id": "t1_jgewavs",
                                                    "score": 1,
                                                    "created_utc": 1681623715.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can't help but think the same.  Why are you concerned about her divorce papers being signed or not?!?  \n\nThis girl is a keeper just say hey baby let's move this party back to my place!!",
            "author": "andrew_david",
            "id": "jgewzm1",
            "parent_id": "t1_jgeps51",
            "score": 0,
            "created_utc": 1681598674.0,
            "replies": []
        },
        {
            "body": "I had the impression many SDs are married as well as many SBs. It's not assumed to be a love relatiobship.",
            "author": "Electronic_Yam5838",
            "id": "jgets8y",
            "parent_id": "t1_jgeg0d5",
            "score": 2,
            "created_utc": 1681597164.0,
            "replies": []
        },
        {
            "body": "Wasn’t there a post somewhere with an sb who gifted some panties? \nIs there a trend going on I missed because that would be good entertainment here 😂",
            "author": "ColdHeartXWarmFeet",
            "id": "jgesg6y",
            "parent_id": "t1_jgenpyl",
            "score": 2,
            "created_utc": 1681596532.0,
            "replies": []
        },
        {
            "body": "Damn you guys are some horny mfers. Ok, I get it, I should've bent her over the table and banged her right there in the restaurant.",
            "author": "SD_Dinosaur",
            "id": "jgely5v",
            "parent_id": "t1_jgecqrr",
            "score": 75,
            "created_utc": 1681593573.0,
            "replies": [
                {
                    "body": "Now you're talking.",
                    "author": "wildhorses6565",
                    "id": "jgeqf4i",
                    "parent_id": "t1_jgely5v",
                    "score": 12,
                    "created_utc": 1681595594.0,
                    "replies": []
                },
                {
                    "body": "Your response 😂😂😂\n\nPs you did the RIGHT thing by not playing her desperation game 🤢🤢🤢",
                    "author": "SassyBabe6939",
                    "id": "jgfs5xo",
                    "parent_id": "t1_jgely5v",
                    "score": 15,
                    "created_utc": 1681614136.0,
                    "replies": []
                },
                {
                    "body": "All in good fun! You have to do what's right for you. Good on you for maintaining your self value.\n\nI am a horny mf but I'd have stopped her as well.",
                    "author": "wtfamidoinghere4829",
                    "id": "jgemcji",
                    "parent_id": "t1_jgely5v",
                    "score": 17,
                    "created_utc": 1681593749.0,
                    "replies": []
                },
                {
                    "body": "I see you Mr. Pitino!",
                    "author": "MrPipeKC",
                    "id": "jgfg955",
                    "parent_id": "t1_jgely5v",
                    "score": 2,
                    "created_utc": 1681607986.0,
                    "replies": []
                },
                {
                    "body": "😂😂😂",
                    "author": "kittymethh",
                    "id": "jgh2ria",
                    "parent_id": "t1_jgely5v",
                    "score": 2,
                    "created_utc": 1681647885.0,
                    "replies": []
                },
                {
                    "body": ">Damn you guys are some horny mfers. Ok, I get it, I should've bent her over the table and banged her right there in the restaurant.\n\nno, but you could have taken her out to the car or SUV and had amazing sex in the backseat like a teenager. You would never have forgotten that experience for the rest of your life ;)",
                    "author": "NickPfromYuma",
                    "id": "jghra3n",
                    "parent_id": "t1_jgely5v",
                    "score": 1,
                    "created_utc": 1681659619.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I fully agree with you. She did nothing egregious.\n \nDear OP: 1. Failing to mention that she has a child is not a yellow flag. It's not a flag. There are too many creeps out there who groom women to get to their children and it's standard sugar practice to only share in person if/when comfortable unless asked point blank beforehand. \n\nAnd 2. \"Recently divorced\" is something women generally tend to say regardless of where we are in the divorce. I did exactly what you described while dating during my divorce. When a woman says, \"I'm in the process of a divorce\", there's too much we might be asked to divulge that isn't anyone else's business unless and until we're securely in an arrangement down the line. Even then it's a discretionary mattet. Overall, this woman was impressively honest and straightforward with you and I think you're hypercritical honestly. \n\nEager single mother wrapping a stressful divorce - is into exhibitionism and has a little financial pain to be eased..... you really dropped the ball on this one.",
            "author": "hazehagin",
            "id": "jgnfbqz",
            "parent_id": "t1_jgnbzvg",
            "score": 3,
            "created_utc": 1681759909.0,
            "replies": []
        },
        {
            "body": "You say it like you were right there next to them. 🤣",
            "author": "TheStoicbrother",
            "id": "jgfy168",
            "parent_id": "t1_jgftu2j",
            "score": -4,
            "created_utc": 1681617262.0,
            "replies": [
                {
                    "body": "More like common sense from the description of the encounter…. It screams desperation",
                    "author": "SassyBabe6939",
                    "id": "jgmx1lr",
                    "parent_id": "t1_jgfy168",
                    "score": 1,
                    "created_utc": 1681752804.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nah, it's too late. She probably met up with someone else by now lol.",
            "author": "TheStoicbrother",
            "id": "jgfb2e1",
            "parent_id": "t1_jgf0nlh",
            "score": 5,
            "created_utc": 1681605419.0,
            "replies": [
                {
                    "body": "Maybe ... maybe not ... sugar relationships last weeks to months. Based on evidence in the forum a smaller percentage last for a few years. Unless BOTH of you require exclusivity there is some wiggle room. She may not have anyone yet AND or she might be looking to juggle a few SDs before fully committing to one SD. Give her a chance to finish what she started. 🤌... not for you but for her kids 🤗",
                    "author": "odalis_nyc",
                    "id": "jgflcs4",
                    "parent_id": "t1_jgfb2e1",
                    "score": 1,
                    "created_utc": 1681610581.0,
                    "replies": [
                        {
                            "body": "Women, especially ones attractive enough to be an SB, don't wait around after a rejection. She 100% has moved on bud. 😂",
                            "author": "TheStoicbrother",
                            "id": "jgfrcbg",
                            "parent_id": "t1_jgflcs4",
                            "score": 7,
                            "created_utc": 1681613693.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "OP! Take this horny bastards advice! I would be more than happy to eat crow if it meant getting another at-bat with this lovely lady. Maybe this time pick a restaurant with a high booth or private section, no more having to finish at home - LMAO",
            "author": "pfc_6ixgodconsumer",
            "id": "jgf30m4",
            "parent_id": "t1_jgf0nlh",
            "score": 8,
            "created_utc": 1681601520.0,
            "replies": []
        },
        {
            "body": "You could at least let her take care of your little guy before she took care of hers.",
            "author": "timrid",
            "id": "jgfgpnk",
            "parent_id": "t1_jgeprwv",
            "score": -3,
            "created_utc": 1681608217.0,
            "replies": []
        },
        {
            "body": "Is that awkward? Lol",
            "author": "Great-Character-9960",
            "id": "jgqhcqp",
            "parent_id": "t1_jgfn6n1",
            "score": 1,
            "created_utc": 1681819864.0,
            "replies": []
        },
        {
            "body": "I was her at one time.  With very young kids and entering the bowl.  Left DV.  Our litigation took 2.5 years!!!  It’s a very sensitive topic when dealing with dv.  You are already judged.  It’s not something you would disclose in a profile or in a first conversation.  So I wouldn’t personally call it a red flag.  I absolutely would say I was divorced, partway through litigation!  She wasn’t planning to go back to him.  They weren’t just “separated”…They’re not together.  Does the ink signed, dry, stamped and sealed really matter?",
            "author": "MagneticMila",
            "id": "jgf7pe4",
            "parent_id": "t1_jgestxy",
            "score": 2,
            "created_utc": 1681603782.0,
            "replies": []
        },
        {
            "body": "You may think its wrong, but as someone on the other side of the table during the first date, i have no desire to discuss a POTs private life. On the 4th date if you want to unload your personal problems then be my guest as we can enter the trust tree. Date number one is honeymoon phase, let me enjoy the illusion of our time together.\n\nTalking about your ex and previous relationship drama on a 1st date is buzzkill.",
            "author": "pfc_6ixgodconsumer",
            "id": "jghqh8a",
            "parent_id": "t1_jghf5mc",
            "score": 1,
            "created_utc": 1681659286.0,
            "replies": []
        },
        {
            "body": "Correct. Until the divorce decree you are separated. In some states you can have a legal separation if there’s a question of violence but the property part comes with the final order.",
            "author": "Spartan44BB",
            "id": "jgef5k2",
            "parent_id": "t1_jge9ama",
            "score": 5,
            "created_utc": 1681590593.0,
            "replies": [
                {
                    "body": "I was divorced in CA. If the property part came with the final order, I would not be a SD because I made 99.9999% of my wealth in the period between initial petition and final MSA.",
                    "author": "kingporterstomp",
                    "id": "jgelhdy",
                    "parent_id": "t1_jgef5k2",
                    "score": -1,
                    "created_utc": 1681593361.0,
                    "replies": [
                        {
                            "body": "So that's the difference between date of separation and date of dissolution. Your date of separation may be when community property ends, but none of that becomes official until the judge enters an order with a date of dissolution.",
                            "author": "SD_Dinosaur",
                            "id": "jgervyf",
                            "parent_id": "t1_jgelhdy",
                            "score": 4,
                            "created_utc": 1681596269.0,
                            "replies": [
                                {
                                    "body": "Yes, you are right. The point I was trying to make, albeit badly, is that submitting a petition to divorce is the official start of a lengthy process that most likely will end in divorce. In terms of OP's situation, there's a difference between someone who has merely separated but hasn't started the legal process and one who has. I'd have little reservation seeing the latter, not so much the former.",
                                    "author": "kingporterstomp",
                                    "id": "jgewavs",
                                    "parent_id": "t1_jgervyf",
                                    "score": -1,
                                    "created_utc": 1681598354.0,
                                    "replies": [
                                        {
                                            "body": "In the UK a former spouse can make a financial claim right up to the point she remarries. In this case,  https://www.supremecourt.uk/cases/uksc-2013-0186.html  18 years after, unless there is a Clean Beak or Financial Court order.",
                                            "author": "Sunhillian",
                                            "id": "jgg864f",
                                            "parent_id": "t1_jgewavs",
                                            "score": 1,
                                            "created_utc": 1681623715.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Now you're talking.",
            "author": "wildhorses6565",
            "id": "jgeqf4i",
            "parent_id": "t1_jgely5v",
            "score": 12,
            "created_utc": 1681595594.0,
            "replies": []
        },
        {
            "body": "Your response 😂😂😂\n\nPs you did the RIGHT thing by not playing her desperation game 🤢🤢🤢",
            "author": "SassyBabe6939",
            "id": "jgfs5xo",
            "parent_id": "t1_jgely5v",
            "score": 15,
            "created_utc": 1681614136.0,
            "replies": []
        },
        {
            "body": "All in good fun! You have to do what's right for you. Good on you for maintaining your self value.\n\nI am a horny mf but I'd have stopped her as well.",
            "author": "wtfamidoinghere4829",
            "id": "jgemcji",
            "parent_id": "t1_jgely5v",
            "score": 17,
            "created_utc": 1681593749.0,
            "replies": []
        },
        {
            "body": "I see you Mr. Pitino!",
            "author": "MrPipeKC",
            "id": "jgfg955",
            "parent_id": "t1_jgely5v",
            "score": 2,
            "created_utc": 1681607986.0,
            "replies": []
        },
        {
            "body": "😂😂😂",
            "author": "kittymethh",
            "id": "jgh2ria",
            "parent_id": "t1_jgely5v",
            "score": 2,
            "created_utc": 1681647885.0,
            "replies": []
        },
        {
            "body": ">Damn you guys are some horny mfers. Ok, I get it, I should've bent her over the table and banged her right there in the restaurant.\n\nno, but you could have taken her out to the car or SUV and had amazing sex in the backseat like a teenager. You would never have forgotten that experience for the rest of your life ;)",
            "author": "NickPfromYuma",
            "id": "jghra3n",
            "parent_id": "t1_jgely5v",
            "score": 1,
            "created_utc": 1681659619.0,
            "replies": []
        },
        {
            "body": "More like common sense from the description of the encounter…. It screams desperation",
            "author": "SassyBabe6939",
            "id": "jgmx1lr",
            "parent_id": "t1_jgfy168",
            "score": 1,
            "created_utc": 1681752804.0,
            "replies": []
        },
        {
            "body": "Maybe ... maybe not ... sugar relationships last weeks to months. Based on evidence in the forum a smaller percentage last for a few years. Unless BOTH of you require exclusivity there is some wiggle room. She may not have anyone yet AND or she might be looking to juggle a few SDs before fully committing to one SD. Give her a chance to finish what she started. 🤌... not for you but for her kids 🤗",
            "author": "odalis_nyc",
            "id": "jgflcs4",
            "parent_id": "t1_jgfb2e1",
            "score": 1,
            "created_utc": 1681610581.0,
            "replies": [
                {
                    "body": "Women, especially ones attractive enough to be an SB, don't wait around after a rejection. She 100% has moved on bud. 😂",
                    "author": "TheStoicbrother",
                    "id": "jgfrcbg",
                    "parent_id": "t1_jgflcs4",
                    "score": 7,
                    "created_utc": 1681613693.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was divorced in CA. If the property part came with the final order, I would not be a SD because I made 99.9999% of my wealth in the period between initial petition and final MSA.",
            "author": "kingporterstomp",
            "id": "jgelhdy",
            "parent_id": "t1_jgef5k2",
            "score": -1,
            "created_utc": 1681593361.0,
            "replies": [
                {
                    "body": "So that's the difference between date of separation and date of dissolution. Your date of separation may be when community property ends, but none of that becomes official until the judge enters an order with a date of dissolution.",
                    "author": "SD_Dinosaur",
                    "id": "jgervyf",
                    "parent_id": "t1_jgelhdy",
                    "score": 4,
                    "created_utc": 1681596269.0,
                    "replies": [
                        {
                            "body": "Yes, you are right. The point I was trying to make, albeit badly, is that submitting a petition to divorce is the official start of a lengthy process that most likely will end in divorce. In terms of OP's situation, there's a difference between someone who has merely separated but hasn't started the legal process and one who has. I'd have little reservation seeing the latter, not so much the former.",
                            "author": "kingporterstomp",
                            "id": "jgewavs",
                            "parent_id": "t1_jgervyf",
                            "score": -1,
                            "created_utc": 1681598354.0,
                            "replies": [
                                {
                                    "body": "In the UK a former spouse can make a financial claim right up to the point she remarries. In this case,  https://www.supremecourt.uk/cases/uksc-2013-0186.html  18 years after, unless there is a Clean Beak or Financial Court order.",
                                    "author": "Sunhillian",
                                    "id": "jgg864f",
                                    "parent_id": "t1_jgewavs",
                                    "score": 1,
                                    "created_utc": 1681623715.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Women, especially ones attractive enough to be an SB, don't wait around after a rejection. She 100% has moved on bud. 😂",
            "author": "TheStoicbrother",
            "id": "jgfrcbg",
            "parent_id": "t1_jgflcs4",
            "score": 7,
            "created_utc": 1681613693.0,
            "replies": []
        },
        {
            "body": "So that's the difference between date of separation and date of dissolution. Your date of separation may be when community property ends, but none of that becomes official until the judge enters an order with a date of dissolution.",
            "author": "SD_Dinosaur",
            "id": "jgervyf",
            "parent_id": "t1_jgelhdy",
            "score": 4,
            "created_utc": 1681596269.0,
            "replies": [
                {
                    "body": "Yes, you are right. The point I was trying to make, albeit badly, is that submitting a petition to divorce is the official start of a lengthy process that most likely will end in divorce. In terms of OP's situation, there's a difference between someone who has merely separated but hasn't started the legal process and one who has. I'd have little reservation seeing the latter, not so much the former.",
                    "author": "kingporterstomp",
                    "id": "jgewavs",
                    "parent_id": "t1_jgervyf",
                    "score": -1,
                    "created_utc": 1681598354.0,
                    "replies": [
                        {
                            "body": "In the UK a former spouse can make a financial claim right up to the point she remarries. In this case,  https://www.supremecourt.uk/cases/uksc-2013-0186.html  18 years after, unless there is a Clean Beak or Financial Court order.",
                            "author": "Sunhillian",
                            "id": "jgg864f",
                            "parent_id": "t1_jgewavs",
                            "score": 1,
                            "created_utc": 1681623715.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, you are right. The point I was trying to make, albeit badly, is that submitting a petition to divorce is the official start of a lengthy process that most likely will end in divorce. In terms of OP's situation, there's a difference between someone who has merely separated but hasn't started the legal process and one who has. I'd have little reservation seeing the latter, not so much the former.",
            "author": "kingporterstomp",
            "id": "jgewavs",
            "parent_id": "t1_jgervyf",
            "score": -1,
            "created_utc": 1681598354.0,
            "replies": [
                {
                    "body": "In the UK a former spouse can make a financial claim right up to the point she remarries. In this case,  https://www.supremecourt.uk/cases/uksc-2013-0186.html  18 years after, unless there is a Clean Beak or Financial Court order.",
                    "author": "Sunhillian",
                    "id": "jgg864f",
                    "parent_id": "t1_jgewavs",
                    "score": 1,
                    "created_utc": 1681623715.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In the UK a former spouse can make a financial claim right up to the point she remarries. In this case,  https://www.supremecourt.uk/cases/uksc-2013-0186.html  18 years after, unless there is a Clean Beak or Financial Court order.",
            "author": "Sunhillian",
            "id": "jgg864f",
            "parent_id": "t1_jgewavs",
            "score": 1,
            "created_utc": 1681623715.0,
            "replies": []
        }
    ]
}