{
    "title": "Exec at top Hollywood lobbying firm which represents Walt Disney and Netflix's interests in Washington is arrested for 'raping and blackmailing a woman he met on a Sugar Daddy site'",
    "post_id": "cwj35u",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/cwj35u/exec_at_top_hollywood_lobbying_firm_which/",
    "author": "idonthaveanametag",
    "body": "Good lord, I would have the thought the reverse would be more common.  Some people are just vermin.  Be safe everybody - I think everyone has a right to privacy.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/cwj35u/exec_at_top_hollywood_lobbying_firm_which/",
    "score": 95,
    "upvote_ratio": 0.97,
    "created_utc": 1566989270.0,
    "num_comments": 40,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "links to story:\n\n[https://www.washingtonian.com/2019/08/27/arrest-documents-detail-mpaa-executives-sexual-abuse-and-blackmail-charges/](https://www.washingtonian.com/2019/08/27/arrest-documents-detail-mpaa-executives-sexual-abuse-and-blackmail-charges/)\n\n[https://variety.com/2019/film/news/mpaa-steven-fabrizio-fired-sexual-abuse-blackmail-charges-1203315135/](https://variety.com/2019/film/news/mpaa-steven-fabrizio-fired-sexual-abuse-blackmail-charges-1203315135/)",
            "author": "highfructoseSD",
            "id": "eybqkbw",
            "parent_id": "t3_cwj35u",
            "score": 22,
            "created_utc": 1566989953.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eyc0w44",
                    "parent_id": "t1_eybqkbw",
                    "score": 18,
                    "created_utc": 1566994878.0,
                    "replies": [
                        {
                            "body": "What a snarky looking photo.......",
                            "author": "pinotandsugar",
                            "id": "eydnccn",
                            "parent_id": "t1_eyc0w44",
                            "score": 2,
                            "created_utc": 1567021646.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m pretty sure the victim is on this forum and wrote about this interaction recently.  Or I’m having an incredible case of dejavu.",
            "author": "FlexEconGuy",
            "id": "eybvgfh",
            "parent_id": "t3_cwj35u",
            "score": 27,
            "created_utc": 1566992528.0,
            "replies": [
                {
                    "body": "The details do sound somewhat familiar.",
                    "author": "willfromvb",
                    "id": "eybx3rr",
                    "parent_id": "t1_eybvgfh",
                    "score": 14,
                    "created_utc": 1566993248.0,
                    "replies": []
                },
                {
                    "body": "You mean our advice finally helped someone? Yay!",
                    "author": null,
                    "id": "eyh1hnz",
                    "parent_id": "t1_eybvgfh",
                    "score": 3,
                    "created_utc": 1567080274.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is comment from Variety.com\n\n “F him.i had been telling HR and senior staff about his behavior since 2015… he meddles in every aspect of employees that had been sexually harassed and dismissed it as bull andnlies and money hungry and HR did NOTHING as well as the hotels around the country he has or had with escorts all over the place…MPAA is deep in sexually misconduct and birry It” \n \nYikes..",
            "author": "brownandsweet",
            "id": "eyc7y4c",
            "parent_id": "t3_cwj35u",
            "score": 19,
            "created_utc": 1566997950.0,
            "replies": [
                {
                    "body": "I wonder if there will ever be a time where companies only focus isn't the bottom line. Companies keep focusing on their customers satisfaction, when will they focus on their employees satisfaction? It's definitely a cultural thing, but I wonder what, if anything, will change this structure.",
                    "author": "aceshighsays",
                    "id": "eyd58s6",
                    "parent_id": "t1_eyc7y4c",
                    "score": 6,
                    "created_utc": 1567011435.0,
                    "replies": [
                        {
                            "body": "Funny you should mention this, because according to this NY Times article 200 CEO's (including Apple, Amazon, JP Morgan, Pepsi and Walmart) that form the Business Round table (a lobby group) put out a press release saying that, \n\n\"companies should no longer advance only the interests of shareholders. Instead, the group said, they must also invest in their employees, protect the environment and deal fairly and ethically with their suppliers.\"\n\nMaybe it's just a smoke screen and wont ever amount to anything but I'd like to think its a baby step in the right direction.  Here a link to the article.  \n\nhttps://www.nytimes.com/2019/08/19/business/business-roundtable-ceos-corporations.html\n\nAnd the Buisness Round table statement (which I have not read yet), \n\nhttps://opportunity.businessroundtable.org/ourcommitment/",
                            "author": "downtime37",
                            "id": "eydfl9a",
                            "parent_id": "t1_eyd58s6",
                            "score": 3,
                            "created_utc": 1567017794.0,
                            "replies": [
                                {
                                    "body": "Thanks for the articles. I will read them on the train.\n\nIt's hard to hold that statement at face value when you read stories like Amazon warehouse employees being forced to not pee or get deducted pay. \n\nWhat does it mean to \"invest in their employees, protect the environment and deal fairly and ethically with their suppliers.\"? That statement isn't specific enough to be effective. \n\nFor example, at the fundamental level for a company to \"invest in their employees\" the employee would have to stick around for a while. How could that happen if the trend is no longer to work at the same job for 20 years? Hell, if you work at the same company for 5 years you're negatively judged for it.\n\nAdditionally, it's been said that by 2026, there will be more independent contractors than employees. I bet \"employees\" will only be high level executives, and the independent contractors will be everyone else. They're just changing the verbiage but keeping everything else the same.",
                                    "author": "aceshighsays",
                                    "id": "eydx0sf",
                                    "parent_id": "t1_eydfl9a",
                                    "score": 6,
                                    "created_utc": 1567025847.0,
                                    "replies": [
                                        {
                                            "body": "The article does say that the statement by the BR is vague and does not mention specifics of how they will achieve there new goals.",
                                            "author": "downtime37",
                                            "id": "eye15qq",
                                            "parent_id": "t1_eydx0sf",
                                            "score": 1,
                                            "created_utc": 1567027401.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Just my opinion...\n\nBut, I have worked for enough corporations to view this statement as nothing but the usual load of BS.  A few minutes of good PR followed by a whole bunch of nothing.\n\nAlso just my opinion...  The problem with corporations isn't that they are evil entities.  Their problem is that they are controlled by people.",
                                    "author": "duckydee543",
                                    "id": "eyeitgl",
                                    "parent_id": "t1_eydfl9a",
                                    "score": 3,
                                    "created_utc": 1567034376.0,
                                    "replies": [
                                        {
                                            "body": "I've worked for plenty of corporations also, and now I own my own business.  The problem with corporations is not that they are controlled by people it is that all that matters is the almighty bottom line. Anything and everything that can be done to squeeze out a few cents more of revue is done.",
                                            "author": "downtime37",
                                            "id": "eyew22w",
                                            "parent_id": "t1_eyeitgl",
                                            "score": 1,
                                            "created_utc": 1567039822.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Capitalism has some downsides...no, I'm not a Communist. LOL.",
                            "author": "puckhead4",
                            "id": "eyded3c",
                            "parent_id": "t1_eyd58s6",
                            "score": 0,
                            "created_utc": 1567017139.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Another prince of a fellow. I particularly like the sneer.",
            "author": "GSSD",
            "id": "eyc85c0",
            "parent_id": "t3_cwj35u",
            "score": 7,
            "created_utc": 1566998034.0,
            "replies": []
        },
        {
            "body": "So as a little aside: here in my state it's an unspoken rule but law enforcement would prefer you kill an attacker than injure them because they could sue you for personal injury but you'll be cleared if you accidentally killed them in self defense.",
            "author": "Mopsydoll",
            "id": "eydqpu6",
            "parent_id": "t3_cwj35u",
            "score": 6,
            "created_utc": 1567023312.0,
            "replies": []
        },
        {
            "body": "Kudos to her for having the guts to come forward and stick it to him.  It is so wrong to terrorize someone like that emotionally and physically.  He is going to learn about bullying in prison.",
            "author": "LotBuilder",
            "id": "eycvf95",
            "parent_id": "t3_cwj35u",
            "score": 13,
            "created_utc": 1567007396.0,
            "replies": []
        },
        {
            "body": "Another reason why opsec is so very important in this lifestyle. Not hosting at her apartment and using a burner number could have saved the girl a lot of grief. Thankfully she had the courage to turn the scumbag in.",
            "author": "supportiveceo",
            "id": "eybyllj",
            "parent_id": "t3_cwj35u",
            "score": 7,
            "created_utc": 1566993863.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eyc0npo",
                    "parent_id": "t1_eybyllj",
                    "score": 22,
                    "created_utc": 1566994778.0,
                    "replies": [
                        {
                            "body": "Opsec would absolutely have limited the extent he could have gone to. I mean, the man found her parents names and phone numbers! With an initial burner, fake name and meeting at a hotel, yes he would have still been a sexually violent narcissist but one who was unable to blackmail her.\n\nAll that to say to newbies, protect your personal information! Your safety comes first.",
                            "author": "yourgirlfriday99",
                            "id": "eyc6w6c",
                            "parent_id": "t1_eyc0npo",
                            "score": 4,
                            "created_utc": 1566997463.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eyc8gkz",
                                    "parent_id": "t1_eyc6w6c",
                                    "score": 8,
                                    "created_utc": 1566998165.0,
                                    "replies": [
                                        {
                                            "body": ">I guess my point is that by the numbers, there is no correlation between women being raped by a date and women using their real phone numbers.\n\nI think the accusation of rape is based upon him forcing her to have sex with him through blackmail.  He was accused of threatening to tell her family, employer, landlord that she was having sex for money if she didn't continue to have sex with him for free.   He was only able to do that because he knew all of her personal information.",
                                            "author": "willfromvb",
                                            "id": "eycbydq",
                                            "parent_id": "t1_eyc8gkz",
                                            "score": 4,
                                            "created_utc": 1566999655.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "eyccig1",
                                                    "parent_id": "t1_eycbydq",
                                                    "score": 2,
                                                    "created_utc": 1566999905.0,
                                                    "replies": [
                                                        {
                                                            "body": "Good point.  I believe most places would consider forcing someone to have sex through blackmail is both blackmail and rape. Forcing doesn't have to be physical and can be coercion.",
                                                            "author": "willfromvb",
                                                            "id": "eycd2mn",
                                                            "parent_id": "t1_eyccig1",
                                                            "score": 2,
                                                            "created_utc": 1567000148.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "*The police allege that Fabrizio and the woman had consensual sex once on Aug. 19, after which he paid her $400. After that, she did not want to see him again. According to the affidavit, Fabrizio sent numerous texts insisting on a second meeting, and threatening to expose her if she did not comply.*\n\n*“I know where you live,” he allegedly wrote. “I know where you work. Don’t think — Hospital would be happy to know that it’s young nurses are having sexual for money / Same for your landlord.”*\n\n\\- [Variety.com](https://Variety.com)\n\nFrom what I've read, it looks like better OpSec could have helped her.   This is not victim shaming and people need to quit using that argument.   If we can't learn how people got into trouble, we can't help prevent other people from getting into that same trouble.   Saying she could have done things differently is not saying it was her fault.    That is political correctness gone mad.\n\nThe victim was extremely courageous to go to the police.  Many women would not have gone to the police out of fear of exposing their Sugar lifestyle.  I'm sure Fabrizio was betting on that.",
                                                            "author": "willfromvb",
                                                            "id": "eyd6v48",
                                                            "parent_id": "t1_eyccig1",
                                                            "score": 2,
                                                            "created_utc": 1567012374.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "eyd9vwr",
                                                                    "parent_id": "t1_eyd6v48",
                                                                    "score": -3,
                                                                    "created_utc": 1567014338.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "If he didn't know her identify, she would not have met him a second time and would not have been raped.\n\nI'm not trying to start an argument.  I'm trying to emphasize the importance of OpSec and protecting your identity with anyone you don't know well and met thru Sugar dating.",
                                                                            "author": "willfromvb",
                                                                            "id": "eydaqmb",
                                                                            "parent_id": "t1_eyd9vwr",
                                                                            "score": 3,
                                                                            "created_utc": 1567014891.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "eydb6xc",
                                                                                    "parent_id": "t1_eydaqmb",
                                                                                    "score": -1,
                                                                                    "created_utc": 1567015183.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I disagree.",
                                                                                            "author": "willfromvb",
                                                                                            "id": "eydbhhg",
                                                                                            "parent_id": "t1_eydb6xc",
                                                                                            "score": 3,
                                                                                            "created_utc": 1567015374.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": ">I guess my point is that by the numbers, there is no correlation between women being raped by a date and women using their real phone numbers. \n\nOf course not, no one suggested otherwise?\n\n>“yes she would have been raped but at least he wouldn’t know her moms name” as some sort of reason for women to use fake phone numbers is...bizarre?\n\nComplete strawman. If that's what you read from my comment then I'd suggest reading again. Its wider than just the particulars of this story. The crux is that not looking after your personal information before you get to know someone, both for SB's and SD's, can lead to dangerous and scary blackmail scenarios and saying 'There's nothing you can do, it can happen anyway' is wrong and could prevent another newbie from learning from this scenario. \n\n>You’ll notice she went to the police any way, which would indicate she didn’t really care if this complete lunatic called her mom.\n\nNo, it indicated that she knew he had the dangerous combination of being crazy and also having enough information to ruin her life and that her mother knowing was the least of her worries at this point.\n\n>All that said I agree about not bringing someone home if you don’t trust them. I just don’t necessarily think it will prevent this situation. It would have changed the location and the nature of the threats.\n\nOf course it could have prevented *elements of* the situation! If he didn't have that information, there would have been no way to contact or trace her after the first horrible meet. That's not to blame her at all but to encourage other newbies to take heed.",
                                            "author": "yourgirlfriday99",
                                            "id": "eyca13x",
                                            "parent_id": "t1_eyc8gkz",
                                            "score": 0,
                                            "created_utc": 1566998854.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "eycbmco",
                                                    "parent_id": "t1_eyca13x",
                                                    "score": 3,
                                                    "created_utc": 1566999520.0,
                                                    "replies": [
                                                        {
                                                            "body": ">It’s “take practical measures to be safe but don’t let your perceived anonymity lull you into a false sense of safety because this or a variation of it could happen to any woman who decided to sleep with a guy.”\n\nWho argued against this? This is obvious. You literally dismissed his safety suggestions (that are also often mentioned on SLF anyway) as pointless because the guy would have done it anyway. \n\nBut regardless, I hope that other newbies reading this can take something from this thanks to her courage in going to the police and highlighting the dangers. If even one person can avoid the horror of being blackmailed with a few simple measures, then that's a positive in my eyes.",
                                                            "author": "yourgirlfriday99",
                                                            "id": "eyccll0",
                                                            "parent_id": "t1_eycbmco",
                                                            "score": 2,
                                                            "created_utc": 1566999939.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "eycd3tn",
                                                                    "parent_id": "t1_eyccll0",
                                                                    "score": 0,
                                                                    "created_utc": 1567000165.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": ">Let’s agree to disagree on the effectiveness of a burner phone as a “safety measure” when one is confronted with a sexually violent predator. \n\nAgain, misrepresenting what I'm saying and in the most beautifully passive aggressive way :) It should be clear to you by now that what the other poster and I are referring to when we talk about opsec is the blackmail, not the rape. \n\nBut yes, let's agree to disagree.",
                                                                            "author": "yourgirlfriday99",
                                                                            "id": "eycdw9z",
                                                                            "parent_id": "t1_eycd3tn",
                                                                            "score": 2,
                                                                            "created_utc": 1567000477.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": ">what the other poster and I are referring to when we talk about opsec is the blackmail, not the rape\n\nand using a fake number/burner phone that she knew he couldn't trace might have given her the slightly larger peace of mind to ignore any BS threat he came up with to force the 2nd visit\n\nI had a SB threaten blackmail once and because I had used a Google Voice number from a burner phone I was certain enough she had nothing on me, so I just ignored the threat and she went away",
                                                                                    "author": "joc13",
                                                                                    "id": "eyi4zjh",
                                                                                    "parent_id": "t1_eycdw9z",
                                                                                    "score": 1,
                                                                                    "created_utc": 1567097666.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I’m sorry but I disagree with you. Predators take the path of least resistance. Showing someone where you live and giving up your real number where a simple google search or FB search reveals all information about you puts that person at a significant disadvantage. While it’s true that she could have been raped in a hotel ( still hard when there’s fear of hotel security and other information being readily available to law enforcement if there’s trouble), with the above mentioned opsec, there would not have been a second time or further blackmail if he did not know her identity.",
                            "author": "supportiveceo",
                            "id": "eyc6yfg",
                            "parent_id": "t1_eyc0npo",
                            "score": 2,
                            "created_utc": 1566997490.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eyc9w4g",
                                    "parent_id": "t1_eyc6yfg",
                                    "score": 4,
                                    "created_utc": 1566998786.0,
                                    "replies": [
                                        {
                                            "body": "When money and sex are involved, unfortunately it brings in a lot more unsavory elements on both sides of the bowl. Society unfortunately still sees sugar dating as a form of prostitution. Whenever activities are done against “Society morals”, it brings up more chances for blackmail and extortion on both sides. Predators are prevalent on both sides of the bowls and I don’t consider them as true SB or SDs, so you are just twisting my words here.",
                                            "author": "supportiveceo",
                                            "id": "eyce7fo",
                                            "parent_id": "t1_eyc9w4g",
                                            "score": 2,
                                            "created_utc": 1567000572.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yes, I agree with the SB here.  Moreover I think the burner phone randomness attempts at anonymity increase the danger to all involved parties.    \n\nDefinitely a young girl who doesn’t quite grasp how the real world works... she actually had the upper hand on him from the beginning but was too intimidated to simply forward copies of his texts to his office.   She had nothing to lose.",
                            "author": "FlexEconGuy",
                            "id": "eyc7760",
                            "parent_id": "t1_eyc0npo",
                            "score": -3,
                            "created_utc": 1566997599.0,
                            "replies": [
                                {
                                    "body": "Apparently the employees have been complaining about his behavior since 2015. All their complaints were dismissed.",
                                    "author": "brownandsweet",
                                    "id": "eyc8cro",
                                    "parent_id": "t1_eyc7760",
                                    "score": 9,
                                    "created_utc": 1566998123.0,
                                    "replies": [
                                        {
                                            "body": "Yes, this happens a lot.  It’s why you go out and find a female lawyer on a mission and bust his balls.   I’d love to share more stories on issues like this but really can’t without divulging too much personal info.",
                                            "author": "FlexEconGuy",
                                            "id": "eycbl1b",
                                            "parent_id": "t1_eyc8cro",
                                            "score": -1,
                                            "created_utc": 1566999506.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eyc915k",
                    "parent_id": "t1_eybyllj",
                    "score": 12,
                    "created_utc": 1566998401.0,
                    "replies": [
                        {
                            "body": "I’m not victim shaming at all. Also my comment was just to make an observation about opsec in general. It’s more for the newbies reading the forum to take safety precautions seriously. Of course, all safety precautions are never 100% effective, but that doesn’t mean that you don’t take them. How does the fact that the victim is a participant on Slf have anything to do with discussion on opsec? Also, are you suggesting that people don’t take opsec measures because it will not prevent anything anyways?",
                            "author": "supportiveceo",
                            "id": "eycc1kx",
                            "parent_id": "t1_eyc915k",
                            "score": 2,
                            "created_utc": 1566999699.0,
                            "replies": []
                        },
                        {
                            "body": "It is not victim blaming to suggest strategies that lower the chance of you becoming a victim. If I leave my car running when I run into the market and it gets stolen, it is not victim blaming for the police (or anyone else) to suggest not leaving my car running when I am not in it. The thief is still a thief and I am still a victim. If I didn't leave my car running, it would have lowered the risk that I would have been his victim. That's all we're saying. Use a burner, secure your valuables, and try to avoid dark alleys at night are all good pieces of advice for people looking to avoid being crime victims.",
                            "author": "This_is_Not_My_Handl",
                            "id": "eydgjdk",
                            "parent_id": "t1_eyc915k",
                            "score": 0,
                            "created_utc": 1567018266.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yes but very few people have any \"real\" training or experience in true OPSEC.",
                    "author": "puckhead4",
                    "id": "eydehxw",
                    "parent_id": "t1_eybyllj",
                    "score": 3,
                    "created_utc": 1567017208.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How long before SA gets shut down for this kind of stuff?",
            "author": "Aaronm989",
            "id": "eye09no",
            "parent_id": "t3_cwj35u",
            "score": 2,
            "created_utc": 1567027054.0,
            "replies": []
        },
        {
            "body": "Am I missing something? By exposing her he is as well exposing himself. As well she obviously was giving him too much personal information anyway after one meet... address, job location",
            "author": "SummerLuv111",
            "id": "eycuz2x",
            "parent_id": "t3_cwj35u",
            "score": 2,
            "created_utc": 1567007227.0,
            "replies": [
                {
                    "body": "> she obviously was giving him too much personal information anyway after one meet\n\nAll it takes is one little slip up. Ignorantly use your real phone number? I can probably have your real name, address, place of employment and most info on your family in an hour. Hell, I can probably call your dad at his work and let him know what you've been up to. Information is terrifyingly easy to come across these days.",
                    "author": "This_is_Not_My_Handl",
                    "id": "eydex3e",
                    "parent_id": "t1_eycuz2x",
                    "score": 2,
                    "created_utc": 1567017433.0,
                    "replies": [
                        {
                            "body": "Oh I can as well, one or two small details a couple key strokes and I can find out most things I want to know. That is why I am so careful",
                            "author": "SummerLuv111",
                            "id": "eydgojd",
                            "parent_id": "t1_eydex3e",
                            "score": 2,
                            "created_utc": 1567018336.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "But but but whealthy men aren't like that...",
            "author": "ChiCAWgoharlot",
            "id": "eyeiq1h",
            "parent_id": "t3_cwj35u",
            "score": 0,
            "created_utc": 1567034337.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eyc0w44",
            "parent_id": "t1_eybqkbw",
            "score": 18,
            "created_utc": 1566994878.0,
            "replies": [
                {
                    "body": "What a snarky looking photo.......",
                    "author": "pinotandsugar",
                    "id": "eydnccn",
                    "parent_id": "t1_eyc0w44",
                    "score": 2,
                    "created_utc": 1567021646.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The details do sound somewhat familiar.",
            "author": "willfromvb",
            "id": "eybx3rr",
            "parent_id": "t1_eybvgfh",
            "score": 14,
            "created_utc": 1566993248.0,
            "replies": []
        },
        {
            "body": "You mean our advice finally helped someone? Yay!",
            "author": null,
            "id": "eyh1hnz",
            "parent_id": "t1_eybvgfh",
            "score": 3,
            "created_utc": 1567080274.0,
            "replies": []
        },
        {
            "body": "I wonder if there will ever be a time where companies only focus isn't the bottom line. Companies keep focusing on their customers satisfaction, when will they focus on their employees satisfaction? It's definitely a cultural thing, but I wonder what, if anything, will change this structure.",
            "author": "aceshighsays",
            "id": "eyd58s6",
            "parent_id": "t1_eyc7y4c",
            "score": 6,
            "created_utc": 1567011435.0,
            "replies": [
                {
                    "body": "Funny you should mention this, because according to this NY Times article 200 CEO's (including Apple, Amazon, JP Morgan, Pepsi and Walmart) that form the Business Round table (a lobby group) put out a press release saying that, \n\n\"companies should no longer advance only the interests of shareholders. Instead, the group said, they must also invest in their employees, protect the environment and deal fairly and ethically with their suppliers.\"\n\nMaybe it's just a smoke screen and wont ever amount to anything but I'd like to think its a baby step in the right direction.  Here a link to the article.  \n\nhttps://www.nytimes.com/2019/08/19/business/business-roundtable-ceos-corporations.html\n\nAnd the Buisness Round table statement (which I have not read yet), \n\nhttps://opportunity.businessroundtable.org/ourcommitment/",
                    "author": "downtime37",
                    "id": "eydfl9a",
                    "parent_id": "t1_eyd58s6",
                    "score": 3,
                    "created_utc": 1567017794.0,
                    "replies": [
                        {
                            "body": "Thanks for the articles. I will read them on the train.\n\nIt's hard to hold that statement at face value when you read stories like Amazon warehouse employees being forced to not pee or get deducted pay. \n\nWhat does it mean to \"invest in their employees, protect the environment and deal fairly and ethically with their suppliers.\"? That statement isn't specific enough to be effective. \n\nFor example, at the fundamental level for a company to \"invest in their employees\" the employee would have to stick around for a while. How could that happen if the trend is no longer to work at the same job for 20 years? Hell, if you work at the same company for 5 years you're negatively judged for it.\n\nAdditionally, it's been said that by 2026, there will be more independent contractors than employees. I bet \"employees\" will only be high level executives, and the independent contractors will be everyone else. They're just changing the verbiage but keeping everything else the same.",
                            "author": "aceshighsays",
                            "id": "eydx0sf",
                            "parent_id": "t1_eydfl9a",
                            "score": 6,
                            "created_utc": 1567025847.0,
                            "replies": [
                                {
                                    "body": "The article does say that the statement by the BR is vague and does not mention specifics of how they will achieve there new goals.",
                                    "author": "downtime37",
                                    "id": "eye15qq",
                                    "parent_id": "t1_eydx0sf",
                                    "score": 1,
                                    "created_utc": 1567027401.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Just my opinion...\n\nBut, I have worked for enough corporations to view this statement as nothing but the usual load of BS.  A few minutes of good PR followed by a whole bunch of nothing.\n\nAlso just my opinion...  The problem with corporations isn't that they are evil entities.  Their problem is that they are controlled by people.",
                            "author": "duckydee543",
                            "id": "eyeitgl",
                            "parent_id": "t1_eydfl9a",
                            "score": 3,
                            "created_utc": 1567034376.0,
                            "replies": [
                                {
                                    "body": "I've worked for plenty of corporations also, and now I own my own business.  The problem with corporations is not that they are controlled by people it is that all that matters is the almighty bottom line. Anything and everything that can be done to squeeze out a few cents more of revue is done.",
                                    "author": "downtime37",
                                    "id": "eyew22w",
                                    "parent_id": "t1_eyeitgl",
                                    "score": 1,
                                    "created_utc": 1567039822.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Capitalism has some downsides...no, I'm not a Communist. LOL.",
                    "author": "puckhead4",
                    "id": "eyded3c",
                    "parent_id": "t1_eyd58s6",
                    "score": 0,
                    "created_utc": 1567017139.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eyc0npo",
            "parent_id": "t1_eybyllj",
            "score": 22,
            "created_utc": 1566994778.0,
            "replies": [
                {
                    "body": "Opsec would absolutely have limited the extent he could have gone to. I mean, the man found her parents names and phone numbers! With an initial burner, fake name and meeting at a hotel, yes he would have still been a sexually violent narcissist but one who was unable to blackmail her.\n\nAll that to say to newbies, protect your personal information! Your safety comes first.",
                    "author": "yourgirlfriday99",
                    "id": "eyc6w6c",
                    "parent_id": "t1_eyc0npo",
                    "score": 4,
                    "created_utc": 1566997463.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eyc8gkz",
                            "parent_id": "t1_eyc6w6c",
                            "score": 8,
                            "created_utc": 1566998165.0,
                            "replies": [
                                {
                                    "body": ">I guess my point is that by the numbers, there is no correlation between women being raped by a date and women using their real phone numbers.\n\nI think the accusation of rape is based upon him forcing her to have sex with him through blackmail.  He was accused of threatening to tell her family, employer, landlord that she was having sex for money if she didn't continue to have sex with him for free.   He was only able to do that because he knew all of her personal information.",
                                    "author": "willfromvb",
                                    "id": "eycbydq",
                                    "parent_id": "t1_eyc8gkz",
                                    "score": 4,
                                    "created_utc": 1566999655.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "eyccig1",
                                            "parent_id": "t1_eycbydq",
                                            "score": 2,
                                            "created_utc": 1566999905.0,
                                            "replies": [
                                                {
                                                    "body": "Good point.  I believe most places would consider forcing someone to have sex through blackmail is both blackmail and rape. Forcing doesn't have to be physical and can be coercion.",
                                                    "author": "willfromvb",
                                                    "id": "eycd2mn",
                                                    "parent_id": "t1_eyccig1",
                                                    "score": 2,
                                                    "created_utc": 1567000148.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "*The police allege that Fabrizio and the woman had consensual sex once on Aug. 19, after which he paid her $400. After that, she did not want to see him again. According to the affidavit, Fabrizio sent numerous texts insisting on a second meeting, and threatening to expose her if she did not comply.*\n\n*“I know where you live,” he allegedly wrote. “I know where you work. Don’t think — Hospital would be happy to know that it’s young nurses are having sexual for money / Same for your landlord.”*\n\n\\- [Variety.com](https://Variety.com)\n\nFrom what I've read, it looks like better OpSec could have helped her.   This is not victim shaming and people need to quit using that argument.   If we can't learn how people got into trouble, we can't help prevent other people from getting into that same trouble.   Saying she could have done things differently is not saying it was her fault.    That is political correctness gone mad.\n\nThe victim was extremely courageous to go to the police.  Many women would not have gone to the police out of fear of exposing their Sugar lifestyle.  I'm sure Fabrizio was betting on that.",
                                                    "author": "willfromvb",
                                                    "id": "eyd6v48",
                                                    "parent_id": "t1_eyccig1",
                                                    "score": 2,
                                                    "created_utc": 1567012374.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "eyd9vwr",
                                                            "parent_id": "t1_eyd6v48",
                                                            "score": -3,
                                                            "created_utc": 1567014338.0,
                                                            "replies": [
                                                                {
                                                                    "body": "If he didn't know her identify, she would not have met him a second time and would not have been raped.\n\nI'm not trying to start an argument.  I'm trying to emphasize the importance of OpSec and protecting your identity with anyone you don't know well and met thru Sugar dating.",
                                                                    "author": "willfromvb",
                                                                    "id": "eydaqmb",
                                                                    "parent_id": "t1_eyd9vwr",
                                                                    "score": 3,
                                                                    "created_utc": 1567014891.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "eydb6xc",
                                                                            "parent_id": "t1_eydaqmb",
                                                                            "score": -1,
                                                                            "created_utc": 1567015183.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I disagree.",
                                                                                    "author": "willfromvb",
                                                                                    "id": "eydbhhg",
                                                                                    "parent_id": "t1_eydb6xc",
                                                                                    "score": 3,
                                                                                    "created_utc": 1567015374.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": ">I guess my point is that by the numbers, there is no correlation between women being raped by a date and women using their real phone numbers. \n\nOf course not, no one suggested otherwise?\n\n>“yes she would have been raped but at least he wouldn’t know her moms name” as some sort of reason for women to use fake phone numbers is...bizarre?\n\nComplete strawman. If that's what you read from my comment then I'd suggest reading again. Its wider than just the particulars of this story. The crux is that not looking after your personal information before you get to know someone, both for SB's and SD's, can lead to dangerous and scary blackmail scenarios and saying 'There's nothing you can do, it can happen anyway' is wrong and could prevent another newbie from learning from this scenario. \n\n>You’ll notice she went to the police any way, which would indicate she didn’t really care if this complete lunatic called her mom.\n\nNo, it indicated that she knew he had the dangerous combination of being crazy and also having enough information to ruin her life and that her mother knowing was the least of her worries at this point.\n\n>All that said I agree about not bringing someone home if you don’t trust them. I just don’t necessarily think it will prevent this situation. It would have changed the location and the nature of the threats.\n\nOf course it could have prevented *elements of* the situation! If he didn't have that information, there would have been no way to contact or trace her after the first horrible meet. That's not to blame her at all but to encourage other newbies to take heed.",
                                    "author": "yourgirlfriday99",
                                    "id": "eyca13x",
                                    "parent_id": "t1_eyc8gkz",
                                    "score": 0,
                                    "created_utc": 1566998854.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "eycbmco",
                                            "parent_id": "t1_eyca13x",
                                            "score": 3,
                                            "created_utc": 1566999520.0,
                                            "replies": [
                                                {
                                                    "body": ">It’s “take practical measures to be safe but don’t let your perceived anonymity lull you into a false sense of safety because this or a variation of it could happen to any woman who decided to sleep with a guy.”\n\nWho argued against this? This is obvious. You literally dismissed his safety suggestions (that are also often mentioned on SLF anyway) as pointless because the guy would have done it anyway. \n\nBut regardless, I hope that other newbies reading this can take something from this thanks to her courage in going to the police and highlighting the dangers. If even one person can avoid the horror of being blackmailed with a few simple measures, then that's a positive in my eyes.",
                                                    "author": "yourgirlfriday99",
                                                    "id": "eyccll0",
                                                    "parent_id": "t1_eycbmco",
                                                    "score": 2,
                                                    "created_utc": 1566999939.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "eycd3tn",
                                                            "parent_id": "t1_eyccll0",
                                                            "score": 0,
                                                            "created_utc": 1567000165.0,
                                                            "replies": [
                                                                {
                                                                    "body": ">Let’s agree to disagree on the effectiveness of a burner phone as a “safety measure” when one is confronted with a sexually violent predator. \n\nAgain, misrepresenting what I'm saying and in the most beautifully passive aggressive way :) It should be clear to you by now that what the other poster and I are referring to when we talk about opsec is the blackmail, not the rape. \n\nBut yes, let's agree to disagree.",
                                                                    "author": "yourgirlfriday99",
                                                                    "id": "eycdw9z",
                                                                    "parent_id": "t1_eycd3tn",
                                                                    "score": 2,
                                                                    "created_utc": 1567000477.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": ">what the other poster and I are referring to when we talk about opsec is the blackmail, not the rape\n\nand using a fake number/burner phone that she knew he couldn't trace might have given her the slightly larger peace of mind to ignore any BS threat he came up with to force the 2nd visit\n\nI had a SB threaten blackmail once and because I had used a Google Voice number from a burner phone I was certain enough she had nothing on me, so I just ignored the threat and she went away",
                                                                            "author": "joc13",
                                                                            "id": "eyi4zjh",
                                                                            "parent_id": "t1_eycdw9z",
                                                                            "score": 1,
                                                                            "created_utc": 1567097666.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’m sorry but I disagree with you. Predators take the path of least resistance. Showing someone where you live and giving up your real number where a simple google search or FB search reveals all information about you puts that person at a significant disadvantage. While it’s true that she could have been raped in a hotel ( still hard when there’s fear of hotel security and other information being readily available to law enforcement if there’s trouble), with the above mentioned opsec, there would not have been a second time or further blackmail if he did not know her identity.",
                    "author": "supportiveceo",
                    "id": "eyc6yfg",
                    "parent_id": "t1_eyc0npo",
                    "score": 2,
                    "created_utc": 1566997490.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eyc9w4g",
                            "parent_id": "t1_eyc6yfg",
                            "score": 4,
                            "created_utc": 1566998786.0,
                            "replies": [
                                {
                                    "body": "When money and sex are involved, unfortunately it brings in a lot more unsavory elements on both sides of the bowl. Society unfortunately still sees sugar dating as a form of prostitution. Whenever activities are done against “Society morals”, it brings up more chances for blackmail and extortion on both sides. Predators are prevalent on both sides of the bowls and I don’t consider them as true SB or SDs, so you are just twisting my words here.",
                                    "author": "supportiveceo",
                                    "id": "eyce7fo",
                                    "parent_id": "t1_eyc9w4g",
                                    "score": 2,
                                    "created_utc": 1567000572.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes, I agree with the SB here.  Moreover I think the burner phone randomness attempts at anonymity increase the danger to all involved parties.    \n\nDefinitely a young girl who doesn’t quite grasp how the real world works... she actually had the upper hand on him from the beginning but was too intimidated to simply forward copies of his texts to his office.   She had nothing to lose.",
                    "author": "FlexEconGuy",
                    "id": "eyc7760",
                    "parent_id": "t1_eyc0npo",
                    "score": -3,
                    "created_utc": 1566997599.0,
                    "replies": [
                        {
                            "body": "Apparently the employees have been complaining about his behavior since 2015. All their complaints were dismissed.",
                            "author": "brownandsweet",
                            "id": "eyc8cro",
                            "parent_id": "t1_eyc7760",
                            "score": 9,
                            "created_utc": 1566998123.0,
                            "replies": [
                                {
                                    "body": "Yes, this happens a lot.  It’s why you go out and find a female lawyer on a mission and bust his balls.   I’d love to share more stories on issues like this but really can’t without divulging too much personal info.",
                                    "author": "FlexEconGuy",
                                    "id": "eycbl1b",
                                    "parent_id": "t1_eyc8cro",
                                    "score": -1,
                                    "created_utc": 1566999506.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eyc915k",
            "parent_id": "t1_eybyllj",
            "score": 12,
            "created_utc": 1566998401.0,
            "replies": [
                {
                    "body": "I’m not victim shaming at all. Also my comment was just to make an observation about opsec in general. It’s more for the newbies reading the forum to take safety precautions seriously. Of course, all safety precautions are never 100% effective, but that doesn’t mean that you don’t take them. How does the fact that the victim is a participant on Slf have anything to do with discussion on opsec? Also, are you suggesting that people don’t take opsec measures because it will not prevent anything anyways?",
                    "author": "supportiveceo",
                    "id": "eycc1kx",
                    "parent_id": "t1_eyc915k",
                    "score": 2,
                    "created_utc": 1566999699.0,
                    "replies": []
                },
                {
                    "body": "It is not victim blaming to suggest strategies that lower the chance of you becoming a victim. If I leave my car running when I run into the market and it gets stolen, it is not victim blaming for the police (or anyone else) to suggest not leaving my car running when I am not in it. The thief is still a thief and I am still a victim. If I didn't leave my car running, it would have lowered the risk that I would have been his victim. That's all we're saying. Use a burner, secure your valuables, and try to avoid dark alleys at night are all good pieces of advice for people looking to avoid being crime victims.",
                    "author": "This_is_Not_My_Handl",
                    "id": "eydgjdk",
                    "parent_id": "t1_eyc915k",
                    "score": 0,
                    "created_utc": 1567018266.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes but very few people have any \"real\" training or experience in true OPSEC.",
            "author": "puckhead4",
            "id": "eydehxw",
            "parent_id": "t1_eybyllj",
            "score": 3,
            "created_utc": 1567017208.0,
            "replies": []
        },
        {
            "body": "> she obviously was giving him too much personal information anyway after one meet\n\nAll it takes is one little slip up. Ignorantly use your real phone number? I can probably have your real name, address, place of employment and most info on your family in an hour. Hell, I can probably call your dad at his work and let him know what you've been up to. Information is terrifyingly easy to come across these days.",
            "author": "This_is_Not_My_Handl",
            "id": "eydex3e",
            "parent_id": "t1_eycuz2x",
            "score": 2,
            "created_utc": 1567017433.0,
            "replies": [
                {
                    "body": "Oh I can as well, one or two small details a couple key strokes and I can find out most things I want to know. That is why I am so careful",
                    "author": "SummerLuv111",
                    "id": "eydgojd",
                    "parent_id": "t1_eydex3e",
                    "score": 2,
                    "created_utc": 1567018336.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What a snarky looking photo.......",
            "author": "pinotandsugar",
            "id": "eydnccn",
            "parent_id": "t1_eyc0w44",
            "score": 2,
            "created_utc": 1567021646.0,
            "replies": []
        },
        {
            "body": "Funny you should mention this, because according to this NY Times article 200 CEO's (including Apple, Amazon, JP Morgan, Pepsi and Walmart) that form the Business Round table (a lobby group) put out a press release saying that, \n\n\"companies should no longer advance only the interests of shareholders. Instead, the group said, they must also invest in their employees, protect the environment and deal fairly and ethically with their suppliers.\"\n\nMaybe it's just a smoke screen and wont ever amount to anything but I'd like to think its a baby step in the right direction.  Here a link to the article.  \n\nhttps://www.nytimes.com/2019/08/19/business/business-roundtable-ceos-corporations.html\n\nAnd the Buisness Round table statement (which I have not read yet), \n\nhttps://opportunity.businessroundtable.org/ourcommitment/",
            "author": "downtime37",
            "id": "eydfl9a",
            "parent_id": "t1_eyd58s6",
            "score": 3,
            "created_utc": 1567017794.0,
            "replies": [
                {
                    "body": "Thanks for the articles. I will read them on the train.\n\nIt's hard to hold that statement at face value when you read stories like Amazon warehouse employees being forced to not pee or get deducted pay. \n\nWhat does it mean to \"invest in their employees, protect the environment and deal fairly and ethically with their suppliers.\"? That statement isn't specific enough to be effective. \n\nFor example, at the fundamental level for a company to \"invest in their employees\" the employee would have to stick around for a while. How could that happen if the trend is no longer to work at the same job for 20 years? Hell, if you work at the same company for 5 years you're negatively judged for it.\n\nAdditionally, it's been said that by 2026, there will be more independent contractors than employees. I bet \"employees\" will only be high level executives, and the independent contractors will be everyone else. They're just changing the verbiage but keeping everything else the same.",
                    "author": "aceshighsays",
                    "id": "eydx0sf",
                    "parent_id": "t1_eydfl9a",
                    "score": 6,
                    "created_utc": 1567025847.0,
                    "replies": [
                        {
                            "body": "The article does say that the statement by the BR is vague and does not mention specifics of how they will achieve there new goals.",
                            "author": "downtime37",
                            "id": "eye15qq",
                            "parent_id": "t1_eydx0sf",
                            "score": 1,
                            "created_utc": 1567027401.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Just my opinion...\n\nBut, I have worked for enough corporations to view this statement as nothing but the usual load of BS.  A few minutes of good PR followed by a whole bunch of nothing.\n\nAlso just my opinion...  The problem with corporations isn't that they are evil entities.  Their problem is that they are controlled by people.",
                    "author": "duckydee543",
                    "id": "eyeitgl",
                    "parent_id": "t1_eydfl9a",
                    "score": 3,
                    "created_utc": 1567034376.0,
                    "replies": [
                        {
                            "body": "I've worked for plenty of corporations also, and now I own my own business.  The problem with corporations is not that they are controlled by people it is that all that matters is the almighty bottom line. Anything and everything that can be done to squeeze out a few cents more of revue is done.",
                            "author": "downtime37",
                            "id": "eyew22w",
                            "parent_id": "t1_eyeitgl",
                            "score": 1,
                            "created_utc": 1567039822.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Capitalism has some downsides...no, I'm not a Communist. LOL.",
            "author": "puckhead4",
            "id": "eyded3c",
            "parent_id": "t1_eyd58s6",
            "score": 0,
            "created_utc": 1567017139.0,
            "replies": []
        },
        {
            "body": "Opsec would absolutely have limited the extent he could have gone to. I mean, the man found her parents names and phone numbers! With an initial burner, fake name and meeting at a hotel, yes he would have still been a sexually violent narcissist but one who was unable to blackmail her.\n\nAll that to say to newbies, protect your personal information! Your safety comes first.",
            "author": "yourgirlfriday99",
            "id": "eyc6w6c",
            "parent_id": "t1_eyc0npo",
            "score": 4,
            "created_utc": 1566997463.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eyc8gkz",
                    "parent_id": "t1_eyc6w6c",
                    "score": 8,
                    "created_utc": 1566998165.0,
                    "replies": [
                        {
                            "body": ">I guess my point is that by the numbers, there is no correlation between women being raped by a date and women using their real phone numbers.\n\nI think the accusation of rape is based upon him forcing her to have sex with him through blackmail.  He was accused of threatening to tell her family, employer, landlord that she was having sex for money if she didn't continue to have sex with him for free.   He was only able to do that because he knew all of her personal information.",
                            "author": "willfromvb",
                            "id": "eycbydq",
                            "parent_id": "t1_eyc8gkz",
                            "score": 4,
                            "created_utc": 1566999655.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eyccig1",
                                    "parent_id": "t1_eycbydq",
                                    "score": 2,
                                    "created_utc": 1566999905.0,
                                    "replies": [
                                        {
                                            "body": "Good point.  I believe most places would consider forcing someone to have sex through blackmail is both blackmail and rape. Forcing doesn't have to be physical and can be coercion.",
                                            "author": "willfromvb",
                                            "id": "eycd2mn",
                                            "parent_id": "t1_eyccig1",
                                            "score": 2,
                                            "created_utc": 1567000148.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "*The police allege that Fabrizio and the woman had consensual sex once on Aug. 19, after which he paid her $400. After that, she did not want to see him again. According to the affidavit, Fabrizio sent numerous texts insisting on a second meeting, and threatening to expose her if she did not comply.*\n\n*“I know where you live,” he allegedly wrote. “I know where you work. Don’t think — Hospital would be happy to know that it’s young nurses are having sexual for money / Same for your landlord.”*\n\n\\- [Variety.com](https://Variety.com)\n\nFrom what I've read, it looks like better OpSec could have helped her.   This is not victim shaming and people need to quit using that argument.   If we can't learn how people got into trouble, we can't help prevent other people from getting into that same trouble.   Saying she could have done things differently is not saying it was her fault.    That is political correctness gone mad.\n\nThe victim was extremely courageous to go to the police.  Many women would not have gone to the police out of fear of exposing their Sugar lifestyle.  I'm sure Fabrizio was betting on that.",
                                            "author": "willfromvb",
                                            "id": "eyd6v48",
                                            "parent_id": "t1_eyccig1",
                                            "score": 2,
                                            "created_utc": 1567012374.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "eyd9vwr",
                                                    "parent_id": "t1_eyd6v48",
                                                    "score": -3,
                                                    "created_utc": 1567014338.0,
                                                    "replies": [
                                                        {
                                                            "body": "If he didn't know her identify, she would not have met him a second time and would not have been raped.\n\nI'm not trying to start an argument.  I'm trying to emphasize the importance of OpSec and protecting your identity with anyone you don't know well and met thru Sugar dating.",
                                                            "author": "willfromvb",
                                                            "id": "eydaqmb",
                                                            "parent_id": "t1_eyd9vwr",
                                                            "score": 3,
                                                            "created_utc": 1567014891.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "eydb6xc",
                                                                    "parent_id": "t1_eydaqmb",
                                                                    "score": -1,
                                                                    "created_utc": 1567015183.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I disagree.",
                                                                            "author": "willfromvb",
                                                                            "id": "eydbhhg",
                                                                            "parent_id": "t1_eydb6xc",
                                                                            "score": 3,
                                                                            "created_utc": 1567015374.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">I guess my point is that by the numbers, there is no correlation between women being raped by a date and women using their real phone numbers. \n\nOf course not, no one suggested otherwise?\n\n>“yes she would have been raped but at least he wouldn’t know her moms name” as some sort of reason for women to use fake phone numbers is...bizarre?\n\nComplete strawman. If that's what you read from my comment then I'd suggest reading again. Its wider than just the particulars of this story. The crux is that not looking after your personal information before you get to know someone, both for SB's and SD's, can lead to dangerous and scary blackmail scenarios and saying 'There's nothing you can do, it can happen anyway' is wrong and could prevent another newbie from learning from this scenario. \n\n>You’ll notice she went to the police any way, which would indicate she didn’t really care if this complete lunatic called her mom.\n\nNo, it indicated that she knew he had the dangerous combination of being crazy and also having enough information to ruin her life and that her mother knowing was the least of her worries at this point.\n\n>All that said I agree about not bringing someone home if you don’t trust them. I just don’t necessarily think it will prevent this situation. It would have changed the location and the nature of the threats.\n\nOf course it could have prevented *elements of* the situation! If he didn't have that information, there would have been no way to contact or trace her after the first horrible meet. That's not to blame her at all but to encourage other newbies to take heed.",
                            "author": "yourgirlfriday99",
                            "id": "eyca13x",
                            "parent_id": "t1_eyc8gkz",
                            "score": 0,
                            "created_utc": 1566998854.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eycbmco",
                                    "parent_id": "t1_eyca13x",
                                    "score": 3,
                                    "created_utc": 1566999520.0,
                                    "replies": [
                                        {
                                            "body": ">It’s “take practical measures to be safe but don’t let your perceived anonymity lull you into a false sense of safety because this or a variation of it could happen to any woman who decided to sleep with a guy.”\n\nWho argued against this? This is obvious. You literally dismissed his safety suggestions (that are also often mentioned on SLF anyway) as pointless because the guy would have done it anyway. \n\nBut regardless, I hope that other newbies reading this can take something from this thanks to her courage in going to the police and highlighting the dangers. If even one person can avoid the horror of being blackmailed with a few simple measures, then that's a positive in my eyes.",
                                            "author": "yourgirlfriday99",
                                            "id": "eyccll0",
                                            "parent_id": "t1_eycbmco",
                                            "score": 2,
                                            "created_utc": 1566999939.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "eycd3tn",
                                                    "parent_id": "t1_eyccll0",
                                                    "score": 0,
                                                    "created_utc": 1567000165.0,
                                                    "replies": [
                                                        {
                                                            "body": ">Let’s agree to disagree on the effectiveness of a burner phone as a “safety measure” when one is confronted with a sexually violent predator. \n\nAgain, misrepresenting what I'm saying and in the most beautifully passive aggressive way :) It should be clear to you by now that what the other poster and I are referring to when we talk about opsec is the blackmail, not the rape. \n\nBut yes, let's agree to disagree.",
                                                            "author": "yourgirlfriday99",
                                                            "id": "eycdw9z",
                                                            "parent_id": "t1_eycd3tn",
                                                            "score": 2,
                                                            "created_utc": 1567000477.0,
                                                            "replies": [
                                                                {
                                                                    "body": ">what the other poster and I are referring to when we talk about opsec is the blackmail, not the rape\n\nand using a fake number/burner phone that she knew he couldn't trace might have given her the slightly larger peace of mind to ignore any BS threat he came up with to force the 2nd visit\n\nI had a SB threaten blackmail once and because I had used a Google Voice number from a burner phone I was certain enough she had nothing on me, so I just ignored the threat and she went away",
                                                                    "author": "joc13",
                                                                    "id": "eyi4zjh",
                                                                    "parent_id": "t1_eycdw9z",
                                                                    "score": 1,
                                                                    "created_utc": 1567097666.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m sorry but I disagree with you. Predators take the path of least resistance. Showing someone where you live and giving up your real number where a simple google search or FB search reveals all information about you puts that person at a significant disadvantage. While it’s true that she could have been raped in a hotel ( still hard when there’s fear of hotel security and other information being readily available to law enforcement if there’s trouble), with the above mentioned opsec, there would not have been a second time or further blackmail if he did not know her identity.",
            "author": "supportiveceo",
            "id": "eyc6yfg",
            "parent_id": "t1_eyc0npo",
            "score": 2,
            "created_utc": 1566997490.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eyc9w4g",
                    "parent_id": "t1_eyc6yfg",
                    "score": 4,
                    "created_utc": 1566998786.0,
                    "replies": [
                        {
                            "body": "When money and sex are involved, unfortunately it brings in a lot more unsavory elements on both sides of the bowl. Society unfortunately still sees sugar dating as a form of prostitution. Whenever activities are done against “Society morals”, it brings up more chances for blackmail and extortion on both sides. Predators are prevalent on both sides of the bowls and I don’t consider them as true SB or SDs, so you are just twisting my words here.",
                            "author": "supportiveceo",
                            "id": "eyce7fo",
                            "parent_id": "t1_eyc9w4g",
                            "score": 2,
                            "created_utc": 1567000572.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, I agree with the SB here.  Moreover I think the burner phone randomness attempts at anonymity increase the danger to all involved parties.    \n\nDefinitely a young girl who doesn’t quite grasp how the real world works... she actually had the upper hand on him from the beginning but was too intimidated to simply forward copies of his texts to his office.   She had nothing to lose.",
            "author": "FlexEconGuy",
            "id": "eyc7760",
            "parent_id": "t1_eyc0npo",
            "score": -3,
            "created_utc": 1566997599.0,
            "replies": [
                {
                    "body": "Apparently the employees have been complaining about his behavior since 2015. All their complaints were dismissed.",
                    "author": "brownandsweet",
                    "id": "eyc8cro",
                    "parent_id": "t1_eyc7760",
                    "score": 9,
                    "created_utc": 1566998123.0,
                    "replies": [
                        {
                            "body": "Yes, this happens a lot.  It’s why you go out and find a female lawyer on a mission and bust his balls.   I’d love to share more stories on issues like this but really can’t without divulging too much personal info.",
                            "author": "FlexEconGuy",
                            "id": "eycbl1b",
                            "parent_id": "t1_eyc8cro",
                            "score": -1,
                            "created_utc": 1566999506.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m not victim shaming at all. Also my comment was just to make an observation about opsec in general. It’s more for the newbies reading the forum to take safety precautions seriously. Of course, all safety precautions are never 100% effective, but that doesn’t mean that you don’t take them. How does the fact that the victim is a participant on Slf have anything to do with discussion on opsec? Also, are you suggesting that people don’t take opsec measures because it will not prevent anything anyways?",
            "author": "supportiveceo",
            "id": "eycc1kx",
            "parent_id": "t1_eyc915k",
            "score": 2,
            "created_utc": 1566999699.0,
            "replies": []
        },
        {
            "body": "It is not victim blaming to suggest strategies that lower the chance of you becoming a victim. If I leave my car running when I run into the market and it gets stolen, it is not victim blaming for the police (or anyone else) to suggest not leaving my car running when I am not in it. The thief is still a thief and I am still a victim. If I didn't leave my car running, it would have lowered the risk that I would have been his victim. That's all we're saying. Use a burner, secure your valuables, and try to avoid dark alleys at night are all good pieces of advice for people looking to avoid being crime victims.",
            "author": "This_is_Not_My_Handl",
            "id": "eydgjdk",
            "parent_id": "t1_eyc915k",
            "score": 0,
            "created_utc": 1567018266.0,
            "replies": []
        },
        {
            "body": "Oh I can as well, one or two small details a couple key strokes and I can find out most things I want to know. That is why I am so careful",
            "author": "SummerLuv111",
            "id": "eydgojd",
            "parent_id": "t1_eydex3e",
            "score": 2,
            "created_utc": 1567018336.0,
            "replies": []
        },
        {
            "body": "Thanks for the articles. I will read them on the train.\n\nIt's hard to hold that statement at face value when you read stories like Amazon warehouse employees being forced to not pee or get deducted pay. \n\nWhat does it mean to \"invest in their employees, protect the environment and deal fairly and ethically with their suppliers.\"? That statement isn't specific enough to be effective. \n\nFor example, at the fundamental level for a company to \"invest in their employees\" the employee would have to stick around for a while. How could that happen if the trend is no longer to work at the same job for 20 years? Hell, if you work at the same company for 5 years you're negatively judged for it.\n\nAdditionally, it's been said that by 2026, there will be more independent contractors than employees. I bet \"employees\" will only be high level executives, and the independent contractors will be everyone else. They're just changing the verbiage but keeping everything else the same.",
            "author": "aceshighsays",
            "id": "eydx0sf",
            "parent_id": "t1_eydfl9a",
            "score": 6,
            "created_utc": 1567025847.0,
            "replies": [
                {
                    "body": "The article does say that the statement by the BR is vague and does not mention specifics of how they will achieve there new goals.",
                    "author": "downtime37",
                    "id": "eye15qq",
                    "parent_id": "t1_eydx0sf",
                    "score": 1,
                    "created_utc": 1567027401.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just my opinion...\n\nBut, I have worked for enough corporations to view this statement as nothing but the usual load of BS.  A few minutes of good PR followed by a whole bunch of nothing.\n\nAlso just my opinion...  The problem with corporations isn't that they are evil entities.  Their problem is that they are controlled by people.",
            "author": "duckydee543",
            "id": "eyeitgl",
            "parent_id": "t1_eydfl9a",
            "score": 3,
            "created_utc": 1567034376.0,
            "replies": [
                {
                    "body": "I've worked for plenty of corporations also, and now I own my own business.  The problem with corporations is not that they are controlled by people it is that all that matters is the almighty bottom line. Anything and everything that can be done to squeeze out a few cents more of revue is done.",
                    "author": "downtime37",
                    "id": "eyew22w",
                    "parent_id": "t1_eyeitgl",
                    "score": 1,
                    "created_utc": 1567039822.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eyc8gkz",
            "parent_id": "t1_eyc6w6c",
            "score": 8,
            "created_utc": 1566998165.0,
            "replies": [
                {
                    "body": ">I guess my point is that by the numbers, there is no correlation between women being raped by a date and women using their real phone numbers.\n\nI think the accusation of rape is based upon him forcing her to have sex with him through blackmail.  He was accused of threatening to tell her family, employer, landlord that she was having sex for money if she didn't continue to have sex with him for free.   He was only able to do that because he knew all of her personal information.",
                    "author": "willfromvb",
                    "id": "eycbydq",
                    "parent_id": "t1_eyc8gkz",
                    "score": 4,
                    "created_utc": 1566999655.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eyccig1",
                            "parent_id": "t1_eycbydq",
                            "score": 2,
                            "created_utc": 1566999905.0,
                            "replies": [
                                {
                                    "body": "Good point.  I believe most places would consider forcing someone to have sex through blackmail is both blackmail and rape. Forcing doesn't have to be physical and can be coercion.",
                                    "author": "willfromvb",
                                    "id": "eycd2mn",
                                    "parent_id": "t1_eyccig1",
                                    "score": 2,
                                    "created_utc": 1567000148.0,
                                    "replies": []
                                },
                                {
                                    "body": "*The police allege that Fabrizio and the woman had consensual sex once on Aug. 19, after which he paid her $400. After that, she did not want to see him again. According to the affidavit, Fabrizio sent numerous texts insisting on a second meeting, and threatening to expose her if she did not comply.*\n\n*“I know where you live,” he allegedly wrote. “I know where you work. Don’t think — Hospital would be happy to know that it’s young nurses are having sexual for money / Same for your landlord.”*\n\n\\- [Variety.com](https://Variety.com)\n\nFrom what I've read, it looks like better OpSec could have helped her.   This is not victim shaming and people need to quit using that argument.   If we can't learn how people got into trouble, we can't help prevent other people from getting into that same trouble.   Saying she could have done things differently is not saying it was her fault.    That is political correctness gone mad.\n\nThe victim was extremely courageous to go to the police.  Many women would not have gone to the police out of fear of exposing their Sugar lifestyle.  I'm sure Fabrizio was betting on that.",
                                    "author": "willfromvb",
                                    "id": "eyd6v48",
                                    "parent_id": "t1_eyccig1",
                                    "score": 2,
                                    "created_utc": 1567012374.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "eyd9vwr",
                                            "parent_id": "t1_eyd6v48",
                                            "score": -3,
                                            "created_utc": 1567014338.0,
                                            "replies": [
                                                {
                                                    "body": "If he didn't know her identify, she would not have met him a second time and would not have been raped.\n\nI'm not trying to start an argument.  I'm trying to emphasize the importance of OpSec and protecting your identity with anyone you don't know well and met thru Sugar dating.",
                                                    "author": "willfromvb",
                                                    "id": "eydaqmb",
                                                    "parent_id": "t1_eyd9vwr",
                                                    "score": 3,
                                                    "created_utc": 1567014891.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "eydb6xc",
                                                            "parent_id": "t1_eydaqmb",
                                                            "score": -1,
                                                            "created_utc": 1567015183.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I disagree.",
                                                                    "author": "willfromvb",
                                                                    "id": "eydbhhg",
                                                                    "parent_id": "t1_eydb6xc",
                                                                    "score": 3,
                                                                    "created_utc": 1567015374.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">I guess my point is that by the numbers, there is no correlation between women being raped by a date and women using their real phone numbers. \n\nOf course not, no one suggested otherwise?\n\n>“yes she would have been raped but at least he wouldn’t know her moms name” as some sort of reason for women to use fake phone numbers is...bizarre?\n\nComplete strawman. If that's what you read from my comment then I'd suggest reading again. Its wider than just the particulars of this story. The crux is that not looking after your personal information before you get to know someone, both for SB's and SD's, can lead to dangerous and scary blackmail scenarios and saying 'There's nothing you can do, it can happen anyway' is wrong and could prevent another newbie from learning from this scenario. \n\n>You’ll notice she went to the police any way, which would indicate she didn’t really care if this complete lunatic called her mom.\n\nNo, it indicated that she knew he had the dangerous combination of being crazy and also having enough information to ruin her life and that her mother knowing was the least of her worries at this point.\n\n>All that said I agree about not bringing someone home if you don’t trust them. I just don’t necessarily think it will prevent this situation. It would have changed the location and the nature of the threats.\n\nOf course it could have prevented *elements of* the situation! If he didn't have that information, there would have been no way to contact or trace her after the first horrible meet. That's not to blame her at all but to encourage other newbies to take heed.",
                    "author": "yourgirlfriday99",
                    "id": "eyca13x",
                    "parent_id": "t1_eyc8gkz",
                    "score": 0,
                    "created_utc": 1566998854.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eycbmco",
                            "parent_id": "t1_eyca13x",
                            "score": 3,
                            "created_utc": 1566999520.0,
                            "replies": [
                                {
                                    "body": ">It’s “take practical measures to be safe but don’t let your perceived anonymity lull you into a false sense of safety because this or a variation of it could happen to any woman who decided to sleep with a guy.”\n\nWho argued against this? This is obvious. You literally dismissed his safety suggestions (that are also often mentioned on SLF anyway) as pointless because the guy would have done it anyway. \n\nBut regardless, I hope that other newbies reading this can take something from this thanks to her courage in going to the police and highlighting the dangers. If even one person can avoid the horror of being blackmailed with a few simple measures, then that's a positive in my eyes.",
                                    "author": "yourgirlfriday99",
                                    "id": "eyccll0",
                                    "parent_id": "t1_eycbmco",
                                    "score": 2,
                                    "created_utc": 1566999939.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "eycd3tn",
                                            "parent_id": "t1_eyccll0",
                                            "score": 0,
                                            "created_utc": 1567000165.0,
                                            "replies": [
                                                {
                                                    "body": ">Let’s agree to disagree on the effectiveness of a burner phone as a “safety measure” when one is confronted with a sexually violent predator. \n\nAgain, misrepresenting what I'm saying and in the most beautifully passive aggressive way :) It should be clear to you by now that what the other poster and I are referring to when we talk about opsec is the blackmail, not the rape. \n\nBut yes, let's agree to disagree.",
                                                    "author": "yourgirlfriday99",
                                                    "id": "eycdw9z",
                                                    "parent_id": "t1_eycd3tn",
                                                    "score": 2,
                                                    "created_utc": 1567000477.0,
                                                    "replies": [
                                                        {
                                                            "body": ">what the other poster and I are referring to when we talk about opsec is the blackmail, not the rape\n\nand using a fake number/burner phone that she knew he couldn't trace might have given her the slightly larger peace of mind to ignore any BS threat he came up with to force the 2nd visit\n\nI had a SB threaten blackmail once and because I had used a Google Voice number from a burner phone I was certain enough she had nothing on me, so I just ignored the threat and she went away",
                                                            "author": "joc13",
                                                            "id": "eyi4zjh",
                                                            "parent_id": "t1_eycdw9z",
                                                            "score": 1,
                                                            "created_utc": 1567097666.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eyc9w4g",
            "parent_id": "t1_eyc6yfg",
            "score": 4,
            "created_utc": 1566998786.0,
            "replies": [
                {
                    "body": "When money and sex are involved, unfortunately it brings in a lot more unsavory elements on both sides of the bowl. Society unfortunately still sees sugar dating as a form of prostitution. Whenever activities are done against “Society morals”, it brings up more chances for blackmail and extortion on both sides. Predators are prevalent on both sides of the bowls and I don’t consider them as true SB or SDs, so you are just twisting my words here.",
                    "author": "supportiveceo",
                    "id": "eyce7fo",
                    "parent_id": "t1_eyc9w4g",
                    "score": 2,
                    "created_utc": 1567000572.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Apparently the employees have been complaining about his behavior since 2015. All their complaints were dismissed.",
            "author": "brownandsweet",
            "id": "eyc8cro",
            "parent_id": "t1_eyc7760",
            "score": 9,
            "created_utc": 1566998123.0,
            "replies": [
                {
                    "body": "Yes, this happens a lot.  It’s why you go out and find a female lawyer on a mission and bust his balls.   I’d love to share more stories on issues like this but really can’t without divulging too much personal info.",
                    "author": "FlexEconGuy",
                    "id": "eycbl1b",
                    "parent_id": "t1_eyc8cro",
                    "score": -1,
                    "created_utc": 1566999506.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The article does say that the statement by the BR is vague and does not mention specifics of how they will achieve there new goals.",
            "author": "downtime37",
            "id": "eye15qq",
            "parent_id": "t1_eydx0sf",
            "score": 1,
            "created_utc": 1567027401.0,
            "replies": []
        },
        {
            "body": "I've worked for plenty of corporations also, and now I own my own business.  The problem with corporations is not that they are controlled by people it is that all that matters is the almighty bottom line. Anything and everything that can be done to squeeze out a few cents more of revue is done.",
            "author": "downtime37",
            "id": "eyew22w",
            "parent_id": "t1_eyeitgl",
            "score": 1,
            "created_utc": 1567039822.0,
            "replies": []
        },
        {
            "body": ">I guess my point is that by the numbers, there is no correlation between women being raped by a date and women using their real phone numbers.\n\nI think the accusation of rape is based upon him forcing her to have sex with him through blackmail.  He was accused of threatening to tell her family, employer, landlord that she was having sex for money if she didn't continue to have sex with him for free.   He was only able to do that because he knew all of her personal information.",
            "author": "willfromvb",
            "id": "eycbydq",
            "parent_id": "t1_eyc8gkz",
            "score": 4,
            "created_utc": 1566999655.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eyccig1",
                    "parent_id": "t1_eycbydq",
                    "score": 2,
                    "created_utc": 1566999905.0,
                    "replies": [
                        {
                            "body": "Good point.  I believe most places would consider forcing someone to have sex through blackmail is both blackmail and rape. Forcing doesn't have to be physical and can be coercion.",
                            "author": "willfromvb",
                            "id": "eycd2mn",
                            "parent_id": "t1_eyccig1",
                            "score": 2,
                            "created_utc": 1567000148.0,
                            "replies": []
                        },
                        {
                            "body": "*The police allege that Fabrizio and the woman had consensual sex once on Aug. 19, after which he paid her $400. After that, she did not want to see him again. According to the affidavit, Fabrizio sent numerous texts insisting on a second meeting, and threatening to expose her if she did not comply.*\n\n*“I know where you live,” he allegedly wrote. “I know where you work. Don’t think — Hospital would be happy to know that it’s young nurses are having sexual for money / Same for your landlord.”*\n\n\\- [Variety.com](https://Variety.com)\n\nFrom what I've read, it looks like better OpSec could have helped her.   This is not victim shaming and people need to quit using that argument.   If we can't learn how people got into trouble, we can't help prevent other people from getting into that same trouble.   Saying she could have done things differently is not saying it was her fault.    That is political correctness gone mad.\n\nThe victim was extremely courageous to go to the police.  Many women would not have gone to the police out of fear of exposing their Sugar lifestyle.  I'm sure Fabrizio was betting on that.",
                            "author": "willfromvb",
                            "id": "eyd6v48",
                            "parent_id": "t1_eyccig1",
                            "score": 2,
                            "created_utc": 1567012374.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eyd9vwr",
                                    "parent_id": "t1_eyd6v48",
                                    "score": -3,
                                    "created_utc": 1567014338.0,
                                    "replies": [
                                        {
                                            "body": "If he didn't know her identify, she would not have met him a second time and would not have been raped.\n\nI'm not trying to start an argument.  I'm trying to emphasize the importance of OpSec and protecting your identity with anyone you don't know well and met thru Sugar dating.",
                                            "author": "willfromvb",
                                            "id": "eydaqmb",
                                            "parent_id": "t1_eyd9vwr",
                                            "score": 3,
                                            "created_utc": 1567014891.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "eydb6xc",
                                                    "parent_id": "t1_eydaqmb",
                                                    "score": -1,
                                                    "created_utc": 1567015183.0,
                                                    "replies": [
                                                        {
                                                            "body": "I disagree.",
                                                            "author": "willfromvb",
                                                            "id": "eydbhhg",
                                                            "parent_id": "t1_eydb6xc",
                                                            "score": 3,
                                                            "created_utc": 1567015374.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I guess my point is that by the numbers, there is no correlation between women being raped by a date and women using their real phone numbers. \n\nOf course not, no one suggested otherwise?\n\n>“yes she would have been raped but at least he wouldn’t know her moms name” as some sort of reason for women to use fake phone numbers is...bizarre?\n\nComplete strawman. If that's what you read from my comment then I'd suggest reading again. Its wider than just the particulars of this story. The crux is that not looking after your personal information before you get to know someone, both for SB's and SD's, can lead to dangerous and scary blackmail scenarios and saying 'There's nothing you can do, it can happen anyway' is wrong and could prevent another newbie from learning from this scenario. \n\n>You’ll notice she went to the police any way, which would indicate she didn’t really care if this complete lunatic called her mom.\n\nNo, it indicated that she knew he had the dangerous combination of being crazy and also having enough information to ruin her life and that her mother knowing was the least of her worries at this point.\n\n>All that said I agree about not bringing someone home if you don’t trust them. I just don’t necessarily think it will prevent this situation. It would have changed the location and the nature of the threats.\n\nOf course it could have prevented *elements of* the situation! If he didn't have that information, there would have been no way to contact or trace her after the first horrible meet. That's not to blame her at all but to encourage other newbies to take heed.",
            "author": "yourgirlfriday99",
            "id": "eyca13x",
            "parent_id": "t1_eyc8gkz",
            "score": 0,
            "created_utc": 1566998854.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eycbmco",
                    "parent_id": "t1_eyca13x",
                    "score": 3,
                    "created_utc": 1566999520.0,
                    "replies": [
                        {
                            "body": ">It’s “take practical measures to be safe but don’t let your perceived anonymity lull you into a false sense of safety because this or a variation of it could happen to any woman who decided to sleep with a guy.”\n\nWho argued against this? This is obvious. You literally dismissed his safety suggestions (that are also often mentioned on SLF anyway) as pointless because the guy would have done it anyway. \n\nBut regardless, I hope that other newbies reading this can take something from this thanks to her courage in going to the police and highlighting the dangers. If even one person can avoid the horror of being blackmailed with a few simple measures, then that's a positive in my eyes.",
                            "author": "yourgirlfriday99",
                            "id": "eyccll0",
                            "parent_id": "t1_eycbmco",
                            "score": 2,
                            "created_utc": 1566999939.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eycd3tn",
                                    "parent_id": "t1_eyccll0",
                                    "score": 0,
                                    "created_utc": 1567000165.0,
                                    "replies": [
                                        {
                                            "body": ">Let’s agree to disagree on the effectiveness of a burner phone as a “safety measure” when one is confronted with a sexually violent predator. \n\nAgain, misrepresenting what I'm saying and in the most beautifully passive aggressive way :) It should be clear to you by now that what the other poster and I are referring to when we talk about opsec is the blackmail, not the rape. \n\nBut yes, let's agree to disagree.",
                                            "author": "yourgirlfriday99",
                                            "id": "eycdw9z",
                                            "parent_id": "t1_eycd3tn",
                                            "score": 2,
                                            "created_utc": 1567000477.0,
                                            "replies": [
                                                {
                                                    "body": ">what the other poster and I are referring to when we talk about opsec is the blackmail, not the rape\n\nand using a fake number/burner phone that she knew he couldn't trace might have given her the slightly larger peace of mind to ignore any BS threat he came up with to force the 2nd visit\n\nI had a SB threaten blackmail once and because I had used a Google Voice number from a burner phone I was certain enough she had nothing on me, so I just ignored the threat and she went away",
                                                    "author": "joc13",
                                                    "id": "eyi4zjh",
                                                    "parent_id": "t1_eycdw9z",
                                                    "score": 1,
                                                    "created_utc": 1567097666.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "When money and sex are involved, unfortunately it brings in a lot more unsavory elements on both sides of the bowl. Society unfortunately still sees sugar dating as a form of prostitution. Whenever activities are done against “Society morals”, it brings up more chances for blackmail and extortion on both sides. Predators are prevalent on both sides of the bowls and I don’t consider them as true SB or SDs, so you are just twisting my words here.",
            "author": "supportiveceo",
            "id": "eyce7fo",
            "parent_id": "t1_eyc9w4g",
            "score": 2,
            "created_utc": 1567000572.0,
            "replies": []
        },
        {
            "body": "Yes, this happens a lot.  It’s why you go out and find a female lawyer on a mission and bust his balls.   I’d love to share more stories on issues like this but really can’t without divulging too much personal info.",
            "author": "FlexEconGuy",
            "id": "eycbl1b",
            "parent_id": "t1_eyc8cro",
            "score": -1,
            "created_utc": 1566999506.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eyccig1",
            "parent_id": "t1_eycbydq",
            "score": 2,
            "created_utc": 1566999905.0,
            "replies": [
                {
                    "body": "Good point.  I believe most places would consider forcing someone to have sex through blackmail is both blackmail and rape. Forcing doesn't have to be physical and can be coercion.",
                    "author": "willfromvb",
                    "id": "eycd2mn",
                    "parent_id": "t1_eyccig1",
                    "score": 2,
                    "created_utc": 1567000148.0,
                    "replies": []
                },
                {
                    "body": "*The police allege that Fabrizio and the woman had consensual sex once on Aug. 19, after which he paid her $400. After that, she did not want to see him again. According to the affidavit, Fabrizio sent numerous texts insisting on a second meeting, and threatening to expose her if she did not comply.*\n\n*“I know where you live,” he allegedly wrote. “I know where you work. Don’t think — Hospital would be happy to know that it’s young nurses are having sexual for money / Same for your landlord.”*\n\n\\- [Variety.com](https://Variety.com)\n\nFrom what I've read, it looks like better OpSec could have helped her.   This is not victim shaming and people need to quit using that argument.   If we can't learn how people got into trouble, we can't help prevent other people from getting into that same trouble.   Saying she could have done things differently is not saying it was her fault.    That is political correctness gone mad.\n\nThe victim was extremely courageous to go to the police.  Many women would not have gone to the police out of fear of exposing their Sugar lifestyle.  I'm sure Fabrizio was betting on that.",
                    "author": "willfromvb",
                    "id": "eyd6v48",
                    "parent_id": "t1_eyccig1",
                    "score": 2,
                    "created_utc": 1567012374.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eyd9vwr",
                            "parent_id": "t1_eyd6v48",
                            "score": -3,
                            "created_utc": 1567014338.0,
                            "replies": [
                                {
                                    "body": "If he didn't know her identify, she would not have met him a second time and would not have been raped.\n\nI'm not trying to start an argument.  I'm trying to emphasize the importance of OpSec and protecting your identity with anyone you don't know well and met thru Sugar dating.",
                                    "author": "willfromvb",
                                    "id": "eydaqmb",
                                    "parent_id": "t1_eyd9vwr",
                                    "score": 3,
                                    "created_utc": 1567014891.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "eydb6xc",
                                            "parent_id": "t1_eydaqmb",
                                            "score": -1,
                                            "created_utc": 1567015183.0,
                                            "replies": [
                                                {
                                                    "body": "I disagree.",
                                                    "author": "willfromvb",
                                                    "id": "eydbhhg",
                                                    "parent_id": "t1_eydb6xc",
                                                    "score": 3,
                                                    "created_utc": 1567015374.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eycbmco",
            "parent_id": "t1_eyca13x",
            "score": 3,
            "created_utc": 1566999520.0,
            "replies": [
                {
                    "body": ">It’s “take practical measures to be safe but don’t let your perceived anonymity lull you into a false sense of safety because this or a variation of it could happen to any woman who decided to sleep with a guy.”\n\nWho argued against this? This is obvious. You literally dismissed his safety suggestions (that are also often mentioned on SLF anyway) as pointless because the guy would have done it anyway. \n\nBut regardless, I hope that other newbies reading this can take something from this thanks to her courage in going to the police and highlighting the dangers. If even one person can avoid the horror of being blackmailed with a few simple measures, then that's a positive in my eyes.",
                    "author": "yourgirlfriday99",
                    "id": "eyccll0",
                    "parent_id": "t1_eycbmco",
                    "score": 2,
                    "created_utc": 1566999939.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eycd3tn",
                            "parent_id": "t1_eyccll0",
                            "score": 0,
                            "created_utc": 1567000165.0,
                            "replies": [
                                {
                                    "body": ">Let’s agree to disagree on the effectiveness of a burner phone as a “safety measure” when one is confronted with a sexually violent predator. \n\nAgain, misrepresenting what I'm saying and in the most beautifully passive aggressive way :) It should be clear to you by now that what the other poster and I are referring to when we talk about opsec is the blackmail, not the rape. \n\nBut yes, let's agree to disagree.",
                                    "author": "yourgirlfriday99",
                                    "id": "eycdw9z",
                                    "parent_id": "t1_eycd3tn",
                                    "score": 2,
                                    "created_utc": 1567000477.0,
                                    "replies": [
                                        {
                                            "body": ">what the other poster and I are referring to when we talk about opsec is the blackmail, not the rape\n\nand using a fake number/burner phone that she knew he couldn't trace might have given her the slightly larger peace of mind to ignore any BS threat he came up with to force the 2nd visit\n\nI had a SB threaten blackmail once and because I had used a Google Voice number from a burner phone I was certain enough she had nothing on me, so I just ignored the threat and she went away",
                                            "author": "joc13",
                                            "id": "eyi4zjh",
                                            "parent_id": "t1_eycdw9z",
                                            "score": 1,
                                            "created_utc": 1567097666.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good point.  I believe most places would consider forcing someone to have sex through blackmail is both blackmail and rape. Forcing doesn't have to be physical and can be coercion.",
            "author": "willfromvb",
            "id": "eycd2mn",
            "parent_id": "t1_eyccig1",
            "score": 2,
            "created_utc": 1567000148.0,
            "replies": []
        },
        {
            "body": "*The police allege that Fabrizio and the woman had consensual sex once on Aug. 19, after which he paid her $400. After that, she did not want to see him again. According to the affidavit, Fabrizio sent numerous texts insisting on a second meeting, and threatening to expose her if she did not comply.*\n\n*“I know where you live,” he allegedly wrote. “I know where you work. Don’t think — Hospital would be happy to know that it’s young nurses are having sexual for money / Same for your landlord.”*\n\n\\- [Variety.com](https://Variety.com)\n\nFrom what I've read, it looks like better OpSec could have helped her.   This is not victim shaming and people need to quit using that argument.   If we can't learn how people got into trouble, we can't help prevent other people from getting into that same trouble.   Saying she could have done things differently is not saying it was her fault.    That is political correctness gone mad.\n\nThe victim was extremely courageous to go to the police.  Many women would not have gone to the police out of fear of exposing their Sugar lifestyle.  I'm sure Fabrizio was betting on that.",
            "author": "willfromvb",
            "id": "eyd6v48",
            "parent_id": "t1_eyccig1",
            "score": 2,
            "created_utc": 1567012374.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eyd9vwr",
                    "parent_id": "t1_eyd6v48",
                    "score": -3,
                    "created_utc": 1567014338.0,
                    "replies": [
                        {
                            "body": "If he didn't know her identify, she would not have met him a second time and would not have been raped.\n\nI'm not trying to start an argument.  I'm trying to emphasize the importance of OpSec and protecting your identity with anyone you don't know well and met thru Sugar dating.",
                            "author": "willfromvb",
                            "id": "eydaqmb",
                            "parent_id": "t1_eyd9vwr",
                            "score": 3,
                            "created_utc": 1567014891.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eydb6xc",
                                    "parent_id": "t1_eydaqmb",
                                    "score": -1,
                                    "created_utc": 1567015183.0,
                                    "replies": [
                                        {
                                            "body": "I disagree.",
                                            "author": "willfromvb",
                                            "id": "eydbhhg",
                                            "parent_id": "t1_eydb6xc",
                                            "score": 3,
                                            "created_utc": 1567015374.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">It’s “take practical measures to be safe but don’t let your perceived anonymity lull you into a false sense of safety because this or a variation of it could happen to any woman who decided to sleep with a guy.”\n\nWho argued against this? This is obvious. You literally dismissed his safety suggestions (that are also often mentioned on SLF anyway) as pointless because the guy would have done it anyway. \n\nBut regardless, I hope that other newbies reading this can take something from this thanks to her courage in going to the police and highlighting the dangers. If even one person can avoid the horror of being blackmailed with a few simple measures, then that's a positive in my eyes.",
            "author": "yourgirlfriday99",
            "id": "eyccll0",
            "parent_id": "t1_eycbmco",
            "score": 2,
            "created_utc": 1566999939.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eycd3tn",
                    "parent_id": "t1_eyccll0",
                    "score": 0,
                    "created_utc": 1567000165.0,
                    "replies": [
                        {
                            "body": ">Let’s agree to disagree on the effectiveness of a burner phone as a “safety measure” when one is confronted with a sexually violent predator. \n\nAgain, misrepresenting what I'm saying and in the most beautifully passive aggressive way :) It should be clear to you by now that what the other poster and I are referring to when we talk about opsec is the blackmail, not the rape. \n\nBut yes, let's agree to disagree.",
                            "author": "yourgirlfriday99",
                            "id": "eycdw9z",
                            "parent_id": "t1_eycd3tn",
                            "score": 2,
                            "created_utc": 1567000477.0,
                            "replies": [
                                {
                                    "body": ">what the other poster and I are referring to when we talk about opsec is the blackmail, not the rape\n\nand using a fake number/burner phone that she knew he couldn't trace might have given her the slightly larger peace of mind to ignore any BS threat he came up with to force the 2nd visit\n\nI had a SB threaten blackmail once and because I had used a Google Voice number from a burner phone I was certain enough she had nothing on me, so I just ignored the threat and she went away",
                                    "author": "joc13",
                                    "id": "eyi4zjh",
                                    "parent_id": "t1_eycdw9z",
                                    "score": 1,
                                    "created_utc": 1567097666.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eyd9vwr",
            "parent_id": "t1_eyd6v48",
            "score": -3,
            "created_utc": 1567014338.0,
            "replies": [
                {
                    "body": "If he didn't know her identify, she would not have met him a second time and would not have been raped.\n\nI'm not trying to start an argument.  I'm trying to emphasize the importance of OpSec and protecting your identity with anyone you don't know well and met thru Sugar dating.",
                    "author": "willfromvb",
                    "id": "eydaqmb",
                    "parent_id": "t1_eyd9vwr",
                    "score": 3,
                    "created_utc": 1567014891.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eydb6xc",
                            "parent_id": "t1_eydaqmb",
                            "score": -1,
                            "created_utc": 1567015183.0,
                            "replies": [
                                {
                                    "body": "I disagree.",
                                    "author": "willfromvb",
                                    "id": "eydbhhg",
                                    "parent_id": "t1_eydb6xc",
                                    "score": 3,
                                    "created_utc": 1567015374.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eycd3tn",
            "parent_id": "t1_eyccll0",
            "score": 0,
            "created_utc": 1567000165.0,
            "replies": [
                {
                    "body": ">Let’s agree to disagree on the effectiveness of a burner phone as a “safety measure” when one is confronted with a sexually violent predator. \n\nAgain, misrepresenting what I'm saying and in the most beautifully passive aggressive way :) It should be clear to you by now that what the other poster and I are referring to when we talk about opsec is the blackmail, not the rape. \n\nBut yes, let's agree to disagree.",
                    "author": "yourgirlfriday99",
                    "id": "eycdw9z",
                    "parent_id": "t1_eycd3tn",
                    "score": 2,
                    "created_utc": 1567000477.0,
                    "replies": [
                        {
                            "body": ">what the other poster and I are referring to when we talk about opsec is the blackmail, not the rape\n\nand using a fake number/burner phone that she knew he couldn't trace might have given her the slightly larger peace of mind to ignore any BS threat he came up with to force the 2nd visit\n\nI had a SB threaten blackmail once and because I had used a Google Voice number from a burner phone I was certain enough she had nothing on me, so I just ignored the threat and she went away",
                            "author": "joc13",
                            "id": "eyi4zjh",
                            "parent_id": "t1_eycdw9z",
                            "score": 1,
                            "created_utc": 1567097666.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If he didn't know her identify, she would not have met him a second time and would not have been raped.\n\nI'm not trying to start an argument.  I'm trying to emphasize the importance of OpSec and protecting your identity with anyone you don't know well and met thru Sugar dating.",
            "author": "willfromvb",
            "id": "eydaqmb",
            "parent_id": "t1_eyd9vwr",
            "score": 3,
            "created_utc": 1567014891.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eydb6xc",
                    "parent_id": "t1_eydaqmb",
                    "score": -1,
                    "created_utc": 1567015183.0,
                    "replies": [
                        {
                            "body": "I disagree.",
                            "author": "willfromvb",
                            "id": "eydbhhg",
                            "parent_id": "t1_eydb6xc",
                            "score": 3,
                            "created_utc": 1567015374.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Let’s agree to disagree on the effectiveness of a burner phone as a “safety measure” when one is confronted with a sexually violent predator. \n\nAgain, misrepresenting what I'm saying and in the most beautifully passive aggressive way :) It should be clear to you by now that what the other poster and I are referring to when we talk about opsec is the blackmail, not the rape. \n\nBut yes, let's agree to disagree.",
            "author": "yourgirlfriday99",
            "id": "eycdw9z",
            "parent_id": "t1_eycd3tn",
            "score": 2,
            "created_utc": 1567000477.0,
            "replies": [
                {
                    "body": ">what the other poster and I are referring to when we talk about opsec is the blackmail, not the rape\n\nand using a fake number/burner phone that she knew he couldn't trace might have given her the slightly larger peace of mind to ignore any BS threat he came up with to force the 2nd visit\n\nI had a SB threaten blackmail once and because I had used a Google Voice number from a burner phone I was certain enough she had nothing on me, so I just ignored the threat and she went away",
                    "author": "joc13",
                    "id": "eyi4zjh",
                    "parent_id": "t1_eycdw9z",
                    "score": 1,
                    "created_utc": 1567097666.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eydb6xc",
            "parent_id": "t1_eydaqmb",
            "score": -1,
            "created_utc": 1567015183.0,
            "replies": [
                {
                    "body": "I disagree.",
                    "author": "willfromvb",
                    "id": "eydbhhg",
                    "parent_id": "t1_eydb6xc",
                    "score": 3,
                    "created_utc": 1567015374.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">what the other poster and I are referring to when we talk about opsec is the blackmail, not the rape\n\nand using a fake number/burner phone that she knew he couldn't trace might have given her the slightly larger peace of mind to ignore any BS threat he came up with to force the 2nd visit\n\nI had a SB threaten blackmail once and because I had used a Google Voice number from a burner phone I was certain enough she had nothing on me, so I just ignored the threat and she went away",
            "author": "joc13",
            "id": "eyi4zjh",
            "parent_id": "t1_eycdw9z",
            "score": 1,
            "created_utc": 1567097666.0,
            "replies": []
        },
        {
            "body": "I disagree.",
            "author": "willfromvb",
            "id": "eydbhhg",
            "parent_id": "t1_eydb6xc",
            "score": 3,
            "created_utc": 1567015374.0,
            "replies": []
        }
    ]
}