{
    "title": "Naruto should be Thankful",
    "post_id": "oprupo",
    "post_url": "https://www.reddit.com/r/dankruto/comments/oprupo/naruto_should_be_thankful/",
    "author": "jonandreyuaosuni",
    "body": "",
    "url": "https://i.redd.it/380yas0u7vc71.jpg",
    "score": 3900,
    "upvote_ratio": 0.99,
    "created_utc": 1627003709.0,
    "num_comments": 109,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Sexy Jutsu? Lol\n\nAnd I guess summoning too.",
            "author": "Synosei",
            "id": "h6755fp",
            "parent_id": "t3_oprupo",
            "score": 343,
            "created_utc": 1627004178.0,
            "replies": [
                {
                    "body": ">And I guess summoning too.\n\nGood point. Summoning justsu was so essential to Naruto and even more so with Hiruzen's generation and the Sannin. Pretty much boosts you to almost Kage level right away and gave them such a massive leg up on the competition at that time. Hiruzen (Enma) / Danzo (Baku) strongest of their generation and the following Sannin strongest of their generation.\n\nPretty sure the first user was actually the 2nd Mizukage idk how the hell Sarutobi figured it out he's the first Konoha user I know of to use it. I can just imagine an elite Jonin squad seeing Baku appear randomly in the forest during the war and Hiruzen's huge staff coming out of nowhere to crush them. Such a cool jutsu.",
                    "author": "1RonnieMund",
                    "id": "h67okan",
                    "parent_id": "t1_h6755fp",
                    "score": 165,
                    "created_utc": 1627014532.0,
                    "replies": [
                        {
                            "body": "While Summoning is a cool, strong technique, I wouldn’t say that it’s an automatic Kage-level technique. Naruto could barely summon Gamabunta while tapping into the Kyuubi’s chakra, and he was nowhere near Kage-level at the end of Part 1. Most other users, like Temari (weasel things) or Kakashi (dogs) get some supplemental use out of them, but they aren’t broken on their own. Plus, top-tier summons require a lot of chakra, a summoning contract, and the cooperation of the summons involved, which can all be rather tricky. Shinobi who are able to use summons at a high level are usually Jonin-level or higher just due to the experience and effort needed to get there. \n\nNot sure that the first summoner was the 2nd Mizukage either. Madara summoned the Kyuubi for his fight with Hashirama, which happened before the Second Mizukage came to power. Tobirama also invented the Edo Tensei, which summons the dead. If we restrict the criteria to animals only, we can see that there are three names before Jiraiya on the toad summoning contract scroll. As Jiraiya acquired the scroll from the toads himself in his youth, this implies that these three summoners lived some time before him, which might place them before the Second Mizukage’s time. \n\nSummoning is pretty cool though. Wish Konohamaru got more time to shine with the monkey summons, but it is what it is.",
                            "author": "greatstarguy",
                            "id": "h67vldx",
                            "parent_id": "t1_h67okan",
                            "score": 96,
                            "created_utc": 1627019315.0,
                            "replies": [
                                {
                                    "body": "Plus it’s not the biggest leap in logic to assume the people turned to stone at mount miyoboku might’ve been capable of summoning toads since we atleast know that reverse summoning is how they transport themselves there. I could be misremembering details there but I think that’s a somewhat fair assumption.\n\nNot sure how it works for the tailed beasts tho, Madara summons kurama which kurama notices but it was kindve unclear if what was genuinely stopping the summoning was naruto’s seal or kurama personal dislike of Madara. Chalk it up to a little bit of column a and a little of column b. Then again there is the matter of Obito summoning kurama, which i assumed implied that you just had to possess strong enough abilities to summon and control him but I can’t off the top of my head whether Obito summoned the 9 tails right out of Kushina or what. \n\nMy headcannon on this particular subject is that Madara first had to control the 9 tails with the sharingan and only then was he able to summon him while he was subdued. Fits better with the defined power of the tailed beasts but also makes sense with how we understand the later summoning via “partnership”. I don’t know how the 2nd mizu convinced a giant clam to partner with him but I’d be willing to believe he subdued it with his abilities rather than what we see with chief toad, katsuya, manda, etc.",
                                    "author": "skoomakang",
                                    "id": "h67xd8p",
                                    "parent_id": "t1_h67vldx",
                                    "score": 34,
                                    "created_utc": 1627020665.0,
                                    "replies": []
                                },
                                {
                                    "body": "Didn't he make the Rasenshuriken",
                                    "author": "SupremeBoss46",
                                    "id": "h683a0v",
                                    "parent_id": "t1_h67vldx",
                                    "score": 19,
                                    "created_utc": 1627025580.0,
                                    "replies": [
                                        {
                                            "body": "Naruto invented the Rasenshuriken, but that was well into Shippuden, and he had already mastered Sage Mode. That’s a different discussion entirely.",
                                            "author": "greatstarguy",
                                            "id": "h68h1fg",
                                            "parent_id": "t1_h683a0v",
                                            "score": -6,
                                            "created_utc": 1627037841.0,
                                            "replies": [
                                                {
                                                    "body": "I agree with the point you're making in this thread, but Naruto absolutely did not master Sage Mode before inventing Rasenshuriken. Kakuzu would have gotten washed much worse.",
                                                    "author": "DekuGOATED",
                                                    "id": "h68l3nr",
                                                    "parent_id": "t1_h68h1fg",
                                                    "score": 21,
                                                    "created_utc": 1627040806.0,
                                                    "replies": [
                                                        {
                                                            "body": "That’s fair, I remembered it incorrectly.",
                                                            "author": "greatstarguy",
                                                            "id": "h68np6v",
                                                            "parent_id": "t1_h68l3nr",
                                                            "score": 10,
                                                            "created_utc": 1627042504.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "By the time Naruto fought Kakazu the rasenshuriken wasn't complete, seeing as it wasn't thrown.",
                                                            "author": "Influence_East",
                                                            "id": "h697mqy",
                                                            "parent_id": "t1_h68l3nr",
                                                            "score": 2,
                                                            "created_utc": 1627052437.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You're forgetting that the Rasengan is an incomplete jutsu, but you wouldn't say that Minato did not invent it.",
                                                                    "author": "DekuGOATED",
                                                                    "id": "h69wy4b",
                                                                    "parent_id": "t1_h697mqy",
                                                                    "score": 2,
                                                                    "created_utc": 1627063289.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "???\n\nHow does that have anything to do with what I just said?",
                                                                            "author": "Influence_East",
                                                                            "id": "h6rpi7f",
                                                                            "parent_id": "t1_h69wy4b",
                                                                            "score": 1,
                                                                            "created_utc": 1627430038.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "It should be obvious. \n\nYou're saying that it wasn't complete, so Naruto didn't invent it yet. \n\nThe Rasengan wasn't complete. Would you say that Minato didn't invent it?",
                                                                                    "author": "DekuGOATED",
                                                                                    "id": "h6rvfnn",
                                                                                    "parent_id": "t1_h6rpi7f",
                                                                                    "score": 1,
                                                                                    "created_utc": 1627432965.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "All I said was the rasenshuriken wasn't complete. I never said anything about him not inventing it.",
                                                                                            "author": "Influence_East",
                                                                                            "id": "h6rzxgh",
                                                                                            "parent_id": "t1_h6rvfnn",
                                                                                            "score": 1,
                                                                                            "created_utc": 1627435194.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Gamanbunta = Jonin level \n\nSo Naruto is Jonin level \n\nHe didn't summoned Gamanbunta against Sasuke because of plot",
                                    "author": "BestGirlGabi",
                                    "id": "h69m3h2",
                                    "parent_id": "t1_h67vldx",
                                    "score": 6,
                                    "created_utc": 1627058643.0,
                                    "replies": [
                                        {
                                            "body": "That’s an interesting take. While Bunta and the other boss summons are strong, they don’t fit very neatly into the normal hierarchy of Genin-Chunin-Jonin-Kage that most shinobi fall into. \n\nGamabunta is very large and very strong, but he moves rather slowly, and lacks the finesse and versatility in his arsenal that we would expect of a Jonin. Naruto and Jiraiya make use of him to equalize fights against other large opponents (other summons / Tailed Beasts), but he struggles more against human-sized enemies that can evade, as seen during the fight with Pain. His skill set is oriented towards large-scale AOE attacks and Tailed Beast-sized enemies, and would be of less use otherwise. \n\nRegarding the Sasuke fight: summoning Gamabunta would have been a bad move on Naruto’s part. The structure of the valley means that Gamabunta will have little room to maneuver, and it’s uncertain if he has the speed to hit Sasuke with an attack. On the other hand, it consumes most of Naruto’s chakra, making it a risky gamble at best. \n\nIn another sense, Naruto’s refusal to go all out and use everything at his disposal could be likened to his refusal to go for the kill against Sasuke, which ended up costing him the fight anyway. On a more meta level, Naruto pulling out a giant toad against Sasuke makes the resulting fight difficult to draw, and robs it of all the parallels that made it an interesting fight to begin with.",
                                            "author": "greatstarguy",
                                            "id": "h6algvp",
                                            "parent_id": "t1_h69m3h2",
                                            "score": 1,
                                            "created_utc": 1627074267.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Wasn’t Minato a sage or am I wrong?",
                                    "author": "Bups34",
                                    "id": "h696qro",
                                    "parent_id": "t1_h67vldx",
                                    "score": 5,
                                    "created_utc": 1627052053.0,
                                    "replies": [
                                        {
                                            "body": "Minato could use sage mode he just wasn't great at it.  During the Guy vs Madara fight he says it takes him too long to infuse the chakra.  He probably would have mastered it if he lived longer though I think",
                                            "author": "goteamventure42",
                                            "id": "h69avdb",
                                            "parent_id": "t1_h696qro",
                                            "score": 7,
                                            "created_utc": 1627053852.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I wouldn’t be surprised if tobirama invented those too.  There probably forbidden as well.",
                    "author": "SMLjefe",
                    "id": "h69xfdg",
                    "parent_id": "t1_h6755fp",
                    "score": 3,
                    "created_utc": 1627063498.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Remember when Naruto spent all that time learning that frog spitting water and his wind combo jutsu, only to NEVER get used once",
            "author": null,
            "id": "h67o360",
            "parent_id": "t3_oprupo",
            "score": 175,
            "created_utc": 1627014231.0,
            "replies": [
                {
                    "body": "It did get used once to break that big crystal dome",
                    "author": null,
                    "id": "h67prmt",
                    "parent_id": "t1_h67o360",
                    "score": 88,
                    "created_utc": 1627015302.0,
                    "replies": []
                },
                {
                    "body": "It was about learning how use chakra in tandem with other beings. \nI assumes it was the same principle he used later to link to tailed beast chakra. And then pass on the tailed beast chakra to other shinobi/kunoichi in war.",
                    "author": null,
                    "id": "h681197",
                    "parent_id": "t1_h67o360",
                    "score": 61,
                    "created_utc": 1627023643.0,
                    "replies": []
                },
                {
                    "body": "If something happens in a filler, the main story isn't required to reference it and filler material isn't allowed to impact the main story either. So stuff that happens in filler just generally should be ignored lol",
                    "author": "Cow_Other",
                    "id": "h68t402",
                    "parent_id": "t1_h67o360",
                    "score": 18,
                    "created_utc": 1627045635.0,
                    "replies": []
                },
                {
                    "body": "Fillers tend to do that.",
                    "author": "gillesregis",
                    "id": "h6821ue",
                    "parent_id": "t1_h67o360",
                    "score": 28,
                    "created_utc": 1627024502.0,
                    "replies": []
                },
                {
                    "body": "It was to fight Sasuke which never happened because I think the plot went a different way from where it was originally intended",
                    "author": "Fancy_0wl",
                    "id": "h68qvsh",
                    "parent_id": "t1_h67o360",
                    "score": 10,
                    "created_utc": 1627044416.0,
                    "replies": []
                },
                {
                    "body": "He used rasen-shuriken against Kakazu didn’t he?",
                    "author": "Keksis_The_Betrayed",
                    "id": "h68pd2v",
                    "parent_id": "t1_h67o360",
                    "score": 3,
                    "created_utc": 1627043525.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You won't believe me guys....\n\nNaruto used Earth style:- Mud wall then fighting against boruto",
            "author": null,
            "id": "h681xa2",
            "parent_id": "t3_oprupo",
            "score": 56,
            "created_utc": 1627024396.0,
            "replies": [
                {
                    "body": "He also used it in the fight against Momoshiki",
                    "author": "Jonasonero",
                    "id": "h6864n8",
                    "parent_id": "t1_h681xa2",
                    "score": 30,
                    "created_utc": 1627028174.0,
                    "replies": []
                },
                {
                    "body": "wasn't he also wearing a scientific ninja tool",
                    "author": "Flappy-tit",
                    "id": "h6aircl",
                    "parent_id": "t1_h681xa2",
                    "score": 4,
                    "created_utc": 1627073031.0,
                    "replies": [
                        {
                            "body": "Still, he made those hand signs.",
                            "author": null,
                            "id": "h6b9nne",
                            "parent_id": "t1_h6aircl",
                            "score": 2,
                            "created_utc": 1627086390.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I love that naruto gets more skilled as he became the hokage. As good as the move set he had when he was fighting sasuke the last time, he only expanded his knowledge through the years till he finally took his place as hokage. I believe that as naruto grew, he learned different techniques to help him become a better hokage for his village in the end",
                    "author": "tokey-chan",
                    "id": "h6b6x8u",
                    "parent_id": "t1_h681xa2",
                    "score": 4,
                    "created_utc": 1627084911.0,
                    "replies": []
                },
                {
                    "body": "YouTube link please",
                    "author": "HappyGlue",
                    "id": "h6b4vsm",
                    "parent_id": "t1_h681xa2",
                    "score": 2,
                    "created_utc": 1627083833.0,
                    "replies": [
                        {
                            "body": "Here is the 30 second version that just focuses on that  \n\n\nhttps://www.youtube.com/watch?v=wZcKmCwEGwQ",
                            "author": null,
                            "id": "h6bcqfs",
                            "parent_id": "t1_h6b4vsm",
                            "score": 1,
                            "created_utc": 1627088036.0,
                            "replies": [
                                {
                                    "body": "Aw he didn't say the the jutsu name",
                                    "author": "HappyGlue",
                                    "id": "h6c4hgh",
                                    "parent_id": "t1_h6bcqfs",
                                    "score": 2,
                                    "created_utc": 1627104508.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I really love that everybody is so hyped by Naruto using one of the most basic jutsu's in the world simply because he has never used a hand sign before lol",
                    "author": "Slimxshadyx",
                    "id": "h6nevw7",
                    "parent_id": "t1_h681xa2",
                    "score": 1,
                    "created_utc": 1627345084.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "wtf is that caption",
            "author": "FREAKFJ",
            "id": "h681emb",
            "parent_id": "t3_oprupo",
            "score": 57,
            "created_utc": 1627023958.0,
            "replies": []
        },
        {
            "body": "Rasenshuriken?",
            "author": "hipiyush",
            "id": "h67nggv",
            "parent_id": "t3_oprupo",
            "score": 23,
            "created_utc": 1627013846.0,
            "replies": [
                {
                    "body": "Basically rasengun tho",
                    "author": null,
                    "id": "h67qyf0",
                    "parent_id": "t1_h67nggv",
                    "score": 29,
                    "created_utc": 1627016083.0,
                    "replies": [
                        {
                            "body": "> rasen**gun**",
                            "author": "Anonim97",
                            "id": "h67u82l",
                            "parent_id": "t1_h67qyf0",
                            "score": 21,
                            "created_utc": 1627018311.0,
                            "replies": [
                                {
                                    "body": "Naruto got a gat???",
                                    "author": "Tsundere_God",
                                    "id": "h686wsr",
                                    "parent_id": "t1_h67u82l",
                                    "score": 16,
                                    "created_utc": 1627028894.0,
                                    "replies": [
                                        {
                                            "body": "Naruto: “I’m out of chakra…” *loads desert eagle* “but not out of options…”",
                                            "author": "SeductivePillowcase",
                                            "id": "h68tnyz",
                                            "parent_id": "t1_h686wsr",
                                            "score": 24,
                                            "created_utc": 1627045928.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "When one of the pains can absorb jutsu:",
                                    "author": "Slimxshadyx",
                                    "id": "h6nez93",
                                    "parent_id": "t1_h67u82l",
                                    "score": 1,
                                    "created_utc": 1627345132.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It’s a rasengan variant, it wouldn’t exist without rasengan",
                    "author": "Professional-Rookie",
                    "id": "h6as65m",
                    "parent_id": "t1_h67nggv",
                    "score": 0,
                    "created_utc": 1627077420.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tailed beast bomb? Summoning jutsu?",
            "author": "infamusforever223",
            "id": "h67k098",
            "parent_id": "t3_oprupo",
            "score": 44,
            "created_utc": 1627011829.0,
            "replies": [
                {
                    "body": "Tailed beasts invented tailed beast bombs, Naruto was just the first human to be able to use the jutsu. Summoning has been around for a long time, at the very least we can track it back to Tobirama’s indefinite paperbomb attack which had paper bombs infused with a jutsu that  summoned more paper bombs ad infinitum.\n\nSexy jutsu? Absolutely. Rasenshuriken? For sure. Other than those tho I’d think you be hard pressed to find more, lmk if I forgot any lol",
                    "author": "skoomakang",
                    "id": "h67y1jk",
                    "parent_id": "t1_h67k098",
                    "score": 35,
                    "created_utc": 1627021189.0,
                    "replies": [
                        {
                            "body": "> Naruto was just the first human to be able to use the jutsu.\n\nKiller B: Am i a joke to you?",
                            "author": "Ammid",
                            "id": "h67zd07",
                            "parent_id": "t1_h67y1jk",
                            "score": 37,
                            "created_utc": 1627022247.0,
                            "replies": [
                                {
                                    "body": "I think he meant using the tail beast bomb while in human mode. Even the bendy guy from bees village believed it wasn’t possible.",
                                    "author": "YOURMOM37",
                                    "id": "h687iod",
                                    "parent_id": "t1_h67zd07",
                                    "score": 20,
                                    "created_utc": 1627029454.0,
                                    "replies": []
                                },
                                {
                                    "body": "Happy cake day",
                                    "author": "OPgang",
                                    "id": "h68mgim",
                                    "parent_id": "t1_h67zd07",
                                    "score": 0,
                                    "created_utc": 1627041708.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I thought we were just going by jutsu used, not jutsu created.",
                            "author": "infamusforever223",
                            "id": "h67y6wr",
                            "parent_id": "t1_h67y1jk",
                            "score": 7,
                            "created_utc": 1627021306.0,
                            "replies": [
                                {
                                    "body": "Oh yeah my b, thought you were implying that he had made those jutsu. If you think about it Naruto is kindve a bigger copycat ninja than kakashi lol",
                                    "author": "skoomakang",
                                    "id": "h67z0og",
                                    "parent_id": "t1_h67y6wr",
                                    "score": 6,
                                    "created_utc": 1627021971.0,
                                    "replies": [
                                        {
                                            "body": "Coping isn't the same as being taught though.",
                                            "author": "KappaKingKame",
                                            "id": "h68bdcd",
                                            "parent_id": "t1_h67z0og",
                                            "score": 3,
                                            "created_utc": 1627033000.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don't forget antagonist too, Reanimation was one of the key plot drivers in Shippuden den and now they are bringing in Flying Raijin in Boruto.",
            "author": null,
            "id": "h6816mx",
            "parent_id": "t3_oprupo",
            "score": 25,
            "created_utc": 1627023769.0,
            "replies": [
                {
                    "body": "I stopped watching Boruto at some point, but wtf, hiraijin? I thought that was some Minato/Tobirama exclusive.",
                    "author": "Rio_1111",
                    "id": "h686g4t",
                    "parent_id": "t1_h6816mx",
                    "score": 15,
                    "created_utc": 1627028465.0,
                    "replies": [
                        {
                            "body": "To be fair, there are actually a couple of other people who can use hiraishin. The fourth hokage’s guard can do it but only as a group",
                            "author": "isaaceyfish",
                            "id": "h687p3f",
                            "parent_id": "t1_h686g4t",
                            "score": 13,
                            "created_utc": 1627029621.0,
                            "replies": [
                                {
                                    "body": "Ok, fair enough...",
                                    "author": "Rio_1111",
                                    "id": "h68nr8o",
                                    "parent_id": "t1_h687p3f",
                                    "score": 2,
                                    "created_utc": 1627042539.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It’s not actually the same, it’s just one of the villains has just been shown to use a jutsu that functions the same",
                            "author": "mhmhleafs",
                            "id": "h68w3ml",
                            "parent_id": "t1_h686g4t",
                            "score": 3,
                            "created_utc": 1627047158.0,
                            "replies": []
                        },
                        {
                            "body": "I don't know what that guys talking about. Flying Raijin hasn't been used once in Boruto BUT there is a villain with a flying raijin-esque ability.",
                            "author": "Olof2K",
                            "id": "h692ja4",
                            "parent_id": "t1_h686g4t",
                            "score": 2,
                            "created_utc": 1627050191.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Man seriously this show",
                    "author": "offensive_hoon",
                    "id": "h69ypbi",
                    "parent_id": "t1_h6816mx",
                    "score": 1,
                    "created_utc": 1627064065.0,
                    "replies": []
                },
                {
                    "body": "No different to how Konohamaru randomly used kagebunshin and Rasengan against a Pain",
                    "author": "HappyGlue",
                    "id": "h6b5fil",
                    "parent_id": "t1_h6816mx",
                    "score": 1,
                    "created_utc": 1627084121.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tobirama smiles every time one of Naruto's clones punches an Uchiha.",
            "author": "BToney005",
            "id": "h682953",
            "parent_id": "t3_oprupo",
            "score": 15,
            "created_utc": 1627024676.0,
            "replies": []
        },
        {
            "body": "I'm pretty sure Hashirama used Talk no Jutsu on Madara.",
            "author": "arkhamknightdean",
            "id": "h686eb7",
            "parent_id": "t3_oprupo",
            "score": 13,
            "created_utc": 1627028418.0,
            "replies": [
                {
                    "body": "He's got a point",
                    "author": "Away_Collar_5540",
                    "id": "h6884ei",
                    "parent_id": "t1_h686eb7",
                    "score": 4,
                    "created_utc": 1627030016.0,
                    "replies": []
                },
                {
                    "body": "Didn't work then. Naruto is the one who pioneered his brand of super effective talk no justu, which Ironically, he learned from Iruka in the first chapter.",
                    "author": "Aweguy1998",
                    "id": "h68lxng",
                    "parent_id": "t1_h686eb7",
                    "score": 1,
                    "created_utc": 1627041361.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hokage naruto has over 1000 jutsu",
            "author": "dexanor",
            "id": "h67qvgt",
            "parent_id": "t3_oprupo",
            "score": 26,
            "created_utc": 1627016029.0,
            "replies": [
                {
                    "body": "same energy as kakashi copy ninja that can do 1000 jutsu",
                    "author": "sabyte",
                    "id": "h67x0u7",
                    "parent_id": "t1_h67qvgt",
                    "score": 26,
                    "created_utc": 1627020398.0,
                    "replies": []
                },
                {
                    "body": "Sure.\n\nHaving a full spell book does not stop DND Wizards from just spamming magic missile.",
                    "author": "Captain-matt",
                    "id": "h68u9g8",
                    "parent_id": "t1_h67qvgt",
                    "score": 8,
                    "created_utc": 1627046238.0,
                    "replies": [
                        {
                            "body": "Your not wrong but that dosent make me wrong either",
                            "author": "dexanor",
                            "id": "h69yuo0",
                            "parent_id": "t1_h68u9g8",
                            "score": 1,
                            "created_utc": 1627064132.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Heh ?? Really? Tell me the names",
                    "author": "offensive_hoon",
                    "id": "h69yjig",
                    "parent_id": "t1_h67qvgt",
                    "score": 1,
                    "created_utc": 1627063994.0,
                    "replies": [
                        {
                            "body": "Its cannon and also in boruto we see naruto use mud wall mans rlly wants me to recite the names of 1000 jutsu r u sick my g",
                            "author": "dexanor",
                            "id": "h69yq3e",
                            "parent_id": "t1_h69yjig",
                            "score": 6,
                            "created_utc": 1627064075.0,
                            "replies": [
                                {
                                    "body": "Lol no I've seen that mud wall jutsu. But as a hokage does he literally know 1000 jutsus ?? Is it said in boruto or somewhere I'm curious. Please tell me",
                                    "author": "offensive_hoon",
                                    "id": "h69zgaf",
                                    "parent_id": "t1_h69yq3e",
                                    "score": 1,
                                    "created_utc": 1627064398.0,
                                    "replies": [
                                        {
                                            "body": "I believe it is stated in Boruto, but can’t remember when.",
                                            "author": "LiveLoveKanye",
                                            "id": "h6a6vg0",
                                            "parent_id": "t1_h69zgaf",
                                            "score": 1,
                                            "created_utc": 1627067700.0,
                                            "replies": [
                                                {
                                                    "body": "Well i believe too it must've been said somewhere but ik we won't be seeing that coz the writer is a idiot who don't care about the ogs",
                                                    "author": "offensive_hoon",
                                                    "id": "h6af3au",
                                                    "parent_id": "t1_h6a6vg0",
                                                    "score": 3,
                                                    "created_utc": 1627071374.0,
                                                    "replies": [
                                                        {
                                                            "body": "I remember that too I think",
                                                            "author": "PM_M3_YOUR_TITS_GIRL",
                                                            "id": "h6anx15",
                                                            "parent_id": "t1_h6af3au",
                                                            "score": 1,
                                                            "created_utc": 1627075411.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "English hard",
            "author": "Ehrenvoller",
            "id": "h68d6wt",
            "parent_id": "t3_oprupo",
            "score": 16,
            "created_utc": 1627034607.0,
            "replies": [
                {
                    "body": "Rules of learning American English \n\n* 1: Fuck you.\n* 2: If it sounds right or ppl get what you mean, you're correct (irregardless is in the dictionary now)\n* 3: Fuck you, England (American English spelling was changed to piss off the British\n* 4: Sounding cool is more important than being correct.",
                    "author": "DisneyPrincessDVorah",
                    "id": "h68tcv0",
                    "parent_id": "t1_h68d6wt",
                    "score": 14,
                    "created_utc": 1627045766.0,
                    "replies": [
                        {
                            "body": "This is very factual.",
                            "author": "NarutoDragon732",
                            "id": "h693w52",
                            "parent_id": "t1_h68tcv0",
                            "score": 3,
                            "created_utc": 1627050802.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Remember the Bruce lee quote. He said he wasn’t afraid of the man who learnt ten thousand different types of kicks but he was afraid of the guy who practiced the same kick a ten thousand times.",
            "author": "psych_vader",
            "id": "h683bz6",
            "parent_id": "t3_oprupo",
            "score": 10,
            "created_utc": 1627025628.0,
            "replies": []
        },
        {
            "body": "LMAO I had a minor stroke reading this",
            "author": "1of1000",
            "id": "h68860t",
            "parent_id": "t3_oprupo",
            "score": 17,
            "created_utc": 1627030060.0,
            "replies": [
                {
                    "body": "Same.",
                    "author": "MrRappist",
                    "id": "h68mmny",
                    "parent_id": "t1_h68860t",
                    "score": 4,
                    "created_utc": 1627041820.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Harem no Jutsu\n, Reverse Harem no Jutsu, Talk no Jutsu",
            "author": "hipiyush",
            "id": "h67xsbp",
            "parent_id": "t3_oprupo",
            "score": 3,
            "created_utc": 1627020992.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h69pp9r",
            "parent_id": "t3_oprupo",
            "score": 3,
            "created_utc": 1627060162.0,
            "replies": [
                {
                    "body": "Yep. Lmao some dude said he could use now 1000 jutsus in boruto 🗿",
                    "author": "offensive_hoon",
                    "id": "h69z4sc",
                    "parent_id": "t1_h69pp9r",
                    "score": 1,
                    "created_utc": 1627064258.0,
                    "replies": []
                },
                {
                    "body": "thats just not narutos fighting style, he literally survived through og  series and shippuden by spamming 2 jutsus, i dont know why u mad about naruto fighting like how he used to be  in boruto.",
                    "author": "66red99",
                    "id": "h6i51ym",
                    "parent_id": "t1_h69pp9r",
                    "score": 1,
                    "created_utc": 1627240418.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Everybody here forgetting the OG Naruto jutsu: Talk no Jutsu.",
            "author": "greatstarguy",
            "id": "h67vnnf",
            "parent_id": "t3_oprupo",
            "score": 7,
            "created_utc": 1627019361.0,
            "replies": []
        },
        {
            "body": "thinking about how Kishimoto backed himself on a corner where he was required to draw multiple narutos in one panel coz of shadow clone jutsu lol that is true Pain",
            "author": "p0ppysmic08",
            "id": "h684ogv",
            "parent_id": "t3_oprupo",
            "score": 2,
            "created_utc": 1627026846.0,
            "replies": []
        },
        {
            "body": "Hey hey hey… he created the Rasen-shuriken himself.\n\nThe completely distinct, wholly original, absolutely not derivative Rasen-shuriken.",
            "author": "Beercorn1",
            "id": "h68lafc",
            "parent_id": "t3_oprupo",
            "score": 2,
            "created_utc": 1627040931.0,
            "replies": []
        },
        {
            "body": "\"You've already thank\" \n\nOh, I have?",
            "author": "Jiv302",
            "id": "h68nup3",
            "parent_id": "t3_oprupo",
            "score": 2,
            "created_utc": 1627042598.0,
            "replies": []
        },
        {
            "body": ">Is able to use all chakra natures, tailed beast chakra, and six paths chakra.\n\nWELP, better pull out the ol' completely counterable shadow clones.",
            "author": "lemonylol",
            "id": "h69gbsj",
            "parent_id": "t3_oprupo",
            "score": 2,
            "created_utc": 1627056178.0,
            "replies": []
        },
        {
            "body": "Jiraiya is the one who came up with the Rasengan. He then taught it to his student Minato. Minato never came up or taught it to naruto, because he was busy getting the finger from Kurama.",
            "author": "MrRappist",
            "id": "h68msz9",
            "parent_id": "t3_oprupo",
            "score": -1,
            "created_utc": 1627041934.0,
            "replies": [
                {
                    "body": "Nah, Minato was the one that created the Rasengan by obserbing the Bijuudama. I thought this was basic Naruto knowledge.",
                    "author": "Olof2K",
                    "id": "h6934n9",
                    "parent_id": "t1_h68msz9",
                    "score": 2,
                    "created_utc": 1627050461.0,
                    "replies": [
                        {
                            "body": "Actually, looks like neither of them created the rasengan. It's Ashura, he's the one that first created it and used it in his fights if you watch the fillers.\n\nLooks like we both don't know basic naruto knowledge lmao",
                            "author": "MrRappist",
                            "id": "h69cfju",
                            "parent_id": "t1_h6934n9",
                            "score": -4,
                            "created_utc": 1627054522.0,
                            "replies": [
                                {
                                    "body": "Fillers aren't canon lmao. Therefor we have to go by what's been stated in-canon, and that being Minato created the rasengan.",
                                    "author": "Olof2K",
                                    "id": "h69p5zf",
                                    "parent_id": "t1_h69cfju",
                                    "score": 1,
                                    "created_utc": 1627059935.0,
                                    "replies": [
                                        {
                                            "body": "Ah yes. Looks like the stuff like Madara vs Hashirama and other stuff that happened in fillers ain't canon, mmm...yes..",
                                            "author": "MrRappist",
                                            "id": "h69v07n",
                                            "parent_id": "t1_h69p5zf",
                                            "score": -1,
                                            "created_utc": 1627062442.0,
                                            "replies": [
                                                {
                                                    "body": "If it isn't adapted from the manga, then it's not canon, this is common knowledge. Are you a first time anime-only? Madara VS Hashirama fight was lifted straight from the manga, so why are you saying it's filler?",
                                                    "author": "Olof2K",
                                                    "id": "h6a6f9b",
                                                    "parent_id": "t1_h69v07n",
                                                    "score": 1,
                                                    "created_utc": 1627067499.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Jiraiya states that Minato created the rasengun when he first teaches Naruto",
                    "author": null,
                    "id": "h696qer",
                    "parent_id": "t1_h68msz9",
                    "score": 2,
                    "created_utc": 1627052048.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Naruto 5k barage",
            "author": "electrocyberend",
            "id": "h68dg71",
            "parent_id": "t3_oprupo",
            "score": 1,
            "created_utc": 1627034830.0,
            "replies": []
        },
        {
            "body": "Sometimes the fundamentals is all you need",
            "author": "SenpaiBoogie",
            "id": "h68iwqe",
            "parent_id": "t3_oprupo",
            "score": 1,
            "created_utc": 1627039248.0,
            "replies": [
                {
                    "body": "At least he picked OP jutsu.",
                    "author": "goteamventure42",
                    "id": "h69b6fb",
                    "parent_id": "t1_h68iwqe",
                    "score": 2,
                    "created_utc": 1627053984.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Substitution jutsu",
            "author": "cahanse79",
            "id": "h68ncab",
            "parent_id": "t3_oprupo",
            "score": 1,
            "created_utc": 1627042276.0,
            "replies": []
        },
        {
            "body": "English has left the chat",
            "author": "ToxicDirewolf",
            "id": "h68zlrf",
            "parent_id": "t3_oprupo",
            "score": 1,
            "created_utc": 1627048850.0,
            "replies": []
        },
        {
            "body": "That's not true, what about uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh",
            "author": "JakeNubbin",
            "id": "h694c5w",
            "parent_id": "t3_oprupo",
            "score": 1,
            "created_utc": 1627050997.0,
            "replies": []
        },
        {
            "body": "The english in this sub just gets worse every time",
            "author": "SleepyATT",
            "id": "h69b0nx",
            "parent_id": "t3_oprupo",
            "score": 1,
            "created_utc": 1627053915.0,
            "replies": []
        },
        {
            "body": "You’ve",
            "author": "shoeboxchild",
            "id": "h69cz5n",
            "parent_id": "t3_oprupo",
            "score": 1,
            "created_utc": 1627054755.0,
            "replies": []
        },
        {
            "body": "Sexy jutsu, summoning, transformation, rasen shuriken, every tailed beast version, talk no jutsu, sage mode. Hmph lmao and of course uzumaki barrage! And I think honorable mentions go to his uppercuts (Neji and endgame Sasuke)",
            "author": "CelticDK",
            "id": "h69hzx9",
            "parent_id": "t3_oprupo",
            "score": 1,
            "created_utc": 1627056895.0,
            "replies": []
        },
        {
            "body": "should i thank minato or ashura ??",
            "author": "tlb7781",
            "id": "h69iymv",
            "parent_id": "t3_oprupo",
            "score": 1,
            "created_utc": 1627057306.0,
            "replies": [
                {
                    "body": "Skip fillers",
                    "author": "offensive_hoon",
                    "id": "h69z19f",
                    "parent_id": "t1_h69iymv",
                    "score": 1,
                    "created_utc": 1627064215.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They are also the only justsus that require an extremely large amount of chakra to produce, and with tobirama being a senju while being nerfed by reanimation could only make 2 shadow clones, Naruto made 2,000 before graduating the academy,,,Minato and Kakashi were not able to change the nature transformation of the rasengan but he did at 15 years old,,,,,annnd on top of those two he mastered sage mode on top of all of that,,,,and don't forget he did all of those things without Kurama,,,,they made stepping stones",
            "author": "SilverWolfSF",
            "id": "h69wf0b",
            "parent_id": "t3_oprupo",
            "score": 1,
            "created_utc": 1627063059.0,
            "replies": []
        },
        {
            "body": "Not entire life but the most consistently.",
            "author": "Blueford69420",
            "id": "h69x5mo",
            "parent_id": "t3_oprupo",
            "score": 1,
            "created_utc": 1627063381.0,
            "replies": []
        },
        {
            "body": "The writer of Naruto gave him just 3 jutsus like he is just a side character like kiba dude is an uzumaki but don't know a single sealing jutsus don't know about his father teleportation jutsu. Created the most powerful wind style jutsus but don't any other wind style jutsus. Also he could've used a sword or weapon with his wind chakra like sasuke do with his lightning release.",
            "author": "offensive_hoon",
            "id": "h69xzph",
            "parent_id": "t3_oprupo",
            "score": 1,
            "created_utc": 1627063749.0,
            "replies": []
        },
        {
            "body": "Don’t forget talk no jutsu",
            "author": "gaBluiscast",
            "id": "h6eyk6d",
            "parent_id": "t3_oprupo",
            "score": 1,
            "created_utc": 1627167429.0,
            "replies": []
        },
        {
            "body": "I thought Sarutobi created Shadow Clones Technique. Also why that Damn Tobirama made it Forbidden, won't it help fight Uchihas.",
            "author": "Usual_Ad_6771",
            "id": "h6gf5rw",
            "parent_id": "t3_oprupo",
            "score": 1,
            "created_utc": 1627202374.0,
            "replies": []
        },
        {
            "body": ">And I guess summoning too.\n\nGood point. Summoning justsu was so essential to Naruto and even more so with Hiruzen's generation and the Sannin. Pretty much boosts you to almost Kage level right away and gave them such a massive leg up on the competition at that time. Hiruzen (Enma) / Danzo (Baku) strongest of their generation and the following Sannin strongest of their generation.\n\nPretty sure the first user was actually the 2nd Mizukage idk how the hell Sarutobi figured it out he's the first Konoha user I know of to use it. I can just imagine an elite Jonin squad seeing Baku appear randomly in the forest during the war and Hiruzen's huge staff coming out of nowhere to crush them. Such a cool jutsu.",
            "author": "1RonnieMund",
            "id": "h67okan",
            "parent_id": "t1_h6755fp",
            "score": 165,
            "created_utc": 1627014532.0,
            "replies": [
                {
                    "body": "While Summoning is a cool, strong technique, I wouldn’t say that it’s an automatic Kage-level technique. Naruto could barely summon Gamabunta while tapping into the Kyuubi’s chakra, and he was nowhere near Kage-level at the end of Part 1. Most other users, like Temari (weasel things) or Kakashi (dogs) get some supplemental use out of them, but they aren’t broken on their own. Plus, top-tier summons require a lot of chakra, a summoning contract, and the cooperation of the summons involved, which can all be rather tricky. Shinobi who are able to use summons at a high level are usually Jonin-level or higher just due to the experience and effort needed to get there. \n\nNot sure that the first summoner was the 2nd Mizukage either. Madara summoned the Kyuubi for his fight with Hashirama, which happened before the Second Mizukage came to power. Tobirama also invented the Edo Tensei, which summons the dead. If we restrict the criteria to animals only, we can see that there are three names before Jiraiya on the toad summoning contract scroll. As Jiraiya acquired the scroll from the toads himself in his youth, this implies that these three summoners lived some time before him, which might place them before the Second Mizukage’s time. \n\nSummoning is pretty cool though. Wish Konohamaru got more time to shine with the monkey summons, but it is what it is.",
                    "author": "greatstarguy",
                    "id": "h67vldx",
                    "parent_id": "t1_h67okan",
                    "score": 96,
                    "created_utc": 1627019315.0,
                    "replies": [
                        {
                            "body": "Plus it’s not the biggest leap in logic to assume the people turned to stone at mount miyoboku might’ve been capable of summoning toads since we atleast know that reverse summoning is how they transport themselves there. I could be misremembering details there but I think that’s a somewhat fair assumption.\n\nNot sure how it works for the tailed beasts tho, Madara summons kurama which kurama notices but it was kindve unclear if what was genuinely stopping the summoning was naruto’s seal or kurama personal dislike of Madara. Chalk it up to a little bit of column a and a little of column b. Then again there is the matter of Obito summoning kurama, which i assumed implied that you just had to possess strong enough abilities to summon and control him but I can’t off the top of my head whether Obito summoned the 9 tails right out of Kushina or what. \n\nMy headcannon on this particular subject is that Madara first had to control the 9 tails with the sharingan and only then was he able to summon him while he was subdued. Fits better with the defined power of the tailed beasts but also makes sense with how we understand the later summoning via “partnership”. I don’t know how the 2nd mizu convinced a giant clam to partner with him but I’d be willing to believe he subdued it with his abilities rather than what we see with chief toad, katsuya, manda, etc.",
                            "author": "skoomakang",
                            "id": "h67xd8p",
                            "parent_id": "t1_h67vldx",
                            "score": 34,
                            "created_utc": 1627020665.0,
                            "replies": []
                        },
                        {
                            "body": "Didn't he make the Rasenshuriken",
                            "author": "SupremeBoss46",
                            "id": "h683a0v",
                            "parent_id": "t1_h67vldx",
                            "score": 19,
                            "created_utc": 1627025580.0,
                            "replies": [
                                {
                                    "body": "Naruto invented the Rasenshuriken, but that was well into Shippuden, and he had already mastered Sage Mode. That’s a different discussion entirely.",
                                    "author": "greatstarguy",
                                    "id": "h68h1fg",
                                    "parent_id": "t1_h683a0v",
                                    "score": -6,
                                    "created_utc": 1627037841.0,
                                    "replies": [
                                        {
                                            "body": "I agree with the point you're making in this thread, but Naruto absolutely did not master Sage Mode before inventing Rasenshuriken. Kakuzu would have gotten washed much worse.",
                                            "author": "DekuGOATED",
                                            "id": "h68l3nr",
                                            "parent_id": "t1_h68h1fg",
                                            "score": 21,
                                            "created_utc": 1627040806.0,
                                            "replies": [
                                                {
                                                    "body": "That’s fair, I remembered it incorrectly.",
                                                    "author": "greatstarguy",
                                                    "id": "h68np6v",
                                                    "parent_id": "t1_h68l3nr",
                                                    "score": 10,
                                                    "created_utc": 1627042504.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "By the time Naruto fought Kakazu the rasenshuriken wasn't complete, seeing as it wasn't thrown.",
                                                    "author": "Influence_East",
                                                    "id": "h697mqy",
                                                    "parent_id": "t1_h68l3nr",
                                                    "score": 2,
                                                    "created_utc": 1627052437.0,
                                                    "replies": [
                                                        {
                                                            "body": "You're forgetting that the Rasengan is an incomplete jutsu, but you wouldn't say that Minato did not invent it.",
                                                            "author": "DekuGOATED",
                                                            "id": "h69wy4b",
                                                            "parent_id": "t1_h697mqy",
                                                            "score": 2,
                                                            "created_utc": 1627063289.0,
                                                            "replies": [
                                                                {
                                                                    "body": "???\n\nHow does that have anything to do with what I just said?",
                                                                    "author": "Influence_East",
                                                                    "id": "h6rpi7f",
                                                                    "parent_id": "t1_h69wy4b",
                                                                    "score": 1,
                                                                    "created_utc": 1627430038.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "It should be obvious. \n\nYou're saying that it wasn't complete, so Naruto didn't invent it yet. \n\nThe Rasengan wasn't complete. Would you say that Minato didn't invent it?",
                                                                            "author": "DekuGOATED",
                                                                            "id": "h6rvfnn",
                                                                            "parent_id": "t1_h6rpi7f",
                                                                            "score": 1,
                                                                            "created_utc": 1627432965.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "All I said was the rasenshuriken wasn't complete. I never said anything about him not inventing it.",
                                                                                    "author": "Influence_East",
                                                                                    "id": "h6rzxgh",
                                                                                    "parent_id": "t1_h6rvfnn",
                                                                                    "score": 1,
                                                                                    "created_utc": 1627435194.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Gamanbunta = Jonin level \n\nSo Naruto is Jonin level \n\nHe didn't summoned Gamanbunta against Sasuke because of plot",
                            "author": "BestGirlGabi",
                            "id": "h69m3h2",
                            "parent_id": "t1_h67vldx",
                            "score": 6,
                            "created_utc": 1627058643.0,
                            "replies": [
                                {
                                    "body": "That’s an interesting take. While Bunta and the other boss summons are strong, they don’t fit very neatly into the normal hierarchy of Genin-Chunin-Jonin-Kage that most shinobi fall into. \n\nGamabunta is very large and very strong, but he moves rather slowly, and lacks the finesse and versatility in his arsenal that we would expect of a Jonin. Naruto and Jiraiya make use of him to equalize fights against other large opponents (other summons / Tailed Beasts), but he struggles more against human-sized enemies that can evade, as seen during the fight with Pain. His skill set is oriented towards large-scale AOE attacks and Tailed Beast-sized enemies, and would be of less use otherwise. \n\nRegarding the Sasuke fight: summoning Gamabunta would have been a bad move on Naruto’s part. The structure of the valley means that Gamabunta will have little room to maneuver, and it’s uncertain if he has the speed to hit Sasuke with an attack. On the other hand, it consumes most of Naruto’s chakra, making it a risky gamble at best. \n\nIn another sense, Naruto’s refusal to go all out and use everything at his disposal could be likened to his refusal to go for the kill against Sasuke, which ended up costing him the fight anyway. On a more meta level, Naruto pulling out a giant toad against Sasuke makes the resulting fight difficult to draw, and robs it of all the parallels that made it an interesting fight to begin with.",
                                    "author": "greatstarguy",
                                    "id": "h6algvp",
                                    "parent_id": "t1_h69m3h2",
                                    "score": 1,
                                    "created_utc": 1627074267.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Wasn’t Minato a sage or am I wrong?",
                            "author": "Bups34",
                            "id": "h696qro",
                            "parent_id": "t1_h67vldx",
                            "score": 5,
                            "created_utc": 1627052053.0,
                            "replies": [
                                {
                                    "body": "Minato could use sage mode he just wasn't great at it.  During the Guy vs Madara fight he says it takes him too long to infuse the chakra.  He probably would have mastered it if he lived longer though I think",
                                    "author": "goteamventure42",
                                    "id": "h69avdb",
                                    "parent_id": "t1_h696qro",
                                    "score": 7,
                                    "created_utc": 1627053852.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wouldn’t be surprised if tobirama invented those too.  There probably forbidden as well.",
            "author": "SMLjefe",
            "id": "h69xfdg",
            "parent_id": "t1_h6755fp",
            "score": 3,
            "created_utc": 1627063498.0,
            "replies": []
        },
        {
            "body": "It did get used once to break that big crystal dome",
            "author": null,
            "id": "h67prmt",
            "parent_id": "t1_h67o360",
            "score": 88,
            "created_utc": 1627015302.0,
            "replies": []
        },
        {
            "body": "It was about learning how use chakra in tandem with other beings. \nI assumes it was the same principle he used later to link to tailed beast chakra. And then pass on the tailed beast chakra to other shinobi/kunoichi in war.",
            "author": null,
            "id": "h681197",
            "parent_id": "t1_h67o360",
            "score": 61,
            "created_utc": 1627023643.0,
            "replies": []
        },
        {
            "body": "If something happens in a filler, the main story isn't required to reference it and filler material isn't allowed to impact the main story either. So stuff that happens in filler just generally should be ignored lol",
            "author": "Cow_Other",
            "id": "h68t402",
            "parent_id": "t1_h67o360",
            "score": 18,
            "created_utc": 1627045635.0,
            "replies": []
        },
        {
            "body": "Fillers tend to do that.",
            "author": "gillesregis",
            "id": "h6821ue",
            "parent_id": "t1_h67o360",
            "score": 28,
            "created_utc": 1627024502.0,
            "replies": []
        },
        {
            "body": "It was to fight Sasuke which never happened because I think the plot went a different way from where it was originally intended",
            "author": "Fancy_0wl",
            "id": "h68qvsh",
            "parent_id": "t1_h67o360",
            "score": 10,
            "created_utc": 1627044416.0,
            "replies": []
        },
        {
            "body": "He used rasen-shuriken against Kakazu didn’t he?",
            "author": "Keksis_The_Betrayed",
            "id": "h68pd2v",
            "parent_id": "t1_h67o360",
            "score": 3,
            "created_utc": 1627043525.0,
            "replies": []
        },
        {
            "body": "He also used it in the fight against Momoshiki",
            "author": "Jonasonero",
            "id": "h6864n8",
            "parent_id": "t1_h681xa2",
            "score": 30,
            "created_utc": 1627028174.0,
            "replies": []
        },
        {
            "body": "wasn't he also wearing a scientific ninja tool",
            "author": "Flappy-tit",
            "id": "h6aircl",
            "parent_id": "t1_h681xa2",
            "score": 4,
            "created_utc": 1627073031.0,
            "replies": [
                {
                    "body": "Still, he made those hand signs.",
                    "author": null,
                    "id": "h6b9nne",
                    "parent_id": "t1_h6aircl",
                    "score": 2,
                    "created_utc": 1627086390.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love that naruto gets more skilled as he became the hokage. As good as the move set he had when he was fighting sasuke the last time, he only expanded his knowledge through the years till he finally took his place as hokage. I believe that as naruto grew, he learned different techniques to help him become a better hokage for his village in the end",
            "author": "tokey-chan",
            "id": "h6b6x8u",
            "parent_id": "t1_h681xa2",
            "score": 4,
            "created_utc": 1627084911.0,
            "replies": []
        },
        {
            "body": "YouTube link please",
            "author": "HappyGlue",
            "id": "h6b4vsm",
            "parent_id": "t1_h681xa2",
            "score": 2,
            "created_utc": 1627083833.0,
            "replies": [
                {
                    "body": "Here is the 30 second version that just focuses on that  \n\n\nhttps://www.youtube.com/watch?v=wZcKmCwEGwQ",
                    "author": null,
                    "id": "h6bcqfs",
                    "parent_id": "t1_h6b4vsm",
                    "score": 1,
                    "created_utc": 1627088036.0,
                    "replies": [
                        {
                            "body": "Aw he didn't say the the jutsu name",
                            "author": "HappyGlue",
                            "id": "h6c4hgh",
                            "parent_id": "t1_h6bcqfs",
                            "score": 2,
                            "created_utc": 1627104508.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I really love that everybody is so hyped by Naruto using one of the most basic jutsu's in the world simply because he has never used a hand sign before lol",
            "author": "Slimxshadyx",
            "id": "h6nevw7",
            "parent_id": "t1_h681xa2",
            "score": 1,
            "created_utc": 1627345084.0,
            "replies": []
        },
        {
            "body": "Basically rasengun tho",
            "author": null,
            "id": "h67qyf0",
            "parent_id": "t1_h67nggv",
            "score": 29,
            "created_utc": 1627016083.0,
            "replies": [
                {
                    "body": "> rasen**gun**",
                    "author": "Anonim97",
                    "id": "h67u82l",
                    "parent_id": "t1_h67qyf0",
                    "score": 21,
                    "created_utc": 1627018311.0,
                    "replies": [
                        {
                            "body": "Naruto got a gat???",
                            "author": "Tsundere_God",
                            "id": "h686wsr",
                            "parent_id": "t1_h67u82l",
                            "score": 16,
                            "created_utc": 1627028894.0,
                            "replies": [
                                {
                                    "body": "Naruto: “I’m out of chakra…” *loads desert eagle* “but not out of options…”",
                                    "author": "SeductivePillowcase",
                                    "id": "h68tnyz",
                                    "parent_id": "t1_h686wsr",
                                    "score": 24,
                                    "created_utc": 1627045928.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "When one of the pains can absorb jutsu:",
                            "author": "Slimxshadyx",
                            "id": "h6nez93",
                            "parent_id": "t1_h67u82l",
                            "score": 1,
                            "created_utc": 1627345132.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s a rasengan variant, it wouldn’t exist without rasengan",
            "author": "Professional-Rookie",
            "id": "h6as65m",
            "parent_id": "t1_h67nggv",
            "score": 0,
            "created_utc": 1627077420.0,
            "replies": []
        },
        {
            "body": "Tailed beasts invented tailed beast bombs, Naruto was just the first human to be able to use the jutsu. Summoning has been around for a long time, at the very least we can track it back to Tobirama’s indefinite paperbomb attack which had paper bombs infused with a jutsu that  summoned more paper bombs ad infinitum.\n\nSexy jutsu? Absolutely. Rasenshuriken? For sure. Other than those tho I’d think you be hard pressed to find more, lmk if I forgot any lol",
            "author": "skoomakang",
            "id": "h67y1jk",
            "parent_id": "t1_h67k098",
            "score": 35,
            "created_utc": 1627021189.0,
            "replies": [
                {
                    "body": "> Naruto was just the first human to be able to use the jutsu.\n\nKiller B: Am i a joke to you?",
                    "author": "Ammid",
                    "id": "h67zd07",
                    "parent_id": "t1_h67y1jk",
                    "score": 37,
                    "created_utc": 1627022247.0,
                    "replies": [
                        {
                            "body": "I think he meant using the tail beast bomb while in human mode. Even the bendy guy from bees village believed it wasn’t possible.",
                            "author": "YOURMOM37",
                            "id": "h687iod",
                            "parent_id": "t1_h67zd07",
                            "score": 20,
                            "created_utc": 1627029454.0,
                            "replies": []
                        },
                        {
                            "body": "Happy cake day",
                            "author": "OPgang",
                            "id": "h68mgim",
                            "parent_id": "t1_h67zd07",
                            "score": 0,
                            "created_utc": 1627041708.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I thought we were just going by jutsu used, not jutsu created.",
                    "author": "infamusforever223",
                    "id": "h67y6wr",
                    "parent_id": "t1_h67y1jk",
                    "score": 7,
                    "created_utc": 1627021306.0,
                    "replies": [
                        {
                            "body": "Oh yeah my b, thought you were implying that he had made those jutsu. If you think about it Naruto is kindve a bigger copycat ninja than kakashi lol",
                            "author": "skoomakang",
                            "id": "h67z0og",
                            "parent_id": "t1_h67y6wr",
                            "score": 6,
                            "created_utc": 1627021971.0,
                            "replies": [
                                {
                                    "body": "Coping isn't the same as being taught though.",
                                    "author": "KappaKingKame",
                                    "id": "h68bdcd",
                                    "parent_id": "t1_h67z0og",
                                    "score": 3,
                                    "created_utc": 1627033000.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I stopped watching Boruto at some point, but wtf, hiraijin? I thought that was some Minato/Tobirama exclusive.",
            "author": "Rio_1111",
            "id": "h686g4t",
            "parent_id": "t1_h6816mx",
            "score": 15,
            "created_utc": 1627028465.0,
            "replies": [
                {
                    "body": "To be fair, there are actually a couple of other people who can use hiraishin. The fourth hokage’s guard can do it but only as a group",
                    "author": "isaaceyfish",
                    "id": "h687p3f",
                    "parent_id": "t1_h686g4t",
                    "score": 13,
                    "created_utc": 1627029621.0,
                    "replies": [
                        {
                            "body": "Ok, fair enough...",
                            "author": "Rio_1111",
                            "id": "h68nr8o",
                            "parent_id": "t1_h687p3f",
                            "score": 2,
                            "created_utc": 1627042539.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It’s not actually the same, it’s just one of the villains has just been shown to use a jutsu that functions the same",
                    "author": "mhmhleafs",
                    "id": "h68w3ml",
                    "parent_id": "t1_h686g4t",
                    "score": 3,
                    "created_utc": 1627047158.0,
                    "replies": []
                },
                {
                    "body": "I don't know what that guys talking about. Flying Raijin hasn't been used once in Boruto BUT there is a villain with a flying raijin-esque ability.",
                    "author": "Olof2K",
                    "id": "h692ja4",
                    "parent_id": "t1_h686g4t",
                    "score": 2,
                    "created_utc": 1627050191.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Man seriously this show",
            "author": "offensive_hoon",
            "id": "h69ypbi",
            "parent_id": "t1_h6816mx",
            "score": 1,
            "created_utc": 1627064065.0,
            "replies": []
        },
        {
            "body": "No different to how Konohamaru randomly used kagebunshin and Rasengan against a Pain",
            "author": "HappyGlue",
            "id": "h6b5fil",
            "parent_id": "t1_h6816mx",
            "score": 1,
            "created_utc": 1627084121.0,
            "replies": []
        },
        {
            "body": "He's got a point",
            "author": "Away_Collar_5540",
            "id": "h6884ei",
            "parent_id": "t1_h686eb7",
            "score": 4,
            "created_utc": 1627030016.0,
            "replies": []
        },
        {
            "body": "Didn't work then. Naruto is the one who pioneered his brand of super effective talk no justu, which Ironically, he learned from Iruka in the first chapter.",
            "author": "Aweguy1998",
            "id": "h68lxng",
            "parent_id": "t1_h686eb7",
            "score": 1,
            "created_utc": 1627041361.0,
            "replies": []
        },
        {
            "body": "same energy as kakashi copy ninja that can do 1000 jutsu",
            "author": "sabyte",
            "id": "h67x0u7",
            "parent_id": "t1_h67qvgt",
            "score": 26,
            "created_utc": 1627020398.0,
            "replies": []
        },
        {
            "body": "Sure.\n\nHaving a full spell book does not stop DND Wizards from just spamming magic missile.",
            "author": "Captain-matt",
            "id": "h68u9g8",
            "parent_id": "t1_h67qvgt",
            "score": 8,
            "created_utc": 1627046238.0,
            "replies": [
                {
                    "body": "Your not wrong but that dosent make me wrong either",
                    "author": "dexanor",
                    "id": "h69yuo0",
                    "parent_id": "t1_h68u9g8",
                    "score": 1,
                    "created_utc": 1627064132.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Heh ?? Really? Tell me the names",
            "author": "offensive_hoon",
            "id": "h69yjig",
            "parent_id": "t1_h67qvgt",
            "score": 1,
            "created_utc": 1627063994.0,
            "replies": [
                {
                    "body": "Its cannon and also in boruto we see naruto use mud wall mans rlly wants me to recite the names of 1000 jutsu r u sick my g",
                    "author": "dexanor",
                    "id": "h69yq3e",
                    "parent_id": "t1_h69yjig",
                    "score": 6,
                    "created_utc": 1627064075.0,
                    "replies": [
                        {
                            "body": "Lol no I've seen that mud wall jutsu. But as a hokage does he literally know 1000 jutsus ?? Is it said in boruto or somewhere I'm curious. Please tell me",
                            "author": "offensive_hoon",
                            "id": "h69zgaf",
                            "parent_id": "t1_h69yq3e",
                            "score": 1,
                            "created_utc": 1627064398.0,
                            "replies": [
                                {
                                    "body": "I believe it is stated in Boruto, but can’t remember when.",
                                    "author": "LiveLoveKanye",
                                    "id": "h6a6vg0",
                                    "parent_id": "t1_h69zgaf",
                                    "score": 1,
                                    "created_utc": 1627067700.0,
                                    "replies": [
                                        {
                                            "body": "Well i believe too it must've been said somewhere but ik we won't be seeing that coz the writer is a idiot who don't care about the ogs",
                                            "author": "offensive_hoon",
                                            "id": "h6af3au",
                                            "parent_id": "t1_h6a6vg0",
                                            "score": 3,
                                            "created_utc": 1627071374.0,
                                            "replies": [
                                                {
                                                    "body": "I remember that too I think",
                                                    "author": "PM_M3_YOUR_TITS_GIRL",
                                                    "id": "h6anx15",
                                                    "parent_id": "t1_h6af3au",
                                                    "score": 1,
                                                    "created_utc": 1627075411.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Rules of learning American English \n\n* 1: Fuck you.\n* 2: If it sounds right or ppl get what you mean, you're correct (irregardless is in the dictionary now)\n* 3: Fuck you, England (American English spelling was changed to piss off the British\n* 4: Sounding cool is more important than being correct.",
            "author": "DisneyPrincessDVorah",
            "id": "h68tcv0",
            "parent_id": "t1_h68d6wt",
            "score": 14,
            "created_utc": 1627045766.0,
            "replies": [
                {
                    "body": "This is very factual.",
                    "author": "NarutoDragon732",
                    "id": "h693w52",
                    "parent_id": "t1_h68tcv0",
                    "score": 3,
                    "created_utc": 1627050802.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Same.",
            "author": "MrRappist",
            "id": "h68mmny",
            "parent_id": "t1_h68860t",
            "score": 4,
            "created_utc": 1627041820.0,
            "replies": []
        },
        {
            "body": "Yep. Lmao some dude said he could use now 1000 jutsus in boruto 🗿",
            "author": "offensive_hoon",
            "id": "h69z4sc",
            "parent_id": "t1_h69pp9r",
            "score": 1,
            "created_utc": 1627064258.0,
            "replies": []
        },
        {
            "body": "thats just not narutos fighting style, he literally survived through og  series and shippuden by spamming 2 jutsus, i dont know why u mad about naruto fighting like how he used to be  in boruto.",
            "author": "66red99",
            "id": "h6i51ym",
            "parent_id": "t1_h69pp9r",
            "score": 1,
            "created_utc": 1627240418.0,
            "replies": []
        },
        {
            "body": "Nah, Minato was the one that created the Rasengan by obserbing the Bijuudama. I thought this was basic Naruto knowledge.",
            "author": "Olof2K",
            "id": "h6934n9",
            "parent_id": "t1_h68msz9",
            "score": 2,
            "created_utc": 1627050461.0,
            "replies": [
                {
                    "body": "Actually, looks like neither of them created the rasengan. It's Ashura, he's the one that first created it and used it in his fights if you watch the fillers.\n\nLooks like we both don't know basic naruto knowledge lmao",
                    "author": "MrRappist",
                    "id": "h69cfju",
                    "parent_id": "t1_h6934n9",
                    "score": -4,
                    "created_utc": 1627054522.0,
                    "replies": [
                        {
                            "body": "Fillers aren't canon lmao. Therefor we have to go by what's been stated in-canon, and that being Minato created the rasengan.",
                            "author": "Olof2K",
                            "id": "h69p5zf",
                            "parent_id": "t1_h69cfju",
                            "score": 1,
                            "created_utc": 1627059935.0,
                            "replies": [
                                {
                                    "body": "Ah yes. Looks like the stuff like Madara vs Hashirama and other stuff that happened in fillers ain't canon, mmm...yes..",
                                    "author": "MrRappist",
                                    "id": "h69v07n",
                                    "parent_id": "t1_h69p5zf",
                                    "score": -1,
                                    "created_utc": 1627062442.0,
                                    "replies": [
                                        {
                                            "body": "If it isn't adapted from the manga, then it's not canon, this is common knowledge. Are you a first time anime-only? Madara VS Hashirama fight was lifted straight from the manga, so why are you saying it's filler?",
                                            "author": "Olof2K",
                                            "id": "h6a6f9b",
                                            "parent_id": "t1_h69v07n",
                                            "score": 1,
                                            "created_utc": 1627067499.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Jiraiya states that Minato created the rasengun when he first teaches Naruto",
            "author": null,
            "id": "h696qer",
            "parent_id": "t1_h68msz9",
            "score": 2,
            "created_utc": 1627052048.0,
            "replies": []
        },
        {
            "body": "At least he picked OP jutsu.",
            "author": "goteamventure42",
            "id": "h69b6fb",
            "parent_id": "t1_h68iwqe",
            "score": 2,
            "created_utc": 1627053984.0,
            "replies": []
        },
        {
            "body": "Skip fillers",
            "author": "offensive_hoon",
            "id": "h69z19f",
            "parent_id": "t1_h69iymv",
            "score": 1,
            "created_utc": 1627064215.0,
            "replies": []
        },
        {
            "body": "While Summoning is a cool, strong technique, I wouldn’t say that it’s an automatic Kage-level technique. Naruto could barely summon Gamabunta while tapping into the Kyuubi’s chakra, and he was nowhere near Kage-level at the end of Part 1. Most other users, like Temari (weasel things) or Kakashi (dogs) get some supplemental use out of them, but they aren’t broken on their own. Plus, top-tier summons require a lot of chakra, a summoning contract, and the cooperation of the summons involved, which can all be rather tricky. Shinobi who are able to use summons at a high level are usually Jonin-level or higher just due to the experience and effort needed to get there. \n\nNot sure that the first summoner was the 2nd Mizukage either. Madara summoned the Kyuubi for his fight with Hashirama, which happened before the Second Mizukage came to power. Tobirama also invented the Edo Tensei, which summons the dead. If we restrict the criteria to animals only, we can see that there are three names before Jiraiya on the toad summoning contract scroll. As Jiraiya acquired the scroll from the toads himself in his youth, this implies that these three summoners lived some time before him, which might place them before the Second Mizukage’s time. \n\nSummoning is pretty cool though. Wish Konohamaru got more time to shine with the monkey summons, but it is what it is.",
            "author": "greatstarguy",
            "id": "h67vldx",
            "parent_id": "t1_h67okan",
            "score": 96,
            "created_utc": 1627019315.0,
            "replies": [
                {
                    "body": "Plus it’s not the biggest leap in logic to assume the people turned to stone at mount miyoboku might’ve been capable of summoning toads since we atleast know that reverse summoning is how they transport themselves there. I could be misremembering details there but I think that’s a somewhat fair assumption.\n\nNot sure how it works for the tailed beasts tho, Madara summons kurama which kurama notices but it was kindve unclear if what was genuinely stopping the summoning was naruto’s seal or kurama personal dislike of Madara. Chalk it up to a little bit of column a and a little of column b. Then again there is the matter of Obito summoning kurama, which i assumed implied that you just had to possess strong enough abilities to summon and control him but I can’t off the top of my head whether Obito summoned the 9 tails right out of Kushina or what. \n\nMy headcannon on this particular subject is that Madara first had to control the 9 tails with the sharingan and only then was he able to summon him while he was subdued. Fits better with the defined power of the tailed beasts but also makes sense with how we understand the later summoning via “partnership”. I don’t know how the 2nd mizu convinced a giant clam to partner with him but I’d be willing to believe he subdued it with his abilities rather than what we see with chief toad, katsuya, manda, etc.",
                    "author": "skoomakang",
                    "id": "h67xd8p",
                    "parent_id": "t1_h67vldx",
                    "score": 34,
                    "created_utc": 1627020665.0,
                    "replies": []
                },
                {
                    "body": "Didn't he make the Rasenshuriken",
                    "author": "SupremeBoss46",
                    "id": "h683a0v",
                    "parent_id": "t1_h67vldx",
                    "score": 19,
                    "created_utc": 1627025580.0,
                    "replies": [
                        {
                            "body": "Naruto invented the Rasenshuriken, but that was well into Shippuden, and he had already mastered Sage Mode. That’s a different discussion entirely.",
                            "author": "greatstarguy",
                            "id": "h68h1fg",
                            "parent_id": "t1_h683a0v",
                            "score": -6,
                            "created_utc": 1627037841.0,
                            "replies": [
                                {
                                    "body": "I agree with the point you're making in this thread, but Naruto absolutely did not master Sage Mode before inventing Rasenshuriken. Kakuzu would have gotten washed much worse.",
                                    "author": "DekuGOATED",
                                    "id": "h68l3nr",
                                    "parent_id": "t1_h68h1fg",
                                    "score": 21,
                                    "created_utc": 1627040806.0,
                                    "replies": [
                                        {
                                            "body": "That’s fair, I remembered it incorrectly.",
                                            "author": "greatstarguy",
                                            "id": "h68np6v",
                                            "parent_id": "t1_h68l3nr",
                                            "score": 10,
                                            "created_utc": 1627042504.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "By the time Naruto fought Kakazu the rasenshuriken wasn't complete, seeing as it wasn't thrown.",
                                            "author": "Influence_East",
                                            "id": "h697mqy",
                                            "parent_id": "t1_h68l3nr",
                                            "score": 2,
                                            "created_utc": 1627052437.0,
                                            "replies": [
                                                {
                                                    "body": "You're forgetting that the Rasengan is an incomplete jutsu, but you wouldn't say that Minato did not invent it.",
                                                    "author": "DekuGOATED",
                                                    "id": "h69wy4b",
                                                    "parent_id": "t1_h697mqy",
                                                    "score": 2,
                                                    "created_utc": 1627063289.0,
                                                    "replies": [
                                                        {
                                                            "body": "???\n\nHow does that have anything to do with what I just said?",
                                                            "author": "Influence_East",
                                                            "id": "h6rpi7f",
                                                            "parent_id": "t1_h69wy4b",
                                                            "score": 1,
                                                            "created_utc": 1627430038.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It should be obvious. \n\nYou're saying that it wasn't complete, so Naruto didn't invent it yet. \n\nThe Rasengan wasn't complete. Would you say that Minato didn't invent it?",
                                                                    "author": "DekuGOATED",
                                                                    "id": "h6rvfnn",
                                                                    "parent_id": "t1_h6rpi7f",
                                                                    "score": 1,
                                                                    "created_utc": 1627432965.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "All I said was the rasenshuriken wasn't complete. I never said anything about him not inventing it.",
                                                                            "author": "Influence_East",
                                                                            "id": "h6rzxgh",
                                                                            "parent_id": "t1_h6rvfnn",
                                                                            "score": 1,
                                                                            "created_utc": 1627435194.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Gamanbunta = Jonin level \n\nSo Naruto is Jonin level \n\nHe didn't summoned Gamanbunta against Sasuke because of plot",
                    "author": "BestGirlGabi",
                    "id": "h69m3h2",
                    "parent_id": "t1_h67vldx",
                    "score": 6,
                    "created_utc": 1627058643.0,
                    "replies": [
                        {
                            "body": "That’s an interesting take. While Bunta and the other boss summons are strong, they don’t fit very neatly into the normal hierarchy of Genin-Chunin-Jonin-Kage that most shinobi fall into. \n\nGamabunta is very large and very strong, but he moves rather slowly, and lacks the finesse and versatility in his arsenal that we would expect of a Jonin. Naruto and Jiraiya make use of him to equalize fights against other large opponents (other summons / Tailed Beasts), but he struggles more against human-sized enemies that can evade, as seen during the fight with Pain. His skill set is oriented towards large-scale AOE attacks and Tailed Beast-sized enemies, and would be of less use otherwise. \n\nRegarding the Sasuke fight: summoning Gamabunta would have been a bad move on Naruto’s part. The structure of the valley means that Gamabunta will have little room to maneuver, and it’s uncertain if he has the speed to hit Sasuke with an attack. On the other hand, it consumes most of Naruto’s chakra, making it a risky gamble at best. \n\nIn another sense, Naruto’s refusal to go all out and use everything at his disposal could be likened to his refusal to go for the kill against Sasuke, which ended up costing him the fight anyway. On a more meta level, Naruto pulling out a giant toad against Sasuke makes the resulting fight difficult to draw, and robs it of all the parallels that made it an interesting fight to begin with.",
                            "author": "greatstarguy",
                            "id": "h6algvp",
                            "parent_id": "t1_h69m3h2",
                            "score": 1,
                            "created_utc": 1627074267.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Wasn’t Minato a sage or am I wrong?",
                    "author": "Bups34",
                    "id": "h696qro",
                    "parent_id": "t1_h67vldx",
                    "score": 5,
                    "created_utc": 1627052053.0,
                    "replies": [
                        {
                            "body": "Minato could use sage mode he just wasn't great at it.  During the Guy vs Madara fight he says it takes him too long to infuse the chakra.  He probably would have mastered it if he lived longer though I think",
                            "author": "goteamventure42",
                            "id": "h69avdb",
                            "parent_id": "t1_h696qro",
                            "score": 7,
                            "created_utc": 1627053852.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Still, he made those hand signs.",
            "author": null,
            "id": "h6b9nne",
            "parent_id": "t1_h6aircl",
            "score": 2,
            "created_utc": 1627086390.0,
            "replies": []
        },
        {
            "body": "Here is the 30 second version that just focuses on that  \n\n\nhttps://www.youtube.com/watch?v=wZcKmCwEGwQ",
            "author": null,
            "id": "h6bcqfs",
            "parent_id": "t1_h6b4vsm",
            "score": 1,
            "created_utc": 1627088036.0,
            "replies": [
                {
                    "body": "Aw he didn't say the the jutsu name",
                    "author": "HappyGlue",
                    "id": "h6c4hgh",
                    "parent_id": "t1_h6bcqfs",
                    "score": 2,
                    "created_utc": 1627104508.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> rasen**gun**",
            "author": "Anonim97",
            "id": "h67u82l",
            "parent_id": "t1_h67qyf0",
            "score": 21,
            "created_utc": 1627018311.0,
            "replies": [
                {
                    "body": "Naruto got a gat???",
                    "author": "Tsundere_God",
                    "id": "h686wsr",
                    "parent_id": "t1_h67u82l",
                    "score": 16,
                    "created_utc": 1627028894.0,
                    "replies": [
                        {
                            "body": "Naruto: “I’m out of chakra…” *loads desert eagle* “but not out of options…”",
                            "author": "SeductivePillowcase",
                            "id": "h68tnyz",
                            "parent_id": "t1_h686wsr",
                            "score": 24,
                            "created_utc": 1627045928.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "When one of the pains can absorb jutsu:",
                    "author": "Slimxshadyx",
                    "id": "h6nez93",
                    "parent_id": "t1_h67u82l",
                    "score": 1,
                    "created_utc": 1627345132.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Naruto was just the first human to be able to use the jutsu.\n\nKiller B: Am i a joke to you?",
            "author": "Ammid",
            "id": "h67zd07",
            "parent_id": "t1_h67y1jk",
            "score": 37,
            "created_utc": 1627022247.0,
            "replies": [
                {
                    "body": "I think he meant using the tail beast bomb while in human mode. Even the bendy guy from bees village believed it wasn’t possible.",
                    "author": "YOURMOM37",
                    "id": "h687iod",
                    "parent_id": "t1_h67zd07",
                    "score": 20,
                    "created_utc": 1627029454.0,
                    "replies": []
                },
                {
                    "body": "Happy cake day",
                    "author": "OPgang",
                    "id": "h68mgim",
                    "parent_id": "t1_h67zd07",
                    "score": 0,
                    "created_utc": 1627041708.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I thought we were just going by jutsu used, not jutsu created.",
            "author": "infamusforever223",
            "id": "h67y6wr",
            "parent_id": "t1_h67y1jk",
            "score": 7,
            "created_utc": 1627021306.0,
            "replies": [
                {
                    "body": "Oh yeah my b, thought you were implying that he had made those jutsu. If you think about it Naruto is kindve a bigger copycat ninja than kakashi lol",
                    "author": "skoomakang",
                    "id": "h67z0og",
                    "parent_id": "t1_h67y6wr",
                    "score": 6,
                    "created_utc": 1627021971.0,
                    "replies": [
                        {
                            "body": "Coping isn't the same as being taught though.",
                            "author": "KappaKingKame",
                            "id": "h68bdcd",
                            "parent_id": "t1_h67z0og",
                            "score": 3,
                            "created_utc": 1627033000.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "To be fair, there are actually a couple of other people who can use hiraishin. The fourth hokage’s guard can do it but only as a group",
            "author": "isaaceyfish",
            "id": "h687p3f",
            "parent_id": "t1_h686g4t",
            "score": 13,
            "created_utc": 1627029621.0,
            "replies": [
                {
                    "body": "Ok, fair enough...",
                    "author": "Rio_1111",
                    "id": "h68nr8o",
                    "parent_id": "t1_h687p3f",
                    "score": 2,
                    "created_utc": 1627042539.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s not actually the same, it’s just one of the villains has just been shown to use a jutsu that functions the same",
            "author": "mhmhleafs",
            "id": "h68w3ml",
            "parent_id": "t1_h686g4t",
            "score": 3,
            "created_utc": 1627047158.0,
            "replies": []
        },
        {
            "body": "I don't know what that guys talking about. Flying Raijin hasn't been used once in Boruto BUT there is a villain with a flying raijin-esque ability.",
            "author": "Olof2K",
            "id": "h692ja4",
            "parent_id": "t1_h686g4t",
            "score": 2,
            "created_utc": 1627050191.0,
            "replies": []
        },
        {
            "body": "Your not wrong but that dosent make me wrong either",
            "author": "dexanor",
            "id": "h69yuo0",
            "parent_id": "t1_h68u9g8",
            "score": 1,
            "created_utc": 1627064132.0,
            "replies": []
        },
        {
            "body": "Its cannon and also in boruto we see naruto use mud wall mans rlly wants me to recite the names of 1000 jutsu r u sick my g",
            "author": "dexanor",
            "id": "h69yq3e",
            "parent_id": "t1_h69yjig",
            "score": 6,
            "created_utc": 1627064075.0,
            "replies": [
                {
                    "body": "Lol no I've seen that mud wall jutsu. But as a hokage does he literally know 1000 jutsus ?? Is it said in boruto or somewhere I'm curious. Please tell me",
                    "author": "offensive_hoon",
                    "id": "h69zgaf",
                    "parent_id": "t1_h69yq3e",
                    "score": 1,
                    "created_utc": 1627064398.0,
                    "replies": [
                        {
                            "body": "I believe it is stated in Boruto, but can’t remember when.",
                            "author": "LiveLoveKanye",
                            "id": "h6a6vg0",
                            "parent_id": "t1_h69zgaf",
                            "score": 1,
                            "created_utc": 1627067700.0,
                            "replies": [
                                {
                                    "body": "Well i believe too it must've been said somewhere but ik we won't be seeing that coz the writer is a idiot who don't care about the ogs",
                                    "author": "offensive_hoon",
                                    "id": "h6af3au",
                                    "parent_id": "t1_h6a6vg0",
                                    "score": 3,
                                    "created_utc": 1627071374.0,
                                    "replies": [
                                        {
                                            "body": "I remember that too I think",
                                            "author": "PM_M3_YOUR_TITS_GIRL",
                                            "id": "h6anx15",
                                            "parent_id": "t1_h6af3au",
                                            "score": 1,
                                            "created_utc": 1627075411.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is very factual.",
            "author": "NarutoDragon732",
            "id": "h693w52",
            "parent_id": "t1_h68tcv0",
            "score": 3,
            "created_utc": 1627050802.0,
            "replies": []
        },
        {
            "body": "Actually, looks like neither of them created the rasengan. It's Ashura, he's the one that first created it and used it in his fights if you watch the fillers.\n\nLooks like we both don't know basic naruto knowledge lmao",
            "author": "MrRappist",
            "id": "h69cfju",
            "parent_id": "t1_h6934n9",
            "score": -4,
            "created_utc": 1627054522.0,
            "replies": [
                {
                    "body": "Fillers aren't canon lmao. Therefor we have to go by what's been stated in-canon, and that being Minato created the rasengan.",
                    "author": "Olof2K",
                    "id": "h69p5zf",
                    "parent_id": "t1_h69cfju",
                    "score": 1,
                    "created_utc": 1627059935.0,
                    "replies": [
                        {
                            "body": "Ah yes. Looks like the stuff like Madara vs Hashirama and other stuff that happened in fillers ain't canon, mmm...yes..",
                            "author": "MrRappist",
                            "id": "h69v07n",
                            "parent_id": "t1_h69p5zf",
                            "score": -1,
                            "created_utc": 1627062442.0,
                            "replies": [
                                {
                                    "body": "If it isn't adapted from the manga, then it's not canon, this is common knowledge. Are you a first time anime-only? Madara VS Hashirama fight was lifted straight from the manga, so why are you saying it's filler?",
                                    "author": "Olof2K",
                                    "id": "h6a6f9b",
                                    "parent_id": "t1_h69v07n",
                                    "score": 1,
                                    "created_utc": 1627067499.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Plus it’s not the biggest leap in logic to assume the people turned to stone at mount miyoboku might’ve been capable of summoning toads since we atleast know that reverse summoning is how they transport themselves there. I could be misremembering details there but I think that’s a somewhat fair assumption.\n\nNot sure how it works for the tailed beasts tho, Madara summons kurama which kurama notices but it was kindve unclear if what was genuinely stopping the summoning was naruto’s seal or kurama personal dislike of Madara. Chalk it up to a little bit of column a and a little of column b. Then again there is the matter of Obito summoning kurama, which i assumed implied that you just had to possess strong enough abilities to summon and control him but I can’t off the top of my head whether Obito summoned the 9 tails right out of Kushina or what. \n\nMy headcannon on this particular subject is that Madara first had to control the 9 tails with the sharingan and only then was he able to summon him while he was subdued. Fits better with the defined power of the tailed beasts but also makes sense with how we understand the later summoning via “partnership”. I don’t know how the 2nd mizu convinced a giant clam to partner with him but I’d be willing to believe he subdued it with his abilities rather than what we see with chief toad, katsuya, manda, etc.",
            "author": "skoomakang",
            "id": "h67xd8p",
            "parent_id": "t1_h67vldx",
            "score": 34,
            "created_utc": 1627020665.0,
            "replies": []
        },
        {
            "body": "Didn't he make the Rasenshuriken",
            "author": "SupremeBoss46",
            "id": "h683a0v",
            "parent_id": "t1_h67vldx",
            "score": 19,
            "created_utc": 1627025580.0,
            "replies": [
                {
                    "body": "Naruto invented the Rasenshuriken, but that was well into Shippuden, and he had already mastered Sage Mode. That’s a different discussion entirely.",
                    "author": "greatstarguy",
                    "id": "h68h1fg",
                    "parent_id": "t1_h683a0v",
                    "score": -6,
                    "created_utc": 1627037841.0,
                    "replies": [
                        {
                            "body": "I agree with the point you're making in this thread, but Naruto absolutely did not master Sage Mode before inventing Rasenshuriken. Kakuzu would have gotten washed much worse.",
                            "author": "DekuGOATED",
                            "id": "h68l3nr",
                            "parent_id": "t1_h68h1fg",
                            "score": 21,
                            "created_utc": 1627040806.0,
                            "replies": [
                                {
                                    "body": "That’s fair, I remembered it incorrectly.",
                                    "author": "greatstarguy",
                                    "id": "h68np6v",
                                    "parent_id": "t1_h68l3nr",
                                    "score": 10,
                                    "created_utc": 1627042504.0,
                                    "replies": []
                                },
                                {
                                    "body": "By the time Naruto fought Kakazu the rasenshuriken wasn't complete, seeing as it wasn't thrown.",
                                    "author": "Influence_East",
                                    "id": "h697mqy",
                                    "parent_id": "t1_h68l3nr",
                                    "score": 2,
                                    "created_utc": 1627052437.0,
                                    "replies": [
                                        {
                                            "body": "You're forgetting that the Rasengan is an incomplete jutsu, but you wouldn't say that Minato did not invent it.",
                                            "author": "DekuGOATED",
                                            "id": "h69wy4b",
                                            "parent_id": "t1_h697mqy",
                                            "score": 2,
                                            "created_utc": 1627063289.0,
                                            "replies": [
                                                {
                                                    "body": "???\n\nHow does that have anything to do with what I just said?",
                                                    "author": "Influence_East",
                                                    "id": "h6rpi7f",
                                                    "parent_id": "t1_h69wy4b",
                                                    "score": 1,
                                                    "created_utc": 1627430038.0,
                                                    "replies": [
                                                        {
                                                            "body": "It should be obvious. \n\nYou're saying that it wasn't complete, so Naruto didn't invent it yet. \n\nThe Rasengan wasn't complete. Would you say that Minato didn't invent it?",
                                                            "author": "DekuGOATED",
                                                            "id": "h6rvfnn",
                                                            "parent_id": "t1_h6rpi7f",
                                                            "score": 1,
                                                            "created_utc": 1627432965.0,
                                                            "replies": [
                                                                {
                                                                    "body": "All I said was the rasenshuriken wasn't complete. I never said anything about him not inventing it.",
                                                                    "author": "Influence_East",
                                                                    "id": "h6rzxgh",
                                                                    "parent_id": "t1_h6rvfnn",
                                                                    "score": 1,
                                                                    "created_utc": 1627435194.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Gamanbunta = Jonin level \n\nSo Naruto is Jonin level \n\nHe didn't summoned Gamanbunta against Sasuke because of plot",
            "author": "BestGirlGabi",
            "id": "h69m3h2",
            "parent_id": "t1_h67vldx",
            "score": 6,
            "created_utc": 1627058643.0,
            "replies": [
                {
                    "body": "That’s an interesting take. While Bunta and the other boss summons are strong, they don’t fit very neatly into the normal hierarchy of Genin-Chunin-Jonin-Kage that most shinobi fall into. \n\nGamabunta is very large and very strong, but he moves rather slowly, and lacks the finesse and versatility in his arsenal that we would expect of a Jonin. Naruto and Jiraiya make use of him to equalize fights against other large opponents (other summons / Tailed Beasts), but he struggles more against human-sized enemies that can evade, as seen during the fight with Pain. His skill set is oriented towards large-scale AOE attacks and Tailed Beast-sized enemies, and would be of less use otherwise. \n\nRegarding the Sasuke fight: summoning Gamabunta would have been a bad move on Naruto’s part. The structure of the valley means that Gamabunta will have little room to maneuver, and it’s uncertain if he has the speed to hit Sasuke with an attack. On the other hand, it consumes most of Naruto’s chakra, making it a risky gamble at best. \n\nIn another sense, Naruto’s refusal to go all out and use everything at his disposal could be likened to his refusal to go for the kill against Sasuke, which ended up costing him the fight anyway. On a more meta level, Naruto pulling out a giant toad against Sasuke makes the resulting fight difficult to draw, and robs it of all the parallels that made it an interesting fight to begin with.",
                    "author": "greatstarguy",
                    "id": "h6algvp",
                    "parent_id": "t1_h69m3h2",
                    "score": 1,
                    "created_utc": 1627074267.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wasn’t Minato a sage or am I wrong?",
            "author": "Bups34",
            "id": "h696qro",
            "parent_id": "t1_h67vldx",
            "score": 5,
            "created_utc": 1627052053.0,
            "replies": [
                {
                    "body": "Minato could use sage mode he just wasn't great at it.  During the Guy vs Madara fight he says it takes him too long to infuse the chakra.  He probably would have mastered it if he lived longer though I think",
                    "author": "goteamventure42",
                    "id": "h69avdb",
                    "parent_id": "t1_h696qro",
                    "score": 7,
                    "created_utc": 1627053852.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Aw he didn't say the the jutsu name",
            "author": "HappyGlue",
            "id": "h6c4hgh",
            "parent_id": "t1_h6bcqfs",
            "score": 2,
            "created_utc": 1627104508.0,
            "replies": []
        },
        {
            "body": "Naruto got a gat???",
            "author": "Tsundere_God",
            "id": "h686wsr",
            "parent_id": "t1_h67u82l",
            "score": 16,
            "created_utc": 1627028894.0,
            "replies": [
                {
                    "body": "Naruto: “I’m out of chakra…” *loads desert eagle* “but not out of options…”",
                    "author": "SeductivePillowcase",
                    "id": "h68tnyz",
                    "parent_id": "t1_h686wsr",
                    "score": 24,
                    "created_utc": 1627045928.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When one of the pains can absorb jutsu:",
            "author": "Slimxshadyx",
            "id": "h6nez93",
            "parent_id": "t1_h67u82l",
            "score": 1,
            "created_utc": 1627345132.0,
            "replies": []
        },
        {
            "body": "I think he meant using the tail beast bomb while in human mode. Even the bendy guy from bees village believed it wasn’t possible.",
            "author": "YOURMOM37",
            "id": "h687iod",
            "parent_id": "t1_h67zd07",
            "score": 20,
            "created_utc": 1627029454.0,
            "replies": []
        },
        {
            "body": "Happy cake day",
            "author": "OPgang",
            "id": "h68mgim",
            "parent_id": "t1_h67zd07",
            "score": 0,
            "created_utc": 1627041708.0,
            "replies": []
        },
        {
            "body": "Oh yeah my b, thought you were implying that he had made those jutsu. If you think about it Naruto is kindve a bigger copycat ninja than kakashi lol",
            "author": "skoomakang",
            "id": "h67z0og",
            "parent_id": "t1_h67y6wr",
            "score": 6,
            "created_utc": 1627021971.0,
            "replies": [
                {
                    "body": "Coping isn't the same as being taught though.",
                    "author": "KappaKingKame",
                    "id": "h68bdcd",
                    "parent_id": "t1_h67z0og",
                    "score": 3,
                    "created_utc": 1627033000.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ok, fair enough...",
            "author": "Rio_1111",
            "id": "h68nr8o",
            "parent_id": "t1_h687p3f",
            "score": 2,
            "created_utc": 1627042539.0,
            "replies": []
        },
        {
            "body": "Lol no I've seen that mud wall jutsu. But as a hokage does he literally know 1000 jutsus ?? Is it said in boruto or somewhere I'm curious. Please tell me",
            "author": "offensive_hoon",
            "id": "h69zgaf",
            "parent_id": "t1_h69yq3e",
            "score": 1,
            "created_utc": 1627064398.0,
            "replies": [
                {
                    "body": "I believe it is stated in Boruto, but can’t remember when.",
                    "author": "LiveLoveKanye",
                    "id": "h6a6vg0",
                    "parent_id": "t1_h69zgaf",
                    "score": 1,
                    "created_utc": 1627067700.0,
                    "replies": [
                        {
                            "body": "Well i believe too it must've been said somewhere but ik we won't be seeing that coz the writer is a idiot who don't care about the ogs",
                            "author": "offensive_hoon",
                            "id": "h6af3au",
                            "parent_id": "t1_h6a6vg0",
                            "score": 3,
                            "created_utc": 1627071374.0,
                            "replies": [
                                {
                                    "body": "I remember that too I think",
                                    "author": "PM_M3_YOUR_TITS_GIRL",
                                    "id": "h6anx15",
                                    "parent_id": "t1_h6af3au",
                                    "score": 1,
                                    "created_utc": 1627075411.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Fillers aren't canon lmao. Therefor we have to go by what's been stated in-canon, and that being Minato created the rasengan.",
            "author": "Olof2K",
            "id": "h69p5zf",
            "parent_id": "t1_h69cfju",
            "score": 1,
            "created_utc": 1627059935.0,
            "replies": [
                {
                    "body": "Ah yes. Looks like the stuff like Madara vs Hashirama and other stuff that happened in fillers ain't canon, mmm...yes..",
                    "author": "MrRappist",
                    "id": "h69v07n",
                    "parent_id": "t1_h69p5zf",
                    "score": -1,
                    "created_utc": 1627062442.0,
                    "replies": [
                        {
                            "body": "If it isn't adapted from the manga, then it's not canon, this is common knowledge. Are you a first time anime-only? Madara VS Hashirama fight was lifted straight from the manga, so why are you saying it's filler?",
                            "author": "Olof2K",
                            "id": "h6a6f9b",
                            "parent_id": "t1_h69v07n",
                            "score": 1,
                            "created_utc": 1627067499.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Naruto invented the Rasenshuriken, but that was well into Shippuden, and he had already mastered Sage Mode. That’s a different discussion entirely.",
            "author": "greatstarguy",
            "id": "h68h1fg",
            "parent_id": "t1_h683a0v",
            "score": -6,
            "created_utc": 1627037841.0,
            "replies": [
                {
                    "body": "I agree with the point you're making in this thread, but Naruto absolutely did not master Sage Mode before inventing Rasenshuriken. Kakuzu would have gotten washed much worse.",
                    "author": "DekuGOATED",
                    "id": "h68l3nr",
                    "parent_id": "t1_h68h1fg",
                    "score": 21,
                    "created_utc": 1627040806.0,
                    "replies": [
                        {
                            "body": "That’s fair, I remembered it incorrectly.",
                            "author": "greatstarguy",
                            "id": "h68np6v",
                            "parent_id": "t1_h68l3nr",
                            "score": 10,
                            "created_utc": 1627042504.0,
                            "replies": []
                        },
                        {
                            "body": "By the time Naruto fought Kakazu the rasenshuriken wasn't complete, seeing as it wasn't thrown.",
                            "author": "Influence_East",
                            "id": "h697mqy",
                            "parent_id": "t1_h68l3nr",
                            "score": 2,
                            "created_utc": 1627052437.0,
                            "replies": [
                                {
                                    "body": "You're forgetting that the Rasengan is an incomplete jutsu, but you wouldn't say that Minato did not invent it.",
                                    "author": "DekuGOATED",
                                    "id": "h69wy4b",
                                    "parent_id": "t1_h697mqy",
                                    "score": 2,
                                    "created_utc": 1627063289.0,
                                    "replies": [
                                        {
                                            "body": "???\n\nHow does that have anything to do with what I just said?",
                                            "author": "Influence_East",
                                            "id": "h6rpi7f",
                                            "parent_id": "t1_h69wy4b",
                                            "score": 1,
                                            "created_utc": 1627430038.0,
                                            "replies": [
                                                {
                                                    "body": "It should be obvious. \n\nYou're saying that it wasn't complete, so Naruto didn't invent it yet. \n\nThe Rasengan wasn't complete. Would you say that Minato didn't invent it?",
                                                    "author": "DekuGOATED",
                                                    "id": "h6rvfnn",
                                                    "parent_id": "t1_h6rpi7f",
                                                    "score": 1,
                                                    "created_utc": 1627432965.0,
                                                    "replies": [
                                                        {
                                                            "body": "All I said was the rasenshuriken wasn't complete. I never said anything about him not inventing it.",
                                                            "author": "Influence_East",
                                                            "id": "h6rzxgh",
                                                            "parent_id": "t1_h6rvfnn",
                                                            "score": 1,
                                                            "created_utc": 1627435194.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s an interesting take. While Bunta and the other boss summons are strong, they don’t fit very neatly into the normal hierarchy of Genin-Chunin-Jonin-Kage that most shinobi fall into. \n\nGamabunta is very large and very strong, but he moves rather slowly, and lacks the finesse and versatility in his arsenal that we would expect of a Jonin. Naruto and Jiraiya make use of him to equalize fights against other large opponents (other summons / Tailed Beasts), but he struggles more against human-sized enemies that can evade, as seen during the fight with Pain. His skill set is oriented towards large-scale AOE attacks and Tailed Beast-sized enemies, and would be of less use otherwise. \n\nRegarding the Sasuke fight: summoning Gamabunta would have been a bad move on Naruto’s part. The structure of the valley means that Gamabunta will have little room to maneuver, and it’s uncertain if he has the speed to hit Sasuke with an attack. On the other hand, it consumes most of Naruto’s chakra, making it a risky gamble at best. \n\nIn another sense, Naruto’s refusal to go all out and use everything at his disposal could be likened to his refusal to go for the kill against Sasuke, which ended up costing him the fight anyway. On a more meta level, Naruto pulling out a giant toad against Sasuke makes the resulting fight difficult to draw, and robs it of all the parallels that made it an interesting fight to begin with.",
            "author": "greatstarguy",
            "id": "h6algvp",
            "parent_id": "t1_h69m3h2",
            "score": 1,
            "created_utc": 1627074267.0,
            "replies": []
        },
        {
            "body": "Minato could use sage mode he just wasn't great at it.  During the Guy vs Madara fight he says it takes him too long to infuse the chakra.  He probably would have mastered it if he lived longer though I think",
            "author": "goteamventure42",
            "id": "h69avdb",
            "parent_id": "t1_h696qro",
            "score": 7,
            "created_utc": 1627053852.0,
            "replies": []
        },
        {
            "body": "Naruto: “I’m out of chakra…” *loads desert eagle* “but not out of options…”",
            "author": "SeductivePillowcase",
            "id": "h68tnyz",
            "parent_id": "t1_h686wsr",
            "score": 24,
            "created_utc": 1627045928.0,
            "replies": []
        },
        {
            "body": "Coping isn't the same as being taught though.",
            "author": "KappaKingKame",
            "id": "h68bdcd",
            "parent_id": "t1_h67z0og",
            "score": 3,
            "created_utc": 1627033000.0,
            "replies": []
        },
        {
            "body": "I believe it is stated in Boruto, but can’t remember when.",
            "author": "LiveLoveKanye",
            "id": "h6a6vg0",
            "parent_id": "t1_h69zgaf",
            "score": 1,
            "created_utc": 1627067700.0,
            "replies": [
                {
                    "body": "Well i believe too it must've been said somewhere but ik we won't be seeing that coz the writer is a idiot who don't care about the ogs",
                    "author": "offensive_hoon",
                    "id": "h6af3au",
                    "parent_id": "t1_h6a6vg0",
                    "score": 3,
                    "created_utc": 1627071374.0,
                    "replies": [
                        {
                            "body": "I remember that too I think",
                            "author": "PM_M3_YOUR_TITS_GIRL",
                            "id": "h6anx15",
                            "parent_id": "t1_h6af3au",
                            "score": 1,
                            "created_utc": 1627075411.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ah yes. Looks like the stuff like Madara vs Hashirama and other stuff that happened in fillers ain't canon, mmm...yes..",
            "author": "MrRappist",
            "id": "h69v07n",
            "parent_id": "t1_h69p5zf",
            "score": -1,
            "created_utc": 1627062442.0,
            "replies": [
                {
                    "body": "If it isn't adapted from the manga, then it's not canon, this is common knowledge. Are you a first time anime-only? Madara VS Hashirama fight was lifted straight from the manga, so why are you saying it's filler?",
                    "author": "Olof2K",
                    "id": "h6a6f9b",
                    "parent_id": "t1_h69v07n",
                    "score": 1,
                    "created_utc": 1627067499.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree with the point you're making in this thread, but Naruto absolutely did not master Sage Mode before inventing Rasenshuriken. Kakuzu would have gotten washed much worse.",
            "author": "DekuGOATED",
            "id": "h68l3nr",
            "parent_id": "t1_h68h1fg",
            "score": 21,
            "created_utc": 1627040806.0,
            "replies": [
                {
                    "body": "That’s fair, I remembered it incorrectly.",
                    "author": "greatstarguy",
                    "id": "h68np6v",
                    "parent_id": "t1_h68l3nr",
                    "score": 10,
                    "created_utc": 1627042504.0,
                    "replies": []
                },
                {
                    "body": "By the time Naruto fought Kakazu the rasenshuriken wasn't complete, seeing as it wasn't thrown.",
                    "author": "Influence_East",
                    "id": "h697mqy",
                    "parent_id": "t1_h68l3nr",
                    "score": 2,
                    "created_utc": 1627052437.0,
                    "replies": [
                        {
                            "body": "You're forgetting that the Rasengan is an incomplete jutsu, but you wouldn't say that Minato did not invent it.",
                            "author": "DekuGOATED",
                            "id": "h69wy4b",
                            "parent_id": "t1_h697mqy",
                            "score": 2,
                            "created_utc": 1627063289.0,
                            "replies": [
                                {
                                    "body": "???\n\nHow does that have anything to do with what I just said?",
                                    "author": "Influence_East",
                                    "id": "h6rpi7f",
                                    "parent_id": "t1_h69wy4b",
                                    "score": 1,
                                    "created_utc": 1627430038.0,
                                    "replies": [
                                        {
                                            "body": "It should be obvious. \n\nYou're saying that it wasn't complete, so Naruto didn't invent it yet. \n\nThe Rasengan wasn't complete. Would you say that Minato didn't invent it?",
                                            "author": "DekuGOATED",
                                            "id": "h6rvfnn",
                                            "parent_id": "t1_h6rpi7f",
                                            "score": 1,
                                            "created_utc": 1627432965.0,
                                            "replies": [
                                                {
                                                    "body": "All I said was the rasenshuriken wasn't complete. I never said anything about him not inventing it.",
                                                    "author": "Influence_East",
                                                    "id": "h6rzxgh",
                                                    "parent_id": "t1_h6rvfnn",
                                                    "score": 1,
                                                    "created_utc": 1627435194.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well i believe too it must've been said somewhere but ik we won't be seeing that coz the writer is a idiot who don't care about the ogs",
            "author": "offensive_hoon",
            "id": "h6af3au",
            "parent_id": "t1_h6a6vg0",
            "score": 3,
            "created_utc": 1627071374.0,
            "replies": [
                {
                    "body": "I remember that too I think",
                    "author": "PM_M3_YOUR_TITS_GIRL",
                    "id": "h6anx15",
                    "parent_id": "t1_h6af3au",
                    "score": 1,
                    "created_utc": 1627075411.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If it isn't adapted from the manga, then it's not canon, this is common knowledge. Are you a first time anime-only? Madara VS Hashirama fight was lifted straight from the manga, so why are you saying it's filler?",
            "author": "Olof2K",
            "id": "h6a6f9b",
            "parent_id": "t1_h69v07n",
            "score": 1,
            "created_utc": 1627067499.0,
            "replies": []
        },
        {
            "body": "That’s fair, I remembered it incorrectly.",
            "author": "greatstarguy",
            "id": "h68np6v",
            "parent_id": "t1_h68l3nr",
            "score": 10,
            "created_utc": 1627042504.0,
            "replies": []
        },
        {
            "body": "By the time Naruto fought Kakazu the rasenshuriken wasn't complete, seeing as it wasn't thrown.",
            "author": "Influence_East",
            "id": "h697mqy",
            "parent_id": "t1_h68l3nr",
            "score": 2,
            "created_utc": 1627052437.0,
            "replies": [
                {
                    "body": "You're forgetting that the Rasengan is an incomplete jutsu, but you wouldn't say that Minato did not invent it.",
                    "author": "DekuGOATED",
                    "id": "h69wy4b",
                    "parent_id": "t1_h697mqy",
                    "score": 2,
                    "created_utc": 1627063289.0,
                    "replies": [
                        {
                            "body": "???\n\nHow does that have anything to do with what I just said?",
                            "author": "Influence_East",
                            "id": "h6rpi7f",
                            "parent_id": "t1_h69wy4b",
                            "score": 1,
                            "created_utc": 1627430038.0,
                            "replies": [
                                {
                                    "body": "It should be obvious. \n\nYou're saying that it wasn't complete, so Naruto didn't invent it yet. \n\nThe Rasengan wasn't complete. Would you say that Minato didn't invent it?",
                                    "author": "DekuGOATED",
                                    "id": "h6rvfnn",
                                    "parent_id": "t1_h6rpi7f",
                                    "score": 1,
                                    "created_utc": 1627432965.0,
                                    "replies": [
                                        {
                                            "body": "All I said was the rasenshuriken wasn't complete. I never said anything about him not inventing it.",
                                            "author": "Influence_East",
                                            "id": "h6rzxgh",
                                            "parent_id": "t1_h6rvfnn",
                                            "score": 1,
                                            "created_utc": 1627435194.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I remember that too I think",
            "author": "PM_M3_YOUR_TITS_GIRL",
            "id": "h6anx15",
            "parent_id": "t1_h6af3au",
            "score": 1,
            "created_utc": 1627075411.0,
            "replies": []
        },
        {
            "body": "You're forgetting that the Rasengan is an incomplete jutsu, but you wouldn't say that Minato did not invent it.",
            "author": "DekuGOATED",
            "id": "h69wy4b",
            "parent_id": "t1_h697mqy",
            "score": 2,
            "created_utc": 1627063289.0,
            "replies": [
                {
                    "body": "???\n\nHow does that have anything to do with what I just said?",
                    "author": "Influence_East",
                    "id": "h6rpi7f",
                    "parent_id": "t1_h69wy4b",
                    "score": 1,
                    "created_utc": 1627430038.0,
                    "replies": [
                        {
                            "body": "It should be obvious. \n\nYou're saying that it wasn't complete, so Naruto didn't invent it yet. \n\nThe Rasengan wasn't complete. Would you say that Minato didn't invent it?",
                            "author": "DekuGOATED",
                            "id": "h6rvfnn",
                            "parent_id": "t1_h6rpi7f",
                            "score": 1,
                            "created_utc": 1627432965.0,
                            "replies": [
                                {
                                    "body": "All I said was the rasenshuriken wasn't complete. I never said anything about him not inventing it.",
                                    "author": "Influence_East",
                                    "id": "h6rzxgh",
                                    "parent_id": "t1_h6rvfnn",
                                    "score": 1,
                                    "created_utc": 1627435194.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "???\n\nHow does that have anything to do with what I just said?",
            "author": "Influence_East",
            "id": "h6rpi7f",
            "parent_id": "t1_h69wy4b",
            "score": 1,
            "created_utc": 1627430038.0,
            "replies": [
                {
                    "body": "It should be obvious. \n\nYou're saying that it wasn't complete, so Naruto didn't invent it yet. \n\nThe Rasengan wasn't complete. Would you say that Minato didn't invent it?",
                    "author": "DekuGOATED",
                    "id": "h6rvfnn",
                    "parent_id": "t1_h6rpi7f",
                    "score": 1,
                    "created_utc": 1627432965.0,
                    "replies": [
                        {
                            "body": "All I said was the rasenshuriken wasn't complete. I never said anything about him not inventing it.",
                            "author": "Influence_East",
                            "id": "h6rzxgh",
                            "parent_id": "t1_h6rvfnn",
                            "score": 1,
                            "created_utc": 1627435194.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It should be obvious. \n\nYou're saying that it wasn't complete, so Naruto didn't invent it yet. \n\nThe Rasengan wasn't complete. Would you say that Minato didn't invent it?",
            "author": "DekuGOATED",
            "id": "h6rvfnn",
            "parent_id": "t1_h6rpi7f",
            "score": 1,
            "created_utc": 1627432965.0,
            "replies": [
                {
                    "body": "All I said was the rasenshuriken wasn't complete. I never said anything about him not inventing it.",
                    "author": "Influence_East",
                    "id": "h6rzxgh",
                    "parent_id": "t1_h6rvfnn",
                    "score": 1,
                    "created_utc": 1627435194.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "All I said was the rasenshuriken wasn't complete. I never said anything about him not inventing it.",
            "author": "Influence_East",
            "id": "h6rzxgh",
            "parent_id": "t1_h6rvfnn",
            "score": 1,
            "created_utc": 1627435194.0,
            "replies": []
        }
    ]
}