{
    "title": "Am I the only one that actually gets turned on when a MAN is a MAN, takes control, is respectful, leads with compassion?",
    "post_id": "y2ha9c",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/y2ha9c/am_i_the_only_one_that_actually_gets_turned_on/",
    "author": "Euphoric-Beginning51",
    "body": "Am I the only woman here who is turned on when a man knows how to be a man? He has class and isn’t jumping down your throat every conversation about different positions he wants to put you in ? Many of us know why we are seeking an SR and the ones who know how to be respectful know how to not jump down a man’s throat for money and scare him off. I mean jeez it sucks so many people have made this world a shithole. I mean why do so many older men act like the younger men we apparently aren’t seeking. It’s exhausting.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/y2ha9c/am_i_the_only_one_that_actually_gets_turned_on/",
    "score": 96,
    "upvote_ratio": 0.83,
    "created_utc": 1665612954.0,
    "num_comments": 87,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Do I find it attractive when someone is a leader, confident, respectful, and compassionate? Yes. \n\nDo I find patriarchical bullshit ideas of “manhood” attractive? Not really.",
            "author": "ButterFaceSB",
            "id": "is2yqn7",
            "parent_id": "t3_y2ha9c",
            "score": 60,
            "created_utc": 1665614151.0,
            "replies": [
                {
                    "body": "Not being patriarchal I’m simply saying dudes who move differently are sexy as hell and I’d much rather sleep with them in an SR than these creeps that mention sex every 5 minutes",
                    "author": "Euphoric-Beginning51",
                    "id": "is32m6v",
                    "parent_id": "t1_is2yqn7",
                    "score": 13,
                    "created_utc": 1665615863.0,
                    "replies": [
                        {
                            "body": "I also hate when men state “I’m an alpha or a dominant male”…no you aren’t. Truly Alpha men (capitalized on purpose here) don’t need to announce it, they just ARE….and are sexy as hell.",
                            "author": "Special_Garage7225",
                            "id": "is34efr",
                            "parent_id": "t1_is32m6v",
                            "score": 28,
                            "created_utc": 1665616665.0,
                            "replies": [
                                {
                                    "body": "Oh if I read “alpha” or “dominant” on a profile, it’s a hard pass. They’re basically saying they have crappy overbearing personalities in my experience and think they can talk to you aggressively. No thanks lol.",
                                    "author": "BrunetteBunny28",
                                    "id": "is3sb86",
                                    "parent_id": "t1_is34efr",
                                    "score": 22,
                                    "created_utc": 1665627233.0,
                                    "replies": [
                                        {
                                            "body": "Definitely a huge red flag for me and will be ignored ! You’re overcompensating and want to prove to someone else your dominance. It’s weird and I’m not going to submit to someone I can’t trust. Submissiveness is earned. Men stop asking women if they’re submissive and just BE dominant, be endearing, don’t disregard our feelings or simply leave us alone. Stop treating women as someone to get your D wet. Get to know the gal, pay attention, I promise it will get you way more 🫦",
                                            "author": "Euphoric-Beginning51",
                                            "id": "is3wy9s",
                                            "parent_id": "t1_is3sb86",
                                            "score": 13,
                                            "created_utc": 1665629407.0,
                                            "replies": [
                                                {
                                                    "body": "Oof a word 🙌🏼\n\nI think most men sugar because it’s easy for them to be rude, demanding, freaky af, disrespectful, selfish, greedy etc; they think money justifies it and we as SBs will accept any behavior. I’ve spoken to married SDs who say their wives are “boring” or “too demanding” so they look for a SB who makes the feel in control and let’s them try and do anything. Couldn’t be me tho ✌🏼Can’t accept certain personalities/behavior. I prefer warm, gentle, caring SDs who care if I had dinner or how my weekend was. A SR with some type of substance and mutual respect",
                                                    "author": "BrunetteBunny28",
                                                    "id": "is46v5o",
                                                    "parent_id": "t1_is3wy9s",
                                                    "score": 11,
                                                    "created_utc": 1665634719.0,
                                                    "replies": [
                                                        {
                                                            "body": "That’s the ONLY SR I want!!! I tend to stay away from\nmarried men because of this exact reason. You put a ring on it you married her for the wrong reasons I will not be at fault for that ! Also I don’t like being the scapegoat for another woman’s failures. I want to be the center of your attention as you are mine in the time we’re together or speaking. Men think because they’re paying you, YOU have to do whatever they say because their wives won’t lol wrong woman. Not happening",
                                                            "author": "Euphoric-Beginning51",
                                                            "id": "is47abo",
                                                            "parent_id": "t1_is46v5o",
                                                            "score": 7,
                                                            "created_utc": 1665634973.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "I just called an SD out for that. Instead of having an adult conversation about it, he threw a huge tantrum and ran for the hills.",
                                                            "author": "MapleSappling",
                                                            "id": "it636lf",
                                                            "parent_id": "t1_is46v5o",
                                                            "score": 1,
                                                            "created_utc": 1666328632.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Yes !!! Every profile has “dominant” in it and they aren’t the least bit dominant only in their mind and want to have the nerve to try to control you BLAH ! I’m submissive in a sense but not naturally you have to have that demeanor that demands submissiveness and most men don’t have that",
                                    "author": "Euphoric-Beginning51",
                                    "id": "is3508e",
                                    "parent_id": "t1_is34efr",
                                    "score": 11,
                                    "created_utc": 1665616935.0,
                                    "replies": [
                                        {
                                            "body": "100%…I’m basically more of an ‘alpha’ female, so a naturally dominant man is extremely attractive and makes me want to be more submissive…I can’t just ‘be’ submissive.",
                                            "author": "Special_Garage7225",
                                            "id": "is358hp",
                                            "parent_id": "t1_is3508e",
                                            "score": 5,
                                            "created_utc": 1665617038.0,
                                            "replies": [
                                                {
                                                    "body": "Me as well, I try to be submissive but if you’re faking the funk I’m definitely either ✌🏾 or ignoring you not really interested but a man that commands the room, leaves my panties drenched. Whew ! lol",
                                                    "author": "Euphoric-Beginning51",
                                                    "id": "is35slx",
                                                    "parent_id": "t1_is358hp",
                                                    "score": 2,
                                                    "created_utc": 1665617289.0,
                                                    "replies": [
                                                        {
                                                            "body": "Hating on masculinity is what got us in this situation where meeting a man who can lead is nearly a miracle, by the way.",
                                                            "author": "daddyslittlefuckslut",
                                                            "id": "is39q6q",
                                                            "parent_id": "t1_is35slx",
                                                            "score": 4,
                                                            "created_utc": 1665619051.0,
                                                            "replies": [
                                                                {
                                                                    "body": "This…100%. I never understood why women nowadays can’t just thank a man for opening her door or giving her a compliment without it being some ‘slight against feminism’…like REALLY?!",
                                                                    "author": "Special_Garage7225",
                                                                    "id": "is6l7ku",
                                                                    "parent_id": "t1_is39q6q",
                                                                    "score": 5,
                                                                    "created_utc": 1665683544.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "It’s so hard to meet a man who is natural masculine!",
                                                                    "author": "Euphoric-Beginning51",
                                                                    "id": "is3axq7",
                                                                    "parent_id": "t1_is39q6q",
                                                                    "score": 2,
                                                                    "created_utc": 1665619594.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Facts !!",
                                                                    "author": "Euphoric-Beginning51",
                                                                    "id": "is3a4un",
                                                                    "parent_id": "t1_is39q6q",
                                                                    "score": 1,
                                                                    "created_utc": 1665619235.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Naturally and not overcompensating or overselling his talents. Like dude please cut the bs we all know why you’re here, normal doesn’t work out for you. So you have to pay someone, but if it’s because you fall short own that instead of blowing smoke up someone’s Ass it’s much more attractive and understandable. I’m able to accept my own faults as a MAN you should be able to as well.",
                                                                            "author": "Euphoric-Beginning51",
                                                                            "id": "is3b6ns",
                                                                            "parent_id": "t1_is3a4un",
                                                                            "score": 1,
                                                                            "created_utc": 1665619704.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "you be you",
                                                    "author": "AlexVaickus",
                                                    "id": "is3cwl3",
                                                    "parent_id": "t1_is358hp",
                                                    "score": 0,
                                                    "created_utc": 1665620468.0,
                                                    "replies": [
                                                        {
                                                            "body": "For sure, not changing my energy for some weak male 😘",
                                                            "author": "Special_Garage7225",
                                                            "id": "is3oqq2",
                                                            "parent_id": "t1_is3cwl3",
                                                            "score": 2,
                                                            "created_utc": 1665625650.0,
                                                            "replies": [
                                                                {
                                                                    "body": "any man would be lucky",
                                                                    "author": "AlexVaickus",
                                                                    "id": "is5hjgw",
                                                                    "parent_id": "t1_is3oqq2",
                                                                    "score": 0,
                                                                    "created_utc": 1665667501.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Any man who must say, \"I am the King,\" is no true king.",
                                    "author": "Tinker688",
                                    "id": "is5g4rn",
                                    "parent_id": "t1_is34efr",
                                    "score": 2,
                                    "created_utc": 1665666857.0,
                                    "replies": []
                                },
                                {
                                    "body": "As an alpha male I totally agree with you.",
                                    "author": "mad_dabz",
                                    "id": "is4yzwd",
                                    "parent_id": "t1_is34efr",
                                    "score": 1,
                                    "created_utc": 1665656877.0,
                                    "replies": [
                                        {
                                            "body": "I'm agreeing with you probably because I'm extremely alpha.",
                                            "author": "mad_dabz",
                                            "id": "is4z31y",
                                            "parent_id": "t1_is4yzwd",
                                            "score": 1,
                                            "created_utc": 1665656946.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "omg!  yes!  and that \"king\" crap..   \n\nNewsflash:  Monarchy doesn't call themselves by that title when they're infants - it's bestowed upon them and reinforced by their people.\n\n&#x200B;\n\nJust be a freaking human being, bruh.",
                                    "author": "Unlikely_Factor_54",
                                    "id": "is58h5o",
                                    "parent_id": "t1_is34efr",
                                    "score": 1,
                                    "created_utc": 1665663050.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Talking about sex more than once tells me he's a john, and he's dismissed.  \n\nTalking about sex frequently shows a lack of intellect, and I'm not open to other perspectives on that thank you.  \n\n..because..   ..what else you got to talk about?  ..are you this boring and one-dimensional?  \n\nThe SD that got the kitty from me didn't talk about it at all, and I was pleasantly surprised by everything he had to offer.  \\[deep breath\\]  So I don't need it to be a discussion.  It's low-qual to me and shows that you're somebody who truly needs to pay for pussy just get some.  \n\n&#x200B;\n\nTalking about sex as an SD is so beneath their networth, and that's all I ask - act like the amount of money you make or take that to some SB that isn't used to nice things.",
                            "author": "Unlikely_Factor_54",
                            "id": "is58awc",
                            "parent_id": "t1_is32m6v",
                            "score": 5,
                            "created_utc": 1665662953.0,
                            "replies": [
                                {
                                    "body": "THIS !!!! I hate having the conversation period and the less we talked about it and talked about other things I wanted to give it to him more ! But definitely low quality vibes, I’d much rather let things happen naturally than to be hounded about it 24/7 go pay and escort and leave me alone",
                                    "author": "Euphoric-Beginning51",
                                    "id": "is58lda",
                                    "parent_id": "t1_is58awc",
                                    "score": 3,
                                    "created_utc": 1665663115.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "is7jwyk",
                    "parent_id": "t1_is2yqn7",
                    "score": 0,
                    "created_utc": 1665696980.0,
                    "replies": [
                        {
                            "body": "I’m not sure that word means what you think it means 🧐",
                            "author": "ButterFaceSB",
                            "id": "is7syvy",
                            "parent_id": "t1_is7jwyk",
                            "score": 2,
                            "created_utc": 1665700739.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "They are one and the same.",
                    "author": "Wildebot34",
                    "id": "is52adc",
                    "parent_id": "t1_is2yqn7",
                    "score": -2,
                    "created_utc": 1665659268.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s SO fucking annoying!! You could be dying of cancer and men will be like “ will my big cock make you feel better than chemo baby ? 🤤🍆💧”",
            "author": "JennaKeshner",
            "id": "is4qkgb",
            "parent_id": "t3_y2ha9c",
            "score": 16,
            "created_utc": 1665649593.0,
            "replies": [
                {
                    "body": "Omg why is this soo true xD",
                    "author": "madhuraksha",
                    "id": "is4rvi0",
                    "parent_id": "t1_is4qkgb",
                    "score": 6,
                    "created_utc": 1665650797.0,
                    "replies": []
                },
                {
                    "body": "It's them choosing to stay away from the thread instead of taking notes and making some changes.",
                    "author": "Unlikely_Factor_54",
                    "id": "is5984g",
                    "parent_id": "t1_is4qkgb",
                    "score": 3,
                    "created_utc": 1665663461.0,
                    "replies": []
                },
                {
                    "body": "It’s ridiculous",
                    "author": "Euphoric-Beginning51",
                    "id": "is54g8h",
                    "parent_id": "t1_is4qkgb",
                    "score": 2,
                    "created_utc": 1665660682.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think A LOT of men don't know what being a man is.  They read \"Red Pill\" manosphere forums that tell them men are victims of society. They believe that being a man means taking control, acting tough, not showing your emotions, etc.  They see women as the enemy that needs to be conquered. They preach about how to act like an Alpha and how to be an Alpha. \n\nTrue Alphas don't care about being an Alpha. They don't want to be an Alpha, but are recognized as an Alpha by others.  They don't try to be a leader, but are chosen to lead.  \n\nConfidence is attractive, but arrogance is not. Confidence is knowing you have attributes that others value.  Arrogance is believing you are better than other people because of those attributes. \n\nTrue Men protect, provide, care for and respect others.  They are willing to put other's needs ahead of their own. They don't feel the need to bully, brag, boast or show off.  They value women and want to make them feel safe, secure, wanted, appreciated and respected.  Being a gentlemen is a sign of respect.",
            "author": "willfromvb",
            "id": "is31vle",
            "parent_id": "t3_y2ha9c",
            "score": 27,
            "created_utc": 1665615533.0,
            "replies": [
                {
                    "body": "..and a beautiful sign of Self-Respect.\n\nAppreciate you.",
                    "author": "Unlikely_Factor_54",
                    "id": "is59hdv",
                    "parent_id": "t1_is31vle",
                    "score": 4,
                    "created_utc": 1665663598.0,
                    "replies": []
                },
                {
                    "body": "as soon as you start thinking you're a victim - you become a victim. that's just not something i want to be",
                    "author": "davitech73",
                    "id": "is3if4h",
                    "parent_id": "t1_is31vle",
                    "score": 2,
                    "created_utc": 1665622875.0,
                    "replies": []
                },
                {
                    "body": "Wow 🤩 this was well said !!!! Every man should read this lol",
                    "author": "BrunetteBunny28",
                    "id": "is3so2n",
                    "parent_id": "t1_is31vle",
                    "score": 3,
                    "created_utc": 1665627397.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "is535mg",
                    "parent_id": "t1_is31vle",
                    "score": 4,
                    "created_utc": 1665659854.0,
                    "replies": [
                        {
                            "body": "Casting yourself as a victim and burying yourself in self pity is never a winning strategy. Life is not fair and some people have more disadvantages than others, but focusing on those disadvantages will only make you bitter and angry, and will guarantee you will continue to be a victim.",
                            "author": "willfromvb",
                            "id": "is54lnb",
                            "parent_id": "t1_is535mg",
                            "score": 5,
                            "created_utc": 1665660777.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "is553q3",
                                    "parent_id": "t1_is54lnb",
                                    "score": -1,
                                    "created_utc": 1665661083.0,
                                    "replies": [
                                        {
                                            "body": "There is no question that Social Media has enabled people with grievances to find like minded communities to share in their grievances. When these communities look for solutions to deal with these grievances in a positive way, it can be very healthy.  Unfortunately, most of these communities have become echo chambers that only focus on being victims and not on solutions. Many of these communities have become unwitting pawns of sinister people that want to further divide and weaken society to their benefit.",
                                            "author": "willfromvb",
                                            "id": "is58ais",
                                            "parent_id": "t1_is553q3",
                                            "score": 5,
                                            "created_utc": 1665662946.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "so much pain and feelings of slight and confusion in this address..  lol.  shame.\n\n&#x200B;\n\nbe blessed!",
                            "author": "Unlikely_Factor_54",
                            "id": "is59mie",
                            "parent_id": "t1_is535mg",
                            "score": 0,
                            "created_utc": 1665663673.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I totally agree !",
                    "author": "Euphoric-Beginning51",
                    "id": "is331wl",
                    "parent_id": "t1_is31vle",
                    "score": 2,
                    "created_utc": 1665616057.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh, honey.  The only ones that have a problem with a Man being a Man are males that struggle with their own sense of being a Man amongst Men.  \n\n&#x200B;\n\nA Man's Man is the only Man that captivates my attention.  I'm too feminine for a man struggling with his masculinity.  This isn't fetish work, so it's not my job to aid or reinforce that for him.   I'm also just not good at validating people's sense of Self; which is what a lot of males require, whether they choose to be open about that or not.",
            "author": "Unlikely_Factor_54",
            "id": "is57hqh",
            "parent_id": "t3_y2ha9c",
            "score": 3,
            "created_utc": 1665662490.0,
            "replies": [
                {
                    "body": "That is very true. You know how to not be a creep and it’s not my job to show you that new to the bowl of not! Have the right intentions and attitude from jump because a lot of us are not tolerating the weirdo crap.",
                    "author": "Euphoric-Beginning51",
                    "id": "is57nqo",
                    "parent_id": "t1_is57hqh",
                    "score": 3,
                    "created_utc": 1665662587.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think there’s a danger here that men who don’t behave a certain way would be labeled “not men” and I wouldn’t want that  or for men who prefer not to be the leader to feel less than.\n\nThat said, I do prefer a loose version of a more old school type of masculinity and relationship structure. And it’s part of why I find SRs an interesting prospect. \n\nI’m very much a feminist but I find the idea of equality often misappropriated, misused, or actively weaponized against women. I don’t find it empowering to spend thousands more to be dateable then run disproportionate risks then be expected to split the check and have cheap bad (for me) easy (for him) sex as a sort of human pizza delivery. I don’t feel the gold standard of mankind is masculine and that to be of value I should try to ape the roles and habits and behaviors men have traditionally been associated with.\n\nAnd I go weak for the weirdest things: planning dates, a hand on the small of my back, holding the door for me, paying the check, getting me a taxi or walking me to my car. I get inappropriate crushes on characters in black and white movies, golden age mystery novels, 1950s sitcoms.\n\nI also prefer a correlate power dynamic but I’m actually not sure if the bedroom dynamic springs from preferring to be treated a certain way outside of it or the other way round. Like I would be fine without kinky sex though I’d prefer not to be. But I’m not sure about being with a man who would do none of the things listed above, who I don’t feel safe with or feel can respectfully take charge.",
            "author": "LucyHoneychurch-",
            "id": "is3ll7w",
            "parent_id": "t3_y2ha9c",
            "score": 6,
            "created_utc": 1665624248.0,
            "replies": []
        },
        {
            "body": "You aren’t alone there! Ofc we know men are sexually driven humans but those who don’t have control over themselves (when having conversations, let alone when being physically close to someone), shows that they lack discipline. It’s the easiest way for me to tell if a POT is actually a John. \n\nIt’s fine if it’s someone you’ve established a relationship with and you both are in the mood. It also makes it a little hotter (for me) to see a different side of them daytime vs night time. What’s the male equivalent for lady in streets and freak in sheets?😂",
            "author": "JBay223",
            "id": "is303n5",
            "parent_id": "t3_y2ha9c",
            "score": 3,
            "created_utc": 1665614749.0,
            "replies": [
                {
                    "body": "Lol I have no idea BUT I totally get it ! Like I get so hot when a man has control ! Like please believe it’s such a turn on when a man knows how to not be so cringy ! Like I’m almost ready to pounce on him versus the guy that can’t shut up about it I’m dreading seeing and only lasts 5 mins lol. I hate those overcompensating types like just relax have fun and enjoy the ride JEEZ !",
                    "author": "Euphoric-Beginning51",
                    "id": "is32y2n",
                    "parent_id": "t1_is303n5",
                    "score": 1,
                    "created_utc": 1665616010.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A lot of people think that \"being a man\" means toxic red hat masculinity.  Someone who must always be in control and make every decision.  Overly competitive machismo, which underneath is just raging insecurity.\n\nI'd rather be a man of humble, thoughtful confidence.  Someone who is quite happy to remain quiet and let others make fools of themselves, but when I speak, people stop to listen, because I have their respect.\n\nAs for women who are attracted to men who are assholes, the \"real men\", I am quite happy to let them go chase assholes.  It is unlikely that I would get along with someone who is attracted to men like that.",
            "author": "robhudsondfw",
            "id": "is3bp62",
            "parent_id": "t3_y2ha9c",
            "score": 7,
            "created_utc": 1665619931.0,
            "replies": [
                {
                    "body": "I’m not speaking on Assholes or your definition of real men! I was raised by real men, not the ones who stated don’t cry because you’re a boy, but those that could build things, fix things and still be the little spoon. A real man to me is a man who doesn’t treat women like a sex toy because he knows his value. A real man is a man who can be himself, lead and a woman’s feminine nature doesn’t threaten his masculinity. A man who can handle things and lead without being told to relax, stop being so pushy and just trust that things will happen the way they’re supposed to.",
                    "author": "Euphoric-Beginning51",
                    "id": "is3mrbf",
                    "parent_id": "t1_is3bp62",
                    "score": 7,
                    "created_utc": 1665624762.0,
                    "replies": [
                        {
                            "body": "I like your definition!\n\nThe phrase \"real man\" has too many meanings these days.  When I was growing up, \"real men\" didn't cry, and they resorted to violence to solve conflict.  When I hear the phrase, that's the image that pops into my head.  \n\n\nI like yours much better.",
                            "author": "robhudsondfw",
                            "id": "is3nhfs",
                            "parent_id": "t1_is3mrbf",
                            "score": 5,
                            "created_utc": 1665625087.0,
                            "replies": [
                                {
                                    "body": "Thank you I’ve encountered those men many times in my life and have appreciated them so much because they stand out and leave a lasting impression",
                                    "author": "Euphoric-Beginning51",
                                    "id": "is3phdq",
                                    "parent_id": "t1_is3nhfs",
                                    "score": 2,
                                    "created_utc": 1665625975.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "**the following response was more to the broader role of masculinity in society. My direct OP response is that it sounds more just like men being excited to have someone pretty to sleep with lmao**\n\nBeing on the younger end of SDs. I have found that it genuinely is just taking on responsibility and learning to manage risk and stress and push through anxiety and be uncomfortable that will afford you any of these qualities. And I'm by no means the master of any of them and I always choose to lead from behind. Behind the curtains > star of the show. \n\nBravado and bluster is helpful, but the simplistic views on masculinity that often come with it are a bit reductive. That being said most women absolutely like men taking charge in some form, and I think the subtext that makes all the difference to this is whether the man is doing it to take care of a situation or because he's doing it \"to take charge as the man hrmph\". \n\nWith all that said, and I appreciate how silly this sounds **You gotta give men some slack in this department**\n\nForgetting the fact that the concept of masculinity and want for strong partners comes with the almost mutually exclusive confusing notions that they're somehow \"a leader who takes charge\" while also isnt \"patriarchal and trying to control things\"  I think men grown up within a western culture today are dealing with an identity crisis that's new and not easy to navigate. \n\nWe're getting told from women on both ends opposing wants, under 30s and over 30s see very different in expectations in my experience. Gender identity is in question in society as a whole. The nuclear family is gone but the want for a man who can provide for the family isnt. Disproportionate fears of being accused as a sexual predator is on rise, the risks that this holds is on your life is on the rise. Reductive redpill and MRA and incel culture exists as echo chamber traps, there's less incentive for people to commune and bridge differences with the advent of internet society and social media, hardcore reality distorting porn and instagram models are completely fucking up sexual and physical expectations on both ends. And online dating and hookup society is resulting in more \"alpha\" men getting more options while the less fortunate become less experienced and less confident and basically the amount of relationships are becoming shorter and less frequent now. \n\nNone of this is anyone's \"fault\", women's movement is grand and they should continue pushing for the changes that society needs to adopt. It is on us men to come to terms to these changes and adjust to a growing gender equitable society. \n\nBut as an at best lower middle class white man who just survived his 20s before \"making it\" (with very little help afforded to me for being white or male fyi in regards to my particular means of making it) this shit isn't psychologically or emotionally easy, especially if you're smart enough to need to have your confidence built-into something material and not resulting from a lack of self awareness and boisterous personality affording you more experience with women from a younger age.  \n\nThe majority of us were just not prepared, we're experiencing the biggest gap in expectation vs reality than any other group, we're literally grown up with an idea of  what a successful man is, just to then have that fragile identity shattered. \n\nBefore hand, you got a good grade at school, you got a job that had career development opportunities, a decent mortgage and an affordable house, free education, a salary to pay for a family and a wife because it's basically expected of her and shes old af if she's not a mom by 25 and \"he's got a manager job\" was literally a good enough reason for marriage. \n\nNow, simply matching what your dad had is exponentially more difficult, all while online dating and casual sex and female sexual liberation has led to sexual selectivity and competition to sharply increase. \n\nSugardating in many ways is one of the last few places where this hyper exaggerated masculine feminine dynamic can exist simplistically, because one of them is literally loaded enough to be able to afford to allow the other to play some hyper feminine role, it's not strictly monogamous, and parameters are usually well defined. \n\nIn order for me to get to a place where I can pick my partner's, I literally had to sacrifice my health, forego job opportunities and income, go hermit for 5 years and not date or hang out with people until I  figured out how to run a successful business after a lot of failure.",
            "author": "mad_dabz",
            "id": "is51mfk",
            "parent_id": "t3_y2ha9c",
            "score": 4,
            "created_utc": 1665658810.0,
            "replies": [
                {
                    "body": "Women don’t want to hear about men’s struggles.  The BLUF is they don’t care, and telling them is an instant turn off.  They are certain that the world they live in is much tougher.",
                    "author": "NVOkie9018",
                    "id": "is5uwer",
                    "parent_id": "t1_is51mfk",
                    "score": 1,
                    "created_utc": 1665673198.0,
                    "replies": [
                        {
                            "body": "The world women live very very likely is tougher though, data supports this. \nIt may.be not as lonely, likely is afforded a lot more emotional support and camaraderie, and is improving whereas ours isn't. But I can't sit here and pretend they've got it good either. \n\nIn Iran women are protesting not being executed for not wearing a bit of religious headwear. In the US the federal right to bodily autonomy was just revoked, a right just recently afforded the Irish in the British isles. But oh dear, men don't know to be men anymore, they cant earn enough to literally support an entire family anymore. Y'see what I'm saying? These issues are not exactly comparable.\n\nI cant imagine any smart woman secure in herself I know possibly objecting to me pointing out these issues either, not unless it had some sort of criticism of feminism baked into it. I also not saying this as a pickup line, and would hope girls didn't get turned on hearing men discuss common struggles within the roles of the modern male identity lmao.",
                            "author": "mad_dabz",
                            "id": "is6mt35",
                            "parent_id": "t1_is5uwer",
                            "score": 3,
                            "created_utc": 1665684161.0,
                            "replies": [
                                {
                                    "body": "I really appreciate that you acknowledge that. I can absolutely see how it would be a case of mixed messaging, at best. And, perhaps, a scarcity of role models navigating the landscape with any degree of strength and grace. It’s hard to aim for a goal you can’t even decide on. And then, terrible women like me who claim to want one thing but actually want something rather different only know we aren’t allowed to.\n\nI also see a more sinister side in it being quite profitable to lean into this uncertainty & stoke it or twist it. I see that in the red pill crowd and the rise of Andrew Tate and a million other things. Resentment can be wildly profitable, as can the sale of a twisted sense of superiority and power where men feel they have none. Grievance and hatred of women can at least be fashioned into a seemingly coherent worldview. Sticking it to them or reigning them in a mission. And I do wonder how much men talking about women is actually men talking about an absence of the latter two things. \n\nOn the other hand, I feel that the crisis of masculinity itself, it’s focus, and it’s hold on social and cultural narratives, is itself to do with manhood being a privileged position in a way womanhood never will be. I’ve never heard, for instance, that I throw like a *boy* or I’m behaving like *a little boy* or hit like a *boy* or need to *be a woman.* There never was a coherent ideal to aspire to which would command respect. I’m either a bitch or an incompetent pushover, a slut or a prude, etc. I always knew I couldn’t win. I think men are losing their minds because for the first time, they may not either. Or at least it will be very difficult.",
                                    "author": "LucyHoneychurch-",
                                    "id": "isd2yv9",
                                    "parent_id": "t1_is6mt35",
                                    "score": 2,
                                    "created_utc": 1665796060.0,
                                    "replies": []
                                },
                                {
                                    "body": "“One in four homeless people are women!”\n- implies that three of every four homeless people are men, but people don’t care about that.\n\nWhat’s the gender split on suicide?\nThe only men who commit suicide that anyone mentions are veterans.  The other men, meh.\n\nSentencing disparities in the American criminal justice system?  LOL, who cares.\n\nEquality hasn’t made it to divorces, and women want to keep it that way.\n\nWho makes up the vast majority (+90% in any given year) of workplace deaths?  Meh, men are disposable.\n\nWho’s getting left behind in the K-12 education system?\nBoys\n\nWho outnumbers who by 3 to 2 on American university campuses?\n\nWho is graduating with more bachelor’s masters, and doctorates?\n\nThere are scholarships that are only available to women.  No one bats an eye.  I didn’t see any scholarships that were male only when I was looking at scholarships with my son last year.",
                                    "author": "NVOkie9018",
                                    "id": "is6umqn",
                                    "parent_id": "t1_is6mt35",
                                    "score": 1,
                                    "created_utc": 1665687208.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't care what anyone says, I WILL NOT date a man who doesn't know how to lead and who doesn't make the decisions. I don't do \"go with the flow\", I don't do last minute plans, I don't do cheap dates, I don't do low effort, I don't do 50/50.",
            "author": "daddyslittlefuckslut",
            "id": "is39cvi",
            "parent_id": "t3_y2ha9c",
            "score": 6,
            "created_utc": 1665618884.0,
            "replies": [
                {
                    "body": "THATS IT !",
                    "author": "Euphoric-Beginning51",
                    "id": "is3atzz",
                    "parent_id": "t1_is39cvi",
                    "score": 2,
                    "created_utc": 1665619548.0,
                    "replies": []
                },
                {
                    "body": "Just out of curiosity - how do you then justify the entire feminist movement of the last 30 years.. I have a 16 year old son and he says to me, “Dad, I don’t want to be responsible for a whole another woman at a date or otherwise, it’s too stressful and none of the girls at school want me to be either.”…",
                    "author": "Hfdadmanager",
                    "id": "is3clgr",
                    "parent_id": "t1_is39cvi",
                    "score": 1,
                    "created_utc": 1665620331.0,
                    "replies": [
                        {
                            "body": "I guess this is the way kids are being brought up now and I'm glad I belong to a different generation where I'm still able to date old-school men who know how to be masculine and treat a woman like a lady. I feel sorry for all these girls who will never know what it feels like to date a provider type of man.",
                            "author": "daddyslittlefuckslut",
                            "id": "is3dcpk",
                            "parent_id": "t1_is3clgr",
                            "score": 9,
                            "created_utc": 1665620662.0,
                            "replies": [
                                {
                                    "body": "I definitely prefer a provider type of a man. I like men who take the lead without being domineering. I prefer old-school men anyday, anytime, who are gentlemen and know how to treat a woman like a lady. I do feel sorry for my nieces because the young men of today are too feminine and most are cheapskates looking for so-called independent women to date so they don't have to foot the bills on dates. I cannot stand the 50:50 concept of dating, especially when woman have to spend money to dole themselves up, and lose out financially when they take time out of their careers to have babies.",
                                    "author": "beebee007",
                                    "id": "is6x5v6",
                                    "parent_id": "t1_is3dcpk",
                                    "score": 4,
                                    "created_utc": 1665688197.0,
                                    "replies": []
                                },
                                {
                                    "body": "Isn’t men and women earning approximately the same one of the major goals of an egalitarian society? The lack of male providers is a good thing, not a bad thing. It means society as a whole has more not less providers.",
                                    "author": null,
                                    "id": "is6l6ht",
                                    "parent_id": "t1_is3dcpk",
                                    "score": 2,
                                    "created_utc": 1665683533.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Who has to justify the feminist movement. \n\nI taught my son to be polite and pay for the date. He is very thoughtful. He does really well for himself 😉",
                            "author": "daddoms",
                            "id": "is3l3ws",
                            "parent_id": "t1_is3clgr",
                            "score": 4,
                            "created_utc": 1665624038.0,
                            "replies": []
                        },
                        {
                            "body": "Why are you bringing another generation into this conversation about present-day adults?\n\n&#x200B;\n\nThat's inappropriate.  Leave children out of these conversations.",
                            "author": "Unlikely_Factor_54",
                            "id": "is5a675",
                            "parent_id": "t1_is3clgr",
                            "score": 1,
                            "created_utc": 1665663956.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "So a man needs to spend a ton of cash on you to show he's a man?",
                    "author": "SD1070",
                    "id": "is3fs32",
                    "parent_id": "t1_is39cvi",
                    "score": 0,
                    "created_utc": 1665621732.0,
                    "replies": [
                        {
                            "body": "I said:\n\n\"I WILL NOT date a man who doesn't know how to lead and who doesn't make the decisions. I don't do \"go with the flow\", I don't do last minute plans, I don't do cheap dates, I don't do low effort, I don't do 50/50\"\n\nThe only thing you were able to read in this was \"a lot of cash\". Interesting...",
                            "author": "daddyslittlefuckslut",
                            "id": "is7zeg2",
                            "parent_id": "t1_is3fs32",
                            "score": 2,
                            "created_utc": 1665703615.0,
                            "replies": [
                                {
                                    "body": "Sometimes the best things in life don't cost a lot of money. I don't do cheap dates shows you think spending money is more important than the actual experience.",
                                    "author": "SD1070",
                                    "id": "is8ckui",
                                    "parent_id": "t1_is7zeg2",
                                    "score": 3,
                                    "created_utc": 1665709648.0,
                                    "replies": [
                                        {
                                            "body": "I love how binary you are about this, like he EITHER has to spend money on me OR give me a nice experience, but not both simultaneously. To me, a man showing me he can be generous with money towards/around me is absolutely essential to my overall experience of the date and of his company in the long term. I wouldn't be sugar dating if that wasn't the case. The \"actual experience\" (in your words) might be really nice, but if it happens at McDonald's because he proposed a date there? Yeah sorry, not gonna be my thing.\n\nAlso I don't get why you're so defensive about me wanting men to give me expensive experiences. Does it affect you at a personal level or anything?",
                                            "author": "daddyslittlefuckslut",
                                            "id": "isacp2m",
                                            "parent_id": "t1_is8ckui",
                                            "score": 2,
                                            "created_utc": 1665754708.0,
                                            "replies": [
                                                {
                                                    "body": "A nice hike through nature costs almost nothing and can still be a great experience.",
                                                    "author": "SD1070",
                                                    "id": "isadwdo",
                                                    "parent_id": "t1_isacp2m",
                                                    "score": 3,
                                                    "created_utc": 1665755228.0,
                                                    "replies": [
                                                        {
                                                            "body": "I totally agree with you, you can take a self absorbed chick to places like capital grille or any over priced restaurant, or take them to unique experience that you can remember for long time.\n\nI took my date to special event in museum, and a burlesque  she had the best time of her life. It’s wasn’t the expensive place as well, but some chicks foolishly think materialism is important and will always be miserable in the long run.",
                                                            "author": "dynolas1",
                                                            "id": "iuh5ro0",
                                                            "parent_id": "t1_isadwdo",
                                                            "score": 1,
                                                            "created_utc": 1667205841.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "When males say things like this, it only shows how hurt they are; most especially when they elect to miss the point and act hard of critical thinking.\n\nThis is toxic and ineligible.\n\nNEXT?!",
                            "author": "Unlikely_Factor_54",
                            "id": "is5aevp",
                            "parent_id": "t1_is3fs32",
                            "score": 3,
                            "created_utc": 1665664083.0,
                            "replies": [
                                {
                                    "body": "Not hurt at all. You didn't answer the question.",
                                    "author": "SD1070",
                                    "id": "is5kke0",
                                    "parent_id": "t1_is5aevp",
                                    "score": 2,
                                    "created_utc": 1665668838.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love me a manly man. Not someone who’s trying to be macho but someone that knows what women need. They take leadership, looks out for the best interest of the woman, protects, provides, honors, respects, puts us in our place, strong and stable like a tree when we’re chaotic, listens instead trying to fix. This makes me seriously drool 🤤",
            "author": "natayy",
            "id": "is38meh",
            "parent_id": "t3_y2ha9c",
            "score": 4,
            "created_utc": 1665618557.0,
            "replies": []
        },
        {
            "body": "Hell yes 🙌🏼 I agree 100%! It’s such a turnoff when they’re so damn horny and make everything sexual. I can’t talk to SDs like that. Like calm down, desperation is not cute. Also we aren’t just bodies that you “rent” whenever you like. We need mental stimulation as well",
            "author": "BrunetteBunny28",
            "id": "is3rvd8",
            "parent_id": "t3_y2ha9c",
            "score": 2,
            "created_utc": 1665627029.0,
            "replies": [
                {
                    "body": "Exactly !!! Too many dudes have contacted me and we’re talking regularly then there’s a random ass D pic or they’re texting I can’t wait to taste you, instant turn off and I’m definitely going to let you know ! It’s weird and very desperate",
                    "author": "Euphoric-Beginning51",
                    "id": "is3w6t4",
                    "parent_id": "t1_is3rvd8",
                    "score": 3,
                    "created_utc": 1665629040.0,
                    "replies": [
                        {
                            "body": "I rejected a SD today who could not help but say things like “wow idk if I’ll be able to control myself around you” every time we texted. Like seriously? There’s no respect of boundaries. He was an attractive older SD, I’m sure he gets away with being overly sexual just based off his looks. Mind you words like “I’m a nice guy” or “respectful gentleman” on profiles are a red flag because he had that and would not stop making sexual comments once we took the convo off the site. \n\nThou doth protest too much 🤥🧢",
                            "author": "BrunetteBunny28",
                            "id": "is4650u",
                            "parent_id": "t1_is3w6t4",
                            "score": 2,
                            "created_utc": 1665634292.0,
                            "replies": [
                                {
                                    "body": "Lol same thing happened to me a guy I met IRL insisted on being a gentleman and he’s respectful and today I told him I had a stressful day and he went straight to let’s have mind blowing sex totally disregarding me, I quickly blocked him",
                                    "author": "Euphoric-Beginning51",
                                    "id": "is46h6g",
                                    "parent_id": "t1_is4650u",
                                    "score": 3,
                                    "created_utc": 1665634490.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yea you are the only one lol",
            "author": "macz786",
            "id": "is43j1s",
            "parent_id": "t3_y2ha9c",
            "score": 1,
            "created_utc": 1665632810.0,
            "replies": []
        },
        {
            "body": "Yes, it’s just you. You’re the only one left. They killed all the other women who were brave enough to like dominant men.",
            "author": "paroxysmique",
            "id": "is594g0",
            "parent_id": "t3_y2ha9c",
            "score": 1,
            "created_utc": 1665663405.0,
            "replies": [
                {
                    "body": "Seriously. She’s the only girl who wants a respectful man!! Every other girl wants a guy who does say horny and rude shit all the time",
                    "author": "luckyluckyduck",
                    "id": "is63jdn",
                    "parent_id": "t1_is594g0",
                    "score": 1,
                    "created_utc": 1665676641.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I find that a great SR gives me tremendous confidence in other aspects of life.  My office is loaded with attractive young women who all make direct eye contact with me and awkward attempts at small talk.  My SR allows me to step back, appreciate the attention without being stupid.  Likewise outside of the office.  At my age, I know what stupid moves guys can make.  I'm sure I am guilty from time to time.  But, knowing my babe is always a few days away...I can rise above the morass.  Maybe that makes me look more like a real man...but when I am forced back onto SA...my world is different.",
            "author": "sdphilly",
            "id": "is5natu",
            "parent_id": "t3_y2ha9c",
            "score": 1,
            "created_utc": 1665670024.0,
            "replies": [
                {
                    "body": "I can understand that.",
                    "author": "Euphoric-Beginning51",
                    "id": "is5qnvs",
                    "parent_id": "t1_is5natu",
                    "score": 1,
                    "created_utc": 1665671461.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "💯",
            "author": "Laciethewife",
            "id": "is3dgln",
            "parent_id": "t3_y2ha9c",
            "score": 0,
            "created_utc": 1665620710.0,
            "replies": []
        },
        {
            "body": "I love it when a guy takes control. That means I can go hide in the back, revert to my normal idleness, and skive off",
            "author": "Toojew4u",
            "id": "is3xp3d",
            "parent_id": "t3_y2ha9c",
            "score": 0,
            "created_utc": 1665629773.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "is641fu",
            "parent_id": "t3_y2ha9c",
            "score": 0,
            "created_utc": 1665676841.0,
            "replies": [
                {
                    "body": "No everyone agrees that we’re tired of the way dudes act and have no class in the bowl.",
                    "author": "Euphoric-Beginning51",
                    "id": "is650kz",
                    "parent_id": "t1_is641fu",
                    "score": 2,
                    "created_utc": 1665677231.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "is6edv9",
                            "parent_id": "t1_is650kz",
                            "score": 0,
                            "created_utc": 1665680910.0,
                            "replies": [
                                {
                                    "body": "You missed the whole point of the whole post and majority of the comments from women about their experiences with “men” who act like boys and can’t control their mouths or bodies. We all have the same problem and that’s the real issue.",
                                    "author": "Euphoric-Beginning51",
                                    "id": "is6eu94",
                                    "parent_id": "t1_is6edv9",
                                    "score": 1,
                                    "created_utc": 1665681087.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Probably. I’m a man. And I’m neither turned on or off when a man is a man.",
            "author": "3hrs2thebeach",
            "id": "is42gd7",
            "parent_id": "t3_y2ha9c",
            "score": -1,
            "created_utc": 1665632222.0,
            "replies": []
        },
        {
            "body": "You are a rare bird indeed.",
            "author": "nosleep4eternity",
            "id": "is6kyp7",
            "parent_id": "t3_y2ha9c",
            "score": 1,
            "created_utc": 1665683449.0,
            "replies": []
        },
        {
            "body": "That's because many of the gender roles are reversing in a marriage.  A lot of SDs turn to escorts and SBs to get their fix.  At home they been abused by their spouse so they are looking for an escape.  A lot of women today make same or more money then their husbands so they don't feel they need to provide their husbands regular sex.  A lot of women are also becoming unattractive and overweight once they hit their late 30s and older.  So it's naturally many men are seeking young SBs for their fix.",
            "author": "MKTekke",
            "id": "is81zct",
            "parent_id": "t3_y2ha9c",
            "score": 1,
            "created_utc": 1665704815.0,
            "replies": [
                {
                    "body": "That has nothing to do with the current post but go off",
                    "author": "Euphoric-Beginning51",
                    "id": "is830m8",
                    "parent_id": "t1_is81zct",
                    "score": 1,
                    "created_utc": 1665705299.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not being patriarchal I’m simply saying dudes who move differently are sexy as hell and I’d much rather sleep with them in an SR than these creeps that mention sex every 5 minutes",
            "author": "Euphoric-Beginning51",
            "id": "is32m6v",
            "parent_id": "t1_is2yqn7",
            "score": 13,
            "created_utc": 1665615863.0,
            "replies": [
                {
                    "body": "I also hate when men state “I’m an alpha or a dominant male”…no you aren’t. Truly Alpha men (capitalized on purpose here) don’t need to announce it, they just ARE….and are sexy as hell.",
                    "author": "Special_Garage7225",
                    "id": "is34efr",
                    "parent_id": "t1_is32m6v",
                    "score": 28,
                    "created_utc": 1665616665.0,
                    "replies": [
                        {
                            "body": "Oh if I read “alpha” or “dominant” on a profile, it’s a hard pass. They’re basically saying they have crappy overbearing personalities in my experience and think they can talk to you aggressively. No thanks lol.",
                            "author": "BrunetteBunny28",
                            "id": "is3sb86",
                            "parent_id": "t1_is34efr",
                            "score": 22,
                            "created_utc": 1665627233.0,
                            "replies": [
                                {
                                    "body": "Definitely a huge red flag for me and will be ignored ! You’re overcompensating and want to prove to someone else your dominance. It’s weird and I’m not going to submit to someone I can’t trust. Submissiveness is earned. Men stop asking women if they’re submissive and just BE dominant, be endearing, don’t disregard our feelings or simply leave us alone. Stop treating women as someone to get your D wet. Get to know the gal, pay attention, I promise it will get you way more 🫦",
                                    "author": "Euphoric-Beginning51",
                                    "id": "is3wy9s",
                                    "parent_id": "t1_is3sb86",
                                    "score": 13,
                                    "created_utc": 1665629407.0,
                                    "replies": [
                                        {
                                            "body": "Oof a word 🙌🏼\n\nI think most men sugar because it’s easy for them to be rude, demanding, freaky af, disrespectful, selfish, greedy etc; they think money justifies it and we as SBs will accept any behavior. I’ve spoken to married SDs who say their wives are “boring” or “too demanding” so they look for a SB who makes the feel in control and let’s them try and do anything. Couldn’t be me tho ✌🏼Can’t accept certain personalities/behavior. I prefer warm, gentle, caring SDs who care if I had dinner or how my weekend was. A SR with some type of substance and mutual respect",
                                            "author": "BrunetteBunny28",
                                            "id": "is46v5o",
                                            "parent_id": "t1_is3wy9s",
                                            "score": 11,
                                            "created_utc": 1665634719.0,
                                            "replies": [
                                                {
                                                    "body": "That’s the ONLY SR I want!!! I tend to stay away from\nmarried men because of this exact reason. You put a ring on it you married her for the wrong reasons I will not be at fault for that ! Also I don’t like being the scapegoat for another woman’s failures. I want to be the center of your attention as you are mine in the time we’re together or speaking. Men think because they’re paying you, YOU have to do whatever they say because their wives won’t lol wrong woman. Not happening",
                                                    "author": "Euphoric-Beginning51",
                                                    "id": "is47abo",
                                                    "parent_id": "t1_is46v5o",
                                                    "score": 7,
                                                    "created_utc": 1665634973.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "I just called an SD out for that. Instead of having an adult conversation about it, he threw a huge tantrum and ran for the hills.",
                                                    "author": "MapleSappling",
                                                    "id": "it636lf",
                                                    "parent_id": "t1_is46v5o",
                                                    "score": 1,
                                                    "created_utc": 1666328632.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yes !!! Every profile has “dominant” in it and they aren’t the least bit dominant only in their mind and want to have the nerve to try to control you BLAH ! I’m submissive in a sense but not naturally you have to have that demeanor that demands submissiveness and most men don’t have that",
                            "author": "Euphoric-Beginning51",
                            "id": "is3508e",
                            "parent_id": "t1_is34efr",
                            "score": 11,
                            "created_utc": 1665616935.0,
                            "replies": [
                                {
                                    "body": "100%…I’m basically more of an ‘alpha’ female, so a naturally dominant man is extremely attractive and makes me want to be more submissive…I can’t just ‘be’ submissive.",
                                    "author": "Special_Garage7225",
                                    "id": "is358hp",
                                    "parent_id": "t1_is3508e",
                                    "score": 5,
                                    "created_utc": 1665617038.0,
                                    "replies": [
                                        {
                                            "body": "Me as well, I try to be submissive but if you’re faking the funk I’m definitely either ✌🏾 or ignoring you not really interested but a man that commands the room, leaves my panties drenched. Whew ! lol",
                                            "author": "Euphoric-Beginning51",
                                            "id": "is35slx",
                                            "parent_id": "t1_is358hp",
                                            "score": 2,
                                            "created_utc": 1665617289.0,
                                            "replies": [
                                                {
                                                    "body": "Hating on masculinity is what got us in this situation where meeting a man who can lead is nearly a miracle, by the way.",
                                                    "author": "daddyslittlefuckslut",
                                                    "id": "is39q6q",
                                                    "parent_id": "t1_is35slx",
                                                    "score": 4,
                                                    "created_utc": 1665619051.0,
                                                    "replies": [
                                                        {
                                                            "body": "This…100%. I never understood why women nowadays can’t just thank a man for opening her door or giving her a compliment without it being some ‘slight against feminism’…like REALLY?!",
                                                            "author": "Special_Garage7225",
                                                            "id": "is6l7ku",
                                                            "parent_id": "t1_is39q6q",
                                                            "score": 5,
                                                            "created_utc": 1665683544.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "It’s so hard to meet a man who is natural masculine!",
                                                            "author": "Euphoric-Beginning51",
                                                            "id": "is3axq7",
                                                            "parent_id": "t1_is39q6q",
                                                            "score": 2,
                                                            "created_utc": 1665619594.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Facts !!",
                                                            "author": "Euphoric-Beginning51",
                                                            "id": "is3a4un",
                                                            "parent_id": "t1_is39q6q",
                                                            "score": 1,
                                                            "created_utc": 1665619235.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Naturally and not overcompensating or overselling his talents. Like dude please cut the bs we all know why you’re here, normal doesn’t work out for you. So you have to pay someone, but if it’s because you fall short own that instead of blowing smoke up someone’s Ass it’s much more attractive and understandable. I’m able to accept my own faults as a MAN you should be able to as well.",
                                                                    "author": "Euphoric-Beginning51",
                                                                    "id": "is3b6ns",
                                                                    "parent_id": "t1_is3a4un",
                                                                    "score": 1,
                                                                    "created_utc": 1665619704.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "you be you",
                                            "author": "AlexVaickus",
                                            "id": "is3cwl3",
                                            "parent_id": "t1_is358hp",
                                            "score": 0,
                                            "created_utc": 1665620468.0,
                                            "replies": [
                                                {
                                                    "body": "For sure, not changing my energy for some weak male 😘",
                                                    "author": "Special_Garage7225",
                                                    "id": "is3oqq2",
                                                    "parent_id": "t1_is3cwl3",
                                                    "score": 2,
                                                    "created_utc": 1665625650.0,
                                                    "replies": [
                                                        {
                                                            "body": "any man would be lucky",
                                                            "author": "AlexVaickus",
                                                            "id": "is5hjgw",
                                                            "parent_id": "t1_is3oqq2",
                                                            "score": 0,
                                                            "created_utc": 1665667501.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Any man who must say, \"I am the King,\" is no true king.",
                            "author": "Tinker688",
                            "id": "is5g4rn",
                            "parent_id": "t1_is34efr",
                            "score": 2,
                            "created_utc": 1665666857.0,
                            "replies": []
                        },
                        {
                            "body": "As an alpha male I totally agree with you.",
                            "author": "mad_dabz",
                            "id": "is4yzwd",
                            "parent_id": "t1_is34efr",
                            "score": 1,
                            "created_utc": 1665656877.0,
                            "replies": [
                                {
                                    "body": "I'm agreeing with you probably because I'm extremely alpha.",
                                    "author": "mad_dabz",
                                    "id": "is4z31y",
                                    "parent_id": "t1_is4yzwd",
                                    "score": 1,
                                    "created_utc": 1665656946.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "omg!  yes!  and that \"king\" crap..   \n\nNewsflash:  Monarchy doesn't call themselves by that title when they're infants - it's bestowed upon them and reinforced by their people.\n\n&#x200B;\n\nJust be a freaking human being, bruh.",
                            "author": "Unlikely_Factor_54",
                            "id": "is58h5o",
                            "parent_id": "t1_is34efr",
                            "score": 1,
                            "created_utc": 1665663050.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Talking about sex more than once tells me he's a john, and he's dismissed.  \n\nTalking about sex frequently shows a lack of intellect, and I'm not open to other perspectives on that thank you.  \n\n..because..   ..what else you got to talk about?  ..are you this boring and one-dimensional?  \n\nThe SD that got the kitty from me didn't talk about it at all, and I was pleasantly surprised by everything he had to offer.  \\[deep breath\\]  So I don't need it to be a discussion.  It's low-qual to me and shows that you're somebody who truly needs to pay for pussy just get some.  \n\n&#x200B;\n\nTalking about sex as an SD is so beneath their networth, and that's all I ask - act like the amount of money you make or take that to some SB that isn't used to nice things.",
                    "author": "Unlikely_Factor_54",
                    "id": "is58awc",
                    "parent_id": "t1_is32m6v",
                    "score": 5,
                    "created_utc": 1665662953.0,
                    "replies": [
                        {
                            "body": "THIS !!!! I hate having the conversation period and the less we talked about it and talked about other things I wanted to give it to him more ! But definitely low quality vibes, I’d much rather let things happen naturally than to be hounded about it 24/7 go pay and escort and leave me alone",
                            "author": "Euphoric-Beginning51",
                            "id": "is58lda",
                            "parent_id": "t1_is58awc",
                            "score": 3,
                            "created_utc": 1665663115.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "is7jwyk",
            "parent_id": "t1_is2yqn7",
            "score": 0,
            "created_utc": 1665696980.0,
            "replies": [
                {
                    "body": "I’m not sure that word means what you think it means 🧐",
                    "author": "ButterFaceSB",
                    "id": "is7syvy",
                    "parent_id": "t1_is7jwyk",
                    "score": 2,
                    "created_utc": 1665700739.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They are one and the same.",
            "author": "Wildebot34",
            "id": "is52adc",
            "parent_id": "t1_is2yqn7",
            "score": -2,
            "created_utc": 1665659268.0,
            "replies": []
        },
        {
            "body": "Omg why is this soo true xD",
            "author": "madhuraksha",
            "id": "is4rvi0",
            "parent_id": "t1_is4qkgb",
            "score": 6,
            "created_utc": 1665650797.0,
            "replies": []
        },
        {
            "body": "It's them choosing to stay away from the thread instead of taking notes and making some changes.",
            "author": "Unlikely_Factor_54",
            "id": "is5984g",
            "parent_id": "t1_is4qkgb",
            "score": 3,
            "created_utc": 1665663461.0,
            "replies": []
        },
        {
            "body": "It’s ridiculous",
            "author": "Euphoric-Beginning51",
            "id": "is54g8h",
            "parent_id": "t1_is4qkgb",
            "score": 2,
            "created_utc": 1665660682.0,
            "replies": []
        },
        {
            "body": "..and a beautiful sign of Self-Respect.\n\nAppreciate you.",
            "author": "Unlikely_Factor_54",
            "id": "is59hdv",
            "parent_id": "t1_is31vle",
            "score": 4,
            "created_utc": 1665663598.0,
            "replies": []
        },
        {
            "body": "as soon as you start thinking you're a victim - you become a victim. that's just not something i want to be",
            "author": "davitech73",
            "id": "is3if4h",
            "parent_id": "t1_is31vle",
            "score": 2,
            "created_utc": 1665622875.0,
            "replies": []
        },
        {
            "body": "Wow 🤩 this was well said !!!! Every man should read this lol",
            "author": "BrunetteBunny28",
            "id": "is3so2n",
            "parent_id": "t1_is31vle",
            "score": 3,
            "created_utc": 1665627397.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "is535mg",
            "parent_id": "t1_is31vle",
            "score": 4,
            "created_utc": 1665659854.0,
            "replies": [
                {
                    "body": "Casting yourself as a victim and burying yourself in self pity is never a winning strategy. Life is not fair and some people have more disadvantages than others, but focusing on those disadvantages will only make you bitter and angry, and will guarantee you will continue to be a victim.",
                    "author": "willfromvb",
                    "id": "is54lnb",
                    "parent_id": "t1_is535mg",
                    "score": 5,
                    "created_utc": 1665660777.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "is553q3",
                            "parent_id": "t1_is54lnb",
                            "score": -1,
                            "created_utc": 1665661083.0,
                            "replies": [
                                {
                                    "body": "There is no question that Social Media has enabled people with grievances to find like minded communities to share in their grievances. When these communities look for solutions to deal with these grievances in a positive way, it can be very healthy.  Unfortunately, most of these communities have become echo chambers that only focus on being victims and not on solutions. Many of these communities have become unwitting pawns of sinister people that want to further divide and weaken society to their benefit.",
                                    "author": "willfromvb",
                                    "id": "is58ais",
                                    "parent_id": "t1_is553q3",
                                    "score": 5,
                                    "created_utc": 1665662946.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "so much pain and feelings of slight and confusion in this address..  lol.  shame.\n\n&#x200B;\n\nbe blessed!",
                    "author": "Unlikely_Factor_54",
                    "id": "is59mie",
                    "parent_id": "t1_is535mg",
                    "score": 0,
                    "created_utc": 1665663673.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I totally agree !",
            "author": "Euphoric-Beginning51",
            "id": "is331wl",
            "parent_id": "t1_is31vle",
            "score": 2,
            "created_utc": 1665616057.0,
            "replies": []
        },
        {
            "body": "That is very true. You know how to not be a creep and it’s not my job to show you that new to the bowl of not! Have the right intentions and attitude from jump because a lot of us are not tolerating the weirdo crap.",
            "author": "Euphoric-Beginning51",
            "id": "is57nqo",
            "parent_id": "t1_is57hqh",
            "score": 3,
            "created_utc": 1665662587.0,
            "replies": []
        },
        {
            "body": "Lol I have no idea BUT I totally get it ! Like I get so hot when a man has control ! Like please believe it’s such a turn on when a man knows how to not be so cringy ! Like I’m almost ready to pounce on him versus the guy that can’t shut up about it I’m dreading seeing and only lasts 5 mins lol. I hate those overcompensating types like just relax have fun and enjoy the ride JEEZ !",
            "author": "Euphoric-Beginning51",
            "id": "is32y2n",
            "parent_id": "t1_is303n5",
            "score": 1,
            "created_utc": 1665616010.0,
            "replies": []
        },
        {
            "body": "I’m not speaking on Assholes or your definition of real men! I was raised by real men, not the ones who stated don’t cry because you’re a boy, but those that could build things, fix things and still be the little spoon. A real man to me is a man who doesn’t treat women like a sex toy because he knows his value. A real man is a man who can be himself, lead and a woman’s feminine nature doesn’t threaten his masculinity. A man who can handle things and lead without being told to relax, stop being so pushy and just trust that things will happen the way they’re supposed to.",
            "author": "Euphoric-Beginning51",
            "id": "is3mrbf",
            "parent_id": "t1_is3bp62",
            "score": 7,
            "created_utc": 1665624762.0,
            "replies": [
                {
                    "body": "I like your definition!\n\nThe phrase \"real man\" has too many meanings these days.  When I was growing up, \"real men\" didn't cry, and they resorted to violence to solve conflict.  When I hear the phrase, that's the image that pops into my head.  \n\n\nI like yours much better.",
                    "author": "robhudsondfw",
                    "id": "is3nhfs",
                    "parent_id": "t1_is3mrbf",
                    "score": 5,
                    "created_utc": 1665625087.0,
                    "replies": [
                        {
                            "body": "Thank you I’ve encountered those men many times in my life and have appreciated them so much because they stand out and leave a lasting impression",
                            "author": "Euphoric-Beginning51",
                            "id": "is3phdq",
                            "parent_id": "t1_is3nhfs",
                            "score": 2,
                            "created_utc": 1665625975.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Women don’t want to hear about men’s struggles.  The BLUF is they don’t care, and telling them is an instant turn off.  They are certain that the world they live in is much tougher.",
            "author": "NVOkie9018",
            "id": "is5uwer",
            "parent_id": "t1_is51mfk",
            "score": 1,
            "created_utc": 1665673198.0,
            "replies": [
                {
                    "body": "The world women live very very likely is tougher though, data supports this. \nIt may.be not as lonely, likely is afforded a lot more emotional support and camaraderie, and is improving whereas ours isn't. But I can't sit here and pretend they've got it good either. \n\nIn Iran women are protesting not being executed for not wearing a bit of religious headwear. In the US the federal right to bodily autonomy was just revoked, a right just recently afforded the Irish in the British isles. But oh dear, men don't know to be men anymore, they cant earn enough to literally support an entire family anymore. Y'see what I'm saying? These issues are not exactly comparable.\n\nI cant imagine any smart woman secure in herself I know possibly objecting to me pointing out these issues either, not unless it had some sort of criticism of feminism baked into it. I also not saying this as a pickup line, and would hope girls didn't get turned on hearing men discuss common struggles within the roles of the modern male identity lmao.",
                    "author": "mad_dabz",
                    "id": "is6mt35",
                    "parent_id": "t1_is5uwer",
                    "score": 3,
                    "created_utc": 1665684161.0,
                    "replies": [
                        {
                            "body": "I really appreciate that you acknowledge that. I can absolutely see how it would be a case of mixed messaging, at best. And, perhaps, a scarcity of role models navigating the landscape with any degree of strength and grace. It’s hard to aim for a goal you can’t even decide on. And then, terrible women like me who claim to want one thing but actually want something rather different only know we aren’t allowed to.\n\nI also see a more sinister side in it being quite profitable to lean into this uncertainty & stoke it or twist it. I see that in the red pill crowd and the rise of Andrew Tate and a million other things. Resentment can be wildly profitable, as can the sale of a twisted sense of superiority and power where men feel they have none. Grievance and hatred of women can at least be fashioned into a seemingly coherent worldview. Sticking it to them or reigning them in a mission. And I do wonder how much men talking about women is actually men talking about an absence of the latter two things. \n\nOn the other hand, I feel that the crisis of masculinity itself, it’s focus, and it’s hold on social and cultural narratives, is itself to do with manhood being a privileged position in a way womanhood never will be. I’ve never heard, for instance, that I throw like a *boy* or I’m behaving like *a little boy* or hit like a *boy* or need to *be a woman.* There never was a coherent ideal to aspire to which would command respect. I’m either a bitch or an incompetent pushover, a slut or a prude, etc. I always knew I couldn’t win. I think men are losing their minds because for the first time, they may not either. Or at least it will be very difficult.",
                            "author": "LucyHoneychurch-",
                            "id": "isd2yv9",
                            "parent_id": "t1_is6mt35",
                            "score": 2,
                            "created_utc": 1665796060.0,
                            "replies": []
                        },
                        {
                            "body": "“One in four homeless people are women!”\n- implies that three of every four homeless people are men, but people don’t care about that.\n\nWhat’s the gender split on suicide?\nThe only men who commit suicide that anyone mentions are veterans.  The other men, meh.\n\nSentencing disparities in the American criminal justice system?  LOL, who cares.\n\nEquality hasn’t made it to divorces, and women want to keep it that way.\n\nWho makes up the vast majority (+90% in any given year) of workplace deaths?  Meh, men are disposable.\n\nWho’s getting left behind in the K-12 education system?\nBoys\n\nWho outnumbers who by 3 to 2 on American university campuses?\n\nWho is graduating with more bachelor’s masters, and doctorates?\n\nThere are scholarships that are only available to women.  No one bats an eye.  I didn’t see any scholarships that were male only when I was looking at scholarships with my son last year.",
                            "author": "NVOkie9018",
                            "id": "is6umqn",
                            "parent_id": "t1_is6mt35",
                            "score": 1,
                            "created_utc": 1665687208.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "THATS IT !",
            "author": "Euphoric-Beginning51",
            "id": "is3atzz",
            "parent_id": "t1_is39cvi",
            "score": 2,
            "created_utc": 1665619548.0,
            "replies": []
        },
        {
            "body": "Just out of curiosity - how do you then justify the entire feminist movement of the last 30 years.. I have a 16 year old son and he says to me, “Dad, I don’t want to be responsible for a whole another woman at a date or otherwise, it’s too stressful and none of the girls at school want me to be either.”…",
            "author": "Hfdadmanager",
            "id": "is3clgr",
            "parent_id": "t1_is39cvi",
            "score": 1,
            "created_utc": 1665620331.0,
            "replies": [
                {
                    "body": "I guess this is the way kids are being brought up now and I'm glad I belong to a different generation where I'm still able to date old-school men who know how to be masculine and treat a woman like a lady. I feel sorry for all these girls who will never know what it feels like to date a provider type of man.",
                    "author": "daddyslittlefuckslut",
                    "id": "is3dcpk",
                    "parent_id": "t1_is3clgr",
                    "score": 9,
                    "created_utc": 1665620662.0,
                    "replies": [
                        {
                            "body": "I definitely prefer a provider type of a man. I like men who take the lead without being domineering. I prefer old-school men anyday, anytime, who are gentlemen and know how to treat a woman like a lady. I do feel sorry for my nieces because the young men of today are too feminine and most are cheapskates looking for so-called independent women to date so they don't have to foot the bills on dates. I cannot stand the 50:50 concept of dating, especially when woman have to spend money to dole themselves up, and lose out financially when they take time out of their careers to have babies.",
                            "author": "beebee007",
                            "id": "is6x5v6",
                            "parent_id": "t1_is3dcpk",
                            "score": 4,
                            "created_utc": 1665688197.0,
                            "replies": []
                        },
                        {
                            "body": "Isn’t men and women earning approximately the same one of the major goals of an egalitarian society? The lack of male providers is a good thing, not a bad thing. It means society as a whole has more not less providers.",
                            "author": null,
                            "id": "is6l6ht",
                            "parent_id": "t1_is3dcpk",
                            "score": 2,
                            "created_utc": 1665683533.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Who has to justify the feminist movement. \n\nI taught my son to be polite and pay for the date. He is very thoughtful. He does really well for himself 😉",
                    "author": "daddoms",
                    "id": "is3l3ws",
                    "parent_id": "t1_is3clgr",
                    "score": 4,
                    "created_utc": 1665624038.0,
                    "replies": []
                },
                {
                    "body": "Why are you bringing another generation into this conversation about present-day adults?\n\n&#x200B;\n\nThat's inappropriate.  Leave children out of these conversations.",
                    "author": "Unlikely_Factor_54",
                    "id": "is5a675",
                    "parent_id": "t1_is3clgr",
                    "score": 1,
                    "created_utc": 1665663956.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So a man needs to spend a ton of cash on you to show he's a man?",
            "author": "SD1070",
            "id": "is3fs32",
            "parent_id": "t1_is39cvi",
            "score": 0,
            "created_utc": 1665621732.0,
            "replies": [
                {
                    "body": "I said:\n\n\"I WILL NOT date a man who doesn't know how to lead and who doesn't make the decisions. I don't do \"go with the flow\", I don't do last minute plans, I don't do cheap dates, I don't do low effort, I don't do 50/50\"\n\nThe only thing you were able to read in this was \"a lot of cash\". Interesting...",
                    "author": "daddyslittlefuckslut",
                    "id": "is7zeg2",
                    "parent_id": "t1_is3fs32",
                    "score": 2,
                    "created_utc": 1665703615.0,
                    "replies": [
                        {
                            "body": "Sometimes the best things in life don't cost a lot of money. I don't do cheap dates shows you think spending money is more important than the actual experience.",
                            "author": "SD1070",
                            "id": "is8ckui",
                            "parent_id": "t1_is7zeg2",
                            "score": 3,
                            "created_utc": 1665709648.0,
                            "replies": [
                                {
                                    "body": "I love how binary you are about this, like he EITHER has to spend money on me OR give me a nice experience, but not both simultaneously. To me, a man showing me he can be generous with money towards/around me is absolutely essential to my overall experience of the date and of his company in the long term. I wouldn't be sugar dating if that wasn't the case. The \"actual experience\" (in your words) might be really nice, but if it happens at McDonald's because he proposed a date there? Yeah sorry, not gonna be my thing.\n\nAlso I don't get why you're so defensive about me wanting men to give me expensive experiences. Does it affect you at a personal level or anything?",
                                    "author": "daddyslittlefuckslut",
                                    "id": "isacp2m",
                                    "parent_id": "t1_is8ckui",
                                    "score": 2,
                                    "created_utc": 1665754708.0,
                                    "replies": [
                                        {
                                            "body": "A nice hike through nature costs almost nothing and can still be a great experience.",
                                            "author": "SD1070",
                                            "id": "isadwdo",
                                            "parent_id": "t1_isacp2m",
                                            "score": 3,
                                            "created_utc": 1665755228.0,
                                            "replies": [
                                                {
                                                    "body": "I totally agree with you, you can take a self absorbed chick to places like capital grille or any over priced restaurant, or take them to unique experience that you can remember for long time.\n\nI took my date to special event in museum, and a burlesque  she had the best time of her life. It’s wasn’t the expensive place as well, but some chicks foolishly think materialism is important and will always be miserable in the long run.",
                                                    "author": "dynolas1",
                                                    "id": "iuh5ro0",
                                                    "parent_id": "t1_isadwdo",
                                                    "score": 1,
                                                    "created_utc": 1667205841.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "When males say things like this, it only shows how hurt they are; most especially when they elect to miss the point and act hard of critical thinking.\n\nThis is toxic and ineligible.\n\nNEXT?!",
                    "author": "Unlikely_Factor_54",
                    "id": "is5aevp",
                    "parent_id": "t1_is3fs32",
                    "score": 3,
                    "created_utc": 1665664083.0,
                    "replies": [
                        {
                            "body": "Not hurt at all. You didn't answer the question.",
                            "author": "SD1070",
                            "id": "is5kke0",
                            "parent_id": "t1_is5aevp",
                            "score": 2,
                            "created_utc": 1665668838.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly !!! Too many dudes have contacted me and we’re talking regularly then there’s a random ass D pic or they’re texting I can’t wait to taste you, instant turn off and I’m definitely going to let you know ! It’s weird and very desperate",
            "author": "Euphoric-Beginning51",
            "id": "is3w6t4",
            "parent_id": "t1_is3rvd8",
            "score": 3,
            "created_utc": 1665629040.0,
            "replies": [
                {
                    "body": "I rejected a SD today who could not help but say things like “wow idk if I’ll be able to control myself around you” every time we texted. Like seriously? There’s no respect of boundaries. He was an attractive older SD, I’m sure he gets away with being overly sexual just based off his looks. Mind you words like “I’m a nice guy” or “respectful gentleman” on profiles are a red flag because he had that and would not stop making sexual comments once we took the convo off the site. \n\nThou doth protest too much 🤥🧢",
                    "author": "BrunetteBunny28",
                    "id": "is4650u",
                    "parent_id": "t1_is3w6t4",
                    "score": 2,
                    "created_utc": 1665634292.0,
                    "replies": [
                        {
                            "body": "Lol same thing happened to me a guy I met IRL insisted on being a gentleman and he’s respectful and today I told him I had a stressful day and he went straight to let’s have mind blowing sex totally disregarding me, I quickly blocked him",
                            "author": "Euphoric-Beginning51",
                            "id": "is46h6g",
                            "parent_id": "t1_is4650u",
                            "score": 3,
                            "created_utc": 1665634490.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seriously. She’s the only girl who wants a respectful man!! Every other girl wants a guy who does say horny and rude shit all the time",
            "author": "luckyluckyduck",
            "id": "is63jdn",
            "parent_id": "t1_is594g0",
            "score": 1,
            "created_utc": 1665676641.0,
            "replies": []
        },
        {
            "body": "I can understand that.",
            "author": "Euphoric-Beginning51",
            "id": "is5qnvs",
            "parent_id": "t1_is5natu",
            "score": 1,
            "created_utc": 1665671461.0,
            "replies": []
        },
        {
            "body": "No everyone agrees that we’re tired of the way dudes act and have no class in the bowl.",
            "author": "Euphoric-Beginning51",
            "id": "is650kz",
            "parent_id": "t1_is641fu",
            "score": 2,
            "created_utc": 1665677231.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "is6edv9",
                    "parent_id": "t1_is650kz",
                    "score": 0,
                    "created_utc": 1665680910.0,
                    "replies": [
                        {
                            "body": "You missed the whole point of the whole post and majority of the comments from women about their experiences with “men” who act like boys and can’t control their mouths or bodies. We all have the same problem and that’s the real issue.",
                            "author": "Euphoric-Beginning51",
                            "id": "is6eu94",
                            "parent_id": "t1_is6edv9",
                            "score": 1,
                            "created_utc": 1665681087.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That has nothing to do with the current post but go off",
            "author": "Euphoric-Beginning51",
            "id": "is830m8",
            "parent_id": "t1_is81zct",
            "score": 1,
            "created_utc": 1665705299.0,
            "replies": []
        },
        {
            "body": "I also hate when men state “I’m an alpha or a dominant male”…no you aren’t. Truly Alpha men (capitalized on purpose here) don’t need to announce it, they just ARE….and are sexy as hell.",
            "author": "Special_Garage7225",
            "id": "is34efr",
            "parent_id": "t1_is32m6v",
            "score": 28,
            "created_utc": 1665616665.0,
            "replies": [
                {
                    "body": "Oh if I read “alpha” or “dominant” on a profile, it’s a hard pass. They’re basically saying they have crappy overbearing personalities in my experience and think they can talk to you aggressively. No thanks lol.",
                    "author": "BrunetteBunny28",
                    "id": "is3sb86",
                    "parent_id": "t1_is34efr",
                    "score": 22,
                    "created_utc": 1665627233.0,
                    "replies": [
                        {
                            "body": "Definitely a huge red flag for me and will be ignored ! You’re overcompensating and want to prove to someone else your dominance. It’s weird and I’m not going to submit to someone I can’t trust. Submissiveness is earned. Men stop asking women if they’re submissive and just BE dominant, be endearing, don’t disregard our feelings or simply leave us alone. Stop treating women as someone to get your D wet. Get to know the gal, pay attention, I promise it will get you way more 🫦",
                            "author": "Euphoric-Beginning51",
                            "id": "is3wy9s",
                            "parent_id": "t1_is3sb86",
                            "score": 13,
                            "created_utc": 1665629407.0,
                            "replies": [
                                {
                                    "body": "Oof a word 🙌🏼\n\nI think most men sugar because it’s easy for them to be rude, demanding, freaky af, disrespectful, selfish, greedy etc; they think money justifies it and we as SBs will accept any behavior. I’ve spoken to married SDs who say their wives are “boring” or “too demanding” so they look for a SB who makes the feel in control and let’s them try and do anything. Couldn’t be me tho ✌🏼Can’t accept certain personalities/behavior. I prefer warm, gentle, caring SDs who care if I had dinner or how my weekend was. A SR with some type of substance and mutual respect",
                                    "author": "BrunetteBunny28",
                                    "id": "is46v5o",
                                    "parent_id": "t1_is3wy9s",
                                    "score": 11,
                                    "created_utc": 1665634719.0,
                                    "replies": [
                                        {
                                            "body": "That’s the ONLY SR I want!!! I tend to stay away from\nmarried men because of this exact reason. You put a ring on it you married her for the wrong reasons I will not be at fault for that ! Also I don’t like being the scapegoat for another woman’s failures. I want to be the center of your attention as you are mine in the time we’re together or speaking. Men think because they’re paying you, YOU have to do whatever they say because their wives won’t lol wrong woman. Not happening",
                                            "author": "Euphoric-Beginning51",
                                            "id": "is47abo",
                                            "parent_id": "t1_is46v5o",
                                            "score": 7,
                                            "created_utc": 1665634973.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I just called an SD out for that. Instead of having an adult conversation about it, he threw a huge tantrum and ran for the hills.",
                                            "author": "MapleSappling",
                                            "id": "it636lf",
                                            "parent_id": "t1_is46v5o",
                                            "score": 1,
                                            "created_utc": 1666328632.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes !!! Every profile has “dominant” in it and they aren’t the least bit dominant only in their mind and want to have the nerve to try to control you BLAH ! I’m submissive in a sense but not naturally you have to have that demeanor that demands submissiveness and most men don’t have that",
                    "author": "Euphoric-Beginning51",
                    "id": "is3508e",
                    "parent_id": "t1_is34efr",
                    "score": 11,
                    "created_utc": 1665616935.0,
                    "replies": [
                        {
                            "body": "100%…I’m basically more of an ‘alpha’ female, so a naturally dominant man is extremely attractive and makes me want to be more submissive…I can’t just ‘be’ submissive.",
                            "author": "Special_Garage7225",
                            "id": "is358hp",
                            "parent_id": "t1_is3508e",
                            "score": 5,
                            "created_utc": 1665617038.0,
                            "replies": [
                                {
                                    "body": "Me as well, I try to be submissive but if you’re faking the funk I’m definitely either ✌🏾 or ignoring you not really interested but a man that commands the room, leaves my panties drenched. Whew ! lol",
                                    "author": "Euphoric-Beginning51",
                                    "id": "is35slx",
                                    "parent_id": "t1_is358hp",
                                    "score": 2,
                                    "created_utc": 1665617289.0,
                                    "replies": [
                                        {
                                            "body": "Hating on masculinity is what got us in this situation where meeting a man who can lead is nearly a miracle, by the way.",
                                            "author": "daddyslittlefuckslut",
                                            "id": "is39q6q",
                                            "parent_id": "t1_is35slx",
                                            "score": 4,
                                            "created_utc": 1665619051.0,
                                            "replies": [
                                                {
                                                    "body": "This…100%. I never understood why women nowadays can’t just thank a man for opening her door or giving her a compliment without it being some ‘slight against feminism’…like REALLY?!",
                                                    "author": "Special_Garage7225",
                                                    "id": "is6l7ku",
                                                    "parent_id": "t1_is39q6q",
                                                    "score": 5,
                                                    "created_utc": 1665683544.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "It’s so hard to meet a man who is natural masculine!",
                                                    "author": "Euphoric-Beginning51",
                                                    "id": "is3axq7",
                                                    "parent_id": "t1_is39q6q",
                                                    "score": 2,
                                                    "created_utc": 1665619594.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Facts !!",
                                                    "author": "Euphoric-Beginning51",
                                                    "id": "is3a4un",
                                                    "parent_id": "t1_is39q6q",
                                                    "score": 1,
                                                    "created_utc": 1665619235.0,
                                                    "replies": [
                                                        {
                                                            "body": "Naturally and not overcompensating or overselling his talents. Like dude please cut the bs we all know why you’re here, normal doesn’t work out for you. So you have to pay someone, but if it’s because you fall short own that instead of blowing smoke up someone’s Ass it’s much more attractive and understandable. I’m able to accept my own faults as a MAN you should be able to as well.",
                                                            "author": "Euphoric-Beginning51",
                                                            "id": "is3b6ns",
                                                            "parent_id": "t1_is3a4un",
                                                            "score": 1,
                                                            "created_utc": 1665619704.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "you be you",
                                    "author": "AlexVaickus",
                                    "id": "is3cwl3",
                                    "parent_id": "t1_is358hp",
                                    "score": 0,
                                    "created_utc": 1665620468.0,
                                    "replies": [
                                        {
                                            "body": "For sure, not changing my energy for some weak male 😘",
                                            "author": "Special_Garage7225",
                                            "id": "is3oqq2",
                                            "parent_id": "t1_is3cwl3",
                                            "score": 2,
                                            "created_utc": 1665625650.0,
                                            "replies": [
                                                {
                                                    "body": "any man would be lucky",
                                                    "author": "AlexVaickus",
                                                    "id": "is5hjgw",
                                                    "parent_id": "t1_is3oqq2",
                                                    "score": 0,
                                                    "created_utc": 1665667501.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Any man who must say, \"I am the King,\" is no true king.",
                    "author": "Tinker688",
                    "id": "is5g4rn",
                    "parent_id": "t1_is34efr",
                    "score": 2,
                    "created_utc": 1665666857.0,
                    "replies": []
                },
                {
                    "body": "As an alpha male I totally agree with you.",
                    "author": "mad_dabz",
                    "id": "is4yzwd",
                    "parent_id": "t1_is34efr",
                    "score": 1,
                    "created_utc": 1665656877.0,
                    "replies": [
                        {
                            "body": "I'm agreeing with you probably because I'm extremely alpha.",
                            "author": "mad_dabz",
                            "id": "is4z31y",
                            "parent_id": "t1_is4yzwd",
                            "score": 1,
                            "created_utc": 1665656946.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "omg!  yes!  and that \"king\" crap..   \n\nNewsflash:  Monarchy doesn't call themselves by that title when they're infants - it's bestowed upon them and reinforced by their people.\n\n&#x200B;\n\nJust be a freaking human being, bruh.",
                    "author": "Unlikely_Factor_54",
                    "id": "is58h5o",
                    "parent_id": "t1_is34efr",
                    "score": 1,
                    "created_utc": 1665663050.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Talking about sex more than once tells me he's a john, and he's dismissed.  \n\nTalking about sex frequently shows a lack of intellect, and I'm not open to other perspectives on that thank you.  \n\n..because..   ..what else you got to talk about?  ..are you this boring and one-dimensional?  \n\nThe SD that got the kitty from me didn't talk about it at all, and I was pleasantly surprised by everything he had to offer.  \\[deep breath\\]  So I don't need it to be a discussion.  It's low-qual to me and shows that you're somebody who truly needs to pay for pussy just get some.  \n\n&#x200B;\n\nTalking about sex as an SD is so beneath their networth, and that's all I ask - act like the amount of money you make or take that to some SB that isn't used to nice things.",
            "author": "Unlikely_Factor_54",
            "id": "is58awc",
            "parent_id": "t1_is32m6v",
            "score": 5,
            "created_utc": 1665662953.0,
            "replies": [
                {
                    "body": "THIS !!!! I hate having the conversation period and the less we talked about it and talked about other things I wanted to give it to him more ! But definitely low quality vibes, I’d much rather let things happen naturally than to be hounded about it 24/7 go pay and escort and leave me alone",
                    "author": "Euphoric-Beginning51",
                    "id": "is58lda",
                    "parent_id": "t1_is58awc",
                    "score": 3,
                    "created_utc": 1665663115.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m not sure that word means what you think it means 🧐",
            "author": "ButterFaceSB",
            "id": "is7syvy",
            "parent_id": "t1_is7jwyk",
            "score": 2,
            "created_utc": 1665700739.0,
            "replies": []
        },
        {
            "body": "Casting yourself as a victim and burying yourself in self pity is never a winning strategy. Life is not fair and some people have more disadvantages than others, but focusing on those disadvantages will only make you bitter and angry, and will guarantee you will continue to be a victim.",
            "author": "willfromvb",
            "id": "is54lnb",
            "parent_id": "t1_is535mg",
            "score": 5,
            "created_utc": 1665660777.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "is553q3",
                    "parent_id": "t1_is54lnb",
                    "score": -1,
                    "created_utc": 1665661083.0,
                    "replies": [
                        {
                            "body": "There is no question that Social Media has enabled people with grievances to find like minded communities to share in their grievances. When these communities look for solutions to deal with these grievances in a positive way, it can be very healthy.  Unfortunately, most of these communities have become echo chambers that only focus on being victims and not on solutions. Many of these communities have become unwitting pawns of sinister people that want to further divide and weaken society to their benefit.",
                            "author": "willfromvb",
                            "id": "is58ais",
                            "parent_id": "t1_is553q3",
                            "score": 5,
                            "created_utc": 1665662946.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "so much pain and feelings of slight and confusion in this address..  lol.  shame.\n\n&#x200B;\n\nbe blessed!",
            "author": "Unlikely_Factor_54",
            "id": "is59mie",
            "parent_id": "t1_is535mg",
            "score": 0,
            "created_utc": 1665663673.0,
            "replies": []
        },
        {
            "body": "I like your definition!\n\nThe phrase \"real man\" has too many meanings these days.  When I was growing up, \"real men\" didn't cry, and they resorted to violence to solve conflict.  When I hear the phrase, that's the image that pops into my head.  \n\n\nI like yours much better.",
            "author": "robhudsondfw",
            "id": "is3nhfs",
            "parent_id": "t1_is3mrbf",
            "score": 5,
            "created_utc": 1665625087.0,
            "replies": [
                {
                    "body": "Thank you I’ve encountered those men many times in my life and have appreciated them so much because they stand out and leave a lasting impression",
                    "author": "Euphoric-Beginning51",
                    "id": "is3phdq",
                    "parent_id": "t1_is3nhfs",
                    "score": 2,
                    "created_utc": 1665625975.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The world women live very very likely is tougher though, data supports this. \nIt may.be not as lonely, likely is afforded a lot more emotional support and camaraderie, and is improving whereas ours isn't. But I can't sit here and pretend they've got it good either. \n\nIn Iran women are protesting not being executed for not wearing a bit of religious headwear. In the US the federal right to bodily autonomy was just revoked, a right just recently afforded the Irish in the British isles. But oh dear, men don't know to be men anymore, they cant earn enough to literally support an entire family anymore. Y'see what I'm saying? These issues are not exactly comparable.\n\nI cant imagine any smart woman secure in herself I know possibly objecting to me pointing out these issues either, not unless it had some sort of criticism of feminism baked into it. I also not saying this as a pickup line, and would hope girls didn't get turned on hearing men discuss common struggles within the roles of the modern male identity lmao.",
            "author": "mad_dabz",
            "id": "is6mt35",
            "parent_id": "t1_is5uwer",
            "score": 3,
            "created_utc": 1665684161.0,
            "replies": [
                {
                    "body": "I really appreciate that you acknowledge that. I can absolutely see how it would be a case of mixed messaging, at best. And, perhaps, a scarcity of role models navigating the landscape with any degree of strength and grace. It’s hard to aim for a goal you can’t even decide on. And then, terrible women like me who claim to want one thing but actually want something rather different only know we aren’t allowed to.\n\nI also see a more sinister side in it being quite profitable to lean into this uncertainty & stoke it or twist it. I see that in the red pill crowd and the rise of Andrew Tate and a million other things. Resentment can be wildly profitable, as can the sale of a twisted sense of superiority and power where men feel they have none. Grievance and hatred of women can at least be fashioned into a seemingly coherent worldview. Sticking it to them or reigning them in a mission. And I do wonder how much men talking about women is actually men talking about an absence of the latter two things. \n\nOn the other hand, I feel that the crisis of masculinity itself, it’s focus, and it’s hold on social and cultural narratives, is itself to do with manhood being a privileged position in a way womanhood never will be. I’ve never heard, for instance, that I throw like a *boy* or I’m behaving like *a little boy* or hit like a *boy* or need to *be a woman.* There never was a coherent ideal to aspire to which would command respect. I’m either a bitch or an incompetent pushover, a slut or a prude, etc. I always knew I couldn’t win. I think men are losing their minds because for the first time, they may not either. Or at least it will be very difficult.",
                    "author": "LucyHoneychurch-",
                    "id": "isd2yv9",
                    "parent_id": "t1_is6mt35",
                    "score": 2,
                    "created_utc": 1665796060.0,
                    "replies": []
                },
                {
                    "body": "“One in four homeless people are women!”\n- implies that three of every four homeless people are men, but people don’t care about that.\n\nWhat’s the gender split on suicide?\nThe only men who commit suicide that anyone mentions are veterans.  The other men, meh.\n\nSentencing disparities in the American criminal justice system?  LOL, who cares.\n\nEquality hasn’t made it to divorces, and women want to keep it that way.\n\nWho makes up the vast majority (+90% in any given year) of workplace deaths?  Meh, men are disposable.\n\nWho’s getting left behind in the K-12 education system?\nBoys\n\nWho outnumbers who by 3 to 2 on American university campuses?\n\nWho is graduating with more bachelor’s masters, and doctorates?\n\nThere are scholarships that are only available to women.  No one bats an eye.  I didn’t see any scholarships that were male only when I was looking at scholarships with my son last year.",
                    "author": "NVOkie9018",
                    "id": "is6umqn",
                    "parent_id": "t1_is6mt35",
                    "score": 1,
                    "created_utc": 1665687208.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I guess this is the way kids are being brought up now and I'm glad I belong to a different generation where I'm still able to date old-school men who know how to be masculine and treat a woman like a lady. I feel sorry for all these girls who will never know what it feels like to date a provider type of man.",
            "author": "daddyslittlefuckslut",
            "id": "is3dcpk",
            "parent_id": "t1_is3clgr",
            "score": 9,
            "created_utc": 1665620662.0,
            "replies": [
                {
                    "body": "I definitely prefer a provider type of a man. I like men who take the lead without being domineering. I prefer old-school men anyday, anytime, who are gentlemen and know how to treat a woman like a lady. I do feel sorry for my nieces because the young men of today are too feminine and most are cheapskates looking for so-called independent women to date so they don't have to foot the bills on dates. I cannot stand the 50:50 concept of dating, especially when woman have to spend money to dole themselves up, and lose out financially when they take time out of their careers to have babies.",
                    "author": "beebee007",
                    "id": "is6x5v6",
                    "parent_id": "t1_is3dcpk",
                    "score": 4,
                    "created_utc": 1665688197.0,
                    "replies": []
                },
                {
                    "body": "Isn’t men and women earning approximately the same one of the major goals of an egalitarian society? The lack of male providers is a good thing, not a bad thing. It means society as a whole has more not less providers.",
                    "author": null,
                    "id": "is6l6ht",
                    "parent_id": "t1_is3dcpk",
                    "score": 2,
                    "created_utc": 1665683533.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Who has to justify the feminist movement. \n\nI taught my son to be polite and pay for the date. He is very thoughtful. He does really well for himself 😉",
            "author": "daddoms",
            "id": "is3l3ws",
            "parent_id": "t1_is3clgr",
            "score": 4,
            "created_utc": 1665624038.0,
            "replies": []
        },
        {
            "body": "Why are you bringing another generation into this conversation about present-day adults?\n\n&#x200B;\n\nThat's inappropriate.  Leave children out of these conversations.",
            "author": "Unlikely_Factor_54",
            "id": "is5a675",
            "parent_id": "t1_is3clgr",
            "score": 1,
            "created_utc": 1665663956.0,
            "replies": []
        },
        {
            "body": "I said:\n\n\"I WILL NOT date a man who doesn't know how to lead and who doesn't make the decisions. I don't do \"go with the flow\", I don't do last minute plans, I don't do cheap dates, I don't do low effort, I don't do 50/50\"\n\nThe only thing you were able to read in this was \"a lot of cash\". Interesting...",
            "author": "daddyslittlefuckslut",
            "id": "is7zeg2",
            "parent_id": "t1_is3fs32",
            "score": 2,
            "created_utc": 1665703615.0,
            "replies": [
                {
                    "body": "Sometimes the best things in life don't cost a lot of money. I don't do cheap dates shows you think spending money is more important than the actual experience.",
                    "author": "SD1070",
                    "id": "is8ckui",
                    "parent_id": "t1_is7zeg2",
                    "score": 3,
                    "created_utc": 1665709648.0,
                    "replies": [
                        {
                            "body": "I love how binary you are about this, like he EITHER has to spend money on me OR give me a nice experience, but not both simultaneously. To me, a man showing me he can be generous with money towards/around me is absolutely essential to my overall experience of the date and of his company in the long term. I wouldn't be sugar dating if that wasn't the case. The \"actual experience\" (in your words) might be really nice, but if it happens at McDonald's because he proposed a date there? Yeah sorry, not gonna be my thing.\n\nAlso I don't get why you're so defensive about me wanting men to give me expensive experiences. Does it affect you at a personal level or anything?",
                            "author": "daddyslittlefuckslut",
                            "id": "isacp2m",
                            "parent_id": "t1_is8ckui",
                            "score": 2,
                            "created_utc": 1665754708.0,
                            "replies": [
                                {
                                    "body": "A nice hike through nature costs almost nothing and can still be a great experience.",
                                    "author": "SD1070",
                                    "id": "isadwdo",
                                    "parent_id": "t1_isacp2m",
                                    "score": 3,
                                    "created_utc": 1665755228.0,
                                    "replies": [
                                        {
                                            "body": "I totally agree with you, you can take a self absorbed chick to places like capital grille or any over priced restaurant, or take them to unique experience that you can remember for long time.\n\nI took my date to special event in museum, and a burlesque  she had the best time of her life. It’s wasn’t the expensive place as well, but some chicks foolishly think materialism is important and will always be miserable in the long run.",
                                            "author": "dynolas1",
                                            "id": "iuh5ro0",
                                            "parent_id": "t1_isadwdo",
                                            "score": 1,
                                            "created_utc": 1667205841.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "When males say things like this, it only shows how hurt they are; most especially when they elect to miss the point and act hard of critical thinking.\n\nThis is toxic and ineligible.\n\nNEXT?!",
            "author": "Unlikely_Factor_54",
            "id": "is5aevp",
            "parent_id": "t1_is3fs32",
            "score": 3,
            "created_utc": 1665664083.0,
            "replies": [
                {
                    "body": "Not hurt at all. You didn't answer the question.",
                    "author": "SD1070",
                    "id": "is5kke0",
                    "parent_id": "t1_is5aevp",
                    "score": 2,
                    "created_utc": 1665668838.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I rejected a SD today who could not help but say things like “wow idk if I’ll be able to control myself around you” every time we texted. Like seriously? There’s no respect of boundaries. He was an attractive older SD, I’m sure he gets away with being overly sexual just based off his looks. Mind you words like “I’m a nice guy” or “respectful gentleman” on profiles are a red flag because he had that and would not stop making sexual comments once we took the convo off the site. \n\nThou doth protest too much 🤥🧢",
            "author": "BrunetteBunny28",
            "id": "is4650u",
            "parent_id": "t1_is3w6t4",
            "score": 2,
            "created_utc": 1665634292.0,
            "replies": [
                {
                    "body": "Lol same thing happened to me a guy I met IRL insisted on being a gentleman and he’s respectful and today I told him I had a stressful day and he went straight to let’s have mind blowing sex totally disregarding me, I quickly blocked him",
                    "author": "Euphoric-Beginning51",
                    "id": "is46h6g",
                    "parent_id": "t1_is4650u",
                    "score": 3,
                    "created_utc": 1665634490.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "is6edv9",
            "parent_id": "t1_is650kz",
            "score": 0,
            "created_utc": 1665680910.0,
            "replies": [
                {
                    "body": "You missed the whole point of the whole post and majority of the comments from women about their experiences with “men” who act like boys and can’t control their mouths or bodies. We all have the same problem and that’s the real issue.",
                    "author": "Euphoric-Beginning51",
                    "id": "is6eu94",
                    "parent_id": "t1_is6edv9",
                    "score": 1,
                    "created_utc": 1665681087.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh if I read “alpha” or “dominant” on a profile, it’s a hard pass. They’re basically saying they have crappy overbearing personalities in my experience and think they can talk to you aggressively. No thanks lol.",
            "author": "BrunetteBunny28",
            "id": "is3sb86",
            "parent_id": "t1_is34efr",
            "score": 22,
            "created_utc": 1665627233.0,
            "replies": [
                {
                    "body": "Definitely a huge red flag for me and will be ignored ! You’re overcompensating and want to prove to someone else your dominance. It’s weird and I’m not going to submit to someone I can’t trust. Submissiveness is earned. Men stop asking women if they’re submissive and just BE dominant, be endearing, don’t disregard our feelings or simply leave us alone. Stop treating women as someone to get your D wet. Get to know the gal, pay attention, I promise it will get you way more 🫦",
                    "author": "Euphoric-Beginning51",
                    "id": "is3wy9s",
                    "parent_id": "t1_is3sb86",
                    "score": 13,
                    "created_utc": 1665629407.0,
                    "replies": [
                        {
                            "body": "Oof a word 🙌🏼\n\nI think most men sugar because it’s easy for them to be rude, demanding, freaky af, disrespectful, selfish, greedy etc; they think money justifies it and we as SBs will accept any behavior. I’ve spoken to married SDs who say their wives are “boring” or “too demanding” so they look for a SB who makes the feel in control and let’s them try and do anything. Couldn’t be me tho ✌🏼Can’t accept certain personalities/behavior. I prefer warm, gentle, caring SDs who care if I had dinner or how my weekend was. A SR with some type of substance and mutual respect",
                            "author": "BrunetteBunny28",
                            "id": "is46v5o",
                            "parent_id": "t1_is3wy9s",
                            "score": 11,
                            "created_utc": 1665634719.0,
                            "replies": [
                                {
                                    "body": "That’s the ONLY SR I want!!! I tend to stay away from\nmarried men because of this exact reason. You put a ring on it you married her for the wrong reasons I will not be at fault for that ! Also I don’t like being the scapegoat for another woman’s failures. I want to be the center of your attention as you are mine in the time we’re together or speaking. Men think because they’re paying you, YOU have to do whatever they say because their wives won’t lol wrong woman. Not happening",
                                    "author": "Euphoric-Beginning51",
                                    "id": "is47abo",
                                    "parent_id": "t1_is46v5o",
                                    "score": 7,
                                    "created_utc": 1665634973.0,
                                    "replies": []
                                },
                                {
                                    "body": "I just called an SD out for that. Instead of having an adult conversation about it, he threw a huge tantrum and ran for the hills.",
                                    "author": "MapleSappling",
                                    "id": "it636lf",
                                    "parent_id": "t1_is46v5o",
                                    "score": 1,
                                    "created_utc": 1666328632.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes !!! Every profile has “dominant” in it and they aren’t the least bit dominant only in their mind and want to have the nerve to try to control you BLAH ! I’m submissive in a sense but not naturally you have to have that demeanor that demands submissiveness and most men don’t have that",
            "author": "Euphoric-Beginning51",
            "id": "is3508e",
            "parent_id": "t1_is34efr",
            "score": 11,
            "created_utc": 1665616935.0,
            "replies": [
                {
                    "body": "100%…I’m basically more of an ‘alpha’ female, so a naturally dominant man is extremely attractive and makes me want to be more submissive…I can’t just ‘be’ submissive.",
                    "author": "Special_Garage7225",
                    "id": "is358hp",
                    "parent_id": "t1_is3508e",
                    "score": 5,
                    "created_utc": 1665617038.0,
                    "replies": [
                        {
                            "body": "Me as well, I try to be submissive but if you’re faking the funk I’m definitely either ✌🏾 or ignoring you not really interested but a man that commands the room, leaves my panties drenched. Whew ! lol",
                            "author": "Euphoric-Beginning51",
                            "id": "is35slx",
                            "parent_id": "t1_is358hp",
                            "score": 2,
                            "created_utc": 1665617289.0,
                            "replies": [
                                {
                                    "body": "Hating on masculinity is what got us in this situation where meeting a man who can lead is nearly a miracle, by the way.",
                                    "author": "daddyslittlefuckslut",
                                    "id": "is39q6q",
                                    "parent_id": "t1_is35slx",
                                    "score": 4,
                                    "created_utc": 1665619051.0,
                                    "replies": [
                                        {
                                            "body": "This…100%. I never understood why women nowadays can’t just thank a man for opening her door or giving her a compliment without it being some ‘slight against feminism’…like REALLY?!",
                                            "author": "Special_Garage7225",
                                            "id": "is6l7ku",
                                            "parent_id": "t1_is39q6q",
                                            "score": 5,
                                            "created_utc": 1665683544.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "It’s so hard to meet a man who is natural masculine!",
                                            "author": "Euphoric-Beginning51",
                                            "id": "is3axq7",
                                            "parent_id": "t1_is39q6q",
                                            "score": 2,
                                            "created_utc": 1665619594.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Facts !!",
                                            "author": "Euphoric-Beginning51",
                                            "id": "is3a4un",
                                            "parent_id": "t1_is39q6q",
                                            "score": 1,
                                            "created_utc": 1665619235.0,
                                            "replies": [
                                                {
                                                    "body": "Naturally and not overcompensating or overselling his talents. Like dude please cut the bs we all know why you’re here, normal doesn’t work out for you. So you have to pay someone, but if it’s because you fall short own that instead of blowing smoke up someone’s Ass it’s much more attractive and understandable. I’m able to accept my own faults as a MAN you should be able to as well.",
                                                    "author": "Euphoric-Beginning51",
                                                    "id": "is3b6ns",
                                                    "parent_id": "t1_is3a4un",
                                                    "score": 1,
                                                    "created_utc": 1665619704.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "you be you",
                            "author": "AlexVaickus",
                            "id": "is3cwl3",
                            "parent_id": "t1_is358hp",
                            "score": 0,
                            "created_utc": 1665620468.0,
                            "replies": [
                                {
                                    "body": "For sure, not changing my energy for some weak male 😘",
                                    "author": "Special_Garage7225",
                                    "id": "is3oqq2",
                                    "parent_id": "t1_is3cwl3",
                                    "score": 2,
                                    "created_utc": 1665625650.0,
                                    "replies": [
                                        {
                                            "body": "any man would be lucky",
                                            "author": "AlexVaickus",
                                            "id": "is5hjgw",
                                            "parent_id": "t1_is3oqq2",
                                            "score": 0,
                                            "created_utc": 1665667501.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Any man who must say, \"I am the King,\" is no true king.",
            "author": "Tinker688",
            "id": "is5g4rn",
            "parent_id": "t1_is34efr",
            "score": 2,
            "created_utc": 1665666857.0,
            "replies": []
        },
        {
            "body": "As an alpha male I totally agree with you.",
            "author": "mad_dabz",
            "id": "is4yzwd",
            "parent_id": "t1_is34efr",
            "score": 1,
            "created_utc": 1665656877.0,
            "replies": [
                {
                    "body": "I'm agreeing with you probably because I'm extremely alpha.",
                    "author": "mad_dabz",
                    "id": "is4z31y",
                    "parent_id": "t1_is4yzwd",
                    "score": 1,
                    "created_utc": 1665656946.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "omg!  yes!  and that \"king\" crap..   \n\nNewsflash:  Monarchy doesn't call themselves by that title when they're infants - it's bestowed upon them and reinforced by their people.\n\n&#x200B;\n\nJust be a freaking human being, bruh.",
            "author": "Unlikely_Factor_54",
            "id": "is58h5o",
            "parent_id": "t1_is34efr",
            "score": 1,
            "created_utc": 1665663050.0,
            "replies": []
        },
        {
            "body": "THIS !!!! I hate having the conversation period and the less we talked about it and talked about other things I wanted to give it to him more ! But definitely low quality vibes, I’d much rather let things happen naturally than to be hounded about it 24/7 go pay and escort and leave me alone",
            "author": "Euphoric-Beginning51",
            "id": "is58lda",
            "parent_id": "t1_is58awc",
            "score": 3,
            "created_utc": 1665663115.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "is553q3",
            "parent_id": "t1_is54lnb",
            "score": -1,
            "created_utc": 1665661083.0,
            "replies": [
                {
                    "body": "There is no question that Social Media has enabled people with grievances to find like minded communities to share in their grievances. When these communities look for solutions to deal with these grievances in a positive way, it can be very healthy.  Unfortunately, most of these communities have become echo chambers that only focus on being victims and not on solutions. Many of these communities have become unwitting pawns of sinister people that want to further divide and weaken society to their benefit.",
                    "author": "willfromvb",
                    "id": "is58ais",
                    "parent_id": "t1_is553q3",
                    "score": 5,
                    "created_utc": 1665662946.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you I’ve encountered those men many times in my life and have appreciated them so much because they stand out and leave a lasting impression",
            "author": "Euphoric-Beginning51",
            "id": "is3phdq",
            "parent_id": "t1_is3nhfs",
            "score": 2,
            "created_utc": 1665625975.0,
            "replies": []
        },
        {
            "body": "I really appreciate that you acknowledge that. I can absolutely see how it would be a case of mixed messaging, at best. And, perhaps, a scarcity of role models navigating the landscape with any degree of strength and grace. It’s hard to aim for a goal you can’t even decide on. And then, terrible women like me who claim to want one thing but actually want something rather different only know we aren’t allowed to.\n\nI also see a more sinister side in it being quite profitable to lean into this uncertainty & stoke it or twist it. I see that in the red pill crowd and the rise of Andrew Tate and a million other things. Resentment can be wildly profitable, as can the sale of a twisted sense of superiority and power where men feel they have none. Grievance and hatred of women can at least be fashioned into a seemingly coherent worldview. Sticking it to them or reigning them in a mission. And I do wonder how much men talking about women is actually men talking about an absence of the latter two things. \n\nOn the other hand, I feel that the crisis of masculinity itself, it’s focus, and it’s hold on social and cultural narratives, is itself to do with manhood being a privileged position in a way womanhood never will be. I’ve never heard, for instance, that I throw like a *boy* or I’m behaving like *a little boy* or hit like a *boy* or need to *be a woman.* There never was a coherent ideal to aspire to which would command respect. I’m either a bitch or an incompetent pushover, a slut or a prude, etc. I always knew I couldn’t win. I think men are losing their minds because for the first time, they may not either. Or at least it will be very difficult.",
            "author": "LucyHoneychurch-",
            "id": "isd2yv9",
            "parent_id": "t1_is6mt35",
            "score": 2,
            "created_utc": 1665796060.0,
            "replies": []
        },
        {
            "body": "“One in four homeless people are women!”\n- implies that three of every four homeless people are men, but people don’t care about that.\n\nWhat’s the gender split on suicide?\nThe only men who commit suicide that anyone mentions are veterans.  The other men, meh.\n\nSentencing disparities in the American criminal justice system?  LOL, who cares.\n\nEquality hasn’t made it to divorces, and women want to keep it that way.\n\nWho makes up the vast majority (+90% in any given year) of workplace deaths?  Meh, men are disposable.\n\nWho’s getting left behind in the K-12 education system?\nBoys\n\nWho outnumbers who by 3 to 2 on American university campuses?\n\nWho is graduating with more bachelor’s masters, and doctorates?\n\nThere are scholarships that are only available to women.  No one bats an eye.  I didn’t see any scholarships that were male only when I was looking at scholarships with my son last year.",
            "author": "NVOkie9018",
            "id": "is6umqn",
            "parent_id": "t1_is6mt35",
            "score": 1,
            "created_utc": 1665687208.0,
            "replies": []
        },
        {
            "body": "I definitely prefer a provider type of a man. I like men who take the lead without being domineering. I prefer old-school men anyday, anytime, who are gentlemen and know how to treat a woman like a lady. I do feel sorry for my nieces because the young men of today are too feminine and most are cheapskates looking for so-called independent women to date so they don't have to foot the bills on dates. I cannot stand the 50:50 concept of dating, especially when woman have to spend money to dole themselves up, and lose out financially when they take time out of their careers to have babies.",
            "author": "beebee007",
            "id": "is6x5v6",
            "parent_id": "t1_is3dcpk",
            "score": 4,
            "created_utc": 1665688197.0,
            "replies": []
        },
        {
            "body": "Isn’t men and women earning approximately the same one of the major goals of an egalitarian society? The lack of male providers is a good thing, not a bad thing. It means society as a whole has more not less providers.",
            "author": null,
            "id": "is6l6ht",
            "parent_id": "t1_is3dcpk",
            "score": 2,
            "created_utc": 1665683533.0,
            "replies": []
        },
        {
            "body": "Sometimes the best things in life don't cost a lot of money. I don't do cheap dates shows you think spending money is more important than the actual experience.",
            "author": "SD1070",
            "id": "is8ckui",
            "parent_id": "t1_is7zeg2",
            "score": 3,
            "created_utc": 1665709648.0,
            "replies": [
                {
                    "body": "I love how binary you are about this, like he EITHER has to spend money on me OR give me a nice experience, but not both simultaneously. To me, a man showing me he can be generous with money towards/around me is absolutely essential to my overall experience of the date and of his company in the long term. I wouldn't be sugar dating if that wasn't the case. The \"actual experience\" (in your words) might be really nice, but if it happens at McDonald's because he proposed a date there? Yeah sorry, not gonna be my thing.\n\nAlso I don't get why you're so defensive about me wanting men to give me expensive experiences. Does it affect you at a personal level or anything?",
                    "author": "daddyslittlefuckslut",
                    "id": "isacp2m",
                    "parent_id": "t1_is8ckui",
                    "score": 2,
                    "created_utc": 1665754708.0,
                    "replies": [
                        {
                            "body": "A nice hike through nature costs almost nothing and can still be a great experience.",
                            "author": "SD1070",
                            "id": "isadwdo",
                            "parent_id": "t1_isacp2m",
                            "score": 3,
                            "created_utc": 1665755228.0,
                            "replies": [
                                {
                                    "body": "I totally agree with you, you can take a self absorbed chick to places like capital grille or any over priced restaurant, or take them to unique experience that you can remember for long time.\n\nI took my date to special event in museum, and a burlesque  she had the best time of her life. It’s wasn’t the expensive place as well, but some chicks foolishly think materialism is important and will always be miserable in the long run.",
                                    "author": "dynolas1",
                                    "id": "iuh5ro0",
                                    "parent_id": "t1_isadwdo",
                                    "score": 1,
                                    "created_utc": 1667205841.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not hurt at all. You didn't answer the question.",
            "author": "SD1070",
            "id": "is5kke0",
            "parent_id": "t1_is5aevp",
            "score": 2,
            "created_utc": 1665668838.0,
            "replies": []
        },
        {
            "body": "Lol same thing happened to me a guy I met IRL insisted on being a gentleman and he’s respectful and today I told him I had a stressful day and he went straight to let’s have mind blowing sex totally disregarding me, I quickly blocked him",
            "author": "Euphoric-Beginning51",
            "id": "is46h6g",
            "parent_id": "t1_is4650u",
            "score": 3,
            "created_utc": 1665634490.0,
            "replies": []
        },
        {
            "body": "You missed the whole point of the whole post and majority of the comments from women about their experiences with “men” who act like boys and can’t control their mouths or bodies. We all have the same problem and that’s the real issue.",
            "author": "Euphoric-Beginning51",
            "id": "is6eu94",
            "parent_id": "t1_is6edv9",
            "score": 1,
            "created_utc": 1665681087.0,
            "replies": []
        },
        {
            "body": "Definitely a huge red flag for me and will be ignored ! You’re overcompensating and want to prove to someone else your dominance. It’s weird and I’m not going to submit to someone I can’t trust. Submissiveness is earned. Men stop asking women if they’re submissive and just BE dominant, be endearing, don’t disregard our feelings or simply leave us alone. Stop treating women as someone to get your D wet. Get to know the gal, pay attention, I promise it will get you way more 🫦",
            "author": "Euphoric-Beginning51",
            "id": "is3wy9s",
            "parent_id": "t1_is3sb86",
            "score": 13,
            "created_utc": 1665629407.0,
            "replies": [
                {
                    "body": "Oof a word 🙌🏼\n\nI think most men sugar because it’s easy for them to be rude, demanding, freaky af, disrespectful, selfish, greedy etc; they think money justifies it and we as SBs will accept any behavior. I’ve spoken to married SDs who say their wives are “boring” or “too demanding” so they look for a SB who makes the feel in control and let’s them try and do anything. Couldn’t be me tho ✌🏼Can’t accept certain personalities/behavior. I prefer warm, gentle, caring SDs who care if I had dinner or how my weekend was. A SR with some type of substance and mutual respect",
                    "author": "BrunetteBunny28",
                    "id": "is46v5o",
                    "parent_id": "t1_is3wy9s",
                    "score": 11,
                    "created_utc": 1665634719.0,
                    "replies": [
                        {
                            "body": "That’s the ONLY SR I want!!! I tend to stay away from\nmarried men because of this exact reason. You put a ring on it you married her for the wrong reasons I will not be at fault for that ! Also I don’t like being the scapegoat for another woman’s failures. I want to be the center of your attention as you are mine in the time we’re together or speaking. Men think because they’re paying you, YOU have to do whatever they say because their wives won’t lol wrong woman. Not happening",
                            "author": "Euphoric-Beginning51",
                            "id": "is47abo",
                            "parent_id": "t1_is46v5o",
                            "score": 7,
                            "created_utc": 1665634973.0,
                            "replies": []
                        },
                        {
                            "body": "I just called an SD out for that. Instead of having an adult conversation about it, he threw a huge tantrum and ran for the hills.",
                            "author": "MapleSappling",
                            "id": "it636lf",
                            "parent_id": "t1_is46v5o",
                            "score": 1,
                            "created_utc": 1666328632.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "100%…I’m basically more of an ‘alpha’ female, so a naturally dominant man is extremely attractive and makes me want to be more submissive…I can’t just ‘be’ submissive.",
            "author": "Special_Garage7225",
            "id": "is358hp",
            "parent_id": "t1_is3508e",
            "score": 5,
            "created_utc": 1665617038.0,
            "replies": [
                {
                    "body": "Me as well, I try to be submissive but if you’re faking the funk I’m definitely either ✌🏾 or ignoring you not really interested but a man that commands the room, leaves my panties drenched. Whew ! lol",
                    "author": "Euphoric-Beginning51",
                    "id": "is35slx",
                    "parent_id": "t1_is358hp",
                    "score": 2,
                    "created_utc": 1665617289.0,
                    "replies": [
                        {
                            "body": "Hating on masculinity is what got us in this situation where meeting a man who can lead is nearly a miracle, by the way.",
                            "author": "daddyslittlefuckslut",
                            "id": "is39q6q",
                            "parent_id": "t1_is35slx",
                            "score": 4,
                            "created_utc": 1665619051.0,
                            "replies": [
                                {
                                    "body": "This…100%. I never understood why women nowadays can’t just thank a man for opening her door or giving her a compliment without it being some ‘slight against feminism’…like REALLY?!",
                                    "author": "Special_Garage7225",
                                    "id": "is6l7ku",
                                    "parent_id": "t1_is39q6q",
                                    "score": 5,
                                    "created_utc": 1665683544.0,
                                    "replies": []
                                },
                                {
                                    "body": "It’s so hard to meet a man who is natural masculine!",
                                    "author": "Euphoric-Beginning51",
                                    "id": "is3axq7",
                                    "parent_id": "t1_is39q6q",
                                    "score": 2,
                                    "created_utc": 1665619594.0,
                                    "replies": []
                                },
                                {
                                    "body": "Facts !!",
                                    "author": "Euphoric-Beginning51",
                                    "id": "is3a4un",
                                    "parent_id": "t1_is39q6q",
                                    "score": 1,
                                    "created_utc": 1665619235.0,
                                    "replies": [
                                        {
                                            "body": "Naturally and not overcompensating or overselling his talents. Like dude please cut the bs we all know why you’re here, normal doesn’t work out for you. So you have to pay someone, but if it’s because you fall short own that instead of blowing smoke up someone’s Ass it’s much more attractive and understandable. I’m able to accept my own faults as a MAN you should be able to as well.",
                                            "author": "Euphoric-Beginning51",
                                            "id": "is3b6ns",
                                            "parent_id": "t1_is3a4un",
                                            "score": 1,
                                            "created_utc": 1665619704.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "you be you",
                    "author": "AlexVaickus",
                    "id": "is3cwl3",
                    "parent_id": "t1_is358hp",
                    "score": 0,
                    "created_utc": 1665620468.0,
                    "replies": [
                        {
                            "body": "For sure, not changing my energy for some weak male 😘",
                            "author": "Special_Garage7225",
                            "id": "is3oqq2",
                            "parent_id": "t1_is3cwl3",
                            "score": 2,
                            "created_utc": 1665625650.0,
                            "replies": [
                                {
                                    "body": "any man would be lucky",
                                    "author": "AlexVaickus",
                                    "id": "is5hjgw",
                                    "parent_id": "t1_is3oqq2",
                                    "score": 0,
                                    "created_utc": 1665667501.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm agreeing with you probably because I'm extremely alpha.",
            "author": "mad_dabz",
            "id": "is4z31y",
            "parent_id": "t1_is4yzwd",
            "score": 1,
            "created_utc": 1665656946.0,
            "replies": []
        },
        {
            "body": "There is no question that Social Media has enabled people with grievances to find like minded communities to share in their grievances. When these communities look for solutions to deal with these grievances in a positive way, it can be very healthy.  Unfortunately, most of these communities have become echo chambers that only focus on being victims and not on solutions. Many of these communities have become unwitting pawns of sinister people that want to further divide and weaken society to their benefit.",
            "author": "willfromvb",
            "id": "is58ais",
            "parent_id": "t1_is553q3",
            "score": 5,
            "created_utc": 1665662946.0,
            "replies": []
        },
        {
            "body": "I love how binary you are about this, like he EITHER has to spend money on me OR give me a nice experience, but not both simultaneously. To me, a man showing me he can be generous with money towards/around me is absolutely essential to my overall experience of the date and of his company in the long term. I wouldn't be sugar dating if that wasn't the case. The \"actual experience\" (in your words) might be really nice, but if it happens at McDonald's because he proposed a date there? Yeah sorry, not gonna be my thing.\n\nAlso I don't get why you're so defensive about me wanting men to give me expensive experiences. Does it affect you at a personal level or anything?",
            "author": "daddyslittlefuckslut",
            "id": "isacp2m",
            "parent_id": "t1_is8ckui",
            "score": 2,
            "created_utc": 1665754708.0,
            "replies": [
                {
                    "body": "A nice hike through nature costs almost nothing and can still be a great experience.",
                    "author": "SD1070",
                    "id": "isadwdo",
                    "parent_id": "t1_isacp2m",
                    "score": 3,
                    "created_utc": 1665755228.0,
                    "replies": [
                        {
                            "body": "I totally agree with you, you can take a self absorbed chick to places like capital grille or any over priced restaurant, or take them to unique experience that you can remember for long time.\n\nI took my date to special event in museum, and a burlesque  she had the best time of her life. It’s wasn’t the expensive place as well, but some chicks foolishly think materialism is important and will always be miserable in the long run.",
                            "author": "dynolas1",
                            "id": "iuh5ro0",
                            "parent_id": "t1_isadwdo",
                            "score": 1,
                            "created_utc": 1667205841.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oof a word 🙌🏼\n\nI think most men sugar because it’s easy for them to be rude, demanding, freaky af, disrespectful, selfish, greedy etc; they think money justifies it and we as SBs will accept any behavior. I’ve spoken to married SDs who say their wives are “boring” or “too demanding” so they look for a SB who makes the feel in control and let’s them try and do anything. Couldn’t be me tho ✌🏼Can’t accept certain personalities/behavior. I prefer warm, gentle, caring SDs who care if I had dinner or how my weekend was. A SR with some type of substance and mutual respect",
            "author": "BrunetteBunny28",
            "id": "is46v5o",
            "parent_id": "t1_is3wy9s",
            "score": 11,
            "created_utc": 1665634719.0,
            "replies": [
                {
                    "body": "That’s the ONLY SR I want!!! I tend to stay away from\nmarried men because of this exact reason. You put a ring on it you married her for the wrong reasons I will not be at fault for that ! Also I don’t like being the scapegoat for another woman’s failures. I want to be the center of your attention as you are mine in the time we’re together or speaking. Men think because they’re paying you, YOU have to do whatever they say because their wives won’t lol wrong woman. Not happening",
                    "author": "Euphoric-Beginning51",
                    "id": "is47abo",
                    "parent_id": "t1_is46v5o",
                    "score": 7,
                    "created_utc": 1665634973.0,
                    "replies": []
                },
                {
                    "body": "I just called an SD out for that. Instead of having an adult conversation about it, he threw a huge tantrum and ran for the hills.",
                    "author": "MapleSappling",
                    "id": "it636lf",
                    "parent_id": "t1_is46v5o",
                    "score": 1,
                    "created_utc": 1666328632.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Me as well, I try to be submissive but if you’re faking the funk I’m definitely either ✌🏾 or ignoring you not really interested but a man that commands the room, leaves my panties drenched. Whew ! lol",
            "author": "Euphoric-Beginning51",
            "id": "is35slx",
            "parent_id": "t1_is358hp",
            "score": 2,
            "created_utc": 1665617289.0,
            "replies": [
                {
                    "body": "Hating on masculinity is what got us in this situation where meeting a man who can lead is nearly a miracle, by the way.",
                    "author": "daddyslittlefuckslut",
                    "id": "is39q6q",
                    "parent_id": "t1_is35slx",
                    "score": 4,
                    "created_utc": 1665619051.0,
                    "replies": [
                        {
                            "body": "This…100%. I never understood why women nowadays can’t just thank a man for opening her door or giving her a compliment without it being some ‘slight against feminism’…like REALLY?!",
                            "author": "Special_Garage7225",
                            "id": "is6l7ku",
                            "parent_id": "t1_is39q6q",
                            "score": 5,
                            "created_utc": 1665683544.0,
                            "replies": []
                        },
                        {
                            "body": "It’s so hard to meet a man who is natural masculine!",
                            "author": "Euphoric-Beginning51",
                            "id": "is3axq7",
                            "parent_id": "t1_is39q6q",
                            "score": 2,
                            "created_utc": 1665619594.0,
                            "replies": []
                        },
                        {
                            "body": "Facts !!",
                            "author": "Euphoric-Beginning51",
                            "id": "is3a4un",
                            "parent_id": "t1_is39q6q",
                            "score": 1,
                            "created_utc": 1665619235.0,
                            "replies": [
                                {
                                    "body": "Naturally and not overcompensating or overselling his talents. Like dude please cut the bs we all know why you’re here, normal doesn’t work out for you. So you have to pay someone, but if it’s because you fall short own that instead of blowing smoke up someone’s Ass it’s much more attractive and understandable. I’m able to accept my own faults as a MAN you should be able to as well.",
                                    "author": "Euphoric-Beginning51",
                                    "id": "is3b6ns",
                                    "parent_id": "t1_is3a4un",
                                    "score": 1,
                                    "created_utc": 1665619704.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "you be you",
            "author": "AlexVaickus",
            "id": "is3cwl3",
            "parent_id": "t1_is358hp",
            "score": 0,
            "created_utc": 1665620468.0,
            "replies": [
                {
                    "body": "For sure, not changing my energy for some weak male 😘",
                    "author": "Special_Garage7225",
                    "id": "is3oqq2",
                    "parent_id": "t1_is3cwl3",
                    "score": 2,
                    "created_utc": 1665625650.0,
                    "replies": [
                        {
                            "body": "any man would be lucky",
                            "author": "AlexVaickus",
                            "id": "is5hjgw",
                            "parent_id": "t1_is3oqq2",
                            "score": 0,
                            "created_utc": 1665667501.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "A nice hike through nature costs almost nothing and can still be a great experience.",
            "author": "SD1070",
            "id": "isadwdo",
            "parent_id": "t1_isacp2m",
            "score": 3,
            "created_utc": 1665755228.0,
            "replies": [
                {
                    "body": "I totally agree with you, you can take a self absorbed chick to places like capital grille or any over priced restaurant, or take them to unique experience that you can remember for long time.\n\nI took my date to special event in museum, and a burlesque  she had the best time of her life. It’s wasn’t the expensive place as well, but some chicks foolishly think materialism is important and will always be miserable in the long run.",
                    "author": "dynolas1",
                    "id": "iuh5ro0",
                    "parent_id": "t1_isadwdo",
                    "score": 1,
                    "created_utc": 1667205841.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s the ONLY SR I want!!! I tend to stay away from\nmarried men because of this exact reason. You put a ring on it you married her for the wrong reasons I will not be at fault for that ! Also I don’t like being the scapegoat for another woman’s failures. I want to be the center of your attention as you are mine in the time we’re together or speaking. Men think because they’re paying you, YOU have to do whatever they say because their wives won’t lol wrong woman. Not happening",
            "author": "Euphoric-Beginning51",
            "id": "is47abo",
            "parent_id": "t1_is46v5o",
            "score": 7,
            "created_utc": 1665634973.0,
            "replies": []
        },
        {
            "body": "I just called an SD out for that. Instead of having an adult conversation about it, he threw a huge tantrum and ran for the hills.",
            "author": "MapleSappling",
            "id": "it636lf",
            "parent_id": "t1_is46v5o",
            "score": 1,
            "created_utc": 1666328632.0,
            "replies": []
        },
        {
            "body": "Hating on masculinity is what got us in this situation where meeting a man who can lead is nearly a miracle, by the way.",
            "author": "daddyslittlefuckslut",
            "id": "is39q6q",
            "parent_id": "t1_is35slx",
            "score": 4,
            "created_utc": 1665619051.0,
            "replies": [
                {
                    "body": "This…100%. I never understood why women nowadays can’t just thank a man for opening her door or giving her a compliment without it being some ‘slight against feminism’…like REALLY?!",
                    "author": "Special_Garage7225",
                    "id": "is6l7ku",
                    "parent_id": "t1_is39q6q",
                    "score": 5,
                    "created_utc": 1665683544.0,
                    "replies": []
                },
                {
                    "body": "It’s so hard to meet a man who is natural masculine!",
                    "author": "Euphoric-Beginning51",
                    "id": "is3axq7",
                    "parent_id": "t1_is39q6q",
                    "score": 2,
                    "created_utc": 1665619594.0,
                    "replies": []
                },
                {
                    "body": "Facts !!",
                    "author": "Euphoric-Beginning51",
                    "id": "is3a4un",
                    "parent_id": "t1_is39q6q",
                    "score": 1,
                    "created_utc": 1665619235.0,
                    "replies": [
                        {
                            "body": "Naturally and not overcompensating or overselling his talents. Like dude please cut the bs we all know why you’re here, normal doesn’t work out for you. So you have to pay someone, but if it’s because you fall short own that instead of blowing smoke up someone’s Ass it’s much more attractive and understandable. I’m able to accept my own faults as a MAN you should be able to as well.",
                            "author": "Euphoric-Beginning51",
                            "id": "is3b6ns",
                            "parent_id": "t1_is3a4un",
                            "score": 1,
                            "created_utc": 1665619704.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "For sure, not changing my energy for some weak male 😘",
            "author": "Special_Garage7225",
            "id": "is3oqq2",
            "parent_id": "t1_is3cwl3",
            "score": 2,
            "created_utc": 1665625650.0,
            "replies": [
                {
                    "body": "any man would be lucky",
                    "author": "AlexVaickus",
                    "id": "is5hjgw",
                    "parent_id": "t1_is3oqq2",
                    "score": 0,
                    "created_utc": 1665667501.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I totally agree with you, you can take a self absorbed chick to places like capital grille or any over priced restaurant, or take them to unique experience that you can remember for long time.\n\nI took my date to special event in museum, and a burlesque  she had the best time of her life. It’s wasn’t the expensive place as well, but some chicks foolishly think materialism is important and will always be miserable in the long run.",
            "author": "dynolas1",
            "id": "iuh5ro0",
            "parent_id": "t1_isadwdo",
            "score": 1,
            "created_utc": 1667205841.0,
            "replies": []
        },
        {
            "body": "This…100%. I never understood why women nowadays can’t just thank a man for opening her door or giving her a compliment without it being some ‘slight against feminism’…like REALLY?!",
            "author": "Special_Garage7225",
            "id": "is6l7ku",
            "parent_id": "t1_is39q6q",
            "score": 5,
            "created_utc": 1665683544.0,
            "replies": []
        },
        {
            "body": "It’s so hard to meet a man who is natural masculine!",
            "author": "Euphoric-Beginning51",
            "id": "is3axq7",
            "parent_id": "t1_is39q6q",
            "score": 2,
            "created_utc": 1665619594.0,
            "replies": []
        },
        {
            "body": "Facts !!",
            "author": "Euphoric-Beginning51",
            "id": "is3a4un",
            "parent_id": "t1_is39q6q",
            "score": 1,
            "created_utc": 1665619235.0,
            "replies": [
                {
                    "body": "Naturally and not overcompensating or overselling his talents. Like dude please cut the bs we all know why you’re here, normal doesn’t work out for you. So you have to pay someone, but if it’s because you fall short own that instead of blowing smoke up someone’s Ass it’s much more attractive and understandable. I’m able to accept my own faults as a MAN you should be able to as well.",
                    "author": "Euphoric-Beginning51",
                    "id": "is3b6ns",
                    "parent_id": "t1_is3a4un",
                    "score": 1,
                    "created_utc": 1665619704.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "any man would be lucky",
            "author": "AlexVaickus",
            "id": "is5hjgw",
            "parent_id": "t1_is3oqq2",
            "score": 0,
            "created_utc": 1665667501.0,
            "replies": []
        },
        {
            "body": "Naturally and not overcompensating or overselling his talents. Like dude please cut the bs we all know why you’re here, normal doesn’t work out for you. So you have to pay someone, but if it’s because you fall short own that instead of blowing smoke up someone’s Ass it’s much more attractive and understandable. I’m able to accept my own faults as a MAN you should be able to as well.",
            "author": "Euphoric-Beginning51",
            "id": "is3b6ns",
            "parent_id": "t1_is3a4un",
            "score": 1,
            "created_utc": 1665619704.0,
            "replies": []
        }
    ]
}