{
    "title": "I’m sorry but- How is it only men who are ever allowed “discretion” with their photos??",
    "post_id": "sr39xm",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/sr39xm/im_sorry_but_how_is_it_only_men_who_are_ever/",
    "author": "Charlieday474",
    "body": "So i have to go through literally hundreds of profiles with no pictures, politely asking to see something, anything. 99% of which, once I see them, are sooo terrible, it’s like homeless people. It gets extremely tiring to have to ask one by one. \n\nAll of these men, (most with very average jobs, it’s not like it’s Elon Musk …) no photos because, discretion, because of my job” I get it, if you are the Prince of Persia. And even then you can find an anon photo.\n\nI mean, do you think I want to put all my photos out there, and have no discretion? I am also a person that deserves a bit of privacy and respect and who has a job.\n\nI get that it’s pure capitalist offer/demand but I really think it would make the process flow so much better for everyone if men were required to have photos, even if the face was pixelated etc. because otherwise, girls like me who are not pros, frankly don’t have several hours a day to message random men for photos. Escorts do.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/sr39xm/im_sorry_but_how_is_it_only_men_who_are_ever/",
    "score": 175,
    "upvote_ratio": 0.88,
    "created_utc": 1644705703.0,
    "num_comments": 128,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I don’t even bother with profiles without a photo that message me. No needs.",
            "author": "Azucarbabby",
            "id": "hwqi7er",
            "parent_id": "t3_sr39xm",
            "score": 16,
            "created_utc": 1644724720.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hwpgiez",
            "parent_id": "t3_sr39xm",
            "score": 45,
            "created_utc": 1644707290.0,
            "replies": [
                {
                    "body": "I wish I could filter SBs to not see filtered pics from hotel toilets",
                    "author": null,
                    "id": "hwpmuha",
                    "parent_id": "t1_hwpgiez",
                    "score": 34,
                    "created_utc": 1644710032.0,
                    "replies": [
                        {
                            "body": "Lol 🙈",
                            "author": "Charlieday474",
                            "id": "hwpn5ut",
                            "parent_id": "t1_hwpmuha",
                            "score": 3,
                            "created_utc": 1644710168.0,
                            "replies": []
                        },
                        {
                            "body": "Pics taken on the job! I avoid those SBs with an 18 feet pole.",
                            "author": null,
                            "id": "hwpqx3o",
                            "parent_id": "t1_hwpmuha",
                            "score": -1,
                            "created_utc": 1644711828.0,
                            "replies": [
                                {
                                    "body": "Why?",
                                    "author": "Desden213",
                                    "id": "hwq73ij",
                                    "parent_id": "t1_hwpqx3o",
                                    "score": 6,
                                    "created_utc": 1644719334.0,
                                    "replies": [
                                        {
                                            "body": "It could be a red flag they may not be discreet/value discretion, if I had to guess. AKA it shows a lack of self awareness to put a picture of yourself where you are working given the nature of the site.",
                                            "author": "zara_io",
                                            "id": "hwqhtio",
                                            "parent_id": "t1_hwq73ij",
                                            "score": 3,
                                            "created_utc": 1644724517.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "What about strip club locker room?",
                            "author": "SD_AU",
                            "id": "hwvnsli",
                            "parent_id": "t1_hwpmuha",
                            "score": 1,
                            "created_utc": 1644818790.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I didn’t realise! I guess I would miss a lot though, because it is just the habit that men don’t use photos",
                    "author": "Charlieday474",
                    "id": "hwpn3xz",
                    "parent_id": "t1_hwpgiez",
                    "score": 17,
                    "created_utc": 1644710146.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hwsculm",
            "parent_id": "t3_sr39xm",
            "score": 13,
            "created_utc": 1644766651.0,
            "replies": [
                {
                    "body": "Very true. Good advice",
                    "author": "Charlieday474",
                    "id": "hwseex0",
                    "parent_id": "t1_hwsculm",
                    "score": 2,
                    "created_utc": 1644767315.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "TBH I will pass on a SD with a pic and nothing/almost nothing written in their profile, and message back to one who has something intelligent and interesting to say. He’s put time into it and that tells me he’ll put time into finding a good connection. Attractions only last a minute if he is boring or a disrespectful jerk.",
            "author": "BeautyBaby247",
            "id": "hwpjrxd",
            "parent_id": "t3_sr39xm",
            "score": 34,
            "created_utc": 1644708697.0,
            "replies": []
        },
        {
            "body": "You can always just skip profiles without pics.  That's what I do with female listings.  I know it's superficial but looks are important to romantic attraction.",
            "author": "Devastavit",
            "id": "hwqgxtx",
            "parent_id": "t3_sr39xm",
            "score": 8,
            "created_utc": 1644724069.0,
            "replies": []
        },
        {
            "body": "I didn't realize it was that widespread.\n\nI show a public photo that is very recognizable even though I am a prominent citizen in my small community in the middle of nowhrre in the Bible belt midwest\n\nNobody seems to have recognized me or at least nobody at church has ever said anything to me about knowing I am a sugar daddy.",
            "author": "LuckyINTJ",
            "id": "hwpmbs9",
            "parent_id": "t3_sr39xm",
            "score": 11,
            "created_utc": 1644709808.0,
            "replies": [
                {
                    "body": "Jesus knows 👀👀",
                    "author": "peterpmpkneatr",
                    "id": "hwpppj4",
                    "parent_id": "t1_hwpmbs9",
                    "score": 27,
                    "created_utc": 1644711289.0,
                    "replies": []
                },
                {
                    "body": "“Nobody at church” 🙈🙌",
                    "author": "Charlieday474",
                    "id": "hwpnp57",
                    "parent_id": "t1_hwpmbs9",
                    "score": 13,
                    "created_utc": 1644710398.0,
                    "replies": []
                },
                {
                    "body": "Right! How would anybody in town who knows you be able to confront you for being on Seeking without having to admit their own presence on Seeking allowing them to see you there? And if they're dudes, why are they searching thru SD profiles?",
                    "author": "CaptBrewster",
                    "id": "hwqbuoa",
                    "parent_id": "t1_hwpmbs9",
                    "score": 8,
                    "created_utc": 1644721564.0,
                    "replies": []
                },
                {
                    "body": "If they do recognize you it would be easy to say 👀 oh what were YOU doing on that site? Right? Like calling you out is just admitting they're also on there.",
                    "author": "oneangstybiscuit",
                    "id": "hwqc19l",
                    "parent_id": "t1_hwpmbs9",
                    "score": 4,
                    "created_utc": 1644721651.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The real answer is that they are either married or scared of getting made fun of by the bros at work. The first I get. The second is just sad",
            "author": "CaptPeleg",
            "id": "hwpiv3z",
            "parent_id": "t3_sr39xm",
            "score": 22,
            "created_utc": 1644708300.0,
            "replies": [
                {
                    "body": "Being on seeking is no badge of honor for any guy. The other day at a high end club in Silicon Valley overheard a bunch of over 55 dudes talking about their buddy who now has a hot girlfriend. Then one of them goes she is no girlfriend, she is just an escort he picked up on seeking! \n\nSo yes seeking does not have a very high rank in the bro club. It is looked down as a site for lonely losers or an escort site. \n\nAdd to that 80% of men are married and many are business leaders or society figures in some capacity or other vs say a 22 yo SB who is underemployed and has little to lose. Forget losing her career,  sugaring probably pays her rent and all her bills. Totally different equation.\n\nRight or wrong, public judgement can end careers, and since most sugar daddies have invested a LOT of energy into our careers\n\n In fact I have run into several women on seeking with decent jobs who had blurred faces or limited pictures. I mean which moron would jeopardize their career for a sugar relationship.",
                    "author": null,
                    "id": "hwrzczm",
                    "parent_id": "t1_hwpiv3z",
                    "score": 11,
                    "created_utc": 1644760319.0,
                    "replies": [
                        {
                            "body": "\\^\\^ This \\^\\^ - the unvarnished truth",
                            "author": "throwaway6z6",
                            "id": "hws2zvg",
                            "parent_id": "t1_hwrzczm",
                            "score": 7,
                            "created_utc": 1644762190.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Married is a big part of it, but some of us run our own businesses, and they might be business that could be negatively impacted by a report of sugaring. \n\nFor example (and this isn’t my job, just an example), would you take your kid back ti their pediatrician if it came out that the pediatrician was sugaring?  \n\nOr what about a pastor at a church?  \n\nOr a teacher? \n\nRight or wrong, public judgement can end careers, and since most sugar daddies have invested a LOT of energy into our careers it makes sense that we’d protect them. It’s rarely fear of what “bros” at work might think.",
                    "author": "freeewillieee",
                    "id": "hwq0tse",
                    "parent_id": "t1_hwpiv3z",
                    "score": 18,
                    "created_utc": 1644716406.0,
                    "replies": [
                        {
                            "body": "I mean, unless the person they're trying to sugar is actually in a situation that's just minor grooming, I don't think it's any of my business. Personal experience though I wouldn't leave a kid alone with any religious leader regardless. Other than that, I assume most people have sex lives or personal lives that are none of my business.",
                            "author": "oneangstybiscuit",
                            "id": "hwqbviz",
                            "parent_id": "t1_hwq0tse",
                            "score": 10,
                            "created_utc": 1644721574.0,
                            "replies": [
                                {
                                    "body": "I mean, I definitely agree with you, but I’m also know that most people wouldn’t feel that way, and it’s too big a risk to take. I protect my identity for the sake of my marriage, family, business, and career. Not because of the opinion of anyone at work.",
                                    "author": "freeewillieee",
                                    "id": "hwqcdzy",
                                    "parent_id": "t1_hwqbviz",
                                    "score": 6,
                                    "created_utc": 1644721825.0,
                                    "replies": [
                                        {
                                            "body": "\\+1 - Remember Elliot Spitzer? \n\nPeople want to make your sex life their business, if they think you are doing something wrong.",
                                            "author": "DecentOne7895",
                                            "id": "hwqd8rb",
                                            "parent_id": "t1_hwqcdzy",
                                            "score": 10,
                                            "created_utc": 1644722244.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Of course and you do what you feel is best. Especially if people have reason to try to make your life difficult, something that isn't a big deal or that they're also guilty of becomes ammunition.",
                                            "author": "oneangstybiscuit",
                                            "id": "hwtyd1k",
                                            "parent_id": "t1_hwqcdzy",
                                            "score": 2,
                                            "created_utc": 1644789635.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "How is the pastor or pediatrician or teacher discovered to be on Seeking?\n\nBy another guy in the community who knows them who must himself be  searching thru SD profiles? That's weird.  How does he rationalize his own Seeking presence? Why is he searching for an SD? \n\nBy a woman in town who is on Seeking herself, yet is shocked. Shocked! I tell you,  to find her daughters teacher on Seeking?\n\nHow does she explain away her Seeking account?",
                            "author": "CaptBrewster",
                            "id": "hwqdaxz",
                            "parent_id": "t1_hwq0tse",
                            "score": 4,
                            "created_utc": 1644722273.0,
                            "replies": [
                                {
                                    "body": "Perhaps by a blackmailing SB who exposes him, or falsely charges him with rape and goes to the press?  Perhaps by some religious white knight but jobs who troll the site in search of people to expose?  Perhaps by a former SB who was unhappy with how things ended, so she told the wife, who then told everyone? \n\nThere are a million possibilities that don’t have to include a seeking user outing themselves to out you.",
                                    "author": "freeewillieee",
                                    "id": "hwqdp4f",
                                    "parent_id": "t1_hwqdaxz",
                                    "score": 4,
                                    "created_utc": 1644722462.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Seeking is basically just another dating site at this point. No different than being on tinder or hinge.",
                            "author": null,
                            "id": "hwqno4u",
                            "parent_id": "t1_hwq0tse",
                            "score": 4,
                            "created_utc": 1644727576.0,
                            "replies": [
                                {
                                    "body": "You cannot be more wrong! They are trying to brand it as such but it’s not there yet. For the general population male or female, seeking is a sugaring site and sugaring to them is a form of prostitution. \n\nThe SBs including OP who are pounding the table of the need for SDs to reveal pics and ID will themselves think twice before telling the world they are on seeking or have sugar lovers. \n\nWe all know there is a huge stigma attached. Why is it that women with established careers blur their face on seeking or why is it that most women cringe at the mention of sugar dating and above all seeking will have to clean up all married men - roughly 80% of their clients - if they are truly a dating site vs a sugar site and the ladies will have to stop thinking this is a paid dating format.",
                                    "author": null,
                                    "id": "hws00cf",
                                    "parent_id": "t1_hwqno4u",
                                    "score": 2,
                                    "created_utc": 1644760672.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "“Right or wrong, public judgement can end careers, and since most sugar daddies have invested a LOT of energy into our careers”\n\nI agree! Actually even young women with good careers prefer a lot of discretion when it comes to sugar dating. Of course if a woman is a sex worker or barely has a real career, she might not care about how she presents herself.",
                            "author": null,
                            "id": "hwrznso",
                            "parent_id": "t1_hwq0tse",
                            "score": 3,
                            "created_utc": 1644760483.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There is no such thing as “allowed”.  Only personal choice.  Which you are “allowed” to make as well.  You don’t get to decide on personal choice on behalf of others.  Get over yourself.",
            "author": "MrBuzzard",
            "id": "hws0siy",
            "parent_id": "t3_sr39xm",
            "score": 5,
            "created_utc": 1644761080.0,
            "replies": []
        },
        {
            "body": "At the end of the day, some men will readily show themselves, and some will prefer their privacy. \n\nSome men will expect you to show yourself, and some will accept your reasoning for wanting to remain picture-free.\n\nShouldn’t matter how much effort you put into trying to find an SD. SDs have a hell of a time trying to find the right SB too. And if SRs are anything like the rest of vanilla dating/sex/marriage, let’s face it - we women always, *always* have the upper hand. It’s so much easier for us. Know how I know? How many hundreds of messages do you have in your inbox right now?\n\nI guess what I’m trying to say is…don’t sweat it. You’re on there to meet one quality SD, right? So who cares how many bad ones you pass up, for whatever reason. 🤷‍♀️",
            "author": null,
            "id": "hwpfhjw",
            "parent_id": "t3_sr39xm",
            "score": 9,
            "created_utc": 1644706857.0,
            "replies": [
                {
                    "body": "thats just a false perception of abundance. Any average women can go on a dating app and have hundreds of matches. The real question is how many she is really interested in. The same applies for your hundreds of messages, 99.9% are scams, Johns or guys you are not interested in so these 100s of messages mean absolutely nothing. The real power is in the legit sd because thats what you all want, these profiles have the real upper hand and we are not busy with 100s of messages. Most of us have our profile hidden and reach out to the potential sb.",
                    "author": "throwaway191746",
                    "id": "hww013s",
                    "parent_id": "t1_hwpfhjw",
                    "score": 2,
                    "created_utc": 1644828167.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "when I first started SD'ng \\~3 years ago I made the mistake of posting pics. some insane chick felt rejected by me when I was actually just busy, and she somehow found one of my businesses and harassed my employees for some kind of revenge. if you think SD's are crazy, SB's can be just as bad",
            "author": "realsugardaddyz",
            "id": "hwpfktv",
            "parent_id": "t3_sr39xm",
            "score": 6,
            "created_utc": 1644706895.0,
            "replies": [
                {
                    "body": "Oh I don’t doubt that",
                    "author": "Charlieday474",
                    "id": "hwpnr73",
                    "parent_id": "t1_hwpfktv",
                    "score": 3,
                    "created_utc": 1644710422.0,
                    "replies": []
                },
                {
                    "body": "Watch them ignore what you said to keep pushing their victim narrative.",
                    "author": "daddinoir",
                    "id": "hwporj9",
                    "parent_id": "t1_hwpfktv",
                    "score": -5,
                    "created_utc": 1644710865.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The short answer to why we don't post photos is really because we don't have to. I don't post a public picture anymore and get roughly the same level of engagement in my profile as I did when I had a photo public. \n\nWhy would a man put his job and relationships at risk by making it know he is associated with a website that still the bulk of society isn't on board with if there is no tangible benefit to it?\n\nIf you don't want to talk to men without photos then filter them out so those profiles don't show up on your searches.\n\nLife's not fair I guess. Get over it.",
            "author": "bigdickginger",
            "id": "hwpqt3i",
            "parent_id": "t3_sr39xm",
            "score": 6,
            "created_utc": 1644711778.0,
            "replies": [
                {
                    "body": "How would it become known that you are \"associated with a website...\".",
                    "author": "CaptBrewster",
                    "id": "hwqbepo",
                    "parent_id": "t1_hwpqt3i",
                    "score": -1,
                    "created_utc": 1644721347.0,
                    "replies": [
                        {
                            "body": "... If someone sees my picture in my profile then they would know I'm active on SA. What are you not understanding?",
                            "author": "bigdickginger",
                            "id": "hwqvhrt",
                            "parent_id": "t1_hwqbepo",
                            "score": 1,
                            "created_utc": 1644732116.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "... are you being serious with the question because I don't see how it could be much more obvious. The SBs are selling their beauty and charm. There are 10 SBs for every 1 SD. \n\nThere are many SBs that show their face and I have no problem with that. No photos at all though, and why would I be remotely interested?",
            "author": "AShatteredKing",
            "id": "hwrupcg",
            "parent_id": "t3_sr39xm",
            "score": 5,
            "created_utc": 1644757637.0,
            "replies": [
                {
                    "body": "OP seems rather entitled and wants to pick and choose 'equality' while conveniently ignoring that the other side has to pay for the most basic feature of the site and for the SR.",
                    "author": "YlangScent",
                    "id": "hwrwsq4",
                    "parent_id": "t1_hwrupcg",
                    "score": 7,
                    "created_utc": 1644758892.0,
                    "replies": []
                },
                {
                    "body": "Why would I…? The fact that I would date someone with worse looks/age than me, doesn’t mean that I would date just anyone, in any condition..! Plenty of attractive older men are interested in being my SDs\n\nI just can’t find them cause they don’t have pictures. Just like the other 1000s of johns, scammers, very unhealthy people etc that i’d never consider. They all blend into a grey anonymous mannequin icon",
                    "author": "Charlieday474",
                    "id": "hwsfgop",
                    "parent_id": "t1_hwrupcg",
                    "score": 0,
                    "created_utc": 1644767752.0,
                    "replies": [
                        {
                            "body": ">Plenty of attractive older men are interested in being my SDs  \n>  \n>I just can’t find them cause they don’t have pictures. \n\nThat sounds like thre aren't \"plenty\" of attractive older men interestes in being your SD, otherwise they would have already contacted you.",
                            "author": null,
                            "id": "hwuxa2y",
                            "parent_id": "t1_hwsfgop",
                            "score": 3,
                            "created_utc": 1644805030.0,
                            "replies": [
                                {
                                    "body": "I was kind of joking. Yes; they have always been the ones to contact. I’d never find them in the sea of murky waters!",
                                    "author": "Charlieday474",
                                    "id": "hwxh93y",
                                    "parent_id": "t1_hwuxa2y",
                                    "score": 1,
                                    "created_utc": 1644859059.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you don’t want to ask men for pics, then filter them out. You can set message filters. For example, I filter out messages from older women and from anyone over curvy. (Mainly because my search sometimes includes curvy and I don’t want to redo my message filters)\n\nWill you miss out on some legit SDs? Yes. Will your experience on the site be more pleasant? Probably.\n\nMy profile is hidden in search/etc, and has never/will never have any pics. I expect that I’m missing out on SBs who have their profiles hidden and SBs who require pics on the site to engage. I’m ok with that because when I search, there are still hundreds of women who fit my tight search criteria.\n\nAnd I hide for career/discretion risk. Medicine is still a very conservative field. Otherwise, I’m divorced/single.\n\nSo basically, if someone wants my pics, she’ll find them on a vanilla dating site. If they want sugar, they’ll have to accept that I‘ll only share pics by text. And even then, lightly anonymized ones. I’m paranoid from a career risk standpoint. \n\nAlas, I haven’t bothered with SA in almost 2yrs. Apparently showing pics and tweaking my vanilla profiles was all I needed to do to start getting a reasonable flow of matches.",
            "author": "sdthrowaway006",
            "id": "hwskolc",
            "parent_id": "t3_sr39xm",
            "score": 2,
            "created_utc": 1644769893.0,
            "replies": []
        },
        {
            "body": "Few things\n\n1) SDs are more likely to be older and in an established career with more to lose\n\n2) SDs are more likely to be married. \n\n3) being an SD is looked down upon. Being an SB is a status symbol. \n\n4) SBs are chosen based off looks which is why pics are essential. SDs are chosen based of generosity. In theory, looks shouldn’t matter for SDs. I’m very aware that SBs ask for pics because they want to see if the guy is physically attractive / safe. But in the game of sugar, only the sugar babies are expected to be attractive. \n\nEscorts ask men for photos? That’s news to me.",
            "author": "UnearthlyDinosaur",
            "id": "hwpfkdl",
            "parent_id": "t3_sr39xm",
            "score": 11,
            "created_utc": 1644706890.0,
            "replies": [
                {
                    "body": "I choose my SDs off of looks. I don't want to sleep with an ugly guy, no matter how rich he is. My gag reflex doesn't care how much money you give me - just if you bathe and look good.",
                    "author": "alleriamystic",
                    "id": "hwpmjo1",
                    "parent_id": "t1_hwpfkdl",
                    "score": 20,
                    "created_utc": 1644709903.0,
                    "replies": [
                        {
                            "body": "This is exactly why I haven't yet pulled the trigger on sugar dating.  I'm overweight, and most women are turned off by that.  Sadly, even when they are being paid, women (short of hookers) are often as shallow as you are saying you are.  Not all, but most.",
                            "author": "awesomedude2016_2016",
                            "id": "hwqw6oi",
                            "parent_id": "t1_hwpmjo1",
                            "score": 5,
                            "created_utc": 1644732525.0,
                            "replies": [
                                {
                                    "body": "Attraction doesn't mean you only date models.\nMy actual boyfriends are a variety of sizes. I like a dad bod and actually avoid buff dudes.\n\nI'm not shallow. I just wouldn't fake attraction for money.",
                                    "author": "alleriamystic",
                                    "id": "hwrson3",
                                    "parent_id": "t1_hwqw6oi",
                                    "score": 6,
                                    "created_utc": 1644756357.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Exactly. And that IS the difference between sugaring and..random cheap motel encounters…",
                            "author": "Charlieday474",
                            "id": "hwpngoz",
                            "parent_id": "t1_hwpmjo1",
                            "score": 7,
                            "created_utc": 1644710298.0,
                            "replies": []
                        },
                        {
                            "body": "That is how it shouid be! But that does mean every guy needs to post pics on the site. Also I hear a lot of men show older and false pics where they were 30 lbs lighter and 30 years younger",
                            "author": null,
                            "id": "hws0n83",
                            "parent_id": "t1_hwpmjo1",
                            "score": 3,
                            "created_utc": 1644761006.0,
                            "replies": []
                        },
                        {
                            "body": "I think you’re looking for vanilla. Which is fine I’ve had 10+ girls tell me in the last month they didn’t want money . But I’m talking about sugaring.",
                            "author": "UnearthlyDinosaur",
                            "id": "hwpogo8",
                            "parent_id": "t1_hwpmjo1",
                            "score": -6,
                            "created_utc": 1644710731.0,
                            "replies": [
                                {
                                    "body": "I mean sugaring too. It's still a sugar relationship. If you want women who aren't physically attracted to you to fuck, hire an escort.",
                                    "author": "alleriamystic",
                                    "id": "hwpomx0",
                                    "parent_id": "t1_hwpogo8",
                                    "score": 11,
                                    "created_utc": 1644710806.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">SDs are chosen based of generosity. \n\nDo you send money to all the potential interests to show that? If she is chosen based on her looks and has to provide proof; and you based on your \"generosity\", what proof do you give? Substitute \"you\" with \"a SD\" at your leisure.",
                    "author": "AnSteall",
                    "id": "hwr4k8i",
                    "parent_id": "t1_hwpfkdl",
                    "score": 4,
                    "created_utc": 1644738121.0,
                    "replies": []
                },
                {
                    "body": ">In theory, looks shouldn’t matter for SDs. (...)  \n>  \n>But in the game of sugar, only the sugar babies are expected to be attractive.\n\nWe are playing completely different games then. How do you come up with something like that? (Obvioulsy, you answer this question yourself by suddenly bringing up escorts in the last sentence.)",
                    "author": "Inner_Examination_38",
                    "id": "hwpglyv",
                    "parent_id": "t1_hwpfkdl",
                    "score": 13,
                    "created_utc": 1644707332.0,
                    "replies": [
                        {
                            "body": "So you date SDs primarily on what they look like? Maybe you’re looking for vanilla and not an SD?",
                            "author": "UnearthlyDinosaur",
                            "id": "hwphmc6",
                            "parent_id": "t1_hwpglyv",
                            "score": -4,
                            "created_utc": 1644707767.0,
                            "replies": [
                                {
                                    "body": "How is wanting an attractive SD a sign to go vanilla?",
                                    "author": "MizzKiko",
                                    "id": "hwpopb5",
                                    "parent_id": "t1_hwphmc6",
                                    "score": 9,
                                    "created_utc": 1644710837.0,
                                    "replies": [
                                        {
                                            "body": "You never said anything about wanting an SR.",
                                            "author": "UnearthlyDinosaur",
                                            "id": "hwpotqg",
                                            "parent_id": "t1_hwpopb5",
                                            "score": -5,
                                            "created_utc": 1644710893.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "It is a factor. I’m not sure why you jumped to one end to ask her if it’s the primary factor, but it is something for SBs to consider before they delve into a relationship.",
                                    "author": "GoodyGoobert",
                                    "id": "hwpuxtd",
                                    "parent_id": "t1_hwphmc6",
                                    "score": 6,
                                    "created_utc": 1644713664.0,
                                    "replies": []
                                },
                                {
                                    "body": "In fact, my SD wouldn't enjoy spending time with me half as much as he does if he didn't know that I am truly attracted to him. So yes, being attracted to someone -- which is more than just looks, but includes looks -- is absolutely necessary for me to get into a SR. In my opinion, this is also one of the most important distinctions between sugaring and escorting.",
                                    "author": "Inner_Examination_38",
                                    "id": "hwpiysb",
                                    "parent_id": "t1_hwphmc6",
                                    "score": 14,
                                    "created_utc": 1644708344.0,
                                    "replies": []
                                },
                                {
                                    "body": "Why is that the case? I think an SD ought to look good, take care of himself and be in the top 10% of guys in his age group. Why is that the SD is absolved and it’s ok for him to be FBUS? I mean fat bald ugly and smelly?",
                                    "author": null,
                                    "id": "hws0z9t",
                                    "parent_id": "t1_hwphmc6",
                                    "score": 3,
                                    "created_utc": 1644761178.0,
                                    "replies": [
                                        {
                                            "body": "So you won’t date an Sd who is extremely generous but average looking? Would rather have a good looking guy who pays less? No judgment just wondering for my own knowledge",
                                            "author": "UnearthlyDinosaur",
                                            "id": "hwsrffg",
                                            "parent_id": "t1_hws0z9t",
                                            "score": 1,
                                            "created_utc": 1644772600.0,
                                            "replies": [
                                                {
                                                    "body": "I am an SD but I firmly believe that money cannot buy attraction. No matter which gender.",
                                                    "author": null,
                                                    "id": "hwt064o",
                                                    "parent_id": "t1_hwsrffg",
                                                    "score": 3,
                                                    "created_utc": 1644776037.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Good point about the marriage, that could be a deterrent. \n\nBut girls do have much to lose too, especially if they have more status and a reputation. I’ve had a few people i know in real life, find me on the website, and it’s not great, cause a lot of people look down on escorts and believe that’s basically what you are",
                    "author": "Charlieday474",
                    "id": "hwpgnen",
                    "parent_id": "t1_hwpfkdl",
                    "score": 9,
                    "created_utc": 1644707350.0,
                    "replies": [
                        {
                            "body": "It's not uncommon for SB's to post \"discreet\" pictures which don't show a clear face shot (either off angles, or just showing chin-down basically), and then keep the clear face shots under lock.",
                            "author": "westcoaststyleballs",
                            "id": "hwpj30c",
                            "parent_id": "t1_hwpgnen",
                            "score": 5,
                            "created_utc": 1644708396.0,
                            "replies": []
                        },
                        {
                            "body": ">I’ve had a few people i know in real life, find me on the website, and it’s not great\n\nSo you understand why people don't post pictures.\n\nNow just think about which way the money flows and you'll understand why you're expected to have a picture and he isn't.\n\nSD's care about your looks, you care about their wallets.",
                            "author": "Athensbirds",
                            "id": "hwr8zge",
                            "parent_id": "t1_hwpgnen",
                            "score": 4,
                            "created_utc": 1644741433.0,
                            "replies": [
                                {
                                    "body": "It’s not about “looks” though, it’s about a minimum standard/looking “normal” trustworthy, healthy, not diseased…you likely haven’t seen a lot of these people’s photos. It’s not just bad “looks”. It is scary",
                                    "author": "Charlieday474",
                                    "id": "hwrg1n6",
                                    "parent_id": "t1_hwr8zge",
                                    "score": 2,
                                    "created_utc": 1644746930.0,
                                    "replies": [
                                        {
                                            "body": "That's all stuff you can figure out at a M&G.",
                                            "author": "Athensbirds",
                                            "id": "hwrgwp1",
                                            "parent_id": "t1_hwrg1n6",
                                            "score": 2,
                                            "created_utc": 1644747601.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You have a choice. Either don’t sugar or don’t post your pics.",
                            "author": null,
                            "id": "hws0jch",
                            "parent_id": "t1_hwpgnen",
                            "score": 1,
                            "created_utc": 1644760950.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> Escorts ask men for photos?\n\nThey do not.",
                    "author": "ILikeTheHobby",
                    "id": "hwt00yr",
                    "parent_id": "t1_hwpfkdl",
                    "score": 2,
                    "created_utc": 1644775980.0,
                    "replies": []
                },
                {
                    "body": "Really? Is being an SB a status symbol?",
                    "author": "DecentOne7895",
                    "id": "hwqdmwr",
                    "parent_id": "t1_hwpfkdl",
                    "score": 0,
                    "created_utc": 1644722432.0,
                    "replies": [
                        {
                            "body": "😂",
                            "author": "Charlieday474",
                            "id": "hwrg608",
                            "parent_id": "t1_hwqdmwr",
                            "score": 3,
                            "created_utc": 1644747025.0,
                            "replies": []
                        },
                        {
                            "body": "TikTok",
                            "author": "UnearthlyDinosaur",
                            "id": "hwqknxd",
                            "parent_id": "t1_hwqdmwr",
                            "score": 1,
                            "created_utc": 1644725973.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Well put. I mean, it should be obvious lol, but still. Well put",
                    "author": "Kevinburnz",
                    "id": "hwpptt8",
                    "parent_id": "t1_hwpfkdl",
                    "score": -1,
                    "created_utc": 1644711342.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't really get it either, this obsession with \"discretion\" . It's fake. Its a cover for their physical inadequacies. Few if any of these guys are so important, or such well known  public figures that they have everything to lose. It's ludicrous!\n\nI've posted 6 photos, none private, all but two clearly showing my face. All more or less align with the advice handed out here to the women who seek a profile review... show your face, smile, no filters, show your figure, show an activity you're involved in,  etc. \n\nWho would possibly care if they see me on Seeking?\nMy boss? \"Yeah boss, I am. So how's your search going?\" \nMy neighbor maybe? \"Yeah buddy I am. How's your luck been?\"\nA coworker perhaps? \"Sure enough man, I think it's fun. How you doing there?\"\n\nAny guy who would confront me for being on Seeking would literally have had to be on Seeking himself. So perhaps the bigger question... why are these dudes searching Sugar Daddy profiles? That's just effing weird.\n\nAny women friends, neighbors, coworkers, supervisors, family members etc would also have to explain their own presence on Seeking. How would they rationalize their presence while demonizing me?\n\nMaybe if I were a politician, or Fortune 500 CEO or just some dude cheating on his wife? I guess? But the same holds true I think. Anyone who would discover and confront a guy in those situations still has to explain their own presence on Seeking.\n\nThe real truth is likely that the vast majority of dudes who don't post pictures are bald, fat, ugly, gross or some combination thereof, and know that they couldn't pass the initial profile picture scrutiny. I'm clearly no Clooney, (more of a Hanks) but I'm pretty well preserved for a dude my age (so I've been told). But better yet I have nothing to hide or be ashamed of.",
            "author": "CaptBrewster",
            "id": "hwqb1qc",
            "parent_id": "t3_sr39xm",
            "score": 5,
            "created_utc": 1644721174.0,
            "replies": []
        },
        {
            "body": ">99% of which, once I see them, are sooo terrible, it’s like homeless people\n\nFunny line :)",
            "author": "Hyceanplanet",
            "id": "hwpglko",
            "parent_id": "t3_sr39xm",
            "score": 6,
            "created_utc": 1644707328.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hwpj9fn",
                    "parent_id": "t1_hwpglko",
                    "score": 3,
                    "created_utc": 1644708474.0,
                    "replies": [
                        {
                            "body": "How many homeless SDs do you know?\n\nHow many homeless people would you sleep with, Mr SJW?",
                            "author": "AnSteall",
                            "id": "hwr4abg",
                            "parent_id": "t1_hwpj9fn",
                            "score": -2,
                            "created_utc": 1644737918.0,
                            "replies": [
                                {
                                    "body": "Y'know, all those homeless supermodels, duh",
                                    "author": "SecretPorifera",
                                    "id": "hwtzb4w",
                                    "parent_id": "t1_hwr4abg",
                                    "score": 0,
                                    "created_utc": 1644790025.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Men have more negotiating leverage (on the looks versus money trade-off), so they can more easily get away with not having a photo on their profile.\n\nA SB might take a gamble with a coffee meeting, for a SD financial whale (with no photos). It doesn't work that way in reverse.\n\nThe sugar marketplace's profile photo status statistics, reflect this difference.",
            "author": "Nomad_Bill",
            "id": "hwqdn2g",
            "parent_id": "t3_sr39xm",
            "score": 3,
            "created_utc": 1644722434.0,
            "replies": []
        },
        {
            "body": "Sugar baby are picked for their look\nSugar daddy aren't picked for their look so that's where the difference lie!",
            "author": "WiseRequirement9277",
            "id": "hwrmcff",
            "parent_id": "t3_sr39xm",
            "score": 3,
            "created_utc": 1644751818.0,
            "replies": []
        },
        {
            "body": "OMG IKR!!",
            "author": "ElMasochisto",
            "id": "hwqr2e6",
            "parent_id": "t3_sr39xm",
            "score": 2,
            "created_utc": 1644729469.0,
            "replies": []
        },
        {
            "body": "I'm not saying you don't have a point, but let's face it.  As the site defines male members (99.9%) as \"Wealthy members\" and female members as \"Attractive Members\".  They even say something like \"Wealthy meets attractive\" or something like that.\n\nThe focus is on mens wealth, and womens looks.  So looks for men are not the most important aspect (not saying it's not important, just not the most important).  While looks for women are the most important, at least as far as the site is concerned.",
            "author": "Acrobatic_Half_6631",
            "id": "hwpg2w2",
            "parent_id": "t3_sr39xm",
            "score": 3,
            "created_utc": 1644707108.0,
            "replies": [
                {
                    "body": "Yes that’s a given. It leads to abuse though, I’d say the vast majority of men are just curious, getting off looking at photos of what they believe to be escorts, and just ask for pictures. It makes “real” sugaring really hard",
                    "author": "Charlieday474",
                    "id": "hwpgyv4",
                    "parent_id": "t1_hwpg2w2",
                    "score": 7,
                    "created_utc": 1644707486.0,
                    "replies": [
                        {
                            "body": ">I’d say the vast majority of men are just curious\n\nWhat are you basing this on? You think the majority of people are paying over a hundred bucks are curious? That seems massively unlikely. \n\nAlso if you're talking about the free accounts, those can be made for SD and SB alike, neither of which require payment. But the difference is that unpaid SD accounts can not message anyone, all they can do is send picture requests. \n\nIts also easy to filter out any non premium accounts as a SB by simply paying yourself too.",
                            "author": "YlangScent",
                            "id": "hwrjy8t",
                            "parent_id": "t1_hwpgyv4",
                            "score": 6,
                            "created_utc": 1644749968.0,
                            "replies": []
                        },
                        {
                            "body": "The thing is, good pictures for men are actually a bad thing.  Most women assume good, attractive pictures are either catfishes, or old pictures.  \n\nAlso, men are far more likely to be blackmailed, and with far more serious consequences.",
                            "author": "Acrobatic_Half_6631",
                            "id": "hwplijl",
                            "parent_id": "t1_hwpgyv4",
                            "score": -2,
                            "created_utc": 1644709451.0,
                            "replies": [
                                {
                                    "body": "Do you have anything to support that?\n\nA woman is automatically assumed to be a hooker if she \"sleeps around\" and her reputation is far more on the line than a married man's. This happens automatically. Far fewer marriages are broken up by infidelity  than a woman being called a whore for having sexual partners without being in a relationship. Sugar or not.",
                                    "author": "AnSteall",
                                    "id": "hwr53wj",
                                    "parent_id": "t1_hwplijl",
                                    "score": 3,
                                    "created_utc": 1644738528.0,
                                    "replies": [
                                        {
                                            "body": "Being called a whore has a much lower average cost than a financially successful man getting a divorce. Divorce is one of the worst things a person can go through and still be physically whole, statistically speaking, for one's financial, physical, and mental health. Being called a whore is a nasty insult, which doesn't hit me particularly hard, but maybe you feel it more. Either way, it's not comparable to a divorce. A divorce is more comparable to getting audited or dragged through a strenuous court trial. And that's *before* you get into what can happen if you didn't have a prenup.",
                                            "author": "SecretPorifera",
                                            "id": "hwu0fsa",
                                            "parent_id": "t1_hwr53wj",
                                            "score": 1,
                                            "created_utc": 1644790503.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "True",
                            "author": "CaptBrewster",
                            "id": "hwqdhju",
                            "parent_id": "t1_hwpgyv4",
                            "score": 1,
                            "created_utc": 1644722362.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Participate to the extent you feel comfortable.    \nDon’t do anything you don’t want to.  Draw your boundaries and stick to them. \n\nBut don’t hate the player, hate the game.",
            "author": "DrZenRoot",
            "id": "hwpr1fj",
            "parent_id": "t3_sr39xm",
            "score": 1,
            "created_utc": 1644711884.0,
            "replies": []
        },
        {
            "body": "Pass on them if it's a big deal to you but there are a lot of SDs that are public faces or are married so they are not going to put their pictures out in public.  I think these guys should though keep a few private pictures that they can share if they are messaging with a girl they like.\n\nPictures aren't as big of a deal for SDs because most SBs aren't all that concerned with what a SD looks like as long as he can provide an allowance.  But for SBs your looks are the first thing we take into account.",
            "author": "Pandaslapper12",
            "id": "hwq3jhx",
            "parent_id": "t3_sr39xm",
            "score": 1,
            "created_utc": 1644717689.0,
            "replies": []
        },
        {
            "body": "Most don’t post photos because they are married",
            "author": "Realistic_Scratch912",
            "id": "hwsbjzr",
            "parent_id": "t3_sr39xm",
            "score": 1,
            "created_utc": 1644766092.0,
            "replies": []
        },
        {
            "body": "Ever heard of cancel culture?\n\nYou clearly don't have any sense for what men are risking by being associated with a taboo website.\n\nYou risk barely anything by showing your pics.  Trying to be a sugar baby is seen as trendy and thats about it.\n\nTrying to be a sugar daddy can lose you your entire livelihood.\n\nAnd boo hoo about your precious hours of searching.  SDs spent 30-60 years building their wealth.  You're literally getting practically free money to be an SB, it SHOULD be difficult.",
            "author": null,
            "id": "hwpdr8v",
            "parent_id": "t3_sr39xm",
            "score": -7,
            "created_utc": 1644706125.0,
            "replies": [
                {
                    "body": ">Trying to be a sugar daddy can lose you your entire livelihood.\n\nNo, it can't. If you think it can, you are doing something wrong. Your understanding of what it means to \"try being a sugar daddy\" is way off.\n\n>You're literally getting practically free money to be an SB, it SHOULD be difficult.\n\nEh?",
                    "author": "Inner_Examination_38",
                    "id": "hwpfxse",
                    "parent_id": "t1_hwpdr8v",
                    "score": 9,
                    "created_utc": 1644707047.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hwphnzr",
                            "parent_id": "t1_hwpfxse",
                            "score": -3,
                            "created_utc": 1644707787.0,
                            "replies": [
                                {
                                    "body": ">You absolutely can lose your job or certain licenses for being a SD. Many business and professions see sugaring as a ethics violation.\n\nI would really like to know more about that. Losing your job for being on SA which is ostensibly for vanilla dating? Or losing your job for financially supporting one of your girlfriends?\n\n>SDs by definition have more wealth than SBs.\n\nWould never disagree with that!\n\n>He does have a point in SBs getting free money. Aren't SBs supposed to date SDs they are attracted to and not do anything they don't want? So basically going out with a smart, successful, fun guy that they enjoy being around.\n\nI think there's a simple way to test whether it's free money. Stop giving her money. Only if her behavior does not change, it was indeed free money.",
                                    "author": "Inner_Examination_38",
                                    "id": "hwpjy1g",
                                    "parent_id": "t1_hwphnzr",
                                    "score": 10,
                                    "created_utc": 1644708772.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hwplvjp",
                                            "parent_id": "t1_hwpjy1g",
                                            "score": -2,
                                            "created_utc": 1644709611.0,
                                            "replies": [
                                                {
                                                    "body": ">The test would be see if any woman goes on dates without being paid which 99%+ do.\n\nWhy make these generalizations? We are not talking about *any woman* seeing *any man*, but about that *specific woman* who *you* want to date.\n\nMany SDs here have described sugar dating as dating above their league (and being financially supported in return). For the SBs, it means dating below their league as well (and being financially supported in return).",
                                                    "author": "Inner_Examination_38",
                                                    "id": "hwpn1ct",
                                                    "parent_id": "t1_hwplvjp",
                                                    "score": 6,
                                                    "created_utc": 1644710115.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "hwpp2pv",
                                                            "parent_id": "t1_hwpn1ct",
                                                            "score": -1,
                                                            "created_utc": 1644711005.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Agree with that! But I don't see your point here. Yes, SBs prefer vanilla dating but that doesn't mean they are getting something for free. Economically, everything we do (that is a choice) we do because it's our preference. When you spend five dollars on an ice cream, you do so because you have decided that ice cream is more valuable to you than five dollars worth of potatoes. That doesn't mean you get ice cream for free.",
                                                                    "author": "Inner_Examination_38",
                                                                    "id": "hwprn3h",
                                                                    "parent_id": "t1_hwpp2pv",
                                                                    "score": 2,
                                                                    "created_utc": 1644712164.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "If they prefer vanilla dating over sugar then why sugar? If for money then why not escort or just see as many SDs to maximize profit?\n\nEither they prefer sugar over vanilla and the money's just free or there's some moral opposition. \n\n A lot of SBs have some trauma or life experience that makes traditional relationships harder than sugar.",
                                                                            "author": "UseRound7488",
                                                                            "id": "hwpswnm",
                                                                            "parent_id": "t1_hwprn3h",
                                                                            "score": 1,
                                                                            "created_utc": 1644712736.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "> No, it can't\n\nYes, it can.  See what I did there?",
                            "author": null,
                            "id": "hwpgimz",
                            "parent_id": "t1_hwpfxse",
                            "score": -5,
                            "created_utc": 1644707293.0,
                            "replies": [
                                {
                                    "body": "You're not exactly hiding your genius, are you?",
                                    "author": "Inner_Examination_38",
                                    "id": "hwpgxdp",
                                    "parent_id": "t1_hwpgimz",
                                    "score": 7,
                                    "created_utc": 1644707469.0,
                                    "replies": [
                                        {
                                            "body": "Alright sugar baby, keep telling me what SDs deal with.  \n\nI'm reading your other comments ya know.  It's pretty clear you don't like anyone sharing the victim card with you.\n\nYou've got blind spots.  Get over yourself.",
                                            "author": null,
                                            "id": "hwphf1f",
                                            "parent_id": "t1_hwpgxdp",
                                            "score": -5,
                                            "created_utc": 1644707678.0,
                                            "replies": [
                                                {
                                                    "body": "Obviously, you haven't read my comments. I don't think I have ever complained or \"played the victim card\". You are the one who thinks he has been treated badly by the world.",
                                                    "author": "Inner_Examination_38",
                                                    "id": "hwpi9fe",
                                                    "parent_id": "t1_hwphf1f",
                                                    "score": 7,
                                                    "created_utc": 1644708045.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "I was wondering the same thing, like this is a SB, telling a SD, how his business is affected by being in the bowl 🤯🤯🤯",
                                                    "author": "ModdedDoll",
                                                    "id": "hwr74kc",
                                                    "parent_id": "t1_hwphf1f",
                                                    "score": 0,
                                                    "created_utc": 1644740032.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Don’t argue with her. She is very keen on being the victim for the number of hours she spends trying to get a man who spent decades building his wealth. Her life must be so hard.",
                                                    "author": "daddinoir",
                                                    "id": "hwpoelz",
                                                    "parent_id": "t1_hwphf1f",
                                                    "score": -4,
                                                    "created_utc": 1644710706.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Rich men with young attractive women hanging off their arm are like, a status symbol though. It's literally not going to get you \"canceled.\" Unless you're going out with people under the age of consent or abusing them, it's just met with a \"ha good for him\" and some form of financial and slut shaming for the woman.",
                    "author": "oneangstybiscuit",
                    "id": "hwqcgo2",
                    "parent_id": "t1_hwpdr8v",
                    "score": 3,
                    "created_utc": 1644721861.0,
                    "replies": []
                },
                {
                    "body": "I thought Matt Gaetz legitimized it, no?",
                    "author": null,
                    "id": "hwpe5jq",
                    "parent_id": "t1_hwpdr8v",
                    "score": -2,
                    "created_utc": 1644706291.0,
                    "replies": [
                        {
                            "body": "Nope.By looking for underage girls he made the perception of SDs much worse",
                            "author": "UnearthlyDinosaur",
                            "id": "hwpfsqq",
                            "parent_id": "t1_hwpe5jq",
                            "score": 2,
                            "created_utc": 1644706987.0,
                            "replies": [
                                {
                                    "body": "But he is still a congressman right? So there is that.",
                                    "author": "CaptPeleg",
                                    "id": "hwpin0u",
                                    "parent_id": "t1_hwpfsqq",
                                    "score": 4,
                                    "created_utc": 1644708205.0,
                                    "replies": [
                                        {
                                            "body": "I bet he will still be a congressman after it’s over.",
                                            "author": "highjinx411",
                                            "id": "hwqclwa",
                                            "parent_id": "t1_hwpin0u",
                                            "score": 2,
                                            "created_utc": 1644721931.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You know nothing about their careers, families and risks they are taking.  Referencing Elon Musk shows a huge lack of understanding what’s on the line",
            "author": "LotBuilder",
            "id": "hwph9tv",
            "parent_id": "t3_sr39xm",
            "score": -2,
            "created_utc": 1644707616.0,
            "replies": []
        },
        {
            "body": "I never show my face on my public SA photos.  Even though I own my company, my industry is extremely conservative.  Chances are that it would effect my business negatively if any of my clients saw me there.  That’s something I won’t risk for any SB’s convenience.\n\nI have no problem sending a face photo in private chat or text it if we already have a conversation and it seems that our interests are aligned.\n\nFinding a real SD is as hard as finding a real SB.  That’s just the nature of the beast.  Instant gratification is a delusional expectation here.  Also lacking the patience for searching reveals attitude.  How will you have the patience to spend time with your future SD and deal with unforeseen differences if you don’t even have the patience to find one?",
            "author": "EuropeanDaddyDom",
            "id": "hwpjj7z",
            "parent_id": "t3_sr39xm",
            "score": 0,
            "created_utc": 1644708593.0,
            "replies": [
                {
                    "body": "So your conservative clients will be willing to admit they are on Seeking while confronting you negatively for your presence there too? Have I got that right? Why are your conservative clients searching thru SD profiles?",
                    "author": "CaptBrewster",
                    "id": "hwqcc1v",
                    "parent_id": "t1_hwpjj7z",
                    "score": 3,
                    "created_utc": 1644721798.0,
                    "replies": [
                        {
                            "body": "Hypocrites never admit their own presence.  They would say something like “it came to our knowledge…” and I’m not willing to risk that.",
                            "author": "EuropeanDaddyDom",
                            "id": "hwqjvfu",
                            "parent_id": "t1_hwqcc1v",
                            "score": 0,
                            "created_utc": 1644725568.0,
                            "replies": []
                        },
                        {
                            "body": "\\>So your conservative clients will be willing to admit they are on Seeking while confronting you negatively for your presence there too? \n\nDo you really don't understand how the world works? There are many criminal groups scraping Seeking and dozens of dating sites in order to blackmail people.\n\nThere are data dumps done by anons just to mess with both SBs and SDs.\n\nAny client would just say \"i saw your Seeking profile leaked online\", because that's actually a thing that happens way too much.",
                            "author": null,
                            "id": "hwuy24p",
                            "parent_id": "t1_hwqcc1v",
                            "score": 1,
                            "created_utc": 1644805361.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "100% this! I'm a SB and seeing other ladies making posts like OP's is discouraging. It comes off as impatient at best and entitled at worst. No shade against OP. I'm just saying that mining for gold takes time and effort, and those unwilling to put in the man hours will weed themselves out quickly.",
                    "author": "HailToTheQuinn",
                    "id": "hwpms8d",
                    "parent_id": "t1_hwpjj7z",
                    "score": 1,
                    "created_utc": 1644710005.0,
                    "replies": []
                },
                {
                    "body": "OP will never understand! She comes across as immature and entitled.",
                    "author": null,
                    "id": "hwpprmr",
                    "parent_id": "t1_hwpjj7z",
                    "score": -3,
                    "created_utc": 1644711316.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your post reminds me of an M&G where a gal went on a rant on the “losers” she meets in vanilla because they barely have decent paid jobs! I asked her what she did for a living. She said she was “In between” jobs. Then I asked her if she lived alone or with family. She said she lives with roommates!! Nuff said.",
            "author": null,
            "id": "hwpr73x",
            "parent_id": "t3_sr39xm",
            "score": 0,
            "created_utc": 1644711957.0,
            "replies": []
        },
        {
            "body": "The guys - I mean the ones with “average” jobs and “homeless” appearances keep the sugar bowl alive. They pay and if sugar is about “dating on your own terms” than discretion is on their term sheet. So cut them some slack. I can’t speak for all but these guys have not grown up in the age of social media where ever gal poses in their underwear on IG and acts guru on TikTok. Many truly have stuff to protect. Reputations, family etc. \n\nYou are entitled to your views but I am dead sure they would apply to a vanilla site vs a sugar site. If that’s not clear stay on a vanilla site and date boys with no jobs or “below” average jobs.",
            "author": null,
            "id": "hwpp5tl",
            "parent_id": "t3_sr39xm",
            "score": -1,
            "created_utc": 1644711044.0,
            "replies": []
        },
        {
            "body": "Employees (current/former).",
            "author": null,
            "id": "hwrefwz",
            "parent_id": "t3_sr39xm",
            "score": 0,
            "created_utc": 1644745678.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hwss2kv",
            "parent_id": "t3_sr39xm",
            "score": 0,
            "created_utc": 1644772846.0,
            "replies": [
                {
                    "body": "I also have a hidden profile. I have 1 private pics with a pixelated headshot that already gives a good idea how I look like without giving up privacy completely. If I have a good conversation I exchange my telegram or whatsapp that has the same profile pic as on sa but then unfiltered so she knows how I look like. I dont care if sb are filtering me out because I dont have a public pic, I do the filtering, I reach out to potential sb and 99% respond so all the sb filtering out guys because they dont have a public picture, good luck with that strategy :)",
                    "author": "throwaway191746",
                    "id": "hww1csl",
                    "parent_id": "t1_hwss2kv",
                    "score": 2,
                    "created_utc": 1644829302.0,
                    "replies": []
                },
                {
                    "body": "Sounds like you have a good system",
                    "author": "Charlieday474",
                    "id": "hwtpwd5",
                    "parent_id": "t1_hwss2kv",
                    "score": 1,
                    "created_utc": 1644786221.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have a clear photo of me on my profile and a couple private pics. Some guys just request to see them without talking to me first and i'm completely fine with it, don't think much of it. However, I did it once to a guy, just requested to see his privates without saying anything and he has teh fkn audacity to say, \"If you're going to ask for my pictures atleast say hi first\". This biiit I swear.",
            "author": "sushi4442",
            "id": "hwrea7g",
            "parent_id": "t3_sr39xm",
            "score": 1,
            "created_utc": 1644745552.0,
            "replies": []
        },
        {
            "body": "Aspiring SB here - I actually cover up my face for the public pic, and then have private pics with my face. I've actually been very surprised at how many SBs post a lot of public pics. I live in an area where this would be somewhat scandalous & people are still very close minded so I didn't want to be found so easily or with picture search or something. I'm sure I get less hits, but I still get a decent amount of messages. And honestly, I'm ok with that haha",
            "author": "di_caro2811",
            "id": "hwskvmn",
            "parent_id": "t3_sr39xm",
            "score": 1,
            "created_utc": 1644769973.0,
            "replies": [
                {
                    "body": "Yea I don’t show my face either and don’t have a lack of messages. I think men mostly want to see your body anyway.",
                    "author": "Charlieday474",
                    "id": "hwtq9zx",
                    "parent_id": "t1_hwskvmn",
                    "score": 3,
                    "created_utc": 1644786370.0,
                    "replies": [
                        {
                            "body": "Yea, I think so too",
                            "author": "di_caro2811",
                            "id": "hwtslg7",
                            "parent_id": "t1_hwtq9zx",
                            "score": 1,
                            "created_utc": 1644787291.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "\\>I get that it’s pure capitalist offer/demand but I really think it would make the process flow so much better for everyone if men were required to have photos,\n\nThis doesn't make any sense, offer/demand makes it possible for men not to have pics, how would it be any better if they are forced to?\n\nMen are the ones paying for this whole show by the way, so any enforcement would end with less subscriptions.",
            "author": null,
            "id": "hwuwslz",
            "parent_id": "t3_sr39xm",
            "score": 1,
            "created_utc": 1644804823.0,
            "replies": []
        },
        {
            "body": "It's not that only men are allowed discretion. It's because a lot of them are married or in high profile positions. Secondly, looks do matter, but the main allure of the SD is the allowance, an SBs main allure is her physical looks. If you are worried about anonymity I'd wager most sds would be fine with a full body  shot  with a partial face blur.",
            "author": "malcolm_reyn0lds",
            "id": "hww05tq",
            "parent_id": "t3_sr39xm",
            "score": 1,
            "created_utc": 1644828276.0,
            "replies": []
        },
        {
            "body": "They're not,men are like that,I've had SA for like 10 years,never had a face pic up",
            "author": "Alphachadbeard",
            "id": "hwwi2dc",
            "parent_id": "t3_sr39xm",
            "score": 1,
            "created_utc": 1644842576.0,
            "replies": []
        },
        {
            "body": "I wish I could filter SBs to not see filtered pics from hotel toilets",
            "author": null,
            "id": "hwpmuha",
            "parent_id": "t1_hwpgiez",
            "score": 34,
            "created_utc": 1644710032.0,
            "replies": [
                {
                    "body": "Lol 🙈",
                    "author": "Charlieday474",
                    "id": "hwpn5ut",
                    "parent_id": "t1_hwpmuha",
                    "score": 3,
                    "created_utc": 1644710168.0,
                    "replies": []
                },
                {
                    "body": "Pics taken on the job! I avoid those SBs with an 18 feet pole.",
                    "author": null,
                    "id": "hwpqx3o",
                    "parent_id": "t1_hwpmuha",
                    "score": -1,
                    "created_utc": 1644711828.0,
                    "replies": [
                        {
                            "body": "Why?",
                            "author": "Desden213",
                            "id": "hwq73ij",
                            "parent_id": "t1_hwpqx3o",
                            "score": 6,
                            "created_utc": 1644719334.0,
                            "replies": [
                                {
                                    "body": "It could be a red flag they may not be discreet/value discretion, if I had to guess. AKA it shows a lack of self awareness to put a picture of yourself where you are working given the nature of the site.",
                                    "author": "zara_io",
                                    "id": "hwqhtio",
                                    "parent_id": "t1_hwq73ij",
                                    "score": 3,
                                    "created_utc": 1644724517.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "What about strip club locker room?",
                    "author": "SD_AU",
                    "id": "hwvnsli",
                    "parent_id": "t1_hwpmuha",
                    "score": 1,
                    "created_utc": 1644818790.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I didn’t realise! I guess I would miss a lot though, because it is just the habit that men don’t use photos",
            "author": "Charlieday474",
            "id": "hwpn3xz",
            "parent_id": "t1_hwpgiez",
            "score": 17,
            "created_utc": 1644710146.0,
            "replies": []
        },
        {
            "body": "Very true. Good advice",
            "author": "Charlieday474",
            "id": "hwseex0",
            "parent_id": "t1_hwsculm",
            "score": 2,
            "created_utc": 1644767315.0,
            "replies": []
        },
        {
            "body": "Jesus knows 👀👀",
            "author": "peterpmpkneatr",
            "id": "hwpppj4",
            "parent_id": "t1_hwpmbs9",
            "score": 27,
            "created_utc": 1644711289.0,
            "replies": []
        },
        {
            "body": "“Nobody at church” 🙈🙌",
            "author": "Charlieday474",
            "id": "hwpnp57",
            "parent_id": "t1_hwpmbs9",
            "score": 13,
            "created_utc": 1644710398.0,
            "replies": []
        },
        {
            "body": "Right! How would anybody in town who knows you be able to confront you for being on Seeking without having to admit their own presence on Seeking allowing them to see you there? And if they're dudes, why are they searching thru SD profiles?",
            "author": "CaptBrewster",
            "id": "hwqbuoa",
            "parent_id": "t1_hwpmbs9",
            "score": 8,
            "created_utc": 1644721564.0,
            "replies": []
        },
        {
            "body": "If they do recognize you it would be easy to say 👀 oh what were YOU doing on that site? Right? Like calling you out is just admitting they're also on there.",
            "author": "oneangstybiscuit",
            "id": "hwqc19l",
            "parent_id": "t1_hwpmbs9",
            "score": 4,
            "created_utc": 1644721651.0,
            "replies": []
        },
        {
            "body": "Being on seeking is no badge of honor for any guy. The other day at a high end club in Silicon Valley overheard a bunch of over 55 dudes talking about their buddy who now has a hot girlfriend. Then one of them goes she is no girlfriend, she is just an escort he picked up on seeking! \n\nSo yes seeking does not have a very high rank in the bro club. It is looked down as a site for lonely losers or an escort site. \n\nAdd to that 80% of men are married and many are business leaders or society figures in some capacity or other vs say a 22 yo SB who is underemployed and has little to lose. Forget losing her career,  sugaring probably pays her rent and all her bills. Totally different equation.\n\nRight or wrong, public judgement can end careers, and since most sugar daddies have invested a LOT of energy into our careers\n\n In fact I have run into several women on seeking with decent jobs who had blurred faces or limited pictures. I mean which moron would jeopardize their career for a sugar relationship.",
            "author": null,
            "id": "hwrzczm",
            "parent_id": "t1_hwpiv3z",
            "score": 11,
            "created_utc": 1644760319.0,
            "replies": [
                {
                    "body": "\\^\\^ This \\^\\^ - the unvarnished truth",
                    "author": "throwaway6z6",
                    "id": "hws2zvg",
                    "parent_id": "t1_hwrzczm",
                    "score": 7,
                    "created_utc": 1644762190.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Married is a big part of it, but some of us run our own businesses, and they might be business that could be negatively impacted by a report of sugaring. \n\nFor example (and this isn’t my job, just an example), would you take your kid back ti their pediatrician if it came out that the pediatrician was sugaring?  \n\nOr what about a pastor at a church?  \n\nOr a teacher? \n\nRight or wrong, public judgement can end careers, and since most sugar daddies have invested a LOT of energy into our careers it makes sense that we’d protect them. It’s rarely fear of what “bros” at work might think.",
            "author": "freeewillieee",
            "id": "hwq0tse",
            "parent_id": "t1_hwpiv3z",
            "score": 18,
            "created_utc": 1644716406.0,
            "replies": [
                {
                    "body": "I mean, unless the person they're trying to sugar is actually in a situation that's just minor grooming, I don't think it's any of my business. Personal experience though I wouldn't leave a kid alone with any religious leader regardless. Other than that, I assume most people have sex lives or personal lives that are none of my business.",
                    "author": "oneangstybiscuit",
                    "id": "hwqbviz",
                    "parent_id": "t1_hwq0tse",
                    "score": 10,
                    "created_utc": 1644721574.0,
                    "replies": [
                        {
                            "body": "I mean, I definitely agree with you, but I’m also know that most people wouldn’t feel that way, and it’s too big a risk to take. I protect my identity for the sake of my marriage, family, business, and career. Not because of the opinion of anyone at work.",
                            "author": "freeewillieee",
                            "id": "hwqcdzy",
                            "parent_id": "t1_hwqbviz",
                            "score": 6,
                            "created_utc": 1644721825.0,
                            "replies": [
                                {
                                    "body": "\\+1 - Remember Elliot Spitzer? \n\nPeople want to make your sex life their business, if they think you are doing something wrong.",
                                    "author": "DecentOne7895",
                                    "id": "hwqd8rb",
                                    "parent_id": "t1_hwqcdzy",
                                    "score": 10,
                                    "created_utc": 1644722244.0,
                                    "replies": []
                                },
                                {
                                    "body": "Of course and you do what you feel is best. Especially if people have reason to try to make your life difficult, something that isn't a big deal or that they're also guilty of becomes ammunition.",
                                    "author": "oneangstybiscuit",
                                    "id": "hwtyd1k",
                                    "parent_id": "t1_hwqcdzy",
                                    "score": 2,
                                    "created_utc": 1644789635.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "How is the pastor or pediatrician or teacher discovered to be on Seeking?\n\nBy another guy in the community who knows them who must himself be  searching thru SD profiles? That's weird.  How does he rationalize his own Seeking presence? Why is he searching for an SD? \n\nBy a woman in town who is on Seeking herself, yet is shocked. Shocked! I tell you,  to find her daughters teacher on Seeking?\n\nHow does she explain away her Seeking account?",
                    "author": "CaptBrewster",
                    "id": "hwqdaxz",
                    "parent_id": "t1_hwq0tse",
                    "score": 4,
                    "created_utc": 1644722273.0,
                    "replies": [
                        {
                            "body": "Perhaps by a blackmailing SB who exposes him, or falsely charges him with rape and goes to the press?  Perhaps by some religious white knight but jobs who troll the site in search of people to expose?  Perhaps by a former SB who was unhappy with how things ended, so she told the wife, who then told everyone? \n\nThere are a million possibilities that don’t have to include a seeking user outing themselves to out you.",
                            "author": "freeewillieee",
                            "id": "hwqdp4f",
                            "parent_id": "t1_hwqdaxz",
                            "score": 4,
                            "created_utc": 1644722462.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Seeking is basically just another dating site at this point. No different than being on tinder or hinge.",
                    "author": null,
                    "id": "hwqno4u",
                    "parent_id": "t1_hwq0tse",
                    "score": 4,
                    "created_utc": 1644727576.0,
                    "replies": [
                        {
                            "body": "You cannot be more wrong! They are trying to brand it as such but it’s not there yet. For the general population male or female, seeking is a sugaring site and sugaring to them is a form of prostitution. \n\nThe SBs including OP who are pounding the table of the need for SDs to reveal pics and ID will themselves think twice before telling the world they are on seeking or have sugar lovers. \n\nWe all know there is a huge stigma attached. Why is it that women with established careers blur their face on seeking or why is it that most women cringe at the mention of sugar dating and above all seeking will have to clean up all married men - roughly 80% of their clients - if they are truly a dating site vs a sugar site and the ladies will have to stop thinking this is a paid dating format.",
                            "author": null,
                            "id": "hws00cf",
                            "parent_id": "t1_hwqno4u",
                            "score": 2,
                            "created_utc": 1644760672.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "“Right or wrong, public judgement can end careers, and since most sugar daddies have invested a LOT of energy into our careers”\n\nI agree! Actually even young women with good careers prefer a lot of discretion when it comes to sugar dating. Of course if a woman is a sex worker or barely has a real career, she might not care about how she presents herself.",
                    "author": null,
                    "id": "hwrznso",
                    "parent_id": "t1_hwq0tse",
                    "score": 3,
                    "created_utc": 1644760483.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "thats just a false perception of abundance. Any average women can go on a dating app and have hundreds of matches. The real question is how many she is really interested in. The same applies for your hundreds of messages, 99.9% are scams, Johns or guys you are not interested in so these 100s of messages mean absolutely nothing. The real power is in the legit sd because thats what you all want, these profiles have the real upper hand and we are not busy with 100s of messages. Most of us have our profile hidden and reach out to the potential sb.",
            "author": "throwaway191746",
            "id": "hww013s",
            "parent_id": "t1_hwpfhjw",
            "score": 2,
            "created_utc": 1644828167.0,
            "replies": []
        },
        {
            "body": "Oh I don’t doubt that",
            "author": "Charlieday474",
            "id": "hwpnr73",
            "parent_id": "t1_hwpfktv",
            "score": 3,
            "created_utc": 1644710422.0,
            "replies": []
        },
        {
            "body": "Watch them ignore what you said to keep pushing their victim narrative.",
            "author": "daddinoir",
            "id": "hwporj9",
            "parent_id": "t1_hwpfktv",
            "score": -5,
            "created_utc": 1644710865.0,
            "replies": []
        },
        {
            "body": "How would it become known that you are \"associated with a website...\".",
            "author": "CaptBrewster",
            "id": "hwqbepo",
            "parent_id": "t1_hwpqt3i",
            "score": -1,
            "created_utc": 1644721347.0,
            "replies": [
                {
                    "body": "... If someone sees my picture in my profile then they would know I'm active on SA. What are you not understanding?",
                    "author": "bigdickginger",
                    "id": "hwqvhrt",
                    "parent_id": "t1_hwqbepo",
                    "score": 1,
                    "created_utc": 1644732116.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OP seems rather entitled and wants to pick and choose 'equality' while conveniently ignoring that the other side has to pay for the most basic feature of the site and for the SR.",
            "author": "YlangScent",
            "id": "hwrwsq4",
            "parent_id": "t1_hwrupcg",
            "score": 7,
            "created_utc": 1644758892.0,
            "replies": []
        },
        {
            "body": "Why would I…? The fact that I would date someone with worse looks/age than me, doesn’t mean that I would date just anyone, in any condition..! Plenty of attractive older men are interested in being my SDs\n\nI just can’t find them cause they don’t have pictures. Just like the other 1000s of johns, scammers, very unhealthy people etc that i’d never consider. They all blend into a grey anonymous mannequin icon",
            "author": "Charlieday474",
            "id": "hwsfgop",
            "parent_id": "t1_hwrupcg",
            "score": 0,
            "created_utc": 1644767752.0,
            "replies": [
                {
                    "body": ">Plenty of attractive older men are interested in being my SDs  \n>  \n>I just can’t find them cause they don’t have pictures. \n\nThat sounds like thre aren't \"plenty\" of attractive older men interestes in being your SD, otherwise they would have already contacted you.",
                    "author": null,
                    "id": "hwuxa2y",
                    "parent_id": "t1_hwsfgop",
                    "score": 3,
                    "created_utc": 1644805030.0,
                    "replies": [
                        {
                            "body": "I was kind of joking. Yes; they have always been the ones to contact. I’d never find them in the sea of murky waters!",
                            "author": "Charlieday474",
                            "id": "hwxh93y",
                            "parent_id": "t1_hwuxa2y",
                            "score": 1,
                            "created_utc": 1644859059.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I choose my SDs off of looks. I don't want to sleep with an ugly guy, no matter how rich he is. My gag reflex doesn't care how much money you give me - just if you bathe and look good.",
            "author": "alleriamystic",
            "id": "hwpmjo1",
            "parent_id": "t1_hwpfkdl",
            "score": 20,
            "created_utc": 1644709903.0,
            "replies": [
                {
                    "body": "This is exactly why I haven't yet pulled the trigger on sugar dating.  I'm overweight, and most women are turned off by that.  Sadly, even when they are being paid, women (short of hookers) are often as shallow as you are saying you are.  Not all, but most.",
                    "author": "awesomedude2016_2016",
                    "id": "hwqw6oi",
                    "parent_id": "t1_hwpmjo1",
                    "score": 5,
                    "created_utc": 1644732525.0,
                    "replies": [
                        {
                            "body": "Attraction doesn't mean you only date models.\nMy actual boyfriends are a variety of sizes. I like a dad bod and actually avoid buff dudes.\n\nI'm not shallow. I just wouldn't fake attraction for money.",
                            "author": "alleriamystic",
                            "id": "hwrson3",
                            "parent_id": "t1_hwqw6oi",
                            "score": 6,
                            "created_utc": 1644756357.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Exactly. And that IS the difference between sugaring and..random cheap motel encounters…",
                    "author": "Charlieday474",
                    "id": "hwpngoz",
                    "parent_id": "t1_hwpmjo1",
                    "score": 7,
                    "created_utc": 1644710298.0,
                    "replies": []
                },
                {
                    "body": "That is how it shouid be! But that does mean every guy needs to post pics on the site. Also I hear a lot of men show older and false pics where they were 30 lbs lighter and 30 years younger",
                    "author": null,
                    "id": "hws0n83",
                    "parent_id": "t1_hwpmjo1",
                    "score": 3,
                    "created_utc": 1644761006.0,
                    "replies": []
                },
                {
                    "body": "I think you’re looking for vanilla. Which is fine I’ve had 10+ girls tell me in the last month they didn’t want money . But I’m talking about sugaring.",
                    "author": "UnearthlyDinosaur",
                    "id": "hwpogo8",
                    "parent_id": "t1_hwpmjo1",
                    "score": -6,
                    "created_utc": 1644710731.0,
                    "replies": [
                        {
                            "body": "I mean sugaring too. It's still a sugar relationship. If you want women who aren't physically attracted to you to fuck, hire an escort.",
                            "author": "alleriamystic",
                            "id": "hwpomx0",
                            "parent_id": "t1_hwpogo8",
                            "score": 11,
                            "created_utc": 1644710806.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">SDs are chosen based of generosity. \n\nDo you send money to all the potential interests to show that? If she is chosen based on her looks and has to provide proof; and you based on your \"generosity\", what proof do you give? Substitute \"you\" with \"a SD\" at your leisure.",
            "author": "AnSteall",
            "id": "hwr4k8i",
            "parent_id": "t1_hwpfkdl",
            "score": 4,
            "created_utc": 1644738121.0,
            "replies": []
        },
        {
            "body": ">In theory, looks shouldn’t matter for SDs. (...)  \n>  \n>But in the game of sugar, only the sugar babies are expected to be attractive.\n\nWe are playing completely different games then. How do you come up with something like that? (Obvioulsy, you answer this question yourself by suddenly bringing up escorts in the last sentence.)",
            "author": "Inner_Examination_38",
            "id": "hwpglyv",
            "parent_id": "t1_hwpfkdl",
            "score": 13,
            "created_utc": 1644707332.0,
            "replies": [
                {
                    "body": "So you date SDs primarily on what they look like? Maybe you’re looking for vanilla and not an SD?",
                    "author": "UnearthlyDinosaur",
                    "id": "hwphmc6",
                    "parent_id": "t1_hwpglyv",
                    "score": -4,
                    "created_utc": 1644707767.0,
                    "replies": [
                        {
                            "body": "How is wanting an attractive SD a sign to go vanilla?",
                            "author": "MizzKiko",
                            "id": "hwpopb5",
                            "parent_id": "t1_hwphmc6",
                            "score": 9,
                            "created_utc": 1644710837.0,
                            "replies": [
                                {
                                    "body": "You never said anything about wanting an SR.",
                                    "author": "UnearthlyDinosaur",
                                    "id": "hwpotqg",
                                    "parent_id": "t1_hwpopb5",
                                    "score": -5,
                                    "created_utc": 1644710893.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It is a factor. I’m not sure why you jumped to one end to ask her if it’s the primary factor, but it is something for SBs to consider before they delve into a relationship.",
                            "author": "GoodyGoobert",
                            "id": "hwpuxtd",
                            "parent_id": "t1_hwphmc6",
                            "score": 6,
                            "created_utc": 1644713664.0,
                            "replies": []
                        },
                        {
                            "body": "In fact, my SD wouldn't enjoy spending time with me half as much as he does if he didn't know that I am truly attracted to him. So yes, being attracted to someone -- which is more than just looks, but includes looks -- is absolutely necessary for me to get into a SR. In my opinion, this is also one of the most important distinctions between sugaring and escorting.",
                            "author": "Inner_Examination_38",
                            "id": "hwpiysb",
                            "parent_id": "t1_hwphmc6",
                            "score": 14,
                            "created_utc": 1644708344.0,
                            "replies": []
                        },
                        {
                            "body": "Why is that the case? I think an SD ought to look good, take care of himself and be in the top 10% of guys in his age group. Why is that the SD is absolved and it’s ok for him to be FBUS? I mean fat bald ugly and smelly?",
                            "author": null,
                            "id": "hws0z9t",
                            "parent_id": "t1_hwphmc6",
                            "score": 3,
                            "created_utc": 1644761178.0,
                            "replies": [
                                {
                                    "body": "So you won’t date an Sd who is extremely generous but average looking? Would rather have a good looking guy who pays less? No judgment just wondering for my own knowledge",
                                    "author": "UnearthlyDinosaur",
                                    "id": "hwsrffg",
                                    "parent_id": "t1_hws0z9t",
                                    "score": 1,
                                    "created_utc": 1644772600.0,
                                    "replies": [
                                        {
                                            "body": "I am an SD but I firmly believe that money cannot buy attraction. No matter which gender.",
                                            "author": null,
                                            "id": "hwt064o",
                                            "parent_id": "t1_hwsrffg",
                                            "score": 3,
                                            "created_utc": 1644776037.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good point about the marriage, that could be a deterrent. \n\nBut girls do have much to lose too, especially if they have more status and a reputation. I’ve had a few people i know in real life, find me on the website, and it’s not great, cause a lot of people look down on escorts and believe that’s basically what you are",
            "author": "Charlieday474",
            "id": "hwpgnen",
            "parent_id": "t1_hwpfkdl",
            "score": 9,
            "created_utc": 1644707350.0,
            "replies": [
                {
                    "body": "It's not uncommon for SB's to post \"discreet\" pictures which don't show a clear face shot (either off angles, or just showing chin-down basically), and then keep the clear face shots under lock.",
                    "author": "westcoaststyleballs",
                    "id": "hwpj30c",
                    "parent_id": "t1_hwpgnen",
                    "score": 5,
                    "created_utc": 1644708396.0,
                    "replies": []
                },
                {
                    "body": ">I’ve had a few people i know in real life, find me on the website, and it’s not great\n\nSo you understand why people don't post pictures.\n\nNow just think about which way the money flows and you'll understand why you're expected to have a picture and he isn't.\n\nSD's care about your looks, you care about their wallets.",
                    "author": "Athensbirds",
                    "id": "hwr8zge",
                    "parent_id": "t1_hwpgnen",
                    "score": 4,
                    "created_utc": 1644741433.0,
                    "replies": [
                        {
                            "body": "It’s not about “looks” though, it’s about a minimum standard/looking “normal” trustworthy, healthy, not diseased…you likely haven’t seen a lot of these people’s photos. It’s not just bad “looks”. It is scary",
                            "author": "Charlieday474",
                            "id": "hwrg1n6",
                            "parent_id": "t1_hwr8zge",
                            "score": 2,
                            "created_utc": 1644746930.0,
                            "replies": [
                                {
                                    "body": "That's all stuff you can figure out at a M&G.",
                                    "author": "Athensbirds",
                                    "id": "hwrgwp1",
                                    "parent_id": "t1_hwrg1n6",
                                    "score": 2,
                                    "created_utc": 1644747601.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You have a choice. Either don’t sugar or don’t post your pics.",
                    "author": null,
                    "id": "hws0jch",
                    "parent_id": "t1_hwpgnen",
                    "score": 1,
                    "created_utc": 1644760950.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Escorts ask men for photos?\n\nThey do not.",
            "author": "ILikeTheHobby",
            "id": "hwt00yr",
            "parent_id": "t1_hwpfkdl",
            "score": 2,
            "created_utc": 1644775980.0,
            "replies": []
        },
        {
            "body": "Really? Is being an SB a status symbol?",
            "author": "DecentOne7895",
            "id": "hwqdmwr",
            "parent_id": "t1_hwpfkdl",
            "score": 0,
            "created_utc": 1644722432.0,
            "replies": [
                {
                    "body": "😂",
                    "author": "Charlieday474",
                    "id": "hwrg608",
                    "parent_id": "t1_hwqdmwr",
                    "score": 3,
                    "created_utc": 1644747025.0,
                    "replies": []
                },
                {
                    "body": "TikTok",
                    "author": "UnearthlyDinosaur",
                    "id": "hwqknxd",
                    "parent_id": "t1_hwqdmwr",
                    "score": 1,
                    "created_utc": 1644725973.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well put. I mean, it should be obvious lol, but still. Well put",
            "author": "Kevinburnz",
            "id": "hwpptt8",
            "parent_id": "t1_hwpfkdl",
            "score": -1,
            "created_utc": 1644711342.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hwpj9fn",
            "parent_id": "t1_hwpglko",
            "score": 3,
            "created_utc": 1644708474.0,
            "replies": [
                {
                    "body": "How many homeless SDs do you know?\n\nHow many homeless people would you sleep with, Mr SJW?",
                    "author": "AnSteall",
                    "id": "hwr4abg",
                    "parent_id": "t1_hwpj9fn",
                    "score": -2,
                    "created_utc": 1644737918.0,
                    "replies": [
                        {
                            "body": "Y'know, all those homeless supermodels, duh",
                            "author": "SecretPorifera",
                            "id": "hwtzb4w",
                            "parent_id": "t1_hwr4abg",
                            "score": 0,
                            "created_utc": 1644790025.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes that’s a given. It leads to abuse though, I’d say the vast majority of men are just curious, getting off looking at photos of what they believe to be escorts, and just ask for pictures. It makes “real” sugaring really hard",
            "author": "Charlieday474",
            "id": "hwpgyv4",
            "parent_id": "t1_hwpg2w2",
            "score": 7,
            "created_utc": 1644707486.0,
            "replies": [
                {
                    "body": ">I’d say the vast majority of men are just curious\n\nWhat are you basing this on? You think the majority of people are paying over a hundred bucks are curious? That seems massively unlikely. \n\nAlso if you're talking about the free accounts, those can be made for SD and SB alike, neither of which require payment. But the difference is that unpaid SD accounts can not message anyone, all they can do is send picture requests. \n\nIts also easy to filter out any non premium accounts as a SB by simply paying yourself too.",
                    "author": "YlangScent",
                    "id": "hwrjy8t",
                    "parent_id": "t1_hwpgyv4",
                    "score": 6,
                    "created_utc": 1644749968.0,
                    "replies": []
                },
                {
                    "body": "The thing is, good pictures for men are actually a bad thing.  Most women assume good, attractive pictures are either catfishes, or old pictures.  \n\nAlso, men are far more likely to be blackmailed, and with far more serious consequences.",
                    "author": "Acrobatic_Half_6631",
                    "id": "hwplijl",
                    "parent_id": "t1_hwpgyv4",
                    "score": -2,
                    "created_utc": 1644709451.0,
                    "replies": [
                        {
                            "body": "Do you have anything to support that?\n\nA woman is automatically assumed to be a hooker if she \"sleeps around\" and her reputation is far more on the line than a married man's. This happens automatically. Far fewer marriages are broken up by infidelity  than a woman being called a whore for having sexual partners without being in a relationship. Sugar or not.",
                            "author": "AnSteall",
                            "id": "hwr53wj",
                            "parent_id": "t1_hwplijl",
                            "score": 3,
                            "created_utc": 1644738528.0,
                            "replies": [
                                {
                                    "body": "Being called a whore has a much lower average cost than a financially successful man getting a divorce. Divorce is one of the worst things a person can go through and still be physically whole, statistically speaking, for one's financial, physical, and mental health. Being called a whore is a nasty insult, which doesn't hit me particularly hard, but maybe you feel it more. Either way, it's not comparable to a divorce. A divorce is more comparable to getting audited or dragged through a strenuous court trial. And that's *before* you get into what can happen if you didn't have a prenup.",
                                    "author": "SecretPorifera",
                                    "id": "hwu0fsa",
                                    "parent_id": "t1_hwr53wj",
                                    "score": 1,
                                    "created_utc": 1644790503.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "True",
                    "author": "CaptBrewster",
                    "id": "hwqdhju",
                    "parent_id": "t1_hwpgyv4",
                    "score": 1,
                    "created_utc": 1644722362.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Trying to be a sugar daddy can lose you your entire livelihood.\n\nNo, it can't. If you think it can, you are doing something wrong. Your understanding of what it means to \"try being a sugar daddy\" is way off.\n\n>You're literally getting practically free money to be an SB, it SHOULD be difficult.\n\nEh?",
            "author": "Inner_Examination_38",
            "id": "hwpfxse",
            "parent_id": "t1_hwpdr8v",
            "score": 9,
            "created_utc": 1644707047.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hwphnzr",
                    "parent_id": "t1_hwpfxse",
                    "score": -3,
                    "created_utc": 1644707787.0,
                    "replies": [
                        {
                            "body": ">You absolutely can lose your job or certain licenses for being a SD. Many business and professions see sugaring as a ethics violation.\n\nI would really like to know more about that. Losing your job for being on SA which is ostensibly for vanilla dating? Or losing your job for financially supporting one of your girlfriends?\n\n>SDs by definition have more wealth than SBs.\n\nWould never disagree with that!\n\n>He does have a point in SBs getting free money. Aren't SBs supposed to date SDs they are attracted to and not do anything they don't want? So basically going out with a smart, successful, fun guy that they enjoy being around.\n\nI think there's a simple way to test whether it's free money. Stop giving her money. Only if her behavior does not change, it was indeed free money.",
                            "author": "Inner_Examination_38",
                            "id": "hwpjy1g",
                            "parent_id": "t1_hwphnzr",
                            "score": 10,
                            "created_utc": 1644708772.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hwplvjp",
                                    "parent_id": "t1_hwpjy1g",
                                    "score": -2,
                                    "created_utc": 1644709611.0,
                                    "replies": [
                                        {
                                            "body": ">The test would be see if any woman goes on dates without being paid which 99%+ do.\n\nWhy make these generalizations? We are not talking about *any woman* seeing *any man*, but about that *specific woman* who *you* want to date.\n\nMany SDs here have described sugar dating as dating above their league (and being financially supported in return). For the SBs, it means dating below their league as well (and being financially supported in return).",
                                            "author": "Inner_Examination_38",
                                            "id": "hwpn1ct",
                                            "parent_id": "t1_hwplvjp",
                                            "score": 6,
                                            "created_utc": 1644710115.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "hwpp2pv",
                                                    "parent_id": "t1_hwpn1ct",
                                                    "score": -1,
                                                    "created_utc": 1644711005.0,
                                                    "replies": [
                                                        {
                                                            "body": "Agree with that! But I don't see your point here. Yes, SBs prefer vanilla dating but that doesn't mean they are getting something for free. Economically, everything we do (that is a choice) we do because it's our preference. When you spend five dollars on an ice cream, you do so because you have decided that ice cream is more valuable to you than five dollars worth of potatoes. That doesn't mean you get ice cream for free.",
                                                            "author": "Inner_Examination_38",
                                                            "id": "hwprn3h",
                                                            "parent_id": "t1_hwpp2pv",
                                                            "score": 2,
                                                            "created_utc": 1644712164.0,
                                                            "replies": [
                                                                {
                                                                    "body": "If they prefer vanilla dating over sugar then why sugar? If for money then why not escort or just see as many SDs to maximize profit?\n\nEither they prefer sugar over vanilla and the money's just free or there's some moral opposition. \n\n A lot of SBs have some trauma or life experience that makes traditional relationships harder than sugar.",
                                                                    "author": "UseRound7488",
                                                                    "id": "hwpswnm",
                                                                    "parent_id": "t1_hwprn3h",
                                                                    "score": 1,
                                                                    "created_utc": 1644712736.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> No, it can't\n\nYes, it can.  See what I did there?",
                    "author": null,
                    "id": "hwpgimz",
                    "parent_id": "t1_hwpfxse",
                    "score": -5,
                    "created_utc": 1644707293.0,
                    "replies": [
                        {
                            "body": "You're not exactly hiding your genius, are you?",
                            "author": "Inner_Examination_38",
                            "id": "hwpgxdp",
                            "parent_id": "t1_hwpgimz",
                            "score": 7,
                            "created_utc": 1644707469.0,
                            "replies": [
                                {
                                    "body": "Alright sugar baby, keep telling me what SDs deal with.  \n\nI'm reading your other comments ya know.  It's pretty clear you don't like anyone sharing the victim card with you.\n\nYou've got blind spots.  Get over yourself.",
                                    "author": null,
                                    "id": "hwphf1f",
                                    "parent_id": "t1_hwpgxdp",
                                    "score": -5,
                                    "created_utc": 1644707678.0,
                                    "replies": [
                                        {
                                            "body": "Obviously, you haven't read my comments. I don't think I have ever complained or \"played the victim card\". You are the one who thinks he has been treated badly by the world.",
                                            "author": "Inner_Examination_38",
                                            "id": "hwpi9fe",
                                            "parent_id": "t1_hwphf1f",
                                            "score": 7,
                                            "created_utc": 1644708045.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I was wondering the same thing, like this is a SB, telling a SD, how his business is affected by being in the bowl 🤯🤯🤯",
                                            "author": "ModdedDoll",
                                            "id": "hwr74kc",
                                            "parent_id": "t1_hwphf1f",
                                            "score": 0,
                                            "created_utc": 1644740032.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Don’t argue with her. She is very keen on being the victim for the number of hours she spends trying to get a man who spent decades building his wealth. Her life must be so hard.",
                                            "author": "daddinoir",
                                            "id": "hwpoelz",
                                            "parent_id": "t1_hwphf1f",
                                            "score": -4,
                                            "created_utc": 1644710706.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Rich men with young attractive women hanging off their arm are like, a status symbol though. It's literally not going to get you \"canceled.\" Unless you're going out with people under the age of consent or abusing them, it's just met with a \"ha good for him\" and some form of financial and slut shaming for the woman.",
            "author": "oneangstybiscuit",
            "id": "hwqcgo2",
            "parent_id": "t1_hwpdr8v",
            "score": 3,
            "created_utc": 1644721861.0,
            "replies": []
        },
        {
            "body": "I thought Matt Gaetz legitimized it, no?",
            "author": null,
            "id": "hwpe5jq",
            "parent_id": "t1_hwpdr8v",
            "score": -2,
            "created_utc": 1644706291.0,
            "replies": [
                {
                    "body": "Nope.By looking for underage girls he made the perception of SDs much worse",
                    "author": "UnearthlyDinosaur",
                    "id": "hwpfsqq",
                    "parent_id": "t1_hwpe5jq",
                    "score": 2,
                    "created_utc": 1644706987.0,
                    "replies": [
                        {
                            "body": "But he is still a congressman right? So there is that.",
                            "author": "CaptPeleg",
                            "id": "hwpin0u",
                            "parent_id": "t1_hwpfsqq",
                            "score": 4,
                            "created_utc": 1644708205.0,
                            "replies": [
                                {
                                    "body": "I bet he will still be a congressman after it’s over.",
                                    "author": "highjinx411",
                                    "id": "hwqclwa",
                                    "parent_id": "t1_hwpin0u",
                                    "score": 2,
                                    "created_utc": 1644721931.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So your conservative clients will be willing to admit they are on Seeking while confronting you negatively for your presence there too? Have I got that right? Why are your conservative clients searching thru SD profiles?",
            "author": "CaptBrewster",
            "id": "hwqcc1v",
            "parent_id": "t1_hwpjj7z",
            "score": 3,
            "created_utc": 1644721798.0,
            "replies": [
                {
                    "body": "Hypocrites never admit their own presence.  They would say something like “it came to our knowledge…” and I’m not willing to risk that.",
                    "author": "EuropeanDaddyDom",
                    "id": "hwqjvfu",
                    "parent_id": "t1_hwqcc1v",
                    "score": 0,
                    "created_utc": 1644725568.0,
                    "replies": []
                },
                {
                    "body": "\\>So your conservative clients will be willing to admit they are on Seeking while confronting you negatively for your presence there too? \n\nDo you really don't understand how the world works? There are many criminal groups scraping Seeking and dozens of dating sites in order to blackmail people.\n\nThere are data dumps done by anons just to mess with both SBs and SDs.\n\nAny client would just say \"i saw your Seeking profile leaked online\", because that's actually a thing that happens way too much.",
                    "author": null,
                    "id": "hwuy24p",
                    "parent_id": "t1_hwqcc1v",
                    "score": 1,
                    "created_utc": 1644805361.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "100% this! I'm a SB and seeing other ladies making posts like OP's is discouraging. It comes off as impatient at best and entitled at worst. No shade against OP. I'm just saying that mining for gold takes time and effort, and those unwilling to put in the man hours will weed themselves out quickly.",
            "author": "HailToTheQuinn",
            "id": "hwpms8d",
            "parent_id": "t1_hwpjj7z",
            "score": 1,
            "created_utc": 1644710005.0,
            "replies": []
        },
        {
            "body": "OP will never understand! She comes across as immature and entitled.",
            "author": null,
            "id": "hwpprmr",
            "parent_id": "t1_hwpjj7z",
            "score": -3,
            "created_utc": 1644711316.0,
            "replies": []
        },
        {
            "body": "I also have a hidden profile. I have 1 private pics with a pixelated headshot that already gives a good idea how I look like without giving up privacy completely. If I have a good conversation I exchange my telegram or whatsapp that has the same profile pic as on sa but then unfiltered so she knows how I look like. I dont care if sb are filtering me out because I dont have a public pic, I do the filtering, I reach out to potential sb and 99% respond so all the sb filtering out guys because they dont have a public picture, good luck with that strategy :)",
            "author": "throwaway191746",
            "id": "hww1csl",
            "parent_id": "t1_hwss2kv",
            "score": 2,
            "created_utc": 1644829302.0,
            "replies": []
        },
        {
            "body": "Sounds like you have a good system",
            "author": "Charlieday474",
            "id": "hwtpwd5",
            "parent_id": "t1_hwss2kv",
            "score": 1,
            "created_utc": 1644786221.0,
            "replies": []
        },
        {
            "body": "Yea I don’t show my face either and don’t have a lack of messages. I think men mostly want to see your body anyway.",
            "author": "Charlieday474",
            "id": "hwtq9zx",
            "parent_id": "t1_hwskvmn",
            "score": 3,
            "created_utc": 1644786370.0,
            "replies": [
                {
                    "body": "Yea, I think so too",
                    "author": "di_caro2811",
                    "id": "hwtslg7",
                    "parent_id": "t1_hwtq9zx",
                    "score": 1,
                    "created_utc": 1644787291.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol 🙈",
            "author": "Charlieday474",
            "id": "hwpn5ut",
            "parent_id": "t1_hwpmuha",
            "score": 3,
            "created_utc": 1644710168.0,
            "replies": []
        },
        {
            "body": "Pics taken on the job! I avoid those SBs with an 18 feet pole.",
            "author": null,
            "id": "hwpqx3o",
            "parent_id": "t1_hwpmuha",
            "score": -1,
            "created_utc": 1644711828.0,
            "replies": [
                {
                    "body": "Why?",
                    "author": "Desden213",
                    "id": "hwq73ij",
                    "parent_id": "t1_hwpqx3o",
                    "score": 6,
                    "created_utc": 1644719334.0,
                    "replies": [
                        {
                            "body": "It could be a red flag they may not be discreet/value discretion, if I had to guess. AKA it shows a lack of self awareness to put a picture of yourself where you are working given the nature of the site.",
                            "author": "zara_io",
                            "id": "hwqhtio",
                            "parent_id": "t1_hwq73ij",
                            "score": 3,
                            "created_utc": 1644724517.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What about strip club locker room?",
            "author": "SD_AU",
            "id": "hwvnsli",
            "parent_id": "t1_hwpmuha",
            "score": 1,
            "created_utc": 1644818790.0,
            "replies": []
        },
        {
            "body": "\\^\\^ This \\^\\^ - the unvarnished truth",
            "author": "throwaway6z6",
            "id": "hws2zvg",
            "parent_id": "t1_hwrzczm",
            "score": 7,
            "created_utc": 1644762190.0,
            "replies": []
        },
        {
            "body": "I mean, unless the person they're trying to sugar is actually in a situation that's just minor grooming, I don't think it's any of my business. Personal experience though I wouldn't leave a kid alone with any religious leader regardless. Other than that, I assume most people have sex lives or personal lives that are none of my business.",
            "author": "oneangstybiscuit",
            "id": "hwqbviz",
            "parent_id": "t1_hwq0tse",
            "score": 10,
            "created_utc": 1644721574.0,
            "replies": [
                {
                    "body": "I mean, I definitely agree with you, but I’m also know that most people wouldn’t feel that way, and it’s too big a risk to take. I protect my identity for the sake of my marriage, family, business, and career. Not because of the opinion of anyone at work.",
                    "author": "freeewillieee",
                    "id": "hwqcdzy",
                    "parent_id": "t1_hwqbviz",
                    "score": 6,
                    "created_utc": 1644721825.0,
                    "replies": [
                        {
                            "body": "\\+1 - Remember Elliot Spitzer? \n\nPeople want to make your sex life their business, if they think you are doing something wrong.",
                            "author": "DecentOne7895",
                            "id": "hwqd8rb",
                            "parent_id": "t1_hwqcdzy",
                            "score": 10,
                            "created_utc": 1644722244.0,
                            "replies": []
                        },
                        {
                            "body": "Of course and you do what you feel is best. Especially if people have reason to try to make your life difficult, something that isn't a big deal or that they're also guilty of becomes ammunition.",
                            "author": "oneangstybiscuit",
                            "id": "hwtyd1k",
                            "parent_id": "t1_hwqcdzy",
                            "score": 2,
                            "created_utc": 1644789635.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "How is the pastor or pediatrician or teacher discovered to be on Seeking?\n\nBy another guy in the community who knows them who must himself be  searching thru SD profiles? That's weird.  How does he rationalize his own Seeking presence? Why is he searching for an SD? \n\nBy a woman in town who is on Seeking herself, yet is shocked. Shocked! I tell you,  to find her daughters teacher on Seeking?\n\nHow does she explain away her Seeking account?",
            "author": "CaptBrewster",
            "id": "hwqdaxz",
            "parent_id": "t1_hwq0tse",
            "score": 4,
            "created_utc": 1644722273.0,
            "replies": [
                {
                    "body": "Perhaps by a blackmailing SB who exposes him, or falsely charges him with rape and goes to the press?  Perhaps by some religious white knight but jobs who troll the site in search of people to expose?  Perhaps by a former SB who was unhappy with how things ended, so she told the wife, who then told everyone? \n\nThere are a million possibilities that don’t have to include a seeking user outing themselves to out you.",
                    "author": "freeewillieee",
                    "id": "hwqdp4f",
                    "parent_id": "t1_hwqdaxz",
                    "score": 4,
                    "created_utc": 1644722462.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Seeking is basically just another dating site at this point. No different than being on tinder or hinge.",
            "author": null,
            "id": "hwqno4u",
            "parent_id": "t1_hwq0tse",
            "score": 4,
            "created_utc": 1644727576.0,
            "replies": [
                {
                    "body": "You cannot be more wrong! They are trying to brand it as such but it’s not there yet. For the general population male or female, seeking is a sugaring site and sugaring to them is a form of prostitution. \n\nThe SBs including OP who are pounding the table of the need for SDs to reveal pics and ID will themselves think twice before telling the world they are on seeking or have sugar lovers. \n\nWe all know there is a huge stigma attached. Why is it that women with established careers blur their face on seeking or why is it that most women cringe at the mention of sugar dating and above all seeking will have to clean up all married men - roughly 80% of their clients - if they are truly a dating site vs a sugar site and the ladies will have to stop thinking this is a paid dating format.",
                    "author": null,
                    "id": "hws00cf",
                    "parent_id": "t1_hwqno4u",
                    "score": 2,
                    "created_utc": 1644760672.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“Right or wrong, public judgement can end careers, and since most sugar daddies have invested a LOT of energy into our careers”\n\nI agree! Actually even young women with good careers prefer a lot of discretion when it comes to sugar dating. Of course if a woman is a sex worker or barely has a real career, she might not care about how she presents herself.",
            "author": null,
            "id": "hwrznso",
            "parent_id": "t1_hwq0tse",
            "score": 3,
            "created_utc": 1644760483.0,
            "replies": []
        },
        {
            "body": "... If someone sees my picture in my profile then they would know I'm active on SA. What are you not understanding?",
            "author": "bigdickginger",
            "id": "hwqvhrt",
            "parent_id": "t1_hwqbepo",
            "score": 1,
            "created_utc": 1644732116.0,
            "replies": []
        },
        {
            "body": ">Plenty of attractive older men are interested in being my SDs  \n>  \n>I just can’t find them cause they don’t have pictures. \n\nThat sounds like thre aren't \"plenty\" of attractive older men interestes in being your SD, otherwise they would have already contacted you.",
            "author": null,
            "id": "hwuxa2y",
            "parent_id": "t1_hwsfgop",
            "score": 3,
            "created_utc": 1644805030.0,
            "replies": [
                {
                    "body": "I was kind of joking. Yes; they have always been the ones to contact. I’d never find them in the sea of murky waters!",
                    "author": "Charlieday474",
                    "id": "hwxh93y",
                    "parent_id": "t1_hwuxa2y",
                    "score": 1,
                    "created_utc": 1644859059.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is exactly why I haven't yet pulled the trigger on sugar dating.  I'm overweight, and most women are turned off by that.  Sadly, even when they are being paid, women (short of hookers) are often as shallow as you are saying you are.  Not all, but most.",
            "author": "awesomedude2016_2016",
            "id": "hwqw6oi",
            "parent_id": "t1_hwpmjo1",
            "score": 5,
            "created_utc": 1644732525.0,
            "replies": [
                {
                    "body": "Attraction doesn't mean you only date models.\nMy actual boyfriends are a variety of sizes. I like a dad bod and actually avoid buff dudes.\n\nI'm not shallow. I just wouldn't fake attraction for money.",
                    "author": "alleriamystic",
                    "id": "hwrson3",
                    "parent_id": "t1_hwqw6oi",
                    "score": 6,
                    "created_utc": 1644756357.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly. And that IS the difference between sugaring and..random cheap motel encounters…",
            "author": "Charlieday474",
            "id": "hwpngoz",
            "parent_id": "t1_hwpmjo1",
            "score": 7,
            "created_utc": 1644710298.0,
            "replies": []
        },
        {
            "body": "That is how it shouid be! But that does mean every guy needs to post pics on the site. Also I hear a lot of men show older and false pics where they were 30 lbs lighter and 30 years younger",
            "author": null,
            "id": "hws0n83",
            "parent_id": "t1_hwpmjo1",
            "score": 3,
            "created_utc": 1644761006.0,
            "replies": []
        },
        {
            "body": "I think you’re looking for vanilla. Which is fine I’ve had 10+ girls tell me in the last month they didn’t want money . But I’m talking about sugaring.",
            "author": "UnearthlyDinosaur",
            "id": "hwpogo8",
            "parent_id": "t1_hwpmjo1",
            "score": -6,
            "created_utc": 1644710731.0,
            "replies": [
                {
                    "body": "I mean sugaring too. It's still a sugar relationship. If you want women who aren't physically attracted to you to fuck, hire an escort.",
                    "author": "alleriamystic",
                    "id": "hwpomx0",
                    "parent_id": "t1_hwpogo8",
                    "score": 11,
                    "created_utc": 1644710806.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So you date SDs primarily on what they look like? Maybe you’re looking for vanilla and not an SD?",
            "author": "UnearthlyDinosaur",
            "id": "hwphmc6",
            "parent_id": "t1_hwpglyv",
            "score": -4,
            "created_utc": 1644707767.0,
            "replies": [
                {
                    "body": "How is wanting an attractive SD a sign to go vanilla?",
                    "author": "MizzKiko",
                    "id": "hwpopb5",
                    "parent_id": "t1_hwphmc6",
                    "score": 9,
                    "created_utc": 1644710837.0,
                    "replies": [
                        {
                            "body": "You never said anything about wanting an SR.",
                            "author": "UnearthlyDinosaur",
                            "id": "hwpotqg",
                            "parent_id": "t1_hwpopb5",
                            "score": -5,
                            "created_utc": 1644710893.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It is a factor. I’m not sure why you jumped to one end to ask her if it’s the primary factor, but it is something for SBs to consider before they delve into a relationship.",
                    "author": "GoodyGoobert",
                    "id": "hwpuxtd",
                    "parent_id": "t1_hwphmc6",
                    "score": 6,
                    "created_utc": 1644713664.0,
                    "replies": []
                },
                {
                    "body": "In fact, my SD wouldn't enjoy spending time with me half as much as he does if he didn't know that I am truly attracted to him. So yes, being attracted to someone -- which is more than just looks, but includes looks -- is absolutely necessary for me to get into a SR. In my opinion, this is also one of the most important distinctions between sugaring and escorting.",
                    "author": "Inner_Examination_38",
                    "id": "hwpiysb",
                    "parent_id": "t1_hwphmc6",
                    "score": 14,
                    "created_utc": 1644708344.0,
                    "replies": []
                },
                {
                    "body": "Why is that the case? I think an SD ought to look good, take care of himself and be in the top 10% of guys in his age group. Why is that the SD is absolved and it’s ok for him to be FBUS? I mean fat bald ugly and smelly?",
                    "author": null,
                    "id": "hws0z9t",
                    "parent_id": "t1_hwphmc6",
                    "score": 3,
                    "created_utc": 1644761178.0,
                    "replies": [
                        {
                            "body": "So you won’t date an Sd who is extremely generous but average looking? Would rather have a good looking guy who pays less? No judgment just wondering for my own knowledge",
                            "author": "UnearthlyDinosaur",
                            "id": "hwsrffg",
                            "parent_id": "t1_hws0z9t",
                            "score": 1,
                            "created_utc": 1644772600.0,
                            "replies": [
                                {
                                    "body": "I am an SD but I firmly believe that money cannot buy attraction. No matter which gender.",
                                    "author": null,
                                    "id": "hwt064o",
                                    "parent_id": "t1_hwsrffg",
                                    "score": 3,
                                    "created_utc": 1644776037.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's not uncommon for SB's to post \"discreet\" pictures which don't show a clear face shot (either off angles, or just showing chin-down basically), and then keep the clear face shots under lock.",
            "author": "westcoaststyleballs",
            "id": "hwpj30c",
            "parent_id": "t1_hwpgnen",
            "score": 5,
            "created_utc": 1644708396.0,
            "replies": []
        },
        {
            "body": ">I’ve had a few people i know in real life, find me on the website, and it’s not great\n\nSo you understand why people don't post pictures.\n\nNow just think about which way the money flows and you'll understand why you're expected to have a picture and he isn't.\n\nSD's care about your looks, you care about their wallets.",
            "author": "Athensbirds",
            "id": "hwr8zge",
            "parent_id": "t1_hwpgnen",
            "score": 4,
            "created_utc": 1644741433.0,
            "replies": [
                {
                    "body": "It’s not about “looks” though, it’s about a minimum standard/looking “normal” trustworthy, healthy, not diseased…you likely haven’t seen a lot of these people’s photos. It’s not just bad “looks”. It is scary",
                    "author": "Charlieday474",
                    "id": "hwrg1n6",
                    "parent_id": "t1_hwr8zge",
                    "score": 2,
                    "created_utc": 1644746930.0,
                    "replies": [
                        {
                            "body": "That's all stuff you can figure out at a M&G.",
                            "author": "Athensbirds",
                            "id": "hwrgwp1",
                            "parent_id": "t1_hwrg1n6",
                            "score": 2,
                            "created_utc": 1644747601.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You have a choice. Either don’t sugar or don’t post your pics.",
            "author": null,
            "id": "hws0jch",
            "parent_id": "t1_hwpgnen",
            "score": 1,
            "created_utc": 1644760950.0,
            "replies": []
        },
        {
            "body": "😂",
            "author": "Charlieday474",
            "id": "hwrg608",
            "parent_id": "t1_hwqdmwr",
            "score": 3,
            "created_utc": 1644747025.0,
            "replies": []
        },
        {
            "body": "TikTok",
            "author": "UnearthlyDinosaur",
            "id": "hwqknxd",
            "parent_id": "t1_hwqdmwr",
            "score": 1,
            "created_utc": 1644725973.0,
            "replies": []
        },
        {
            "body": "How many homeless SDs do you know?\n\nHow many homeless people would you sleep with, Mr SJW?",
            "author": "AnSteall",
            "id": "hwr4abg",
            "parent_id": "t1_hwpj9fn",
            "score": -2,
            "created_utc": 1644737918.0,
            "replies": [
                {
                    "body": "Y'know, all those homeless supermodels, duh",
                    "author": "SecretPorifera",
                    "id": "hwtzb4w",
                    "parent_id": "t1_hwr4abg",
                    "score": 0,
                    "created_utc": 1644790025.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">I’d say the vast majority of men are just curious\n\nWhat are you basing this on? You think the majority of people are paying over a hundred bucks are curious? That seems massively unlikely. \n\nAlso if you're talking about the free accounts, those can be made for SD and SB alike, neither of which require payment. But the difference is that unpaid SD accounts can not message anyone, all they can do is send picture requests. \n\nIts also easy to filter out any non premium accounts as a SB by simply paying yourself too.",
            "author": "YlangScent",
            "id": "hwrjy8t",
            "parent_id": "t1_hwpgyv4",
            "score": 6,
            "created_utc": 1644749968.0,
            "replies": []
        },
        {
            "body": "The thing is, good pictures for men are actually a bad thing.  Most women assume good, attractive pictures are either catfishes, or old pictures.  \n\nAlso, men are far more likely to be blackmailed, and with far more serious consequences.",
            "author": "Acrobatic_Half_6631",
            "id": "hwplijl",
            "parent_id": "t1_hwpgyv4",
            "score": -2,
            "created_utc": 1644709451.0,
            "replies": [
                {
                    "body": "Do you have anything to support that?\n\nA woman is automatically assumed to be a hooker if she \"sleeps around\" and her reputation is far more on the line than a married man's. This happens automatically. Far fewer marriages are broken up by infidelity  than a woman being called a whore for having sexual partners without being in a relationship. Sugar or not.",
                    "author": "AnSteall",
                    "id": "hwr53wj",
                    "parent_id": "t1_hwplijl",
                    "score": 3,
                    "created_utc": 1644738528.0,
                    "replies": [
                        {
                            "body": "Being called a whore has a much lower average cost than a financially successful man getting a divorce. Divorce is one of the worst things a person can go through and still be physically whole, statistically speaking, for one's financial, physical, and mental health. Being called a whore is a nasty insult, which doesn't hit me particularly hard, but maybe you feel it more. Either way, it's not comparable to a divorce. A divorce is more comparable to getting audited or dragged through a strenuous court trial. And that's *before* you get into what can happen if you didn't have a prenup.",
                            "author": "SecretPorifera",
                            "id": "hwu0fsa",
                            "parent_id": "t1_hwr53wj",
                            "score": 1,
                            "created_utc": 1644790503.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "True",
            "author": "CaptBrewster",
            "id": "hwqdhju",
            "parent_id": "t1_hwpgyv4",
            "score": 1,
            "created_utc": 1644722362.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hwphnzr",
            "parent_id": "t1_hwpfxse",
            "score": -3,
            "created_utc": 1644707787.0,
            "replies": [
                {
                    "body": ">You absolutely can lose your job or certain licenses for being a SD. Many business and professions see sugaring as a ethics violation.\n\nI would really like to know more about that. Losing your job for being on SA which is ostensibly for vanilla dating? Or losing your job for financially supporting one of your girlfriends?\n\n>SDs by definition have more wealth than SBs.\n\nWould never disagree with that!\n\n>He does have a point in SBs getting free money. Aren't SBs supposed to date SDs they are attracted to and not do anything they don't want? So basically going out with a smart, successful, fun guy that they enjoy being around.\n\nI think there's a simple way to test whether it's free money. Stop giving her money. Only if her behavior does not change, it was indeed free money.",
                    "author": "Inner_Examination_38",
                    "id": "hwpjy1g",
                    "parent_id": "t1_hwphnzr",
                    "score": 10,
                    "created_utc": 1644708772.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hwplvjp",
                            "parent_id": "t1_hwpjy1g",
                            "score": -2,
                            "created_utc": 1644709611.0,
                            "replies": [
                                {
                                    "body": ">The test would be see if any woman goes on dates without being paid which 99%+ do.\n\nWhy make these generalizations? We are not talking about *any woman* seeing *any man*, but about that *specific woman* who *you* want to date.\n\nMany SDs here have described sugar dating as dating above their league (and being financially supported in return). For the SBs, it means dating below their league as well (and being financially supported in return).",
                                    "author": "Inner_Examination_38",
                                    "id": "hwpn1ct",
                                    "parent_id": "t1_hwplvjp",
                                    "score": 6,
                                    "created_utc": 1644710115.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hwpp2pv",
                                            "parent_id": "t1_hwpn1ct",
                                            "score": -1,
                                            "created_utc": 1644711005.0,
                                            "replies": [
                                                {
                                                    "body": "Agree with that! But I don't see your point here. Yes, SBs prefer vanilla dating but that doesn't mean they are getting something for free. Economically, everything we do (that is a choice) we do because it's our preference. When you spend five dollars on an ice cream, you do so because you have decided that ice cream is more valuable to you than five dollars worth of potatoes. That doesn't mean you get ice cream for free.",
                                                    "author": "Inner_Examination_38",
                                                    "id": "hwprn3h",
                                                    "parent_id": "t1_hwpp2pv",
                                                    "score": 2,
                                                    "created_utc": 1644712164.0,
                                                    "replies": [
                                                        {
                                                            "body": "If they prefer vanilla dating over sugar then why sugar? If for money then why not escort or just see as many SDs to maximize profit?\n\nEither they prefer sugar over vanilla and the money's just free or there's some moral opposition. \n\n A lot of SBs have some trauma or life experience that makes traditional relationships harder than sugar.",
                                                            "author": "UseRound7488",
                                                            "id": "hwpswnm",
                                                            "parent_id": "t1_hwprn3h",
                                                            "score": 1,
                                                            "created_utc": 1644712736.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> No, it can't\n\nYes, it can.  See what I did there?",
            "author": null,
            "id": "hwpgimz",
            "parent_id": "t1_hwpfxse",
            "score": -5,
            "created_utc": 1644707293.0,
            "replies": [
                {
                    "body": "You're not exactly hiding your genius, are you?",
                    "author": "Inner_Examination_38",
                    "id": "hwpgxdp",
                    "parent_id": "t1_hwpgimz",
                    "score": 7,
                    "created_utc": 1644707469.0,
                    "replies": [
                        {
                            "body": "Alright sugar baby, keep telling me what SDs deal with.  \n\nI'm reading your other comments ya know.  It's pretty clear you don't like anyone sharing the victim card with you.\n\nYou've got blind spots.  Get over yourself.",
                            "author": null,
                            "id": "hwphf1f",
                            "parent_id": "t1_hwpgxdp",
                            "score": -5,
                            "created_utc": 1644707678.0,
                            "replies": [
                                {
                                    "body": "Obviously, you haven't read my comments. I don't think I have ever complained or \"played the victim card\". You are the one who thinks he has been treated badly by the world.",
                                    "author": "Inner_Examination_38",
                                    "id": "hwpi9fe",
                                    "parent_id": "t1_hwphf1f",
                                    "score": 7,
                                    "created_utc": 1644708045.0,
                                    "replies": []
                                },
                                {
                                    "body": "I was wondering the same thing, like this is a SB, telling a SD, how his business is affected by being in the bowl 🤯🤯🤯",
                                    "author": "ModdedDoll",
                                    "id": "hwr74kc",
                                    "parent_id": "t1_hwphf1f",
                                    "score": 0,
                                    "created_utc": 1644740032.0,
                                    "replies": []
                                },
                                {
                                    "body": "Don’t argue with her. She is very keen on being the victim for the number of hours she spends trying to get a man who spent decades building his wealth. Her life must be so hard.",
                                    "author": "daddinoir",
                                    "id": "hwpoelz",
                                    "parent_id": "t1_hwphf1f",
                                    "score": -4,
                                    "created_utc": 1644710706.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nope.By looking for underage girls he made the perception of SDs much worse",
            "author": "UnearthlyDinosaur",
            "id": "hwpfsqq",
            "parent_id": "t1_hwpe5jq",
            "score": 2,
            "created_utc": 1644706987.0,
            "replies": [
                {
                    "body": "But he is still a congressman right? So there is that.",
                    "author": "CaptPeleg",
                    "id": "hwpin0u",
                    "parent_id": "t1_hwpfsqq",
                    "score": 4,
                    "created_utc": 1644708205.0,
                    "replies": [
                        {
                            "body": "I bet he will still be a congressman after it’s over.",
                            "author": "highjinx411",
                            "id": "hwqclwa",
                            "parent_id": "t1_hwpin0u",
                            "score": 2,
                            "created_utc": 1644721931.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hypocrites never admit their own presence.  They would say something like “it came to our knowledge…” and I’m not willing to risk that.",
            "author": "EuropeanDaddyDom",
            "id": "hwqjvfu",
            "parent_id": "t1_hwqcc1v",
            "score": 0,
            "created_utc": 1644725568.0,
            "replies": []
        },
        {
            "body": "\\>So your conservative clients will be willing to admit they are on Seeking while confronting you negatively for your presence there too? \n\nDo you really don't understand how the world works? There are many criminal groups scraping Seeking and dozens of dating sites in order to blackmail people.\n\nThere are data dumps done by anons just to mess with both SBs and SDs.\n\nAny client would just say \"i saw your Seeking profile leaked online\", because that's actually a thing that happens way too much.",
            "author": null,
            "id": "hwuy24p",
            "parent_id": "t1_hwqcc1v",
            "score": 1,
            "created_utc": 1644805361.0,
            "replies": []
        },
        {
            "body": "Yea, I think so too",
            "author": "di_caro2811",
            "id": "hwtslg7",
            "parent_id": "t1_hwtq9zx",
            "score": 1,
            "created_utc": 1644787291.0,
            "replies": []
        },
        {
            "body": "Why?",
            "author": "Desden213",
            "id": "hwq73ij",
            "parent_id": "t1_hwpqx3o",
            "score": 6,
            "created_utc": 1644719334.0,
            "replies": [
                {
                    "body": "It could be a red flag they may not be discreet/value discretion, if I had to guess. AKA it shows a lack of self awareness to put a picture of yourself where you are working given the nature of the site.",
                    "author": "zara_io",
                    "id": "hwqhtio",
                    "parent_id": "t1_hwq73ij",
                    "score": 3,
                    "created_utc": 1644724517.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean, I definitely agree with you, but I’m also know that most people wouldn’t feel that way, and it’s too big a risk to take. I protect my identity for the sake of my marriage, family, business, and career. Not because of the opinion of anyone at work.",
            "author": "freeewillieee",
            "id": "hwqcdzy",
            "parent_id": "t1_hwqbviz",
            "score": 6,
            "created_utc": 1644721825.0,
            "replies": [
                {
                    "body": "\\+1 - Remember Elliot Spitzer? \n\nPeople want to make your sex life their business, if they think you are doing something wrong.",
                    "author": "DecentOne7895",
                    "id": "hwqd8rb",
                    "parent_id": "t1_hwqcdzy",
                    "score": 10,
                    "created_utc": 1644722244.0,
                    "replies": []
                },
                {
                    "body": "Of course and you do what you feel is best. Especially if people have reason to try to make your life difficult, something that isn't a big deal or that they're also guilty of becomes ammunition.",
                    "author": "oneangstybiscuit",
                    "id": "hwtyd1k",
                    "parent_id": "t1_hwqcdzy",
                    "score": 2,
                    "created_utc": 1644789635.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Perhaps by a blackmailing SB who exposes him, or falsely charges him with rape and goes to the press?  Perhaps by some religious white knight but jobs who troll the site in search of people to expose?  Perhaps by a former SB who was unhappy with how things ended, so she told the wife, who then told everyone? \n\nThere are a million possibilities that don’t have to include a seeking user outing themselves to out you.",
            "author": "freeewillieee",
            "id": "hwqdp4f",
            "parent_id": "t1_hwqdaxz",
            "score": 4,
            "created_utc": 1644722462.0,
            "replies": []
        },
        {
            "body": "You cannot be more wrong! They are trying to brand it as such but it’s not there yet. For the general population male or female, seeking is a sugaring site and sugaring to them is a form of prostitution. \n\nThe SBs including OP who are pounding the table of the need for SDs to reveal pics and ID will themselves think twice before telling the world they are on seeking or have sugar lovers. \n\nWe all know there is a huge stigma attached. Why is it that women with established careers blur their face on seeking or why is it that most women cringe at the mention of sugar dating and above all seeking will have to clean up all married men - roughly 80% of their clients - if they are truly a dating site vs a sugar site and the ladies will have to stop thinking this is a paid dating format.",
            "author": null,
            "id": "hws00cf",
            "parent_id": "t1_hwqno4u",
            "score": 2,
            "created_utc": 1644760672.0,
            "replies": []
        },
        {
            "body": "I was kind of joking. Yes; they have always been the ones to contact. I’d never find them in the sea of murky waters!",
            "author": "Charlieday474",
            "id": "hwxh93y",
            "parent_id": "t1_hwuxa2y",
            "score": 1,
            "created_utc": 1644859059.0,
            "replies": []
        },
        {
            "body": "Attraction doesn't mean you only date models.\nMy actual boyfriends are a variety of sizes. I like a dad bod and actually avoid buff dudes.\n\nI'm not shallow. I just wouldn't fake attraction for money.",
            "author": "alleriamystic",
            "id": "hwrson3",
            "parent_id": "t1_hwqw6oi",
            "score": 6,
            "created_utc": 1644756357.0,
            "replies": []
        },
        {
            "body": "I mean sugaring too. It's still a sugar relationship. If you want women who aren't physically attracted to you to fuck, hire an escort.",
            "author": "alleriamystic",
            "id": "hwpomx0",
            "parent_id": "t1_hwpogo8",
            "score": 11,
            "created_utc": 1644710806.0,
            "replies": []
        },
        {
            "body": "How is wanting an attractive SD a sign to go vanilla?",
            "author": "MizzKiko",
            "id": "hwpopb5",
            "parent_id": "t1_hwphmc6",
            "score": 9,
            "created_utc": 1644710837.0,
            "replies": [
                {
                    "body": "You never said anything about wanting an SR.",
                    "author": "UnearthlyDinosaur",
                    "id": "hwpotqg",
                    "parent_id": "t1_hwpopb5",
                    "score": -5,
                    "created_utc": 1644710893.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It is a factor. I’m not sure why you jumped to one end to ask her if it’s the primary factor, but it is something for SBs to consider before they delve into a relationship.",
            "author": "GoodyGoobert",
            "id": "hwpuxtd",
            "parent_id": "t1_hwphmc6",
            "score": 6,
            "created_utc": 1644713664.0,
            "replies": []
        },
        {
            "body": "In fact, my SD wouldn't enjoy spending time with me half as much as he does if he didn't know that I am truly attracted to him. So yes, being attracted to someone -- which is more than just looks, but includes looks -- is absolutely necessary for me to get into a SR. In my opinion, this is also one of the most important distinctions between sugaring and escorting.",
            "author": "Inner_Examination_38",
            "id": "hwpiysb",
            "parent_id": "t1_hwphmc6",
            "score": 14,
            "created_utc": 1644708344.0,
            "replies": []
        },
        {
            "body": "Why is that the case? I think an SD ought to look good, take care of himself and be in the top 10% of guys in his age group. Why is that the SD is absolved and it’s ok for him to be FBUS? I mean fat bald ugly and smelly?",
            "author": null,
            "id": "hws0z9t",
            "parent_id": "t1_hwphmc6",
            "score": 3,
            "created_utc": 1644761178.0,
            "replies": [
                {
                    "body": "So you won’t date an Sd who is extremely generous but average looking? Would rather have a good looking guy who pays less? No judgment just wondering for my own knowledge",
                    "author": "UnearthlyDinosaur",
                    "id": "hwsrffg",
                    "parent_id": "t1_hws0z9t",
                    "score": 1,
                    "created_utc": 1644772600.0,
                    "replies": [
                        {
                            "body": "I am an SD but I firmly believe that money cannot buy attraction. No matter which gender.",
                            "author": null,
                            "id": "hwt064o",
                            "parent_id": "t1_hwsrffg",
                            "score": 3,
                            "created_utc": 1644776037.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s not about “looks” though, it’s about a minimum standard/looking “normal” trustworthy, healthy, not diseased…you likely haven’t seen a lot of these people’s photos. It’s not just bad “looks”. It is scary",
            "author": "Charlieday474",
            "id": "hwrg1n6",
            "parent_id": "t1_hwr8zge",
            "score": 2,
            "created_utc": 1644746930.0,
            "replies": [
                {
                    "body": "That's all stuff you can figure out at a M&G.",
                    "author": "Athensbirds",
                    "id": "hwrgwp1",
                    "parent_id": "t1_hwrg1n6",
                    "score": 2,
                    "created_utc": 1644747601.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Y'know, all those homeless supermodels, duh",
            "author": "SecretPorifera",
            "id": "hwtzb4w",
            "parent_id": "t1_hwr4abg",
            "score": 0,
            "created_utc": 1644790025.0,
            "replies": []
        },
        {
            "body": "Do you have anything to support that?\n\nA woman is automatically assumed to be a hooker if she \"sleeps around\" and her reputation is far more on the line than a married man's. This happens automatically. Far fewer marriages are broken up by infidelity  than a woman being called a whore for having sexual partners without being in a relationship. Sugar or not.",
            "author": "AnSteall",
            "id": "hwr53wj",
            "parent_id": "t1_hwplijl",
            "score": 3,
            "created_utc": 1644738528.0,
            "replies": [
                {
                    "body": "Being called a whore has a much lower average cost than a financially successful man getting a divorce. Divorce is one of the worst things a person can go through and still be physically whole, statistically speaking, for one's financial, physical, and mental health. Being called a whore is a nasty insult, which doesn't hit me particularly hard, but maybe you feel it more. Either way, it's not comparable to a divorce. A divorce is more comparable to getting audited or dragged through a strenuous court trial. And that's *before* you get into what can happen if you didn't have a prenup.",
                    "author": "SecretPorifera",
                    "id": "hwu0fsa",
                    "parent_id": "t1_hwr53wj",
                    "score": 1,
                    "created_utc": 1644790503.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">You absolutely can lose your job or certain licenses for being a SD. Many business and professions see sugaring as a ethics violation.\n\nI would really like to know more about that. Losing your job for being on SA which is ostensibly for vanilla dating? Or losing your job for financially supporting one of your girlfriends?\n\n>SDs by definition have more wealth than SBs.\n\nWould never disagree with that!\n\n>He does have a point in SBs getting free money. Aren't SBs supposed to date SDs they are attracted to and not do anything they don't want? So basically going out with a smart, successful, fun guy that they enjoy being around.\n\nI think there's a simple way to test whether it's free money. Stop giving her money. Only if her behavior does not change, it was indeed free money.",
            "author": "Inner_Examination_38",
            "id": "hwpjy1g",
            "parent_id": "t1_hwphnzr",
            "score": 10,
            "created_utc": 1644708772.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hwplvjp",
                    "parent_id": "t1_hwpjy1g",
                    "score": -2,
                    "created_utc": 1644709611.0,
                    "replies": [
                        {
                            "body": ">The test would be see if any woman goes on dates without being paid which 99%+ do.\n\nWhy make these generalizations? We are not talking about *any woman* seeing *any man*, but about that *specific woman* who *you* want to date.\n\nMany SDs here have described sugar dating as dating above their league (and being financially supported in return). For the SBs, it means dating below their league as well (and being financially supported in return).",
                            "author": "Inner_Examination_38",
                            "id": "hwpn1ct",
                            "parent_id": "t1_hwplvjp",
                            "score": 6,
                            "created_utc": 1644710115.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hwpp2pv",
                                    "parent_id": "t1_hwpn1ct",
                                    "score": -1,
                                    "created_utc": 1644711005.0,
                                    "replies": [
                                        {
                                            "body": "Agree with that! But I don't see your point here. Yes, SBs prefer vanilla dating but that doesn't mean they are getting something for free. Economically, everything we do (that is a choice) we do because it's our preference. When you spend five dollars on an ice cream, you do so because you have decided that ice cream is more valuable to you than five dollars worth of potatoes. That doesn't mean you get ice cream for free.",
                                            "author": "Inner_Examination_38",
                                            "id": "hwprn3h",
                                            "parent_id": "t1_hwpp2pv",
                                            "score": 2,
                                            "created_utc": 1644712164.0,
                                            "replies": [
                                                {
                                                    "body": "If they prefer vanilla dating over sugar then why sugar? If for money then why not escort or just see as many SDs to maximize profit?\n\nEither they prefer sugar over vanilla and the money's just free or there's some moral opposition. \n\n A lot of SBs have some trauma or life experience that makes traditional relationships harder than sugar.",
                                                    "author": "UseRound7488",
                                                    "id": "hwpswnm",
                                                    "parent_id": "t1_hwprn3h",
                                                    "score": 1,
                                                    "created_utc": 1644712736.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You're not exactly hiding your genius, are you?",
            "author": "Inner_Examination_38",
            "id": "hwpgxdp",
            "parent_id": "t1_hwpgimz",
            "score": 7,
            "created_utc": 1644707469.0,
            "replies": [
                {
                    "body": "Alright sugar baby, keep telling me what SDs deal with.  \n\nI'm reading your other comments ya know.  It's pretty clear you don't like anyone sharing the victim card with you.\n\nYou've got blind spots.  Get over yourself.",
                    "author": null,
                    "id": "hwphf1f",
                    "parent_id": "t1_hwpgxdp",
                    "score": -5,
                    "created_utc": 1644707678.0,
                    "replies": [
                        {
                            "body": "Obviously, you haven't read my comments. I don't think I have ever complained or \"played the victim card\". You are the one who thinks he has been treated badly by the world.",
                            "author": "Inner_Examination_38",
                            "id": "hwpi9fe",
                            "parent_id": "t1_hwphf1f",
                            "score": 7,
                            "created_utc": 1644708045.0,
                            "replies": []
                        },
                        {
                            "body": "I was wondering the same thing, like this is a SB, telling a SD, how his business is affected by being in the bowl 🤯🤯🤯",
                            "author": "ModdedDoll",
                            "id": "hwr74kc",
                            "parent_id": "t1_hwphf1f",
                            "score": 0,
                            "created_utc": 1644740032.0,
                            "replies": []
                        },
                        {
                            "body": "Don’t argue with her. She is very keen on being the victim for the number of hours she spends trying to get a man who spent decades building his wealth. Her life must be so hard.",
                            "author": "daddinoir",
                            "id": "hwpoelz",
                            "parent_id": "t1_hwphf1f",
                            "score": -4,
                            "created_utc": 1644710706.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "But he is still a congressman right? So there is that.",
            "author": "CaptPeleg",
            "id": "hwpin0u",
            "parent_id": "t1_hwpfsqq",
            "score": 4,
            "created_utc": 1644708205.0,
            "replies": [
                {
                    "body": "I bet he will still be a congressman after it’s over.",
                    "author": "highjinx411",
                    "id": "hwqclwa",
                    "parent_id": "t1_hwpin0u",
                    "score": 2,
                    "created_utc": 1644721931.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It could be a red flag they may not be discreet/value discretion, if I had to guess. AKA it shows a lack of self awareness to put a picture of yourself where you are working given the nature of the site.",
            "author": "zara_io",
            "id": "hwqhtio",
            "parent_id": "t1_hwq73ij",
            "score": 3,
            "created_utc": 1644724517.0,
            "replies": []
        },
        {
            "body": "\\+1 - Remember Elliot Spitzer? \n\nPeople want to make your sex life their business, if they think you are doing something wrong.",
            "author": "DecentOne7895",
            "id": "hwqd8rb",
            "parent_id": "t1_hwqcdzy",
            "score": 10,
            "created_utc": 1644722244.0,
            "replies": []
        },
        {
            "body": "Of course and you do what you feel is best. Especially if people have reason to try to make your life difficult, something that isn't a big deal or that they're also guilty of becomes ammunition.",
            "author": "oneangstybiscuit",
            "id": "hwtyd1k",
            "parent_id": "t1_hwqcdzy",
            "score": 2,
            "created_utc": 1644789635.0,
            "replies": []
        },
        {
            "body": "You never said anything about wanting an SR.",
            "author": "UnearthlyDinosaur",
            "id": "hwpotqg",
            "parent_id": "t1_hwpopb5",
            "score": -5,
            "created_utc": 1644710893.0,
            "replies": []
        },
        {
            "body": "So you won’t date an Sd who is extremely generous but average looking? Would rather have a good looking guy who pays less? No judgment just wondering for my own knowledge",
            "author": "UnearthlyDinosaur",
            "id": "hwsrffg",
            "parent_id": "t1_hws0z9t",
            "score": 1,
            "created_utc": 1644772600.0,
            "replies": [
                {
                    "body": "I am an SD but I firmly believe that money cannot buy attraction. No matter which gender.",
                    "author": null,
                    "id": "hwt064o",
                    "parent_id": "t1_hwsrffg",
                    "score": 3,
                    "created_utc": 1644776037.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's all stuff you can figure out at a M&G.",
            "author": "Athensbirds",
            "id": "hwrgwp1",
            "parent_id": "t1_hwrg1n6",
            "score": 2,
            "created_utc": 1644747601.0,
            "replies": []
        },
        {
            "body": "Being called a whore has a much lower average cost than a financially successful man getting a divorce. Divorce is one of the worst things a person can go through and still be physically whole, statistically speaking, for one's financial, physical, and mental health. Being called a whore is a nasty insult, which doesn't hit me particularly hard, but maybe you feel it more. Either way, it's not comparable to a divorce. A divorce is more comparable to getting audited or dragged through a strenuous court trial. And that's *before* you get into what can happen if you didn't have a prenup.",
            "author": "SecretPorifera",
            "id": "hwu0fsa",
            "parent_id": "t1_hwr53wj",
            "score": 1,
            "created_utc": 1644790503.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hwplvjp",
            "parent_id": "t1_hwpjy1g",
            "score": -2,
            "created_utc": 1644709611.0,
            "replies": [
                {
                    "body": ">The test would be see if any woman goes on dates without being paid which 99%+ do.\n\nWhy make these generalizations? We are not talking about *any woman* seeing *any man*, but about that *specific woman* who *you* want to date.\n\nMany SDs here have described sugar dating as dating above their league (and being financially supported in return). For the SBs, it means dating below their league as well (and being financially supported in return).",
                    "author": "Inner_Examination_38",
                    "id": "hwpn1ct",
                    "parent_id": "t1_hwplvjp",
                    "score": 6,
                    "created_utc": 1644710115.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hwpp2pv",
                            "parent_id": "t1_hwpn1ct",
                            "score": -1,
                            "created_utc": 1644711005.0,
                            "replies": [
                                {
                                    "body": "Agree with that! But I don't see your point here. Yes, SBs prefer vanilla dating but that doesn't mean they are getting something for free. Economically, everything we do (that is a choice) we do because it's our preference. When you spend five dollars on an ice cream, you do so because you have decided that ice cream is more valuable to you than five dollars worth of potatoes. That doesn't mean you get ice cream for free.",
                                    "author": "Inner_Examination_38",
                                    "id": "hwprn3h",
                                    "parent_id": "t1_hwpp2pv",
                                    "score": 2,
                                    "created_utc": 1644712164.0,
                                    "replies": [
                                        {
                                            "body": "If they prefer vanilla dating over sugar then why sugar? If for money then why not escort or just see as many SDs to maximize profit?\n\nEither they prefer sugar over vanilla and the money's just free or there's some moral opposition. \n\n A lot of SBs have some trauma or life experience that makes traditional relationships harder than sugar.",
                                            "author": "UseRound7488",
                                            "id": "hwpswnm",
                                            "parent_id": "t1_hwprn3h",
                                            "score": 1,
                                            "created_utc": 1644712736.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Alright sugar baby, keep telling me what SDs deal with.  \n\nI'm reading your other comments ya know.  It's pretty clear you don't like anyone sharing the victim card with you.\n\nYou've got blind spots.  Get over yourself.",
            "author": null,
            "id": "hwphf1f",
            "parent_id": "t1_hwpgxdp",
            "score": -5,
            "created_utc": 1644707678.0,
            "replies": [
                {
                    "body": "Obviously, you haven't read my comments. I don't think I have ever complained or \"played the victim card\". You are the one who thinks he has been treated badly by the world.",
                    "author": "Inner_Examination_38",
                    "id": "hwpi9fe",
                    "parent_id": "t1_hwphf1f",
                    "score": 7,
                    "created_utc": 1644708045.0,
                    "replies": []
                },
                {
                    "body": "I was wondering the same thing, like this is a SB, telling a SD, how his business is affected by being in the bowl 🤯🤯🤯",
                    "author": "ModdedDoll",
                    "id": "hwr74kc",
                    "parent_id": "t1_hwphf1f",
                    "score": 0,
                    "created_utc": 1644740032.0,
                    "replies": []
                },
                {
                    "body": "Don’t argue with her. She is very keen on being the victim for the number of hours she spends trying to get a man who spent decades building his wealth. Her life must be so hard.",
                    "author": "daddinoir",
                    "id": "hwpoelz",
                    "parent_id": "t1_hwphf1f",
                    "score": -4,
                    "created_utc": 1644710706.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I bet he will still be a congressman after it’s over.",
            "author": "highjinx411",
            "id": "hwqclwa",
            "parent_id": "t1_hwpin0u",
            "score": 2,
            "created_utc": 1644721931.0,
            "replies": []
        },
        {
            "body": "I am an SD but I firmly believe that money cannot buy attraction. No matter which gender.",
            "author": null,
            "id": "hwt064o",
            "parent_id": "t1_hwsrffg",
            "score": 3,
            "created_utc": 1644776037.0,
            "replies": []
        },
        {
            "body": ">The test would be see if any woman goes on dates without being paid which 99%+ do.\n\nWhy make these generalizations? We are not talking about *any woman* seeing *any man*, but about that *specific woman* who *you* want to date.\n\nMany SDs here have described sugar dating as dating above their league (and being financially supported in return). For the SBs, it means dating below their league as well (and being financially supported in return).",
            "author": "Inner_Examination_38",
            "id": "hwpn1ct",
            "parent_id": "t1_hwplvjp",
            "score": 6,
            "created_utc": 1644710115.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hwpp2pv",
                    "parent_id": "t1_hwpn1ct",
                    "score": -1,
                    "created_utc": 1644711005.0,
                    "replies": [
                        {
                            "body": "Agree with that! But I don't see your point here. Yes, SBs prefer vanilla dating but that doesn't mean they are getting something for free. Economically, everything we do (that is a choice) we do because it's our preference. When you spend five dollars on an ice cream, you do so because you have decided that ice cream is more valuable to you than five dollars worth of potatoes. That doesn't mean you get ice cream for free.",
                            "author": "Inner_Examination_38",
                            "id": "hwprn3h",
                            "parent_id": "t1_hwpp2pv",
                            "score": 2,
                            "created_utc": 1644712164.0,
                            "replies": [
                                {
                                    "body": "If they prefer vanilla dating over sugar then why sugar? If for money then why not escort or just see as many SDs to maximize profit?\n\nEither they prefer sugar over vanilla and the money's just free or there's some moral opposition. \n\n A lot of SBs have some trauma or life experience that makes traditional relationships harder than sugar.",
                                    "author": "UseRound7488",
                                    "id": "hwpswnm",
                                    "parent_id": "t1_hwprn3h",
                                    "score": 1,
                                    "created_utc": 1644712736.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Obviously, you haven't read my comments. I don't think I have ever complained or \"played the victim card\". You are the one who thinks he has been treated badly by the world.",
            "author": "Inner_Examination_38",
            "id": "hwpi9fe",
            "parent_id": "t1_hwphf1f",
            "score": 7,
            "created_utc": 1644708045.0,
            "replies": []
        },
        {
            "body": "I was wondering the same thing, like this is a SB, telling a SD, how his business is affected by being in the bowl 🤯🤯🤯",
            "author": "ModdedDoll",
            "id": "hwr74kc",
            "parent_id": "t1_hwphf1f",
            "score": 0,
            "created_utc": 1644740032.0,
            "replies": []
        },
        {
            "body": "Don’t argue with her. She is very keen on being the victim for the number of hours she spends trying to get a man who spent decades building his wealth. Her life must be so hard.",
            "author": "daddinoir",
            "id": "hwpoelz",
            "parent_id": "t1_hwphf1f",
            "score": -4,
            "created_utc": 1644710706.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hwpp2pv",
            "parent_id": "t1_hwpn1ct",
            "score": -1,
            "created_utc": 1644711005.0,
            "replies": [
                {
                    "body": "Agree with that! But I don't see your point here. Yes, SBs prefer vanilla dating but that doesn't mean they are getting something for free. Economically, everything we do (that is a choice) we do because it's our preference. When you spend five dollars on an ice cream, you do so because you have decided that ice cream is more valuable to you than five dollars worth of potatoes. That doesn't mean you get ice cream for free.",
                    "author": "Inner_Examination_38",
                    "id": "hwprn3h",
                    "parent_id": "t1_hwpp2pv",
                    "score": 2,
                    "created_utc": 1644712164.0,
                    "replies": [
                        {
                            "body": "If they prefer vanilla dating over sugar then why sugar? If for money then why not escort or just see as many SDs to maximize profit?\n\nEither they prefer sugar over vanilla and the money's just free or there's some moral opposition. \n\n A lot of SBs have some trauma or life experience that makes traditional relationships harder than sugar.",
                            "author": "UseRound7488",
                            "id": "hwpswnm",
                            "parent_id": "t1_hwprn3h",
                            "score": 1,
                            "created_utc": 1644712736.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agree with that! But I don't see your point here. Yes, SBs prefer vanilla dating but that doesn't mean they are getting something for free. Economically, everything we do (that is a choice) we do because it's our preference. When you spend five dollars on an ice cream, you do so because you have decided that ice cream is more valuable to you than five dollars worth of potatoes. That doesn't mean you get ice cream for free.",
            "author": "Inner_Examination_38",
            "id": "hwprn3h",
            "parent_id": "t1_hwpp2pv",
            "score": 2,
            "created_utc": 1644712164.0,
            "replies": [
                {
                    "body": "If they prefer vanilla dating over sugar then why sugar? If for money then why not escort or just see as many SDs to maximize profit?\n\nEither they prefer sugar over vanilla and the money's just free or there's some moral opposition. \n\n A lot of SBs have some trauma or life experience that makes traditional relationships harder than sugar.",
                    "author": "UseRound7488",
                    "id": "hwpswnm",
                    "parent_id": "t1_hwprn3h",
                    "score": 1,
                    "created_utc": 1644712736.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If they prefer vanilla dating over sugar then why sugar? If for money then why not escort or just see as many SDs to maximize profit?\n\nEither they prefer sugar over vanilla and the money's just free or there's some moral opposition. \n\n A lot of SBs have some trauma or life experience that makes traditional relationships harder than sugar.",
            "author": "UseRound7488",
            "id": "hwpswnm",
            "parent_id": "t1_hwprn3h",
            "score": 1,
            "created_utc": 1644712736.0,
            "replies": []
        }
    ]
}