{
    "title": "Realities of being with a married SD",
    "post_id": "w3uoqb",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/w3uoqb/realities_of_being_with_a_married_sd/",
    "author": "londonbebe",
    "body": "Rant\n\nSo I met up with my SD recently. He is married  with 2 children and I've known this from the beginning. We've been together since December and all this time i never gave much thought regarding his regular life. It was just 'us' when we were together in our blissful little world haha \n\nAnyway, before our most recent meet up I looked up his social media and saw pictures of his wife and kids. Didn't really feel anything other than thinking 'aww that's nice' and moved on. \n\nWe met up this week it was great, the sex was mind blowing  he is generous, kind etc etc. I was on a high. But after he left i felt this horrible crashing feeling and started thinking about who he is going home to and though he told me why he is having an affair, it really hurt to think his wife gets to enjoy a side of him i may never will doing normal things like walking the dogs and watching tv without the time constraints. I wouldn't say I'm in love with him, but i care deeply for him and it just sucked that i now have a mental picture of what his normal life is like. I literally went from a 100 to 0 haha and even cried \n\nAnd yes i should have thought about this before getting involved with a married man. Since i have no one to tell just wanted somewhere to vent my feelings",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/w3uoqb/realities_of_being_with_a_married_sd/",
    "score": 97,
    "upvote_ratio": 0.67,
    "created_utc": 1658344152.0,
    "num_comments": 142,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "If it makes you feel any better his wife also gets the annoying af side of him that doesn’t load the dishwasher properly, leaves his socks all over the house and gets toothpaste on the bathroom mirror. \n\nOr am I projecting?",
            "author": "kobereuben88",
            "id": "igyfdhi",
            "parent_id": "t3_w3uoqb",
            "score": 220,
            "created_utc": 1658345259.0,
            "replies": [
                {
                    "body": "Plus her husband is having an affair lol. I don’t think she’s exactly living the dream here",
                    "author": "Quick_Chocolate_657",
                    "id": "igysowi",
                    "parent_id": "t1_igyfdhi",
                    "score": 203,
                    "created_utc": 1658350835.0,
                    "replies": [
                        {
                            "body": "I have to remind myself this! These married guys are still cheating at the end of the day.. that makes him a dishonest person and all that jazz. That’s not someone who we would even want to fuck with.. yet, we are in our feelings over them.. \n\nHaving these types of rational, honest conversations with yourself, DEFINITELY brings you back down to earth!",
                            "author": "Tale-Itchy",
                            "id": "ih35zpx",
                            "parent_id": "t1_igysowi",
                            "score": 7,
                            "created_utc": 1658429845.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "So true. SDs show their best sides in an SR. After all it’s a few hours a week or so where we can be on our best behaviour…. And when we’re with a beautiful woman it ain’t hard to be that perfect positive engaging person. But living with someone 24/7 is a different ball game. Your real self cannot be hidden. We all have an ugly or boring side that your partner will always get to see.",
                    "author": null,
                    "id": "ih0s9ay",
                    "parent_id": "t1_igyfdhi",
                    "score": 13,
                    "created_utc": 1658387704.0,
                    "replies": []
                },
                {
                    "body": "You're projecting, all SDs have a maid.",
                    "author": "sugardad123",
                    "id": "igyracc",
                    "parent_id": "t1_igyfdhi",
                    "score": 14,
                    "created_utc": 1658350242.0,
                    "replies": [
                        {
                            "body": "I don't. I did when I was married though.",
                            "author": "AShatteredKing",
                            "id": "ih21gn9",
                            "parent_id": "t1_igyracc",
                            "score": 1,
                            "created_utc": 1658414677.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Isn’t it a little destructive though? OP probably won’t find a guy that will marry her and treat her like the SD treats his wife. Any relationship after this will be measured against the SD and won’t live up.",
                    "author": "sugarthrowaway407",
                    "id": "igyvla4",
                    "parent_id": "t1_igyfdhi",
                    "score": 6,
                    "created_utc": 1658352096.0,
                    "replies": [
                        {
                            "body": "I mean what OPs describing sounds pretty normal. Hanging out with your husband, being with each other without a time limit. That’s just part of living together 🤷🏾‍♀️. She could find easily find that, and he prob won’t be cheating on her. Now that’s if she goes to vanilla eating at some point, that type of thing with a SD would be really hard to find yeah",
                            "author": "Quick_Chocolate_657",
                            "id": "igz5bbo",
                            "parent_id": "t1_igyvla4",
                            "score": 6,
                            "created_utc": 1658356466.0,
                            "replies": [
                                {
                                    "body": "Yeah you can’t really remove the money part.",
                                    "author": "sugarthrowaway407",
                                    "id": "igz7pn7",
                                    "parent_id": "t1_igz5bbo",
                                    "score": 3,
                                    "created_utc": 1658357582.0,
                                    "replies": [
                                        {
                                            "body": "I assume at some point she’ll get out of the bowl. Most ppl don’t do it forever right?",
                                            "author": "Quick_Chocolate_657",
                                            "id": "igza4ri",
                                            "parent_id": "t1_igz7pn7",
                                            "score": 1,
                                            "created_utc": 1658358729.0,
                                            "replies": [
                                                {
                                                    "body": "An ex sugar baby can be a red flag for most. It’s even worse if she doesn’t admit it and it’s found out later in the relationship.",
                                                    "author": "sugarthrowaway407",
                                                    "id": "igzjqx6",
                                                    "parent_id": "t1_igza4ri",
                                                    "score": 2,
                                                    "created_utc": 1658363276.0,
                                                    "replies": [
                                                        {
                                                            "body": "I mean sure, but there are some guys who wouldn’t care. She realistically can’t sugar her whole life.",
                                                            "author": "Quick_Chocolate_657",
                                                            "id": "igztpja",
                                                            "parent_id": "t1_igzjqx6",
                                                            "score": 3,
                                                            "created_utc": 1658367827.0,
                                                            "replies": [
                                                                {
                                                                    "body": "“Some guys”… yeah I also can quadruple my money at the casino tonight. Relying on hope is a bad strategy especially when you’re talking about your life outcomes",
                                                                    "author": "sugarthrowaway407",
                                                                    "id": "igzyp75",
                                                                    "parent_id": "t1_igztpja",
                                                                    "score": -3,
                                                                    "created_utc": 1658370103.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "There are a lot of guys who would date a former SB. Men date strippers don’t they? People are different, but there are plenty of men who wouldn’t mind. Literally what other choice would she have? She’s gonna be sugaring at 60?",
                                                                            "author": "Quick_Chocolate_657",
                                                                            "id": "ih03cgd",
                                                                            "parent_id": "t1_igzyp75",
                                                                            "score": 3,
                                                                            "created_utc": 1658372307.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Not true, it is not impossible or that that hard to find high quality and value providing man if you work on yourself and have high standards. The goal is to pick the one who sees you as a dream girl.",
                            "author": "idontlikespiderplant",
                            "id": "ih1a8sy",
                            "parent_id": "t1_igyvla4",
                            "score": 4,
                            "created_utc": 1658401569.0,
                            "replies": [
                                {
                                    "body": "I think you missed the mark on a lot of things. “Not impossible” will lead you to disappointment. The caliber of men you’re looking at aren’t chasing their dream girl, they chase their goals.\nAlso looking at your profile it looks like you’re eluding that being an escort does not hurt your chances of finding a provider high quality man which is madness.",
                                    "author": "sugarthrowaway407",
                                    "id": "ih1magy",
                                    "parent_id": "t1_ih1a8sy",
                                    "score": 0,
                                    "created_utc": 1658408218.0,
                                    "replies": [
                                        {
                                            "body": "You are wrong in many points of your comment but that is your opinion and experience. Mine is different. And yes, they must chase career but believe me, once you are a dreamgirl to one of them you will experience some real special treatment. But the fact that you are their dream girl does not mean they are what you want. And yeah, they do not give a damn about escorting. Maybe do your research how many wives of high earning men were escorts, and how many of them actually met at work. Of course it wont be written explicitly. It is like the movie breakfast at tiffanys which is about escort, and so many people do not get it lol :D. But yeah, the reason why I say not impossible is because for some it will be easier then for others. I do not know how the girls looks like, how are their manners, intelligence, social skills etc. If you are model material with rubbish personality your chances are low.",
                                            "author": "idontlikespiderplant",
                                            "id": "ihbl534",
                                            "parent_id": "t1_ih1magy",
                                            "score": 2,
                                            "created_utc": 1658583787.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "And you are married to such a man now right?",
                                    "author": "AShatteredKing",
                                    "id": "ih21t0o",
                                    "parent_id": "t1_ih1a8sy",
                                    "score": 1,
                                    "created_utc": 1658414811.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Why wouldn't she find a husband like that?",
                            "author": "WiseRequirement9277",
                            "id": "igzbp40",
                            "parent_id": "t1_igyvla4",
                            "score": 3,
                            "created_utc": 1658359475.0,
                            "replies": [
                                {
                                    "body": "I would argue OP has found a husband like that…just someone else’s.",
                                    "author": null,
                                    "id": "igzpi2z",
                                    "parent_id": "t1_igzbp40",
                                    "score": 7,
                                    "created_utc": 1658365926.0,
                                    "replies": []
                                },
                                {
                                    "body": "Men making sugar daddy money aren’t making ex sugar babies their wife. If they’re extremely attractive disregard everything I just said.",
                                    "author": "sugarthrowaway407",
                                    "id": "igzjyhx",
                                    "parent_id": "t1_igzbp40",
                                    "score": 2,
                                    "created_utc": 1658363373.0,
                                    "replies": [
                                        {
                                            "body": "So they do 😄",
                                            "author": "WiseRequirement9277",
                                            "id": "igzl0yu",
                                            "parent_id": "t1_igzjyhx",
                                            "score": 3,
                                            "created_utc": 1658363874.0,
                                            "replies": [
                                                {
                                                    "body": "Extremely attractive means women who have successfully modeled or who’ve been offered modeling additions…",
                                                    "author": "sugarthrowaway407",
                                                    "id": "igzpk9i",
                                                    "parent_id": "t1_igzl0yu",
                                                    "score": -2,
                                                    "created_utc": 1658365953.0,
                                                    "replies": [
                                                        {
                                                            "body": "So it happens 😄",
                                                            "author": "WiseRequirement9277",
                                                            "id": "ih0rqou",
                                                            "parent_id": "t1_igzpk9i",
                                                            "score": 3,
                                                            "created_utc": 1658387307.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Maybe but let’s be careful not to portray her as a “victim” of it….she went in with both eyes wide open.",
                            "author": "Jahammy72",
                            "id": "igzwfnx",
                            "parent_id": "t1_igyvla4",
                            "score": 2,
                            "created_utc": 1658369049.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Quote from the \"life's big questions\", I think it applies here. You made a rational decision, and it worked for you \"SR-wise\", but the emotions got you. Thanks for the share and hope you feel better!\n\n\"Even the most emotional person uses rational thought when deciding, and even the most rational person is affected by emotions when making decisions\"",
            "author": "Hammerbro10",
            "id": "igyfspr",
            "parent_id": "t3_w3uoqb",
            "score": 32,
            "created_utc": 1658345437.0,
            "replies": [
                {
                    "body": "That's a great quote",
                    "author": "SporadicEmoter",
                    "id": "igzcj7c",
                    "parent_id": "t1_igyfspr",
                    "score": 6,
                    "created_utc": 1658359877.0,
                    "replies": []
                },
                {
                    "body": "And the emotions often do ‘get you’….when you’re hanging out in beautiful hotels and fancy restaurants eating great food, drinking great wine, with someone you find attractive, where the sex is good/great, the conversation is engaging and where you’re showing your best side only…. It’s all very intoxicating. And it’s not ruined by pesky domesticity! So yea if that doesn’t make you emotional then you’ve become too hardened. I don’t want to be that person. Give me emotions even if it involves pain when things end.",
                    "author": null,
                    "id": "ih1okyh",
                    "parent_id": "t1_igyfspr",
                    "score": 5,
                    "created_utc": 1658409295.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ex-SB here who broke ties with their “Summer SD” last month.\n\nIf there’s one thing I’ll always say to any new or old SB is your life as a SB is basically just being a sexual fantasy and you only stick around for the money and the temporary luxuries. It’s ok to “catch feelings” but as someone who was in this dilemma with an old divorced SD is that I only cared about the money, while he just only cared about being involved in my sex life only. He admitted to me before that he’d like a “relationship in the future” but all of his energy and actions towards me were just geared to have a ‘sexual life’ with me. I too said I wanted “a relationship” but I knew for a fact it was only for his money, anything else that wasn’t money-related nor materialistic I wouldn’t even be talking to him in the first place.\n\nWe had an argument and after that I just left. My feelings did linger on what could’ve been the infinite in the unknown but all I have left from him is saved money, 2 high-end necklaces, and memories of an old man taking me to eat then “having fun”. We had a sexual relationship, not a romantic one. Anyone could f*ck anyone especially in this day and age where ‘side chicks’ are pretty ubiquitous but never acknowledged to be a “serious thing”.\n\nI love how you knew what you were getting involved in because it shows ‘acceptance’. But you need to not make this life of simply just being a mistress of the situation into something bigger. Sugaring will always be a temporary thing no matter how much ppl like to romanticize it and prolong it. It sounds to me that you grew attached because you only have this arrangement as the only thing being “exciting” in your life. SDs aren’t into the fact of marriage nor long term commitment, both SBs and SDs are in this lifestyle for a ‘good time’ not a long time.\n\nMy three biggest advice for you: (1) Social media is the worst place to lurk for anyone’s business, especially when you’re growing an attachment to that person. Block everything and harness your social media usage. Lurking around a space where everything is artificial is the worst thing you could do with your real emotions and mental health. (2) Most things that don’t work are just better off being that way. Things that don’t work out, don’t work out for a reason and you must accept it and either move on or waste your life on it whilst the other person is already moving through the next phase. Don’t try to force it. Don’t complicate it. When the “fun” ends, make closure with it and move on. (3) Build your own life not a life that’s already been established. Don’t make it around sugaring because as you get older you’ll just see yourself as a person being only used for intimacy, not a real connection. Yes you may have fallen in love with a married man but not to be a Debby Downer, who’s to say he’s still looking for intimacy from various other people? He went on a website to cheat on his wife. He gave you and thousands of other SBs a chance for him to carry on his infidelities. You deserve more than that, trust me.",
            "author": "AromaticcGloom",
            "id": "igznp3m",
            "parent_id": "t3_w3uoqb",
            "score": 21,
            "created_utc": 1658365105.0,
            "replies": []
        },
        {
            "body": " i should have thought about this before getting involved\n\nActually what you shouldn't have done is check his social media. Ignorance is bliss sometimes. \n\nFrom a SD's POV also checking SB's media can be frustrating as well-seeing her having fun with people other than you,particularly if her friends are male.  So it is a good plan to leave the SM be. Then our time together is our reality.",
            "author": "GSSD",
            "id": "igyfo1k",
            "parent_id": "t3_w3uoqb",
            "score": 48,
            "created_utc": 1658345382.0,
            "replies": [
                {
                    "body": "A very important point made here. Social media does only one thing which is project the best times of peoples lives and leaves out 90% of the rest of their ordinary or challenging times. Whatever is shown is a highly distorted version of someone’s life.",
                    "author": null,
                    "id": "ih1hc9x",
                    "parent_id": "t1_igyfo1k",
                    "score": 2,
                    "created_utc": 1658405720.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's normal to have feelings of some sort for your SD, but these feelings are probably going to increase the more time you spend with him. If you can't learn to separate and accept what your relationship actually is vs. what you want it to be, do yourself a favor and end things before you end up even more hurt.",
            "author": "HailToTheQuinn",
            "id": "igymg6j",
            "parent_id": "t3_w3uoqb",
            "score": 10,
            "created_utc": 1658348214.0,
            "replies": []
        },
        {
            "body": "Your feelings are totally normal and justified OP. Sometimes I will have an SB where I am the secret, and I can't be there for graduations, the death of a pet, pizza night, or a million other things where I would want to be by her side. What helps me is this:  I do feel happy that I get half of someone awesome, rather than zero. Glass half full and all.  There are a lot of glass-totally-empty fuckers out there, and it's always amazing to find someone you view as ideal.",
            "author": "TastySpermDispenser",
            "id": "igye256",
            "parent_id": "t3_w3uoqb",
            "score": 48,
            "created_utc": 1658344717.0,
            "replies": [
                {
                    "body": "Yep, we both feel it - there are such great things each of us get to do that are separate … and … it has to be and it’s part of making our (forgive me) coming tighter so sweet.",
                    "author": "SDLASF1",
                    "id": "igylksr",
                    "parent_id": "t1_igye256",
                    "score": 7,
                    "created_utc": 1658347851.0,
                    "replies": []
                },
                {
                    "body": "Whatever pain you and OP feel from your situations you completely deserve. The husbands deserve worse for betraying their wives but women like you genuinely do not deserve love or respect.",
                    "author": "Teachtheworldinlove",
                    "id": "ih2s0ld",
                    "parent_id": "t1_igye256",
                    "score": -2,
                    "created_utc": 1658424612.0,
                    "replies": [
                        {
                            "body": "Awe. An incel got triggered. Thoughts and prayers loser.",
                            "author": "TastySpermDispenser",
                            "id": "ih2syc3",
                            "parent_id": "t1_ih2s0ld",
                            "score": 5,
                            "created_utc": 1658424959.0,
                            "replies": [
                                {
                                    "body": "Why is a person who is opposed to adultery an \"incel\"?",
                                    "author": "NITAREEDDESIGNS",
                                    "id": "ih3xkwq",
                                    "parent_id": "t1_ih2syc3",
                                    "score": 0,
                                    "created_utc": 1658440346.0,
                                    "replies": [
                                        {
                                            "body": "For the same reason I can watch a parent eat a greasy hamburger with their young fat child while talking about santa and still love and respect them both.\n#\nMy comment relates more to his comment history. Mommy and daddy clearly taught him that he gets to own someone as soon as he persuades them to marriage, no matter what what garbage person he becomes.\n#\nBe mad at adultry all you want; it's still two human beings, neither one harming anyone, and certainly not the adult who definitely didnt break any promises.  I dont know you, but I guarantee multiple times in life you have participated in breaking contracts, and I still love you bro.",
                                            "author": "TastySpermDispenser",
                                            "id": "ih45i7b",
                                            "parent_id": "t1_ih3xkwq",
                                            "score": 3,
                                            "created_utc": 1658443589.0,
                                            "replies": [
                                                {
                                                    "body": ">I dont know you, but I guarantee multiple times in life you have participated in breaking contracts\n\nYou don't know me and yet you presume to \"guarantee\" something about me?\n\n&#x200B;\n\n>Be mad at adultry all you want; it's still two human beings, neither one harming anyone,\n\nOh yes...both \"human beings\" are, indeed, harming people and not just any SOs involved.\n\n>I still love you bro.\n\nIf I had a $ for every time a Redditor thought I was a dude...",
                                                    "author": "NITAREEDDESIGNS",
                                                    "id": "ih46ive",
                                                    "parent_id": "t1_ih45i7b",
                                                    "score": -1,
                                                    "created_utc": 1658444020.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yep! All adult humans break contracts sometimes.  You have too.  Do you think you have never exceeded the speed limit? Brought something into a movie theater? Accidentally left something off a customer's order at your retail job?  X doubt.\n#\nAbstract concepts are not harm dude.\n#\nDont really care what your gender is homie.  Go to IG if it's such a big deal to you.",
                                                            "author": "TastySpermDispenser",
                                                            "id": "ih47jpl",
                                                            "parent_id": "t1_ih46ive",
                                                            "score": 1,
                                                            "created_utc": 1658444449.0,
                                                            "replies": [
                                                                {
                                                                    "body": "LOL\n\nThe \"speed limit\" is not a \"contract\".\n\nTaking something into a movie theater is not a \"contract\".\n\nAccidentally leaving something off a customer's order is not a \"contract\".\n\nBreaking trust...breaking homes are not \"abstract concepts\".  What a load of crap...\n\nCalling a woman a man is offensive...deflect all you want, but that is a fact.",
                                                                    "author": "NITAREEDDESIGNS",
                                                                    "id": "ih49kwj",
                                                                    "parent_id": "t1_ih47jpl",
                                                                    "score": -1,
                                                                    "created_utc": 1658445324.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Your insurance contract literally requires you to drive the speed limit.\n#\nYour movie ticket contract literally prohibits outside food and drink.\n#\nBreaking trust? Lol. Do you believe everything you read and see? You must have a lot of broken trust with all this advertising, and yet, you struggle on! You're a punch line!",
                                                                            "author": "TastySpermDispenser",
                                                                            "id": "ih4a941",
                                                                            "parent_id": "t1_ih49kwj",
                                                                            "score": 2,
                                                                            "created_utc": 1658445617.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Wrong subreddit. \nWhy are you even on one like this if you’re just going to be like that, lol. \nThe amount of married SDs out there may shock you.",
                            "author": "Tale-Itchy",
                            "id": "ih37fpa",
                            "parent_id": "t1_ih2s0ld",
                            "score": 2,
                            "created_utc": 1658430388.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">the sex was mind blowing\n\nI'll bet a dollar the wife is not getting mind blowing sex.",
            "author": "Fattielover69",
            "id": "igygkxt",
            "parent_id": "t3_w3uoqb",
            "score": 34,
            "created_utc": 1658345765.0,
            "replies": [
                {
                    "body": "I’ll bet two dollars the wife does not want it, at least not from him",
                    "author": "DarcyBennet81",
                    "id": "igyvoa1",
                    "parent_id": "t1_igygkxt",
                    "score": 33,
                    "created_utc": 1658352131.0,
                    "replies": [
                        {
                            "body": "I’ll bet my SBs allowance on this…😁",
                            "author": "quietgrey1",
                            "id": "ih2p1y7",
                            "parent_id": "t1_igyvoa1",
                            "score": 7,
                            "created_utc": 1658423518.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Remember what we put on the socials is our best lives, not our real lives.",
            "author": "quietgrey1",
            "id": "ih2pm8n",
            "parent_id": "t3_w3uoqb",
            "score": 5,
            "created_utc": 1658423728.0,
            "replies": []
        },
        {
            "body": "Yeah, she is so lucky, having husband that is constantly cheating on her, who she loves and cares for, gave kids to etc. I really would be so jealous, such a great man :D.",
            "author": "idontlikespiderplant",
            "id": "ih19snb",
            "parent_id": "t3_w3uoqb",
            "score": 11,
            "created_utc": 1658401276.0,
            "replies": [
                {
                    "body": "This is the mindset to have when dealing with married SDs honestly. Can’t be THAT great of a catch if he’s doing shit like that in the first place.",
                    "author": "Tale-Itchy",
                    "id": "ih37oy1",
                    "parent_id": "t1_ih19snb",
                    "score": 5,
                    "created_utc": 1658430485.0,
                    "replies": [
                        {
                            "body": "They are absolute rubbish and if I would get again into situation as I did in past of wife calling me, I would AGAIN be on the wife side. Remember it as yesterday how she has to make her mind what she wants, and if it is divorce, she must act smart and quiet. The movie \"the other woman\" feels very familiar to me and minus the fun part it is not that farfetched.",
                            "author": "idontlikespiderplant",
                            "id": "ihbkdwy",
                            "parent_id": "t1_ih37oy1",
                            "score": 2,
                            "created_utc": 1658583404.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "She's most likely ignoring the fuck out of him and pretending he doesn't exist and sees any type of intimacy as a duty or another chore for her to do. Husbands get randy, wives get nasty lazy.",
                    "author": "Charmane1001",
                    "id": "ih790f2",
                    "parent_id": "t1_ih19snb",
                    "score": 2,
                    "created_utc": 1658504109.0,
                    "replies": [
                        {
                            "body": "Well men get lazy , they walk around dirty, smelly, farts, act like imbecils and women are expected to see them as their personal sex symbol. Also let's face the reality, women do not switch or turn for no reason. It is the constant disappointment in your partner that kills all sexual drive, love, care and interest. That is something men do not understand. At some point we give up trying. I personally would never want a man to live with. Men and kids are same, fun when you do not have them all the time and do not have to take care of them.",
                            "author": "idontlikespiderplant",
                            "id": "ihbk3fr",
                            "parent_id": "t1_ih790f2",
                            "score": 2,
                            "created_utc": 1658583256.0,
                            "replies": [
                                {
                                    "body": "Tl;Dr version: Women love accessories until they’re stuck with them.",
                                    "author": "luckysparkie",
                                    "id": "iigjuza",
                                    "parent_id": "t1_ihbk3fr",
                                    "score": 1,
                                    "created_utc": 1659320577.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ih1gvew",
                    "parent_id": "t1_ih19snb",
                    "score": -6,
                    "created_utc": 1658405469.0,
                    "replies": [
                        {
                            "body": "That’s always on the edge of a guys mind. If he works a lot (like I do), his mind sometimes goes to dark places. It’s messed up but it happens",
                            "author": "luckysparkie",
                            "id": "iigk9k9",
                            "parent_id": "t1_ih1gvew",
                            "score": 1,
                            "created_utc": 1659320785.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This probably won't make you feel any better right away, but if you think about it, the problem is not that he is married, bur rather that you \"want to be married\", or more accurately, you want (and miss) a vanilla relationship (with benefits).\n\nLet me explain: Most (if not all) single daddies do not want to get married (for a variety of reasons). Sugar websites stereotype them as \"too busy for regular (vanilla) dating\".\n\nP.S. (for all PC ladies accusing me of being insensitive or even cruel): I've brought it up, because it's something that every ~~POC~~  POT SB needs to consider before she gets into sugaring, so that she doesn't suffer the pain that the OP is experiencing right now.",
            "author": "dallas-explorer",
            "id": "igyi585",
            "parent_id": "t3_w3uoqb",
            "score": 12,
            "created_utc": 1658346416.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "igyx5sn",
                    "parent_id": "t1_igyi585",
                    "score": 8,
                    "created_utc": 1658352788.0,
                    "replies": [
                        {
                            "body": "I think he meant POT SB.",
                            "author": "NVOkie9018",
                            "id": "igz5nlr",
                            "parent_id": "t1_igyx5sn",
                            "score": 1,
                            "created_utc": 1658356624.0,
                            "replies": [
                                {
                                    "body": "Indeed, it was a typo.",
                                    "author": "dallas-explorer",
                                    "id": "igzdyme",
                                    "parent_id": "t1_igz5nlr",
                                    "score": 1,
                                    "created_utc": 1658360557.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well that’s normal for human beings. That’s why I find it hard to believe some people can simply seek NSA on seek. \n\nEveryone can fuck but your brain can’t tell any difference. Your female instinct is ALWAYS to build a “home” (whatever home means to you individually). \n\nIt’s our nature to stabilise a relationship with one man. It’s written in your DNA. Maybe to some girls it’s to become a wife and mother; maybe to me it’s to find a soulmate to mate for life. It’s just not normal to fuck for the rest of your life, for men and women. \n\nI don’t like to get emotionally involved with married men. \n\nLogically, let me analyse.. \n\nHe told you he wasn’t truly happy with his wife or any other excuses to justify his cheating behaviours.. anyone cheats in my opinion is a weak man. \n\nThose men have no guts to end an unhappy relationship; have no intelligence to reconnect with their wife and make her desire him; have no capability to organise his women so he can openly enjoy two women in public.. \n\nI’d rather these weak men stick to his wife. Please don’t divorce or you will just flood the dating market full of weak men which I have to try to avoid at all cost. \n\nIf you are married but looking, I am happy to listen to your sob stories but at the end of the day, you know you are just too weak.",
            "author": null,
            "id": "igyqekh",
            "parent_id": "t3_w3uoqb",
            "score": 20,
            "created_utc": 1658349873.0,
            "replies": [
                {
                    "body": ">have no capability to organise his women so he can openly enjoy two women in public..\n\nThis. I love going out with two or three of my sugar babies at once.",
                    "author": "LuckyINTJ",
                    "id": "igz0izc",
                    "parent_id": "t1_igyqekh",
                    "score": 3,
                    "created_utc": 1658354284.0,
                    "replies": [
                        {
                            "body": "Same as the dude who owns playboy magazine. Those blonde fake boobs love the comfort, status and material shit you can provide. \n\nTry to ask them absolutely willingly to become your concubine and all bear kids for you, like How Stanley Ho organised his four wives in the open air. \n\nSometimes people live in a delusional life. There aren’t many alpha males who can truly enjoy more than one woman. There aren’t many men who can truly satisfy two women financially, sexually and emotionally. \n\nMoney can buy men lots of sex and a moment of masculinity, but it can’t buy you loyalty, respect and a lifelong devotion.",
                            "author": null,
                            "id": "igzzgd7",
                            "parent_id": "t1_igz0izc",
                            "score": 0,
                            "created_utc": 1658370456.0,
                            "replies": [
                                {
                                    "body": ">Stanley Ho\n\nThanks. Had not heard of Stanley Ho before.\n\nhttps://asiatimes.com/2018/01/real-reasons-behind-hong-kongs-love-polygamous-tycoons/",
                                    "author": "LuckyINTJ",
                                    "id": "ih6zu46",
                                    "parent_id": "t1_igzzgd7",
                                    "score": 1,
                                    "created_utc": 1658500498.0,
                                    "replies": [
                                        {
                                            "body": "I don’t think polygamy or polyamory are wrong. \nI generally believe as long as there is no cheating, any human relationships are legitimate. \n\nThere is no such a term “ openly cheating “ .. you are either scared and cheat secretly behind your wife or you openly enjoy your lover with your wife’s agreement. \n\nMaybe there are men in this world women are willingly to share for the rest of their life. \n\nWillingly is always a key word. In many religious or historical contexts, a man owns multi women because of gender inequality. For example, women can’t inherit land or properties. And many women were forced to share a man. \n\nBut if they are not forced and everyone knows exactly what’s going on, you will have the empire Stanley Ho created. \n\nIn reality, it’s extremely hard work to have more than one women (this different from group sex you are talking about ) .. Stanley created a big family with his four women , each left him offsprings and they are all properly recorded in the family tree.",
                                            "author": null,
                                            "id": "ihb6oo9",
                                            "parent_id": "t1_ih6zu46",
                                            "score": 1,
                                            "created_utc": 1658575313.0,
                                            "replies": [
                                                {
                                                    "body": ">There is no such a term “ openly cheating “ .. you are either scared and cheat secretly behind your wife or you openly enjoy your lover with your wife’s agreement\n\nI am widowed and not have a wife. I have four sugar babies.  They all know about each other and are friends.",
                                                    "author": "LuckyINTJ",
                                                    "id": "ihrukeu",
                                                    "parent_id": "t1_ihb6oo9",
                                                    "score": 1,
                                                    "created_utc": 1658873039.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don’t know what you are trying to tell me. \nAgain you are just like the guy who own playboy magazine with all the blonde chicks living in the same house with him. They stay around for comfort, job career, fame and status. They don’t truly love him or devote their life to the old white guy.",
                                                            "author": null,
                                                            "id": "ihsamee",
                                                            "parent_id": "t1_ihrukeu",
                                                            "score": 1,
                                                            "created_utc": 1658879995.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This ^^^^^^",
                    "author": null,
                    "id": "igyrljk",
                    "parent_id": "t1_igyqekh",
                    "score": 0,
                    "created_utc": 1658350374.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You should have thought about this before embarking in SR….married or not. ”Realities of SR” is a better heading……..it sounds like you are looking for VR…..the chance of you finding that by starting in an SR is pretty small.",
            "author": "Jahammy72",
            "id": "igzw240",
            "parent_id": "t3_w3uoqb",
            "score": 3,
            "created_utc": 1658368883.0,
            "replies": []
        },
        {
            "body": "Everyone has reasons they consider valid to be involved in SR. I for one don't judge either side as demeaning or cheating. You never know the person until you walk in their shoes and even then your still not them.",
            "author": "18newbie44880011",
            "id": "igzzs71",
            "parent_id": "t3_w3uoqb",
            "score": 3,
            "created_utc": 1658370611.0,
            "replies": []
        },
        {
            "body": "No doubt she's getting things you aren't getting (good and bad), but you are also probably getting things she isn't at this point. I advise trying to practice living in the moment and enjoying the times you have together - they sound pretty wonderful.",
            "author": "roscoe7585",
            "id": "igymuql",
            "parent_id": "t3_w3uoqb",
            "score": 7,
            "created_utc": 1658348385.0,
            "replies": []
        },
        {
            "body": "Your time with him is playtime and playing house. \n\nHers is real life.\n\nEnjoy what you have.",
            "author": "Akavinceblack",
            "id": "igz6vyo",
            "parent_id": "t3_w3uoqb",
            "score": 8,
            "created_utc": 1658357198.0,
            "replies": [
                {
                    "body": "Yup it’s a fun fantasy for sure",
                    "author": "kobereuben88",
                    "id": "igzfi51",
                    "parent_id": "t1_igz6vyo",
                    "score": 2,
                    "created_utc": 1658361287.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Actually you should’ve thought about it before checking out his social media",
            "author": "Broadbent_Jim",
            "id": "igyhj13",
            "parent_id": "t3_w3uoqb",
            "score": 5,
            "created_utc": 1658346160.0,
            "replies": []
        },
        {
            "body": "Live in the bliss. Savor the moment. \n\nYour feelings are normal and valid. If you like someone, you want more. But do you really want more of him? In a typical SR, the SD won't burden you with his real-life concerns. So he may not ask you about college funds, retirement goals, or his sciatica. Maybe those stolen moments with you are his very best?  \n\nJust ignore social media. No one wants to post photos of the bad, ugly, hard stuff in real family life. Behind that happy photo of walking the dogs or kids playing in the park, there's the sad reality of feeding screaming kids or cleaning up dog diarrhea on the bed.",
            "author": "ohh-daddy",
            "id": "igyj1pr",
            "parent_id": "t3_w3uoqb",
            "score": 6,
            "created_utc": 1658346790.0,
            "replies": []
        },
        {
            "body": "My wife knows my two long term SBs, and knows about or has met all of my one and done or short term SBs.  She’s like a sorority mother with them.  My rodeo girl, SB 2, lives in our garage apartment; she pays rent every month but I give it back to her.  It’s kind of a polite fiction so her parents don’t have to acknowledge that she’s a SB.  SB1 has an apartment but she’s at the house almost daily.  Her apartment complex won’t allow dogs bigger than 30 lbs so her dog (black lab) stays with me.  Her other option is her mother’s house, which is 80 miles away.  This way her dog has a couple acres to run around on and she can see her fur baby almost every day instead of a few times a month.\n\nThe SBs regularly eat meals with us; we grocery shop for the family plus them.  They do their laundry here.  They’ve gone hiking, camping, and boating with my family.\n\nThe biggest drawback for the SBs is my wife will talk their ears off about doTERRA essential oils or Youngevity.\n\nI suspect most SBs wouldn’t want to be this close to their SD and his family.",
            "author": "NVOkie9018",
            "id": "igz5jgb",
            "parent_id": "t3_w3uoqb",
            "score": 5,
            "created_utc": 1658356570.0,
            "replies": [
                {
                    "body": "This seems more like polyam than SB/SD.",
                    "author": "ellielovey",
                    "id": "igzuwef",
                    "parent_id": "t1_igz5jgb",
                    "score": 7,
                    "created_utc": 1658368364.0,
                    "replies": [
                        {
                            "body": "They both started out as SBs.  I put one through nursing school and take the other to rodeos to compete, and I pay most of the bills involved.  I have also helped her with college.  They’re more SGFs than SBs at this point, with a pretty fair amount of Age Gap going on.  I hold on loosely because I know that nothing lasts forever, but I’m not giving either of them a reason to leave.\n\nSB 1 freestyled me, and a few months later SB1 introduced me to SB2; they’ve been friends since middle school.\n\nWe all said the L Word a few years ago.",
                            "author": "NVOkie9018",
                            "id": "ih04vj6",
                            "parent_id": "t1_igzuwef",
                            "score": 3,
                            "created_utc": 1658373060.0,
                            "replies": [
                                {
                                    "body": "Can I ask what you do for work/money?",
                                    "author": "ellielovey",
                                    "id": "ih05sya",
                                    "parent_id": "t1_ih04vj6",
                                    "score": 2,
                                    "created_utc": 1658373530.0,
                                    "replies": [
                                        {
                                            "body": "I’m retired military.  I did security contracting for a while after I retired, and now I teach people some of the things I used to do in the military and as a contractor.",
                                            "author": "NVOkie9018",
                                            "id": "ih0cus7",
                                            "parent_id": "t1_ih05sya",
                                            "score": 3,
                                            "created_utc": 1658377342.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You do understand how EXTREMELY F’ing rare your situation is, right? I’d think, maybe, 1 in 500 million type situation.  \n\nI mean, you have a wife who let’s you sleep with other women (plural) in your shared residence (not just sex but actual meaningful social interactions), live under the same roof, keep their pet at your house, be over ALL the time, give them money from your marital assets, AND she appears to have a relationship with them separate from you……\n\nDoes she involve herself in the sexual part or does she just sit quietly on the sidelines? Is she Netflix and chill while you are getting squishy with them in the boom boom smoosh room? Does SHE have relations outside your marriage? I find this very odd but, almost, like the greatest male fantasy in the world……living the dream!\n\nYou’re not Mormon are you? This isn’t some “Mormon Sisterhood” thing is it? It almost sounds like it!",
                    "author": "Jahammy72",
                    "id": "igzzhio",
                    "parent_id": "t1_igz5jgb",
                    "score": 6,
                    "created_utc": 1658370471.0,
                    "replies": [
                        {
                            "body": "I don’t have sex with them in the house.  Neither one lives in the house, although SB2 lives a few yards away.  I should clarify; we have a detached garage with an apartment over it.  She’s not involved in the sexual part, although she has watched a few times.  She would be willing to do more but the SBs aren’t willing.  For years before this developed she had a cuckquean fantasy, and she intentionally put temptation in my path on multiple occasions.  I never went for it.  Eight years ago I found out that she had had two affairs years earlier, one with her boss in the first couple years of our marriage and the second one with a neighbor while I was in Afghanistan.  We came really close to a divorce.  If it wasn’t for the kids, I would have left.  Marriage counseling, a lot of honesty, working out anger, bitterness, and resentment.  We did relationship workshops and did a lot of reading.  ‘Passionate Marriage’ by David Schnarch and ‘Come as You Are’ by Emily Nagoski are both books I recommend.\n\nOur marriage obviously survived but changed.  Before, our relationship was pure vanilla.  I had been pretty kinky before our marriage but she was very religious when we met and I gave that up for her.  I brought kink into the bedroom.  I learned to be a Master in the BDSM sense.  We started going to Dungeons.  After a couple years of working on our relationship we decided to try swinging and swapping.  We started out very cautiously and talked constantly every step of the way.  We had to be extremely discreet because I was still on active duty in the military, and I could have been prosecuted for adultery.  We still swing and swap but not often.\n\nI think that on some level her acceptance of the SRs is penance on her part for the affairs she had, like she deserves to feel the angst.  I think that had a lot to do with her putting temptation in my path years earlier.\n\nShe has a current relationship with a guy from FetLife that I have met once, at the beginning of their relationship to lay down the ground rules.  TBH I’m not happy about it but I permit it.  He does things for her that I have a hard time doing.  I deal with it by not thinking about it, and she doesn’t tell me anything about it because I don’t want to know.\n\nIt isn’t all champagne and roses.",
                            "author": "NVOkie9018",
                            "id": "ih0c0t1",
                            "parent_id": "t1_igzzhio",
                            "score": 2,
                            "created_utc": 1658376860.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Fuck that sounds amazing",
                    "author": "kiwi_berry",
                    "id": "igzm6rg",
                    "parent_id": "t1_igz5jgb",
                    "score": 2,
                    "created_utc": 1658364412.0,
                    "replies": []
                },
                {
                    "body": "Are you and your wife in an open relationship?",
                    "author": "NeighborhoodItchy943",
                    "id": "igzc0vy",
                    "parent_id": "t1_igz5jgb",
                    "score": 1,
                    "created_utc": 1658359632.0,
                    "replies": [
                        {
                            "body": "We’re ENM, yes.",
                            "author": "NVOkie9018",
                            "id": "igzfsme",
                            "parent_id": "t1_igzc0vy",
                            "score": 3,
                            "created_utc": 1658361426.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would give a very different point of view: \n\nI am single, and I had feelings for my SB (we are separated now...)\nBut at some point I realised I will never be really a part of her life as our age gap is big\n\nShe will never show me to her friends\nShe will never show me to her familly\nWe will never go to her favorite night-clubs or other places where her friends may see us\nWhen her mother died I couldnt go to the funeral, I imagined she will have cryed on my shoulder, supporting her.... but that didnt happened\n\n\nShe couldnt say because if she reveal about me (that loved her) then everybody will understand she is a sugarbaby that layed with old men only to still live at Paris",
            "author": "GuyFromParis",
            "id": "ih0m2br",
            "parent_id": "t3_w3uoqb",
            "score": 2,
            "created_utc": 1658383164.0,
            "replies": []
        },
        {
            "body": "From his perspective, you're only sleeping with him as long as he's paying you for sex.",
            "author": "bobdealin",
            "id": "ih24imu",
            "parent_id": "t3_w3uoqb",
            "score": 2,
            "created_utc": 1658415857.0,
            "replies": []
        },
        {
            "body": "Her husband is literally cheating on her babes you’re falling for a fantasy.. which isn’t bad, it’s kind of central to an SR. Just don’t let it get the best of you",
            "author": "Crystalsugarb",
            "id": "ih2n6t9",
            "parent_id": "t3_w3uoqb",
            "score": 2,
            "created_utc": 1658422824.0,
            "replies": []
        },
        {
            "body": "This literally happened to me. Same exact feeling after seeing his wife and kids. The crazy part is I didn’t even like him past the sex part(PPM, escort situation)..he wasn’t very nice to me, we didn’t spend any true intimate times together… so why did I feel this aching feeling after he left me? I’ll never know.. but I was aable to get over that feeling. i think apart of it was jealousy.. I remember I would sit and go “so he just fucks me like that, tosses me cash, then goes home to his family, with his nice car, nice house, etc”.. luckily, the resentment I built towards him helped me get him off my mind, and grow the balls to ask for a slight raise in allowance.. seeing the truth and reality definitely helped me take this man off the pedestal I had him on.",
            "author": "Tale-Itchy",
            "id": "ih35cx5",
            "parent_id": "t3_w3uoqb",
            "score": 2,
            "created_utc": 1658429603.0,
            "replies": [
                {
                    "body": "What did you expect when you made an arrangement with someone for a transaction? Sex for money. He got his sex. You got your money.",
                    "author": "CrazyMadAlice",
                    "id": "ih4n5pk",
                    "parent_id": "t1_ih35cx5",
                    "score": 3,
                    "created_utc": 1658451451.0,
                    "replies": [
                        {
                            "body": "I know this :) thank you kindly for reminding me!\nI’m human, with emotions. \nShit happens!",
                            "author": "Tale-Itchy",
                            "id": "ih4n9e2",
                            "parent_id": "t1_ih4n5pk",
                            "score": 3,
                            "created_utc": 1658451500.0,
                            "replies": [
                                {
                                    "body": "That having been said, it’s important to acknowledge he “thinks” about from time to time. It’s part of the human condition.",
                                    "author": "luckysparkie",
                                    "id": "iigjmlr",
                                    "parent_id": "t1_ih4n9e2",
                                    "score": 1,
                                    "created_utc": 1659320460.0,
                                    "replies": [
                                        {
                                            "body": "I hear you.",
                                            "author": "Tale-Itchy",
                                            "id": "iigjq1a",
                                            "parent_id": "t1_iigjmlr",
                                            "score": 2,
                                            "created_utc": 1659320508.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ih3chgo",
                    "parent_id": "t1_ih35cx5",
                    "score": 2,
                    "created_utc": 1658432295.0,
                    "replies": [
                        {
                            "body": "🤗 glad I could help.",
                            "author": "Tale-Itchy",
                            "id": "ih3db9r",
                            "parent_id": "t1_ih3chgo",
                            "score": 1,
                            "created_utc": 1658432603.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Feelings are tough in arrangements.  They make life worth it, but when they get painful it sucks.\n\nI'm a married SD. I look forward to the escape of sugar and look forward to the stability of my family.  In my case, both are amazing.\n\nWhen I started in this life sugar was amazing and home sucked.  The joy of my sugar time made me realize I had to get more deliberate about making normal life great too.\n\nMy thermostat wanted to bring down sugaring because it was too good. It seems you may be trying to do that.  Your fantasy is about what you don't have.  I highly encourage you to work hard at making your other time amazing.\n\nI hope that makes sense.\n\nWe can have it all in life, but it requires different parts of ourselves being filled in different ways.  No one aspect will do it all.  You and I are complicated. Treat each part well and you'll be high much more often.\n\nBest of luck to you. I hope you can find a way to process your feeling and continue to add to your life.",
            "author": "GlucoseGuardians",
            "id": "igyv1v7",
            "parent_id": "t3_w3uoqb",
            "score": 7,
            "created_utc": 1658351863.0,
            "replies": [
                {
                    "body": "So you had to cheat on your wife to learn to put more effort in?",
                    "author": "NeighborhoodItchy943",
                    "id": "igzb9fp",
                    "parent_id": "t1_igyv1v7",
                    "score": 7,
                    "created_utc": 1658359266.0,
                    "replies": [
                        {
                            "body": "You're making critical incorrect assumptions which I won't bother to correct.\n\nHowever to possibly help the OP and others... \n\nNo additional effort was made.\n\nIn my case I changed my mentality to focus on what I had in abundance rather than what we lacked.\n\nIt was the acknowledgment that it was unreasonable to expect a single other person to fulfill the many facets of my interests and desires.",
                            "author": "GlucoseGuardians",
                            "id": "igzwudp",
                            "parent_id": "t1_igzb9fp",
                            "score": 2,
                            "created_utc": 1658369237.0,
                            "replies": [
                                {
                                    "body": "Wholeheartedly agree with this last statement",
                                    "author": "kobereuben88",
                                    "id": "ih2iyck",
                                    "parent_id": "t1_igzwudp",
                                    "score": 1,
                                    "created_utc": 1658421268.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This is really solid and insightful advice I think we could all take into consideration",
                    "author": "kobereuben88",
                    "id": "igzf9t5",
                    "parent_id": "t1_igyv1v7",
                    "score": 2,
                    "created_utc": 1658361175.0,
                    "replies": [
                        {
                            "body": "Thank you.  Judging by the downvotes your view is not shared by most. 🤷‍♂️  Ultimately, I exist for the rare ones in life, not the majority.",
                            "author": "GlucoseGuardians",
                            "id": "ih2cr1p",
                            "parent_id": "t1_igzf9t5",
                            "score": 1,
                            "created_utc": 1658418974.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "igz11s2",
                    "parent_id": "t1_igyv1v7",
                    "score": 1,
                    "created_utc": 1658354514.0,
                    "replies": [
                        {
                            "body": "💡  New business idea.   😁",
                            "author": "GlucoseGuardians",
                            "id": "ih2cvjq",
                            "parent_id": "t1_igz11s2",
                            "score": 2,
                            "created_utc": 1658419022.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Having an affair with a married man is going to end badly for OP either way. Either he is going to break up with her - or leave his wife and children for her and she will be known as a ‘home-wrecker’  Walk away now, and save yourself heartbreak",
            "author": "SuperKitty2020",
            "id": "ih6e6db",
            "parent_id": "t3_w3uoqb",
            "score": 2,
            "created_utc": 1658490379.0,
            "replies": []
        },
        {
            "body": "Yes it’s not for everyone. I’ve been through the wave of emotions you’re experiencing and it sucks! Exactly as you’ve said it’s a horrible sinking feeling knowing there are some things you’ll never get to experience with him, without some sort of time constraint. It’s difficult to navigate this lifestyle too which is why you may just continue. Nobody is there to tell you what happens in the end. I’m 2 years with my guy and I’m very happy, although I did have to come to a place of acceptance with our dynamic. I’ll never get to experience some things with him.",
            "author": "mayvalentine",
            "id": "igyzvjs",
            "parent_id": "t3_w3uoqb",
            "score": 2,
            "created_utc": 1658353994.0,
            "replies": []
        },
        {
            "body": "If you think his wife really in the dark, you’re mistaken.\nWives have mother’s instinct, his sudden shift in mood after spending time with you, enough to expose him.\nHis wife knows and she’s Ok with that, as long his affair stays secret, and doesn’t cause any social embarrassment \n\nSo; #1 never feel guilty for yourself, never feel sorry for her.\n\n2 if you really don’t like your arrangement this way, you can leave anytime, but don’t punish yourself for him being with someone else at a different time.\n\n3 if he was your husband he will have an affair on you, all top value men go with multiple relations, one is never enough, you can’t change that.\nIf he settles for you, chances are in few years you will lose your desire to him because he’s getting sloppy at the game.",
            "author": "NightMasterDom",
            "id": "igypxih",
            "parent_id": "t3_w3uoqb",
            "score": 1,
            "created_utc": 1658349673.0,
            "replies": [
                {
                    "body": "This is so depressing but true.",
                    "author": "lifting12",
                    "id": "igyr2na",
                    "parent_id": "t1_igypxih",
                    "score": 2,
                    "created_utc": 1658350153.0,
                    "replies": [
                        {
                            "body": "How is that even depressing ?",
                            "author": "Splenda-Paris",
                            "id": "igyrktl",
                            "parent_id": "t1_igyr2na",
                            "score": 2,
                            "created_utc": 1658350365.0,
                            "replies": [
                                {
                                    "body": "I mean number 3 is pretty depressing",
                                    "author": "Quick_Chocolate_657",
                                    "id": "igysxlj",
                                    "parent_id": "t1_igyrktl",
                                    "score": 3,
                                    "created_utc": 1658350937.0,
                                    "replies": [
                                        {
                                            "body": "Will tell you a story about (3)\nIn Super man movie, \nShe loves the hero, then she wants to be with him all the time, so she convinces him to give up on being the hero.\nThe moment he gives up his hero role for her, she loses interest in him and the love fades away. \n\nThat’s from real life, I’ve discussed this part with many girls, every time I get the same answer.\n\nIt’s very arousing to girls, when they find a man on mission, (any type of mission) they love him for his dedication, then they test that dedication, the moment he gives up his mission for his girl, he lost her. \n\nThis is how the game ends.",
                                            "author": "NightMasterDom",
                                            "id": "igyv9jp",
                                            "parent_id": "t1_igysxlj",
                                            "score": -1,
                                            "created_utc": 1658351956.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Was really just talking about #3. Personally I don’t want a relationship and would prefer men be in a relationship but I know a lot of people don’t want that. So I think it’s sad for those looking for it. And the getting sloppy after time is depressing for everyone because people do get that way. Hard to keep things exciting sometimes. Lol.",
                                    "author": "lifting12",
                                    "id": "igys97l",
                                    "parent_id": "t1_igyrktl",
                                    "score": 2,
                                    "created_utc": 1658350649.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Should you be doing this with married men even if the money is good? More importantly should married men be doing this even if they have lots of money? This affair cheats you of enjoying a single man, the married man from his marriage vows, his wife from his faithfulness, and his children from the stability of a two parent household. \n\nIt just seems incredibly risky and not worthwhile for him, but ok I guess if the money he gives you is good. Still, this seems to just have so many bad and unhappy outcomes. It’s just escorting no matter how you dress it up, because it always has to be discreet. \n\nPeople doing this really should be unmarried or at least divorced so they can give their new partner the attention and care they deserve.",
            "author": null,
            "id": "igyi7h2",
            "parent_id": "t3_w3uoqb",
            "score": 0,
            "created_utc": 1658346442.0,
            "replies": [
                {
                    "body": "I get that, but in Sugar, it's almost the same with single SDs. They don't want to get married and they have a big life outside of the sugar dates. The only difference, really, is when you start thinking about and/or imagining his life with his family.",
                    "author": "matthewjphillips",
                    "id": "igyxinr",
                    "parent_id": "t1_igyi7h2",
                    "score": 2,
                    "created_utc": 1658352946.0,
                    "replies": [
                        {
                            "body": "The other difference is that no one is a cheating sack of garbage",
                            "author": "TreatMeLikeASlut8",
                            "id": "igz2b5d",
                            "parent_id": "t1_igyxinr",
                            "score": 4,
                            "created_utc": 1658355089.0,
                            "replies": [
                                {
                                    "body": "I agree with you that cheating on your wife is uncool and unfair. I'm actually rather shocked at how prevalent it appears to be -- in and out of the Bowl.",
                                    "author": "matthewjphillips",
                                    "id": "igz9gz9",
                                    "parent_id": "t1_igz2b5d",
                                    "score": 2,
                                    "created_utc": 1658358410.0,
                                    "replies": [
                                        {
                                            "body": "Yeah it’s kinda making me wanna give up on serious relationships. It’s like no one can be trusted",
                                            "author": "TreatMeLikeASlut8",
                                            "id": "igzxp5j",
                                            "parent_id": "t1_igz9gz9",
                                            "score": 3,
                                            "created_utc": 1658369639.0,
                                            "replies": [
                                                {
                                                    "body": "Be careful about over-generalizing.\n\nJust become SOME can't be trusted; Heck, even if MOST can't be trusted; it doesn't mean NO ONE can be trusted.\n\nDon't live your life alone just because you're afraid to find someone who deserves your trust.",
                                                    "author": "matthewjphillips",
                                                    "id": "igzy2jd",
                                                    "parent_id": "t1_igzxp5j",
                                                    "score": 2,
                                                    "created_utc": 1658369812.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah, I keep telling myself that.",
                                                            "author": "TreatMeLikeASlut8",
                                                            "id": "igzyysx",
                                                            "parent_id": "t1_igzy2jd",
                                                            "score": 2,
                                                            "created_utc": 1658370229.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Now you know how SDs feel about loser vanilla boyfriends and the perks they get.",
            "author": null,
            "id": "igz4bxh",
            "parent_id": "t3_w3uoqb",
            "score": 1,
            "created_utc": 1658356011.0,
            "replies": []
        },
        {
            "body": "If he gave you zero dollars would you still wanna be with him? What you have only exists within the constraints you're in. Outside of it, the man, the money, the dynamic doesn't exist for real. Only in this version.",
            "author": "1-800-PizzaSlut",
            "id": "igz27tx",
            "parent_id": "t3_w3uoqb",
            "score": 1,
            "created_utc": 1658355047.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "igz3m0j",
                    "parent_id": "t1_igz27tx",
                    "score": 1,
                    "created_utc": 1658355680.0,
                    "replies": [
                        {
                            "body": "Yeah but that's not a two way street. He would not likely bother with you if you were ugly, old, fat, or nagging at him. Your relationship is transactional. At best, you could have the wife position which he clearly has pretty low respect for. Does he ever complain about her? Every kind word coming your way could be to her...but he doesn't nurture THAT relationship. Always attempt to see things as they are, not as you'd like them to be",
                            "author": "1-800-PizzaSlut",
                            "id": "igz491p",
                            "parent_id": "t1_igz3m0j",
                            "score": 9,
                            "created_utc": 1658355975.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh honey I'm not the one getting fucked here.  I'm just the one wasting popcorn while watching you fuck your own life up.  Tyvm for the entertainment",
            "author": "Embarrassed-Safe2145",
            "id": "ih5gc9a",
            "parent_id": "t3_w3uoqb",
            "score": 0,
            "created_utc": 1658466079.0,
            "replies": []
        },
        {
            "body": "Anyone who steps out on their marriage and kids is literally human garbage. And you’re sort of garbage too for going along with it. Does no one have any respect anymore?",
            "author": "A_Hippie_Chick",
            "id": "ih21bi9",
            "parent_id": "t3_w3uoqb",
            "score": -1,
            "created_utc": 1658414623.0,
            "replies": [
                {
                    "body": "Literally garbage! Folks, this is **not** a metaphor!!",
                    "author": "Finzi",
                    "id": "ih2atm2",
                    "parent_id": "t1_ih21bi9",
                    "score": 0,
                    "created_utc": 1658418260.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You’re suffering because of your own shitty life choices. Boo fucking hoo. Maybe don’t be a trash person next time?\n\nETA: neither of you will ever truly be happy (unless you stop being a trash person. Which seems unlikely, but we can only hope!)",
            "author": "throwaway144811",
            "id": "ih2wj5a",
            "parent_id": "t3_w3uoqb",
            "score": -1,
            "created_utc": 1658426294.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ih2xnp4",
                    "parent_id": "t1_ih2wj5a",
                    "score": 3,
                    "created_utc": 1658426714.0,
                    "replies": [
                        {
                            "body": "Not sleeping with a married man who has 2 kids is hardly being a saint. It’s standard not-shittyness. I almost feel bad for you.",
                            "author": "throwaway144811",
                            "id": "ih2xyu3",
                            "parent_id": "t1_ih2xnp4",
                            "score": 1,
                            "created_utc": 1658426830.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ih2y7ov",
                                    "parent_id": "t1_ih2xyu3",
                                    "score": 0,
                                    "created_utc": 1658426924.0,
                                    "replies": [
                                        {
                                            "body": "Ew. \n\nP.S. I can almost guarantee that the married schmuck you’re seeing doesn’t care about you, at least not nearly as much as you think you care about him. Both of you are empty people. Where did it all go wrong? Don’t actually answer that. Bye now",
                                            "author": "throwaway144811",
                                            "id": "ih2zisn",
                                            "parent_id": "t1_ih2y7ov",
                                            "score": -2,
                                            "created_utc": 1658427421.0,
                                            "replies": [
                                                {
                                                    "body": "I’m sorry you’re hurting but maybe you shouldn’t be in this subreddit if the fact that Married Sugar Dads exist, is triggering for you. \n\nPeople are going through enough, no need to be a jackass. 🫣",
                                                    "author": "Tale-Itchy",
                                                    "id": "ih3a0ex",
                                                    "parent_id": "t1_ih2zisn",
                                                    "score": 6,
                                                    "created_utc": 1658431360.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You know...all relationships have mystery.  In vanilla world, the mystery is, Will I get laid tonight?  In sugar world the sex is guaranteed, one reason why it feels better...the man is confident.  But almost everything else in sugar world is a mystery.   He may want to stay and snuggle with you, and, he may have the schedule flexibility to do so...but, in the interest of respecting relationship boundaries, he leaves.  Talk with him about getting more snuggle time.",
            "author": "sdphilly",
            "id": "igyw968",
            "parent_id": "t3_w3uoqb",
            "score": 0,
            "created_utc": 1658352386.0,
            "replies": []
        },
        {
            "body": "I know the feelings hurt. But I just want to say, as a POT SD, I hope I only ever have sugar relationships with women who will end up having feelings for me -- and I them -- even though it will never progress to marriage.",
            "author": "matthewjphillips",
            "id": "igyxpzk",
            "parent_id": "t3_w3uoqb",
            "score": 0,
            "created_utc": 1658353036.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ih58p21",
            "parent_id": "t3_w3uoqb",
            "score": 0,
            "created_utc": 1658461773.0,
            "replies": []
        },
        {
            "body": "This is hilarious. You got with a married dude with kids on purpose and now you’re sad he’s a married dude with kids? Is this a joke?",
            "author": "-kelsie",
            "id": "ihgwe9x",
            "parent_id": "t3_w3uoqb",
            "score": 0,
            "created_utc": 1658682446.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ihgwnqn",
                    "parent_id": "t1_ihgwe9x",
                    "score": 2,
                    "created_utc": 1658682557.0,
                    "replies": [
                        {
                            "body": "Yeah, I guess. You should be rethinking things. I’m all for sugar babies living their best life. However - you’re taking this a BIG step too far. You’re hurting a fellow woman and her innocent children by taking part in this relationship. Try working on some morals instead of having a pity party that you’re not the focus of a MARRIED man’s world. This post pained me just to read. 🤦‍♀️",
                            "author": "-kelsie",
                            "id": "ihgwyzw",
                            "parent_id": "t1_ihgwnqn",
                            "score": 1,
                            "created_utc": 1658682691.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Did you read til the end? This is a cautionary tale.",
                    "author": "luckysparkie",
                    "id": "iigjb9q",
                    "parent_id": "t1_ihgwe9x",
                    "score": 1,
                    "created_utc": 1659320302.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Londonbebe you are in the same exact position as my sb. Exactly. I'm the same as your SD. We've been together for 2 years and it breaks her heart because she wants to be first. If I can help I'll try. ❤️",
            "author": "18newbie44880011",
            "id": "igzxcqq",
            "parent_id": "t3_w3uoqb",
            "score": -1,
            "created_utc": 1658369476.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ih0p0cg",
                    "parent_id": "t1_igzxcqq",
                    "score": 1,
                    "created_utc": 1658385273.0,
                    "replies": [
                        {
                            "body": "I try. Please tell me how.",
                            "author": "18newbie44880011",
                            "id": "ih18c5c",
                            "parent_id": "t1_ih0p0cg",
                            "score": 0,
                            "created_utc": 1658400284.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ih2so9j",
                                    "parent_id": "t1_ih18c5c",
                                    "score": 2,
                                    "created_utc": 1658424854.0,
                                    "replies": [
                                        {
                                            "body": "I do all of these. As matter of fact she's not one to text alot at night. Actually I see her most weeks 5 days a week. Not for play time only. A lot just to bring her a coffee and a muffin. \nHere comes the muffin man lol\nhttps://m.youtube.com/watch?v=fXFg5QsTcLQ",
                                            "author": "18newbie44880011",
                                            "id": "ih2v0wd",
                                            "parent_id": "t1_ih2so9j",
                                            "score": 2,
                                            "created_utc": 1658425732.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That why a married SD should always say his wife died in a terrible car accident. To prevent this kind of drama. Women are sensible beings and it's important to preserve their feelings.\n\nWhile your feelings are totally valid, this SD is an asshole for telling you about his private life. He also has bad OPSEC and something tells me it's going to end in blackmail.",
            "author": "sugardad123",
            "id": "igyr0ap",
            "parent_id": "t3_w3uoqb",
            "score": -7,
            "created_utc": 1658350126.0,
            "replies": [
                {
                    "body": "He’s also an asshole for cheating on his wife",
                    "author": "TreatMeLikeASlut8",
                    "id": "igz2how",
                    "parent_id": "t1_igyr0ap",
                    "score": 5,
                    "created_utc": 1658355170.0,
                    "replies": [
                        {
                            "body": "And that, of course.",
                            "author": "sugardad123",
                            "id": "igz72se",
                            "parent_id": "t1_igz2how",
                            "score": 3,
                            "created_utc": 1658357287.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Totally messed up opsec.",
                    "author": null,
                    "id": "igz4ybw",
                    "parent_id": "t1_igyr0ap",
                    "score": 1,
                    "created_utc": 1658356300.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I totally get this feeling. I want to be there for the fun parts, but also the support for the hard stuff and i feel helpless not being able to be there for that kind of thing. But yea, the fun daydreams of waking up on Saturday mornings together or cooking together can be a little difficult, especially following a good date. You often have to take it for what it’s worth and not ask for too much more because that’s how you might end up ruining a seemingly good thing.",
            "author": "PrincessPeach9315",
            "id": "igylgk5",
            "parent_id": "t3_w3uoqb",
            "score": 1,
            "created_utc": 1658347802.0,
            "replies": []
        },
        {
            "body": ":-( sucks.",
            "author": "Grouchy-Surround5372",
            "id": "ih286cv",
            "parent_id": "t3_w3uoqb",
            "score": 1,
            "created_utc": 1658417262.0,
            "replies": []
        },
        {
            "body": "Yeah, what a great guy he is, cheating on his beautiful wife who gave him children with someone he has to financially incentivize. \n\nWhat a dream the wife is living, clearly. /s",
            "author": "Zhorie-Rove",
            "id": "ioqz2o1",
            "parent_id": "t3_w3uoqb",
            "score": 1,
            "created_utc": 1663381973.0,
            "replies": [
                {
                    "body": "Yes, he's wonderful",
                    "author": "londonbebe",
                    "id": "iorl8b5",
                    "parent_id": "t1_ioqz2o1",
                    "score": 2,
                    "created_utc": 1663395312.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Plus her husband is having an affair lol. I don’t think she’s exactly living the dream here",
            "author": "Quick_Chocolate_657",
            "id": "igysowi",
            "parent_id": "t1_igyfdhi",
            "score": 203,
            "created_utc": 1658350835.0,
            "replies": [
                {
                    "body": "I have to remind myself this! These married guys are still cheating at the end of the day.. that makes him a dishonest person and all that jazz. That’s not someone who we would even want to fuck with.. yet, we are in our feelings over them.. \n\nHaving these types of rational, honest conversations with yourself, DEFINITELY brings you back down to earth!",
                    "author": "Tale-Itchy",
                    "id": "ih35zpx",
                    "parent_id": "t1_igysowi",
                    "score": 7,
                    "created_utc": 1658429845.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So true. SDs show their best sides in an SR. After all it’s a few hours a week or so where we can be on our best behaviour…. And when we’re with a beautiful woman it ain’t hard to be that perfect positive engaging person. But living with someone 24/7 is a different ball game. Your real self cannot be hidden. We all have an ugly or boring side that your partner will always get to see.",
            "author": null,
            "id": "ih0s9ay",
            "parent_id": "t1_igyfdhi",
            "score": 13,
            "created_utc": 1658387704.0,
            "replies": []
        },
        {
            "body": "You're projecting, all SDs have a maid.",
            "author": "sugardad123",
            "id": "igyracc",
            "parent_id": "t1_igyfdhi",
            "score": 14,
            "created_utc": 1658350242.0,
            "replies": [
                {
                    "body": "I don't. I did when I was married though.",
                    "author": "AShatteredKing",
                    "id": "ih21gn9",
                    "parent_id": "t1_igyracc",
                    "score": 1,
                    "created_utc": 1658414677.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Isn’t it a little destructive though? OP probably won’t find a guy that will marry her and treat her like the SD treats his wife. Any relationship after this will be measured against the SD and won’t live up.",
            "author": "sugarthrowaway407",
            "id": "igyvla4",
            "parent_id": "t1_igyfdhi",
            "score": 6,
            "created_utc": 1658352096.0,
            "replies": [
                {
                    "body": "I mean what OPs describing sounds pretty normal. Hanging out with your husband, being with each other without a time limit. That’s just part of living together 🤷🏾‍♀️. She could find easily find that, and he prob won’t be cheating on her. Now that’s if she goes to vanilla eating at some point, that type of thing with a SD would be really hard to find yeah",
                    "author": "Quick_Chocolate_657",
                    "id": "igz5bbo",
                    "parent_id": "t1_igyvla4",
                    "score": 6,
                    "created_utc": 1658356466.0,
                    "replies": [
                        {
                            "body": "Yeah you can’t really remove the money part.",
                            "author": "sugarthrowaway407",
                            "id": "igz7pn7",
                            "parent_id": "t1_igz5bbo",
                            "score": 3,
                            "created_utc": 1658357582.0,
                            "replies": [
                                {
                                    "body": "I assume at some point she’ll get out of the bowl. Most ppl don’t do it forever right?",
                                    "author": "Quick_Chocolate_657",
                                    "id": "igza4ri",
                                    "parent_id": "t1_igz7pn7",
                                    "score": 1,
                                    "created_utc": 1658358729.0,
                                    "replies": [
                                        {
                                            "body": "An ex sugar baby can be a red flag for most. It’s even worse if she doesn’t admit it and it’s found out later in the relationship.",
                                            "author": "sugarthrowaway407",
                                            "id": "igzjqx6",
                                            "parent_id": "t1_igza4ri",
                                            "score": 2,
                                            "created_utc": 1658363276.0,
                                            "replies": [
                                                {
                                                    "body": "I mean sure, but there are some guys who wouldn’t care. She realistically can’t sugar her whole life.",
                                                    "author": "Quick_Chocolate_657",
                                                    "id": "igztpja",
                                                    "parent_id": "t1_igzjqx6",
                                                    "score": 3,
                                                    "created_utc": 1658367827.0,
                                                    "replies": [
                                                        {
                                                            "body": "“Some guys”… yeah I also can quadruple my money at the casino tonight. Relying on hope is a bad strategy especially when you’re talking about your life outcomes",
                                                            "author": "sugarthrowaway407",
                                                            "id": "igzyp75",
                                                            "parent_id": "t1_igztpja",
                                                            "score": -3,
                                                            "created_utc": 1658370103.0,
                                                            "replies": [
                                                                {
                                                                    "body": "There are a lot of guys who would date a former SB. Men date strippers don’t they? People are different, but there are plenty of men who wouldn’t mind. Literally what other choice would she have? She’s gonna be sugaring at 60?",
                                                                    "author": "Quick_Chocolate_657",
                                                                    "id": "ih03cgd",
                                                                    "parent_id": "t1_igzyp75",
                                                                    "score": 3,
                                                                    "created_utc": 1658372307.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Not true, it is not impossible or that that hard to find high quality and value providing man if you work on yourself and have high standards. The goal is to pick the one who sees you as a dream girl.",
                    "author": "idontlikespiderplant",
                    "id": "ih1a8sy",
                    "parent_id": "t1_igyvla4",
                    "score": 4,
                    "created_utc": 1658401569.0,
                    "replies": [
                        {
                            "body": "I think you missed the mark on a lot of things. “Not impossible” will lead you to disappointment. The caliber of men you’re looking at aren’t chasing their dream girl, they chase their goals.\nAlso looking at your profile it looks like you’re eluding that being an escort does not hurt your chances of finding a provider high quality man which is madness.",
                            "author": "sugarthrowaway407",
                            "id": "ih1magy",
                            "parent_id": "t1_ih1a8sy",
                            "score": 0,
                            "created_utc": 1658408218.0,
                            "replies": [
                                {
                                    "body": "You are wrong in many points of your comment but that is your opinion and experience. Mine is different. And yes, they must chase career but believe me, once you are a dreamgirl to one of them you will experience some real special treatment. But the fact that you are their dream girl does not mean they are what you want. And yeah, they do not give a damn about escorting. Maybe do your research how many wives of high earning men were escorts, and how many of them actually met at work. Of course it wont be written explicitly. It is like the movie breakfast at tiffanys which is about escort, and so many people do not get it lol :D. But yeah, the reason why I say not impossible is because for some it will be easier then for others. I do not know how the girls looks like, how are their manners, intelligence, social skills etc. If you are model material with rubbish personality your chances are low.",
                                    "author": "idontlikespiderplant",
                                    "id": "ihbl534",
                                    "parent_id": "t1_ih1magy",
                                    "score": 2,
                                    "created_utc": 1658583787.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "And you are married to such a man now right?",
                            "author": "AShatteredKing",
                            "id": "ih21t0o",
                            "parent_id": "t1_ih1a8sy",
                            "score": 1,
                            "created_utc": 1658414811.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Why wouldn't she find a husband like that?",
                    "author": "WiseRequirement9277",
                    "id": "igzbp40",
                    "parent_id": "t1_igyvla4",
                    "score": 3,
                    "created_utc": 1658359475.0,
                    "replies": [
                        {
                            "body": "I would argue OP has found a husband like that…just someone else’s.",
                            "author": null,
                            "id": "igzpi2z",
                            "parent_id": "t1_igzbp40",
                            "score": 7,
                            "created_utc": 1658365926.0,
                            "replies": []
                        },
                        {
                            "body": "Men making sugar daddy money aren’t making ex sugar babies their wife. If they’re extremely attractive disregard everything I just said.",
                            "author": "sugarthrowaway407",
                            "id": "igzjyhx",
                            "parent_id": "t1_igzbp40",
                            "score": 2,
                            "created_utc": 1658363373.0,
                            "replies": [
                                {
                                    "body": "So they do 😄",
                                    "author": "WiseRequirement9277",
                                    "id": "igzl0yu",
                                    "parent_id": "t1_igzjyhx",
                                    "score": 3,
                                    "created_utc": 1658363874.0,
                                    "replies": [
                                        {
                                            "body": "Extremely attractive means women who have successfully modeled or who’ve been offered modeling additions…",
                                            "author": "sugarthrowaway407",
                                            "id": "igzpk9i",
                                            "parent_id": "t1_igzl0yu",
                                            "score": -2,
                                            "created_utc": 1658365953.0,
                                            "replies": [
                                                {
                                                    "body": "So it happens 😄",
                                                    "author": "WiseRequirement9277",
                                                    "id": "ih0rqou",
                                                    "parent_id": "t1_igzpk9i",
                                                    "score": 3,
                                                    "created_utc": 1658387307.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Maybe but let’s be careful not to portray her as a “victim” of it….she went in with both eyes wide open.",
                    "author": "Jahammy72",
                    "id": "igzwfnx",
                    "parent_id": "t1_igyvla4",
                    "score": 2,
                    "created_utc": 1658369049.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's a great quote",
            "author": "SporadicEmoter",
            "id": "igzcj7c",
            "parent_id": "t1_igyfspr",
            "score": 6,
            "created_utc": 1658359877.0,
            "replies": []
        },
        {
            "body": "And the emotions often do ‘get you’….when you’re hanging out in beautiful hotels and fancy restaurants eating great food, drinking great wine, with someone you find attractive, where the sex is good/great, the conversation is engaging and where you’re showing your best side only…. It’s all very intoxicating. And it’s not ruined by pesky domesticity! So yea if that doesn’t make you emotional then you’ve become too hardened. I don’t want to be that person. Give me emotions even if it involves pain when things end.",
            "author": null,
            "id": "ih1okyh",
            "parent_id": "t1_igyfspr",
            "score": 5,
            "created_utc": 1658409295.0,
            "replies": []
        },
        {
            "body": "A very important point made here. Social media does only one thing which is project the best times of peoples lives and leaves out 90% of the rest of their ordinary or challenging times. Whatever is shown is a highly distorted version of someone’s life.",
            "author": null,
            "id": "ih1hc9x",
            "parent_id": "t1_igyfo1k",
            "score": 2,
            "created_utc": 1658405720.0,
            "replies": []
        },
        {
            "body": "Yep, we both feel it - there are such great things each of us get to do that are separate … and … it has to be and it’s part of making our (forgive me) coming tighter so sweet.",
            "author": "SDLASF1",
            "id": "igylksr",
            "parent_id": "t1_igye256",
            "score": 7,
            "created_utc": 1658347851.0,
            "replies": []
        },
        {
            "body": "Whatever pain you and OP feel from your situations you completely deserve. The husbands deserve worse for betraying their wives but women like you genuinely do not deserve love or respect.",
            "author": "Teachtheworldinlove",
            "id": "ih2s0ld",
            "parent_id": "t1_igye256",
            "score": -2,
            "created_utc": 1658424612.0,
            "replies": [
                {
                    "body": "Awe. An incel got triggered. Thoughts and prayers loser.",
                    "author": "TastySpermDispenser",
                    "id": "ih2syc3",
                    "parent_id": "t1_ih2s0ld",
                    "score": 5,
                    "created_utc": 1658424959.0,
                    "replies": [
                        {
                            "body": "Why is a person who is opposed to adultery an \"incel\"?",
                            "author": "NITAREEDDESIGNS",
                            "id": "ih3xkwq",
                            "parent_id": "t1_ih2syc3",
                            "score": 0,
                            "created_utc": 1658440346.0,
                            "replies": [
                                {
                                    "body": "For the same reason I can watch a parent eat a greasy hamburger with their young fat child while talking about santa and still love and respect them both.\n#\nMy comment relates more to his comment history. Mommy and daddy clearly taught him that he gets to own someone as soon as he persuades them to marriage, no matter what what garbage person he becomes.\n#\nBe mad at adultry all you want; it's still two human beings, neither one harming anyone, and certainly not the adult who definitely didnt break any promises.  I dont know you, but I guarantee multiple times in life you have participated in breaking contracts, and I still love you bro.",
                                    "author": "TastySpermDispenser",
                                    "id": "ih45i7b",
                                    "parent_id": "t1_ih3xkwq",
                                    "score": 3,
                                    "created_utc": 1658443589.0,
                                    "replies": [
                                        {
                                            "body": ">I dont know you, but I guarantee multiple times in life you have participated in breaking contracts\n\nYou don't know me and yet you presume to \"guarantee\" something about me?\n\n&#x200B;\n\n>Be mad at adultry all you want; it's still two human beings, neither one harming anyone,\n\nOh yes...both \"human beings\" are, indeed, harming people and not just any SOs involved.\n\n>I still love you bro.\n\nIf I had a $ for every time a Redditor thought I was a dude...",
                                            "author": "NITAREEDDESIGNS",
                                            "id": "ih46ive",
                                            "parent_id": "t1_ih45i7b",
                                            "score": -1,
                                            "created_utc": 1658444020.0,
                                            "replies": [
                                                {
                                                    "body": "Yep! All adult humans break contracts sometimes.  You have too.  Do you think you have never exceeded the speed limit? Brought something into a movie theater? Accidentally left something off a customer's order at your retail job?  X doubt.\n#\nAbstract concepts are not harm dude.\n#\nDont really care what your gender is homie.  Go to IG if it's such a big deal to you.",
                                                    "author": "TastySpermDispenser",
                                                    "id": "ih47jpl",
                                                    "parent_id": "t1_ih46ive",
                                                    "score": 1,
                                                    "created_utc": 1658444449.0,
                                                    "replies": [
                                                        {
                                                            "body": "LOL\n\nThe \"speed limit\" is not a \"contract\".\n\nTaking something into a movie theater is not a \"contract\".\n\nAccidentally leaving something off a customer's order is not a \"contract\".\n\nBreaking trust...breaking homes are not \"abstract concepts\".  What a load of crap...\n\nCalling a woman a man is offensive...deflect all you want, but that is a fact.",
                                                            "author": "NITAREEDDESIGNS",
                                                            "id": "ih49kwj",
                                                            "parent_id": "t1_ih47jpl",
                                                            "score": -1,
                                                            "created_utc": 1658445324.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Your insurance contract literally requires you to drive the speed limit.\n#\nYour movie ticket contract literally prohibits outside food and drink.\n#\nBreaking trust? Lol. Do you believe everything you read and see? You must have a lot of broken trust with all this advertising, and yet, you struggle on! You're a punch line!",
                                                                    "author": "TastySpermDispenser",
                                                                    "id": "ih4a941",
                                                                    "parent_id": "t1_ih49kwj",
                                                                    "score": 2,
                                                                    "created_utc": 1658445617.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Wrong subreddit. \nWhy are you even on one like this if you’re just going to be like that, lol. \nThe amount of married SDs out there may shock you.",
                    "author": "Tale-Itchy",
                    "id": "ih37fpa",
                    "parent_id": "t1_ih2s0ld",
                    "score": 2,
                    "created_utc": 1658430388.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ll bet two dollars the wife does not want it, at least not from him",
            "author": "DarcyBennet81",
            "id": "igyvoa1",
            "parent_id": "t1_igygkxt",
            "score": 33,
            "created_utc": 1658352131.0,
            "replies": [
                {
                    "body": "I’ll bet my SBs allowance on this…😁",
                    "author": "quietgrey1",
                    "id": "ih2p1y7",
                    "parent_id": "t1_igyvoa1",
                    "score": 7,
                    "created_utc": 1658423518.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is the mindset to have when dealing with married SDs honestly. Can’t be THAT great of a catch if he’s doing shit like that in the first place.",
            "author": "Tale-Itchy",
            "id": "ih37oy1",
            "parent_id": "t1_ih19snb",
            "score": 5,
            "created_utc": 1658430485.0,
            "replies": [
                {
                    "body": "They are absolute rubbish and if I would get again into situation as I did in past of wife calling me, I would AGAIN be on the wife side. Remember it as yesterday how she has to make her mind what she wants, and if it is divorce, she must act smart and quiet. The movie \"the other woman\" feels very familiar to me and minus the fun part it is not that farfetched.",
                    "author": "idontlikespiderplant",
                    "id": "ihbkdwy",
                    "parent_id": "t1_ih37oy1",
                    "score": 2,
                    "created_utc": 1658583404.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She's most likely ignoring the fuck out of him and pretending he doesn't exist and sees any type of intimacy as a duty or another chore for her to do. Husbands get randy, wives get nasty lazy.",
            "author": "Charmane1001",
            "id": "ih790f2",
            "parent_id": "t1_ih19snb",
            "score": 2,
            "created_utc": 1658504109.0,
            "replies": [
                {
                    "body": "Well men get lazy , they walk around dirty, smelly, farts, act like imbecils and women are expected to see them as their personal sex symbol. Also let's face the reality, women do not switch or turn for no reason. It is the constant disappointment in your partner that kills all sexual drive, love, care and interest. That is something men do not understand. At some point we give up trying. I personally would never want a man to live with. Men and kids are same, fun when you do not have them all the time and do not have to take care of them.",
                    "author": "idontlikespiderplant",
                    "id": "ihbk3fr",
                    "parent_id": "t1_ih790f2",
                    "score": 2,
                    "created_utc": 1658583256.0,
                    "replies": [
                        {
                            "body": "Tl;Dr version: Women love accessories until they’re stuck with them.",
                            "author": "luckysparkie",
                            "id": "iigjuza",
                            "parent_id": "t1_ihbk3fr",
                            "score": 1,
                            "created_utc": 1659320577.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ih1gvew",
            "parent_id": "t1_ih19snb",
            "score": -6,
            "created_utc": 1658405469.0,
            "replies": [
                {
                    "body": "That’s always on the edge of a guys mind. If he works a lot (like I do), his mind sometimes goes to dark places. It’s messed up but it happens",
                    "author": "luckysparkie",
                    "id": "iigk9k9",
                    "parent_id": "t1_ih1gvew",
                    "score": 1,
                    "created_utc": 1659320785.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "igyx5sn",
            "parent_id": "t1_igyi585",
            "score": 8,
            "created_utc": 1658352788.0,
            "replies": [
                {
                    "body": "I think he meant POT SB.",
                    "author": "NVOkie9018",
                    "id": "igz5nlr",
                    "parent_id": "t1_igyx5sn",
                    "score": 1,
                    "created_utc": 1658356624.0,
                    "replies": [
                        {
                            "body": "Indeed, it was a typo.",
                            "author": "dallas-explorer",
                            "id": "igzdyme",
                            "parent_id": "t1_igz5nlr",
                            "score": 1,
                            "created_utc": 1658360557.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">have no capability to organise his women so he can openly enjoy two women in public..\n\nThis. I love going out with two or three of my sugar babies at once.",
            "author": "LuckyINTJ",
            "id": "igz0izc",
            "parent_id": "t1_igyqekh",
            "score": 3,
            "created_utc": 1658354284.0,
            "replies": [
                {
                    "body": "Same as the dude who owns playboy magazine. Those blonde fake boobs love the comfort, status and material shit you can provide. \n\nTry to ask them absolutely willingly to become your concubine and all bear kids for you, like How Stanley Ho organised his four wives in the open air. \n\nSometimes people live in a delusional life. There aren’t many alpha males who can truly enjoy more than one woman. There aren’t many men who can truly satisfy two women financially, sexually and emotionally. \n\nMoney can buy men lots of sex and a moment of masculinity, but it can’t buy you loyalty, respect and a lifelong devotion.",
                    "author": null,
                    "id": "igzzgd7",
                    "parent_id": "t1_igz0izc",
                    "score": 0,
                    "created_utc": 1658370456.0,
                    "replies": [
                        {
                            "body": ">Stanley Ho\n\nThanks. Had not heard of Stanley Ho before.\n\nhttps://asiatimes.com/2018/01/real-reasons-behind-hong-kongs-love-polygamous-tycoons/",
                            "author": "LuckyINTJ",
                            "id": "ih6zu46",
                            "parent_id": "t1_igzzgd7",
                            "score": 1,
                            "created_utc": 1658500498.0,
                            "replies": [
                                {
                                    "body": "I don’t think polygamy or polyamory are wrong. \nI generally believe as long as there is no cheating, any human relationships are legitimate. \n\nThere is no such a term “ openly cheating “ .. you are either scared and cheat secretly behind your wife or you openly enjoy your lover with your wife’s agreement. \n\nMaybe there are men in this world women are willingly to share for the rest of their life. \n\nWillingly is always a key word. In many religious or historical contexts, a man owns multi women because of gender inequality. For example, women can’t inherit land or properties. And many women were forced to share a man. \n\nBut if they are not forced and everyone knows exactly what’s going on, you will have the empire Stanley Ho created. \n\nIn reality, it’s extremely hard work to have more than one women (this different from group sex you are talking about ) .. Stanley created a big family with his four women , each left him offsprings and they are all properly recorded in the family tree.",
                                    "author": null,
                                    "id": "ihb6oo9",
                                    "parent_id": "t1_ih6zu46",
                                    "score": 1,
                                    "created_utc": 1658575313.0,
                                    "replies": [
                                        {
                                            "body": ">There is no such a term “ openly cheating “ .. you are either scared and cheat secretly behind your wife or you openly enjoy your lover with your wife’s agreement\n\nI am widowed and not have a wife. I have four sugar babies.  They all know about each other and are friends.",
                                            "author": "LuckyINTJ",
                                            "id": "ihrukeu",
                                            "parent_id": "t1_ihb6oo9",
                                            "score": 1,
                                            "created_utc": 1658873039.0,
                                            "replies": [
                                                {
                                                    "body": "I don’t know what you are trying to tell me. \nAgain you are just like the guy who own playboy magazine with all the blonde chicks living in the same house with him. They stay around for comfort, job career, fame and status. They don’t truly love him or devote their life to the old white guy.",
                                                    "author": null,
                                                    "id": "ihsamee",
                                                    "parent_id": "t1_ihrukeu",
                                                    "score": 1,
                                                    "created_utc": 1658879995.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This ^^^^^^",
            "author": null,
            "id": "igyrljk",
            "parent_id": "t1_igyqekh",
            "score": 0,
            "created_utc": 1658350374.0,
            "replies": []
        },
        {
            "body": "Yup it’s a fun fantasy for sure",
            "author": "kobereuben88",
            "id": "igzfi51",
            "parent_id": "t1_igz6vyo",
            "score": 2,
            "created_utc": 1658361287.0,
            "replies": []
        },
        {
            "body": "This seems more like polyam than SB/SD.",
            "author": "ellielovey",
            "id": "igzuwef",
            "parent_id": "t1_igz5jgb",
            "score": 7,
            "created_utc": 1658368364.0,
            "replies": [
                {
                    "body": "They both started out as SBs.  I put one through nursing school and take the other to rodeos to compete, and I pay most of the bills involved.  I have also helped her with college.  They’re more SGFs than SBs at this point, with a pretty fair amount of Age Gap going on.  I hold on loosely because I know that nothing lasts forever, but I’m not giving either of them a reason to leave.\n\nSB 1 freestyled me, and a few months later SB1 introduced me to SB2; they’ve been friends since middle school.\n\nWe all said the L Word a few years ago.",
                    "author": "NVOkie9018",
                    "id": "ih04vj6",
                    "parent_id": "t1_igzuwef",
                    "score": 3,
                    "created_utc": 1658373060.0,
                    "replies": [
                        {
                            "body": "Can I ask what you do for work/money?",
                            "author": "ellielovey",
                            "id": "ih05sya",
                            "parent_id": "t1_ih04vj6",
                            "score": 2,
                            "created_utc": 1658373530.0,
                            "replies": [
                                {
                                    "body": "I’m retired military.  I did security contracting for a while after I retired, and now I teach people some of the things I used to do in the military and as a contractor.",
                                    "author": "NVOkie9018",
                                    "id": "ih0cus7",
                                    "parent_id": "t1_ih05sya",
                                    "score": 3,
                                    "created_utc": 1658377342.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You do understand how EXTREMELY F’ing rare your situation is, right? I’d think, maybe, 1 in 500 million type situation.  \n\nI mean, you have a wife who let’s you sleep with other women (plural) in your shared residence (not just sex but actual meaningful social interactions), live under the same roof, keep their pet at your house, be over ALL the time, give them money from your marital assets, AND she appears to have a relationship with them separate from you……\n\nDoes she involve herself in the sexual part or does she just sit quietly on the sidelines? Is she Netflix and chill while you are getting squishy with them in the boom boom smoosh room? Does SHE have relations outside your marriage? I find this very odd but, almost, like the greatest male fantasy in the world……living the dream!\n\nYou’re not Mormon are you? This isn’t some “Mormon Sisterhood” thing is it? It almost sounds like it!",
            "author": "Jahammy72",
            "id": "igzzhio",
            "parent_id": "t1_igz5jgb",
            "score": 6,
            "created_utc": 1658370471.0,
            "replies": [
                {
                    "body": "I don’t have sex with them in the house.  Neither one lives in the house, although SB2 lives a few yards away.  I should clarify; we have a detached garage with an apartment over it.  She’s not involved in the sexual part, although she has watched a few times.  She would be willing to do more but the SBs aren’t willing.  For years before this developed she had a cuckquean fantasy, and she intentionally put temptation in my path on multiple occasions.  I never went for it.  Eight years ago I found out that she had had two affairs years earlier, one with her boss in the first couple years of our marriage and the second one with a neighbor while I was in Afghanistan.  We came really close to a divorce.  If it wasn’t for the kids, I would have left.  Marriage counseling, a lot of honesty, working out anger, bitterness, and resentment.  We did relationship workshops and did a lot of reading.  ‘Passionate Marriage’ by David Schnarch and ‘Come as You Are’ by Emily Nagoski are both books I recommend.\n\nOur marriage obviously survived but changed.  Before, our relationship was pure vanilla.  I had been pretty kinky before our marriage but she was very religious when we met and I gave that up for her.  I brought kink into the bedroom.  I learned to be a Master in the BDSM sense.  We started going to Dungeons.  After a couple years of working on our relationship we decided to try swinging and swapping.  We started out very cautiously and talked constantly every step of the way.  We had to be extremely discreet because I was still on active duty in the military, and I could have been prosecuted for adultery.  We still swing and swap but not often.\n\nI think that on some level her acceptance of the SRs is penance on her part for the affairs she had, like she deserves to feel the angst.  I think that had a lot to do with her putting temptation in my path years earlier.\n\nShe has a current relationship with a guy from FetLife that I have met once, at the beginning of their relationship to lay down the ground rules.  TBH I’m not happy about it but I permit it.  He does things for her that I have a hard time doing.  I deal with it by not thinking about it, and she doesn’t tell me anything about it because I don’t want to know.\n\nIt isn’t all champagne and roses.",
                    "author": "NVOkie9018",
                    "id": "ih0c0t1",
                    "parent_id": "t1_igzzhio",
                    "score": 2,
                    "created_utc": 1658376860.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fuck that sounds amazing",
            "author": "kiwi_berry",
            "id": "igzm6rg",
            "parent_id": "t1_igz5jgb",
            "score": 2,
            "created_utc": 1658364412.0,
            "replies": []
        },
        {
            "body": "Are you and your wife in an open relationship?",
            "author": "NeighborhoodItchy943",
            "id": "igzc0vy",
            "parent_id": "t1_igz5jgb",
            "score": 1,
            "created_utc": 1658359632.0,
            "replies": [
                {
                    "body": "We’re ENM, yes.",
                    "author": "NVOkie9018",
                    "id": "igzfsme",
                    "parent_id": "t1_igzc0vy",
                    "score": 3,
                    "created_utc": 1658361426.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What did you expect when you made an arrangement with someone for a transaction? Sex for money. He got his sex. You got your money.",
            "author": "CrazyMadAlice",
            "id": "ih4n5pk",
            "parent_id": "t1_ih35cx5",
            "score": 3,
            "created_utc": 1658451451.0,
            "replies": [
                {
                    "body": "I know this :) thank you kindly for reminding me!\nI’m human, with emotions. \nShit happens!",
                    "author": "Tale-Itchy",
                    "id": "ih4n9e2",
                    "parent_id": "t1_ih4n5pk",
                    "score": 3,
                    "created_utc": 1658451500.0,
                    "replies": [
                        {
                            "body": "That having been said, it’s important to acknowledge he “thinks” about from time to time. It’s part of the human condition.",
                            "author": "luckysparkie",
                            "id": "iigjmlr",
                            "parent_id": "t1_ih4n9e2",
                            "score": 1,
                            "created_utc": 1659320460.0,
                            "replies": [
                                {
                                    "body": "I hear you.",
                                    "author": "Tale-Itchy",
                                    "id": "iigjq1a",
                                    "parent_id": "t1_iigjmlr",
                                    "score": 2,
                                    "created_utc": 1659320508.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ih3chgo",
            "parent_id": "t1_ih35cx5",
            "score": 2,
            "created_utc": 1658432295.0,
            "replies": [
                {
                    "body": "🤗 glad I could help.",
                    "author": "Tale-Itchy",
                    "id": "ih3db9r",
                    "parent_id": "t1_ih3chgo",
                    "score": 1,
                    "created_utc": 1658432603.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So you had to cheat on your wife to learn to put more effort in?",
            "author": "NeighborhoodItchy943",
            "id": "igzb9fp",
            "parent_id": "t1_igyv1v7",
            "score": 7,
            "created_utc": 1658359266.0,
            "replies": [
                {
                    "body": "You're making critical incorrect assumptions which I won't bother to correct.\n\nHowever to possibly help the OP and others... \n\nNo additional effort was made.\n\nIn my case I changed my mentality to focus on what I had in abundance rather than what we lacked.\n\nIt was the acknowledgment that it was unreasonable to expect a single other person to fulfill the many facets of my interests and desires.",
                    "author": "GlucoseGuardians",
                    "id": "igzwudp",
                    "parent_id": "t1_igzb9fp",
                    "score": 2,
                    "created_utc": 1658369237.0,
                    "replies": [
                        {
                            "body": "Wholeheartedly agree with this last statement",
                            "author": "kobereuben88",
                            "id": "ih2iyck",
                            "parent_id": "t1_igzwudp",
                            "score": 1,
                            "created_utc": 1658421268.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is really solid and insightful advice I think we could all take into consideration",
            "author": "kobereuben88",
            "id": "igzf9t5",
            "parent_id": "t1_igyv1v7",
            "score": 2,
            "created_utc": 1658361175.0,
            "replies": [
                {
                    "body": "Thank you.  Judging by the downvotes your view is not shared by most. 🤷‍♂️  Ultimately, I exist for the rare ones in life, not the majority.",
                    "author": "GlucoseGuardians",
                    "id": "ih2cr1p",
                    "parent_id": "t1_igzf9t5",
                    "score": 1,
                    "created_utc": 1658418974.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "igz11s2",
            "parent_id": "t1_igyv1v7",
            "score": 1,
            "created_utc": 1658354514.0,
            "replies": [
                {
                    "body": "💡  New business idea.   😁",
                    "author": "GlucoseGuardians",
                    "id": "ih2cvjq",
                    "parent_id": "t1_igz11s2",
                    "score": 2,
                    "created_utc": 1658419022.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is so depressing but true.",
            "author": "lifting12",
            "id": "igyr2na",
            "parent_id": "t1_igypxih",
            "score": 2,
            "created_utc": 1658350153.0,
            "replies": [
                {
                    "body": "How is that even depressing ?",
                    "author": "Splenda-Paris",
                    "id": "igyrktl",
                    "parent_id": "t1_igyr2na",
                    "score": 2,
                    "created_utc": 1658350365.0,
                    "replies": [
                        {
                            "body": "I mean number 3 is pretty depressing",
                            "author": "Quick_Chocolate_657",
                            "id": "igysxlj",
                            "parent_id": "t1_igyrktl",
                            "score": 3,
                            "created_utc": 1658350937.0,
                            "replies": [
                                {
                                    "body": "Will tell you a story about (3)\nIn Super man movie, \nShe loves the hero, then she wants to be with him all the time, so she convinces him to give up on being the hero.\nThe moment he gives up his hero role for her, she loses interest in him and the love fades away. \n\nThat’s from real life, I’ve discussed this part with many girls, every time I get the same answer.\n\nIt’s very arousing to girls, when they find a man on mission, (any type of mission) they love him for his dedication, then they test that dedication, the moment he gives up his mission for his girl, he lost her. \n\nThis is how the game ends.",
                                    "author": "NightMasterDom",
                                    "id": "igyv9jp",
                                    "parent_id": "t1_igysxlj",
                                    "score": -1,
                                    "created_utc": 1658351956.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Was really just talking about #3. Personally I don’t want a relationship and would prefer men be in a relationship but I know a lot of people don’t want that. So I think it’s sad for those looking for it. And the getting sloppy after time is depressing for everyone because people do get that way. Hard to keep things exciting sometimes. Lol.",
                            "author": "lifting12",
                            "id": "igys97l",
                            "parent_id": "t1_igyrktl",
                            "score": 2,
                            "created_utc": 1658350649.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I get that, but in Sugar, it's almost the same with single SDs. They don't want to get married and they have a big life outside of the sugar dates. The only difference, really, is when you start thinking about and/or imagining his life with his family.",
            "author": "matthewjphillips",
            "id": "igyxinr",
            "parent_id": "t1_igyi7h2",
            "score": 2,
            "created_utc": 1658352946.0,
            "replies": [
                {
                    "body": "The other difference is that no one is a cheating sack of garbage",
                    "author": "TreatMeLikeASlut8",
                    "id": "igz2b5d",
                    "parent_id": "t1_igyxinr",
                    "score": 4,
                    "created_utc": 1658355089.0,
                    "replies": [
                        {
                            "body": "I agree with you that cheating on your wife is uncool and unfair. I'm actually rather shocked at how prevalent it appears to be -- in and out of the Bowl.",
                            "author": "matthewjphillips",
                            "id": "igz9gz9",
                            "parent_id": "t1_igz2b5d",
                            "score": 2,
                            "created_utc": 1658358410.0,
                            "replies": [
                                {
                                    "body": "Yeah it’s kinda making me wanna give up on serious relationships. It’s like no one can be trusted",
                                    "author": "TreatMeLikeASlut8",
                                    "id": "igzxp5j",
                                    "parent_id": "t1_igz9gz9",
                                    "score": 3,
                                    "created_utc": 1658369639.0,
                                    "replies": [
                                        {
                                            "body": "Be careful about over-generalizing.\n\nJust become SOME can't be trusted; Heck, even if MOST can't be trusted; it doesn't mean NO ONE can be trusted.\n\nDon't live your life alone just because you're afraid to find someone who deserves your trust.",
                                            "author": "matthewjphillips",
                                            "id": "igzy2jd",
                                            "parent_id": "t1_igzxp5j",
                                            "score": 2,
                                            "created_utc": 1658369812.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah, I keep telling myself that.",
                                                    "author": "TreatMeLikeASlut8",
                                                    "id": "igzyysx",
                                                    "parent_id": "t1_igzy2jd",
                                                    "score": 2,
                                                    "created_utc": 1658370229.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "igz3m0j",
            "parent_id": "t1_igz27tx",
            "score": 1,
            "created_utc": 1658355680.0,
            "replies": [
                {
                    "body": "Yeah but that's not a two way street. He would not likely bother with you if you were ugly, old, fat, or nagging at him. Your relationship is transactional. At best, you could have the wife position which he clearly has pretty low respect for. Does he ever complain about her? Every kind word coming your way could be to her...but he doesn't nurture THAT relationship. Always attempt to see things as they are, not as you'd like them to be",
                    "author": "1-800-PizzaSlut",
                    "id": "igz491p",
                    "parent_id": "t1_igz3m0j",
                    "score": 9,
                    "created_utc": 1658355975.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Literally garbage! Folks, this is **not** a metaphor!!",
            "author": "Finzi",
            "id": "ih2atm2",
            "parent_id": "t1_ih21bi9",
            "score": 0,
            "created_utc": 1658418260.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ih2xnp4",
            "parent_id": "t1_ih2wj5a",
            "score": 3,
            "created_utc": 1658426714.0,
            "replies": [
                {
                    "body": "Not sleeping with a married man who has 2 kids is hardly being a saint. It’s standard not-shittyness. I almost feel bad for you.",
                    "author": "throwaway144811",
                    "id": "ih2xyu3",
                    "parent_id": "t1_ih2xnp4",
                    "score": 1,
                    "created_utc": 1658426830.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ih2y7ov",
                            "parent_id": "t1_ih2xyu3",
                            "score": 0,
                            "created_utc": 1658426924.0,
                            "replies": [
                                {
                                    "body": "Ew. \n\nP.S. I can almost guarantee that the married schmuck you’re seeing doesn’t care about you, at least not nearly as much as you think you care about him. Both of you are empty people. Where did it all go wrong? Don’t actually answer that. Bye now",
                                    "author": "throwaway144811",
                                    "id": "ih2zisn",
                                    "parent_id": "t1_ih2y7ov",
                                    "score": -2,
                                    "created_utc": 1658427421.0,
                                    "replies": [
                                        {
                                            "body": "I’m sorry you’re hurting but maybe you shouldn’t be in this subreddit if the fact that Married Sugar Dads exist, is triggering for you. \n\nPeople are going through enough, no need to be a jackass. 🫣",
                                            "author": "Tale-Itchy",
                                            "id": "ih3a0ex",
                                            "parent_id": "t1_ih2zisn",
                                            "score": 6,
                                            "created_utc": 1658431360.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ihgwnqn",
            "parent_id": "t1_ihgwe9x",
            "score": 2,
            "created_utc": 1658682557.0,
            "replies": [
                {
                    "body": "Yeah, I guess. You should be rethinking things. I’m all for sugar babies living their best life. However - you’re taking this a BIG step too far. You’re hurting a fellow woman and her innocent children by taking part in this relationship. Try working on some morals instead of having a pity party that you’re not the focus of a MARRIED man’s world. This post pained me just to read. 🤦‍♀️",
                    "author": "-kelsie",
                    "id": "ihgwyzw",
                    "parent_id": "t1_ihgwnqn",
                    "score": 1,
                    "created_utc": 1658682691.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Did you read til the end? This is a cautionary tale.",
            "author": "luckysparkie",
            "id": "iigjb9q",
            "parent_id": "t1_ihgwe9x",
            "score": 1,
            "created_utc": 1659320302.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ih0p0cg",
            "parent_id": "t1_igzxcqq",
            "score": 1,
            "created_utc": 1658385273.0,
            "replies": [
                {
                    "body": "I try. Please tell me how.",
                    "author": "18newbie44880011",
                    "id": "ih18c5c",
                    "parent_id": "t1_ih0p0cg",
                    "score": 0,
                    "created_utc": 1658400284.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ih2so9j",
                            "parent_id": "t1_ih18c5c",
                            "score": 2,
                            "created_utc": 1658424854.0,
                            "replies": [
                                {
                                    "body": "I do all of these. As matter of fact she's not one to text alot at night. Actually I see her most weeks 5 days a week. Not for play time only. A lot just to bring her a coffee and a muffin. \nHere comes the muffin man lol\nhttps://m.youtube.com/watch?v=fXFg5QsTcLQ",
                                    "author": "18newbie44880011",
                                    "id": "ih2v0wd",
                                    "parent_id": "t1_ih2so9j",
                                    "score": 2,
                                    "created_utc": 1658425732.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He’s also an asshole for cheating on his wife",
            "author": "TreatMeLikeASlut8",
            "id": "igz2how",
            "parent_id": "t1_igyr0ap",
            "score": 5,
            "created_utc": 1658355170.0,
            "replies": [
                {
                    "body": "And that, of course.",
                    "author": "sugardad123",
                    "id": "igz72se",
                    "parent_id": "t1_igz2how",
                    "score": 3,
                    "created_utc": 1658357287.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Totally messed up opsec.",
            "author": null,
            "id": "igz4ybw",
            "parent_id": "t1_igyr0ap",
            "score": 1,
            "created_utc": 1658356300.0,
            "replies": []
        },
        {
            "body": "Yes, he's wonderful",
            "author": "londonbebe",
            "id": "iorl8b5",
            "parent_id": "t1_ioqz2o1",
            "score": 2,
            "created_utc": 1663395312.0,
            "replies": []
        },
        {
            "body": "I have to remind myself this! These married guys are still cheating at the end of the day.. that makes him a dishonest person and all that jazz. That’s not someone who we would even want to fuck with.. yet, we are in our feelings over them.. \n\nHaving these types of rational, honest conversations with yourself, DEFINITELY brings you back down to earth!",
            "author": "Tale-Itchy",
            "id": "ih35zpx",
            "parent_id": "t1_igysowi",
            "score": 7,
            "created_utc": 1658429845.0,
            "replies": []
        },
        {
            "body": "I don't. I did when I was married though.",
            "author": "AShatteredKing",
            "id": "ih21gn9",
            "parent_id": "t1_igyracc",
            "score": 1,
            "created_utc": 1658414677.0,
            "replies": []
        },
        {
            "body": "I mean what OPs describing sounds pretty normal. Hanging out with your husband, being with each other without a time limit. That’s just part of living together 🤷🏾‍♀️. She could find easily find that, and he prob won’t be cheating on her. Now that’s if she goes to vanilla eating at some point, that type of thing with a SD would be really hard to find yeah",
            "author": "Quick_Chocolate_657",
            "id": "igz5bbo",
            "parent_id": "t1_igyvla4",
            "score": 6,
            "created_utc": 1658356466.0,
            "replies": [
                {
                    "body": "Yeah you can’t really remove the money part.",
                    "author": "sugarthrowaway407",
                    "id": "igz7pn7",
                    "parent_id": "t1_igz5bbo",
                    "score": 3,
                    "created_utc": 1658357582.0,
                    "replies": [
                        {
                            "body": "I assume at some point she’ll get out of the bowl. Most ppl don’t do it forever right?",
                            "author": "Quick_Chocolate_657",
                            "id": "igza4ri",
                            "parent_id": "t1_igz7pn7",
                            "score": 1,
                            "created_utc": 1658358729.0,
                            "replies": [
                                {
                                    "body": "An ex sugar baby can be a red flag for most. It’s even worse if she doesn’t admit it and it’s found out later in the relationship.",
                                    "author": "sugarthrowaway407",
                                    "id": "igzjqx6",
                                    "parent_id": "t1_igza4ri",
                                    "score": 2,
                                    "created_utc": 1658363276.0,
                                    "replies": [
                                        {
                                            "body": "I mean sure, but there are some guys who wouldn’t care. She realistically can’t sugar her whole life.",
                                            "author": "Quick_Chocolate_657",
                                            "id": "igztpja",
                                            "parent_id": "t1_igzjqx6",
                                            "score": 3,
                                            "created_utc": 1658367827.0,
                                            "replies": [
                                                {
                                                    "body": "“Some guys”… yeah I also can quadruple my money at the casino tonight. Relying on hope is a bad strategy especially when you’re talking about your life outcomes",
                                                    "author": "sugarthrowaway407",
                                                    "id": "igzyp75",
                                                    "parent_id": "t1_igztpja",
                                                    "score": -3,
                                                    "created_utc": 1658370103.0,
                                                    "replies": [
                                                        {
                                                            "body": "There are a lot of guys who would date a former SB. Men date strippers don’t they? People are different, but there are plenty of men who wouldn’t mind. Literally what other choice would she have? She’s gonna be sugaring at 60?",
                                                            "author": "Quick_Chocolate_657",
                                                            "id": "ih03cgd",
                                                            "parent_id": "t1_igzyp75",
                                                            "score": 3,
                                                            "created_utc": 1658372307.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not true, it is not impossible or that that hard to find high quality and value providing man if you work on yourself and have high standards. The goal is to pick the one who sees you as a dream girl.",
            "author": "idontlikespiderplant",
            "id": "ih1a8sy",
            "parent_id": "t1_igyvla4",
            "score": 4,
            "created_utc": 1658401569.0,
            "replies": [
                {
                    "body": "I think you missed the mark on a lot of things. “Not impossible” will lead you to disappointment. The caliber of men you’re looking at aren’t chasing their dream girl, they chase their goals.\nAlso looking at your profile it looks like you’re eluding that being an escort does not hurt your chances of finding a provider high quality man which is madness.",
                    "author": "sugarthrowaway407",
                    "id": "ih1magy",
                    "parent_id": "t1_ih1a8sy",
                    "score": 0,
                    "created_utc": 1658408218.0,
                    "replies": [
                        {
                            "body": "You are wrong in many points of your comment but that is your opinion and experience. Mine is different. And yes, they must chase career but believe me, once you are a dreamgirl to one of them you will experience some real special treatment. But the fact that you are their dream girl does not mean they are what you want. And yeah, they do not give a damn about escorting. Maybe do your research how many wives of high earning men were escorts, and how many of them actually met at work. Of course it wont be written explicitly. It is like the movie breakfast at tiffanys which is about escort, and so many people do not get it lol :D. But yeah, the reason why I say not impossible is because for some it will be easier then for others. I do not know how the girls looks like, how are their manners, intelligence, social skills etc. If you are model material with rubbish personality your chances are low.",
                            "author": "idontlikespiderplant",
                            "id": "ihbl534",
                            "parent_id": "t1_ih1magy",
                            "score": 2,
                            "created_utc": 1658583787.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "And you are married to such a man now right?",
                    "author": "AShatteredKing",
                    "id": "ih21t0o",
                    "parent_id": "t1_ih1a8sy",
                    "score": 1,
                    "created_utc": 1658414811.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why wouldn't she find a husband like that?",
            "author": "WiseRequirement9277",
            "id": "igzbp40",
            "parent_id": "t1_igyvla4",
            "score": 3,
            "created_utc": 1658359475.0,
            "replies": [
                {
                    "body": "I would argue OP has found a husband like that…just someone else’s.",
                    "author": null,
                    "id": "igzpi2z",
                    "parent_id": "t1_igzbp40",
                    "score": 7,
                    "created_utc": 1658365926.0,
                    "replies": []
                },
                {
                    "body": "Men making sugar daddy money aren’t making ex sugar babies their wife. If they’re extremely attractive disregard everything I just said.",
                    "author": "sugarthrowaway407",
                    "id": "igzjyhx",
                    "parent_id": "t1_igzbp40",
                    "score": 2,
                    "created_utc": 1658363373.0,
                    "replies": [
                        {
                            "body": "So they do 😄",
                            "author": "WiseRequirement9277",
                            "id": "igzl0yu",
                            "parent_id": "t1_igzjyhx",
                            "score": 3,
                            "created_utc": 1658363874.0,
                            "replies": [
                                {
                                    "body": "Extremely attractive means women who have successfully modeled or who’ve been offered modeling additions…",
                                    "author": "sugarthrowaway407",
                                    "id": "igzpk9i",
                                    "parent_id": "t1_igzl0yu",
                                    "score": -2,
                                    "created_utc": 1658365953.0,
                                    "replies": [
                                        {
                                            "body": "So it happens 😄",
                                            "author": "WiseRequirement9277",
                                            "id": "ih0rqou",
                                            "parent_id": "t1_igzpk9i",
                                            "score": 3,
                                            "created_utc": 1658387307.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Maybe but let’s be careful not to portray her as a “victim” of it….she went in with both eyes wide open.",
            "author": "Jahammy72",
            "id": "igzwfnx",
            "parent_id": "t1_igyvla4",
            "score": 2,
            "created_utc": 1658369049.0,
            "replies": []
        },
        {
            "body": "Awe. An incel got triggered. Thoughts and prayers loser.",
            "author": "TastySpermDispenser",
            "id": "ih2syc3",
            "parent_id": "t1_ih2s0ld",
            "score": 5,
            "created_utc": 1658424959.0,
            "replies": [
                {
                    "body": "Why is a person who is opposed to adultery an \"incel\"?",
                    "author": "NITAREEDDESIGNS",
                    "id": "ih3xkwq",
                    "parent_id": "t1_ih2syc3",
                    "score": 0,
                    "created_utc": 1658440346.0,
                    "replies": [
                        {
                            "body": "For the same reason I can watch a parent eat a greasy hamburger with their young fat child while talking about santa and still love and respect them both.\n#\nMy comment relates more to his comment history. Mommy and daddy clearly taught him that he gets to own someone as soon as he persuades them to marriage, no matter what what garbage person he becomes.\n#\nBe mad at adultry all you want; it's still two human beings, neither one harming anyone, and certainly not the adult who definitely didnt break any promises.  I dont know you, but I guarantee multiple times in life you have participated in breaking contracts, and I still love you bro.",
                            "author": "TastySpermDispenser",
                            "id": "ih45i7b",
                            "parent_id": "t1_ih3xkwq",
                            "score": 3,
                            "created_utc": 1658443589.0,
                            "replies": [
                                {
                                    "body": ">I dont know you, but I guarantee multiple times in life you have participated in breaking contracts\n\nYou don't know me and yet you presume to \"guarantee\" something about me?\n\n&#x200B;\n\n>Be mad at adultry all you want; it's still two human beings, neither one harming anyone,\n\nOh yes...both \"human beings\" are, indeed, harming people and not just any SOs involved.\n\n>I still love you bro.\n\nIf I had a $ for every time a Redditor thought I was a dude...",
                                    "author": "NITAREEDDESIGNS",
                                    "id": "ih46ive",
                                    "parent_id": "t1_ih45i7b",
                                    "score": -1,
                                    "created_utc": 1658444020.0,
                                    "replies": [
                                        {
                                            "body": "Yep! All adult humans break contracts sometimes.  You have too.  Do you think you have never exceeded the speed limit? Brought something into a movie theater? Accidentally left something off a customer's order at your retail job?  X doubt.\n#\nAbstract concepts are not harm dude.\n#\nDont really care what your gender is homie.  Go to IG if it's such a big deal to you.",
                                            "author": "TastySpermDispenser",
                                            "id": "ih47jpl",
                                            "parent_id": "t1_ih46ive",
                                            "score": 1,
                                            "created_utc": 1658444449.0,
                                            "replies": [
                                                {
                                                    "body": "LOL\n\nThe \"speed limit\" is not a \"contract\".\n\nTaking something into a movie theater is not a \"contract\".\n\nAccidentally leaving something off a customer's order is not a \"contract\".\n\nBreaking trust...breaking homes are not \"abstract concepts\".  What a load of crap...\n\nCalling a woman a man is offensive...deflect all you want, but that is a fact.",
                                                    "author": "NITAREEDDESIGNS",
                                                    "id": "ih49kwj",
                                                    "parent_id": "t1_ih47jpl",
                                                    "score": -1,
                                                    "created_utc": 1658445324.0,
                                                    "replies": [
                                                        {
                                                            "body": "Your insurance contract literally requires you to drive the speed limit.\n#\nYour movie ticket contract literally prohibits outside food and drink.\n#\nBreaking trust? Lol. Do you believe everything you read and see? You must have a lot of broken trust with all this advertising, and yet, you struggle on! You're a punch line!",
                                                            "author": "TastySpermDispenser",
                                                            "id": "ih4a941",
                                                            "parent_id": "t1_ih49kwj",
                                                            "score": 2,
                                                            "created_utc": 1658445617.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wrong subreddit. \nWhy are you even on one like this if you’re just going to be like that, lol. \nThe amount of married SDs out there may shock you.",
            "author": "Tale-Itchy",
            "id": "ih37fpa",
            "parent_id": "t1_ih2s0ld",
            "score": 2,
            "created_utc": 1658430388.0,
            "replies": []
        },
        {
            "body": "I’ll bet my SBs allowance on this…😁",
            "author": "quietgrey1",
            "id": "ih2p1y7",
            "parent_id": "t1_igyvoa1",
            "score": 7,
            "created_utc": 1658423518.0,
            "replies": []
        },
        {
            "body": "They are absolute rubbish and if I would get again into situation as I did in past of wife calling me, I would AGAIN be on the wife side. Remember it as yesterday how she has to make her mind what she wants, and if it is divorce, she must act smart and quiet. The movie \"the other woman\" feels very familiar to me and minus the fun part it is not that farfetched.",
            "author": "idontlikespiderplant",
            "id": "ihbkdwy",
            "parent_id": "t1_ih37oy1",
            "score": 2,
            "created_utc": 1658583404.0,
            "replies": []
        },
        {
            "body": "Well men get lazy , they walk around dirty, smelly, farts, act like imbecils and women are expected to see them as their personal sex symbol. Also let's face the reality, women do not switch or turn for no reason. It is the constant disappointment in your partner that kills all sexual drive, love, care and interest. That is something men do not understand. At some point we give up trying. I personally would never want a man to live with. Men and kids are same, fun when you do not have them all the time and do not have to take care of them.",
            "author": "idontlikespiderplant",
            "id": "ihbk3fr",
            "parent_id": "t1_ih790f2",
            "score": 2,
            "created_utc": 1658583256.0,
            "replies": [
                {
                    "body": "Tl;Dr version: Women love accessories until they’re stuck with them.",
                    "author": "luckysparkie",
                    "id": "iigjuza",
                    "parent_id": "t1_ihbk3fr",
                    "score": 1,
                    "created_utc": 1659320577.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s always on the edge of a guys mind. If he works a lot (like I do), his mind sometimes goes to dark places. It’s messed up but it happens",
            "author": "luckysparkie",
            "id": "iigk9k9",
            "parent_id": "t1_ih1gvew",
            "score": 1,
            "created_utc": 1659320785.0,
            "replies": []
        },
        {
            "body": "I think he meant POT SB.",
            "author": "NVOkie9018",
            "id": "igz5nlr",
            "parent_id": "t1_igyx5sn",
            "score": 1,
            "created_utc": 1658356624.0,
            "replies": [
                {
                    "body": "Indeed, it was a typo.",
                    "author": "dallas-explorer",
                    "id": "igzdyme",
                    "parent_id": "t1_igz5nlr",
                    "score": 1,
                    "created_utc": 1658360557.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Same as the dude who owns playboy magazine. Those blonde fake boobs love the comfort, status and material shit you can provide. \n\nTry to ask them absolutely willingly to become your concubine and all bear kids for you, like How Stanley Ho organised his four wives in the open air. \n\nSometimes people live in a delusional life. There aren’t many alpha males who can truly enjoy more than one woman. There aren’t many men who can truly satisfy two women financially, sexually and emotionally. \n\nMoney can buy men lots of sex and a moment of masculinity, but it can’t buy you loyalty, respect and a lifelong devotion.",
            "author": null,
            "id": "igzzgd7",
            "parent_id": "t1_igz0izc",
            "score": 0,
            "created_utc": 1658370456.0,
            "replies": [
                {
                    "body": ">Stanley Ho\n\nThanks. Had not heard of Stanley Ho before.\n\nhttps://asiatimes.com/2018/01/real-reasons-behind-hong-kongs-love-polygamous-tycoons/",
                    "author": "LuckyINTJ",
                    "id": "ih6zu46",
                    "parent_id": "t1_igzzgd7",
                    "score": 1,
                    "created_utc": 1658500498.0,
                    "replies": [
                        {
                            "body": "I don’t think polygamy or polyamory are wrong. \nI generally believe as long as there is no cheating, any human relationships are legitimate. \n\nThere is no such a term “ openly cheating “ .. you are either scared and cheat secretly behind your wife or you openly enjoy your lover with your wife’s agreement. \n\nMaybe there are men in this world women are willingly to share for the rest of their life. \n\nWillingly is always a key word. In many religious or historical contexts, a man owns multi women because of gender inequality. For example, women can’t inherit land or properties. And many women were forced to share a man. \n\nBut if they are not forced and everyone knows exactly what’s going on, you will have the empire Stanley Ho created. \n\nIn reality, it’s extremely hard work to have more than one women (this different from group sex you are talking about ) .. Stanley created a big family with his four women , each left him offsprings and they are all properly recorded in the family tree.",
                            "author": null,
                            "id": "ihb6oo9",
                            "parent_id": "t1_ih6zu46",
                            "score": 1,
                            "created_utc": 1658575313.0,
                            "replies": [
                                {
                                    "body": ">There is no such a term “ openly cheating “ .. you are either scared and cheat secretly behind your wife or you openly enjoy your lover with your wife’s agreement\n\nI am widowed and not have a wife. I have four sugar babies.  They all know about each other and are friends.",
                                    "author": "LuckyINTJ",
                                    "id": "ihrukeu",
                                    "parent_id": "t1_ihb6oo9",
                                    "score": 1,
                                    "created_utc": 1658873039.0,
                                    "replies": [
                                        {
                                            "body": "I don’t know what you are trying to tell me. \nAgain you are just like the guy who own playboy magazine with all the blonde chicks living in the same house with him. They stay around for comfort, job career, fame and status. They don’t truly love him or devote their life to the old white guy.",
                                            "author": null,
                                            "id": "ihsamee",
                                            "parent_id": "t1_ihrukeu",
                                            "score": 1,
                                            "created_utc": 1658879995.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "They both started out as SBs.  I put one through nursing school and take the other to rodeos to compete, and I pay most of the bills involved.  I have also helped her with college.  They’re more SGFs than SBs at this point, with a pretty fair amount of Age Gap going on.  I hold on loosely because I know that nothing lasts forever, but I’m not giving either of them a reason to leave.\n\nSB 1 freestyled me, and a few months later SB1 introduced me to SB2; they’ve been friends since middle school.\n\nWe all said the L Word a few years ago.",
            "author": "NVOkie9018",
            "id": "ih04vj6",
            "parent_id": "t1_igzuwef",
            "score": 3,
            "created_utc": 1658373060.0,
            "replies": [
                {
                    "body": "Can I ask what you do for work/money?",
                    "author": "ellielovey",
                    "id": "ih05sya",
                    "parent_id": "t1_ih04vj6",
                    "score": 2,
                    "created_utc": 1658373530.0,
                    "replies": [
                        {
                            "body": "I’m retired military.  I did security contracting for a while after I retired, and now I teach people some of the things I used to do in the military and as a contractor.",
                            "author": "NVOkie9018",
                            "id": "ih0cus7",
                            "parent_id": "t1_ih05sya",
                            "score": 3,
                            "created_utc": 1658377342.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t have sex with them in the house.  Neither one lives in the house, although SB2 lives a few yards away.  I should clarify; we have a detached garage with an apartment over it.  She’s not involved in the sexual part, although she has watched a few times.  She would be willing to do more but the SBs aren’t willing.  For years before this developed she had a cuckquean fantasy, and she intentionally put temptation in my path on multiple occasions.  I never went for it.  Eight years ago I found out that she had had two affairs years earlier, one with her boss in the first couple years of our marriage and the second one with a neighbor while I was in Afghanistan.  We came really close to a divorce.  If it wasn’t for the kids, I would have left.  Marriage counseling, a lot of honesty, working out anger, bitterness, and resentment.  We did relationship workshops and did a lot of reading.  ‘Passionate Marriage’ by David Schnarch and ‘Come as You Are’ by Emily Nagoski are both books I recommend.\n\nOur marriage obviously survived but changed.  Before, our relationship was pure vanilla.  I had been pretty kinky before our marriage but she was very religious when we met and I gave that up for her.  I brought kink into the bedroom.  I learned to be a Master in the BDSM sense.  We started going to Dungeons.  After a couple years of working on our relationship we decided to try swinging and swapping.  We started out very cautiously and talked constantly every step of the way.  We had to be extremely discreet because I was still on active duty in the military, and I could have been prosecuted for adultery.  We still swing and swap but not often.\n\nI think that on some level her acceptance of the SRs is penance on her part for the affairs she had, like she deserves to feel the angst.  I think that had a lot to do with her putting temptation in my path years earlier.\n\nShe has a current relationship with a guy from FetLife that I have met once, at the beginning of their relationship to lay down the ground rules.  TBH I’m not happy about it but I permit it.  He does things for her that I have a hard time doing.  I deal with it by not thinking about it, and she doesn’t tell me anything about it because I don’t want to know.\n\nIt isn’t all champagne and roses.",
            "author": "NVOkie9018",
            "id": "ih0c0t1",
            "parent_id": "t1_igzzhio",
            "score": 2,
            "created_utc": 1658376860.0,
            "replies": []
        },
        {
            "body": "We’re ENM, yes.",
            "author": "NVOkie9018",
            "id": "igzfsme",
            "parent_id": "t1_igzc0vy",
            "score": 3,
            "created_utc": 1658361426.0,
            "replies": []
        },
        {
            "body": "I know this :) thank you kindly for reminding me!\nI’m human, with emotions. \nShit happens!",
            "author": "Tale-Itchy",
            "id": "ih4n9e2",
            "parent_id": "t1_ih4n5pk",
            "score": 3,
            "created_utc": 1658451500.0,
            "replies": [
                {
                    "body": "That having been said, it’s important to acknowledge he “thinks” about from time to time. It’s part of the human condition.",
                    "author": "luckysparkie",
                    "id": "iigjmlr",
                    "parent_id": "t1_ih4n9e2",
                    "score": 1,
                    "created_utc": 1659320460.0,
                    "replies": [
                        {
                            "body": "I hear you.",
                            "author": "Tale-Itchy",
                            "id": "iigjq1a",
                            "parent_id": "t1_iigjmlr",
                            "score": 2,
                            "created_utc": 1659320508.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "🤗 glad I could help.",
            "author": "Tale-Itchy",
            "id": "ih3db9r",
            "parent_id": "t1_ih3chgo",
            "score": 1,
            "created_utc": 1658432603.0,
            "replies": []
        },
        {
            "body": "You're making critical incorrect assumptions which I won't bother to correct.\n\nHowever to possibly help the OP and others... \n\nNo additional effort was made.\n\nIn my case I changed my mentality to focus on what I had in abundance rather than what we lacked.\n\nIt was the acknowledgment that it was unreasonable to expect a single other person to fulfill the many facets of my interests and desires.",
            "author": "GlucoseGuardians",
            "id": "igzwudp",
            "parent_id": "t1_igzb9fp",
            "score": 2,
            "created_utc": 1658369237.0,
            "replies": [
                {
                    "body": "Wholeheartedly agree with this last statement",
                    "author": "kobereuben88",
                    "id": "ih2iyck",
                    "parent_id": "t1_igzwudp",
                    "score": 1,
                    "created_utc": 1658421268.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you.  Judging by the downvotes your view is not shared by most. 🤷‍♂️  Ultimately, I exist for the rare ones in life, not the majority.",
            "author": "GlucoseGuardians",
            "id": "ih2cr1p",
            "parent_id": "t1_igzf9t5",
            "score": 1,
            "created_utc": 1658418974.0,
            "replies": []
        },
        {
            "body": "💡  New business idea.   😁",
            "author": "GlucoseGuardians",
            "id": "ih2cvjq",
            "parent_id": "t1_igz11s2",
            "score": 2,
            "created_utc": 1658419022.0,
            "replies": []
        },
        {
            "body": "How is that even depressing ?",
            "author": "Splenda-Paris",
            "id": "igyrktl",
            "parent_id": "t1_igyr2na",
            "score": 2,
            "created_utc": 1658350365.0,
            "replies": [
                {
                    "body": "I mean number 3 is pretty depressing",
                    "author": "Quick_Chocolate_657",
                    "id": "igysxlj",
                    "parent_id": "t1_igyrktl",
                    "score": 3,
                    "created_utc": 1658350937.0,
                    "replies": [
                        {
                            "body": "Will tell you a story about (3)\nIn Super man movie, \nShe loves the hero, then she wants to be with him all the time, so she convinces him to give up on being the hero.\nThe moment he gives up his hero role for her, she loses interest in him and the love fades away. \n\nThat’s from real life, I’ve discussed this part with many girls, every time I get the same answer.\n\nIt’s very arousing to girls, when they find a man on mission, (any type of mission) they love him for his dedication, then they test that dedication, the moment he gives up his mission for his girl, he lost her. \n\nThis is how the game ends.",
                            "author": "NightMasterDom",
                            "id": "igyv9jp",
                            "parent_id": "t1_igysxlj",
                            "score": -1,
                            "created_utc": 1658351956.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Was really just talking about #3. Personally I don’t want a relationship and would prefer men be in a relationship but I know a lot of people don’t want that. So I think it’s sad for those looking for it. And the getting sloppy after time is depressing for everyone because people do get that way. Hard to keep things exciting sometimes. Lol.",
                    "author": "lifting12",
                    "id": "igys97l",
                    "parent_id": "t1_igyrktl",
                    "score": 2,
                    "created_utc": 1658350649.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The other difference is that no one is a cheating sack of garbage",
            "author": "TreatMeLikeASlut8",
            "id": "igz2b5d",
            "parent_id": "t1_igyxinr",
            "score": 4,
            "created_utc": 1658355089.0,
            "replies": [
                {
                    "body": "I agree with you that cheating on your wife is uncool and unfair. I'm actually rather shocked at how prevalent it appears to be -- in and out of the Bowl.",
                    "author": "matthewjphillips",
                    "id": "igz9gz9",
                    "parent_id": "t1_igz2b5d",
                    "score": 2,
                    "created_utc": 1658358410.0,
                    "replies": [
                        {
                            "body": "Yeah it’s kinda making me wanna give up on serious relationships. It’s like no one can be trusted",
                            "author": "TreatMeLikeASlut8",
                            "id": "igzxp5j",
                            "parent_id": "t1_igz9gz9",
                            "score": 3,
                            "created_utc": 1658369639.0,
                            "replies": [
                                {
                                    "body": "Be careful about over-generalizing.\n\nJust become SOME can't be trusted; Heck, even if MOST can't be trusted; it doesn't mean NO ONE can be trusted.\n\nDon't live your life alone just because you're afraid to find someone who deserves your trust.",
                                    "author": "matthewjphillips",
                                    "id": "igzy2jd",
                                    "parent_id": "t1_igzxp5j",
                                    "score": 2,
                                    "created_utc": 1658369812.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, I keep telling myself that.",
                                            "author": "TreatMeLikeASlut8",
                                            "id": "igzyysx",
                                            "parent_id": "t1_igzy2jd",
                                            "score": 2,
                                            "created_utc": 1658370229.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah but that's not a two way street. He would not likely bother with you if you were ugly, old, fat, or nagging at him. Your relationship is transactional. At best, you could have the wife position which he clearly has pretty low respect for. Does he ever complain about her? Every kind word coming your way could be to her...but he doesn't nurture THAT relationship. Always attempt to see things as they are, not as you'd like them to be",
            "author": "1-800-PizzaSlut",
            "id": "igz491p",
            "parent_id": "t1_igz3m0j",
            "score": 9,
            "created_utc": 1658355975.0,
            "replies": []
        },
        {
            "body": "Not sleeping with a married man who has 2 kids is hardly being a saint. It’s standard not-shittyness. I almost feel bad for you.",
            "author": "throwaway144811",
            "id": "ih2xyu3",
            "parent_id": "t1_ih2xnp4",
            "score": 1,
            "created_utc": 1658426830.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ih2y7ov",
                    "parent_id": "t1_ih2xyu3",
                    "score": 0,
                    "created_utc": 1658426924.0,
                    "replies": [
                        {
                            "body": "Ew. \n\nP.S. I can almost guarantee that the married schmuck you’re seeing doesn’t care about you, at least not nearly as much as you think you care about him. Both of you are empty people. Where did it all go wrong? Don’t actually answer that. Bye now",
                            "author": "throwaway144811",
                            "id": "ih2zisn",
                            "parent_id": "t1_ih2y7ov",
                            "score": -2,
                            "created_utc": 1658427421.0,
                            "replies": [
                                {
                                    "body": "I’m sorry you’re hurting but maybe you shouldn’t be in this subreddit if the fact that Married Sugar Dads exist, is triggering for you. \n\nPeople are going through enough, no need to be a jackass. 🫣",
                                    "author": "Tale-Itchy",
                                    "id": "ih3a0ex",
                                    "parent_id": "t1_ih2zisn",
                                    "score": 6,
                                    "created_utc": 1658431360.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, I guess. You should be rethinking things. I’m all for sugar babies living their best life. However - you’re taking this a BIG step too far. You’re hurting a fellow woman and her innocent children by taking part in this relationship. Try working on some morals instead of having a pity party that you’re not the focus of a MARRIED man’s world. This post pained me just to read. 🤦‍♀️",
            "author": "-kelsie",
            "id": "ihgwyzw",
            "parent_id": "t1_ihgwnqn",
            "score": 1,
            "created_utc": 1658682691.0,
            "replies": []
        },
        {
            "body": "I try. Please tell me how.",
            "author": "18newbie44880011",
            "id": "ih18c5c",
            "parent_id": "t1_ih0p0cg",
            "score": 0,
            "created_utc": 1658400284.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ih2so9j",
                    "parent_id": "t1_ih18c5c",
                    "score": 2,
                    "created_utc": 1658424854.0,
                    "replies": [
                        {
                            "body": "I do all of these. As matter of fact she's not one to text alot at night. Actually I see her most weeks 5 days a week. Not for play time only. A lot just to bring her a coffee and a muffin. \nHere comes the muffin man lol\nhttps://m.youtube.com/watch?v=fXFg5QsTcLQ",
                            "author": "18newbie44880011",
                            "id": "ih2v0wd",
                            "parent_id": "t1_ih2so9j",
                            "score": 2,
                            "created_utc": 1658425732.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And that, of course.",
            "author": "sugardad123",
            "id": "igz72se",
            "parent_id": "t1_igz2how",
            "score": 3,
            "created_utc": 1658357287.0,
            "replies": []
        },
        {
            "body": "Yeah you can’t really remove the money part.",
            "author": "sugarthrowaway407",
            "id": "igz7pn7",
            "parent_id": "t1_igz5bbo",
            "score": 3,
            "created_utc": 1658357582.0,
            "replies": [
                {
                    "body": "I assume at some point she’ll get out of the bowl. Most ppl don’t do it forever right?",
                    "author": "Quick_Chocolate_657",
                    "id": "igza4ri",
                    "parent_id": "t1_igz7pn7",
                    "score": 1,
                    "created_utc": 1658358729.0,
                    "replies": [
                        {
                            "body": "An ex sugar baby can be a red flag for most. It’s even worse if she doesn’t admit it and it’s found out later in the relationship.",
                            "author": "sugarthrowaway407",
                            "id": "igzjqx6",
                            "parent_id": "t1_igza4ri",
                            "score": 2,
                            "created_utc": 1658363276.0,
                            "replies": [
                                {
                                    "body": "I mean sure, but there are some guys who wouldn’t care. She realistically can’t sugar her whole life.",
                                    "author": "Quick_Chocolate_657",
                                    "id": "igztpja",
                                    "parent_id": "t1_igzjqx6",
                                    "score": 3,
                                    "created_utc": 1658367827.0,
                                    "replies": [
                                        {
                                            "body": "“Some guys”… yeah I also can quadruple my money at the casino tonight. Relying on hope is a bad strategy especially when you’re talking about your life outcomes",
                                            "author": "sugarthrowaway407",
                                            "id": "igzyp75",
                                            "parent_id": "t1_igztpja",
                                            "score": -3,
                                            "created_utc": 1658370103.0,
                                            "replies": [
                                                {
                                                    "body": "There are a lot of guys who would date a former SB. Men date strippers don’t they? People are different, but there are plenty of men who wouldn’t mind. Literally what other choice would she have? She’s gonna be sugaring at 60?",
                                                    "author": "Quick_Chocolate_657",
                                                    "id": "ih03cgd",
                                                    "parent_id": "t1_igzyp75",
                                                    "score": 3,
                                                    "created_utc": 1658372307.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think you missed the mark on a lot of things. “Not impossible” will lead you to disappointment. The caliber of men you’re looking at aren’t chasing their dream girl, they chase their goals.\nAlso looking at your profile it looks like you’re eluding that being an escort does not hurt your chances of finding a provider high quality man which is madness.",
            "author": "sugarthrowaway407",
            "id": "ih1magy",
            "parent_id": "t1_ih1a8sy",
            "score": 0,
            "created_utc": 1658408218.0,
            "replies": [
                {
                    "body": "You are wrong in many points of your comment but that is your opinion and experience. Mine is different. And yes, they must chase career but believe me, once you are a dreamgirl to one of them you will experience some real special treatment. But the fact that you are their dream girl does not mean they are what you want. And yeah, they do not give a damn about escorting. Maybe do your research how many wives of high earning men were escorts, and how many of them actually met at work. Of course it wont be written explicitly. It is like the movie breakfast at tiffanys which is about escort, and so many people do not get it lol :D. But yeah, the reason why I say not impossible is because for some it will be easier then for others. I do not know how the girls looks like, how are their manners, intelligence, social skills etc. If you are model material with rubbish personality your chances are low.",
                    "author": "idontlikespiderplant",
                    "id": "ihbl534",
                    "parent_id": "t1_ih1magy",
                    "score": 2,
                    "created_utc": 1658583787.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And you are married to such a man now right?",
            "author": "AShatteredKing",
            "id": "ih21t0o",
            "parent_id": "t1_ih1a8sy",
            "score": 1,
            "created_utc": 1658414811.0,
            "replies": []
        },
        {
            "body": "I would argue OP has found a husband like that…just someone else’s.",
            "author": null,
            "id": "igzpi2z",
            "parent_id": "t1_igzbp40",
            "score": 7,
            "created_utc": 1658365926.0,
            "replies": []
        },
        {
            "body": "Men making sugar daddy money aren’t making ex sugar babies their wife. If they’re extremely attractive disregard everything I just said.",
            "author": "sugarthrowaway407",
            "id": "igzjyhx",
            "parent_id": "t1_igzbp40",
            "score": 2,
            "created_utc": 1658363373.0,
            "replies": [
                {
                    "body": "So they do 😄",
                    "author": "WiseRequirement9277",
                    "id": "igzl0yu",
                    "parent_id": "t1_igzjyhx",
                    "score": 3,
                    "created_utc": 1658363874.0,
                    "replies": [
                        {
                            "body": "Extremely attractive means women who have successfully modeled or who’ve been offered modeling additions…",
                            "author": "sugarthrowaway407",
                            "id": "igzpk9i",
                            "parent_id": "t1_igzl0yu",
                            "score": -2,
                            "created_utc": 1658365953.0,
                            "replies": [
                                {
                                    "body": "So it happens 😄",
                                    "author": "WiseRequirement9277",
                                    "id": "ih0rqou",
                                    "parent_id": "t1_igzpk9i",
                                    "score": 3,
                                    "created_utc": 1658387307.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why is a person who is opposed to adultery an \"incel\"?",
            "author": "NITAREEDDESIGNS",
            "id": "ih3xkwq",
            "parent_id": "t1_ih2syc3",
            "score": 0,
            "created_utc": 1658440346.0,
            "replies": [
                {
                    "body": "For the same reason I can watch a parent eat a greasy hamburger with their young fat child while talking about santa and still love and respect them both.\n#\nMy comment relates more to his comment history. Mommy and daddy clearly taught him that he gets to own someone as soon as he persuades them to marriage, no matter what what garbage person he becomes.\n#\nBe mad at adultry all you want; it's still two human beings, neither one harming anyone, and certainly not the adult who definitely didnt break any promises.  I dont know you, but I guarantee multiple times in life you have participated in breaking contracts, and I still love you bro.",
                    "author": "TastySpermDispenser",
                    "id": "ih45i7b",
                    "parent_id": "t1_ih3xkwq",
                    "score": 3,
                    "created_utc": 1658443589.0,
                    "replies": [
                        {
                            "body": ">I dont know you, but I guarantee multiple times in life you have participated in breaking contracts\n\nYou don't know me and yet you presume to \"guarantee\" something about me?\n\n&#x200B;\n\n>Be mad at adultry all you want; it's still two human beings, neither one harming anyone,\n\nOh yes...both \"human beings\" are, indeed, harming people and not just any SOs involved.\n\n>I still love you bro.\n\nIf I had a $ for every time a Redditor thought I was a dude...",
                            "author": "NITAREEDDESIGNS",
                            "id": "ih46ive",
                            "parent_id": "t1_ih45i7b",
                            "score": -1,
                            "created_utc": 1658444020.0,
                            "replies": [
                                {
                                    "body": "Yep! All adult humans break contracts sometimes.  You have too.  Do you think you have never exceeded the speed limit? Brought something into a movie theater? Accidentally left something off a customer's order at your retail job?  X doubt.\n#\nAbstract concepts are not harm dude.\n#\nDont really care what your gender is homie.  Go to IG if it's such a big deal to you.",
                                    "author": "TastySpermDispenser",
                                    "id": "ih47jpl",
                                    "parent_id": "t1_ih46ive",
                                    "score": 1,
                                    "created_utc": 1658444449.0,
                                    "replies": [
                                        {
                                            "body": "LOL\n\nThe \"speed limit\" is not a \"contract\".\n\nTaking something into a movie theater is not a \"contract\".\n\nAccidentally leaving something off a customer's order is not a \"contract\".\n\nBreaking trust...breaking homes are not \"abstract concepts\".  What a load of crap...\n\nCalling a woman a man is offensive...deflect all you want, but that is a fact.",
                                            "author": "NITAREEDDESIGNS",
                                            "id": "ih49kwj",
                                            "parent_id": "t1_ih47jpl",
                                            "score": -1,
                                            "created_utc": 1658445324.0,
                                            "replies": [
                                                {
                                                    "body": "Your insurance contract literally requires you to drive the speed limit.\n#\nYour movie ticket contract literally prohibits outside food and drink.\n#\nBreaking trust? Lol. Do you believe everything you read and see? You must have a lot of broken trust with all this advertising, and yet, you struggle on! You're a punch line!",
                                                    "author": "TastySpermDispenser",
                                                    "id": "ih4a941",
                                                    "parent_id": "t1_ih49kwj",
                                                    "score": 2,
                                                    "created_utc": 1658445617.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tl;Dr version: Women love accessories until they’re stuck with them.",
            "author": "luckysparkie",
            "id": "iigjuza",
            "parent_id": "t1_ihbk3fr",
            "score": 1,
            "created_utc": 1659320577.0,
            "replies": []
        },
        {
            "body": "Indeed, it was a typo.",
            "author": "dallas-explorer",
            "id": "igzdyme",
            "parent_id": "t1_igz5nlr",
            "score": 1,
            "created_utc": 1658360557.0,
            "replies": []
        },
        {
            "body": ">Stanley Ho\n\nThanks. Had not heard of Stanley Ho before.\n\nhttps://asiatimes.com/2018/01/real-reasons-behind-hong-kongs-love-polygamous-tycoons/",
            "author": "LuckyINTJ",
            "id": "ih6zu46",
            "parent_id": "t1_igzzgd7",
            "score": 1,
            "created_utc": 1658500498.0,
            "replies": [
                {
                    "body": "I don’t think polygamy or polyamory are wrong. \nI generally believe as long as there is no cheating, any human relationships are legitimate. \n\nThere is no such a term “ openly cheating “ .. you are either scared and cheat secretly behind your wife or you openly enjoy your lover with your wife’s agreement. \n\nMaybe there are men in this world women are willingly to share for the rest of their life. \n\nWillingly is always a key word. In many religious or historical contexts, a man owns multi women because of gender inequality. For example, women can’t inherit land or properties. And many women were forced to share a man. \n\nBut if they are not forced and everyone knows exactly what’s going on, you will have the empire Stanley Ho created. \n\nIn reality, it’s extremely hard work to have more than one women (this different from group sex you are talking about ) .. Stanley created a big family with his four women , each left him offsprings and they are all properly recorded in the family tree.",
                    "author": null,
                    "id": "ihb6oo9",
                    "parent_id": "t1_ih6zu46",
                    "score": 1,
                    "created_utc": 1658575313.0,
                    "replies": [
                        {
                            "body": ">There is no such a term “ openly cheating “ .. you are either scared and cheat secretly behind your wife or you openly enjoy your lover with your wife’s agreement\n\nI am widowed and not have a wife. I have four sugar babies.  They all know about each other and are friends.",
                            "author": "LuckyINTJ",
                            "id": "ihrukeu",
                            "parent_id": "t1_ihb6oo9",
                            "score": 1,
                            "created_utc": 1658873039.0,
                            "replies": [
                                {
                                    "body": "I don’t know what you are trying to tell me. \nAgain you are just like the guy who own playboy magazine with all the blonde chicks living in the same house with him. They stay around for comfort, job career, fame and status. They don’t truly love him or devote their life to the old white guy.",
                                    "author": null,
                                    "id": "ihsamee",
                                    "parent_id": "t1_ihrukeu",
                                    "score": 1,
                                    "created_utc": 1658879995.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Can I ask what you do for work/money?",
            "author": "ellielovey",
            "id": "ih05sya",
            "parent_id": "t1_ih04vj6",
            "score": 2,
            "created_utc": 1658373530.0,
            "replies": [
                {
                    "body": "I’m retired military.  I did security contracting for a while after I retired, and now I teach people some of the things I used to do in the military and as a contractor.",
                    "author": "NVOkie9018",
                    "id": "ih0cus7",
                    "parent_id": "t1_ih05sya",
                    "score": 3,
                    "created_utc": 1658377342.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That having been said, it’s important to acknowledge he “thinks” about from time to time. It’s part of the human condition.",
            "author": "luckysparkie",
            "id": "iigjmlr",
            "parent_id": "t1_ih4n9e2",
            "score": 1,
            "created_utc": 1659320460.0,
            "replies": [
                {
                    "body": "I hear you.",
                    "author": "Tale-Itchy",
                    "id": "iigjq1a",
                    "parent_id": "t1_iigjmlr",
                    "score": 2,
                    "created_utc": 1659320508.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wholeheartedly agree with this last statement",
            "author": "kobereuben88",
            "id": "ih2iyck",
            "parent_id": "t1_igzwudp",
            "score": 1,
            "created_utc": 1658421268.0,
            "replies": []
        },
        {
            "body": "I mean number 3 is pretty depressing",
            "author": "Quick_Chocolate_657",
            "id": "igysxlj",
            "parent_id": "t1_igyrktl",
            "score": 3,
            "created_utc": 1658350937.0,
            "replies": [
                {
                    "body": "Will tell you a story about (3)\nIn Super man movie, \nShe loves the hero, then she wants to be with him all the time, so she convinces him to give up on being the hero.\nThe moment he gives up his hero role for her, she loses interest in him and the love fades away. \n\nThat’s from real life, I’ve discussed this part with many girls, every time I get the same answer.\n\nIt’s very arousing to girls, when they find a man on mission, (any type of mission) they love him for his dedication, then they test that dedication, the moment he gives up his mission for his girl, he lost her. \n\nThis is how the game ends.",
                    "author": "NightMasterDom",
                    "id": "igyv9jp",
                    "parent_id": "t1_igysxlj",
                    "score": -1,
                    "created_utc": 1658351956.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Was really just talking about #3. Personally I don’t want a relationship and would prefer men be in a relationship but I know a lot of people don’t want that. So I think it’s sad for those looking for it. And the getting sloppy after time is depressing for everyone because people do get that way. Hard to keep things exciting sometimes. Lol.",
            "author": "lifting12",
            "id": "igys97l",
            "parent_id": "t1_igyrktl",
            "score": 2,
            "created_utc": 1658350649.0,
            "replies": []
        },
        {
            "body": "I agree with you that cheating on your wife is uncool and unfair. I'm actually rather shocked at how prevalent it appears to be -- in and out of the Bowl.",
            "author": "matthewjphillips",
            "id": "igz9gz9",
            "parent_id": "t1_igz2b5d",
            "score": 2,
            "created_utc": 1658358410.0,
            "replies": [
                {
                    "body": "Yeah it’s kinda making me wanna give up on serious relationships. It’s like no one can be trusted",
                    "author": "TreatMeLikeASlut8",
                    "id": "igzxp5j",
                    "parent_id": "t1_igz9gz9",
                    "score": 3,
                    "created_utc": 1658369639.0,
                    "replies": [
                        {
                            "body": "Be careful about over-generalizing.\n\nJust become SOME can't be trusted; Heck, even if MOST can't be trusted; it doesn't mean NO ONE can be trusted.\n\nDon't live your life alone just because you're afraid to find someone who deserves your trust.",
                            "author": "matthewjphillips",
                            "id": "igzy2jd",
                            "parent_id": "t1_igzxp5j",
                            "score": 2,
                            "created_utc": 1658369812.0,
                            "replies": [
                                {
                                    "body": "Yeah, I keep telling myself that.",
                                    "author": "TreatMeLikeASlut8",
                                    "id": "igzyysx",
                                    "parent_id": "t1_igzy2jd",
                                    "score": 2,
                                    "created_utc": 1658370229.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ih2y7ov",
            "parent_id": "t1_ih2xyu3",
            "score": 0,
            "created_utc": 1658426924.0,
            "replies": [
                {
                    "body": "Ew. \n\nP.S. I can almost guarantee that the married schmuck you’re seeing doesn’t care about you, at least not nearly as much as you think you care about him. Both of you are empty people. Where did it all go wrong? Don’t actually answer that. Bye now",
                    "author": "throwaway144811",
                    "id": "ih2zisn",
                    "parent_id": "t1_ih2y7ov",
                    "score": -2,
                    "created_utc": 1658427421.0,
                    "replies": [
                        {
                            "body": "I’m sorry you’re hurting but maybe you shouldn’t be in this subreddit if the fact that Married Sugar Dads exist, is triggering for you. \n\nPeople are going through enough, no need to be a jackass. 🫣",
                            "author": "Tale-Itchy",
                            "id": "ih3a0ex",
                            "parent_id": "t1_ih2zisn",
                            "score": 6,
                            "created_utc": 1658431360.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ih2so9j",
            "parent_id": "t1_ih18c5c",
            "score": 2,
            "created_utc": 1658424854.0,
            "replies": [
                {
                    "body": "I do all of these. As matter of fact she's not one to text alot at night. Actually I see her most weeks 5 days a week. Not for play time only. A lot just to bring her a coffee and a muffin. \nHere comes the muffin man lol\nhttps://m.youtube.com/watch?v=fXFg5QsTcLQ",
                    "author": "18newbie44880011",
                    "id": "ih2v0wd",
                    "parent_id": "t1_ih2so9j",
                    "score": 2,
                    "created_utc": 1658425732.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I assume at some point she’ll get out of the bowl. Most ppl don’t do it forever right?",
            "author": "Quick_Chocolate_657",
            "id": "igza4ri",
            "parent_id": "t1_igz7pn7",
            "score": 1,
            "created_utc": 1658358729.0,
            "replies": [
                {
                    "body": "An ex sugar baby can be a red flag for most. It’s even worse if she doesn’t admit it and it’s found out later in the relationship.",
                    "author": "sugarthrowaway407",
                    "id": "igzjqx6",
                    "parent_id": "t1_igza4ri",
                    "score": 2,
                    "created_utc": 1658363276.0,
                    "replies": [
                        {
                            "body": "I mean sure, but there are some guys who wouldn’t care. She realistically can’t sugar her whole life.",
                            "author": "Quick_Chocolate_657",
                            "id": "igztpja",
                            "parent_id": "t1_igzjqx6",
                            "score": 3,
                            "created_utc": 1658367827.0,
                            "replies": [
                                {
                                    "body": "“Some guys”… yeah I also can quadruple my money at the casino tonight. Relying on hope is a bad strategy especially when you’re talking about your life outcomes",
                                    "author": "sugarthrowaway407",
                                    "id": "igzyp75",
                                    "parent_id": "t1_igztpja",
                                    "score": -3,
                                    "created_utc": 1658370103.0,
                                    "replies": [
                                        {
                                            "body": "There are a lot of guys who would date a former SB. Men date strippers don’t they? People are different, but there are plenty of men who wouldn’t mind. Literally what other choice would she have? She’s gonna be sugaring at 60?",
                                            "author": "Quick_Chocolate_657",
                                            "id": "ih03cgd",
                                            "parent_id": "t1_igzyp75",
                                            "score": 3,
                                            "created_utc": 1658372307.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are wrong in many points of your comment but that is your opinion and experience. Mine is different. And yes, they must chase career but believe me, once you are a dreamgirl to one of them you will experience some real special treatment. But the fact that you are their dream girl does not mean they are what you want. And yeah, they do not give a damn about escorting. Maybe do your research how many wives of high earning men were escorts, and how many of them actually met at work. Of course it wont be written explicitly. It is like the movie breakfast at tiffanys which is about escort, and so many people do not get it lol :D. But yeah, the reason why I say not impossible is because for some it will be easier then for others. I do not know how the girls looks like, how are their manners, intelligence, social skills etc. If you are model material with rubbish personality your chances are low.",
            "author": "idontlikespiderplant",
            "id": "ihbl534",
            "parent_id": "t1_ih1magy",
            "score": 2,
            "created_utc": 1658583787.0,
            "replies": []
        },
        {
            "body": "So they do 😄",
            "author": "WiseRequirement9277",
            "id": "igzl0yu",
            "parent_id": "t1_igzjyhx",
            "score": 3,
            "created_utc": 1658363874.0,
            "replies": [
                {
                    "body": "Extremely attractive means women who have successfully modeled or who’ve been offered modeling additions…",
                    "author": "sugarthrowaway407",
                    "id": "igzpk9i",
                    "parent_id": "t1_igzl0yu",
                    "score": -2,
                    "created_utc": 1658365953.0,
                    "replies": [
                        {
                            "body": "So it happens 😄",
                            "author": "WiseRequirement9277",
                            "id": "ih0rqou",
                            "parent_id": "t1_igzpk9i",
                            "score": 3,
                            "created_utc": 1658387307.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "For the same reason I can watch a parent eat a greasy hamburger with their young fat child while talking about santa and still love and respect them both.\n#\nMy comment relates more to his comment history. Mommy and daddy clearly taught him that he gets to own someone as soon as he persuades them to marriage, no matter what what garbage person he becomes.\n#\nBe mad at adultry all you want; it's still two human beings, neither one harming anyone, and certainly not the adult who definitely didnt break any promises.  I dont know you, but I guarantee multiple times in life you have participated in breaking contracts, and I still love you bro.",
            "author": "TastySpermDispenser",
            "id": "ih45i7b",
            "parent_id": "t1_ih3xkwq",
            "score": 3,
            "created_utc": 1658443589.0,
            "replies": [
                {
                    "body": ">I dont know you, but I guarantee multiple times in life you have participated in breaking contracts\n\nYou don't know me and yet you presume to \"guarantee\" something about me?\n\n&#x200B;\n\n>Be mad at adultry all you want; it's still two human beings, neither one harming anyone,\n\nOh yes...both \"human beings\" are, indeed, harming people and not just any SOs involved.\n\n>I still love you bro.\n\nIf I had a $ for every time a Redditor thought I was a dude...",
                    "author": "NITAREEDDESIGNS",
                    "id": "ih46ive",
                    "parent_id": "t1_ih45i7b",
                    "score": -1,
                    "created_utc": 1658444020.0,
                    "replies": [
                        {
                            "body": "Yep! All adult humans break contracts sometimes.  You have too.  Do you think you have never exceeded the speed limit? Brought something into a movie theater? Accidentally left something off a customer's order at your retail job?  X doubt.\n#\nAbstract concepts are not harm dude.\n#\nDont really care what your gender is homie.  Go to IG if it's such a big deal to you.",
                            "author": "TastySpermDispenser",
                            "id": "ih47jpl",
                            "parent_id": "t1_ih46ive",
                            "score": 1,
                            "created_utc": 1658444449.0,
                            "replies": [
                                {
                                    "body": "LOL\n\nThe \"speed limit\" is not a \"contract\".\n\nTaking something into a movie theater is not a \"contract\".\n\nAccidentally leaving something off a customer's order is not a \"contract\".\n\nBreaking trust...breaking homes are not \"abstract concepts\".  What a load of crap...\n\nCalling a woman a man is offensive...deflect all you want, but that is a fact.",
                                    "author": "NITAREEDDESIGNS",
                                    "id": "ih49kwj",
                                    "parent_id": "t1_ih47jpl",
                                    "score": -1,
                                    "created_utc": 1658445324.0,
                                    "replies": [
                                        {
                                            "body": "Your insurance contract literally requires you to drive the speed limit.\n#\nYour movie ticket contract literally prohibits outside food and drink.\n#\nBreaking trust? Lol. Do you believe everything you read and see? You must have a lot of broken trust with all this advertising, and yet, you struggle on! You're a punch line!",
                                            "author": "TastySpermDispenser",
                                            "id": "ih4a941",
                                            "parent_id": "t1_ih49kwj",
                                            "score": 2,
                                            "created_utc": 1658445617.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t think polygamy or polyamory are wrong. \nI generally believe as long as there is no cheating, any human relationships are legitimate. \n\nThere is no such a term “ openly cheating “ .. you are either scared and cheat secretly behind your wife or you openly enjoy your lover with your wife’s agreement. \n\nMaybe there are men in this world women are willingly to share for the rest of their life. \n\nWillingly is always a key word. In many religious or historical contexts, a man owns multi women because of gender inequality. For example, women can’t inherit land or properties. And many women were forced to share a man. \n\nBut if they are not forced and everyone knows exactly what’s going on, you will have the empire Stanley Ho created. \n\nIn reality, it’s extremely hard work to have more than one women (this different from group sex you are talking about ) .. Stanley created a big family with his four women , each left him offsprings and they are all properly recorded in the family tree.",
            "author": null,
            "id": "ihb6oo9",
            "parent_id": "t1_ih6zu46",
            "score": 1,
            "created_utc": 1658575313.0,
            "replies": [
                {
                    "body": ">There is no such a term “ openly cheating “ .. you are either scared and cheat secretly behind your wife or you openly enjoy your lover with your wife’s agreement\n\nI am widowed and not have a wife. I have four sugar babies.  They all know about each other and are friends.",
                    "author": "LuckyINTJ",
                    "id": "ihrukeu",
                    "parent_id": "t1_ihb6oo9",
                    "score": 1,
                    "created_utc": 1658873039.0,
                    "replies": [
                        {
                            "body": "I don’t know what you are trying to tell me. \nAgain you are just like the guy who own playboy magazine with all the blonde chicks living in the same house with him. They stay around for comfort, job career, fame and status. They don’t truly love him or devote their life to the old white guy.",
                            "author": null,
                            "id": "ihsamee",
                            "parent_id": "t1_ihrukeu",
                            "score": 1,
                            "created_utc": 1658879995.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m retired military.  I did security contracting for a while after I retired, and now I teach people some of the things I used to do in the military and as a contractor.",
            "author": "NVOkie9018",
            "id": "ih0cus7",
            "parent_id": "t1_ih05sya",
            "score": 3,
            "created_utc": 1658377342.0,
            "replies": []
        },
        {
            "body": "I hear you.",
            "author": "Tale-Itchy",
            "id": "iigjq1a",
            "parent_id": "t1_iigjmlr",
            "score": 2,
            "created_utc": 1659320508.0,
            "replies": []
        },
        {
            "body": "Will tell you a story about (3)\nIn Super man movie, \nShe loves the hero, then she wants to be with him all the time, so she convinces him to give up on being the hero.\nThe moment he gives up his hero role for her, she loses interest in him and the love fades away. \n\nThat’s from real life, I’ve discussed this part with many girls, every time I get the same answer.\n\nIt’s very arousing to girls, when they find a man on mission, (any type of mission) they love him for his dedication, then they test that dedication, the moment he gives up his mission for his girl, he lost her. \n\nThis is how the game ends.",
            "author": "NightMasterDom",
            "id": "igyv9jp",
            "parent_id": "t1_igysxlj",
            "score": -1,
            "created_utc": 1658351956.0,
            "replies": []
        },
        {
            "body": "Yeah it’s kinda making me wanna give up on serious relationships. It’s like no one can be trusted",
            "author": "TreatMeLikeASlut8",
            "id": "igzxp5j",
            "parent_id": "t1_igz9gz9",
            "score": 3,
            "created_utc": 1658369639.0,
            "replies": [
                {
                    "body": "Be careful about over-generalizing.\n\nJust become SOME can't be trusted; Heck, even if MOST can't be trusted; it doesn't mean NO ONE can be trusted.\n\nDon't live your life alone just because you're afraid to find someone who deserves your trust.",
                    "author": "matthewjphillips",
                    "id": "igzy2jd",
                    "parent_id": "t1_igzxp5j",
                    "score": 2,
                    "created_utc": 1658369812.0,
                    "replies": [
                        {
                            "body": "Yeah, I keep telling myself that.",
                            "author": "TreatMeLikeASlut8",
                            "id": "igzyysx",
                            "parent_id": "t1_igzy2jd",
                            "score": 2,
                            "created_utc": 1658370229.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ew. \n\nP.S. I can almost guarantee that the married schmuck you’re seeing doesn’t care about you, at least not nearly as much as you think you care about him. Both of you are empty people. Where did it all go wrong? Don’t actually answer that. Bye now",
            "author": "throwaway144811",
            "id": "ih2zisn",
            "parent_id": "t1_ih2y7ov",
            "score": -2,
            "created_utc": 1658427421.0,
            "replies": [
                {
                    "body": "I’m sorry you’re hurting but maybe you shouldn’t be in this subreddit if the fact that Married Sugar Dads exist, is triggering for you. \n\nPeople are going through enough, no need to be a jackass. 🫣",
                    "author": "Tale-Itchy",
                    "id": "ih3a0ex",
                    "parent_id": "t1_ih2zisn",
                    "score": 6,
                    "created_utc": 1658431360.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I do all of these. As matter of fact she's not one to text alot at night. Actually I see her most weeks 5 days a week. Not for play time only. A lot just to bring her a coffee and a muffin. \nHere comes the muffin man lol\nhttps://m.youtube.com/watch?v=fXFg5QsTcLQ",
            "author": "18newbie44880011",
            "id": "ih2v0wd",
            "parent_id": "t1_ih2so9j",
            "score": 2,
            "created_utc": 1658425732.0,
            "replies": []
        },
        {
            "body": "An ex sugar baby can be a red flag for most. It’s even worse if she doesn’t admit it and it’s found out later in the relationship.",
            "author": "sugarthrowaway407",
            "id": "igzjqx6",
            "parent_id": "t1_igza4ri",
            "score": 2,
            "created_utc": 1658363276.0,
            "replies": [
                {
                    "body": "I mean sure, but there are some guys who wouldn’t care. She realistically can’t sugar her whole life.",
                    "author": "Quick_Chocolate_657",
                    "id": "igztpja",
                    "parent_id": "t1_igzjqx6",
                    "score": 3,
                    "created_utc": 1658367827.0,
                    "replies": [
                        {
                            "body": "“Some guys”… yeah I also can quadruple my money at the casino tonight. Relying on hope is a bad strategy especially when you’re talking about your life outcomes",
                            "author": "sugarthrowaway407",
                            "id": "igzyp75",
                            "parent_id": "t1_igztpja",
                            "score": -3,
                            "created_utc": 1658370103.0,
                            "replies": [
                                {
                                    "body": "There are a lot of guys who would date a former SB. Men date strippers don’t they? People are different, but there are plenty of men who wouldn’t mind. Literally what other choice would she have? She’s gonna be sugaring at 60?",
                                    "author": "Quick_Chocolate_657",
                                    "id": "ih03cgd",
                                    "parent_id": "t1_igzyp75",
                                    "score": 3,
                                    "created_utc": 1658372307.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Extremely attractive means women who have successfully modeled or who’ve been offered modeling additions…",
            "author": "sugarthrowaway407",
            "id": "igzpk9i",
            "parent_id": "t1_igzl0yu",
            "score": -2,
            "created_utc": 1658365953.0,
            "replies": [
                {
                    "body": "So it happens 😄",
                    "author": "WiseRequirement9277",
                    "id": "ih0rqou",
                    "parent_id": "t1_igzpk9i",
                    "score": 3,
                    "created_utc": 1658387307.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">I dont know you, but I guarantee multiple times in life you have participated in breaking contracts\n\nYou don't know me and yet you presume to \"guarantee\" something about me?\n\n&#x200B;\n\n>Be mad at adultry all you want; it's still two human beings, neither one harming anyone,\n\nOh yes...both \"human beings\" are, indeed, harming people and not just any SOs involved.\n\n>I still love you bro.\n\nIf I had a $ for every time a Redditor thought I was a dude...",
            "author": "NITAREEDDESIGNS",
            "id": "ih46ive",
            "parent_id": "t1_ih45i7b",
            "score": -1,
            "created_utc": 1658444020.0,
            "replies": [
                {
                    "body": "Yep! All adult humans break contracts sometimes.  You have too.  Do you think you have never exceeded the speed limit? Brought something into a movie theater? Accidentally left something off a customer's order at your retail job?  X doubt.\n#\nAbstract concepts are not harm dude.\n#\nDont really care what your gender is homie.  Go to IG if it's such a big deal to you.",
                    "author": "TastySpermDispenser",
                    "id": "ih47jpl",
                    "parent_id": "t1_ih46ive",
                    "score": 1,
                    "created_utc": 1658444449.0,
                    "replies": [
                        {
                            "body": "LOL\n\nThe \"speed limit\" is not a \"contract\".\n\nTaking something into a movie theater is not a \"contract\".\n\nAccidentally leaving something off a customer's order is not a \"contract\".\n\nBreaking trust...breaking homes are not \"abstract concepts\".  What a load of crap...\n\nCalling a woman a man is offensive...deflect all you want, but that is a fact.",
                            "author": "NITAREEDDESIGNS",
                            "id": "ih49kwj",
                            "parent_id": "t1_ih47jpl",
                            "score": -1,
                            "created_utc": 1658445324.0,
                            "replies": [
                                {
                                    "body": "Your insurance contract literally requires you to drive the speed limit.\n#\nYour movie ticket contract literally prohibits outside food and drink.\n#\nBreaking trust? Lol. Do you believe everything you read and see? You must have a lot of broken trust with all this advertising, and yet, you struggle on! You're a punch line!",
                                    "author": "TastySpermDispenser",
                                    "id": "ih4a941",
                                    "parent_id": "t1_ih49kwj",
                                    "score": 2,
                                    "created_utc": 1658445617.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">There is no such a term “ openly cheating “ .. you are either scared and cheat secretly behind your wife or you openly enjoy your lover with your wife’s agreement\n\nI am widowed and not have a wife. I have four sugar babies.  They all know about each other and are friends.",
            "author": "LuckyINTJ",
            "id": "ihrukeu",
            "parent_id": "t1_ihb6oo9",
            "score": 1,
            "created_utc": 1658873039.0,
            "replies": [
                {
                    "body": "I don’t know what you are trying to tell me. \nAgain you are just like the guy who own playboy magazine with all the blonde chicks living in the same house with him. They stay around for comfort, job career, fame and status. They don’t truly love him or devote their life to the old white guy.",
                    "author": null,
                    "id": "ihsamee",
                    "parent_id": "t1_ihrukeu",
                    "score": 1,
                    "created_utc": 1658879995.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Be careful about over-generalizing.\n\nJust become SOME can't be trusted; Heck, even if MOST can't be trusted; it doesn't mean NO ONE can be trusted.\n\nDon't live your life alone just because you're afraid to find someone who deserves your trust.",
            "author": "matthewjphillips",
            "id": "igzy2jd",
            "parent_id": "t1_igzxp5j",
            "score": 2,
            "created_utc": 1658369812.0,
            "replies": [
                {
                    "body": "Yeah, I keep telling myself that.",
                    "author": "TreatMeLikeASlut8",
                    "id": "igzyysx",
                    "parent_id": "t1_igzy2jd",
                    "score": 2,
                    "created_utc": 1658370229.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m sorry you’re hurting but maybe you shouldn’t be in this subreddit if the fact that Married Sugar Dads exist, is triggering for you. \n\nPeople are going through enough, no need to be a jackass. 🫣",
            "author": "Tale-Itchy",
            "id": "ih3a0ex",
            "parent_id": "t1_ih2zisn",
            "score": 6,
            "created_utc": 1658431360.0,
            "replies": []
        },
        {
            "body": "I mean sure, but there are some guys who wouldn’t care. She realistically can’t sugar her whole life.",
            "author": "Quick_Chocolate_657",
            "id": "igztpja",
            "parent_id": "t1_igzjqx6",
            "score": 3,
            "created_utc": 1658367827.0,
            "replies": [
                {
                    "body": "“Some guys”… yeah I also can quadruple my money at the casino tonight. Relying on hope is a bad strategy especially when you’re talking about your life outcomes",
                    "author": "sugarthrowaway407",
                    "id": "igzyp75",
                    "parent_id": "t1_igztpja",
                    "score": -3,
                    "created_utc": 1658370103.0,
                    "replies": [
                        {
                            "body": "There are a lot of guys who would date a former SB. Men date strippers don’t they? People are different, but there are plenty of men who wouldn’t mind. Literally what other choice would she have? She’s gonna be sugaring at 60?",
                            "author": "Quick_Chocolate_657",
                            "id": "ih03cgd",
                            "parent_id": "t1_igzyp75",
                            "score": 3,
                            "created_utc": 1658372307.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So it happens 😄",
            "author": "WiseRequirement9277",
            "id": "ih0rqou",
            "parent_id": "t1_igzpk9i",
            "score": 3,
            "created_utc": 1658387307.0,
            "replies": []
        },
        {
            "body": "Yep! All adult humans break contracts sometimes.  You have too.  Do you think you have never exceeded the speed limit? Brought something into a movie theater? Accidentally left something off a customer's order at your retail job?  X doubt.\n#\nAbstract concepts are not harm dude.\n#\nDont really care what your gender is homie.  Go to IG if it's such a big deal to you.",
            "author": "TastySpermDispenser",
            "id": "ih47jpl",
            "parent_id": "t1_ih46ive",
            "score": 1,
            "created_utc": 1658444449.0,
            "replies": [
                {
                    "body": "LOL\n\nThe \"speed limit\" is not a \"contract\".\n\nTaking something into a movie theater is not a \"contract\".\n\nAccidentally leaving something off a customer's order is not a \"contract\".\n\nBreaking trust...breaking homes are not \"abstract concepts\".  What a load of crap...\n\nCalling a woman a man is offensive...deflect all you want, but that is a fact.",
                    "author": "NITAREEDDESIGNS",
                    "id": "ih49kwj",
                    "parent_id": "t1_ih47jpl",
                    "score": -1,
                    "created_utc": 1658445324.0,
                    "replies": [
                        {
                            "body": "Your insurance contract literally requires you to drive the speed limit.\n#\nYour movie ticket contract literally prohibits outside food and drink.\n#\nBreaking trust? Lol. Do you believe everything you read and see? You must have a lot of broken trust with all this advertising, and yet, you struggle on! You're a punch line!",
                            "author": "TastySpermDispenser",
                            "id": "ih4a941",
                            "parent_id": "t1_ih49kwj",
                            "score": 2,
                            "created_utc": 1658445617.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t know what you are trying to tell me. \nAgain you are just like the guy who own playboy magazine with all the blonde chicks living in the same house with him. They stay around for comfort, job career, fame and status. They don’t truly love him or devote their life to the old white guy.",
            "author": null,
            "id": "ihsamee",
            "parent_id": "t1_ihrukeu",
            "score": 1,
            "created_utc": 1658879995.0,
            "replies": []
        },
        {
            "body": "Yeah, I keep telling myself that.",
            "author": "TreatMeLikeASlut8",
            "id": "igzyysx",
            "parent_id": "t1_igzy2jd",
            "score": 2,
            "created_utc": 1658370229.0,
            "replies": []
        },
        {
            "body": "“Some guys”… yeah I also can quadruple my money at the casino tonight. Relying on hope is a bad strategy especially when you’re talking about your life outcomes",
            "author": "sugarthrowaway407",
            "id": "igzyp75",
            "parent_id": "t1_igztpja",
            "score": -3,
            "created_utc": 1658370103.0,
            "replies": [
                {
                    "body": "There are a lot of guys who would date a former SB. Men date strippers don’t they? People are different, but there are plenty of men who wouldn’t mind. Literally what other choice would she have? She’s gonna be sugaring at 60?",
                    "author": "Quick_Chocolate_657",
                    "id": "ih03cgd",
                    "parent_id": "t1_igzyp75",
                    "score": 3,
                    "created_utc": 1658372307.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "LOL\n\nThe \"speed limit\" is not a \"contract\".\n\nTaking something into a movie theater is not a \"contract\".\n\nAccidentally leaving something off a customer's order is not a \"contract\".\n\nBreaking trust...breaking homes are not \"abstract concepts\".  What a load of crap...\n\nCalling a woman a man is offensive...deflect all you want, but that is a fact.",
            "author": "NITAREEDDESIGNS",
            "id": "ih49kwj",
            "parent_id": "t1_ih47jpl",
            "score": -1,
            "created_utc": 1658445324.0,
            "replies": [
                {
                    "body": "Your insurance contract literally requires you to drive the speed limit.\n#\nYour movie ticket contract literally prohibits outside food and drink.\n#\nBreaking trust? Lol. Do you believe everything you read and see? You must have a lot of broken trust with all this advertising, and yet, you struggle on! You're a punch line!",
                    "author": "TastySpermDispenser",
                    "id": "ih4a941",
                    "parent_id": "t1_ih49kwj",
                    "score": 2,
                    "created_utc": 1658445617.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There are a lot of guys who would date a former SB. Men date strippers don’t they? People are different, but there are plenty of men who wouldn’t mind. Literally what other choice would she have? She’s gonna be sugaring at 60?",
            "author": "Quick_Chocolate_657",
            "id": "ih03cgd",
            "parent_id": "t1_igzyp75",
            "score": 3,
            "created_utc": 1658372307.0,
            "replies": []
        },
        {
            "body": "Your insurance contract literally requires you to drive the speed limit.\n#\nYour movie ticket contract literally prohibits outside food and drink.\n#\nBreaking trust? Lol. Do you believe everything you read and see? You must have a lot of broken trust with all this advertising, and yet, you struggle on! You're a punch line!",
            "author": "TastySpermDispenser",
            "id": "ih4a941",
            "parent_id": "t1_ih49kwj",
            "score": 2,
            "created_utc": 1658445617.0,
            "replies": []
        }
    ]
}