{
    "title": "Running Man 559 | Goodbye, Our Special Brother",
    "post_id": "nysbqf",
    "post_url": "https://www.reddit.com/r/runningman/comments/nysbqf/running_man_559_goodbye_our_special_brother/",
    "author": "myrunningman",
    "body": "### This is the official episode discussion post in addition to being an episode guide. As people will be discussing the corresponding episode - there will be SPOILERS in the thread.\n\n**Where to Watch?**\n\n- OnDemandKorea | [FULL](http://www.ondemandkorea.com/running-man-e559.html) - Available in North & South America\r\n\r\n**Guests**: none (or not yet announced)\r\n\r\n**Teams:**\n\n- [List teams]\n\n**Format:**\n\n- Intro\n- Pre-final Challenges/Games:\n\t- [Name/Description]\n\t\t- Winner(s): >!insert winner!<\n\t- [Name/Description]\n\t\t- Winner(s): >!insert winner!<\n\n- Final Challenge/Game:\n\t- [Name/Description]\n\n**Final Winner(s) & Prize:**\n\n- >!Final Winner(s) -- Describe Prize!<\n\n&nbsp;    \n\n**Check out other [Episode Guides](https://www.reddit.com/r/runningman/wiki/episodes#wiki_episode_guides)!**\n\n&nbsp;\n\n**Tags:** 런닝맨, korean, variety, tv, show\n\n&nbsp;\n\nHere's the poll question: **Rate episode 559: Goodbye, Our Special Brother:**\n\n[View Poll](https://www.reddit.com/poll/nysbqf)",
    "url": "https://www.reddit.com/r/runningman/comments/nysbqf/running_man_559_goodbye_our_special_brother/",
    "score": 294,
    "upvote_ratio": 0.99,
    "created_utc": 1623574803.0,
    "num_comments": 161,
    "links": [
        [
            "http://www.ondemandkorea.com/running-man-e559.html",
            "https://www.reddit.com/r/runningman/wiki/episodes#wiki_episode_guides",
            "https://www.reddit.com/poll/nysbqf"
        ]
    ],
    "comments": [
        {
            "body": "Thank you all for voting! Our rating for this episode is: ~**4.88** - possibly more.",
            "author": "BoneToBeWild",
            "id": "h2evshd",
            "parent_id": "t3_nysbqf",
            "score": 1,
            "created_utc": 1624181971.0,
            "replies": []
        },
        {
            "body": "Many tears, but I realize something about Yang Se Chan.  In the Nevis Swing “arc” he always joked around and tried to be strong for Haha, but when it came down to it he was so anxious and nervous he threw up.  He was similar in this aspect, past few episodes he was still playing the comedy man, but this episode he broke down listening to the goodbye song.  Such a pure soul",
            "author": "KennyHuynhlalalala",
            "id": "h1p9b1v",
            "parent_id": "t3_nysbqf",
            "score": 124,
            "created_utc": 1623648532.0,
            "replies": [
                {
                    "body": "Sorry is his injury that serious/permanent? . Why couldn’t he take an extended break(1 year)? And return. Purely curious",
                    "author": "ilovemolduga",
                    "id": "h23t02q",
                    "parent_id": "t1_h1p9b1v",
                    "score": 2,
                    "created_utc": 1623947031.0,
                    "replies": [
                        {
                            "body": "It takes a looong time to recover from car accidents and sometimes never. \n\nMy mom and I for instance had one where someone hit us from behind at a res light. Supposedly it was no big deal but three years later my mom is still all kinds of messed up in her joints",
                            "author": "Mozart-Luna-Echo",
                            "id": "h2yj24r",
                            "parent_id": "t1_h23t02q",
                            "score": 2,
                            "created_utc": 1624593638.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Man...KJK's letter..  \n\"I thought you would be there till the end\"  \n\n\nFuck that hurts..",
            "author": "faralei",
            "id": "h1onqk0",
            "parent_id": "t3_nysbqf",
            "score": 125,
            "created_utc": 1623634556.0,
            "replies": [
                {
                    "body": "He started to draw just to prevent himself from crying too.",
                    "author": "coolcoolnodoubt",
                    "id": "h1qsiem",
                    "parent_id": "t1_h1onqk0",
                    "score": 56,
                    "created_utc": 1623686895.0,
                    "replies": []
                },
                {
                    "body": "this hit me so hard. but he closes the statement nicely.",
                    "author": "aiaidy",
                    "id": "h1pcqw4",
                    "parent_id": "t1_h1onqk0",
                    "score": 30,
                    "created_utc": 1623651324.0,
                    "replies": []
                },
                {
                    "body": "The last look right before stepping out of the bus. That scene wrecked me.",
                    "author": "fwindraya",
                    "id": "h1rfjmo",
                    "parent_id": "t1_h1onqk0",
                    "score": 24,
                    "created_utc": 1623697171.0,
                    "replies": []
                },
                {
                    "body": "That killed me and today I'm still dead",
                    "author": "pooploserbq",
                    "id": "h1qv7jn",
                    "parent_id": "t1_h1onqk0",
                    "score": 4,
                    "created_utc": 1623688101.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m a true crying mess throughout this episode especially the twist at the end… Kwang Soo has a really kind heart indeed. Having watched Running Man since its beginnings, I can’t believe its been 11 years already. I literally grew up with this show, from an elementary school student to a college student now, and Running Man has been my staple variety show to look forward to every Sunday. Kwang Soo is undeniably the funniest member, and thank you Kwang Soo for bringing so much joy to international viewers all these years. Kwang Soo will be missed, and I do hope he makes a guest appearance sometime!",
            "author": "kaydenceee",
            "id": "h1ltvuz",
            "parent_id": "t3_nysbqf",
            "score": 189,
            "created_utc": 1623577077.0,
            "replies": [
                {
                    "body": "the last twist also made me lose it :'( really shows the \"real\" LKS instead of the character that he plays on the show",
                    "author": "oldDotredditisbetter",
                    "id": "h1o7u6o",
                    "parent_id": "t1_h1ltvuz",
                    "score": 94,
                    "created_utc": 1623625470.0,
                    "replies": []
                },
                {
                    "body": "same same and same. literally watched this as a child and now as a college student i'm still watching it. i just love all of the members and kwang soo has such a big heart. my heart is sad",
                    "author": "tinyglow",
                    "id": "h1p8d7s",
                    "parent_id": "t1_h1ltvuz",
                    "score": 25,
                    "created_utc": 1623647807.0,
                    "replies": []
                },
                {
                    "body": "I had to pause to cry when they revealed Kwangsoo's hidden mission. I'm gonna miss him on Running man so much! :(",
                    "author": "mong_byun",
                    "id": "h1oahnk",
                    "parent_id": "t1_h1ltvuz",
                    "score": 39,
                    "created_utc": 1623626966.0,
                    "replies": []
                },
                {
                    "body": "Lee Kwang Soo really is superr kind. The fact they also gifted him a book of messages from all the crew/staff also says a lot about the kind of person he is. \\*Cries more in the corner\\*",
                    "author": "christinetwwang",
                    "id": "h1uxgbo",
                    "parent_id": "t1_h1ltvuz",
                    "score": 18,
                    "created_utc": 1623771640.0,
                    "replies": []
                },
                {
                    "body": "I started watching RM when i was in high school till now. I watched RM because it was one of the variety show(the other one was Family Outing) that can relieved me from stress.",
                    "author": "popoapoooo",
                    "id": "h1o7s6r",
                    "parent_id": "t1_h1ltvuz",
                    "score": 30,
                    "created_utc": 1623625439.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Props to Bo Pil and the editing team for this episode. Recognizing it as a particularly touching episode, he turned the emotional level all the way to eleven, while still retaining RM's variety style by using Kwang Soo's gift as a double hidden mission. \n\nContrary to what I expected, the episode hit right in the feels from the beginning and maintained a somber yet entertaining atmosphere from start to the end. Highlighting Kwang Soo's sincerity and love for the members, wanting to go to the places where they made good memories, the food they love, the music they enjoyed and the gifts that they would cherish, it goes to show how much attachment there is between the members in the show. (Honestly, it should have clicked when we saw the bedding set among the gifts. Why would there be a bedding set given to Kwang Soo?) This is reciprocated in Jaesuk's slightly longer look at him as he said \"Thanks to you, I never felt bored shooting this show\" and JongKook's intense drawing as his dongsaeng read out his letter. \n\nThe use of flashbacks to so many popular episodes and so many songs used made ep 559 a legendary walk back through memory lane, a tribute to Kwang Soo's dedication. We will miss him, and we look forward to the days when he promotes his movies on the show, or comes back for fun.",
            "author": "Alanshock5",
            "id": "h1pazls",
            "parent_id": "t3_nysbqf",
            "score": 93,
            "created_utc": 1623649863.0,
            "replies": []
        },
        {
            "body": "Yoo Jae Suk man... guy really is the nation's mc for a reason. Got Kwang Soo to shed the first tears of the ep by remembering his dad's name.",
            "author": "GenericBiddleMusic",
            "id": "h1m55hk",
            "parent_id": "t3_nysbqf",
            "score": 146,
            "created_utc": 1623586390.0,
            "replies": [
                {
                    "body": "By this simple move, Yoo Jae-Suk just show all his consideration.",
                    "author": "spyon80",
                    "id": "h1z6tpn",
                    "parent_id": "t1_h1m55hk",
                    "score": 12,
                    "created_utc": 1623856882.0,
                    "replies": []
                },
                {
                    "body": "ugly laugh cried when someone mentioned “this isn’t the time to cry yet” 🤣😭",
                    "author": "dnthnglldyvrydy",
                    "id": "h2aommd",
                    "parent_id": "t1_h1m55hk",
                    "score": 6,
                    "created_utc": 1624081129.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When Haha said: “You’re so hardworking, I think that’s what made the fans upset that you’re leaving.” 👁💧👄💧👁 my eyes became a waterfall.",
            "author": "_julessss5",
            "id": "h1oy4xv",
            "parent_id": "t3_nysbqf",
            "score": 75,
            "created_utc": 1623640660.0,
            "replies": []
        },
        {
            "body": "It was a really good sendoff, so many moments to hit you right in the feelings. KJK's letter was especially touching to me but I think YJS put it best with the last line of his. \"It wasn't boring because of you.\", LKS brought so much laughter to the show. The twist at the end was absolutely perfect.",
            "author": "HoldOrFold",
            "id": "h1orafk",
            "parent_id": "t3_nysbqf",
            "score": 54,
            "created_utc": 1623636526.0,
            "replies": []
        },
        {
            "body": "\"Kwang-soo ya.\"  \n\"Ye hyung.\"\n\nI swear that's the beauty of Korean varieties. The moment you were enjoying the episode the feels come through, and then when tears start to form in your eyes a sudden funny moment comes up and you end up laughing/crying.\n\nMan, sometimes I really wish that RM sentence to imprisonment for LKS can be a real thing so that he won't have to leave.\n\nKwang-soo ya, it's been fun watching you. \"Thanks to you, the show has never been boring.\"",
            "author": "abandonedacc9",
            "id": "h1mhlbu",
            "parent_id": "t3_nysbqf",
            "score": 96,
            "created_utc": 1623594096.0,
            "replies": [
                {
                    "body": "When you can hear the words you read. \n\nThis was in that episode where yjs and gary made fun of kwangsoo who was role playing the school Jang.",
                    "author": "hunmingnoisehdb",
                    "id": "h1tsvx2",
                    "parent_id": "t1_h1mhlbu",
                    "score": 9,
                    "created_utc": 1623745479.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If the Prince of Asia cries the whole Asia cries",
            "author": "EmploymentOk6815",
            "id": "h1mxwya",
            "parent_id": "t3_nysbqf",
            "score": 95,
            "created_utc": 1623602516.0,
            "replies": []
        },
        {
            "body": "That last segment was painful to watch, I'm crying so much. That twist was so wholesome and heart-warming, I didn't expect that at all.\n\nI watch a lot of kvariety and members come and go all the time but there's something really special about RM. It's not common to see a core cast of 10+ years. Every member of RM is so valuable and made RM what it is today.\n\nI always thought Kwangsoo would be one of the members who stayed until the last episode of RM but here we are... Kwangsoo has been so loyal to RM and always puts his best effort to entertain. He has brought so much laughter over the years and he'll be missed. Thank you Kwangsoo!!",
            "author": "goldy_lee",
            "id": "h1mpkg8",
            "parent_id": "t3_nysbqf",
            "score": 131,
            "created_utc": 1623598340.0,
            "replies": [
                {
                    "body": "I cant say this enough but RM members really held it together as a cast even after 11 years. Never getting into bad scandals just real great role models out there.",
                    "author": "wontaks",
                    "id": "h1pef55",
                    "parent_id": "t1_h1mpkg8",
                    "score": 61,
                    "created_utc": 1623652778.0,
                    "replies": [
                        {
                            "body": "I remember majority of them saying that is all thanks to YJS mentoring of them in the early years of RMing and making sure everyone stays clear of getting into scandals or negative publicity.",
                            "author": "I_am_Bruce_Wayne",
                            "id": "h1qy8yf",
                            "parent_id": "t1_h1pef55",
                            "score": 27,
                            "created_utc": 1623689422.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Only RM had the OG cast for 10 years, other VS have different season. Some had left but really respect to the 6 members. They didnt take a break really.",
                    "author": "Efficient-Aside-8919",
                    "id": "h1o1omn",
                    "parent_id": "t1_h1mpkg8",
                    "score": 50,
                    "created_utc": 1623622086.0,
                    "replies": [
                        {
                            "body": "Not just Rm lol. IC has that too.",
                            "author": null,
                            "id": "h1pkq7s",
                            "parent_id": "t1_h1o1omn",
                            "score": 3,
                            "created_utc": 1623658623.0,
                            "replies": [
                                {
                                    "body": "O\nI know IC but they had many cast changes too.. RM jist added 2 members, the other 2 left barely 1 yr of the show. i did emphasize 6 stayed make it 7 Kwang Soo almost made it to 11 years...",
                                    "author": "Efficient-Aside-8919",
                                    "id": "h1pxv2t",
                                    "parent_id": "t1_h1pkq7s",
                                    "score": 11,
                                    "created_utc": 1623670717.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I have the same thought too, i thought he and a few others like YJS will stay until the end. Too bad, life doesn't go like how we want. Will miss him for sure.",
                    "author": "luckypanda95",
                    "id": "h1p7ozq",
                    "parent_id": "t1_h1mpkg8",
                    "score": 19,
                    "created_utc": 1623647288.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've just watched this episode together with my relatives and friends who also loves watching the show. All of us ended up crying as Kwangsoo is our favorite member. \n\nMe and Yang Sechan are pretty much the same while watching the episode. I've tried to brighten up the mood by telling a lot of jokes and laughing so loud while watching, but in the end I am the one who cried the hardest among us.\n\nRunning Man made me cry hard six times now. The first time was during the time when they crossed the Han River using a boat made from box during the PD vs Members episode. The second time was when they've got a heart to heart talk with each other during Episode 295. The third time was when Gary left. The fourth time was during the first episodes of Member's Week as Running Man's future in that episodes are in question. The fifth time was during the 9th Anniversary Fan Meeting. And then this...\n\nStill looking forward to the future of the show. Also looking forward to the success of Lee Kwangsoo's career. Runners! We could get through to all of this!!! \n\n런닝맨 화이팅!!!♡♡♡♡♡♡♡♡",
            "author": "Sw4nSea",
            "id": "h1phccl",
            "parent_id": "t3_nysbqf",
            "score": 49,
            "created_utc": 1623655362.0,
            "replies": []
        },
        {
            "body": "Getting the pirate roulette on the first try is peak Kwangsoo behavior LOL…truly blessed by the variety gods till the very end",
            "author": "dnlwang678",
            "id": "h1ojger",
            "parent_id": "t3_nysbqf",
            "score": 81,
            "created_utc": 1623632068.0,
            "replies": []
        },
        {
            "body": "Holy sheet. I did not expect ysc to be such an emotional person. All i always see is his gums. I was fine not crying, until he cries. \n\nSuch an emotional episode. Gary leaving was emotional, but this hits me on a different level. The level of sadness and emotions going through my mind is hard to explain.\n\nI wish lks all the very best. As for RM, you will always be my favourite show and i will continue watching and supporting regardless what others say. Fans or members, Once a runningman always a runningman.\n\nLet us continue supporting RM and Lks by commenting positively on IG, reddit and YouTube. We feel sad about losing Lks. Can you imagine how the members that spend all the time together with lks feels. They are basically Family. Let us support them to the very end.",
            "author": "Mamakling94",
            "id": "h1m3h80",
            "parent_id": "t3_nysbqf",
            "score": 141,
            "created_utc": 1623585275.0,
            "replies": [
                {
                    "body": "Yeah… I was rly sad when Gary left esp when his “나란 노믄…” kicked in… but this was sooo diff. From the beginning of the show… tearing up to bawling during the letter reading. Aish.",
                    "author": "MusicBytes",
                    "id": "h1olnsf",
                    "parent_id": "t1_h1m3h80",
                    "score": 21,
                    "created_utc": 1623633342.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unniesoveroppas on Twitter was kind enough to translate the full letters from the members: https://twitter.com/unniesoveroppas/status/1404013533424091136?s=21",
            "author": "amelisa28",
            "id": "h1mjmw3",
            "parent_id": "t3_nysbqf",
            "score": 65,
            "created_utc": 1623595219.0,
            "replies": [
                {
                    "body": "It's surreal to me to think that these people have spent every single week together for over a decade, and how sobering it must be to them all to realize that one of them won't be there next week. Let alone how sad Kwang Soo must be and how hard it must have been to make the decision",
                    "author": "AnvilPro",
                    "id": "h1nzpk4",
                    "parent_id": "t1_h1mjmw3",
                    "score": 53,
                    "created_utc": 1623621044.0,
                    "replies": []
                },
                {
                    "body": "Guess who is ugly crying while reading the letters...😭",
                    "author": "glassesinglamour",
                    "id": "h1mm1g3",
                    "parent_id": "t1_h1mjmw3",
                    "score": 14,
                    "created_utc": 1623596487.0,
                    "replies": [
                        {
                            "body": "[this person is](https://old.reddit.com/user/me/)",
                            "author": "oldDotredditisbetter",
                            "id": "h1o81ju",
                            "parent_id": "t1_h1mm1g3",
                            "score": 26,
                            "created_utc": 1623625585.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "As a JSM fan, I noticed that the letter sounds kind of generic. It doesn’t look like their friendship ever recovered and I’m super sad about it.",
                    "author": "GG-Duo",
                    "id": "h1npf4v",
                    "parent_id": "t1_h1mjmw3",
                    "score": -22,
                    "created_utc": 1623615937.0,
                    "replies": [
                        {
                            "body": "that's just the letter they wrote on air, we don't know what kind of letter they wrote offair",
                            "author": "oldDotredditisbetter",
                            "id": "h1o830t",
                            "parent_id": "t1_h1npf4v",
                            "score": 24,
                            "created_utc": 1623625608.0,
                            "replies": []
                        },
                        {
                            "body": "Idk why you’re being downvoted for your observation. Anyone who paid attention closely to them saw their chemistry/friendship dwindle and never recover to what it once was. \n\nSomin and Kwangsoo are my favs btw. It is sad to see what happened to their relationship.",
                            "author": "No-Requirement-6762",
                            "id": "h1oretc",
                            "parent_id": "t1_h1npf4v",
                            "score": 14,
                            "created_utc": 1623636596.0,
                            "replies": [
                                {
                                    "body": "what happened to their relationship?",
                                    "author": "Turbulent-Machine-59",
                                    "id": "h2360vk",
                                    "parent_id": "t1_h1oretc",
                                    "score": 2,
                                    "created_utc": 1623937045.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I doubt he would offer Dom Pérignon champagne to someone who he is not close with, and these last few episode we have seen them interacting more..",
                            "author": "LittlePumpkin03",
                            "id": "h1ohpk9",
                            "parent_id": "t1_h1npf4v",
                            "score": 9,
                            "created_utc": 1623631064.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Idk why… but kim jong kook’s letter broke me",
            "author": "MusicBytes",
            "id": "h1oma4p",
            "parent_id": "t3_nysbqf",
            "score": 62,
            "created_utc": 1623633703.0,
            "replies": [
                {
                    "body": "I do think KJK letter feel relatable for most of us. We think LKS will be there at the end of the show but it goes otherwise",
                    "author": "zxyqm",
                    "id": "h1oulxv",
                    "parent_id": "t1_h1oma4p",
                    "score": 44,
                    "created_utc": 1623638464.0,
                    "replies": []
                },
                {
                    "body": "Same 😓 You can tell how much he means to him",
                    "author": "curvvyQ",
                    "id": "h1oodrx",
                    "parent_id": "t1_h1oma4p",
                    "score": 9,
                    "created_utc": 1623634920.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just a beautiful episode and a perfect send-off for Kwang Soo.\n\nI was tearing up throughout the whole episode until they panned onto Se Chan during the letter reading. I absolutely bawled my eyes out. You could tell that LKS was YSC and JSM's rock on the show. \n\nMy only regret - and I hate to address this - was the dwindling interactions between JSM and LKS. I'm not sure what happened but I hope that they are OK behind the scenes and are on good terms especially after LKS's departure.\n\nThe gifts from LKS was a beautiful twist for the episode - talk about stabbing me with a knife and then twisting it.\n\nLastly, LKS has a free pass to Running Man! I have a feeling he will be back to visit sooner rather than later. Maybe for their 11th anniversary? Maybe for his birthday? Whenever that is - I'm just glad that the door is open for him to return even if it's just a visit.\n\nIt's going to be strange and weird at first without LKS but let's continue to support the show the way we have after all these years.",
            "author": "kbx24",
            "id": "h1od3q8",
            "parent_id": "t3_nysbqf",
            "score": 84,
            "created_utc": 1623628460.0,
            "replies": [
                {
                    "body": "Kwangsoo was such a good hyung to welcome Somin & Sechan onto the show. He was the leader of the maknae group and I think they were really close, hanging out often off-camera. I’m not sure what happened to Somin & Kwangsoo, but her letter was so short and simple... yet it seemed to have affected Kwangsoo so much emotionally. They both appeared to have a lot of feelings that I hope they can talk out, and maybe they have already by this point. I just hope they are ok bc their relationship was so sweet. Him hanging out with her brother, her dad being a fan of his. Obviously, we won’t know what happened but I take it as a good sign that she followed him again. The maknae group had a special bond and I hope they keep contact even if they’re not able to see each other every week anymore.",
                    "author": "thecampaignerinsight",
                    "id": "h1run1a",
                    "parent_id": "t1_h1od3q8",
                    "score": 23,
                    "created_utc": 1623704050.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I teared up so much throughout the entire episode. Thank you to the production crew for giving him such a proper farewell episode. Lee Kwang Soo is truly a gem. I think it really shows a lot about how much he is loved by everyone, from the cast members’ reactions, to the production crew’s gifts and messages, to the comments from celebrities’ who have previously guested. \n\nA huge part of me still hope it isn’t forever goodbye. I was sad when Gary left, but this is a whole new level. I feel like I won’t ever be able to recover from this. :-(\n\n(The preview for the next ep already look so strange without him in it 😭)",
            "author": "iwantaspudgun",
            "id": "h1pczdx",
            "parent_id": "t3_nysbqf",
            "score": 30,
            "created_utc": 1623651526.0,
            "replies": []
        },
        {
            "body": "I’m in emotional mess. That last KJK look at him before stepping out of the bus really got me. It’s 8am here and i don’t even want to start my day. \n\nThank you Kwang Soo. It has been only a year i started watching RM, but this hurts. A lot. You make me fall in love with RM.",
            "author": "fwindraya",
            "id": "h1pcwyu",
            "parent_id": "t3_nysbqf",
            "score": 30,
            "created_utc": 1623651470.0,
            "replies": []
        },
        {
            "body": "Se chan though. 😢",
            "author": "jay_ian",
            "id": "h1psi5w",
            "parent_id": "t3_nysbqf",
            "score": 24,
            "created_utc": 1623666286.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h1orcfp",
            "parent_id": "t3_nysbqf",
            "score": 47,
            "created_utc": 1623636558.0,
            "replies": [
                {
                    "body": "LKS was known for being cheap lol (never offers to pay when eating together) hence this gesture means a lot. \n\nAnd the hidden photo tally mission wrecks me. He's playing a game inside a game inside a game when everyone should be relaxing.",
                    "author": "Kuuganism",
                    "id": "h1t2a9l",
                    "parent_id": "t1_h1orcfp",
                    "score": 8,
                    "created_utc": 1623725620.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sigh all things will inevitably come to an end, and unfortunately this came earlier than everyone expected. I was feeling really sad throughout but when they played the montages I lost it :( \n\nOk but bopil's skit of suk jin leaving got me laughing",
            "author": "k1mcheee",
            "id": "h1p4z2h",
            "parent_id": "t3_nysbqf",
            "score": 23,
            "created_utc": 1623645273.0,
            "replies": []
        },
        {
            "body": "I'm a mess tonight. I held it in throughout the episode, so touched by Kwang Soo's openness and the member's jokes which gave it a certain lightness.  The rolling papers were too much. The first couple of letters were a little lighter, but I cracked with Jong Kook's letter. I'm so sad to see him go, but I know that we have to let him go to even greater heights. He's been with me through the rough and tough periods always doing his best and making us laugh. \n\nAnd then like a masochistic idiot, I watched Grave of the Fireflies after it. I'm completely wiped tonight",
            "author": "Benzener",
            "id": "h1pgxv4",
            "parent_id": "t3_nysbqf",
            "score": 21,
            "created_utc": 1623654996.0,
            "replies": []
        },
        {
            "body": "damn. Where do I even start? This episode was a ride. Couldn’t have asked for a better last episode for our beloved girin! Kudos to Bo Pil and the rest of the RM staff! Loved how a few episodes back with the 90s theme we we’re all feeling nostalgic and some felt that it would have been a great finale to running man if ever and then here we are with Kwangsoo requesting that they shoot at that same location again. Dang :((( Just goes to show that although that wasn’t one of the funniest episodes for me this year, we know that they actually really enjoyed that concept and that whole episode.\n\nSo many heartwarming and funny moments for this episode. Enjoyed and loved the whole concept of the episode. Also bawled my eyes out whenever the members start being sad 😭 Dang you HAHA, I think he was the first one who made a sad remark that’s why I was already crying on the first 30 minutes or so 😂\n\nCan I just say how much I love Bo Pil, loved it when all the members pranked Sukjin when he was sleeping? I like it when he joins the members’ banters.  \n\nAlso, this episode made me appreciate each members and what they bring to the show and the viewers. Loved that they really became a family (as well as the staff). \n\nYSC made me bawl my eyes out so much in the last location. Can’t believe that he’s the one who’ll make me cry when he’s usually one of the members who make me laugh. You really can see that (although they all are close friends and family already) he’s really one of kwangsoo’s closest friends in the members. \n\nI don’t doubt that LKS’ spirit will still remain in running man especially when his students, YSC and Somin will continue with his teachings in the future episodes! 😂\n\nAlso seeing Jihyo cry again after a member leaves just breaks my heart. My heart melted when she stayed and wrote another letter for kwang soo. Also loved KJK’s letter. He really has a soft heart but he just doesn’t like to show it. As well as JSM, HAHA, YJS, JSJ’s messages :(( I couldn’t help but bawl my eyes out. They really are a family now :((((((\n\nAND THAT TWIST!!! SO GOOD! RUNNING MAN NEVER FAILS IN MAKING ME BE AMAZED BY THEIR GAMES, TWISTS, MISSIONS, etc. I’m so glad that I haven’t finished watching all 559 episodes because I can still look forward in seeing our giraffe when I watch the past episodes! \n\nFinally, to our Girin. Thank you! You’re one of the reasons that I really got hooked into watching RM. Thank you because you and the whole RM team, made me escape this pandemic we’re facing right now. We’ll always support you with whatever you’re going to do in the future! And as YSC so well put it, Enjoy doing all the things you like without thinking of punishments! I will also continue with supporting RM and the remaining members! \n\nPS. Hopefully we’ll still see you in RM as a guest (or even as a regular member again) soon! Good for the crew to give kwang soo that free pass gift 😂\n\nI still have a lot of things on my mind but for now, this would suffice I think. Sorry if this post is long but i just really need to let these feelings out 😭 And if you guys are still reading this, thanks for coming to my another TED talk 😂 I’d love to hear your messages for kwangsoo in the comment sections if you guys are able to drop it. =))",
            "author": "Extreme-Let6863",
            "id": "h1qkcq8",
            "parent_id": "t3_nysbqf",
            "score": 19,
            "created_utc": 1623683179.0,
            "replies": []
        },
        {
            "body": "I watched the episode live even if I barely know Korean, and I still ended up a crying mess. I don’t know when I’ll ever be ready to watch the subs for this, and I really wanted to see Kwang Soo in RM one last time. The Han River, the eggs, the pirate, the letters, the gifts, the pictures, the video montages, Jong Kook’s drawing, Bo Pil crying, Ji Hyo writing a letter again, that last piggy back ride, their last meal and car ride and bus ride with the eight of them together, his final slate, all their tears - all of it made me emotional.\n\nThank you for bringing us so much happiness, Kwang sooya. You did everyone proud.",
            "author": "lijiburr",
            "id": "h1lwk1s",
            "parent_id": "t3_nysbqf",
            "score": 59,
            "created_utc": 1623579602.0,
            "replies": [
                {
                    "body": "Exactly. Plus reading the translated letters made me a crying mess again. 😭😭",
                    "author": "SophiaJoanne",
                    "id": "h1oaz43",
                    "parent_id": "t1_h1lwk1s",
                    "score": 18,
                    "created_utc": 1623627245.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The only thing that I would really hope for is that... this won't be the last time we see Kwangsoo on the show. I hope we can still see him in the future as a special guest or on very special occasions and things like that. You'll truly be missed Lee Kwangsoo. Next week we'll definitely feel that space, a very big one at that. Let's hang in there for the members, they were the ones that really got hit hard all eight of them.",
            "author": "turtlelife21",
            "id": "h1pizr1",
            "parent_id": "t3_nysbqf",
            "score": 20,
            "created_utc": 1623656929.0,
            "replies": []
        },
        {
            "body": "This is such a beautiful episode. I'm amazed at the concept PD came up for this last episode. It started funny about freeing Kwangsoo. Haha\n\nThe whole concept is amazing. Most especially the twist at the last part. \n\nI will always support runningman. Too bad their concert didn't push through last year while they're still complete. If it pushes through next year, I hope they will have Kwangsoo as a special guest.",
            "author": "jdb2793",
            "id": "h1oy2mz",
            "parent_id": "t3_nysbqf",
            "score": 19,
            "created_utc": 1623640619.0,
            "replies": []
        },
        {
            "body": "I will always remember Kwang Soo as a polite gentleman. You can see this side of him in the recent going home special where he receives many coins for his polite behavior. Will miss you greatly. All the best KS!!",
            "author": "alfquan",
            "id": "h1ml78b",
            "parent_id": "t3_nysbqf",
            "score": 32,
            "created_utc": 1623596050.0,
            "replies": []
        },
        {
            "body": "So many things to say but what Jae Suk said really summarises it well.\n\nThank you, Kwang Soo. It wasn't boring because of you.\n\nHope only the best for whatever Kwang Soo does in the future, whatever the reasons for leaving Running Man. I will give my endless support to Running Man until its very last shoot.",
            "author": "ChilliWithFries",
            "id": "h1pqmmw",
            "parent_id": "t3_nysbqf",
            "score": 16,
            "created_utc": 1623664540.0,
            "replies": []
        },
        {
            "body": "I cried during the letter readings. Sechan was def wrecked. I was surprised",
            "author": "bob_the_builder13",
            "id": "h1oaz0d",
            "parent_id": "t3_nysbqf",
            "score": 30,
            "created_utc": 1623627244.0,
            "replies": []
        },
        {
            "body": "You can see all the effort the the grand winners put to try to keep the mood light and while they held themselves well the youngest three ( ji hyo is now the third youngest) really let the tears go. \n\nSe chan really surprised me and the girls held on better then I thought they would. \n\nKwangsoo, we will miss you",
            "author": "Economy-Middle-9700",
            "id": "h1oxuch",
            "parent_id": "t3_nysbqf",
            "score": 30,
            "created_utc": 1623640472.0,
            "replies": []
        },
        {
            "body": "I started watching 10 years ago when I was 12 and they’ve been with me throughout high school, college, and now they’ll see me off to graduate school. \n\nThank you so much, my special brothers and sisters.",
            "author": "thisisnotananon",
            "id": "h1nu96m",
            "parent_id": "t3_nysbqf",
            "score": 29,
            "created_utc": 1623618280.0,
            "replies": []
        },
        {
            "body": "Surprisingly, the letters of the members near the end were quite simple but still, my eyes were swelling from all the tears. They wrote letters but they spoke more with words that weren't said. The way they were trying to hold back the tears. The way they were trying to lighten the mood. Even at one of their saddest moments, they're trying to make us laugh. As a long time viewer, it was hard watching this but I couldn't even imagine how the staff and members are feeling. That last reveal with the presents was extremely heartwarming too. Everybody thanks you. You've done a good job. He doesn't even know us but he feels like a close brother and a friend. Live a happy and healthy life Kwang Soo!",
            "author": "its-me-dave",
            "id": "h1oaxw9",
            "parent_id": "t3_nysbqf",
            "score": 30,
            "created_utc": 1623627226.0,
            "replies": []
        },
        {
            "body": "I’ve been watching the show since it aired its very first ep and have to admit I used to not like Kwangsoo because I used to think he was very attention-seeking and didn’t understand why he purposely established his character to be slapstick humour, cheating and betraying. He just wasn’t my style. I disliked him so much that I watch almost every ep except the ones that were him-focused. But that was me being young and immature. Over the years I realised how important every member is and the roles they play contribute a lot of synergy to the show. I saw how much heart and soul he put into each ep, and how he brings out the laughter at the expense of himself and is often one of the most popular among guests because he takes care of others well and they can feel comfortable. \n\nBut I still didn’t expect to feel so sad when the news of him leaving came out but I did. And I cried so much more in this episode than I thought I would. It’s just like KJK said, I really thought he would be there till the end. \n\nThe episode was so well designed, from the framing of all his offenses to remind us of what he did for the show, to the film photography hidden missions as a great excuse for all of them to unashamedly keep being close and taking as many pictures together in the name of the mission but really to get nice photos at the end! Felt both super meaningful and still very RM. And of course, just by allowing them to spend time together, doing what they had done before one more time. Even the boiled egg and pirate roulette was so apt. I love how he finally got 5/7 boiled eggs only when it didn’t matter at all, and the pirate jumping out to remind us one last time LKS is adored by the variety god.\n\nSeeing some of the members struggling to hold back their tears was just as sad as the ones who did cry, because you can see just how much they cherished one another’s presence all these years. Each letter was simple yet heartfelt, even though it’s quite impossible to encompass all their feelings in a simple letter. That’s why i really liked how they showed Jihyo couldn’t articulate her true feelings properly made sure to stay back till she could write another one, cause it’s so real. And of course he loves them so much too. That last twist really sealed the deal, he wanted to give and not receive, and he really did. Not just thoughtfully choosing the right gift for each, but also spending the entire recording looking out for each member and giving them as much equal attention as he could. \n\nThere were so many great flashbacks in this episode, yet because there has been so so many epic memories it is impossible to showcase them all. I loved the last highlight reel where they included not just the obviously funny and unlucky moments he is more known for, but the little caring moments where he looked out for others and cheered on others. \n\nPeople may think it’s just a show, why are we all crying so much over it, but Running Man has been our youth, our joy, and our beloved entertainment for 11 years, they’re a part of our lives. And it wouldn’t have been this Running Man we know and love without Lee Kwang Soo. Thank you for running, our Giraffe.",
            "author": "mangoberrymango",
            "id": "h1qqjjf",
            "parent_id": "t3_nysbqf",
            "score": 14,
            "created_utc": 1623685997.0,
            "replies": []
        },
        {
            "body": "I couldn’t stop crying. I was laughing and then sobbing. Se Chan cried so much. He’s a comedian and he couldn’t even laugh at his own jokes. I lost it when he started to burst in tears and put his head on the table, then so min too and then Ji hyo😭😭😭  You can tell that Kwang Soo bonded well with new members So Min Se Chan. He was their rock and a supporter. He was their leader. :( Kwang Soo, you will never be forgotten.",
            "author": "neriz01",
            "id": "h1oqmb2",
            "parent_id": "t3_nysbqf",
            "score": 37,
            "created_utc": 1623636140.0,
            "replies": [
                {
                    "body": "He really love his hyung right..",
                    "author": "Mraihan1997",
                    "id": "h1p9smr",
                    "parent_id": "t1_h1oqmb2",
                    "score": 8,
                    "created_utc": 1623648918.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have been watching Running Man since ep 1. And this show has kept me sane and happy most especially I have been away from family due to working overseas. And for 11 years, I have thoroughly enjoyed the show mostly to Kwangsoo. I’m such a wreck after this episode. But as a fan, I have appreciated what he has done and those RM letters prove that he really gave his all for the show. I truly wish him the best. It won’t be the same without him.",
            "author": "mrbrightside_17",
            "id": "h1nu2ee",
            "parent_id": "t3_nysbqf",
            "score": 28,
            "created_utc": 1623618184.0,
            "replies": []
        },
        {
            "body": "I just hope the kwangsoo still in contact with the members after this. Invite them to his wedding (maybe around the corner). Hangout together.\n\nEven at the show, they still can freely joke about him, call him, or even invite/cast him spontaneously (like how they use to invite lee sang yeob). \n\nCmon, jaesuk doesn't fulfill his promise to show us his 30000 trick towards kwangsoo",
            "author": "Important-Turnover65",
            "id": "h1q0qf0",
            "parent_id": "t3_nysbqf",
            "score": 11,
            "created_utc": 1623672735.0,
            "replies": []
        },
        {
            "body": "I've been watching since I was in middle school and now I'm in college. Kwangsoo has given us so much laughter over the years. I'm so happy to have been a fan of his and will continue to be a fan of Running Man and it's members till the absolute end. Thank you Kwangsoo.",
            "author": null,
            "id": "h1nr74h",
            "parent_id": "t3_nysbqf",
            "score": 22,
            "created_utc": 1623616789.0,
            "replies": []
        },
        {
            "body": "I didn't know that i will cry like this, but i couldn't help\n\nits such sad moments to watch how talent members like lks leave the show\n\nso sad",
            "author": "3lmy3lmk",
            "id": "h1lwggu",
            "parent_id": "t3_nysbqf",
            "score": 20,
            "created_utc": 1623579514.0,
            "replies": []
        },
        {
            "body": "I endured so hard all the way but of all people, seeing bloody Suk Jin get all choked up after the twist made me fucking lose it. Se Chan didn't do any favors either.\n\nI watched RM because of Kwang Soo and I'm devastated that he's gone now but RM will forever be a part of my life thanks to him. It's gotten me through a lot of hard times especially the last few years and I'll keep supporting the show and the members for as long as it takes.\n\nAnnyeong Girin!!!",
            "author": "yogabbagarbage",
            "id": "h1q7a3o",
            "parent_id": "t3_nysbqf",
            "score": 10,
            "created_utc": 1623676726.0,
            "replies": []
        },
        {
            "body": "Jihyos longer letter to kwangsoo translation :\n\nhttps://twitter.com/unniesoveroppas/status/1404036969634533378/photo/1",
            "author": "Denethorsmukbang",
            "id": "h1oljob",
            "parent_id": "t3_nysbqf",
            "score": 19,
            "created_utc": 1623633276.0,
            "replies": []
        },
        {
            "body": "I have to take this shit like a man but my brain keeps refusing what has happened this episode. Im calling in sick at work tomorrow.",
            "author": "looooolmonster",
            "id": "h1o42xe",
            "parent_id": "t3_nysbqf",
            "score": 18,
            "created_utc": 1623623391.0,
            "replies": []
        },
        {
            "body": "I think everyone has made clear how sad/touching this episode, I really crying from the start. I want to give credit to Bo Pil PD, this episode concept is really great, I do feel they did a great job to convey what LKS wants in his last episode (as a member). Gary last episode was good, but this was beyond that, hart warming, funny, and full of tears.\n\nAgain, thank you Lee Kwang Soo for these 11 years, growing up watching Running Man since in middle school, and now I already working it's really great time. I will always watch Running Man",
            "author": "zxyqm",
            "id": "h1oodl5",
            "parent_id": "t3_nysbqf",
            "score": 18,
            "created_utc": 1623634917.0,
            "replies": []
        },
        {
            "body": "I hope he keeps in touch with RM members especially Se Chan who still wants to call him every week.\n\nKwang Soo carried the show on his back all these years and I hope the other members will still have fun and carry on. He will be sorely missed.",
            "author": "knawmeen",
            "id": "h1qf7y7",
            "parent_id": "t3_nysbqf",
            "score": 8,
            "created_utc": 1623680770.0,
            "replies": []
        },
        {
            "body": "I was watching RM since the beggining, knowing he was going to leave is making it harder, there's an early episode, where they say at the beggining that he can't be in this episode cause he is filming something, and near the end of the episode he just appears banging on the glass door so they let him in, even if it's late. \n\nI lost it, the memebers all said he didn't have to be there and that he must be tired and he sayd later \"I thought they were going to be happy\"",
            "author": "pooploserbq",
            "id": "h1qvxle",
            "parent_id": "t3_nysbqf",
            "score": 9,
            "created_utc": 1623688415.0,
            "replies": [
                {
                    "body": "I remembered that episode. You can see how dedicated he is at the start. He didn’t have to come but he did after his filming. It was funny, the members were so nonchalant about him coming back, it upsets him haha",
                    "author": "echofades",
                    "id": "h1stcnu",
                    "parent_id": "t1_h1qvxle",
                    "score": 4,
                    "created_utc": 1623720914.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The episode was not just a goodbye episode but they really did send him off in the warmest way possible. I can feel how they wish him the best in life after Running man. \nIt was very heartwarming. I cried my eyes out but I had a strange feeling while watching, the episode was sad but it was very touching. THANK YOU KWANGSOO♥️ WISH YOU ALL THE BEST IN LIFE✨\n\nYang Sechan crying so much 😭",
            "author": "mysssh",
            "id": "h1oj8le",
            "parent_id": "t3_nysbqf",
            "score": 16,
            "created_utc": 1623631942.0,
            "replies": []
        },
        {
            "body": "i just felt sad. thats all i felt",
            "author": "shadowmushroom12",
            "id": "h1p0fto",
            "parent_id": "t3_nysbqf",
            "score": 8,
            "created_utc": 1623642132.0,
            "replies": []
        },
        {
            "body": "All the messages were so nice. KJK saying that he thought Kwang Soo would be there til the end really hit home, and I imagine lots of people felt the same. JSJ mentiong Feel Touch Cross was such a wonderfully touching moment too. The other members laughed but you could tell LKS understood just how much that partnership meant to JSJ. Episodes like this truly show just how much of a family the Running Man cast are.",
            "author": "Chell_the_assassin",
            "id": "h1ric3g",
            "parent_id": "t3_nysbqf",
            "score": 8,
            "created_utc": 1623698442.0,
            "replies": []
        },
        {
            "body": "***SOBBING ALL THE WAY THROUGH***  \n\nIF YOU'RE HERE BEFORE WATCHING, GET YOUR TISSUES READY.",
            "author": "SpoonAtAGunFight",
            "id": "h1o5nub",
            "parent_id": "t3_nysbqf",
            "score": 15,
            "created_utc": 1623624268.0,
            "replies": []
        },
        {
            "body": "I am swollen. I am wet. I have not stopped crying since the first twenty seconds of the episode  until the very last scene and still am crying right now. \n\nI want to write a heartfelt response of appreciation as I usually do, but my heart is in pain and my eyes are currently dry LOL. In short, I love you Kwang Soo. You've brought the very best out of the cast members you grew with over the past eleven years, and you have been a very bright light to all the viewers including myself. You will be missed and will always be loved. Hwaiting oppa <3",
            "author": "rullyawesome",
            "id": "h1ox21z",
            "parent_id": "t3_nysbqf",
            "score": 8,
            "created_utc": 1623639970.0,
            "replies": []
        },
        {
            "body": "This episode really took me on the emotional rollercoaster.\nRunning Man has always lifted up my spirits from the Monday Blues, and LKS never fails to do so with his fun betrayal, \"luck\" and things you may never expect..\nSigh, gonna take me a while to recover, but what an episode :)",
            "author": "DatKian",
            "id": "h1nw0uw",
            "parent_id": "t3_nysbqf",
            "score": 12,
            "created_utc": 1623619173.0,
            "replies": []
        },
        {
            "body": "all the best for kwang soo future journey :) sad episode, but at the same time happy for whatever his decision is to make him happier/better.",
            "author": "rosesarenotred00",
            "id": "h1lyznr",
            "parent_id": "t3_nysbqf",
            "score": 11,
            "created_utc": 1623581806.0,
            "replies": []
        },
        {
            "body": "Thank you for 11 years lee kwang soo, you the best comedian in RM.",
            "author": "dark_evolver",
            "id": "h1lzs2t",
            "parent_id": "t3_nysbqf",
            "score": 11,
            "created_utc": 1623582495.0,
            "replies": []
        },
        {
            "body": "I will miss kwangsoo on running man and how yjs always teased or cut him off :( but not everything lasts forever, I hope kwangsoo to walk on the flower road!",
            "author": "lalaby21",
            "id": "h1mfzrn",
            "parent_id": "t3_nysbqf",
            "score": 12,
            "created_utc": 1623593233.0,
            "replies": []
        },
        {
            "body": "goddamn seeing the next episode preview hit me hard that he won't be there next week",
            "author": "LoveTheLigjt",
            "id": "h1o3pcw",
            "parent_id": "t3_nysbqf",
            "score": 11,
            "created_utc": 1623623180.0,
            "replies": []
        },
        {
            "body": "I feel like it's the end of an era! I always look forward to watching running man every week and it's going to be crazy not having Kwang Soo there. :( It's hard for me to describe how much I'm going to miss him. \n\nI really loved this episode - it took me down memory lane and the plot twist at the end was so wholesome. Their letters at the end got me in tears. I was really surprised to see Yang Se Chan get so emotional. It made me realize how much Kwang Soo meant to maknae line <3 \n\nKwang Soo, I wish you the best!  I hope all your dreams come true. Keep shining! <3 I'll keep supporting running man every week but I will definitely miss you.",
            "author": "belugawhales08",
            "id": "h1ofkyz",
            "parent_id": "t3_nysbqf",
            "score": 11,
            "created_utc": 1623629864.0,
            "replies": []
        },
        {
            "body": "\"Thank You Kwang Soo, it wasn't boring because of you\" -YJS \n\nIndeed, this past years is so fun and 1 of the reason is you. \n\nThank You for all the laughter you gave us. \n\nAnd Good Luck on the next chapter of your life. \n\nLee Kwang Soo, Fighting!\n\nRunning Man, Fighting!",
            "author": "K2_Kimjeha",
            "id": "h1qlv2e",
            "parent_id": "t3_nysbqf",
            "score": 6,
            "created_utc": 1623683886.0,
            "replies": []
        },
        {
            "body": "Kwang-soo betrayer was only ever a character he played.  This last episode I think showed his true colors.  He picked places he thought the others enjoyed, food they liked, and in the end worked hard all day long to ensure they could get prizes.  The surprise secret mission broke my heart.  He bought those gifts with each of the members in his heart.  Thank you Kwang-soo for always making me laugh.",
            "author": "bookwyrms-hoard",
            "id": "h1rml4r",
            "parent_id": "t3_nysbqf",
            "score": 5,
            "created_utc": 1623700354.0,
            "replies": []
        },
        {
            "body": "I don't usually tear up, but this did it for me. Ever since I started watching Running Man 10 years ago, Kwangsoo was easily my favorite member. He would always go above and beyond to be funny even though he knows it'll ruin his actor image. I particularly lost it when I saw how hard it hit Sechan. I associate Sechan with a constant smiling face with gums out, but to see him being this affected really caught me off guard. It made me become a fan of Sechan since he knows how good a person Kwangsoo is. I always thought Kwangsoo would be the one to take over Jaesuk's role and mentor the next gen cast of Running Man, but his heart was set on something else and I can respect that. Thank you for the countless laughs over the years!",
            "author": "JaeGuk",
            "id": "h1to50i",
            "parent_id": "t3_nysbqf",
            "score": 6,
            "created_utc": 1623740946.0,
            "replies": []
        },
        {
            "body": "Our watermark-free English hardsubbed video for episode 559 is now available: https://www.myrunningman.com/ep/559\n\n*(note: we recommend [Brave Browser](https://laptop-updates.brave.com/download/MYR379) or uBlock Origin ([Chrome](https://chrome.google.com/webstore/detail/ublock-origin/cjpalhdlnbpafiamejdnhcphjbkeiagm) / [Firefox](https://addons.mozilla.org/en-US/firefox/addon/ublock-origin/)) to protect against ads/cryptomining)*",
            "author": "myrunningman",
            "id": "h1nzmil",
            "parent_id": "t3_nysbqf",
            "score": 12,
            "created_utc": 1623621002.0,
            "replies": []
        },
        {
            "body": "SO many feelings from this episode - from laughter to joy to tears. It was really fitting for a finale episode for Kwangsoo. He got to spend time with his second family, the people he spent 11 years, and share memories together. The last segment reading their letters really destroyed me especially when Kwangsoo was reading his personal letters to the members and him apologizing to them. You can see how much the members and staff love Kwangsoo and how much Kwangsoo loves them back.\n\nI hope Kwangsoo knows how happy he’s made so many people. He came onto Running Man in 2010 as a variety newbie but never failed to give us laughter and joy and truly gave his all during every episode. It’s insane to think that Running Man has mostly stayed with the same cast for the past 11 years and I’m forever grateful to every single one of them. \n\nIt’s going to be hard watching next week’s episode knowing Kwangsoo isn’t there but I’m also happy that Kwangsoo will be able to focus on his health and career. Here’s to more years of Running Man and hoping Kwangsoo will be able to guest in the future!\n\nThank you Kwangsoo, you did well Kwangsoo, we all love you Kwangsoo ♥️",
            "author": "michitae",
            "id": "h1oujij",
            "parent_id": "t3_nysbqf",
            "score": 10,
            "created_utc": 1623638424.0,
            "replies": []
        },
        {
            "body": "Just finished watching, cried my eyes out, blew my nose 1000 times.\nI have more in depth thoughts for tomorrow,  but for now I'll just let it sink in. \nI love this whole cast dearly.",
            "author": "Denethorsmukbang",
            "id": "h1ok3g7",
            "parent_id": "t3_nysbqf",
            "score": 5,
            "created_utc": 1623632436.0,
            "replies": []
        },
        {
            "body": "I was prepared to cry a lot during this episode, but they were really amazing that they tried to have fun and give us something funny to laugh about in the beginning till mid of the episode. \n\nThe ending got me crying a lot. I'm definitely going to miss him, RM and him especially has been one of the reason for me to laugh every week especially when I started to move abroad and feel so much loneliness, the show and LKS especially never fail to make me laugh. \nWish all the best for him!",
            "author": "luckypanda95",
            "id": "h1p81qe",
            "parent_id": "t3_nysbqf",
            "score": 4,
            "created_utc": 1623647562.0,
            "replies": []
        },
        {
            "body": "Wow, have been watching for almost a decade now and I don't think I've felt sad and cried THIS much watching a running man episode. Never missed an episode because it is something that kept me going when I was at my lowest point in life. \n\nLKS was one of the main reasons that brought so much creativity and laughter to the show. It still feels so surreal and empty.\n\n&#x200B;\n\nWishing the 7 members and LKS best of luck in the future. I'll keep supporting them until the end.",
            "author": "GrimReaperScythe",
            "id": "h1pdibo",
            "parent_id": "t3_nysbqf",
            "score": 4,
            "created_utc": 1623651981.0,
            "replies": []
        },
        {
            "body": "What an emotional episode. Thank you, Lee Kwang Soo. My favourite since episode one. 11 years. Wow. I watched them since episode 1 back in 2010. All the best to his future endeavours. Please come back as a guest in the future. There will never be an entertainer like him.",
            "author": "gilinbetray",
            "id": "h1ph5kd",
            "parent_id": "t3_nysbqf",
            "score": 5,
            "created_utc": 1623655189.0,
            "replies": []
        },
        {
            "body": "I cried like a little child watching this episode",
            "author": "arnablabu",
            "id": "h1ppjwq",
            "parent_id": "t3_nysbqf",
            "score": 5,
            "created_utc": 1623663506.0,
            "replies": []
        },
        {
            "body": "Good send off to Kwang Soo and a good way to show his kindness to everyone despite the traitor character he portrays on the show. Hoping to see him again in the show occasionally.",
            "author": "lantern_11",
            "id": "h1q61ia",
            "parent_id": "t3_nysbqf",
            "score": 6,
            "created_utc": 1623676020.0,
            "replies": []
        },
        {
            "body": "it is never easy for a member to leave their show. this is an emotional episode. thank you giraffe for the wonderful 11 years.\n\nnot sure if the rating for the episode when drop, but as fans of the show, we should continue to support the show. running man fighting!",
            "author": "anthayashi",
            "id": "h1q7pjh",
            "parent_id": "t3_nysbqf",
            "score": 4,
            "created_utc": 1623676957.0,
            "replies": []
        },
        {
            "body": "Hi friends, I'm new here but I really needed to share this sad moment with someone.  In my family I'm the only one who watches RM and this episode broke my heart in a way I never imagined.  LKS is my favorite member of RM, there were several times I found myself imitating something he did on the show or simply reviewing a special moment of him in each episode.  I really hope he is successful.  on his new journey and I will continue to support all the other members of the program as I am sure this is what our dear giraffe most desires. I've been preparing for this episode ever since I saw the news about her leaving, but I couldn't hold back the tears and cried a lot.  I hope that we can all support each other in this sad moment and make good memories with the members who will continue in RM, giving all the support to them.",
            "author": "dandeus1",
            "id": "h1vienu",
            "parent_id": "t3_nysbqf",
            "score": 6,
            "created_utc": 1623780533.0,
            "replies": []
        },
        {
            "body": "I cannot imagine how sad the people in this subreddit are who watched the show weekly from LKS's first ep to the last. I hope yall are ok.",
            "author": "looooolmonster",
            "id": "h1ofjov",
            "parent_id": "t3_nysbqf",
            "score": 9,
            "created_utc": 1623629843.0,
            "replies": []
        },
        {
            "body": "I'm just glad I managed to make it through the episode. It was still tough but somehow it helped being mentally prepared from the preview last week?\n\n YJS put it best - \"life doesn't always go as planned\". 11 years is a really long time to do *anything.* I'm thankful for all the laughter and joy he's brought us all these years and hope Running Man will continue to have a bright future.\n\nHe will be able to come back on the show unannounced (with the coupon!) and if he recovers enough maybe even join again. \n\nBut for now... the show must go on. Goodbye LKS!",
            "author": "banethor88",
            "id": "h1oo1z1",
            "parent_id": "t3_nysbqf",
            "score": 10,
            "created_utc": 1623634738.0,
            "replies": []
        },
        {
            "body": "Don't think I can say anything that hasn't already been so well expressed so far by everyone here.\n\nI was just out of college when RM started, so although Kwangsoo was the youngest member of the show, he was always the hyung that resonated the most with me. His showmanship and professionalism truly continues to be an inspiration and aspiration for me. Then there's the content of his character outside of the show, which was so perfectly captured from start to finish of this episode. Kwangsoo really is a diamond through and through.\n\n광수형, 수고했어요!",
            "author": "_Pleinair_",
            "id": "h1oe5j0",
            "parent_id": "t3_nysbqf",
            "score": 8,
            "created_utc": 1623629057.0,
            "replies": []
        },
        {
            "body": "Every minute of this episode, I was either tearing up, crying, sobbing or full on ugly weeping. Suffice to say, my eyes will be puffy and bloodshot tomorrow.\n\nKwang Soo - you mean so much to us. You made this show special. Thank you for everything. We'll always love you, and we'll certainly never forget you. You'll be part of RM forever.",
            "author": "vaporsynth",
            "id": "h1ouilb",
            "parent_id": "t3_nysbqf",
            "score": 9,
            "created_utc": 1623638409.0,
            "replies": []
        },
        {
            "body": "Both the first name tag ripper and the first to get their name tag ripped have officially left the show.\n\nI just started watching from ep 1 again and its so nostalgic and amazing.",
            "author": "Denethorsmukbang",
            "id": "h1okjcr",
            "parent_id": "t3_nysbqf",
            "score": 4,
            "created_utc": 1623632688.0,
            "replies": []
        },
        {
            "body": "Just finish watching since I was waiting for the English subs on the platform I watch from. I held back tears for the better part of the ep, but when they started reading their letters at the LP shop, I lost it 😭. Wishing LKS all the best in his future endeavors and I will truly miss him. Let’s all continue supporting the show and it’s members and who knows, one day he’ll probably be a guest on Running Man",
            "author": "speats101",
            "id": "h1p0a83",
            "parent_id": "t3_nysbqf",
            "score": 4,
            "created_utc": 1623642030.0,
            "replies": []
        },
        {
            "body": "I cried almost 80% throughout the whole episode. Definitely gonna miss Kwangsoo, I still can't believe he's leaving for good :'( The twist about the hidden mission got me crying even more.\n\nYou did well, Kwangsoo!",
            "author": "zxcvbnmay",
            "id": "h1p171x",
            "parent_id": "t3_nysbqf",
            "score": 3,
            "created_utc": 1623642628.0,
            "replies": []
        },
        {
            "body": "wow i'm not ok lol i sobbed through like half the episode. I wish him the very best and will support him no matter what ❤️ next week will def hit different tho",
            "author": "catsandtings",
            "id": "h1p55by",
            "parent_id": "t3_nysbqf",
            "score": 4,
            "created_utc": 1623645396.0,
            "replies": []
        },
        {
            "body": "i just wish that in next 5 years we don't need to say goodbye to the whole casts of running man.",
            "author": "Numerous-Can-9831",
            "id": "h1pjm68",
            "parent_id": "t3_nysbqf",
            "score": 4,
            "created_utc": 1623657531.0,
            "replies": []
        },
        {
            "body": "This episode made me cry. 😭🤧",
            "author": "arfftastic",
            "id": "h1pk0sw",
            "parent_id": "t3_nysbqf",
            "score": 4,
            "created_utc": 1623657924.0,
            "replies": []
        },
        {
            "body": "I ugly cried while they read the letters. Jesus.",
            "author": "iRelapse",
            "id": "h1pwtad",
            "parent_id": "t3_nysbqf",
            "score": 5,
            "created_utc": 1623669928.0,
            "replies": []
        },
        {
            "body": "good lord, i rarely cried watching anything but this one truly pulled out of my tears out. the episode just started and my eyes were already wet.\n\nwhat a beautiful episode, honestly. as someone who had been watching the shows since their second year (with break in some years between), runningman has its share of up and down but thinking about the members who always worked hard to make every episodes worth it every weeks... i can't help but saying thank you for their work to make our monday so fun and kwangsoo... man, who knew that this variety newbie 11 years ago would be someone who grow up so big 11 years later? he was once the youngest of the gang and now he has two members behind him. even to this last episode, he still gives the best and how beautiful the twist was? the episode really highlighted what he wanted to do so well... it's all compilation of what he loved and remembered to be shared with everyone. \n\nthe montages playing over 015B's 이젠 안녕 really got me. i thought he will not choose this song, but man, he really chose it and *sigh* i really drown in tears. once again, thank you... thank you so much for the joy you have brought to us, kwangsoo <3\n\nnext week will be different... but let's keep supporting runningman, y'all!",
            "author": "excillidiae",
            "id": "h1qidbs",
            "parent_id": "t3_nysbqf",
            "score": 4,
            "created_utc": 1623682257.0,
            "replies": []
        },
        {
            "body": "I just want to say that that was a good cry…",
            "author": "KillJoy-Player",
            "id": "h1qtw40",
            "parent_id": "t3_nysbqf",
            "score": 4,
            "created_utc": 1623687521.0,
            "replies": []
        },
        {
            "body": "I want to write a long message as well, but I'm a complete mess right now. 😭",
            "author": "coolcoolnodoubt",
            "id": "h1qty1w",
            "parent_id": "t3_nysbqf",
            "score": 3,
            "created_utc": 1623687544.0,
            "replies": []
        },
        {
            "body": "Uhm I don't ever write comments or something haha. But today, this ep broke me. I get kwangsoo's reasons for leaving and fully support him but it still hurts that one of the people who made me the happiest when I was at my low won't be there for me anymore. I know this is selfish but he made me so so so happy, I'm so glad I got to know about running man because I know for a fact that if I didn't, my life would've been incomplete. I love kwangsoo so much. My heart aches so much hahaha. But it's okay, I'll wait patiently for him visits on running man because I know every episode I'll keep hoping that he shows up and jae suk rides on his back, he takes food out of somin's mouth, hugs jihyo, annoys and punches jongkook, does traitor stuff with haha, does the feeling-intuition cross with sukjin and plans against somin with sechan. I will miss him so so so much :\")\nI love you kwangsoo, I hope you stay healthy and happy.",
            "author": "kiyongsbae",
            "id": "h1ra0x7",
            "parent_id": "t3_nysbqf",
            "score": 4,
            "created_utc": 1623694647.0,
            "replies": []
        },
        {
            "body": "Dang I knew it that I'll cry like a freaking trash when I watch this episode that's why I watch it before I sleep instead of watching it as soon as it was available to streaming sites but yeah here I am, can't breathe well because I cried for literally 3 hours straight. I knew myself I am a strong person but this, jeezz when YSC cried like a baby I lost it too just like him.\n\nRunningman saved me through my lowest and LKS was one of my favorite so this episode to me was really special.",
            "author": "JeckloyTagabukturan",
            "id": "h1rlzr0",
            "parent_id": "t3_nysbqf",
            "score": 5,
            "created_utc": 1623700084.0,
            "replies": []
        },
        {
            "body": "I’ve watched all episodes of Running Man, LKS is my favorite member. As much as I love YJS, to me, Running Man = LKS. He stood out so much, not just his height but also his character on the show. He was always blessed by the god of variety. I felt sad the whole day after watching this episode, the emotion lingers as reality sets in. Like what others have mentioned, we fans probably expected him to be one of the last person to ever leave the show, so that hit hard. Plus the fact that he kept apologizing for leaving, him buying farewell presents for the cast, and him keeping quiet when members were joking that he can still change his mind meant that LKS had made up his mind to leave for sure. \n\nI’ve also never seen YSC and KJK so upset before. KJK didn’t cry but it’s obvious that he’s upset, his jaw was clenched and he kept avoiding eye contact. \n\n“It wasn’t boring because of you”, thank you for being the comfort for us who grew up with the show. \n\nI can’t wait for the newer episodes to be out so we can get used to the new ‘feel’ of the show, and move back to a more cheerful mood.",
            "author": "bluebirdsandrainbows",
            "id": "h1ty3sq",
            "parent_id": "t3_nysbqf",
            "score": 4,
            "created_utc": 1623750612.0,
            "replies": []
        },
        {
            "body": "I've redacted what I wanted to write several times now, I think most of us were flushed with emotions throughout the episode. It's very evident that LKS had such a meaningful impact on this show and his presence will certainly be missed moving forward. Between the \"Hey Jude\" moment + YSC opening the floodgates, I'll definitely be thinking about this episode for a long time. You did great Kwangsoo :')",
            "author": "CSkorm",
            "id": "h1ocbge",
            "parent_id": "t3_nysbqf",
            "score": 7,
            "created_utc": 1623628008.0,
            "replies": []
        },
        {
            "body": "I cried so fucking hard… from the beginning till the end…",
            "author": "MusicBytes",
            "id": "h1olfz7",
            "parent_id": "t3_nysbqf",
            "score": 3,
            "created_utc": 1623633216.0,
            "replies": []
        },
        {
            "body": "I teared up so much this episode! We will all miss you Lee Kwang Soo, the life of running man!",
            "author": "mariayu12169",
            "id": "h1plwhk",
            "parent_id": "t3_nysbqf",
            "score": 3,
            "created_utc": 1623659784.0,
            "replies": []
        },
        {
            "body": "😢",
            "author": "razer981",
            "id": "h1pthax",
            "parent_id": "t3_nysbqf",
            "score": 3,
            "created_utc": 1623667161.0,
            "replies": []
        },
        {
            "body": "does anyone here know where i can find all those film photos?? i want to download them in their best quality..",
            "author": "nofollowersisokay",
            "id": "h1px2gb",
            "parent_id": "t3_nysbqf",
            "score": 3,
            "created_utc": 1623670125.0,
            "replies": []
        },
        {
            "body": "This episode was still very funny. I will miss Lee Kwang Soo, but I hope this show will run for a very long time.",
            "author": "elina116",
            "id": "h1py290",
            "parent_id": "t3_nysbqf",
            "score": 3,
            "created_utc": 1623670864.0,
            "replies": []
        },
        {
            "body": "I have message to you to Kwangsoo hyung!\n\nWelcome to the fans club! Let's enjoy watching Running Man onwards!\n\n\n\nThrough him i experienced watching the evolution of an unknown guy becoming one of the best entertainer. Everything about him is always and only fun, it never been sad, i keep asking questions in my mind like 'why he had to quit', 'why he get into a traffic accident', 'why now', 'cant you be there one more week' .. i never been involved in an accident, now i know, it's hurt, for the second time this year i've been involved with heartbreaking accident, one is because i was careless and choose to get into iz*one, but this time, i've been careful all the time, yet i'm still getting a heart crash!\n\n\nBut in the end, let's wish him the best, from recovery, to a new family! Let's start supporting his acting career too!!\n\nI'm still expecting some surprise appearance like what Gary did back then! It's been fun!!",
            "author": "grandpa_hyo",
            "id": "h1qmnm0",
            "parent_id": "t3_nysbqf",
            "score": 3,
            "created_utc": 1623684250.0,
            "replies": []
        },
        {
            "body": "With every departure it will always bring sadness. However, it also gives opportunities to things that have yet to shine. I look forward to LKS's future projects along with how the dynamics will change in RM.",
            "author": "I_am_Bruce_Wayne",
            "id": "h1qz3xi",
            "parent_id": "t3_nysbqf",
            "score": 3,
            "created_utc": 1623689793.0,
            "replies": []
        },
        {
            "body": "God damn I'm in pieces after watching that. I was expecting to get emotional, but the waterworks flowed multiple times throughout lol. I hope Kwang Soo is happy and healthy in whatever he does next, he truly deserves it after giving so many people so much laughter and joy over the years.",
            "author": "Chell_the_assassin",
            "id": "h1rhsao",
            "parent_id": "t3_nysbqf",
            "score": 3,
            "created_utc": 1623698190.0,
            "replies": []
        },
        {
            "body": "I STILL CANT STOP CRYING 😫😫😫",
            "author": "Worldly_Purpose2888",
            "id": "h1ssomy",
            "parent_id": "t3_nysbqf",
            "score": 3,
            "created_utc": 1623720568.0,
            "replies": []
        },
        {
            "body": "LKS choosing the pirate at his first try was really amazing. Like, everyone was dumbfounded. It happens almost every single time, it must have skewed randomness probability distribution.",
            "author": "Eenix95",
            "id": "h1v2el6",
            "parent_id": "t3_nysbqf",
            "score": 3,
            "created_utc": 1623773834.0,
            "replies": []
        },
        {
            "body": "Not surprised Sechan cried as much as he did, he’s always look dat his Kwangsoo Hyung with great admiration and love, he’s learned from him and was protected by him. \n\nThis episode once again highlighted what an incredibly amazing human being Kwangsoo is, so incredibly kind and full of love for everyone. We are very lucky that we got to know him and that too for 11 years. \n\nThank you Lee Kwangsoo for joining Running Man, for sticking through the good and bad times, for being a source for happiness for us for 11 years. This joy you’ve spread to us will last for a lifetime and although we don’t know you personally, you’ll always be our brother and friend.\n\nGoodbye for now and good luck with your future. You will always have a place in our hearts.",
            "author": "real_highlight_reel",
            "id": "h2k6im9",
            "parent_id": "t3_nysbqf",
            "score": 3,
            "created_utc": 1624297633.0,
            "replies": []
        },
        {
            "body": "Beautiful Episode💜 as soon as they got to the LP location I was crying. Kwangsoo worked so hard & I will continue to support his works. Runningman has changed me life & I will continue watching until its finished!!",
            "author": "curvvyQ",
            "id": "h1onthx",
            "parent_id": "t3_nysbqf",
            "score": 5,
            "created_utc": 1623634605.0,
            "replies": []
        },
        {
            "body": "Just finished the episode. I haven't cried this hard in a long, long time. I love you Kwang Soo. Thanks for the cherished memories. Thanks for being a role model. You will be dearly missed. Cheers for good health and eternal happiness. You deserve it and more.",
            "author": "thepettyevil",
            "id": "h1opuna",
            "parent_id": "t3_nysbqf",
            "score": 6,
            "created_utc": 1623635709.0,
            "replies": []
        },
        {
            "body": "I couldn’t watch Ji Hyo in this episode, she was balling her eyes out 😢",
            "author": "justarando0000",
            "id": "h1pkzp4",
            "parent_id": "t3_nysbqf",
            "score": 6,
            "created_utc": 1623658884.0,
            "replies": []
        },
        {
            "body": "I just came from watching the episode and I am now an emotional wreck. I am forever grateful to Kwangsoo for the joy & laughter he brought me this past years since I began watching running man. Running man became my stress reliever every week for the past 6years ever since I was in middle school and even now in Uni. Every week, he never failed to make me/  [us] laugh along with the other members. He really has worked hard this past 11 years. Thank you Kwangsoo and I hope you remain healthy. Enjoy the world without penalties ❤️",
            "author": "mini_cactus",
            "id": "h1olp30",
            "parent_id": "t3_nysbqf",
            "score": 4,
            "created_utc": 1623633363.0,
            "replies": [
                {
                    "body": "Hell will break lose if kwang soo goes to another reality show .",
                    "author": "garbuja",
                    "id": "h1omfrw",
                    "parent_id": "t1_h1olp30",
                    "score": -5,
                    "created_utc": 1623633797.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I had to pause the episode so many times because I couldn't read the subtitles because I was crying so much :(. The letters broke my heart, and the ending with the gifts was so beautiful. I hope we see Kwangsoo again in the future. I will keep supporting his acting career and Running Man.",
            "author": "yameteeeeeeeeee",
            "id": "h1onnvj",
            "parent_id": "t3_nysbqf",
            "score": 5,
            "created_utc": 1623634514.0,
            "replies": []
        },
        {
            "body": "Farewell, my special brother. Next Sunday is going be sad.",
            "author": "limiter_remove",
            "id": "h1oplgz",
            "parent_id": "t3_nysbqf",
            "score": 4,
            "created_utc": 1623635566.0,
            "replies": []
        },
        {
            "body": "Anyone know what song and who sang it that kwang soo requested??",
            "author": "mocha__lover",
            "id": "h1poz6x",
            "parent_id": "t3_nysbqf",
            "score": 2,
            "created_utc": 1623662945.0,
            "replies": []
        },
        {
            "body": "I laughed so hard when they said kwangsoo committed over 1812 frauds and stopped counting. This was over 559 episodes, averaging to 3 frauds per episode. Hahahahahaha, it would be hard to find another personality like him.\n\nAnd the god of variety is really sending him off well with the eggs and pirate ahjussi. \n\n8012 7012 8012 7012",
            "author": "hunmingnoisehdb",
            "id": "h1tt2dg",
            "parent_id": "t3_nysbqf",
            "score": 2,
            "created_utc": 1623745659.0,
            "replies": []
        },
        {
            "body": "I've just finished watching this episode. My eyes and my head hurt from crying so much. Somber and bittersweet feeling from the start of the episode, felt a lump in my throat when the hyungs read their letters and finally lost it when I see Sechan, Jihyo and  Somin cried.\n\nThank you Kwang soo for all the hardwork, dedication and passion you have given us for these past years. Thank you for making us laugh and always being there through our ups and downs for the last 11 years. We wished you success in whatever you do and we'll keep on supporting our favourite Girin ❤️🦒 Hwaiting!!",
            "author": "liaadh",
            "id": "h28swb6",
            "parent_id": "t3_nysbqf",
            "score": 2,
            "created_utc": 1624044486.0,
            "replies": []
        },
        {
            "body": "You were gut BFF friends",
            "author": "Budget_Beat_7547",
            "id": "ifpxqbp",
            "parent_id": "t3_nysbqf",
            "score": 2,
            "created_utc": 1657546284.0,
            "replies": []
        },
        {
            "body": "the race was so well-planned, with twists after twists (legit bawled at the last one though - it just goes to show how much kwangsoo cared abt RM and how hard this decision mustve been for him). \n\nmaybe because i cried a lot when i watched the videos released on RM's youtube channel, i was able to prep myself a bit more when the eng subs were out. i still laughed a lot during the cruise ship ride, where sechan and haha yelled at the seagull with the R mark LOL \n\nthe letter writing was definitely a tear-jerker. from the 'thanks to you it wasn't boring\", sechan tearing up uncontrollably to jihyo staying behind for 2 hours to write her letter...it really is so painful to watch. \n\ndon't think i have the guts to rewarch this episode in the future, but i really appreciate this sendoff. thank you bopil (also completely didnt expect him tearing up🥺), and kwangsoo do come back in the future when your ankle's healed. we'll all be waiting.",
            "author": null,
            "id": "h1ppmly",
            "parent_id": "t3_nysbqf",
            "score": 2,
            "created_utc": 1623663580.0,
            "replies": []
        },
        {
            "body": "About the ep - I really think the cruise part could have been better - ie swapped for something different.\nI would have loved a name tag ripping of some sorts, even adjusted, or some sort of game.\n\nHowever, the rest of the ep, especially the last portion, they really did his goodbye justice.\n\nI was hoping they would have flashbacks while they were reading and thats what they did. \nI wonder how they chose them, they could have picked hundreds for each member.\n\nVery sweet and emotional, they really gave the members, kwangsoo and the viewers themselves time to say goodbye.\n\nI dont think they can give all the members the same dedicated goodbye and emotion filled moments, so even though running man now is very much a mixed bag for me in terms of entertainment, I adore the cast and Ill just cross my fingers no one else leaves!\n\nOnly tinnyy thing they didnt mention which would have been cute , is to single out his VJ in the crew for a mention - unless it isnt the same anymore? because i never see jae suk talk about kwon reoyul anymore so maybe theyve swapped.",
            "author": "Denethorsmukbang",
            "id": "h1ol5ry",
            "parent_id": "t3_nysbqf",
            "score": 1,
            "created_utc": 1623633053.0,
            "replies": []
        },
        {
            "body": "When YJS read his letter to LKS, can anyone tell me what the meaning behind its last paragraph \" it isn't boring because of you\". Correct me if I'm wrong.",
            "author": "OrenJuice777",
            "id": "h1xu1jd",
            "parent_id": "t3_nysbqf",
            "score": 1,
            "created_utc": 1623823451.0,
            "replies": []
        },
        {
            "body": "Is there a delay on VIKI release, usually the episode is up by now EST in US. Update: it’s up now!",
            "author": "jesshandyyy",
            "id": "h1o6j7h",
            "parent_id": "t3_nysbqf",
            "score": 1,
            "created_utc": 1623624741.0,
            "replies": []
        },
        {
            "body": "I thought LKS was taking a break, but from the farewell he’s leaving the show for good. Sad feels.",
            "author": "crafty_bernardo",
            "id": "h1oie7r",
            "parent_id": "t3_nysbqf",
            "score": 1,
            "created_utc": 1623631461.0,
            "replies": []
        },
        {
            "body": "I wished he would've mentioned it in the episode \"Hi I am Lee Kwang Soo, 36 years old this year, I am no longer a grown sprout and this is my last episode etc etc\" as a homage to his episode 1's introduction.... that would be some feels...",
            "author": "CyberMew",
            "id": "h1pgmp4",
            "parent_id": "t3_nysbqf",
            "score": 1,
            "created_utc": 1623654718.0,
            "replies": []
        },
        {
            "body": "Sad to see him leave\nI've seen every episode. I hope he and the others come back for a month long series when it happens (many many years from now)\nI'll keep watching from america!",
            "author": "emperorsung",
            "id": "h1oqmrs",
            "parent_id": "t3_nysbqf",
            "score": 1,
            "created_utc": 1623636147.0,
            "replies": []
        },
        {
            "body": "sadface",
            "author": "Locastor",
            "id": "h1ptutc",
            "parent_id": "t3_nysbqf",
            "score": 1,
            "created_utc": 1623667493.0,
            "replies": []
        },
        {
            "body": "If you're here, my love let me know, i've waited since forever for you.. :))",
            "author": "Ollyy1",
            "id": "h1swh8q",
            "parent_id": "t3_nysbqf",
            "score": 1,
            "created_utc": 1623722542.0,
            "replies": []
        },
        {
            "body": "I've just finished watching this after putting it off for so long and oh boy. My eyes are red from crying so much, nose is all stuffy ...I really and truly will miss him so much, I'm so devastated 😭💛",
            "author": "Meadow97",
            "id": "h20cmw9",
            "parent_id": "t3_nysbqf",
            "score": 1,
            "created_utc": 1623874752.0,
            "replies": []
        },
        {
            "body": "I've typeset the [English Sub (.ASS file)](https://mega.nz/file/Y5NRhIAY#gam3SLTTDmh_AYsB1X8Zoq17Ns-2pTqeOhKlDsP9E6A) around first 30 min. If anyone would like to finish the project, that would be nice.  \nEdit: Also can anyone list BGM used & time in this episode?",
            "author": "manusiafaiz",
            "id": "h229m67",
            "parent_id": "t3_nysbqf",
            "score": 1,
            "created_utc": 1623913093.0,
            "replies": [
                {
                    "body": "Here's a link to a post trying to fjnd out the list as well as a spotify list posted:\nhttps://www.reddit.com/r/runningman/comments/nzpw1d/can_anyone_please_list_the_songs_used_in_ep559/\n\nSpotify: https://www.reddit.com/r/runningman/comments/o0mxse/relive_the_memory_relive_the_tracks_by/",
                    "author": "BoneToBeWild",
                    "id": "h22fvo3",
                    "parent_id": "t1_h229m67",
                    "score": 1,
                    "created_utc": 1623918849.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When YSC said “enjoy life without penalties” I felt that so DEEPLY 😭😂",
            "author": "osun",
            "id": "h24wzpo",
            "parent_id": "t3_nysbqf",
            "score": 1,
            "created_utc": 1623963957.0,
            "replies": []
        },
        {
            "body": "just had the strength to watch this ep and wow, my tears just won't stop falling :((((",
            "author": "lttlemrmd",
            "id": "h28bdzz",
            "parent_id": "t3_nysbqf",
            "score": 2,
            "created_utc": 1624036560.0,
            "replies": []
        },
        {
            "body": "I am such a mess after watching this episode, after Gary left, Kwang Soo became my fav! Thank you Lee Kwang Soo! Good luck in your future endeavors!",
            "author": "Ashe225",
            "id": "h7xaa13",
            "parent_id": "t3_nysbqf",
            "score": 1,
            "created_utc": 1628250378.0,
            "replies": []
        },
        {
            "body": "I will miss him a lot <3",
            "author": "tsukisun",
            "id": "hdcs807",
            "parent_id": "t3_nysbqf",
            "score": 1,
            "created_utc": 1631986311.0,
            "replies": []
        },
        {
            "body": "Sorry is his injury that serious/permanent? . Why couldn’t he take an extended break(1 year)? And return. Purely curious",
            "author": "ilovemolduga",
            "id": "h23t02q",
            "parent_id": "t1_h1p9b1v",
            "score": 2,
            "created_utc": 1623947031.0,
            "replies": [
                {
                    "body": "It takes a looong time to recover from car accidents and sometimes never. \n\nMy mom and I for instance had one where someone hit us from behind at a res light. Supposedly it was no big deal but three years later my mom is still all kinds of messed up in her joints",
                    "author": "Mozart-Luna-Echo",
                    "id": "h2yj24r",
                    "parent_id": "t1_h23t02q",
                    "score": 2,
                    "created_utc": 1624593638.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He started to draw just to prevent himself from crying too.",
            "author": "coolcoolnodoubt",
            "id": "h1qsiem",
            "parent_id": "t1_h1onqk0",
            "score": 56,
            "created_utc": 1623686895.0,
            "replies": []
        },
        {
            "body": "this hit me so hard. but he closes the statement nicely.",
            "author": "aiaidy",
            "id": "h1pcqw4",
            "parent_id": "t1_h1onqk0",
            "score": 30,
            "created_utc": 1623651324.0,
            "replies": []
        },
        {
            "body": "The last look right before stepping out of the bus. That scene wrecked me.",
            "author": "fwindraya",
            "id": "h1rfjmo",
            "parent_id": "t1_h1onqk0",
            "score": 24,
            "created_utc": 1623697171.0,
            "replies": []
        },
        {
            "body": "That killed me and today I'm still dead",
            "author": "pooploserbq",
            "id": "h1qv7jn",
            "parent_id": "t1_h1onqk0",
            "score": 4,
            "created_utc": 1623688101.0,
            "replies": []
        },
        {
            "body": "the last twist also made me lose it :'( really shows the \"real\" LKS instead of the character that he plays on the show",
            "author": "oldDotredditisbetter",
            "id": "h1o7u6o",
            "parent_id": "t1_h1ltvuz",
            "score": 94,
            "created_utc": 1623625470.0,
            "replies": []
        },
        {
            "body": "same same and same. literally watched this as a child and now as a college student i'm still watching it. i just love all of the members and kwang soo has such a big heart. my heart is sad",
            "author": "tinyglow",
            "id": "h1p8d7s",
            "parent_id": "t1_h1ltvuz",
            "score": 25,
            "created_utc": 1623647807.0,
            "replies": []
        },
        {
            "body": "I had to pause to cry when they revealed Kwangsoo's hidden mission. I'm gonna miss him on Running man so much! :(",
            "author": "mong_byun",
            "id": "h1oahnk",
            "parent_id": "t1_h1ltvuz",
            "score": 39,
            "created_utc": 1623626966.0,
            "replies": []
        },
        {
            "body": "Lee Kwang Soo really is superr kind. The fact they also gifted him a book of messages from all the crew/staff also says a lot about the kind of person he is. \\*Cries more in the corner\\*",
            "author": "christinetwwang",
            "id": "h1uxgbo",
            "parent_id": "t1_h1ltvuz",
            "score": 18,
            "created_utc": 1623771640.0,
            "replies": []
        },
        {
            "body": "I started watching RM when i was in high school till now. I watched RM because it was one of the variety show(the other one was Family Outing) that can relieved me from stress.",
            "author": "popoapoooo",
            "id": "h1o7s6r",
            "parent_id": "t1_h1ltvuz",
            "score": 30,
            "created_utc": 1623625439.0,
            "replies": []
        },
        {
            "body": "By this simple move, Yoo Jae-Suk just show all his consideration.",
            "author": "spyon80",
            "id": "h1z6tpn",
            "parent_id": "t1_h1m55hk",
            "score": 12,
            "created_utc": 1623856882.0,
            "replies": []
        },
        {
            "body": "ugly laugh cried when someone mentioned “this isn’t the time to cry yet” 🤣😭",
            "author": "dnthnglldyvrydy",
            "id": "h2aommd",
            "parent_id": "t1_h1m55hk",
            "score": 6,
            "created_utc": 1624081129.0,
            "replies": []
        },
        {
            "body": "When you can hear the words you read. \n\nThis was in that episode where yjs and gary made fun of kwangsoo who was role playing the school Jang.",
            "author": "hunmingnoisehdb",
            "id": "h1tsvx2",
            "parent_id": "t1_h1mhlbu",
            "score": 9,
            "created_utc": 1623745479.0,
            "replies": []
        },
        {
            "body": "I cant say this enough but RM members really held it together as a cast even after 11 years. Never getting into bad scandals just real great role models out there.",
            "author": "wontaks",
            "id": "h1pef55",
            "parent_id": "t1_h1mpkg8",
            "score": 61,
            "created_utc": 1623652778.0,
            "replies": [
                {
                    "body": "I remember majority of them saying that is all thanks to YJS mentoring of them in the early years of RMing and making sure everyone stays clear of getting into scandals or negative publicity.",
                    "author": "I_am_Bruce_Wayne",
                    "id": "h1qy8yf",
                    "parent_id": "t1_h1pef55",
                    "score": 27,
                    "created_utc": 1623689422.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Only RM had the OG cast for 10 years, other VS have different season. Some had left but really respect to the 6 members. They didnt take a break really.",
            "author": "Efficient-Aside-8919",
            "id": "h1o1omn",
            "parent_id": "t1_h1mpkg8",
            "score": 50,
            "created_utc": 1623622086.0,
            "replies": [
                {
                    "body": "Not just Rm lol. IC has that too.",
                    "author": null,
                    "id": "h1pkq7s",
                    "parent_id": "t1_h1o1omn",
                    "score": 3,
                    "created_utc": 1623658623.0,
                    "replies": [
                        {
                            "body": "O\nI know IC but they had many cast changes too.. RM jist added 2 members, the other 2 left barely 1 yr of the show. i did emphasize 6 stayed make it 7 Kwang Soo almost made it to 11 years...",
                            "author": "Efficient-Aside-8919",
                            "id": "h1pxv2t",
                            "parent_id": "t1_h1pkq7s",
                            "score": 11,
                            "created_utc": 1623670717.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have the same thought too, i thought he and a few others like YJS will stay until the end. Too bad, life doesn't go like how we want. Will miss him for sure.",
            "author": "luckypanda95",
            "id": "h1p7ozq",
            "parent_id": "t1_h1mpkg8",
            "score": 19,
            "created_utc": 1623647288.0,
            "replies": []
        },
        {
            "body": "Yeah… I was rly sad when Gary left esp when his “나란 노믄…” kicked in… but this was sooo diff. From the beginning of the show… tearing up to bawling during the letter reading. Aish.",
            "author": "MusicBytes",
            "id": "h1olnsf",
            "parent_id": "t1_h1m3h80",
            "score": 21,
            "created_utc": 1623633342.0,
            "replies": []
        },
        {
            "body": "It's surreal to me to think that these people have spent every single week together for over a decade, and how sobering it must be to them all to realize that one of them won't be there next week. Let alone how sad Kwang Soo must be and how hard it must have been to make the decision",
            "author": "AnvilPro",
            "id": "h1nzpk4",
            "parent_id": "t1_h1mjmw3",
            "score": 53,
            "created_utc": 1623621044.0,
            "replies": []
        },
        {
            "body": "Guess who is ugly crying while reading the letters...😭",
            "author": "glassesinglamour",
            "id": "h1mm1g3",
            "parent_id": "t1_h1mjmw3",
            "score": 14,
            "created_utc": 1623596487.0,
            "replies": [
                {
                    "body": "[this person is](https://old.reddit.com/user/me/)",
                    "author": "oldDotredditisbetter",
                    "id": "h1o81ju",
                    "parent_id": "t1_h1mm1g3",
                    "score": 26,
                    "created_utc": 1623625585.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As a JSM fan, I noticed that the letter sounds kind of generic. It doesn’t look like their friendship ever recovered and I’m super sad about it.",
            "author": "GG-Duo",
            "id": "h1npf4v",
            "parent_id": "t1_h1mjmw3",
            "score": -22,
            "created_utc": 1623615937.0,
            "replies": [
                {
                    "body": "that's just the letter they wrote on air, we don't know what kind of letter they wrote offair",
                    "author": "oldDotredditisbetter",
                    "id": "h1o830t",
                    "parent_id": "t1_h1npf4v",
                    "score": 24,
                    "created_utc": 1623625608.0,
                    "replies": []
                },
                {
                    "body": "Idk why you’re being downvoted for your observation. Anyone who paid attention closely to them saw their chemistry/friendship dwindle and never recover to what it once was. \n\nSomin and Kwangsoo are my favs btw. It is sad to see what happened to their relationship.",
                    "author": "No-Requirement-6762",
                    "id": "h1oretc",
                    "parent_id": "t1_h1npf4v",
                    "score": 14,
                    "created_utc": 1623636596.0,
                    "replies": [
                        {
                            "body": "what happened to their relationship?",
                            "author": "Turbulent-Machine-59",
                            "id": "h2360vk",
                            "parent_id": "t1_h1oretc",
                            "score": 2,
                            "created_utc": 1623937045.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I doubt he would offer Dom Pérignon champagne to someone who he is not close with, and these last few episode we have seen them interacting more..",
                    "author": "LittlePumpkin03",
                    "id": "h1ohpk9",
                    "parent_id": "t1_h1npf4v",
                    "score": 9,
                    "created_utc": 1623631064.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I do think KJK letter feel relatable for most of us. We think LKS will be there at the end of the show but it goes otherwise",
            "author": "zxyqm",
            "id": "h1oulxv",
            "parent_id": "t1_h1oma4p",
            "score": 44,
            "created_utc": 1623638464.0,
            "replies": []
        },
        {
            "body": "Same 😓 You can tell how much he means to him",
            "author": "curvvyQ",
            "id": "h1oodrx",
            "parent_id": "t1_h1oma4p",
            "score": 9,
            "created_utc": 1623634920.0,
            "replies": []
        },
        {
            "body": "Kwangsoo was such a good hyung to welcome Somin & Sechan onto the show. He was the leader of the maknae group and I think they were really close, hanging out often off-camera. I’m not sure what happened to Somin & Kwangsoo, but her letter was so short and simple... yet it seemed to have affected Kwangsoo so much emotionally. They both appeared to have a lot of feelings that I hope they can talk out, and maybe they have already by this point. I just hope they are ok bc their relationship was so sweet. Him hanging out with her brother, her dad being a fan of his. Obviously, we won’t know what happened but I take it as a good sign that she followed him again. The maknae group had a special bond and I hope they keep contact even if they’re not able to see each other every week anymore.",
            "author": "thecampaignerinsight",
            "id": "h1run1a",
            "parent_id": "t1_h1od3q8",
            "score": 23,
            "created_utc": 1623704050.0,
            "replies": []
        },
        {
            "body": "LKS was known for being cheap lol (never offers to pay when eating together) hence this gesture means a lot. \n\nAnd the hidden photo tally mission wrecks me. He's playing a game inside a game inside a game when everyone should be relaxing.",
            "author": "Kuuganism",
            "id": "h1t2a9l",
            "parent_id": "t1_h1orcfp",
            "score": 8,
            "created_utc": 1623725620.0,
            "replies": []
        },
        {
            "body": "Exactly. Plus reading the translated letters made me a crying mess again. 😭😭",
            "author": "SophiaJoanne",
            "id": "h1oaz43",
            "parent_id": "t1_h1lwk1s",
            "score": 18,
            "created_utc": 1623627245.0,
            "replies": []
        },
        {
            "body": "He really love his hyung right..",
            "author": "Mraihan1997",
            "id": "h1p9smr",
            "parent_id": "t1_h1oqmb2",
            "score": 8,
            "created_utc": 1623648918.0,
            "replies": []
        },
        {
            "body": "I remembered that episode. You can see how dedicated he is at the start. He didn’t have to come but he did after his filming. It was funny, the members were so nonchalant about him coming back, it upsets him haha",
            "author": "echofades",
            "id": "h1stcnu",
            "parent_id": "t1_h1qvxle",
            "score": 4,
            "created_utc": 1623720914.0,
            "replies": []
        },
        {
            "body": "Hell will break lose if kwang soo goes to another reality show .",
            "author": "garbuja",
            "id": "h1omfrw",
            "parent_id": "t1_h1olp30",
            "score": -5,
            "created_utc": 1623633797.0,
            "replies": []
        },
        {
            "body": "Here's a link to a post trying to fjnd out the list as well as a spotify list posted:\nhttps://www.reddit.com/r/runningman/comments/nzpw1d/can_anyone_please_list_the_songs_used_in_ep559/\n\nSpotify: https://www.reddit.com/r/runningman/comments/o0mxse/relive_the_memory_relive_the_tracks_by/",
            "author": "BoneToBeWild",
            "id": "h22fvo3",
            "parent_id": "t1_h229m67",
            "score": 1,
            "created_utc": 1623918849.0,
            "replies": []
        },
        {
            "body": "It takes a looong time to recover from car accidents and sometimes never. \n\nMy mom and I for instance had one where someone hit us from behind at a res light. Supposedly it was no big deal but three years later my mom is still all kinds of messed up in her joints",
            "author": "Mozart-Luna-Echo",
            "id": "h2yj24r",
            "parent_id": "t1_h23t02q",
            "score": 2,
            "created_utc": 1624593638.0,
            "replies": []
        },
        {
            "body": "I remember majority of them saying that is all thanks to YJS mentoring of them in the early years of RMing and making sure everyone stays clear of getting into scandals or negative publicity.",
            "author": "I_am_Bruce_Wayne",
            "id": "h1qy8yf",
            "parent_id": "t1_h1pef55",
            "score": 27,
            "created_utc": 1623689422.0,
            "replies": []
        },
        {
            "body": "Not just Rm lol. IC has that too.",
            "author": null,
            "id": "h1pkq7s",
            "parent_id": "t1_h1o1omn",
            "score": 3,
            "created_utc": 1623658623.0,
            "replies": [
                {
                    "body": "O\nI know IC but they had many cast changes too.. RM jist added 2 members, the other 2 left barely 1 yr of the show. i did emphasize 6 stayed make it 7 Kwang Soo almost made it to 11 years...",
                    "author": "Efficient-Aside-8919",
                    "id": "h1pxv2t",
                    "parent_id": "t1_h1pkq7s",
                    "score": 11,
                    "created_utc": 1623670717.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[this person is](https://old.reddit.com/user/me/)",
            "author": "oldDotredditisbetter",
            "id": "h1o81ju",
            "parent_id": "t1_h1mm1g3",
            "score": 26,
            "created_utc": 1623625585.0,
            "replies": []
        },
        {
            "body": "that's just the letter they wrote on air, we don't know what kind of letter they wrote offair",
            "author": "oldDotredditisbetter",
            "id": "h1o830t",
            "parent_id": "t1_h1npf4v",
            "score": 24,
            "created_utc": 1623625608.0,
            "replies": []
        },
        {
            "body": "Idk why you’re being downvoted for your observation. Anyone who paid attention closely to them saw their chemistry/friendship dwindle and never recover to what it once was. \n\nSomin and Kwangsoo are my favs btw. It is sad to see what happened to their relationship.",
            "author": "No-Requirement-6762",
            "id": "h1oretc",
            "parent_id": "t1_h1npf4v",
            "score": 14,
            "created_utc": 1623636596.0,
            "replies": [
                {
                    "body": "what happened to their relationship?",
                    "author": "Turbulent-Machine-59",
                    "id": "h2360vk",
                    "parent_id": "t1_h1oretc",
                    "score": 2,
                    "created_utc": 1623937045.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I doubt he would offer Dom Pérignon champagne to someone who he is not close with, and these last few episode we have seen them interacting more..",
            "author": "LittlePumpkin03",
            "id": "h1ohpk9",
            "parent_id": "t1_h1npf4v",
            "score": 9,
            "created_utc": 1623631064.0,
            "replies": []
        },
        {
            "body": "O\nI know IC but they had many cast changes too.. RM jist added 2 members, the other 2 left barely 1 yr of the show. i did emphasize 6 stayed make it 7 Kwang Soo almost made it to 11 years...",
            "author": "Efficient-Aside-8919",
            "id": "h1pxv2t",
            "parent_id": "t1_h1pkq7s",
            "score": 11,
            "created_utc": 1623670717.0,
            "replies": []
        },
        {
            "body": "what happened to their relationship?",
            "author": "Turbulent-Machine-59",
            "id": "h2360vk",
            "parent_id": "t1_h1oretc",
            "score": 2,
            "created_utc": 1623937045.0,
            "replies": []
        }
    ]
}