{
    "title": "TikTok is ruining the bowl",
    "post_id": "kiwy1u",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/kiwy1u/tiktok_is_ruining_the_bowl/",
    "author": "lipglossbaby",
    "body": "I’m a 21 year old college student. This is the exact group emerging from TikTok and taking over SA and the bowl. I’m not sure how many of you are familiar with these videos, I know we’ve all seen/heard of them, but I’m getting them on my FYP every single day. “Never do M&Gs, say you will after sending money” “If he wants to talk on the phone say it’s an ‘extra charge’ :)” “I made $xxxxx in one week from being an online SB!” I can’t help myself from getting bitter and annoyed. Do girls really think that men are so desperate and lonely that they’ll pay for a phone call??? It’s just ridiculous to see these fake perceptions of the bowl and the woman who think it’s a quick side hustle. Saw a TikTok of a girl who got taken out to dinner with her friend by a SD and he paid for the $xxx meal and in addition gave her $xxx afterwards. Just for the M&G. The entire comment section is flooded with “that’s it???” . That’s more than I’ve ever been offered for a M&G, and frankly probably more than any of us have. Now I have all this fake competition and am being weened out of the bowl because I fit the stereotype. Ugh. Just needed to rant cause I know most of y’all feel the same",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/kiwy1u/tiktok_is_ruining_the_bowl/",
    "score": 216,
    "upvote_ratio": 0.97,
    "created_utc": 1608743539.0,
    "num_comments": 112,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "ggtcxns",
            "parent_id": "t3_kiwy1u",
            "score": 105,
            "created_utc": 1608745209.0,
            "replies": [
                {
                    "body": "Because that is not the game. The game is to get more likes and followers and to monetize that.",
                    "author": "London-SD",
                    "id": "ggtghqu",
                    "parent_id": "t1_ggtcxns",
                    "score": 78,
                    "created_utc": 1608747051.0,
                    "replies": []
                },
                {
                    "body": "They do it for the reward of the greatest TikTok currency..... clout.",
                    "author": "sidecar_ride",
                    "id": "ggtptoe",
                    "parent_id": "t1_ggtcxns",
                    "score": 27,
                    "created_utc": 1608751908.0,
                    "replies": [
                        {
                            "body": "Well they also get paid by TikTok. So essentially they are trying to monetize it so they don’t have to talk to old men to make money.",
                            "author": "MsDReid",
                            "id": "ggwmaqi",
                            "parent_id": "t1_ggtptoe",
                            "score": 1,
                            "created_utc": 1608824623.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "They probably haven't rinsed a penny, it's just a way to say \"look how hot I am, men give me so much free cash just so watch me eat\"",
                    "author": "JeaneyBowl",
                    "id": "ggtk6hu",
                    "parent_id": "t1_ggtcxns",
                    "score": 41,
                    "created_utc": 1608748966.0,
                    "replies": [
                        {
                            "body": "👆🏼👆🏼👆🏼👆🏼THIS!!!!",
                            "author": null,
                            "id": "ggu2ugt",
                            "parent_id": "t1_ggtk6hu",
                            "score": 12,
                            "created_utc": 1608758899.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yep, yep, yep! She’s getting her money from the desperate SBs. \n\nI can’t imagine many women receiving a lucrative allowance (6-figure+) putting their face online and risking their SD being discovered when he takes her to a Gala or other high-profile event.",
                    "author": "LVSugarBebe",
                    "id": "gguei4l",
                    "parent_id": "t1_ggtcxns",
                    "score": 14,
                    "created_utc": 1608765111.0,
                    "replies": []
                },
                {
                    "body": "This right here. She's just a marketer trying to grow a brand as an influencer. She's not actually as good as she claims. Remember that even Barbara Corcoran pretended to be Britney Spears' real estate agent when she was growing her brand. Some people just fake it until they make it.",
                    "author": null,
                    "id": "ggu4qs3",
                    "parent_id": "t1_ggtcxns",
                    "score": 11,
                    "created_utc": 1608759932.0,
                    "replies": []
                },
                {
                    "body": "Even hot girls don't make that much rinsing dudes. 1) There's so many flakes, on both sides of the aisle and 2) men catch on and catch on quick, and as soon as they do they leave.",
                    "author": "Persianx6",
                    "id": "ggv4dxi",
                    "parent_id": "t1_ggtcxns",
                    "score": 8,
                    "created_utc": 1608779532.0,
                    "replies": []
                },
                {
                    "body": "She wants you to sign up for her exclusive workshop on how to be a bitter rinser ?\n\nJust a guess. I’m sure there is a premium Snapchat for that",
                    "author": "KnocDown",
                    "id": "ggv9x4n",
                    "parent_id": "t1_ggtcxns",
                    "score": 4,
                    "created_utc": 1608782908.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My sister's friend keeps saying she's got a sugar daddy. I'm like \"no, you send nudes to some creep for almost nothing and feel guilty about it cause you've got a boyfriend but you're broke and too afraid to ask him to help you.\" \n\nI had to have a real conversation about the difference between what I'm doing and what she's doing.\n\nNot completely the same thing you're talking about but \"sugar\" definition is definitely being drug through the dirt.",
            "author": null,
            "id": "ggtcyxh",
            "parent_id": "t3_kiwy1u",
            "score": 45,
            "created_utc": 1608745228.0,
            "replies": [
                {
                    "body": "Oh... My single advice here (if you care about this girl, of course) : tell her to ASK her boyfriend to help her or to break up with him... And if he will say \"no\" to her question, she should leave him immediately: he is not a real man & doesn't care about her/her life /if she is dead or alive at all.... And nobody needs a boyfriend who doesn't care about your existance.",
                    "author": "Gigi9662",
                    "id": "ggvz8n7",
                    "parent_id": "t1_ggtcyxh",
                    "score": 4,
                    "created_utc": 1608805155.0,
                    "replies": []
                },
                {
                    "body": "Ok...so I get what you are saying why is the guy automatically a creep? Tons of guys watch porn...are they all creeps? That is a very broad stroke if the brush.\n\nNow, I would maybe call him dumb, but a creep?",
                    "author": "sdthrowout23",
                    "id": "ggtqxbr",
                    "parent_id": "t1_ggtcyxh",
                    "score": 8,
                    "created_utc": 1608752495.0,
                    "replies": [
                        {
                            "body": "You're absolutely right. I wasn't thinking about my language. He definitely could be an average Joe.",
                            "author": null,
                            "id": "ggu438l",
                            "parent_id": "t1_ggtqxbr",
                            "score": 15,
                            "created_utc": 1608759568.0,
                            "replies": [
                                {
                                    "body": "All good! It’s just language like that is why I think the twos chromosomes sub is beyond toxic...literally every way a guy can interact with a woman I have seen called creepy, and that attitude is really one of the main reasons I got out of the vanilla scene...work, the bar, the gym, public transit, the mall...I’ve all seen called “creepy” areas to approach a woman.",
                                    "author": "sdthrowout23",
                                    "id": "ggu903r",
                                    "parent_id": "t1_ggu438l",
                                    "score": 3,
                                    "created_utc": 1608762252.0,
                                    "replies": [
                                        {
                                            "body": "You're so right! I personally rarely get creeped out  so I hear what you're saying! Appreciate the call out.",
                                            "author": null,
                                            "id": "ggugfwc",
                                            "parent_id": "t1_ggu903r",
                                            "score": 3,
                                            "created_utc": 1608766217.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Just keep in mind, men's behavior is only creepy if you are unattractive.\n\nThat's like toxic feminity 101.",
                                            "author": "AdAlternative6041",
                                            "id": "gguiex1",
                                            "parent_id": "t1_ggu903r",
                                            "score": 3,
                                            "created_utc": 1608767289.0,
                                            "replies": [
                                                {
                                                    "body": "You're so right!!",
                                                    "author": null,
                                                    "id": "gguxxw3",
                                                    "parent_id": "t1_gguiex1",
                                                    "score": 3,
                                                    "created_utc": 1608775865.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "100x true.",
                                                    "author": "sdthrowout23",
                                                    "id": "gguqrjo",
                                                    "parent_id": "t1_gguiex1",
                                                    "score": 1,
                                                    "created_utc": 1608771919.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "No you’re the right, the guys creep and a fuckinf dumbass. Who pays for pics? You get free porn online. Why would anyone pay? It’s just these tik tok girls. It’s also the fucking simps paying for M&G and/or pics. Unreal.",
                                    "author": "Limitlesspappy",
                                    "id": "ggvi1w8",
                                    "parent_id": "t1_ggu438l",
                                    "score": -3,
                                    "created_utc": 1608788414.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ggtc1lr",
            "parent_id": "t3_kiwy1u",
            "score": 36,
            "created_utc": 1608744750.0,
            "replies": [
                {
                    "body": "This has been going on since TUMBLR days, it isnt anything new besides a new media platform. As a SB since 18, and now 30 its literally the same dialouge we had in our chats a decade ago",
                    "author": "SugarinCanada",
                    "id": "ggvis3c",
                    "parent_id": "t1_ggtc1lr",
                    "score": 7,
                    "created_utc": 1608788959.0,
                    "replies": []
                },
                {
                    "body": "Tik tok can be a huge echo chamber, but at least on Reddit ppl can sometimes start discussing and disagreements. \n\nOn tik tok it’s like the point is to be as edgy and as ridiculous as possible. All for the “humor” of course. I blame the culture on tiktok of pushing absurdist humor",
                    "author": "sexbobombd",
                    "id": "ggv2kk5",
                    "parent_id": "t1_ggtc1lr",
                    "score": 6,
                    "created_utc": 1608778499.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would argue that while the bowl is becoming saturated due to the awareness social media is bringing, these types of girls actually make it substantially easier for the high quality, educated, long-term SBs!\n\nLet me give you an example: Imagine Main Street in a large city with affluent residences. Now picture every corner with a restaurant... if they’re all fast food joints it would still be beneficial to open a $$$$ restaurant because there is market opportunity for that particular type of establishment, quality, and ambiance. \n\nI’m in some of the highest saturated cities and have absolutely no issue finding very lucrative arrangements with SDs despite the fact that I’m 30+ and have kids. Being educated, classy, sincere, and emotionally intelligent makes it easy to stand out from the 20-something girls with attitudes who don’t offer much emotional or intellectual value to an SD.",
            "author": "LVSugarBebe",
            "id": "ggudzpz",
            "parent_id": "t3_kiwy1u",
            "score": 16,
            "created_utc": 1608764817.0,
            "replies": [
                {
                    "body": "This is exactly how I feel about it, if you spend the time to refine yourself, generally healthy confidence follows suite. Great analogy btw !",
                    "author": "kirathekira",
                    "id": "ggw544l",
                    "parent_id": "t1_ggudzpz",
                    "score": 5,
                    "created_utc": 1608811649.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t care because I stand out more, but I’m also not 21. But I kind of do care that this is kind of like grooming a bunch of teenagers into sex work. Tiktok is rampant with that.",
            "author": "kirathekira",
            "id": "ggud0ft",
            "parent_id": "t3_kiwy1u",
            "score": 17,
            "created_utc": 1608764259.0,
            "replies": []
        },
        {
            "body": "agree - I only hope that, just like the women who did an OF page only to not be successful, that after awhile they will get bored and leave - stay strong, there are most of us out there weeding through the crap to find you.",
            "author": "thereadinessisall",
            "id": "ggtbfk1",
            "parent_id": "t3_kiwy1u",
            "score": 14,
            "created_utc": 1608744430.0,
            "replies": []
        },
        {
            "body": "They’re not sugar babies- they’re scam artists. Sugaring is MUTUALLY beneficial. Both parties should be having fun- the terms/ boundaries should be clear and honest, everyones happy. These girls just want to either 1. lead men on and take advantage of their money by lying about their intentions.  2. want to try to display themselves as “so desirable” men will pay them for absolutely no reason. Its bullshit.",
            "author": "lilbbdesi",
            "id": "gguk1dl",
            "parent_id": "t3_kiwy1u",
            "score": 10,
            "created_utc": 1608768215.0,
            "replies": []
        },
        {
            "body": "Seriously. I occupy a certain niche in which some of them ARE willing to pay for phone calls and splurge on M&Gs because that is more or less their kink, but even they are fed up with the bowl so much that I’ve seen so many wonderful SDs completely leave. It sickens me to see so many men treated so transactionally. Even if they wanted to be treated like a door mat, these ladies seem to forget that it’s fantasy at the end of the day and they still deserve basic human decency. Without it, the fantasy turns into just plain abuse.",
            "author": "Mistress-Myra",
            "id": "ggts3ln",
            "parent_id": "t3_kiwy1u",
            "score": 21,
            "created_utc": 1608753118.0,
            "replies": []
        },
        {
            "body": "I watched those videos after I met a potential SD and I laughed. He paid for my meal THATS IT. When we discussed allowance he told me it would be dinner then coming to his place. I have never heard of a SD paying for nothing or an online relationship.",
            "author": "Taralouise52",
            "id": "ggtp6bw",
            "parent_id": "t3_kiwy1u",
            "score": 7,
            "created_utc": 1608751567.0,
            "replies": []
        },
        {
            "body": "I’ve been wondering where all these aspiring SBs are getting their crazy ideas from—we get a lot of posts here from girls that hold notions that just seem bonkers to me, whether that’s charging for a phone call or men paying “just to have someone to talk to.” I think this must be where a lot of that misinformation is coming from.",
            "author": "WorfsCrazyChair",
            "id": "ggtb41o",
            "parent_id": "t3_kiwy1u",
            "score": 11,
            "created_utc": 1608744266.0,
            "replies": [
                {
                    "body": "Yep, these Tik toks are getting 300k likes each, some even more. It’s like an infestation",
                    "author": "lipglossbaby",
                    "id": "ggtba0z",
                    "parent_id": "t1_ggtb41o",
                    "score": 10,
                    "created_utc": 1608744352.0,
                    "replies": [
                        {
                            "body": "Can you link some for us?",
                            "author": "marker3000",
                            "id": "ggtcl0x",
                            "parent_id": "t1_ggtba0z",
                            "score": 4,
                            "created_utc": 1608745028.0,
                            "replies": [
                                {
                                    "body": "Yes - want to see what everyone is talking about.",
                                    "author": "HappyBear1952",
                                    "id": "ggtfzni",
                                    "parent_id": "t1_ggtcl0x",
                                    "score": 6,
                                    "created_utc": 1608746790.0,
                                    "replies": [
                                        {
                                            "body": "  [https://vm.tiktok.com/ZMJgmjGeT/](https://vm.tiktok.com/ZMJgmjGeT/)that's what another sb shared...if you sign in, then you're shown similar videos...teh comments are gold!",
                                            "author": "MiLocavida",
                                            "id": "ggtx1bz",
                                            "parent_id": "t1_ggtfzni",
                                            "score": 2,
                                            "created_utc": 1608755739.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "  [https://vm.tiktok.com/ZMJgmjGeT/](https://vm.tiktok.com/ZMJgmjGeT/)that's what another sb shared...if you sign in, then you're shown similar videos...teh comments are gold!",
                                    "author": "MiLocavida",
                                    "id": "ggtx0wj",
                                    "parent_id": "t1_ggtcl0x",
                                    "score": 3,
                                    "created_utc": 1608755732.0,
                                    "replies": [
                                        {
                                            "body": "This girls hot but shes selling to her audience of broke young women more than she's selling to men, guaranteed.",
                                            "author": "Persianx6",
                                            "id": "ggv37wt",
                                            "parent_id": "t1_ggtx0wj",
                                            "score": 7,
                                            "created_utc": 1608778866.0,
                                            "replies": [
                                                {
                                                    "body": "i think she found the secret sauce to monetize her tiktok...although not so familiar with tiktok...i just went into the comments and they are hilarious? Girl, how do i chat with these old men? hahahaha Girl, can you do a video on how to start a conversation?  Dang!",
                                                    "author": "MiLocavida",
                                                    "id": "ggv42wd",
                                                    "parent_id": "t1_ggv37wt",
                                                    "score": 2,
                                                    "created_utc": 1608779353.0,
                                                    "replies": [
                                                        {
                                                            "body": "Could be, could be she comes out in a month with a code for some hair products and clothes to monetize the attention she gets from young women.",
                                                            "author": "Persianx6",
                                                            "id": "ggv4p9w",
                                                            "parent_id": "t1_ggv42wd",
                                                            "score": 3,
                                                            "created_utc": 1608779723.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "i also just realized she has 707k followers on Tik Tok. Yeah you're right -- guaranteed she makes more off that than she does off men.",
                                                            "author": "Persianx6",
                                                            "id": "ggv54c2",
                                                            "parent_id": "t1_ggv42wd",
                                                            "score": 4,
                                                            "created_utc": 1608779973.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I think I am going to be sick. This makes me a bit mad.",
                                            "author": "ffreshindo",
                                            "id": "gguig2e",
                                            "parent_id": "t1_ggtx0wj",
                                            "score": 2,
                                            "created_utc": 1608767308.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "And then they complain about “scammers”. So surprised that people are trying to take advantage of their greediness by asking them to send $xxx to prove they are real.",
                    "author": "UnearthlyDinosaur",
                    "id": "ggtepo4",
                    "parent_id": "t1_ggtb41o",
                    "score": 1,
                    "created_utc": 1608746131.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Now I know why SA is flooding with online babies. The percentage is unreal like around 80%.",
            "author": "professorxc",
            "id": "gguuug1",
            "parent_id": "t3_kiwy1u",
            "score": 6,
            "created_utc": 1608774145.0,
            "replies": []
        },
        {
            "body": "TikTake and YouRube are ruining the bowl. I may have to set my age limit up to 30 from 25 as it is now.",
            "author": "EastTexas_SD",
            "id": "ggu5jec",
            "parent_id": "t3_kiwy1u",
            "score": 5,
            "created_utc": 1608760367.0,
            "replies": []
        },
        {
            "body": "\"Do girls really think that men are so desperate and lonely that they’ll pay for a phone call???\"    \n\n\nIsn't that what phone sex lines are based on?",
            "author": "sharksfanthrowaway",
            "id": "ggvazk8",
            "parent_id": "t3_kiwy1u",
            "score": 5,
            "created_utc": 1608783590.0,
            "replies": [
                {
                    "body": "Yes but that’s a specified field, this post is speaking directly about the sugar community",
                    "author": "lipglossbaby",
                    "id": "ggvbtc1",
                    "parent_id": "t1_ggvazk8",
                    "score": 2,
                    "created_utc": 1608784127.0,
                    "replies": [
                        {
                            "body": "I understand, but with the influx of women into the bowl with zero context of the \"rules\" means most might not see the difference.  Just sayin'",
                            "author": "sharksfanthrowaway",
                            "id": "ggvc17p",
                            "parent_id": "t1_ggvbtc1",
                            "score": 1,
                            "created_utc": 1608784267.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "These are the type of girls that think sugar is a \"side hustle\". I want no part of them.",
            "author": "mraspencer",
            "id": "ggteipp",
            "parent_id": "t3_kiwy1u",
            "score": 13,
            "created_utc": 1608746028.0,
            "replies": [
                {
                    "body": "I treat sugar like the relationship it is but financially it is one of my side hustles lol",
                    "author": "endlesslyanoptimist",
                    "id": "gguh876",
                    "parent_id": "t1_ggteipp",
                    "score": 6,
                    "created_utc": 1608766648.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have seen these and they piss me off! That's not how sugar relationships work. They scam people which is fucked up bc there after people who do want this kind of relationship. Every part of it, not just the money part. Then all these girls are mad in the comments that they've not had any luck. Like of course, you're looking at the wrong place for money. If you don't want sugar then your chances are so low of getting platonic or online only. Such horrible expectations",
            "author": "hcr24",
            "id": "ggu4uz5",
            "parent_id": "t3_kiwy1u",
            "score": 3,
            "created_utc": 1608759994.0,
            "replies": []
        },
        {
            "body": "They are mildly annoying and nothing more.  For seasoned SD’s is just provides a good chuckle.  For the girls that believe this BS it’s a recipe for frustration.  Their advice is laughable at best.  Those of us who have been around awhile know that time kills all arrangements.  If we are not meeting within a few days we are not meeting.",
            "author": "LotBuilder",
            "id": "ggv3rz4",
            "parent_id": "t3_kiwy1u",
            "score": 4,
            "created_utc": 1608779180.0,
            "replies": []
        },
        {
            "body": "No, do not worry, TikTok and other influencer sites will not ruin the bowl.\n\nThe sugar babies who are open to meet in person, understand what a sugar relationship entails, are open to learn and try new things, and put effort into it will do well.\n\nThere was always a segment of wannabe sugar babies (and pretend-to-be sugar daddies too) that signed up on sugar sites to scam or otherwise take advantage of the other party. Yes, there are increasingly more of these people. They do spoil the bowl, and make it more difficult to find the right partner. They make the search experience worse, and as a result everyone gets more cautious and guarded. However, this has been a long term trend that began way before TokTok was around.\n\nBut real babies with real intentions will find real daddies who take care of them. The rest is just noise.",
            "author": "Red_Baron_17",
            "id": "ggtdj4i",
            "parent_id": "t3_kiwy1u",
            "score": 6,
            "created_utc": 1608745514.0,
            "replies": [
                {
                    "body": "This this this. I was talking to my friends last night and they were saying how they aren’t successful in the bowl and how they require $$$ for m&g but after the m&g they don’t hear from them again. They were asking me advice on how I found such an awesome SD and one of the things I said was “I didn’t take advice from tiktok.” If you’re going to put in shit effort you’re going to get shit results. My SD is amazing to me because I’m equally as amazing to him (not to toot my own horn). I don’t require $$$ for m+g because there is no need. I want to get to know someone first. Some of these girls are really trying to spoil the bowl, but they won’t last very long. A SR is not “easy money” and they don’t seem to get that. When it becomes “too difficult” they’ll fly away to OF.",
                    "author": "keepmysecretxo",
                    "id": "ggu21vb",
                    "parent_id": "t1_ggtdj4i",
                    "score": 4,
                    "created_utc": 1608758467.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I usually find that almost any reference to sugar relationships in the major media or social media such as tiktok is complete misinformation.  All of those sources are just out to accumulate views - and what better way to do that than put sexy women for the men, and tell women they can earn huge amounts by dancing around online.",
            "author": "HappyBear1952",
            "id": "ggtij0j",
            "parent_id": "t3_kiwy1u",
            "score": 3,
            "created_utc": 1608748114.0,
            "replies": []
        },
        {
            "body": "Good luck to her, but this type of stuff was happening before Tik Tok, some girls would be interviewed and say stuff like this. More power to them. \n\nBut, I dont give any money to anyone I haven't seen in person. I have plenty of people that I can talk to for free.",
            "author": "gamrguypb",
            "id": "ggwclr0",
            "parent_id": "t3_kiwy1u",
            "score": 3,
            "created_utc": 1608818271.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ggtcr30",
            "parent_id": "t3_kiwy1u",
            "score": 8,
            "created_utc": 1608745115.0,
            "replies": []
        },
        {
            "body": "Yes we are aware and it sucks! I’d say 75% of the new girls on Seeking Arrangement will have some version of this online or platonic only on their profiles. Almost every single one has watched those Tik tok videos claiming they can make all of this money. \n\nIt ruins it for the SB’s that actually want a real sugar relationship.",
            "author": "Fun_Focus8159",
            "id": "ggtb0vu",
            "parent_id": "t3_kiwy1u",
            "score": 7,
            "created_utc": 1608744221.0,
            "replies": [
                {
                    "body": "Exactly! And I’m not even 100% against girls who want online only. If that’s what you want, be direct about it don’t try to scam everyone. Even though you probably won’t find an online SD, there’s always a diamond in the rough. Do you but don’t drag everyone down with you",
                    "author": "lipglossbaby",
                    "id": "ggtb5vl",
                    "parent_id": "t1_ggtb0vu",
                    "score": 7,
                    "created_utc": 1608744293.0,
                    "replies": []
                },
                {
                    "body": "I’ve found some of those ‘platonic only’ are there for plausible deniability.",
                    "author": "JBWentworth",
                    "id": "ggtt399",
                    "parent_id": "t1_ggtb0vu",
                    "score": 2,
                    "created_utc": 1608753642.0,
                    "replies": [
                        {
                            "body": "Agreed. Ive been intimate with 2 SB’s that started out as “platonic only” then switched when they realized they wouldn’t be able to find a SD being platonic lol.",
                            "author": "Fun_Focus8159",
                            "id": "ggtup91",
                            "parent_id": "t1_ggtt399",
                            "score": 2,
                            "created_utc": 1608754494.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Men *do* pay for these things. The online SW industry is *booming*. The real issue here is these girls calling what they’re doing sugaring instead of what it actually is.",
            "author": "FoxyFreckles1989",
            "id": "gguggur",
            "parent_id": "t3_kiwy1u",
            "score": 5,
            "created_utc": 1608766232.0,
            "replies": [
                {
                    "body": "Yes exactly!! It’s all about your platform",
                    "author": "lipglossbaby",
                    "id": "gguns84",
                    "parent_id": "t1_gguggur",
                    "score": 3,
                    "created_utc": 1608770272.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gwq8btg",
                    "parent_id": "t1_gguggur",
                    "score": 1,
                    "created_utc": 1620001985.0,
                    "replies": [
                        {
                            "body": "I’m sorry, what made you decide commenting on something I said *130 days ago* was a good idea? Lmao!\n\nI am actually no longer sugaring, but even when I was, I was in long term relationships with SDs I greatly cared for and shared my life with. My OF was SW. I have no issue with SW or the fact that I’ve been a SWer. My entire family knows. My SRs were not SW. I didn’t even have sex with my last SD (it wasn’t what he was looking for, and I was fine with that; we were intimate but not sexual). \n\nRegardless, that has nothing to do with what I said, which involved the fact that girls calling selling sexual content online/sexting/camming/whatever else sugaring. It isn’t. In some cases, sugaring can be SW, but not all SW is sugaring, and calling other forms of SW sugaring harms the community as a whole.",
                            "author": "FoxyFreckles1989",
                            "id": "gwq8pct",
                            "parent_id": "t1_gwq8btg",
                            "score": 1,
                            "created_utc": 1620002187.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The one video I saw said she had a take rate of 2%. I did the math and to make what she says she’s making she has to interact with 525 guys a week, which means that in a major metropolitan area in 6 weeks she would go through **all** the guys on SA. When does she sleep?!\n\nNow multiply this by a bazillion girls doing it and you see the problem. \n\nOn the upside, this crowd is going to multi-rinse the SDs so fast that it should burn itself pretty quickly. Think of it as a virus like Ebola — the R0 is so high, and it kills so quickly that it can’t sustain itself.\n\nIn other news, I’d posted a long time ago that OnlyFans accounts have to keep “escalating” in order to keep their fans and that’s playing out with a SB I did a M&G with who decided to go the “online” route ... she’s up to making M-F sex videos to keep the money coming in. Not my money, by the way; she texted to suggest I check it out and I passed. Sometimes the bowl brings out more the “daddy” in me than the “sugar”.",
            "author": "LaGriffeDuLion",
            "id": "ggu1jb6",
            "parent_id": "t3_kiwy1u",
            "score": 5,
            "created_utc": 1608758185.0,
            "replies": []
        },
        {
            "body": "Yup! I see them! Very annoying. I remember commenting on a SD’s post telling him that his issue seemed like the “SB” was leaning toward the sugaring without sugar trend. There are even YouTube channels dedicated to doing what you described. It makes it harder for us genuine babies.",
            "author": "littlemelaninmonroe",
            "id": "ggtr1jz",
            "parent_id": "t3_kiwy1u",
            "score": 2,
            "created_utc": 1608752558.0,
            "replies": []
        },
        {
            "body": "All I get are pro Trump right wing videos",
            "author": "mandingoBBC",
            "id": "ggv68x7",
            "parent_id": "t3_kiwy1u",
            "score": 2,
            "created_utc": 1608780643.0,
            "replies": []
        },
        {
            "body": "Ah them youth. Im 30, In the bowl. First it was myspace, then the dirty, then reddit, then insta, then snap. It continues. It would blow your mind what SA was like 10 years, even 15, lil grasshopper lol",
            "author": "SugarinCanada",
            "id": "ggvink1",
            "parent_id": "t3_kiwy1u",
            "score": 2,
            "created_utc": 1608788865.0,
            "replies": []
        },
        {
            "body": "I know this is unpopular, but we need tiktok (and similar), as it makes the bowl **better.**  McDonalds advertises (i.e. lies about) thick, juicy cheeseburgers, and we all know their actual product is garbage. But if they did no advertising (no lying), they would go out of business. Some fraction of tiktok girls become real SBs, and they would not be sugar babies at all, except for the fact that advertising lied to them, to get them to try it out.  Without sbs, there would be no site at all to match sbs and sds.\n#\nI hope tiktok girls learn the broader lesson about sales, but its irrelevant. Sugar babies wont find their way to seeking without the usual amount of fraud involved in every advertisement you see.",
            "author": "TastySpermDispenser",
            "id": "ggtgcri",
            "parent_id": "t3_kiwy1u",
            "score": 5,
            "created_utc": 1608746979.0,
            "replies": [
                {
                    "body": "Agreed.",
                    "author": null,
                    "id": "ggtk0bt",
                    "parent_id": "t1_ggtgcri",
                    "score": 3,
                    "created_utc": 1608748878.0,
                    "replies": []
                },
                {
                    "body": "What are you trying to say about McDonalds?! This ridiculous slander will not stand!",
                    "author": "bizownersd",
                    "id": "ggvg9q6",
                    "parent_id": "t1_ggtgcri",
                    "score": 2,
                    "created_utc": 1608787131.0,
                    "replies": []
                },
                {
                    "body": "Hot take. I agree! WE are the top dogs.",
                    "author": "AsianBabyGirlie",
                    "id": "ggtvy36",
                    "parent_id": "t1_ggtgcri",
                    "score": 0,
                    "created_utc": 1608755151.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The TikToks vids are about as real as the IG girls without photoshop, as seen on [/r/Instagramreality/](https://www.reddit.com/r/Instagramreality/) just because you see it there doesn't mean it's actually happening. And all the girls that now flood SA in hopes of becoming platonic millionaires will soon realize that it's not going to happen. \n\nNo worries, they are no competition. Just something to filter.",
            "author": "dontcallmechristian",
            "id": "ggtjxa4",
            "parent_id": "t3_kiwy1u",
            "score": 2,
            "created_utc": 1608748834.0,
            "replies": []
        },
        {
            "body": "I view the TikTok SB crowd as a virus that preys on weak SDs.  They will disappear when they have consumed the supply chain.",
            "author": "hal99514",
            "id": "ggtjxte",
            "parent_id": "t3_kiwy1u",
            "score": 1,
            "created_utc": 1608748841.0,
            "replies": []
        },
        {
            "body": "I actually have a sentence in my otherwise-positive profile asking the reader if they’re smart enough to not believe the tiktok hype",
            "author": "timrid",
            "id": "gguffzg",
            "parent_id": "t3_kiwy1u",
            "score": 1,
            "created_utc": 1608765650.0,
            "replies": []
        },
        {
            "body": "What’s FYP?",
            "author": "b_barbie",
            "id": "ggvbvea",
            "parent_id": "t3_kiwy1u",
            "score": 1,
            "created_utc": 1608784163.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ggvdixk",
                    "parent_id": "t1_ggvbvea",
                    "score": 2,
                    "created_utc": 1608785252.0,
                    "replies": [
                        {
                            "body": "Ahh. Thanks 😊",
                            "author": "b_barbie",
                            "id": "ggve0zh",
                            "parent_id": "t1_ggvdixk",
                            "score": 1,
                            "created_utc": 1608785581.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I was trying to report the video but I couldn’t figure out how! These girls are scamming great guys and making it hard for them to trust regular SBs",
            "author": "SnooMuffins4170",
            "id": "ggvkhxq",
            "parent_id": "t3_kiwy1u",
            "score": 1,
            "created_utc": 1608790286.0,
            "replies": []
        },
        {
            "body": "I’m starting to think it’s better to stay away from younger SBs now. If they cannot think for themselves and rely on social media to make decisions for them, then they won’t be good SBs. Sad that they’ve become so entitled. Sooner or later their lack of empathy for other people will catch up to them. Their utter laziness and unwillingness to work will supersede any ability to make money on SA.",
            "author": "UnearthlyDinosaur",
            "id": "ggtej63",
            "parent_id": "t3_kiwy1u",
            "score": 1,
            "created_utc": 1608746035.0,
            "replies": [
                {
                    "body": "“I’m starting to think it’s better to stay away from younger SBs now.”\n\nWhile I totally understand, this is the problem that’s been affecting real younger SBs like myself. Missing a lot of POTs because I’m grouped in with the scammers",
                    "author": "lipglossbaby",
                    "id": "ggtf3kq",
                    "parent_id": "t1_ggtej63",
                    "score": 9,
                    "created_utc": 1608746331.0,
                    "replies": [
                        {
                            "body": "I think everyone should clearly state what they’re looking for in their SA profile, so there’s no confusion, or wasted time. Lots of these online/platonic girls have such vague profiles that it’s hard to tell what the hell they’re looking for until you start talking to them lol. A lot of them say they want a mutually beneficial relationship then say they want platonic only. A lot say they want an emotional connection then say they want something online only. Some have a platonic and a romance tag. I’m not a mind reader here, too many mixed signals! \n\nLipgloss baby it sounds like you’re looking for a traditional SD/SB in-person relationship and I commend you for that. I’m sure you have that written in your SA profile, but if you don’t, I suggest you do!",
                            "author": "Fun_Focus8159",
                            "id": "ggtpx2d",
                            "parent_id": "t1_ggtf3kq",
                            "score": 2,
                            "created_utc": 1608751958.0,
                            "replies": [
                                {
                                    "body": "The problem is that the TikTok vids tell them to be vague about it. Or lie. Or it wouldn’t “work”.",
                                    "author": "LaGriffeDuLion",
                                    "id": "ggu3n4a",
                                    "parent_id": "t1_ggtpx2d",
                                    "score": 1,
                                    "created_utc": 1608759327.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yes and I apologize for generalizing. If you’re on this sub, it’s highly likely you’re not a rinser and in the bowl for the right reasons. Maybe if you put in your profile that you’re looking for an in person relationship you won’t get lumped with them",
                            "author": "UnearthlyDinosaur",
                            "id": "ggtfxns",
                            "parent_id": "t1_ggtf3kq",
                            "score": 2,
                            "created_utc": 1608746762.0,
                            "replies": []
                        },
                        {
                            "body": "Hi, I’m relatively new here. This is a great discussion. I’m learning a lot. However, wouldn’t the fact that so many SBs are misleading, puts you in an advantageous position, since you are not following that route?",
                            "author": "Houtex90210",
                            "id": "ggtxs5k",
                            "parent_id": "t1_ggtf3kq",
                            "score": 1,
                            "created_utc": 1608756143.0,
                            "replies": []
                        },
                        {
                            "body": ">affecting real younger SBs like myself\n\n24 is the new minimum age for me. Every single 18-21 is like a tiktok sugarless baby",
                            "author": "bluelunarmonkey",
                            "id": "ggutw6a",
                            "parent_id": "t1_ggtf3kq",
                            "score": 1,
                            "created_utc": 1608773623.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes despicable, but guys obviously are that desperate if the girls are making money, no? \n\nOld guys are and young alike are willing to do just about anything for a taste, a peak, or a chance and when old $$ is about your only hope.\n\nSupply and demand!!",
            "author": "bookworm010101",
            "id": "ggtv1q6",
            "parent_id": "t3_kiwy1u",
            "score": 1,
            "created_utc": 1608754677.0,
            "replies": [
                {
                    "body": "I think the statement *\"if the girls are making money\"* is the key.\n\nI'm sure that those making the videos get something out of it if they get to be \"influencers\", or monetise their product.\n\nHowever, that doesn't mean that anyone following the advice makes a single cent.\n\nOld guys and young can get much much more than a taste or a peek for *free, gratis enfer nix* on porn sites. \n\nSo, sure, \"when old, $$ is your only hope\", but that's for full intimacy. That has been going on for thousands of years and is the standard typical sugar daddy and sugar baby deal.\n\nThere might be a lot of demand for a taste or a peek, but when it's free on the internet, the price for *that* is free.",
                    "author": "Mangotingthroneway",
                    "id": "gguj5sn",
                    "parent_id": "t1_ggtv1q6",
                    "score": 5,
                    "created_utc": 1608767715.0,
                    "replies": []
                },
                {
                    "body": "Very true, I’ve def seen it I just don’t think they’re doing it in the right ways, it’s not really a sugar relationship they should be using to get the money out ya know",
                    "author": "lipglossbaby",
                    "id": "ggtvzmm",
                    "parent_id": "t1_ggtv1q6",
                    "score": 1,
                    "created_utc": 1608755175.0,
                    "replies": [
                        {
                            "body": "It is Capitalism in a way, no? They have guys using girls for paltry sums and ghosting these girls are saying, \"wait, you want me, my body, my looks\" and are being scandalous, but guys are dumb.\n\nHence why most SDs are married, yet claim \"dead in the bedroom, no really, wife says I can\" or outright lie no different then these girls. \n\nYou dont think the average wife at 45-55 doesnt want love, good sex, and to be spoiled and sought after? Do you think you will? Or no?\n\nI agree these girls are gaming the system, so to speak, but so do many guys as well.",
                            "author": "bookworm010101",
                            "id": "ggtx5br",
                            "parent_id": "t1_ggtvzmm",
                            "score": 0,
                            "created_utc": 1608755798.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "only loosers pay girls to have a meal with them Period.",
            "author": "hangar36",
            "id": "ggty1hk",
            "parent_id": "t3_kiwy1u",
            "score": -1,
            "created_utc": 1608756284.0,
            "replies": [
                {
                    "body": "Suggestion dont offer it upfront but be classy if they behave classy flip a little love doesn't have to be a killing",
                    "author": "Momopllc",
                    "id": "ggu2kgy",
                    "parent_id": "t1_ggty1hk",
                    "score": 3,
                    "created_utc": 1608758749.0,
                    "replies": [
                        {
                            "body": "exactly. if the meal and time (platonic always on the 1st date) was great then a little love for gas etc - a Benji",
                            "author": "hangar36",
                            "id": "ggu3lna",
                            "parent_id": "t1_ggu2kgy",
                            "score": 1,
                            "created_utc": 1608759306.0,
                            "replies": [
                                {
                                    "body": "Wow I get down voted cause I dont offer it upfront.....lmao sorry to offend someone but hey I have been doing this a while some girls are happy with making it on m&g a lone or paid dinners. But they baited and switched.....so you have to prove you are real.....if a guy doesn't gift you something rhan he isn't real either.\n\nSo it works both ways but you dont like that guys are no longer willing to pay for m&g blame all the scammed rinsers and tik tok guru's NOT us.\n\nSorry get over yourself who ever down voted that.  You need professional assistance",
                                    "author": "Momopllc",
                                    "id": "ggu5lx9",
                                    "parent_id": "t1_ggu3lna",
                                    "score": 2,
                                    "created_utc": 1608760405.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "No. It’s common af in sugaring.",
                    "author": "lipglossbaby",
                    "id": "ggty4t0",
                    "parent_id": "t1_ggty1hk",
                    "score": -1,
                    "created_utc": 1608756334.0,
                    "replies": []
                },
                {
                    "body": "Only brokes think whales don't have enough money to spend/waste however they like.  I know a guy whose girl bought a purse that costs xxxx with his card & he doesn't even know to this day.  Even if he found out he wouldn't care cause he also gave a (male) friend xxx to get lap dances from girls & throw money around all the time.  I know another guy who spends 10k a month on online games here & there.  There's girls getting xxxx to dine, drink, & gamble in vegas.  Don't think paying for dinner is loser mentality compared to paying for sex.  You are paying for services & a person's time regardless so it's just a choice of what you find as something you can afford.",
                    "author": null,
                    "id": "gqnyrk0",
                    "parent_id": "t1_ggty1hk",
                    "score": 1,
                    "created_utc": 1615531009.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hey when I was new and trusting I would send giftcard etc on a whim, but that adds up \n\nAfter thousands you wise up and I no longer front anything I will pay for Uber ride but thats it.  No longer paid m&g  I will flip them something if they act with class and courtesy, show up near on time, not a slob and match their pics .  So tired of what ends up pics from two  years ago ago and two dress sizes and the claim of slim was true two years ago.  \n\nSo act with class and empathy and ye shall be rewarded, act like a scammed and you can make it work for a while.  But it ends.\n\nI actually have flipped a gift card to well put together scam just because I was entertained and the really put the effort in .....they went for more of course and I was honest hey it a scam as I called your employer looking for you a long time ago, they never hear of you and there are no women in that department, lol they tried to be offended I laughed I said hey I was entertained and paid for that value but im not sending anymore.  They were not happy but hey we can meet anytime.\n\nBut yes the scam request have come out of the wood work and it hurts thr real thing but you will stand out and you end uo getting a lot more plus an actual relationship that may add more benefits than what you thought in beginning.\n\nJust recognize the routine quick for SDs money for nothing and kicks for free dont work, don't reward anyone anymore until they prove themselves.  Sad but it is what it is",
            "author": "Momopllc",
            "id": "ggu28p7",
            "parent_id": "t3_kiwy1u",
            "score": 0,
            "created_utc": 1608758570.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "ggu28rn",
                    "parent_id": "t1_ggu28p7",
                    "score": 0,
                    "created_utc": 1608758571.0,
                    "replies": [
                        {
                            "body": "Hey I posted number not in relation to ppm or allowance",
                            "author": "Momopllc",
                            "id": "ggu2zt4",
                            "parent_id": "t1_ggu28rn",
                            "score": 1,
                            "created_utc": 1608758979.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What's \"FYP\"? do you mean WYP?",
            "author": "JeaneyBowl",
            "id": "ggtjs3g",
            "parent_id": "t3_kiwy1u",
            "score": 1,
            "created_utc": 1608748760.0,
            "replies": [
                {
                    "body": "It means “for you page”. On tik tok you have two feeds, who you’re following feed & a feed that’s recommended to you",
                    "author": "lipglossbaby",
                    "id": "ggtjxnx",
                    "parent_id": "t1_ggtjs3g",
                    "score": 2,
                    "created_utc": 1608748839.0,
                    "replies": [
                        {
                            "body": "Thanks. I kinda hoped it means \"fuck your price\" after that failed website :)",
                            "author": "JeaneyBowl",
                            "id": "ggtkwqr",
                            "parent_id": "t1_ggtjxnx",
                            "score": 4,
                            "created_utc": 1608749342.0,
                            "replies": [
                                {
                                    "body": "LOL! Love this",
                                    "author": "mraspencer",
                                    "id": "gguhuzr",
                                    "parent_id": "t1_ggtkwqr",
                                    "score": 1,
                                    "created_utc": 1608767000.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tik Tok does not make my sugar rules, I do! That’s why I sugar.",
            "author": null,
            "id": "ggtn6uy",
            "parent_id": "t3_kiwy1u",
            "score": 1,
            "created_utc": 1608750531.0,
            "replies": []
        },
        {
            "body": "Nothing in tik tik got me so angry than those videos about “sugar babies”. The perception is just so fake and it ruins the way people look at that. Just as we were close to get it as something normal, being a scammer is normalized???",
            "author": "fructoseb4by",
            "id": "ggtupxq",
            "parent_id": "t3_kiwy1u",
            "score": 1,
            "created_utc": 1608754505.0,
            "replies": []
        },
        {
            "body": "Here is an analysis of the income numbers on Onlyfans.  Average adult content provider makes about $150 per month.  Hence, I would guess earning somewhere around $5 to $20 per hour there may be the norm for most women.  [https://www.xsrus.com/writing/explain/onlyfans/](https://www.xsrus.com/writing/explain/onlyfans/)",
            "author": "HappyBear1952",
            "id": "ggu1s1s",
            "parent_id": "t3_kiwy1u",
            "score": 1,
            "created_utc": 1608758319.0,
            "replies": [
                {
                    "body": "I'm always curious how I see SOOOO many OF girls that say they are in the top 1% or .5% or whatever on there. If that many are saying it, MANY of them are lying.",
                    "author": "mraspencer",
                    "id": "gguhyo9",
                    "parent_id": "t1_ggu1s1s",
                    "score": 3,
                    "created_utc": 1608767052.0,
                    "replies": [
                        {
                            "body": "I’ll keep in mind that 50% of statistics students graduate in the lower half their class. 😀😀",
                            "author": "HappyBear1952",
                            "id": "gguvqfe",
                            "parent_id": "t1_gguhyo9",
                            "score": 3,
                            "created_utc": 1608774638.0,
                            "replies": [
                                {
                                    "body": "🤣🤣🤣",
                                    "author": "mraspencer",
                                    "id": "ggvryji",
                                    "parent_id": "t1_gguvqfe",
                                    "score": 1,
                                    "created_utc": 1608797158.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This whole thread gotta bunch of misogynistic views and it doesnt sit well with me. As a trans person, I've had to call myself names and fetishes just to make a buck, being degraded and used for personal gain,  because of my own. So let's not jump down a YOUNG person's throat, ya know young as in our future and not a punching bag. Damn well could be a creep, till proven let's watch our mouths. #femalefriendly ♀️",
            "author": null,
            "id": "ggwlcth",
            "parent_id": "t3_kiwy1u",
            "score": 1,
            "created_utc": 1608824063.0,
            "replies": [
                {
                    "body": "Agreed.. it’s going in different directions than I intended & I don’t like how much hate they’re giving these girls and SW.",
                    "author": "lipglossbaby",
                    "id": "ggwow45",
                    "parent_id": "t1_ggwlcth",
                    "score": 2,
                    "created_utc": 1608826140.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's annoying and it is infecting the bowl like a virus, BUT.... These girls are idiots and the men who fall for their shit are also idiots.  They deserve each other.\n\nFor SDs it makes it harder to find a genuine SB that you get on with, but it was never easy anyway.",
            "author": "anonymoustruth_99",
            "id": "ggwnl2b",
            "parent_id": "t3_kiwy1u",
            "score": 1,
            "created_utc": 1608825382.0,
            "replies": []
        },
        {
            "body": "The bowl will be around after the nuclear Holocaust. \n\nTikTok let’s people pretend to be what they want. That’s all.",
            "author": null,
            "id": "ggwobs1",
            "parent_id": "t3_kiwy1u",
            "score": 1,
            "created_utc": 1608825812.0,
            "replies": []
        },
        {
            "body": "I think the ones that I have run into lately that are part of the TikTok fad are happily so egregiously transparent in their approach that within moments I am able to block them and move on.\n\nIn a lot of ways it dispenses with any of the bullshit and I can cull the herd extremely quickly. I leave those idiots to their own echo chamber.",
            "author": "SDRippington",
            "id": "ggwow03",
            "parent_id": "t3_kiwy1u",
            "score": 1,
            "created_utc": 1608826138.0,
            "replies": []
        },
        {
            "body": "Because that is not the game. The game is to get more likes and followers and to monetize that.",
            "author": "London-SD",
            "id": "ggtghqu",
            "parent_id": "t1_ggtcxns",
            "score": 78,
            "created_utc": 1608747051.0,
            "replies": []
        },
        {
            "body": "They do it for the reward of the greatest TikTok currency..... clout.",
            "author": "sidecar_ride",
            "id": "ggtptoe",
            "parent_id": "t1_ggtcxns",
            "score": 27,
            "created_utc": 1608751908.0,
            "replies": [
                {
                    "body": "Well they also get paid by TikTok. So essentially they are trying to monetize it so they don’t have to talk to old men to make money.",
                    "author": "MsDReid",
                    "id": "ggwmaqi",
                    "parent_id": "t1_ggtptoe",
                    "score": 1,
                    "created_utc": 1608824623.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They probably haven't rinsed a penny, it's just a way to say \"look how hot I am, men give me so much free cash just so watch me eat\"",
            "author": "JeaneyBowl",
            "id": "ggtk6hu",
            "parent_id": "t1_ggtcxns",
            "score": 41,
            "created_utc": 1608748966.0,
            "replies": [
                {
                    "body": "👆🏼👆🏼👆🏼👆🏼THIS!!!!",
                    "author": null,
                    "id": "ggu2ugt",
                    "parent_id": "t1_ggtk6hu",
                    "score": 12,
                    "created_utc": 1608758899.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep, yep, yep! She’s getting her money from the desperate SBs. \n\nI can’t imagine many women receiving a lucrative allowance (6-figure+) putting their face online and risking their SD being discovered when he takes her to a Gala or other high-profile event.",
            "author": "LVSugarBebe",
            "id": "gguei4l",
            "parent_id": "t1_ggtcxns",
            "score": 14,
            "created_utc": 1608765111.0,
            "replies": []
        },
        {
            "body": "This right here. She's just a marketer trying to grow a brand as an influencer. She's not actually as good as she claims. Remember that even Barbara Corcoran pretended to be Britney Spears' real estate agent when she was growing her brand. Some people just fake it until they make it.",
            "author": null,
            "id": "ggu4qs3",
            "parent_id": "t1_ggtcxns",
            "score": 11,
            "created_utc": 1608759932.0,
            "replies": []
        },
        {
            "body": "Even hot girls don't make that much rinsing dudes. 1) There's so many flakes, on both sides of the aisle and 2) men catch on and catch on quick, and as soon as they do they leave.",
            "author": "Persianx6",
            "id": "ggv4dxi",
            "parent_id": "t1_ggtcxns",
            "score": 8,
            "created_utc": 1608779532.0,
            "replies": []
        },
        {
            "body": "She wants you to sign up for her exclusive workshop on how to be a bitter rinser ?\n\nJust a guess. I’m sure there is a premium Snapchat for that",
            "author": "KnocDown",
            "id": "ggv9x4n",
            "parent_id": "t1_ggtcxns",
            "score": 4,
            "created_utc": 1608782908.0,
            "replies": []
        },
        {
            "body": "Oh... My single advice here (if you care about this girl, of course) : tell her to ASK her boyfriend to help her or to break up with him... And if he will say \"no\" to her question, she should leave him immediately: he is not a real man & doesn't care about her/her life /if she is dead or alive at all.... And nobody needs a boyfriend who doesn't care about your existance.",
            "author": "Gigi9662",
            "id": "ggvz8n7",
            "parent_id": "t1_ggtcyxh",
            "score": 4,
            "created_utc": 1608805155.0,
            "replies": []
        },
        {
            "body": "Ok...so I get what you are saying why is the guy automatically a creep? Tons of guys watch porn...are they all creeps? That is a very broad stroke if the brush.\n\nNow, I would maybe call him dumb, but a creep?",
            "author": "sdthrowout23",
            "id": "ggtqxbr",
            "parent_id": "t1_ggtcyxh",
            "score": 8,
            "created_utc": 1608752495.0,
            "replies": [
                {
                    "body": "You're absolutely right. I wasn't thinking about my language. He definitely could be an average Joe.",
                    "author": null,
                    "id": "ggu438l",
                    "parent_id": "t1_ggtqxbr",
                    "score": 15,
                    "created_utc": 1608759568.0,
                    "replies": [
                        {
                            "body": "All good! It’s just language like that is why I think the twos chromosomes sub is beyond toxic...literally every way a guy can interact with a woman I have seen called creepy, and that attitude is really one of the main reasons I got out of the vanilla scene...work, the bar, the gym, public transit, the mall...I’ve all seen called “creepy” areas to approach a woman.",
                            "author": "sdthrowout23",
                            "id": "ggu903r",
                            "parent_id": "t1_ggu438l",
                            "score": 3,
                            "created_utc": 1608762252.0,
                            "replies": [
                                {
                                    "body": "You're so right! I personally rarely get creeped out  so I hear what you're saying! Appreciate the call out.",
                                    "author": null,
                                    "id": "ggugfwc",
                                    "parent_id": "t1_ggu903r",
                                    "score": 3,
                                    "created_utc": 1608766217.0,
                                    "replies": []
                                },
                                {
                                    "body": "Just keep in mind, men's behavior is only creepy if you are unattractive.\n\nThat's like toxic feminity 101.",
                                    "author": "AdAlternative6041",
                                    "id": "gguiex1",
                                    "parent_id": "t1_ggu903r",
                                    "score": 3,
                                    "created_utc": 1608767289.0,
                                    "replies": [
                                        {
                                            "body": "You're so right!!",
                                            "author": null,
                                            "id": "gguxxw3",
                                            "parent_id": "t1_gguiex1",
                                            "score": 3,
                                            "created_utc": 1608775865.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "100x true.",
                                            "author": "sdthrowout23",
                                            "id": "gguqrjo",
                                            "parent_id": "t1_gguiex1",
                                            "score": 1,
                                            "created_utc": 1608771919.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "No you’re the right, the guys creep and a fuckinf dumbass. Who pays for pics? You get free porn online. Why would anyone pay? It’s just these tik tok girls. It’s also the fucking simps paying for M&G and/or pics. Unreal.",
                            "author": "Limitlesspappy",
                            "id": "ggvi1w8",
                            "parent_id": "t1_ggu438l",
                            "score": -3,
                            "created_utc": 1608788414.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This has been going on since TUMBLR days, it isnt anything new besides a new media platform. As a SB since 18, and now 30 its literally the same dialouge we had in our chats a decade ago",
            "author": "SugarinCanada",
            "id": "ggvis3c",
            "parent_id": "t1_ggtc1lr",
            "score": 7,
            "created_utc": 1608788959.0,
            "replies": []
        },
        {
            "body": "Tik tok can be a huge echo chamber, but at least on Reddit ppl can sometimes start discussing and disagreements. \n\nOn tik tok it’s like the point is to be as edgy and as ridiculous as possible. All for the “humor” of course. I blame the culture on tiktok of pushing absurdist humor",
            "author": "sexbobombd",
            "id": "ggv2kk5",
            "parent_id": "t1_ggtc1lr",
            "score": 6,
            "created_utc": 1608778499.0,
            "replies": []
        },
        {
            "body": "This is exactly how I feel about it, if you spend the time to refine yourself, generally healthy confidence follows suite. Great analogy btw !",
            "author": "kirathekira",
            "id": "ggw544l",
            "parent_id": "t1_ggudzpz",
            "score": 5,
            "created_utc": 1608811649.0,
            "replies": []
        },
        {
            "body": "Yep, these Tik toks are getting 300k likes each, some even more. It’s like an infestation",
            "author": "lipglossbaby",
            "id": "ggtba0z",
            "parent_id": "t1_ggtb41o",
            "score": 10,
            "created_utc": 1608744352.0,
            "replies": [
                {
                    "body": "Can you link some for us?",
                    "author": "marker3000",
                    "id": "ggtcl0x",
                    "parent_id": "t1_ggtba0z",
                    "score": 4,
                    "created_utc": 1608745028.0,
                    "replies": [
                        {
                            "body": "Yes - want to see what everyone is talking about.",
                            "author": "HappyBear1952",
                            "id": "ggtfzni",
                            "parent_id": "t1_ggtcl0x",
                            "score": 6,
                            "created_utc": 1608746790.0,
                            "replies": [
                                {
                                    "body": "  [https://vm.tiktok.com/ZMJgmjGeT/](https://vm.tiktok.com/ZMJgmjGeT/)that's what another sb shared...if you sign in, then you're shown similar videos...teh comments are gold!",
                                    "author": "MiLocavida",
                                    "id": "ggtx1bz",
                                    "parent_id": "t1_ggtfzni",
                                    "score": 2,
                                    "created_utc": 1608755739.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "  [https://vm.tiktok.com/ZMJgmjGeT/](https://vm.tiktok.com/ZMJgmjGeT/)that's what another sb shared...if you sign in, then you're shown similar videos...teh comments are gold!",
                            "author": "MiLocavida",
                            "id": "ggtx0wj",
                            "parent_id": "t1_ggtcl0x",
                            "score": 3,
                            "created_utc": 1608755732.0,
                            "replies": [
                                {
                                    "body": "This girls hot but shes selling to her audience of broke young women more than she's selling to men, guaranteed.",
                                    "author": "Persianx6",
                                    "id": "ggv37wt",
                                    "parent_id": "t1_ggtx0wj",
                                    "score": 7,
                                    "created_utc": 1608778866.0,
                                    "replies": [
                                        {
                                            "body": "i think she found the secret sauce to monetize her tiktok...although not so familiar with tiktok...i just went into the comments and they are hilarious? Girl, how do i chat with these old men? hahahaha Girl, can you do a video on how to start a conversation?  Dang!",
                                            "author": "MiLocavida",
                                            "id": "ggv42wd",
                                            "parent_id": "t1_ggv37wt",
                                            "score": 2,
                                            "created_utc": 1608779353.0,
                                            "replies": [
                                                {
                                                    "body": "Could be, could be she comes out in a month with a code for some hair products and clothes to monetize the attention she gets from young women.",
                                                    "author": "Persianx6",
                                                    "id": "ggv4p9w",
                                                    "parent_id": "t1_ggv42wd",
                                                    "score": 3,
                                                    "created_utc": 1608779723.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "i also just realized she has 707k followers on Tik Tok. Yeah you're right -- guaranteed she makes more off that than she does off men.",
                                                    "author": "Persianx6",
                                                    "id": "ggv54c2",
                                                    "parent_id": "t1_ggv42wd",
                                                    "score": 4,
                                                    "created_utc": 1608779973.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I think I am going to be sick. This makes me a bit mad.",
                                    "author": "ffreshindo",
                                    "id": "gguig2e",
                                    "parent_id": "t1_ggtx0wj",
                                    "score": 2,
                                    "created_utc": 1608767308.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And then they complain about “scammers”. So surprised that people are trying to take advantage of their greediness by asking them to send $xxx to prove they are real.",
            "author": "UnearthlyDinosaur",
            "id": "ggtepo4",
            "parent_id": "t1_ggtb41o",
            "score": 1,
            "created_utc": 1608746131.0,
            "replies": []
        },
        {
            "body": "Yes but that’s a specified field, this post is speaking directly about the sugar community",
            "author": "lipglossbaby",
            "id": "ggvbtc1",
            "parent_id": "t1_ggvazk8",
            "score": 2,
            "created_utc": 1608784127.0,
            "replies": [
                {
                    "body": "I understand, but with the influx of women into the bowl with zero context of the \"rules\" means most might not see the difference.  Just sayin'",
                    "author": "sharksfanthrowaway",
                    "id": "ggvc17p",
                    "parent_id": "t1_ggvbtc1",
                    "score": 1,
                    "created_utc": 1608784267.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I treat sugar like the relationship it is but financially it is one of my side hustles lol",
            "author": "endlesslyanoptimist",
            "id": "gguh876",
            "parent_id": "t1_ggteipp",
            "score": 6,
            "created_utc": 1608766648.0,
            "replies": []
        },
        {
            "body": "This this this. I was talking to my friends last night and they were saying how they aren’t successful in the bowl and how they require $$$ for m&g but after the m&g they don’t hear from them again. They were asking me advice on how I found such an awesome SD and one of the things I said was “I didn’t take advice from tiktok.” If you’re going to put in shit effort you’re going to get shit results. My SD is amazing to me because I’m equally as amazing to him (not to toot my own horn). I don’t require $$$ for m+g because there is no need. I want to get to know someone first. Some of these girls are really trying to spoil the bowl, but they won’t last very long. A SR is not “easy money” and they don’t seem to get that. When it becomes “too difficult” they’ll fly away to OF.",
            "author": "keepmysecretxo",
            "id": "ggu21vb",
            "parent_id": "t1_ggtdj4i",
            "score": 4,
            "created_utc": 1608758467.0,
            "replies": []
        },
        {
            "body": "Exactly! And I’m not even 100% against girls who want online only. If that’s what you want, be direct about it don’t try to scam everyone. Even though you probably won’t find an online SD, there’s always a diamond in the rough. Do you but don’t drag everyone down with you",
            "author": "lipglossbaby",
            "id": "ggtb5vl",
            "parent_id": "t1_ggtb0vu",
            "score": 7,
            "created_utc": 1608744293.0,
            "replies": []
        },
        {
            "body": "I’ve found some of those ‘platonic only’ are there for plausible deniability.",
            "author": "JBWentworth",
            "id": "ggtt399",
            "parent_id": "t1_ggtb0vu",
            "score": 2,
            "created_utc": 1608753642.0,
            "replies": [
                {
                    "body": "Agreed. Ive been intimate with 2 SB’s that started out as “platonic only” then switched when they realized they wouldn’t be able to find a SD being platonic lol.",
                    "author": "Fun_Focus8159",
                    "id": "ggtup91",
                    "parent_id": "t1_ggtt399",
                    "score": 2,
                    "created_utc": 1608754494.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes exactly!! It’s all about your platform",
            "author": "lipglossbaby",
            "id": "gguns84",
            "parent_id": "t1_gguggur",
            "score": 3,
            "created_utc": 1608770272.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gwq8btg",
            "parent_id": "t1_gguggur",
            "score": 1,
            "created_utc": 1620001985.0,
            "replies": [
                {
                    "body": "I’m sorry, what made you decide commenting on something I said *130 days ago* was a good idea? Lmao!\n\nI am actually no longer sugaring, but even when I was, I was in long term relationships with SDs I greatly cared for and shared my life with. My OF was SW. I have no issue with SW or the fact that I’ve been a SWer. My entire family knows. My SRs were not SW. I didn’t even have sex with my last SD (it wasn’t what he was looking for, and I was fine with that; we were intimate but not sexual). \n\nRegardless, that has nothing to do with what I said, which involved the fact that girls calling selling sexual content online/sexting/camming/whatever else sugaring. It isn’t. In some cases, sugaring can be SW, but not all SW is sugaring, and calling other forms of SW sugaring harms the community as a whole.",
                    "author": "FoxyFreckles1989",
                    "id": "gwq8pct",
                    "parent_id": "t1_gwq8btg",
                    "score": 1,
                    "created_utc": 1620002187.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed.",
            "author": null,
            "id": "ggtk0bt",
            "parent_id": "t1_ggtgcri",
            "score": 3,
            "created_utc": 1608748878.0,
            "replies": []
        },
        {
            "body": "What are you trying to say about McDonalds?! This ridiculous slander will not stand!",
            "author": "bizownersd",
            "id": "ggvg9q6",
            "parent_id": "t1_ggtgcri",
            "score": 2,
            "created_utc": 1608787131.0,
            "replies": []
        },
        {
            "body": "Hot take. I agree! WE are the top dogs.",
            "author": "AsianBabyGirlie",
            "id": "ggtvy36",
            "parent_id": "t1_ggtgcri",
            "score": 0,
            "created_utc": 1608755151.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ggvdixk",
            "parent_id": "t1_ggvbvea",
            "score": 2,
            "created_utc": 1608785252.0,
            "replies": [
                {
                    "body": "Ahh. Thanks 😊",
                    "author": "b_barbie",
                    "id": "ggve0zh",
                    "parent_id": "t1_ggvdixk",
                    "score": 1,
                    "created_utc": 1608785581.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“I’m starting to think it’s better to stay away from younger SBs now.”\n\nWhile I totally understand, this is the problem that’s been affecting real younger SBs like myself. Missing a lot of POTs because I’m grouped in with the scammers",
            "author": "lipglossbaby",
            "id": "ggtf3kq",
            "parent_id": "t1_ggtej63",
            "score": 9,
            "created_utc": 1608746331.0,
            "replies": [
                {
                    "body": "I think everyone should clearly state what they’re looking for in their SA profile, so there’s no confusion, or wasted time. Lots of these online/platonic girls have such vague profiles that it’s hard to tell what the hell they’re looking for until you start talking to them lol. A lot of them say they want a mutually beneficial relationship then say they want platonic only. A lot say they want an emotional connection then say they want something online only. Some have a platonic and a romance tag. I’m not a mind reader here, too many mixed signals! \n\nLipgloss baby it sounds like you’re looking for a traditional SD/SB in-person relationship and I commend you for that. I’m sure you have that written in your SA profile, but if you don’t, I suggest you do!",
                    "author": "Fun_Focus8159",
                    "id": "ggtpx2d",
                    "parent_id": "t1_ggtf3kq",
                    "score": 2,
                    "created_utc": 1608751958.0,
                    "replies": [
                        {
                            "body": "The problem is that the TikTok vids tell them to be vague about it. Or lie. Or it wouldn’t “work”.",
                            "author": "LaGriffeDuLion",
                            "id": "ggu3n4a",
                            "parent_id": "t1_ggtpx2d",
                            "score": 1,
                            "created_utc": 1608759327.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yes and I apologize for generalizing. If you’re on this sub, it’s highly likely you’re not a rinser and in the bowl for the right reasons. Maybe if you put in your profile that you’re looking for an in person relationship you won’t get lumped with them",
                    "author": "UnearthlyDinosaur",
                    "id": "ggtfxns",
                    "parent_id": "t1_ggtf3kq",
                    "score": 2,
                    "created_utc": 1608746762.0,
                    "replies": []
                },
                {
                    "body": "Hi, I’m relatively new here. This is a great discussion. I’m learning a lot. However, wouldn’t the fact that so many SBs are misleading, puts you in an advantageous position, since you are not following that route?",
                    "author": "Houtex90210",
                    "id": "ggtxs5k",
                    "parent_id": "t1_ggtf3kq",
                    "score": 1,
                    "created_utc": 1608756143.0,
                    "replies": []
                },
                {
                    "body": ">affecting real younger SBs like myself\n\n24 is the new minimum age for me. Every single 18-21 is like a tiktok sugarless baby",
                    "author": "bluelunarmonkey",
                    "id": "ggutw6a",
                    "parent_id": "t1_ggtf3kq",
                    "score": 1,
                    "created_utc": 1608773623.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think the statement *\"if the girls are making money\"* is the key.\n\nI'm sure that those making the videos get something out of it if they get to be \"influencers\", or monetise their product.\n\nHowever, that doesn't mean that anyone following the advice makes a single cent.\n\nOld guys and young can get much much more than a taste or a peek for *free, gratis enfer nix* on porn sites. \n\nSo, sure, \"when old, $$ is your only hope\", but that's for full intimacy. That has been going on for thousands of years and is the standard typical sugar daddy and sugar baby deal.\n\nThere might be a lot of demand for a taste or a peek, but when it's free on the internet, the price for *that* is free.",
            "author": "Mangotingthroneway",
            "id": "gguj5sn",
            "parent_id": "t1_ggtv1q6",
            "score": 5,
            "created_utc": 1608767715.0,
            "replies": []
        },
        {
            "body": "Very true, I’ve def seen it I just don’t think they’re doing it in the right ways, it’s not really a sugar relationship they should be using to get the money out ya know",
            "author": "lipglossbaby",
            "id": "ggtvzmm",
            "parent_id": "t1_ggtv1q6",
            "score": 1,
            "created_utc": 1608755175.0,
            "replies": [
                {
                    "body": "It is Capitalism in a way, no? They have guys using girls for paltry sums and ghosting these girls are saying, \"wait, you want me, my body, my looks\" and are being scandalous, but guys are dumb.\n\nHence why most SDs are married, yet claim \"dead in the bedroom, no really, wife says I can\" or outright lie no different then these girls. \n\nYou dont think the average wife at 45-55 doesnt want love, good sex, and to be spoiled and sought after? Do you think you will? Or no?\n\nI agree these girls are gaming the system, so to speak, but so do many guys as well.",
                    "author": "bookworm010101",
                    "id": "ggtx5br",
                    "parent_id": "t1_ggtvzmm",
                    "score": 0,
                    "created_utc": 1608755798.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Suggestion dont offer it upfront but be classy if they behave classy flip a little love doesn't have to be a killing",
            "author": "Momopllc",
            "id": "ggu2kgy",
            "parent_id": "t1_ggty1hk",
            "score": 3,
            "created_utc": 1608758749.0,
            "replies": [
                {
                    "body": "exactly. if the meal and time (platonic always on the 1st date) was great then a little love for gas etc - a Benji",
                    "author": "hangar36",
                    "id": "ggu3lna",
                    "parent_id": "t1_ggu2kgy",
                    "score": 1,
                    "created_utc": 1608759306.0,
                    "replies": [
                        {
                            "body": "Wow I get down voted cause I dont offer it upfront.....lmao sorry to offend someone but hey I have been doing this a while some girls are happy with making it on m&g a lone or paid dinners. But they baited and switched.....so you have to prove you are real.....if a guy doesn't gift you something rhan he isn't real either.\n\nSo it works both ways but you dont like that guys are no longer willing to pay for m&g blame all the scammed rinsers and tik tok guru's NOT us.\n\nSorry get over yourself who ever down voted that.  You need professional assistance",
                            "author": "Momopllc",
                            "id": "ggu5lx9",
                            "parent_id": "t1_ggu3lna",
                            "score": 2,
                            "created_utc": 1608760405.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No. It’s common af in sugaring.",
            "author": "lipglossbaby",
            "id": "ggty4t0",
            "parent_id": "t1_ggty1hk",
            "score": -1,
            "created_utc": 1608756334.0,
            "replies": []
        },
        {
            "body": "Only brokes think whales don't have enough money to spend/waste however they like.  I know a guy whose girl bought a purse that costs xxxx with his card & he doesn't even know to this day.  Even if he found out he wouldn't care cause he also gave a (male) friend xxx to get lap dances from girls & throw money around all the time.  I know another guy who spends 10k a month on online games here & there.  There's girls getting xxxx to dine, drink, & gamble in vegas.  Don't think paying for dinner is loser mentality compared to paying for sex.  You are paying for services & a person's time regardless so it's just a choice of what you find as something you can afford.",
            "author": null,
            "id": "gqnyrk0",
            "parent_id": "t1_ggty1hk",
            "score": 1,
            "created_utc": 1615531009.0,
            "replies": []
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "ggu28rn",
            "parent_id": "t1_ggu28p7",
            "score": 0,
            "created_utc": 1608758571.0,
            "replies": [
                {
                    "body": "Hey I posted number not in relation to ppm or allowance",
                    "author": "Momopllc",
                    "id": "ggu2zt4",
                    "parent_id": "t1_ggu28rn",
                    "score": 1,
                    "created_utc": 1608758979.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It means “for you page”. On tik tok you have two feeds, who you’re following feed & a feed that’s recommended to you",
            "author": "lipglossbaby",
            "id": "ggtjxnx",
            "parent_id": "t1_ggtjs3g",
            "score": 2,
            "created_utc": 1608748839.0,
            "replies": [
                {
                    "body": "Thanks. I kinda hoped it means \"fuck your price\" after that failed website :)",
                    "author": "JeaneyBowl",
                    "id": "ggtkwqr",
                    "parent_id": "t1_ggtjxnx",
                    "score": 4,
                    "created_utc": 1608749342.0,
                    "replies": [
                        {
                            "body": "LOL! Love this",
                            "author": "mraspencer",
                            "id": "gguhuzr",
                            "parent_id": "t1_ggtkwqr",
                            "score": 1,
                            "created_utc": 1608767000.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm always curious how I see SOOOO many OF girls that say they are in the top 1% or .5% or whatever on there. If that many are saying it, MANY of them are lying.",
            "author": "mraspencer",
            "id": "gguhyo9",
            "parent_id": "t1_ggu1s1s",
            "score": 3,
            "created_utc": 1608767052.0,
            "replies": [
                {
                    "body": "I’ll keep in mind that 50% of statistics students graduate in the lower half their class. 😀😀",
                    "author": "HappyBear1952",
                    "id": "gguvqfe",
                    "parent_id": "t1_gguhyo9",
                    "score": 3,
                    "created_utc": 1608774638.0,
                    "replies": [
                        {
                            "body": "🤣🤣🤣",
                            "author": "mraspencer",
                            "id": "ggvryji",
                            "parent_id": "t1_gguvqfe",
                            "score": 1,
                            "created_utc": 1608797158.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed.. it’s going in different directions than I intended & I don’t like how much hate they’re giving these girls and SW.",
            "author": "lipglossbaby",
            "id": "ggwow45",
            "parent_id": "t1_ggwlcth",
            "score": 2,
            "created_utc": 1608826140.0,
            "replies": []
        },
        {
            "body": "Well they also get paid by TikTok. So essentially they are trying to monetize it so they don’t have to talk to old men to make money.",
            "author": "MsDReid",
            "id": "ggwmaqi",
            "parent_id": "t1_ggtptoe",
            "score": 1,
            "created_utc": 1608824623.0,
            "replies": []
        },
        {
            "body": "👆🏼👆🏼👆🏼👆🏼THIS!!!!",
            "author": null,
            "id": "ggu2ugt",
            "parent_id": "t1_ggtk6hu",
            "score": 12,
            "created_utc": 1608758899.0,
            "replies": []
        },
        {
            "body": "You're absolutely right. I wasn't thinking about my language. He definitely could be an average Joe.",
            "author": null,
            "id": "ggu438l",
            "parent_id": "t1_ggtqxbr",
            "score": 15,
            "created_utc": 1608759568.0,
            "replies": [
                {
                    "body": "All good! It’s just language like that is why I think the twos chromosomes sub is beyond toxic...literally every way a guy can interact with a woman I have seen called creepy, and that attitude is really one of the main reasons I got out of the vanilla scene...work, the bar, the gym, public transit, the mall...I’ve all seen called “creepy” areas to approach a woman.",
                    "author": "sdthrowout23",
                    "id": "ggu903r",
                    "parent_id": "t1_ggu438l",
                    "score": 3,
                    "created_utc": 1608762252.0,
                    "replies": [
                        {
                            "body": "You're so right! I personally rarely get creeped out  so I hear what you're saying! Appreciate the call out.",
                            "author": null,
                            "id": "ggugfwc",
                            "parent_id": "t1_ggu903r",
                            "score": 3,
                            "created_utc": 1608766217.0,
                            "replies": []
                        },
                        {
                            "body": "Just keep in mind, men's behavior is only creepy if you are unattractive.\n\nThat's like toxic feminity 101.",
                            "author": "AdAlternative6041",
                            "id": "gguiex1",
                            "parent_id": "t1_ggu903r",
                            "score": 3,
                            "created_utc": 1608767289.0,
                            "replies": [
                                {
                                    "body": "You're so right!!",
                                    "author": null,
                                    "id": "gguxxw3",
                                    "parent_id": "t1_gguiex1",
                                    "score": 3,
                                    "created_utc": 1608775865.0,
                                    "replies": []
                                },
                                {
                                    "body": "100x true.",
                                    "author": "sdthrowout23",
                                    "id": "gguqrjo",
                                    "parent_id": "t1_gguiex1",
                                    "score": 1,
                                    "created_utc": 1608771919.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "No you’re the right, the guys creep and a fuckinf dumbass. Who pays for pics? You get free porn online. Why would anyone pay? It’s just these tik tok girls. It’s also the fucking simps paying for M&G and/or pics. Unreal.",
                    "author": "Limitlesspappy",
                    "id": "ggvi1w8",
                    "parent_id": "t1_ggu438l",
                    "score": -3,
                    "created_utc": 1608788414.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can you link some for us?",
            "author": "marker3000",
            "id": "ggtcl0x",
            "parent_id": "t1_ggtba0z",
            "score": 4,
            "created_utc": 1608745028.0,
            "replies": [
                {
                    "body": "Yes - want to see what everyone is talking about.",
                    "author": "HappyBear1952",
                    "id": "ggtfzni",
                    "parent_id": "t1_ggtcl0x",
                    "score": 6,
                    "created_utc": 1608746790.0,
                    "replies": [
                        {
                            "body": "  [https://vm.tiktok.com/ZMJgmjGeT/](https://vm.tiktok.com/ZMJgmjGeT/)that's what another sb shared...if you sign in, then you're shown similar videos...teh comments are gold!",
                            "author": "MiLocavida",
                            "id": "ggtx1bz",
                            "parent_id": "t1_ggtfzni",
                            "score": 2,
                            "created_utc": 1608755739.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "  [https://vm.tiktok.com/ZMJgmjGeT/](https://vm.tiktok.com/ZMJgmjGeT/)that's what another sb shared...if you sign in, then you're shown similar videos...teh comments are gold!",
                    "author": "MiLocavida",
                    "id": "ggtx0wj",
                    "parent_id": "t1_ggtcl0x",
                    "score": 3,
                    "created_utc": 1608755732.0,
                    "replies": [
                        {
                            "body": "This girls hot but shes selling to her audience of broke young women more than she's selling to men, guaranteed.",
                            "author": "Persianx6",
                            "id": "ggv37wt",
                            "parent_id": "t1_ggtx0wj",
                            "score": 7,
                            "created_utc": 1608778866.0,
                            "replies": [
                                {
                                    "body": "i think she found the secret sauce to monetize her tiktok...although not so familiar with tiktok...i just went into the comments and they are hilarious? Girl, how do i chat with these old men? hahahaha Girl, can you do a video on how to start a conversation?  Dang!",
                                    "author": "MiLocavida",
                                    "id": "ggv42wd",
                                    "parent_id": "t1_ggv37wt",
                                    "score": 2,
                                    "created_utc": 1608779353.0,
                                    "replies": [
                                        {
                                            "body": "Could be, could be she comes out in a month with a code for some hair products and clothes to monetize the attention she gets from young women.",
                                            "author": "Persianx6",
                                            "id": "ggv4p9w",
                                            "parent_id": "t1_ggv42wd",
                                            "score": 3,
                                            "created_utc": 1608779723.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "i also just realized she has 707k followers on Tik Tok. Yeah you're right -- guaranteed she makes more off that than she does off men.",
                                            "author": "Persianx6",
                                            "id": "ggv54c2",
                                            "parent_id": "t1_ggv42wd",
                                            "score": 4,
                                            "created_utc": 1608779973.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I think I am going to be sick. This makes me a bit mad.",
                            "author": "ffreshindo",
                            "id": "gguig2e",
                            "parent_id": "t1_ggtx0wj",
                            "score": 2,
                            "created_utc": 1608767308.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I understand, but with the influx of women into the bowl with zero context of the \"rules\" means most might not see the difference.  Just sayin'",
            "author": "sharksfanthrowaway",
            "id": "ggvc17p",
            "parent_id": "t1_ggvbtc1",
            "score": 1,
            "created_utc": 1608784267.0,
            "replies": []
        },
        {
            "body": "Agreed. Ive been intimate with 2 SB’s that started out as “platonic only” then switched when they realized they wouldn’t be able to find a SD being platonic lol.",
            "author": "Fun_Focus8159",
            "id": "ggtup91",
            "parent_id": "t1_ggtt399",
            "score": 2,
            "created_utc": 1608754494.0,
            "replies": []
        },
        {
            "body": "I’m sorry, what made you decide commenting on something I said *130 days ago* was a good idea? Lmao!\n\nI am actually no longer sugaring, but even when I was, I was in long term relationships with SDs I greatly cared for and shared my life with. My OF was SW. I have no issue with SW or the fact that I’ve been a SWer. My entire family knows. My SRs were not SW. I didn’t even have sex with my last SD (it wasn’t what he was looking for, and I was fine with that; we were intimate but not sexual). \n\nRegardless, that has nothing to do with what I said, which involved the fact that girls calling selling sexual content online/sexting/camming/whatever else sugaring. It isn’t. In some cases, sugaring can be SW, but not all SW is sugaring, and calling other forms of SW sugaring harms the community as a whole.",
            "author": "FoxyFreckles1989",
            "id": "gwq8pct",
            "parent_id": "t1_gwq8btg",
            "score": 1,
            "created_utc": 1620002187.0,
            "replies": []
        },
        {
            "body": "Ahh. Thanks 😊",
            "author": "b_barbie",
            "id": "ggve0zh",
            "parent_id": "t1_ggvdixk",
            "score": 1,
            "created_utc": 1608785581.0,
            "replies": []
        },
        {
            "body": "I think everyone should clearly state what they’re looking for in their SA profile, so there’s no confusion, or wasted time. Lots of these online/platonic girls have such vague profiles that it’s hard to tell what the hell they’re looking for until you start talking to them lol. A lot of them say they want a mutually beneficial relationship then say they want platonic only. A lot say they want an emotional connection then say they want something online only. Some have a platonic and a romance tag. I’m not a mind reader here, too many mixed signals! \n\nLipgloss baby it sounds like you’re looking for a traditional SD/SB in-person relationship and I commend you for that. I’m sure you have that written in your SA profile, but if you don’t, I suggest you do!",
            "author": "Fun_Focus8159",
            "id": "ggtpx2d",
            "parent_id": "t1_ggtf3kq",
            "score": 2,
            "created_utc": 1608751958.0,
            "replies": [
                {
                    "body": "The problem is that the TikTok vids tell them to be vague about it. Or lie. Or it wouldn’t “work”.",
                    "author": "LaGriffeDuLion",
                    "id": "ggu3n4a",
                    "parent_id": "t1_ggtpx2d",
                    "score": 1,
                    "created_utc": 1608759327.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes and I apologize for generalizing. If you’re on this sub, it’s highly likely you’re not a rinser and in the bowl for the right reasons. Maybe if you put in your profile that you’re looking for an in person relationship you won’t get lumped with them",
            "author": "UnearthlyDinosaur",
            "id": "ggtfxns",
            "parent_id": "t1_ggtf3kq",
            "score": 2,
            "created_utc": 1608746762.0,
            "replies": []
        },
        {
            "body": "Hi, I’m relatively new here. This is a great discussion. I’m learning a lot. However, wouldn’t the fact that so many SBs are misleading, puts you in an advantageous position, since you are not following that route?",
            "author": "Houtex90210",
            "id": "ggtxs5k",
            "parent_id": "t1_ggtf3kq",
            "score": 1,
            "created_utc": 1608756143.0,
            "replies": []
        },
        {
            "body": ">affecting real younger SBs like myself\n\n24 is the new minimum age for me. Every single 18-21 is like a tiktok sugarless baby",
            "author": "bluelunarmonkey",
            "id": "ggutw6a",
            "parent_id": "t1_ggtf3kq",
            "score": 1,
            "created_utc": 1608773623.0,
            "replies": []
        },
        {
            "body": "It is Capitalism in a way, no? They have guys using girls for paltry sums and ghosting these girls are saying, \"wait, you want me, my body, my looks\" and are being scandalous, but guys are dumb.\n\nHence why most SDs are married, yet claim \"dead in the bedroom, no really, wife says I can\" or outright lie no different then these girls. \n\nYou dont think the average wife at 45-55 doesnt want love, good sex, and to be spoiled and sought after? Do you think you will? Or no?\n\nI agree these girls are gaming the system, so to speak, but so do many guys as well.",
            "author": "bookworm010101",
            "id": "ggtx5br",
            "parent_id": "t1_ggtvzmm",
            "score": 0,
            "created_utc": 1608755798.0,
            "replies": []
        },
        {
            "body": "exactly. if the meal and time (platonic always on the 1st date) was great then a little love for gas etc - a Benji",
            "author": "hangar36",
            "id": "ggu3lna",
            "parent_id": "t1_ggu2kgy",
            "score": 1,
            "created_utc": 1608759306.0,
            "replies": [
                {
                    "body": "Wow I get down voted cause I dont offer it upfront.....lmao sorry to offend someone but hey I have been doing this a while some girls are happy with making it on m&g a lone or paid dinners. But they baited and switched.....so you have to prove you are real.....if a guy doesn't gift you something rhan he isn't real either.\n\nSo it works both ways but you dont like that guys are no longer willing to pay for m&g blame all the scammed rinsers and tik tok guru's NOT us.\n\nSorry get over yourself who ever down voted that.  You need professional assistance",
                    "author": "Momopllc",
                    "id": "ggu5lx9",
                    "parent_id": "t1_ggu3lna",
                    "score": 2,
                    "created_utc": 1608760405.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hey I posted number not in relation to ppm or allowance",
            "author": "Momopllc",
            "id": "ggu2zt4",
            "parent_id": "t1_ggu28rn",
            "score": 1,
            "created_utc": 1608758979.0,
            "replies": []
        },
        {
            "body": "Thanks. I kinda hoped it means \"fuck your price\" after that failed website :)",
            "author": "JeaneyBowl",
            "id": "ggtkwqr",
            "parent_id": "t1_ggtjxnx",
            "score": 4,
            "created_utc": 1608749342.0,
            "replies": [
                {
                    "body": "LOL! Love this",
                    "author": "mraspencer",
                    "id": "gguhuzr",
                    "parent_id": "t1_ggtkwqr",
                    "score": 1,
                    "created_utc": 1608767000.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ll keep in mind that 50% of statistics students graduate in the lower half their class. 😀😀",
            "author": "HappyBear1952",
            "id": "gguvqfe",
            "parent_id": "t1_gguhyo9",
            "score": 3,
            "created_utc": 1608774638.0,
            "replies": [
                {
                    "body": "🤣🤣🤣",
                    "author": "mraspencer",
                    "id": "ggvryji",
                    "parent_id": "t1_gguvqfe",
                    "score": 1,
                    "created_utc": 1608797158.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "All good! It’s just language like that is why I think the twos chromosomes sub is beyond toxic...literally every way a guy can interact with a woman I have seen called creepy, and that attitude is really one of the main reasons I got out of the vanilla scene...work, the bar, the gym, public transit, the mall...I’ve all seen called “creepy” areas to approach a woman.",
            "author": "sdthrowout23",
            "id": "ggu903r",
            "parent_id": "t1_ggu438l",
            "score": 3,
            "created_utc": 1608762252.0,
            "replies": [
                {
                    "body": "You're so right! I personally rarely get creeped out  so I hear what you're saying! Appreciate the call out.",
                    "author": null,
                    "id": "ggugfwc",
                    "parent_id": "t1_ggu903r",
                    "score": 3,
                    "created_utc": 1608766217.0,
                    "replies": []
                },
                {
                    "body": "Just keep in mind, men's behavior is only creepy if you are unattractive.\n\nThat's like toxic feminity 101.",
                    "author": "AdAlternative6041",
                    "id": "gguiex1",
                    "parent_id": "t1_ggu903r",
                    "score": 3,
                    "created_utc": 1608767289.0,
                    "replies": [
                        {
                            "body": "You're so right!!",
                            "author": null,
                            "id": "gguxxw3",
                            "parent_id": "t1_gguiex1",
                            "score": 3,
                            "created_utc": 1608775865.0,
                            "replies": []
                        },
                        {
                            "body": "100x true.",
                            "author": "sdthrowout23",
                            "id": "gguqrjo",
                            "parent_id": "t1_gguiex1",
                            "score": 1,
                            "created_utc": 1608771919.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No you’re the right, the guys creep and a fuckinf dumbass. Who pays for pics? You get free porn online. Why would anyone pay? It’s just these tik tok girls. It’s also the fucking simps paying for M&G and/or pics. Unreal.",
            "author": "Limitlesspappy",
            "id": "ggvi1w8",
            "parent_id": "t1_ggu438l",
            "score": -3,
            "created_utc": 1608788414.0,
            "replies": []
        },
        {
            "body": "Yes - want to see what everyone is talking about.",
            "author": "HappyBear1952",
            "id": "ggtfzni",
            "parent_id": "t1_ggtcl0x",
            "score": 6,
            "created_utc": 1608746790.0,
            "replies": [
                {
                    "body": "  [https://vm.tiktok.com/ZMJgmjGeT/](https://vm.tiktok.com/ZMJgmjGeT/)that's what another sb shared...if you sign in, then you're shown similar videos...teh comments are gold!",
                    "author": "MiLocavida",
                    "id": "ggtx1bz",
                    "parent_id": "t1_ggtfzni",
                    "score": 2,
                    "created_utc": 1608755739.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "  [https://vm.tiktok.com/ZMJgmjGeT/](https://vm.tiktok.com/ZMJgmjGeT/)that's what another sb shared...if you sign in, then you're shown similar videos...teh comments are gold!",
            "author": "MiLocavida",
            "id": "ggtx0wj",
            "parent_id": "t1_ggtcl0x",
            "score": 3,
            "created_utc": 1608755732.0,
            "replies": [
                {
                    "body": "This girls hot but shes selling to her audience of broke young women more than she's selling to men, guaranteed.",
                    "author": "Persianx6",
                    "id": "ggv37wt",
                    "parent_id": "t1_ggtx0wj",
                    "score": 7,
                    "created_utc": 1608778866.0,
                    "replies": [
                        {
                            "body": "i think she found the secret sauce to monetize her tiktok...although not so familiar with tiktok...i just went into the comments and they are hilarious? Girl, how do i chat with these old men? hahahaha Girl, can you do a video on how to start a conversation?  Dang!",
                            "author": "MiLocavida",
                            "id": "ggv42wd",
                            "parent_id": "t1_ggv37wt",
                            "score": 2,
                            "created_utc": 1608779353.0,
                            "replies": [
                                {
                                    "body": "Could be, could be she comes out in a month with a code for some hair products and clothes to monetize the attention she gets from young women.",
                                    "author": "Persianx6",
                                    "id": "ggv4p9w",
                                    "parent_id": "t1_ggv42wd",
                                    "score": 3,
                                    "created_utc": 1608779723.0,
                                    "replies": []
                                },
                                {
                                    "body": "i also just realized she has 707k followers on Tik Tok. Yeah you're right -- guaranteed she makes more off that than she does off men.",
                                    "author": "Persianx6",
                                    "id": "ggv54c2",
                                    "parent_id": "t1_ggv42wd",
                                    "score": 4,
                                    "created_utc": 1608779973.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I think I am going to be sick. This makes me a bit mad.",
                    "author": "ffreshindo",
                    "id": "gguig2e",
                    "parent_id": "t1_ggtx0wj",
                    "score": 2,
                    "created_utc": 1608767308.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The problem is that the TikTok vids tell them to be vague about it. Or lie. Or it wouldn’t “work”.",
            "author": "LaGriffeDuLion",
            "id": "ggu3n4a",
            "parent_id": "t1_ggtpx2d",
            "score": 1,
            "created_utc": 1608759327.0,
            "replies": []
        },
        {
            "body": "Wow I get down voted cause I dont offer it upfront.....lmao sorry to offend someone but hey I have been doing this a while some girls are happy with making it on m&g a lone or paid dinners. But they baited and switched.....so you have to prove you are real.....if a guy doesn't gift you something rhan he isn't real either.\n\nSo it works both ways but you dont like that guys are no longer willing to pay for m&g blame all the scammed rinsers and tik tok guru's NOT us.\n\nSorry get over yourself who ever down voted that.  You need professional assistance",
            "author": "Momopllc",
            "id": "ggu5lx9",
            "parent_id": "t1_ggu3lna",
            "score": 2,
            "created_utc": 1608760405.0,
            "replies": []
        },
        {
            "body": "LOL! Love this",
            "author": "mraspencer",
            "id": "gguhuzr",
            "parent_id": "t1_ggtkwqr",
            "score": 1,
            "created_utc": 1608767000.0,
            "replies": []
        },
        {
            "body": "🤣🤣🤣",
            "author": "mraspencer",
            "id": "ggvryji",
            "parent_id": "t1_gguvqfe",
            "score": 1,
            "created_utc": 1608797158.0,
            "replies": []
        },
        {
            "body": "You're so right! I personally rarely get creeped out  so I hear what you're saying! Appreciate the call out.",
            "author": null,
            "id": "ggugfwc",
            "parent_id": "t1_ggu903r",
            "score": 3,
            "created_utc": 1608766217.0,
            "replies": []
        },
        {
            "body": "Just keep in mind, men's behavior is only creepy if you are unattractive.\n\nThat's like toxic feminity 101.",
            "author": "AdAlternative6041",
            "id": "gguiex1",
            "parent_id": "t1_ggu903r",
            "score": 3,
            "created_utc": 1608767289.0,
            "replies": [
                {
                    "body": "You're so right!!",
                    "author": null,
                    "id": "gguxxw3",
                    "parent_id": "t1_gguiex1",
                    "score": 3,
                    "created_utc": 1608775865.0,
                    "replies": []
                },
                {
                    "body": "100x true.",
                    "author": "sdthrowout23",
                    "id": "gguqrjo",
                    "parent_id": "t1_gguiex1",
                    "score": 1,
                    "created_utc": 1608771919.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "  [https://vm.tiktok.com/ZMJgmjGeT/](https://vm.tiktok.com/ZMJgmjGeT/)that's what another sb shared...if you sign in, then you're shown similar videos...teh comments are gold!",
            "author": "MiLocavida",
            "id": "ggtx1bz",
            "parent_id": "t1_ggtfzni",
            "score": 2,
            "created_utc": 1608755739.0,
            "replies": []
        },
        {
            "body": "This girls hot but shes selling to her audience of broke young women more than she's selling to men, guaranteed.",
            "author": "Persianx6",
            "id": "ggv37wt",
            "parent_id": "t1_ggtx0wj",
            "score": 7,
            "created_utc": 1608778866.0,
            "replies": [
                {
                    "body": "i think she found the secret sauce to monetize her tiktok...although not so familiar with tiktok...i just went into the comments and they are hilarious? Girl, how do i chat with these old men? hahahaha Girl, can you do a video on how to start a conversation?  Dang!",
                    "author": "MiLocavida",
                    "id": "ggv42wd",
                    "parent_id": "t1_ggv37wt",
                    "score": 2,
                    "created_utc": 1608779353.0,
                    "replies": [
                        {
                            "body": "Could be, could be she comes out in a month with a code for some hair products and clothes to monetize the attention she gets from young women.",
                            "author": "Persianx6",
                            "id": "ggv4p9w",
                            "parent_id": "t1_ggv42wd",
                            "score": 3,
                            "created_utc": 1608779723.0,
                            "replies": []
                        },
                        {
                            "body": "i also just realized she has 707k followers on Tik Tok. Yeah you're right -- guaranteed she makes more off that than she does off men.",
                            "author": "Persianx6",
                            "id": "ggv54c2",
                            "parent_id": "t1_ggv42wd",
                            "score": 4,
                            "created_utc": 1608779973.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think I am going to be sick. This makes me a bit mad.",
            "author": "ffreshindo",
            "id": "gguig2e",
            "parent_id": "t1_ggtx0wj",
            "score": 2,
            "created_utc": 1608767308.0,
            "replies": []
        },
        {
            "body": "You're so right!!",
            "author": null,
            "id": "gguxxw3",
            "parent_id": "t1_gguiex1",
            "score": 3,
            "created_utc": 1608775865.0,
            "replies": []
        },
        {
            "body": "100x true.",
            "author": "sdthrowout23",
            "id": "gguqrjo",
            "parent_id": "t1_gguiex1",
            "score": 1,
            "created_utc": 1608771919.0,
            "replies": []
        },
        {
            "body": "i think she found the secret sauce to monetize her tiktok...although not so familiar with tiktok...i just went into the comments and they are hilarious? Girl, how do i chat with these old men? hahahaha Girl, can you do a video on how to start a conversation?  Dang!",
            "author": "MiLocavida",
            "id": "ggv42wd",
            "parent_id": "t1_ggv37wt",
            "score": 2,
            "created_utc": 1608779353.0,
            "replies": [
                {
                    "body": "Could be, could be she comes out in a month with a code for some hair products and clothes to monetize the attention she gets from young women.",
                    "author": "Persianx6",
                    "id": "ggv4p9w",
                    "parent_id": "t1_ggv42wd",
                    "score": 3,
                    "created_utc": 1608779723.0,
                    "replies": []
                },
                {
                    "body": "i also just realized she has 707k followers on Tik Tok. Yeah you're right -- guaranteed she makes more off that than she does off men.",
                    "author": "Persianx6",
                    "id": "ggv54c2",
                    "parent_id": "t1_ggv42wd",
                    "score": 4,
                    "created_utc": 1608779973.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Could be, could be she comes out in a month with a code for some hair products and clothes to monetize the attention she gets from young women.",
            "author": "Persianx6",
            "id": "ggv4p9w",
            "parent_id": "t1_ggv42wd",
            "score": 3,
            "created_utc": 1608779723.0,
            "replies": []
        },
        {
            "body": "i also just realized she has 707k followers on Tik Tok. Yeah you're right -- guaranteed she makes more off that than she does off men.",
            "author": "Persianx6",
            "id": "ggv54c2",
            "parent_id": "t1_ggv42wd",
            "score": 4,
            "created_utc": 1608779973.0,
            "replies": []
        }
    ]
}