{
    "title": "[NEWS] Song Ji Hyo was awarded the presidential commendation today from S.Korea President Yoon Suk Yeol for being an exemplary taxpayer",
    "post_id": "11gttkh",
    "post_url": "https://www.reddit.com/r/runningman/comments/11gttkh/news_song_ji_hyo_was_awarded_the_presidential/",
    "author": "Deroucadetoo",
    "body": "",
    "url": "https://v.redd.it/rbu767ncxgla1",
    "score": 516,
    "upvote_ratio": 0.97,
    "created_utc": 1677825948.0,
    "num_comments": 58,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "This is basically a PR strategy by the government to encourage people to pay their taxes.",
            "author": "lelelele98",
            "id": "jaq9btz",
            "parent_id": "t3_11gttkh",
            "score": 200,
            "created_utc": 1677827582.0,
            "replies": [
                {
                    "body": "Agreed. They could just have normal civilian for that award instead.",
                    "author": "st_arch",
                    "id": "jaqfdvg",
                    "parent_id": "t1_jaq9btz",
                    "score": 52,
                    "created_utc": 1677832351.0,
                    "replies": [
                        {
                            "body": "I agree with this. I love jihyo and other celebs who have received the award, but it would encourage civilians more if they see another civilian receive an award and they'd feel appreciated at least.",
                            "author": "Sivassassin",
                            "id": "jaqh3hi",
                            "parent_id": "t1_jaqfdvg",
                            "score": 49,
                            "created_utc": 1677833756.0,
                            "replies": [
                                {
                                    "body": "No ones gonna write articles about regular people getting an award, maybe they do and you just don't hear about it?\n\nThe point is to promote paying taxes as a responsible good thing to do",
                                    "author": "echo-128",
                                    "id": "jaqjqnc",
                                    "parent_id": "t1_jaqh3hi",
                                    "score": 27,
                                    "created_utc": 1677836038.0,
                                    "replies": [
                                        {
                                            "body": "Yeah I get the point. But usually when celebrities are awarded something that civilians could get as well (assuming they don't) then it's not encouraging. I don't look up to celebrities to live my life or to encourage me to do something. But I suppose each individual is different.",
                                            "author": "Sivassassin",
                                            "id": "jaqjwz4",
                                            "parent_id": "t1_jaqjqnc",
                                            "score": 14,
                                            "created_utc": 1677836188.0,
                                            "replies": [
                                                {
                                                    "body": "She has a lot of Korean fans that look up to her.",
                                                    "author": "Pyeonsae",
                                                    "id": "jaqn1f1",
                                                    "parent_id": "t1_jaqjwz4",
                                                    "score": 3,
                                                    "created_utc": 1677838884.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes 100% she is awesome. But I wasn't implying anything against her or other celebrities. Just that civilians get recognised as well.",
                                                            "author": "Sivassassin",
                                                            "id": "jaquc56",
                                                            "parent_id": "t1_jaqn1f1",
                                                            "score": 9,
                                                            "created_utc": 1677844530.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You said \".. then its not encouraging\". I'm saying this award will encourage her korean fans. \n\nShe has a lot of fans and that's is their target audience.",
                                                                    "author": "Pyeonsae",
                                                                    "id": "jau910f",
                                                                    "parent_id": "t1_jaquc56",
                                                                    "score": 4,
                                                                    "created_utc": 1677898153.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "But I wasn't speaking just about her fans. There's others who don't watch Running man. Similar to other recipients of the awards same context, I was speaking on celebrities receiving the awards in general not Jihyo in particular. I pay tax but I don't get an award, where's mine 🤣. \n\nThe quoted part you had responded to, I had put \"assuming they don't\" as in assuming the civilians don't receive the award, which isn't encouraging since people can think if they pay tax then why aren't they being awarded and celebrities are. That's where I was getting at, not against Jihyo or other recipients.\n\nEdit: additional text in the 1st para.",
                                                                            "author": "Sivassassin",
                                                                            "id": "javbcsd",
                                                                            "parent_id": "t1_jau910f",
                                                                            "score": 2,
                                                                            "created_utc": 1677924083.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Sorry not trying to make you mad. Im just explaining why they choose sjh for this award.\n\nAgain this PR move is not to those who dont know her. They are specifically targetting sjh fans. She still has huge crazy fandom. Just go to twitter, FB or IG. She's only the least favorite on reddit. Previous recipients were also big names in Korea. IU, Lee Seung Gi, Seo Jin are all huge stars.\n\nThey wouldnt chose an ordinary civiliant to receive this, because there will be no one who care. Or maybe they did giving award to civilians but we dont know because not a lot of people care. The fact that we know about this event shows that they have spread the message even further from their target audience. A succes imo.",
                                                                                    "author": "Pyeonsae",
                                                                                    "id": "jawjf2z",
                                                                                    "parent_id": "t1_javbcsd",
                                                                                    "score": 3,
                                                                                    "created_utc": 1677948961.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "No don't worry not mad at all. I love having discussions 😊\n\nYeah I'm a fan of Running man. I remember all the hate So Min was getting due to Jihyo \"getting less limelight\", Jihyo has a mass following. But I definitely understand the PR strategy 100%, but just don't understand why celebrities would get an award for paying their tax when it's the norm anyway. Perhaps an award for something else, maybe charitable for instance (i think they probably have that) would be better but for tax it's generally the normal anyway.\n\nEdit: amended a word",
                                                                                            "author": "Sivassassin",
                                                                                            "id": "jawpq1y",
                                                                                            "parent_id": "t1_jawjf2z",
                                                                                            "score": 3,
                                                                                            "created_utc": 1677951490.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "How is the S. Korean government anyways? I mean tax-wise, do citizens there think they're generally living well because the government is putting their money into good use?\n\nThis is coming from someone living in a 3rd world country with a super corrupt government because I can only imagine how better my home country would be if the government wasn't so dirty and greedy.",
                                    "author": "IcedKofe",
                                    "id": "jark79o",
                                    "parent_id": "t1_jaqh3hi",
                                    "score": 2,
                                    "created_utc": 1677857554.0,
                                    "replies": [
                                        {
                                            "body": "Pretty damn corrupt. Putting my bets that people giving her the awards are the ones evading taxes.",
                                            "author": "gyojoo",
                                            "id": "jatw8c2",
                                            "parent_id": "t1_jark79o",
                                            "score": 5,
                                            "created_utc": 1677891943.0,
                                            "replies": [
                                                {
                                                    "body": "And how did you know this? Any resources?",
                                                    "author": "I_have_No_idea_ReALy",
                                                    "id": "jb369u8",
                                                    "parent_id": "t1_jatw8c2",
                                                    "score": 2,
                                                    "created_utc": 1678068313.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well I keep tabs on news and politics of my own country and I've been following news on their 6-7 of their presidents and all the Shenanigans they've been causing from either side. \n\nOh yeah, they're corrupt to the core.",
                                                            "author": "gyojoo",
                                                            "id": "jb3azsl",
                                                            "parent_id": "t1_jb369u8",
                                                            "score": 1,
                                                            "created_utc": 1678070587.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I'm not too sure about the government side. I've read stuff and watched videos of issues, but I'm not too sure if I can comment on the political side as i may not know it too well. Sorry, hopefully someone can answer. 😊",
                                            "author": "Sivassassin",
                                            "id": "jaroeus",
                                            "parent_id": "t1_jark79o",
                                            "score": 1,
                                            "created_utc": 1677859225.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "True but considering so many celebrities get caught dodging paying taxes, she's like an angel.",
                    "author": "abgbob",
                    "id": "jaqkp2f",
                    "parent_id": "t1_jaq9btz",
                    "score": 10,
                    "created_utc": 1677836865.0,
                    "replies": [
                        {
                            "body": "I've read that too Kwon Sang Woo, Lee Min Ho are caught up in tax scandals.",
                            "author": "Funny_Commission2773",
                            "id": "jb4960x",
                            "parent_id": "t1_jaqkp2f",
                            "score": 4,
                            "created_utc": 1678092663.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Good strategy.",
                    "author": "Pyeonsae",
                    "id": "jaqmpcr",
                    "parent_id": "t1_jaq9btz",
                    "score": 2,
                    "created_utc": 1677838596.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What does that even mean? lol. Genuinely curious.",
            "author": "Bacun",
            "id": "jaq8ycb",
            "parent_id": "t3_11gttkh",
            "score": 121,
            "created_utc": 1677827301.0,
            "replies": [
                {
                    "body": "That she pays her taxes lol. \n\nI pay my taxes too. Where’s my award?",
                    "author": "RealCanadianSW",
                    "id": "jar6w3a",
                    "parent_id": "t1_jaq8ycb",
                    "score": 79,
                    "created_utc": 1677851550.0,
                    "replies": []
                },
                {
                    "body": "Lol I imagine she’s too lazy to find ways to avoid paying taxes. Might as well just pay all of them so she can sleep peacefully at home 😂",
                    "author": "ToLiveOrToReddit",
                    "id": "jarb8eg",
                    "parent_id": "t1_jaq8ycb",
                    "score": 76,
                    "created_utc": 1677853719.0,
                    "replies": [
                        {
                            "body": "Shes a tax accounting graduate☺️",
                            "author": "Witty_Inspection_310",
                            "id": "jaztfu7",
                            "parent_id": "t1_jarb8eg",
                            "score": 5,
                            "created_utc": 1678009034.0,
                            "replies": []
                        },
                        {
                            "body": "I can imagine her finance manager advising ways to save on taxes and she is so unbothered, she just pay more so she can have peace and quiet. \n\nmanager : \"Jihyo-ssi your tax this year is 10K won\"\n\nSJH : \"Pay 30K and don't bother me for 2 years\"\n\nmanager : \"But..\"\n\nSJH : \"zzzz\"",
                            "author": "Kuuganism",
                            "id": "jb38a77",
                            "parent_id": "t1_jarb8eg",
                            "score": 5,
                            "created_utc": 1678069279.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is awarded to individual taxpayers based on their tax amount and donations made for the previous tax period.\n\nPrevious recipients are IU, Lee Seung Gi, Gray and Lee Seo Jin.",
            "author": "Critwice",
            "id": "jaq9yke",
            "parent_id": "t3_11gttkh",
            "score": 63,
            "created_utc": 1677828067.0,
            "replies": []
        },
        {
            "body": "Yay(?)!  \n\nThis award sounds like an excuse to meet SJH ![gif](emote|free_emotes_pack|joy)",
            "author": "SpoonAtAGunFight",
            "id": "jaq8jsx",
            "parent_id": "t3_11gttkh",
            "score": 65,
            "created_utc": 1677827001.0,
            "replies": [
                {
                    "body": "And Kim Soohyun",
                    "author": "yeontura",
                    "id": "jaqa1hg",
                    "parent_id": "t1_jaq8jsx",
                    "score": 11,
                    "created_utc": 1677828129.0,
                    "replies": []
                },
                {
                    "body": "\"Dad I wanna meet SJH and KSH\"\n\n\"Say no more\"",
                    "author": "Kuuganism",
                    "id": "jb38swi",
                    "parent_id": "t1_jaq8jsx",
                    "score": 5,
                    "created_utc": 1678069525.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love Song Ji Hyo but this practice of recognizing taxpayers has always been a bit weird to me. \n\nTo quote my 5th grade teacher, \"Why should you get an award for doing something that you were supposed to do in the first place?\"",
            "author": "lnmzq",
            "id": "jar9wft",
            "parent_id": "t3_11gttkh",
            "score": 26,
            "created_utc": 1677853067.0,
            "replies": [
                {
                    "body": "Believe me or not people this days sometimes won't even do what they're supposed to do lol.",
                    "author": "Kuuganism",
                    "id": "jb38g12",
                    "parent_id": "t1_jar9wft",
                    "score": 3,
                    "created_utc": 1678069355.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is a great choice from government because SJH is a great example of young people who pay their tax. 😂 This will encourage young people to do the same.",
            "author": "blackazure",
            "id": "jaqbfoj",
            "parent_id": "t3_11gttkh",
            "score": 26,
            "created_utc": 1677829200.0,
            "replies": []
        },
        {
            "body": "The tax paying situation is so bad in korea that they have to promote tax paying like this? :D",
            "author": "LasDen",
            "id": "jaqm2nx",
            "parent_id": "t3_11gttkh",
            "score": 14,
            "created_utc": 1677838052.0,
            "replies": []
        },
        {
            "body": "Paying tax is an accomplishment?",
            "author": "atnator42",
            "id": "jaq9i83",
            "parent_id": "t3_11gttkh",
            "score": 15,
            "created_utc": 1677827719.0,
            "replies": []
        },
        {
            "body": "Seriously? This is basically a glorified participation award LOL",
            "author": "weedpornography",
            "id": "jari0ph",
            "parent_id": "t3_11gttkh",
            "score": 12,
            "created_utc": 1677856673.0,
            "replies": []
        },
        {
            "body": "What in the world. Congratulations to her but this is one heck of a random award to get.",
            "author": "lolminna",
            "id": "jarbtee",
            "parent_id": "t3_11gttkh",
            "score": 7,
            "created_utc": 1677854002.0,
            "replies": []
        },
        {
            "body": "You know that \"non-office\" jobs are somewhat more vulnerable to tax avoidance right? The more projects you have might give you more gaps in avoiding tax. So while this is basically govt PR move, I kinda get it. Even the celebs selected seems to be the \"nice guy/gal\" celebs. \n\n Some big shot celebs got into trouble for tax avoidance such as Lee Byung Hun, Kim Tae Hee, and Lee Min Ho.",
            "author": "Kuuganism",
            "id": "jb38ph9",
            "parent_id": "t3_11gttkh",
            "score": 3,
            "created_utc": 1678069481.0,
            "replies": []
        },
        {
            "body": "I mean she always played by the rules 🤷‍♂️",
            "author": "looooolmonster",
            "id": "jasb5fk",
            "parent_id": "t3_11gttkh",
            "score": 5,
            "created_utc": 1677868089.0,
            "replies": []
        },
        {
            "body": "lol probably to encourage people to pay their taxes",
            "author": "GosuGian",
            "id": "jaqocsg",
            "parent_id": "t3_11gttkh",
            "score": 2,
            "created_utc": 1677839991.0,
            "replies": []
        },
        {
            "body": "Jihyo’s face is literally screaming “I had no choice”",
            "author": "Renzybro_oppa",
            "id": "jaugw97",
            "parent_id": "t3_11gttkh",
            "score": 2,
            "created_utc": 1677902178.0,
            "replies": []
        },
        {
            "body": "![img](emote|t5_2u830|5032) to her",
            "author": "kkang_kkang",
            "id": "jaqe2ky",
            "parent_id": "t3_11gttkh",
            "score": 6,
            "created_utc": 1677831297.0,
            "replies": []
        },
        {
            "body": "Let’s be honest guys. Jiho is the best. But there’s probably an 80 year old citizen out there whose paid all his taxes on time for 60+ years and never got this award.",
            "author": "healthylivingagain",
            "id": "jaucmub",
            "parent_id": "t3_11gttkh",
            "score": 4,
            "created_utc": 1677899964.0,
            "replies": []
        },
        {
            "body": "Lame af award",
            "author": "HonoredMatrix",
            "id": "jaqtg1t",
            "parent_id": "t3_11gttkh",
            "score": 6,
            "created_utc": 1677843922.0,
            "replies": []
        },
        {
            "body": "Wow you can get an award for paying taxes? So do you get a tax rebate after getting an award?",
            "author": "Genzo99",
            "id": "jaqxo64",
            "parent_id": "t3_11gttkh",
            "score": 3,
            "created_utc": 1677846641.0,
            "replies": []
        },
        {
            "body": "Bombastic!!!",
            "author": "lounaticsarge",
            "id": "jatvgx3",
            "parent_id": "t3_11gttkh",
            "score": 3,
            "created_utc": 1677891572.0,
            "replies": [
                {
                    "body": "Skkrrrr skkkrrrrr",
                    "author": "kkang_kkang",
                    "id": "jbajc57",
                    "parent_id": "t1_jatvgx3",
                    "score": 5,
                    "created_utc": 1678210416.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "UMM LMAO?? can't believe there's such a thing...",
            "author": "chimmyyeah",
            "id": "jaqufoe",
            "parent_id": "t3_11gttkh",
            "score": 2,
            "created_utc": 1677844596.0,
            "replies": []
        },
        {
            "body": "Dont understand with the hate she gets because of this award. Anyway congrats to the RM youngster line.\n\nWonder will YJS bring this up on RM.",
            "author": "Pyeonsae",
            "id": "jav7zma",
            "parent_id": "t3_11gttkh",
            "score": 1,
            "created_utc": 1677921154.0,
            "replies": []
        },
        {
            "body": "LMAO, what does this have to do with running man though? It's not even about her job or character or another show... Shouldn't you be posting this on her own sub at least? Why is this running man related news when it has nothing to do with running man or the industry? 🤔 also, good for her I guess.",
            "author": "Ancient_Reply4583",
            "id": "jaqwb8j",
            "parent_id": "t3_11gttkh",
            "score": -16,
            "created_utc": 1677845813.0,
            "replies": [
                {
                    "body": "To this I will say...why not?😊 I guess you are new here on this subreddit because it is not uncommon for people to share good news of the individual members despite not being RM-related~🤭\n\n& in the possible event you think I'm doing this because I'm biased towards SJH, then sorry because I post updates on other members as well if I do come across their news.\n\nHave a nice day and let loose a little😉",
                    "author": "Deroucadetoo",
                    "id": "jaqx572",
                    "parent_id": "t1_jaqwb8j",
                    "score": 14,
                    "created_utc": 1677846324.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "jaqyec2",
                            "parent_id": "t1_jaqx572",
                            "score": -22,
                            "created_utc": 1677847075.0,
                            "replies": [
                                {
                                    "body": "Huh, strange how the votes on comments suddenly turned around. Interesting. A frozen flower comment has less downvotes. 😂 just overall very strange votes on this... Something fishy is going on. 😂 (I'm not talking about my comments but the thread itself - edit)",
                                    "author": "Ancient_Reply4583",
                                    "id": "jar7rcx",
                                    "parent_id": "t1_jaqyec2",
                                    "score": -20,
                                    "created_utc": 1677851989.0,
                                    "replies": [
                                        {
                                            "body": "Sorry to say but you are the fishy one.Those things you said way up,its not posted because a fan just dont want to post it here,that simple.You also post here random things about somin/other members(cant really remember) but i think its too foul for you to ask those things.It has been a discussion here especially when jihyo/somin updates on IG weekly before and a lot agree that it does no harm/does not really care at all.After all,we are all free to up/down votes.\n\nAnd the frozen flower thing?Whats the problem with it?It's her job as an actress with great cast and does great on sales.It's not like she does it just because she want to her body to everyone.If you think about it,a nude painting can't be made without a nude model.\n\nHuh,strange thinking ☺️☺️☺️",
                                            "author": "Witty_Inspection_310",
                                            "id": "jazugrd",
                                            "parent_id": "t1_jar7rcx",
                                            "score": 6,
                                            "created_utc": 1678009924.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah, posts on this sub don't usually have 477 upvotes in a matter of 24 hours. Especially posts that aren't related to the show. This is just an observation, btw. And more power to anyone doing any movie they want. Who said otherwise? You misunderstanding that part about FF entirely.",
                                                    "author": "Ancient_Reply4583",
                                                    "id": "jb043dh",
                                                    "parent_id": "t1_jazugrd",
                                                    "score": -4,
                                                    "created_utc": 1678018041.0,
                                                    "replies": [
                                                        {
                                                            "body": "So your main issue was it has 477 upvotes within 24 hours and its a song ji hyo news?Isn't that too childish?",
                                                            "author": "Witty_Inspection_310",
                                                            "id": "jb04d0a",
                                                            "parent_id": "t1_jb043dh",
                                                            "score": 7,
                                                            "created_utc": 1678018238.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed. They could just have normal civilian for that award instead.",
            "author": "st_arch",
            "id": "jaqfdvg",
            "parent_id": "t1_jaq9btz",
            "score": 52,
            "created_utc": 1677832351.0,
            "replies": [
                {
                    "body": "I agree with this. I love jihyo and other celebs who have received the award, but it would encourage civilians more if they see another civilian receive an award and they'd feel appreciated at least.",
                    "author": "Sivassassin",
                    "id": "jaqh3hi",
                    "parent_id": "t1_jaqfdvg",
                    "score": 49,
                    "created_utc": 1677833756.0,
                    "replies": [
                        {
                            "body": "No ones gonna write articles about regular people getting an award, maybe they do and you just don't hear about it?\n\nThe point is to promote paying taxes as a responsible good thing to do",
                            "author": "echo-128",
                            "id": "jaqjqnc",
                            "parent_id": "t1_jaqh3hi",
                            "score": 27,
                            "created_utc": 1677836038.0,
                            "replies": [
                                {
                                    "body": "Yeah I get the point. But usually when celebrities are awarded something that civilians could get as well (assuming they don't) then it's not encouraging. I don't look up to celebrities to live my life or to encourage me to do something. But I suppose each individual is different.",
                                    "author": "Sivassassin",
                                    "id": "jaqjwz4",
                                    "parent_id": "t1_jaqjqnc",
                                    "score": 14,
                                    "created_utc": 1677836188.0,
                                    "replies": [
                                        {
                                            "body": "She has a lot of Korean fans that look up to her.",
                                            "author": "Pyeonsae",
                                            "id": "jaqn1f1",
                                            "parent_id": "t1_jaqjwz4",
                                            "score": 3,
                                            "created_utc": 1677838884.0,
                                            "replies": [
                                                {
                                                    "body": "Yes 100% she is awesome. But I wasn't implying anything against her or other celebrities. Just that civilians get recognised as well.",
                                                    "author": "Sivassassin",
                                                    "id": "jaquc56",
                                                    "parent_id": "t1_jaqn1f1",
                                                    "score": 9,
                                                    "created_utc": 1677844530.0,
                                                    "replies": [
                                                        {
                                                            "body": "You said \".. then its not encouraging\". I'm saying this award will encourage her korean fans. \n\nShe has a lot of fans and that's is their target audience.",
                                                            "author": "Pyeonsae",
                                                            "id": "jau910f",
                                                            "parent_id": "t1_jaquc56",
                                                            "score": 4,
                                                            "created_utc": 1677898153.0,
                                                            "replies": [
                                                                {
                                                                    "body": "But I wasn't speaking just about her fans. There's others who don't watch Running man. Similar to other recipients of the awards same context, I was speaking on celebrities receiving the awards in general not Jihyo in particular. I pay tax but I don't get an award, where's mine 🤣. \n\nThe quoted part you had responded to, I had put \"assuming they don't\" as in assuming the civilians don't receive the award, which isn't encouraging since people can think if they pay tax then why aren't they being awarded and celebrities are. That's where I was getting at, not against Jihyo or other recipients.\n\nEdit: additional text in the 1st para.",
                                                                    "author": "Sivassassin",
                                                                    "id": "javbcsd",
                                                                    "parent_id": "t1_jau910f",
                                                                    "score": 2,
                                                                    "created_utc": 1677924083.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Sorry not trying to make you mad. Im just explaining why they choose sjh for this award.\n\nAgain this PR move is not to those who dont know her. They are specifically targetting sjh fans. She still has huge crazy fandom. Just go to twitter, FB or IG. She's only the least favorite on reddit. Previous recipients were also big names in Korea. IU, Lee Seung Gi, Seo Jin are all huge stars.\n\nThey wouldnt chose an ordinary civiliant to receive this, because there will be no one who care. Or maybe they did giving award to civilians but we dont know because not a lot of people care. The fact that we know about this event shows that they have spread the message even further from their target audience. A succes imo.",
                                                                            "author": "Pyeonsae",
                                                                            "id": "jawjf2z",
                                                                            "parent_id": "t1_javbcsd",
                                                                            "score": 3,
                                                                            "created_utc": 1677948961.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "No don't worry not mad at all. I love having discussions 😊\n\nYeah I'm a fan of Running man. I remember all the hate So Min was getting due to Jihyo \"getting less limelight\", Jihyo has a mass following. But I definitely understand the PR strategy 100%, but just don't understand why celebrities would get an award for paying their tax when it's the norm anyway. Perhaps an award for something else, maybe charitable for instance (i think they probably have that) would be better but for tax it's generally the normal anyway.\n\nEdit: amended a word",
                                                                                    "author": "Sivassassin",
                                                                                    "id": "jawpq1y",
                                                                                    "parent_id": "t1_jawjf2z",
                                                                                    "score": 3,
                                                                                    "created_utc": 1677951490.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "How is the S. Korean government anyways? I mean tax-wise, do citizens there think they're generally living well because the government is putting their money into good use?\n\nThis is coming from someone living in a 3rd world country with a super corrupt government because I can only imagine how better my home country would be if the government wasn't so dirty and greedy.",
                            "author": "IcedKofe",
                            "id": "jark79o",
                            "parent_id": "t1_jaqh3hi",
                            "score": 2,
                            "created_utc": 1677857554.0,
                            "replies": [
                                {
                                    "body": "Pretty damn corrupt. Putting my bets that people giving her the awards are the ones evading taxes.",
                                    "author": "gyojoo",
                                    "id": "jatw8c2",
                                    "parent_id": "t1_jark79o",
                                    "score": 5,
                                    "created_utc": 1677891943.0,
                                    "replies": [
                                        {
                                            "body": "And how did you know this? Any resources?",
                                            "author": "I_have_No_idea_ReALy",
                                            "id": "jb369u8",
                                            "parent_id": "t1_jatw8c2",
                                            "score": 2,
                                            "created_utc": 1678068313.0,
                                            "replies": [
                                                {
                                                    "body": "Well I keep tabs on news and politics of my own country and I've been following news on their 6-7 of their presidents and all the Shenanigans they've been causing from either side. \n\nOh yeah, they're corrupt to the core.",
                                                    "author": "gyojoo",
                                                    "id": "jb3azsl",
                                                    "parent_id": "t1_jb369u8",
                                                    "score": 1,
                                                    "created_utc": 1678070587.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I'm not too sure about the government side. I've read stuff and watched videos of issues, but I'm not too sure if I can comment on the political side as i may not know it too well. Sorry, hopefully someone can answer. 😊",
                                    "author": "Sivassassin",
                                    "id": "jaroeus",
                                    "parent_id": "t1_jark79o",
                                    "score": 1,
                                    "created_utc": 1677859225.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "True but considering so many celebrities get caught dodging paying taxes, she's like an angel.",
            "author": "abgbob",
            "id": "jaqkp2f",
            "parent_id": "t1_jaq9btz",
            "score": 10,
            "created_utc": 1677836865.0,
            "replies": [
                {
                    "body": "I've read that too Kwon Sang Woo, Lee Min Ho are caught up in tax scandals.",
                    "author": "Funny_Commission2773",
                    "id": "jb4960x",
                    "parent_id": "t1_jaqkp2f",
                    "score": 4,
                    "created_utc": 1678092663.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good strategy.",
            "author": "Pyeonsae",
            "id": "jaqmpcr",
            "parent_id": "t1_jaq9btz",
            "score": 2,
            "created_utc": 1677838596.0,
            "replies": []
        },
        {
            "body": "That she pays her taxes lol. \n\nI pay my taxes too. Where’s my award?",
            "author": "RealCanadianSW",
            "id": "jar6w3a",
            "parent_id": "t1_jaq8ycb",
            "score": 79,
            "created_utc": 1677851550.0,
            "replies": []
        },
        {
            "body": "Lol I imagine she’s too lazy to find ways to avoid paying taxes. Might as well just pay all of them so she can sleep peacefully at home 😂",
            "author": "ToLiveOrToReddit",
            "id": "jarb8eg",
            "parent_id": "t1_jaq8ycb",
            "score": 76,
            "created_utc": 1677853719.0,
            "replies": [
                {
                    "body": "Shes a tax accounting graduate☺️",
                    "author": "Witty_Inspection_310",
                    "id": "jaztfu7",
                    "parent_id": "t1_jarb8eg",
                    "score": 5,
                    "created_utc": 1678009034.0,
                    "replies": []
                },
                {
                    "body": "I can imagine her finance manager advising ways to save on taxes and she is so unbothered, she just pay more so she can have peace and quiet. \n\nmanager : \"Jihyo-ssi your tax this year is 10K won\"\n\nSJH : \"Pay 30K and don't bother me for 2 years\"\n\nmanager : \"But..\"\n\nSJH : \"zzzz\"",
                    "author": "Kuuganism",
                    "id": "jb38a77",
                    "parent_id": "t1_jarb8eg",
                    "score": 5,
                    "created_utc": 1678069279.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And Kim Soohyun",
            "author": "yeontura",
            "id": "jaqa1hg",
            "parent_id": "t1_jaq8jsx",
            "score": 11,
            "created_utc": 1677828129.0,
            "replies": []
        },
        {
            "body": "\"Dad I wanna meet SJH and KSH\"\n\n\"Say no more\"",
            "author": "Kuuganism",
            "id": "jb38swi",
            "parent_id": "t1_jaq8jsx",
            "score": 5,
            "created_utc": 1678069525.0,
            "replies": []
        },
        {
            "body": "Believe me or not people this days sometimes won't even do what they're supposed to do lol.",
            "author": "Kuuganism",
            "id": "jb38g12",
            "parent_id": "t1_jar9wft",
            "score": 3,
            "created_utc": 1678069355.0,
            "replies": []
        },
        {
            "body": "Skkrrrr skkkrrrrr",
            "author": "kkang_kkang",
            "id": "jbajc57",
            "parent_id": "t1_jatvgx3",
            "score": 5,
            "created_utc": 1678210416.0,
            "replies": []
        },
        {
            "body": "To this I will say...why not?😊 I guess you are new here on this subreddit because it is not uncommon for people to share good news of the individual members despite not being RM-related~🤭\n\n& in the possible event you think I'm doing this because I'm biased towards SJH, then sorry because I post updates on other members as well if I do come across their news.\n\nHave a nice day and let loose a little😉",
            "author": "Deroucadetoo",
            "id": "jaqx572",
            "parent_id": "t1_jaqwb8j",
            "score": 14,
            "created_utc": 1677846324.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "jaqyec2",
                    "parent_id": "t1_jaqx572",
                    "score": -22,
                    "created_utc": 1677847075.0,
                    "replies": [
                        {
                            "body": "Huh, strange how the votes on comments suddenly turned around. Interesting. A frozen flower comment has less downvotes. 😂 just overall very strange votes on this... Something fishy is going on. 😂 (I'm not talking about my comments but the thread itself - edit)",
                            "author": "Ancient_Reply4583",
                            "id": "jar7rcx",
                            "parent_id": "t1_jaqyec2",
                            "score": -20,
                            "created_utc": 1677851989.0,
                            "replies": [
                                {
                                    "body": "Sorry to say but you are the fishy one.Those things you said way up,its not posted because a fan just dont want to post it here,that simple.You also post here random things about somin/other members(cant really remember) but i think its too foul for you to ask those things.It has been a discussion here especially when jihyo/somin updates on IG weekly before and a lot agree that it does no harm/does not really care at all.After all,we are all free to up/down votes.\n\nAnd the frozen flower thing?Whats the problem with it?It's her job as an actress with great cast and does great on sales.It's not like she does it just because she want to her body to everyone.If you think about it,a nude painting can't be made without a nude model.\n\nHuh,strange thinking ☺️☺️☺️",
                                    "author": "Witty_Inspection_310",
                                    "id": "jazugrd",
                                    "parent_id": "t1_jar7rcx",
                                    "score": 6,
                                    "created_utc": 1678009924.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, posts on this sub don't usually have 477 upvotes in a matter of 24 hours. Especially posts that aren't related to the show. This is just an observation, btw. And more power to anyone doing any movie they want. Who said otherwise? You misunderstanding that part about FF entirely.",
                                            "author": "Ancient_Reply4583",
                                            "id": "jb043dh",
                                            "parent_id": "t1_jazugrd",
                                            "score": -4,
                                            "created_utc": 1678018041.0,
                                            "replies": [
                                                {
                                                    "body": "So your main issue was it has 477 upvotes within 24 hours and its a song ji hyo news?Isn't that too childish?",
                                                    "author": "Witty_Inspection_310",
                                                    "id": "jb04d0a",
                                                    "parent_id": "t1_jb043dh",
                                                    "score": 7,
                                                    "created_utc": 1678018238.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree with this. I love jihyo and other celebs who have received the award, but it would encourage civilians more if they see another civilian receive an award and they'd feel appreciated at least.",
            "author": "Sivassassin",
            "id": "jaqh3hi",
            "parent_id": "t1_jaqfdvg",
            "score": 49,
            "created_utc": 1677833756.0,
            "replies": [
                {
                    "body": "No ones gonna write articles about regular people getting an award, maybe they do and you just don't hear about it?\n\nThe point is to promote paying taxes as a responsible good thing to do",
                    "author": "echo-128",
                    "id": "jaqjqnc",
                    "parent_id": "t1_jaqh3hi",
                    "score": 27,
                    "created_utc": 1677836038.0,
                    "replies": [
                        {
                            "body": "Yeah I get the point. But usually when celebrities are awarded something that civilians could get as well (assuming they don't) then it's not encouraging. I don't look up to celebrities to live my life or to encourage me to do something. But I suppose each individual is different.",
                            "author": "Sivassassin",
                            "id": "jaqjwz4",
                            "parent_id": "t1_jaqjqnc",
                            "score": 14,
                            "created_utc": 1677836188.0,
                            "replies": [
                                {
                                    "body": "She has a lot of Korean fans that look up to her.",
                                    "author": "Pyeonsae",
                                    "id": "jaqn1f1",
                                    "parent_id": "t1_jaqjwz4",
                                    "score": 3,
                                    "created_utc": 1677838884.0,
                                    "replies": [
                                        {
                                            "body": "Yes 100% she is awesome. But I wasn't implying anything against her or other celebrities. Just that civilians get recognised as well.",
                                            "author": "Sivassassin",
                                            "id": "jaquc56",
                                            "parent_id": "t1_jaqn1f1",
                                            "score": 9,
                                            "created_utc": 1677844530.0,
                                            "replies": [
                                                {
                                                    "body": "You said \".. then its not encouraging\". I'm saying this award will encourage her korean fans. \n\nShe has a lot of fans and that's is their target audience.",
                                                    "author": "Pyeonsae",
                                                    "id": "jau910f",
                                                    "parent_id": "t1_jaquc56",
                                                    "score": 4,
                                                    "created_utc": 1677898153.0,
                                                    "replies": [
                                                        {
                                                            "body": "But I wasn't speaking just about her fans. There's others who don't watch Running man. Similar to other recipients of the awards same context, I was speaking on celebrities receiving the awards in general not Jihyo in particular. I pay tax but I don't get an award, where's mine 🤣. \n\nThe quoted part you had responded to, I had put \"assuming they don't\" as in assuming the civilians don't receive the award, which isn't encouraging since people can think if they pay tax then why aren't they being awarded and celebrities are. That's where I was getting at, not against Jihyo or other recipients.\n\nEdit: additional text in the 1st para.",
                                                            "author": "Sivassassin",
                                                            "id": "javbcsd",
                                                            "parent_id": "t1_jau910f",
                                                            "score": 2,
                                                            "created_utc": 1677924083.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Sorry not trying to make you mad. Im just explaining why they choose sjh for this award.\n\nAgain this PR move is not to those who dont know her. They are specifically targetting sjh fans. She still has huge crazy fandom. Just go to twitter, FB or IG. She's only the least favorite on reddit. Previous recipients were also big names in Korea. IU, Lee Seung Gi, Seo Jin are all huge stars.\n\nThey wouldnt chose an ordinary civiliant to receive this, because there will be no one who care. Or maybe they did giving award to civilians but we dont know because not a lot of people care. The fact that we know about this event shows that they have spread the message even further from their target audience. A succes imo.",
                                                                    "author": "Pyeonsae",
                                                                    "id": "jawjf2z",
                                                                    "parent_id": "t1_javbcsd",
                                                                    "score": 3,
                                                                    "created_utc": 1677948961.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "No don't worry not mad at all. I love having discussions 😊\n\nYeah I'm a fan of Running man. I remember all the hate So Min was getting due to Jihyo \"getting less limelight\", Jihyo has a mass following. But I definitely understand the PR strategy 100%, but just don't understand why celebrities would get an award for paying their tax when it's the norm anyway. Perhaps an award for something else, maybe charitable for instance (i think they probably have that) would be better but for tax it's generally the normal anyway.\n\nEdit: amended a word",
                                                                            "author": "Sivassassin",
                                                                            "id": "jawpq1y",
                                                                            "parent_id": "t1_jawjf2z",
                                                                            "score": 3,
                                                                            "created_utc": 1677951490.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "How is the S. Korean government anyways? I mean tax-wise, do citizens there think they're generally living well because the government is putting their money into good use?\n\nThis is coming from someone living in a 3rd world country with a super corrupt government because I can only imagine how better my home country would be if the government wasn't so dirty and greedy.",
                    "author": "IcedKofe",
                    "id": "jark79o",
                    "parent_id": "t1_jaqh3hi",
                    "score": 2,
                    "created_utc": 1677857554.0,
                    "replies": [
                        {
                            "body": "Pretty damn corrupt. Putting my bets that people giving her the awards are the ones evading taxes.",
                            "author": "gyojoo",
                            "id": "jatw8c2",
                            "parent_id": "t1_jark79o",
                            "score": 5,
                            "created_utc": 1677891943.0,
                            "replies": [
                                {
                                    "body": "And how did you know this? Any resources?",
                                    "author": "I_have_No_idea_ReALy",
                                    "id": "jb369u8",
                                    "parent_id": "t1_jatw8c2",
                                    "score": 2,
                                    "created_utc": 1678068313.0,
                                    "replies": [
                                        {
                                            "body": "Well I keep tabs on news and politics of my own country and I've been following news on their 6-7 of their presidents and all the Shenanigans they've been causing from either side. \n\nOh yeah, they're corrupt to the core.",
                                            "author": "gyojoo",
                                            "id": "jb3azsl",
                                            "parent_id": "t1_jb369u8",
                                            "score": 1,
                                            "created_utc": 1678070587.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I'm not too sure about the government side. I've read stuff and watched videos of issues, but I'm not too sure if I can comment on the political side as i may not know it too well. Sorry, hopefully someone can answer. 😊",
                            "author": "Sivassassin",
                            "id": "jaroeus",
                            "parent_id": "t1_jark79o",
                            "score": 1,
                            "created_utc": 1677859225.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've read that too Kwon Sang Woo, Lee Min Ho are caught up in tax scandals.",
            "author": "Funny_Commission2773",
            "id": "jb4960x",
            "parent_id": "t1_jaqkp2f",
            "score": 4,
            "created_utc": 1678092663.0,
            "replies": []
        },
        {
            "body": "Shes a tax accounting graduate☺️",
            "author": "Witty_Inspection_310",
            "id": "jaztfu7",
            "parent_id": "t1_jarb8eg",
            "score": 5,
            "created_utc": 1678009034.0,
            "replies": []
        },
        {
            "body": "I can imagine her finance manager advising ways to save on taxes and she is so unbothered, she just pay more so she can have peace and quiet. \n\nmanager : \"Jihyo-ssi your tax this year is 10K won\"\n\nSJH : \"Pay 30K and don't bother me for 2 years\"\n\nmanager : \"But..\"\n\nSJH : \"zzzz\"",
            "author": "Kuuganism",
            "id": "jb38a77",
            "parent_id": "t1_jarb8eg",
            "score": 5,
            "created_utc": 1678069279.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "jaqyec2",
            "parent_id": "t1_jaqx572",
            "score": -22,
            "created_utc": 1677847075.0,
            "replies": [
                {
                    "body": "Huh, strange how the votes on comments suddenly turned around. Interesting. A frozen flower comment has less downvotes. 😂 just overall very strange votes on this... Something fishy is going on. 😂 (I'm not talking about my comments but the thread itself - edit)",
                    "author": "Ancient_Reply4583",
                    "id": "jar7rcx",
                    "parent_id": "t1_jaqyec2",
                    "score": -20,
                    "created_utc": 1677851989.0,
                    "replies": [
                        {
                            "body": "Sorry to say but you are the fishy one.Those things you said way up,its not posted because a fan just dont want to post it here,that simple.You also post here random things about somin/other members(cant really remember) but i think its too foul for you to ask those things.It has been a discussion here especially when jihyo/somin updates on IG weekly before and a lot agree that it does no harm/does not really care at all.After all,we are all free to up/down votes.\n\nAnd the frozen flower thing?Whats the problem with it?It's her job as an actress with great cast and does great on sales.It's not like she does it just because she want to her body to everyone.If you think about it,a nude painting can't be made without a nude model.\n\nHuh,strange thinking ☺️☺️☺️",
                            "author": "Witty_Inspection_310",
                            "id": "jazugrd",
                            "parent_id": "t1_jar7rcx",
                            "score": 6,
                            "created_utc": 1678009924.0,
                            "replies": [
                                {
                                    "body": "Yeah, posts on this sub don't usually have 477 upvotes in a matter of 24 hours. Especially posts that aren't related to the show. This is just an observation, btw. And more power to anyone doing any movie they want. Who said otherwise? You misunderstanding that part about FF entirely.",
                                    "author": "Ancient_Reply4583",
                                    "id": "jb043dh",
                                    "parent_id": "t1_jazugrd",
                                    "score": -4,
                                    "created_utc": 1678018041.0,
                                    "replies": [
                                        {
                                            "body": "So your main issue was it has 477 upvotes within 24 hours and its a song ji hyo news?Isn't that too childish?",
                                            "author": "Witty_Inspection_310",
                                            "id": "jb04d0a",
                                            "parent_id": "t1_jb043dh",
                                            "score": 7,
                                            "created_utc": 1678018238.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No ones gonna write articles about regular people getting an award, maybe they do and you just don't hear about it?\n\nThe point is to promote paying taxes as a responsible good thing to do",
            "author": "echo-128",
            "id": "jaqjqnc",
            "parent_id": "t1_jaqh3hi",
            "score": 27,
            "created_utc": 1677836038.0,
            "replies": [
                {
                    "body": "Yeah I get the point. But usually when celebrities are awarded something that civilians could get as well (assuming they don't) then it's not encouraging. I don't look up to celebrities to live my life or to encourage me to do something. But I suppose each individual is different.",
                    "author": "Sivassassin",
                    "id": "jaqjwz4",
                    "parent_id": "t1_jaqjqnc",
                    "score": 14,
                    "created_utc": 1677836188.0,
                    "replies": [
                        {
                            "body": "She has a lot of Korean fans that look up to her.",
                            "author": "Pyeonsae",
                            "id": "jaqn1f1",
                            "parent_id": "t1_jaqjwz4",
                            "score": 3,
                            "created_utc": 1677838884.0,
                            "replies": [
                                {
                                    "body": "Yes 100% she is awesome. But I wasn't implying anything against her or other celebrities. Just that civilians get recognised as well.",
                                    "author": "Sivassassin",
                                    "id": "jaquc56",
                                    "parent_id": "t1_jaqn1f1",
                                    "score": 9,
                                    "created_utc": 1677844530.0,
                                    "replies": [
                                        {
                                            "body": "You said \".. then its not encouraging\". I'm saying this award will encourage her korean fans. \n\nShe has a lot of fans and that's is their target audience.",
                                            "author": "Pyeonsae",
                                            "id": "jau910f",
                                            "parent_id": "t1_jaquc56",
                                            "score": 4,
                                            "created_utc": 1677898153.0,
                                            "replies": [
                                                {
                                                    "body": "But I wasn't speaking just about her fans. There's others who don't watch Running man. Similar to other recipients of the awards same context, I was speaking on celebrities receiving the awards in general not Jihyo in particular. I pay tax but I don't get an award, where's mine 🤣. \n\nThe quoted part you had responded to, I had put \"assuming they don't\" as in assuming the civilians don't receive the award, which isn't encouraging since people can think if they pay tax then why aren't they being awarded and celebrities are. That's where I was getting at, not against Jihyo or other recipients.\n\nEdit: additional text in the 1st para.",
                                                    "author": "Sivassassin",
                                                    "id": "javbcsd",
                                                    "parent_id": "t1_jau910f",
                                                    "score": 2,
                                                    "created_utc": 1677924083.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sorry not trying to make you mad. Im just explaining why they choose sjh for this award.\n\nAgain this PR move is not to those who dont know her. They are specifically targetting sjh fans. She still has huge crazy fandom. Just go to twitter, FB or IG. She's only the least favorite on reddit. Previous recipients were also big names in Korea. IU, Lee Seung Gi, Seo Jin are all huge stars.\n\nThey wouldnt chose an ordinary civiliant to receive this, because there will be no one who care. Or maybe they did giving award to civilians but we dont know because not a lot of people care. The fact that we know about this event shows that they have spread the message even further from their target audience. A succes imo.",
                                                            "author": "Pyeonsae",
                                                            "id": "jawjf2z",
                                                            "parent_id": "t1_javbcsd",
                                                            "score": 3,
                                                            "created_utc": 1677948961.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No don't worry not mad at all. I love having discussions 😊\n\nYeah I'm a fan of Running man. I remember all the hate So Min was getting due to Jihyo \"getting less limelight\", Jihyo has a mass following. But I definitely understand the PR strategy 100%, but just don't understand why celebrities would get an award for paying their tax when it's the norm anyway. Perhaps an award for something else, maybe charitable for instance (i think they probably have that) would be better but for tax it's generally the normal anyway.\n\nEdit: amended a word",
                                                                    "author": "Sivassassin",
                                                                    "id": "jawpq1y",
                                                                    "parent_id": "t1_jawjf2z",
                                                                    "score": 3,
                                                                    "created_utc": 1677951490.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How is the S. Korean government anyways? I mean tax-wise, do citizens there think they're generally living well because the government is putting their money into good use?\n\nThis is coming from someone living in a 3rd world country with a super corrupt government because I can only imagine how better my home country would be if the government wasn't so dirty and greedy.",
            "author": "IcedKofe",
            "id": "jark79o",
            "parent_id": "t1_jaqh3hi",
            "score": 2,
            "created_utc": 1677857554.0,
            "replies": [
                {
                    "body": "Pretty damn corrupt. Putting my bets that people giving her the awards are the ones evading taxes.",
                    "author": "gyojoo",
                    "id": "jatw8c2",
                    "parent_id": "t1_jark79o",
                    "score": 5,
                    "created_utc": 1677891943.0,
                    "replies": [
                        {
                            "body": "And how did you know this? Any resources?",
                            "author": "I_have_No_idea_ReALy",
                            "id": "jb369u8",
                            "parent_id": "t1_jatw8c2",
                            "score": 2,
                            "created_utc": 1678068313.0,
                            "replies": [
                                {
                                    "body": "Well I keep tabs on news and politics of my own country and I've been following news on their 6-7 of their presidents and all the Shenanigans they've been causing from either side. \n\nOh yeah, they're corrupt to the core.",
                                    "author": "gyojoo",
                                    "id": "jb3azsl",
                                    "parent_id": "t1_jb369u8",
                                    "score": 1,
                                    "created_utc": 1678070587.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I'm not too sure about the government side. I've read stuff and watched videos of issues, but I'm not too sure if I can comment on the political side as i may not know it too well. Sorry, hopefully someone can answer. 😊",
                    "author": "Sivassassin",
                    "id": "jaroeus",
                    "parent_id": "t1_jark79o",
                    "score": 1,
                    "created_utc": 1677859225.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Huh, strange how the votes on comments suddenly turned around. Interesting. A frozen flower comment has less downvotes. 😂 just overall very strange votes on this... Something fishy is going on. 😂 (I'm not talking about my comments but the thread itself - edit)",
            "author": "Ancient_Reply4583",
            "id": "jar7rcx",
            "parent_id": "t1_jaqyec2",
            "score": -20,
            "created_utc": 1677851989.0,
            "replies": [
                {
                    "body": "Sorry to say but you are the fishy one.Those things you said way up,its not posted because a fan just dont want to post it here,that simple.You also post here random things about somin/other members(cant really remember) but i think its too foul for you to ask those things.It has been a discussion here especially when jihyo/somin updates on IG weekly before and a lot agree that it does no harm/does not really care at all.After all,we are all free to up/down votes.\n\nAnd the frozen flower thing?Whats the problem with it?It's her job as an actress with great cast and does great on sales.It's not like she does it just because she want to her body to everyone.If you think about it,a nude painting can't be made without a nude model.\n\nHuh,strange thinking ☺️☺️☺️",
                    "author": "Witty_Inspection_310",
                    "id": "jazugrd",
                    "parent_id": "t1_jar7rcx",
                    "score": 6,
                    "created_utc": 1678009924.0,
                    "replies": [
                        {
                            "body": "Yeah, posts on this sub don't usually have 477 upvotes in a matter of 24 hours. Especially posts that aren't related to the show. This is just an observation, btw. And more power to anyone doing any movie they want. Who said otherwise? You misunderstanding that part about FF entirely.",
                            "author": "Ancient_Reply4583",
                            "id": "jb043dh",
                            "parent_id": "t1_jazugrd",
                            "score": -4,
                            "created_utc": 1678018041.0,
                            "replies": [
                                {
                                    "body": "So your main issue was it has 477 upvotes within 24 hours and its a song ji hyo news?Isn't that too childish?",
                                    "author": "Witty_Inspection_310",
                                    "id": "jb04d0a",
                                    "parent_id": "t1_jb043dh",
                                    "score": 7,
                                    "created_utc": 1678018238.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah I get the point. But usually when celebrities are awarded something that civilians could get as well (assuming they don't) then it's not encouraging. I don't look up to celebrities to live my life or to encourage me to do something. But I suppose each individual is different.",
            "author": "Sivassassin",
            "id": "jaqjwz4",
            "parent_id": "t1_jaqjqnc",
            "score": 14,
            "created_utc": 1677836188.0,
            "replies": [
                {
                    "body": "She has a lot of Korean fans that look up to her.",
                    "author": "Pyeonsae",
                    "id": "jaqn1f1",
                    "parent_id": "t1_jaqjwz4",
                    "score": 3,
                    "created_utc": 1677838884.0,
                    "replies": [
                        {
                            "body": "Yes 100% she is awesome. But I wasn't implying anything against her or other celebrities. Just that civilians get recognised as well.",
                            "author": "Sivassassin",
                            "id": "jaquc56",
                            "parent_id": "t1_jaqn1f1",
                            "score": 9,
                            "created_utc": 1677844530.0,
                            "replies": [
                                {
                                    "body": "You said \".. then its not encouraging\". I'm saying this award will encourage her korean fans. \n\nShe has a lot of fans and that's is their target audience.",
                                    "author": "Pyeonsae",
                                    "id": "jau910f",
                                    "parent_id": "t1_jaquc56",
                                    "score": 4,
                                    "created_utc": 1677898153.0,
                                    "replies": [
                                        {
                                            "body": "But I wasn't speaking just about her fans. There's others who don't watch Running man. Similar to other recipients of the awards same context, I was speaking on celebrities receiving the awards in general not Jihyo in particular. I pay tax but I don't get an award, where's mine 🤣. \n\nThe quoted part you had responded to, I had put \"assuming they don't\" as in assuming the civilians don't receive the award, which isn't encouraging since people can think if they pay tax then why aren't they being awarded and celebrities are. That's where I was getting at, not against Jihyo or other recipients.\n\nEdit: additional text in the 1st para.",
                                            "author": "Sivassassin",
                                            "id": "javbcsd",
                                            "parent_id": "t1_jau910f",
                                            "score": 2,
                                            "created_utc": 1677924083.0,
                                            "replies": [
                                                {
                                                    "body": "Sorry not trying to make you mad. Im just explaining why they choose sjh for this award.\n\nAgain this PR move is not to those who dont know her. They are specifically targetting sjh fans. She still has huge crazy fandom. Just go to twitter, FB or IG. She's only the least favorite on reddit. Previous recipients were also big names in Korea. IU, Lee Seung Gi, Seo Jin are all huge stars.\n\nThey wouldnt chose an ordinary civiliant to receive this, because there will be no one who care. Or maybe they did giving award to civilians but we dont know because not a lot of people care. The fact that we know about this event shows that they have spread the message even further from their target audience. A succes imo.",
                                                    "author": "Pyeonsae",
                                                    "id": "jawjf2z",
                                                    "parent_id": "t1_javbcsd",
                                                    "score": 3,
                                                    "created_utc": 1677948961.0,
                                                    "replies": [
                                                        {
                                                            "body": "No don't worry not mad at all. I love having discussions 😊\n\nYeah I'm a fan of Running man. I remember all the hate So Min was getting due to Jihyo \"getting less limelight\", Jihyo has a mass following. But I definitely understand the PR strategy 100%, but just don't understand why celebrities would get an award for paying their tax when it's the norm anyway. Perhaps an award for something else, maybe charitable for instance (i think they probably have that) would be better but for tax it's generally the normal anyway.\n\nEdit: amended a word",
                                                            "author": "Sivassassin",
                                                            "id": "jawpq1y",
                                                            "parent_id": "t1_jawjf2z",
                                                            "score": 3,
                                                            "created_utc": 1677951490.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Pretty damn corrupt. Putting my bets that people giving her the awards are the ones evading taxes.",
            "author": "gyojoo",
            "id": "jatw8c2",
            "parent_id": "t1_jark79o",
            "score": 5,
            "created_utc": 1677891943.0,
            "replies": [
                {
                    "body": "And how did you know this? Any resources?",
                    "author": "I_have_No_idea_ReALy",
                    "id": "jb369u8",
                    "parent_id": "t1_jatw8c2",
                    "score": 2,
                    "created_utc": 1678068313.0,
                    "replies": [
                        {
                            "body": "Well I keep tabs on news and politics of my own country and I've been following news on their 6-7 of their presidents and all the Shenanigans they've been causing from either side. \n\nOh yeah, they're corrupt to the core.",
                            "author": "gyojoo",
                            "id": "jb3azsl",
                            "parent_id": "t1_jb369u8",
                            "score": 1,
                            "created_utc": 1678070587.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm not too sure about the government side. I've read stuff and watched videos of issues, but I'm not too sure if I can comment on the political side as i may not know it too well. Sorry, hopefully someone can answer. 😊",
            "author": "Sivassassin",
            "id": "jaroeus",
            "parent_id": "t1_jark79o",
            "score": 1,
            "created_utc": 1677859225.0,
            "replies": []
        },
        {
            "body": "Sorry to say but you are the fishy one.Those things you said way up,its not posted because a fan just dont want to post it here,that simple.You also post here random things about somin/other members(cant really remember) but i think its too foul for you to ask those things.It has been a discussion here especially when jihyo/somin updates on IG weekly before and a lot agree that it does no harm/does not really care at all.After all,we are all free to up/down votes.\n\nAnd the frozen flower thing?Whats the problem with it?It's her job as an actress with great cast and does great on sales.It's not like she does it just because she want to her body to everyone.If you think about it,a nude painting can't be made without a nude model.\n\nHuh,strange thinking ☺️☺️☺️",
            "author": "Witty_Inspection_310",
            "id": "jazugrd",
            "parent_id": "t1_jar7rcx",
            "score": 6,
            "created_utc": 1678009924.0,
            "replies": [
                {
                    "body": "Yeah, posts on this sub don't usually have 477 upvotes in a matter of 24 hours. Especially posts that aren't related to the show. This is just an observation, btw. And more power to anyone doing any movie they want. Who said otherwise? You misunderstanding that part about FF entirely.",
                    "author": "Ancient_Reply4583",
                    "id": "jb043dh",
                    "parent_id": "t1_jazugrd",
                    "score": -4,
                    "created_utc": 1678018041.0,
                    "replies": [
                        {
                            "body": "So your main issue was it has 477 upvotes within 24 hours and its a song ji hyo news?Isn't that too childish?",
                            "author": "Witty_Inspection_310",
                            "id": "jb04d0a",
                            "parent_id": "t1_jb043dh",
                            "score": 7,
                            "created_utc": 1678018238.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "She has a lot of Korean fans that look up to her.",
            "author": "Pyeonsae",
            "id": "jaqn1f1",
            "parent_id": "t1_jaqjwz4",
            "score": 3,
            "created_utc": 1677838884.0,
            "replies": [
                {
                    "body": "Yes 100% she is awesome. But I wasn't implying anything against her or other celebrities. Just that civilians get recognised as well.",
                    "author": "Sivassassin",
                    "id": "jaquc56",
                    "parent_id": "t1_jaqn1f1",
                    "score": 9,
                    "created_utc": 1677844530.0,
                    "replies": [
                        {
                            "body": "You said \".. then its not encouraging\". I'm saying this award will encourage her korean fans. \n\nShe has a lot of fans and that's is their target audience.",
                            "author": "Pyeonsae",
                            "id": "jau910f",
                            "parent_id": "t1_jaquc56",
                            "score": 4,
                            "created_utc": 1677898153.0,
                            "replies": [
                                {
                                    "body": "But I wasn't speaking just about her fans. There's others who don't watch Running man. Similar to other recipients of the awards same context, I was speaking on celebrities receiving the awards in general not Jihyo in particular. I pay tax but I don't get an award, where's mine 🤣. \n\nThe quoted part you had responded to, I had put \"assuming they don't\" as in assuming the civilians don't receive the award, which isn't encouraging since people can think if they pay tax then why aren't they being awarded and celebrities are. That's where I was getting at, not against Jihyo or other recipients.\n\nEdit: additional text in the 1st para.",
                                    "author": "Sivassassin",
                                    "id": "javbcsd",
                                    "parent_id": "t1_jau910f",
                                    "score": 2,
                                    "created_utc": 1677924083.0,
                                    "replies": [
                                        {
                                            "body": "Sorry not trying to make you mad. Im just explaining why they choose sjh for this award.\n\nAgain this PR move is not to those who dont know her. They are specifically targetting sjh fans. She still has huge crazy fandom. Just go to twitter, FB or IG. She's only the least favorite on reddit. Previous recipients were also big names in Korea. IU, Lee Seung Gi, Seo Jin are all huge stars.\n\nThey wouldnt chose an ordinary civiliant to receive this, because there will be no one who care. Or maybe they did giving award to civilians but we dont know because not a lot of people care. The fact that we know about this event shows that they have spread the message even further from their target audience. A succes imo.",
                                            "author": "Pyeonsae",
                                            "id": "jawjf2z",
                                            "parent_id": "t1_javbcsd",
                                            "score": 3,
                                            "created_utc": 1677948961.0,
                                            "replies": [
                                                {
                                                    "body": "No don't worry not mad at all. I love having discussions 😊\n\nYeah I'm a fan of Running man. I remember all the hate So Min was getting due to Jihyo \"getting less limelight\", Jihyo has a mass following. But I definitely understand the PR strategy 100%, but just don't understand why celebrities would get an award for paying their tax when it's the norm anyway. Perhaps an award for something else, maybe charitable for instance (i think they probably have that) would be better but for tax it's generally the normal anyway.\n\nEdit: amended a word",
                                                    "author": "Sivassassin",
                                                    "id": "jawpq1y",
                                                    "parent_id": "t1_jawjf2z",
                                                    "score": 3,
                                                    "created_utc": 1677951490.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And how did you know this? Any resources?",
            "author": "I_have_No_idea_ReALy",
            "id": "jb369u8",
            "parent_id": "t1_jatw8c2",
            "score": 2,
            "created_utc": 1678068313.0,
            "replies": [
                {
                    "body": "Well I keep tabs on news and politics of my own country and I've been following news on their 6-7 of their presidents and all the Shenanigans they've been causing from either side. \n\nOh yeah, they're corrupt to the core.",
                    "author": "gyojoo",
                    "id": "jb3azsl",
                    "parent_id": "t1_jb369u8",
                    "score": 1,
                    "created_utc": 1678070587.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, posts on this sub don't usually have 477 upvotes in a matter of 24 hours. Especially posts that aren't related to the show. This is just an observation, btw. And more power to anyone doing any movie they want. Who said otherwise? You misunderstanding that part about FF entirely.",
            "author": "Ancient_Reply4583",
            "id": "jb043dh",
            "parent_id": "t1_jazugrd",
            "score": -4,
            "created_utc": 1678018041.0,
            "replies": [
                {
                    "body": "So your main issue was it has 477 upvotes within 24 hours and its a song ji hyo news?Isn't that too childish?",
                    "author": "Witty_Inspection_310",
                    "id": "jb04d0a",
                    "parent_id": "t1_jb043dh",
                    "score": 7,
                    "created_utc": 1678018238.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes 100% she is awesome. But I wasn't implying anything against her or other celebrities. Just that civilians get recognised as well.",
            "author": "Sivassassin",
            "id": "jaquc56",
            "parent_id": "t1_jaqn1f1",
            "score": 9,
            "created_utc": 1677844530.0,
            "replies": [
                {
                    "body": "You said \".. then its not encouraging\". I'm saying this award will encourage her korean fans. \n\nShe has a lot of fans and that's is their target audience.",
                    "author": "Pyeonsae",
                    "id": "jau910f",
                    "parent_id": "t1_jaquc56",
                    "score": 4,
                    "created_utc": 1677898153.0,
                    "replies": [
                        {
                            "body": "But I wasn't speaking just about her fans. There's others who don't watch Running man. Similar to other recipients of the awards same context, I was speaking on celebrities receiving the awards in general not Jihyo in particular. I pay tax but I don't get an award, where's mine 🤣. \n\nThe quoted part you had responded to, I had put \"assuming they don't\" as in assuming the civilians don't receive the award, which isn't encouraging since people can think if they pay tax then why aren't they being awarded and celebrities are. That's where I was getting at, not against Jihyo or other recipients.\n\nEdit: additional text in the 1st para.",
                            "author": "Sivassassin",
                            "id": "javbcsd",
                            "parent_id": "t1_jau910f",
                            "score": 2,
                            "created_utc": 1677924083.0,
                            "replies": [
                                {
                                    "body": "Sorry not trying to make you mad. Im just explaining why they choose sjh for this award.\n\nAgain this PR move is not to those who dont know her. They are specifically targetting sjh fans. She still has huge crazy fandom. Just go to twitter, FB or IG. She's only the least favorite on reddit. Previous recipients were also big names in Korea. IU, Lee Seung Gi, Seo Jin are all huge stars.\n\nThey wouldnt chose an ordinary civiliant to receive this, because there will be no one who care. Or maybe they did giving award to civilians but we dont know because not a lot of people care. The fact that we know about this event shows that they have spread the message even further from their target audience. A succes imo.",
                                    "author": "Pyeonsae",
                                    "id": "jawjf2z",
                                    "parent_id": "t1_javbcsd",
                                    "score": 3,
                                    "created_utc": 1677948961.0,
                                    "replies": [
                                        {
                                            "body": "No don't worry not mad at all. I love having discussions 😊\n\nYeah I'm a fan of Running man. I remember all the hate So Min was getting due to Jihyo \"getting less limelight\", Jihyo has a mass following. But I definitely understand the PR strategy 100%, but just don't understand why celebrities would get an award for paying their tax when it's the norm anyway. Perhaps an award for something else, maybe charitable for instance (i think they probably have that) would be better but for tax it's generally the normal anyway.\n\nEdit: amended a word",
                                            "author": "Sivassassin",
                                            "id": "jawpq1y",
                                            "parent_id": "t1_jawjf2z",
                                            "score": 3,
                                            "created_utc": 1677951490.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well I keep tabs on news and politics of my own country and I've been following news on their 6-7 of their presidents and all the Shenanigans they've been causing from either side. \n\nOh yeah, they're corrupt to the core.",
            "author": "gyojoo",
            "id": "jb3azsl",
            "parent_id": "t1_jb369u8",
            "score": 1,
            "created_utc": 1678070587.0,
            "replies": []
        },
        {
            "body": "So your main issue was it has 477 upvotes within 24 hours and its a song ji hyo news?Isn't that too childish?",
            "author": "Witty_Inspection_310",
            "id": "jb04d0a",
            "parent_id": "t1_jb043dh",
            "score": 7,
            "created_utc": 1678018238.0,
            "replies": []
        },
        {
            "body": "You said \".. then its not encouraging\". I'm saying this award will encourage her korean fans. \n\nShe has a lot of fans and that's is their target audience.",
            "author": "Pyeonsae",
            "id": "jau910f",
            "parent_id": "t1_jaquc56",
            "score": 4,
            "created_utc": 1677898153.0,
            "replies": [
                {
                    "body": "But I wasn't speaking just about her fans. There's others who don't watch Running man. Similar to other recipients of the awards same context, I was speaking on celebrities receiving the awards in general not Jihyo in particular. I pay tax but I don't get an award, where's mine 🤣. \n\nThe quoted part you had responded to, I had put \"assuming they don't\" as in assuming the civilians don't receive the award, which isn't encouraging since people can think if they pay tax then why aren't they being awarded and celebrities are. That's where I was getting at, not against Jihyo or other recipients.\n\nEdit: additional text in the 1st para.",
                    "author": "Sivassassin",
                    "id": "javbcsd",
                    "parent_id": "t1_jau910f",
                    "score": 2,
                    "created_utc": 1677924083.0,
                    "replies": [
                        {
                            "body": "Sorry not trying to make you mad. Im just explaining why they choose sjh for this award.\n\nAgain this PR move is not to those who dont know her. They are specifically targetting sjh fans. She still has huge crazy fandom. Just go to twitter, FB or IG. She's only the least favorite on reddit. Previous recipients were also big names in Korea. IU, Lee Seung Gi, Seo Jin are all huge stars.\n\nThey wouldnt chose an ordinary civiliant to receive this, because there will be no one who care. Or maybe they did giving award to civilians but we dont know because not a lot of people care. The fact that we know about this event shows that they have spread the message even further from their target audience. A succes imo.",
                            "author": "Pyeonsae",
                            "id": "jawjf2z",
                            "parent_id": "t1_javbcsd",
                            "score": 3,
                            "created_utc": 1677948961.0,
                            "replies": [
                                {
                                    "body": "No don't worry not mad at all. I love having discussions 😊\n\nYeah I'm a fan of Running man. I remember all the hate So Min was getting due to Jihyo \"getting less limelight\", Jihyo has a mass following. But I definitely understand the PR strategy 100%, but just don't understand why celebrities would get an award for paying their tax when it's the norm anyway. Perhaps an award for something else, maybe charitable for instance (i think they probably have that) would be better but for tax it's generally the normal anyway.\n\nEdit: amended a word",
                                    "author": "Sivassassin",
                                    "id": "jawpq1y",
                                    "parent_id": "t1_jawjf2z",
                                    "score": 3,
                                    "created_utc": 1677951490.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "But I wasn't speaking just about her fans. There's others who don't watch Running man. Similar to other recipients of the awards same context, I was speaking on celebrities receiving the awards in general not Jihyo in particular. I pay tax but I don't get an award, where's mine 🤣. \n\nThe quoted part you had responded to, I had put \"assuming they don't\" as in assuming the civilians don't receive the award, which isn't encouraging since people can think if they pay tax then why aren't they being awarded and celebrities are. That's where I was getting at, not against Jihyo or other recipients.\n\nEdit: additional text in the 1st para.",
            "author": "Sivassassin",
            "id": "javbcsd",
            "parent_id": "t1_jau910f",
            "score": 2,
            "created_utc": 1677924083.0,
            "replies": [
                {
                    "body": "Sorry not trying to make you mad. Im just explaining why they choose sjh for this award.\n\nAgain this PR move is not to those who dont know her. They are specifically targetting sjh fans. She still has huge crazy fandom. Just go to twitter, FB or IG. She's only the least favorite on reddit. Previous recipients were also big names in Korea. IU, Lee Seung Gi, Seo Jin are all huge stars.\n\nThey wouldnt chose an ordinary civiliant to receive this, because there will be no one who care. Or maybe they did giving award to civilians but we dont know because not a lot of people care. The fact that we know about this event shows that they have spread the message even further from their target audience. A succes imo.",
                    "author": "Pyeonsae",
                    "id": "jawjf2z",
                    "parent_id": "t1_javbcsd",
                    "score": 3,
                    "created_utc": 1677948961.0,
                    "replies": [
                        {
                            "body": "No don't worry not mad at all. I love having discussions 😊\n\nYeah I'm a fan of Running man. I remember all the hate So Min was getting due to Jihyo \"getting less limelight\", Jihyo has a mass following. But I definitely understand the PR strategy 100%, but just don't understand why celebrities would get an award for paying their tax when it's the norm anyway. Perhaps an award for something else, maybe charitable for instance (i think they probably have that) would be better but for tax it's generally the normal anyway.\n\nEdit: amended a word",
                            "author": "Sivassassin",
                            "id": "jawpq1y",
                            "parent_id": "t1_jawjf2z",
                            "score": 3,
                            "created_utc": 1677951490.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry not trying to make you mad. Im just explaining why they choose sjh for this award.\n\nAgain this PR move is not to those who dont know her. They are specifically targetting sjh fans. She still has huge crazy fandom. Just go to twitter, FB or IG. She's only the least favorite on reddit. Previous recipients were also big names in Korea. IU, Lee Seung Gi, Seo Jin are all huge stars.\n\nThey wouldnt chose an ordinary civiliant to receive this, because there will be no one who care. Or maybe they did giving award to civilians but we dont know because not a lot of people care. The fact that we know about this event shows that they have spread the message even further from their target audience. A succes imo.",
            "author": "Pyeonsae",
            "id": "jawjf2z",
            "parent_id": "t1_javbcsd",
            "score": 3,
            "created_utc": 1677948961.0,
            "replies": [
                {
                    "body": "No don't worry not mad at all. I love having discussions 😊\n\nYeah I'm a fan of Running man. I remember all the hate So Min was getting due to Jihyo \"getting less limelight\", Jihyo has a mass following. But I definitely understand the PR strategy 100%, but just don't understand why celebrities would get an award for paying their tax when it's the norm anyway. Perhaps an award for something else, maybe charitable for instance (i think they probably have that) would be better but for tax it's generally the normal anyway.\n\nEdit: amended a word",
                    "author": "Sivassassin",
                    "id": "jawpq1y",
                    "parent_id": "t1_jawjf2z",
                    "score": 3,
                    "created_utc": 1677951490.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No don't worry not mad at all. I love having discussions 😊\n\nYeah I'm a fan of Running man. I remember all the hate So Min was getting due to Jihyo \"getting less limelight\", Jihyo has a mass following. But I definitely understand the PR strategy 100%, but just don't understand why celebrities would get an award for paying their tax when it's the norm anyway. Perhaps an award for something else, maybe charitable for instance (i think they probably have that) would be better but for tax it's generally the normal anyway.\n\nEdit: amended a word",
            "author": "Sivassassin",
            "id": "jawpq1y",
            "parent_id": "t1_jawjf2z",
            "score": 3,
            "created_utc": 1677951490.0,
            "replies": []
        }
    ]
}