{
    "title": "Thats it! Im Christmas gift shaming!! Myself apparently...",
    "post_id": "k9zir3",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/k9zir3/thats_it_im_christmas_gift_shaming_myself/",
    "author": "Empty-Friend-1086",
    "body": "AN SB CHRISTMAS STORY🎅🎄🎁🎇💝\n\nI read on the forum about the gifts you all are intending to exchange and I thought I should contribute my thoughts. I have never posted, but I really believe someone needs to hear this and can relate. I am sd-less for the past few years and just haven't found the energy to return to the bowl yet. I hope I will get back in the swing of things, because I miss it so much and I definitely could use the benefits. I kinda live vicariously thru all of you and stay well read on this forum! I love it!! \n\na few years back, I had an amazing arrangement with a gentlemen. Literally, the late preachers son-  he was in his late 50's and I my mid 20's. He invited me to their family church service and to the extravagant holiday dinner with the entire family. I felt out of place as they were all definitely higher class than I was, as a single mom from a very low income/class family. I remember being especially fascinated by the special silver dish that was meant to keep cold food cold and separate from your warm plate (lol) and the idea of having my place set with 2 forks. I was a long way from home to say the least. Without my manners and politeness, I would've failed the event horribly. \n\nAnyways, it came time to open gifts around this massive tree that belonged in a higher end mall or a hallmark movie for sure. I sat quietly, very much out of my element. He gifted me several bigger ticket items and his family barely took notice at all as they all were doing the same, tho Im sure they sensed the arrangement. It was my turn to gift him and I was embarrassed. I felt every eye in the room turn towards the corner where I had nestled in to be unseen for this moment. Im guessing they had assumed that I would only be on the receiving end  of our transactional relationship so obviously everyone in the room became interested to see what he was getting. I wanted to hide my face behind the mountain of ALL matching couch pillows that probably costed more than my car.\n\n That December was particularly rough, (like this one, but thats a story for another day) I was going thru eviction and barely making ends meet even with his help. My SD was a business man, always in a suit and tie. He had a real love for Jerry Garcia ties. (For the younger ones, he was a rock star 🎸 with the Grateful Dead band) These ties were aggressively loud and colorful. I have no idea WHY😂, but he loved them. They were on the expensive end and after I researched, I came up with the idea that I could go to every thrift shop around the Detroit Metro area and search for every Jerry Garcia tie that I could find! \n\nSurprisingly my mission was super successful. I found many and even some of them that were rare and listed on ebay at exorbitant prices. My total probably was less than $20 altogether and that was great since it is probably all I had in my purse anyway. I was so very excited. I took them to the dry cleaners (my very first trip inside a place like that) and they all came back looking new and as close to perfect as possible. I wrapped them in tissue and boxed them in pretty paper with bows and waited impatiently for Christmas to come.\n\n Sitting there in that moment though in front of him, his very successful family, and that damn perfect hallmark tree...I felt so small. I wrapped them pretty, but obviously they were not original in their new packaging and I was second guessing everything. What an awful idea compared to what these people were gifting each other. I just wanted to run or like I said HIDE as to not make an entire scene...but I didnt.\n\n I looked him in his eyes apologetically and watched him open the 6 identical size boxes with zero element of surprise by the time he'd opened the first 3. I was sad and embarrassed and ashamed. He was happy and it seemed genuine, but maybe I was misreading him. I couldn't wait for this exchange to be finished and we could move on to the next perfectly planned event on our agenda. \n\nI knew this family was strong in their tradition and it came so natural for them. Meanwhile I picture my own family who couldn't finish preparing the Christmas meal before they were drinking, drugging, or fighting and then serving us from the pots and pans on paper plates before everyone went their separate ways to eat. It was so different. I was so different. \n\nI persevered thru the night and said my goodbyes to his amazing family on my way out. He helped me to my junky car with hands full of gifts to load. I thanked him profusely and drove away.\n\n I hadnt gotten far before the tears welled up in my eyes and burned down my cheeks. I pulled over at the first gas station to steady myself and consider whether I should change my phone number, block him, or go lay in bed for 3 days eating ice cream. I didnt know what to do or what I felt or even why. Eventually I get home and into my bed feeling sorry for myself and ashamed of my gifts.\n\n He deserved so much more and better, and I just did not have it to give and the foreseeable future wasnt looking any brighter. I just felt bad. It took me a few days to come to terms with it all. \n\nWhen I finally decided to face him and stop ignoring his texts and calls, I was so surprised to see that he was actually so grateful for my thoughtfulness in choosing his gifts. He had only mentioned his small infatuation in passing conversation a couple times thru the entire time we had known each other and was very impressed that I noticed, cared, and listened. He said that this was the very best Christmas he had had since his father passed away and thanked me about 1,000 times. He was so genuine in his appreciation that it made me believe he was being honest and sincere ❤💕\n\n He felt acknowledged and special! That was my entire intention behind the gift, so I guess in hindsight- I killed it! He loved them and everytime I saw him after that at work or a date night after work, he was wearing his crazy used ties. I couldn't believe it ☺😍 eventually we split up and things did not work out between us (but, thats also another story for another day 😒) \n\nANYWAYS, I SAID ALL THAT TO SAY THIS... IF ANY OF YOU ARE FEELING INSECURE ABOUT CHOOSING THE GIFT FOR YOUR SD, DONT!! LISTEN TO YOUR INTUITION AND PUT THOUGHT INTO YOUR GIFT, AND YOU WILL NOT GO WRONG. IT DOESNT MATTER IF YOU SPEND $5 OR $5,000, IF IT IS TRULY FROM YOUR HEART AND MEANINGFUL, THEY WILL LOVE IT. YOU MAY NOT FIT IN WHEREVER YOU END UP CELEBRATING, BUT MAYBE THAT IS WHY HE LOVES YOU. SHED THAT INSECURITY AND BE THE YOU THAT HE HAS COME TO APPRECIATE. BE GENUINE AND BE AUTHENTIC. MANNERS AND POLITENESS WILL EXCUSE YOUR AWKWARDNESS, I SWEAR!!! GO FOR IT AND ACCEPT THE INVITE🎉🎁🎄🎅 GIVE YOUR GIFT WITH YOUR HEAD HELD HIGH. SHOW YOUR APPRECIATION AND IT WILL COME BACK TO YOU MANY TIMES OVER. GOOD LUCK WITH YOUR HOLIDAY SEASON. I WISH THE BEST FOR YOU ALL!!❤💕❤💕 LOVE, NICOLE.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/k9zir3/thats_it_im_christmas_gift_shaming_myself/",
    "score": 153,
    "upvote_ratio": 0.96,
    "created_utc": 1607544514.0,
    "num_comments": 34,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Damn onions. Why did I read this as I was prepping dinner?\n\n&#x200B;\n\n&#x200B;\n\nAlso, I want every SB who is asking about \"what should I get my SD for a gift\" to read this story. It is not about spending a lot of money. It's about showing him you listen, pay attention to him and sincerely care about him.",
            "author": "BinghamtonSD",
            "id": "gf7rt21",
            "parent_id": "t3_k9zir3",
            "score": 34,
            "created_utc": 1607552384.0,
            "replies": [
                {
                    "body": "Thank you for some input from the other side❤💕😍 We've gotta tune in and truly listen more. The clues and ques are there if you are paying enough attention..so true!! Damned Onions 😉",
                    "author": "Empty-Friend-1086",
                    "id": "gf7s9mp",
                    "parent_id": "t1_gf7rt21",
                    "score": 8,
                    "created_utc": 1607552617.0,
                    "replies": []
                },
                {
                    "body": "I’m not an SB or SD, I just lurk out of fascination. But the best gift I’ve gotten for my partner this year was way cheaper than it should’ve been. It was CAMEO appearance by the girl who played Nellie Olsen on Little House on the the Prairie. (CAMEO for those who don’t know is an app where you can pay celebrities/ reality tv stars/ politicians) to read a message, give a note, whatever. The costs vary depending on their demand. She gave the most amazing personalized message to him, put on her Nellie Olsen wig, did the voice. It was awesome. \n\nWe had a small gathering of friends outside for his birthday, and I cast the video she sent onto oir outdoor TV. He burst into tears, and posted it online to hundreds of people saying what an amazing gift that was. I never told him how much it actually cost, I would’ve paid way more for the joy he got out of it. I tipped her well afterwards.  So it’s SO MUCH MORE than money, gift giving is a recognition that you understand this persons soul. \n\nNot to make this a promo for Cameo for anything but damn that worked out well. Covid friendly too.",
                    "author": "Bryancreates",
                    "id": "gf9b656",
                    "parent_id": "t1_gf7rt21",
                    "score": 3,
                    "created_utc": 1607586566.0,
                    "replies": [
                        {
                            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                            "author": "AutoModerator",
                            "id": "gf9b668",
                            "parent_id": "t1_gf9b656",
                            "score": 1,
                            "created_utc": 1607586566.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This is so true.  Also a card with a note about how the relationship has benefitted you in non financial ways ( or if you know it is in private) how his INVESTMENT in your dreams is changing your future.",
                    "author": "pinotandsugar",
                    "id": "gf8sjot",
                    "parent_id": "t1_gf7rt21",
                    "score": 5,
                    "created_utc": 1607572537.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love this story! Last year I gave my SD a chalkboard that I had decorated with “Merry Christmas” in welsh. Sadly our arrangement ended when covid shut Chicago down, but every so often he sends me a pic of it hanging in his office in SC. Reminds me of how deeply we care for each other!",
            "author": "gingerlyyours05",
            "id": "gf84iu6",
            "parent_id": "t3_k9zir3",
            "score": 9,
            "created_utc": 1607559055.0,
            "replies": [
                {
                    "body": "I love this!❤💕",
                    "author": "Empty-Friend-1086",
                    "id": "gf870v4",
                    "parent_id": "t1_gf84iu6",
                    "score": 1,
                    "created_utc": 1607560386.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This was cute and low key needed. Thank you for the story",
            "author": null,
            "id": "gf7io2q",
            "parent_id": "t3_k9zir3",
            "score": 15,
            "created_utc": 1607547930.0,
            "replies": []
        },
        {
            "body": "Aww that is so sweet. I LOVE giving gifts, and all year I listen and ponder until I find the perfect gift. The thoughtful gifts are priceless.",
            "author": null,
            "id": "gf7jdl1",
            "parent_id": "t3_k9zir3",
            "score": 5,
            "created_utc": 1607548265.0,
            "replies": []
        },
        {
            "body": "That’s a very sweet story 🎄",
            "author": null,
            "id": "gf7hw6x",
            "parent_id": "t3_k9zir3",
            "score": 5,
            "created_utc": 1607547572.0,
            "replies": []
        },
        {
            "body": "damm dust.\n\nAnd I agree completely.  Not to get too religious but remember, we are celebrating a season in which a poor son from a poor family in a far off province of the Roman empire reminded the world to love each other, that it is the spirit in your heart which matters far more than franscense, mire and gold.",
            "author": null,
            "id": "gfakh7l",
            "parent_id": "t3_k9zir3",
            "score": 3,
            "created_utc": 1607616638.0,
            "replies": []
        },
        {
            "body": "You nailed it. All most of us need/want is to be appreciated and paid attention to (especially us married guys). Very often, we are the providers in the family and we sometimes suffer from being taken for granted. I know my wife, children and dogs (especially and unconditionally) love me, but I do often feel like the low person on the totem pole. Your seemingly small gesture was HUGE. It has nothing to  do with $ and everything to do with care, effort and attention.",
            "author": "Teejaynj",
            "id": "gfapy4c",
            "parent_id": "t3_k9zir3",
            "score": 3,
            "created_utc": 1607618590.0,
            "replies": []
        },
        {
            "body": "Holy cow, great story, but hit us with some paragraphs next time please.",
            "author": "mraspencer",
            "id": "gf7j8iq",
            "parent_id": "t3_k9zir3",
            "score": 8,
            "created_utc": 1607548199.0,
            "replies": [
                {
                    "body": "I hear you!! I was typing on the website then switched to the app...looks like the formatting did not follow over from my copy/paste, but thank you. Maybe I'll try to edit it when I have a minute :)",
                    "author": "Empty-Friend-1086",
                    "id": "gf7ke61",
                    "parent_id": "t1_gf7j8iq",
                    "score": 8,
                    "created_utc": 1607548739.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wonderful story and good for you!\n\nBut this is why I hate Christmas.... the pressure to give presents.  So much time going into figuring out what to get and worrying if what you got is appropriate/enough/ etc.  I tell my family and SB NOT to get me anything.  The only gift I really want is time.  Time to spend with the ones I love.",
            "author": "frpaulstone",
            "id": "gfaw3yj",
            "parent_id": "t3_k9zir3",
            "score": 2,
            "created_utc": 1607621466.0,
            "replies": []
        },
        {
            "body": "I love love love this!!! I’m a giver, always have been. I’m the type that will find the most sentimental thing to gift & barely wait til the right day (Christmas, bday, etc) to give it to my person, but then I always feel like it’s never enough. Your story is so sweet & touching 🥰",
            "author": "5ft1ofSugarBabyfun",
            "id": "gfcip1p",
            "parent_id": "t3_k9zir3",
            "score": 2,
            "created_utc": 1607652049.0,
            "replies": []
        },
        {
            "body": "I mentioned this on another post about gifts, but I got my SD some nice hot pepper extracts. He likes *very* spicy food. Like will order 5/5 spice at an Indian restaurant without batting an eye and *still* add hot sauce. I love to cook and I've cooked for him before. He'd always eat a few bites, but ultimately would douse it in sriracha before he finished it and it killed me a little inside. Now he just needs to add a couple drops of the Carolina Reaper extract whenever I cook 😁",
            "author": "missthingmariah",
            "id": "gf7phyg",
            "parent_id": "t3_k9zir3",
            "score": 5,
            "created_utc": 1607551222.0,
            "replies": [
                {
                    "body": "So awesome! Truly listening and hearing somebody is such a valuable trait to possess and just cannot be over stated! Im sure your gesture spiced things up in more than one way!!😁 sometimes its the little things ❤ im sure he is soooo grateful and now you dont have to feel that tiny moment of defeat. Yes!! 👏",
                    "author": "Empty-Friend-1086",
                    "id": "gf7rua5",
                    "parent_id": "t1_gf7phyg",
                    "score": 4,
                    "created_utc": 1607552401.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gf7ohw1",
            "parent_id": "t3_k9zir3",
            "score": 1,
            "created_utc": 1607550736.0,
            "replies": [
                {
                    "body": "No...that thought is lying...you got this!! I dont think theres truly a bad gift to be getting ever :) If all else fails, be creative with an inside joke that belongs to just the 2 of you. A handmade card with your own thoughts can go a really long way. Im sure you'll do great!!",
                    "author": "Empty-Friend-1086",
                    "id": "gf88onm",
                    "parent_id": "t1_gf7ohw1",
                    "score": 1,
                    "created_utc": 1607561303.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Okay, I’m not going to lie—this made me cry.\n\nI relate to you, or to the you from a few years ago, on a molecular level. I feel all of the things you were feeling. This year has been so incredibly hard, and I won’t be celebrating Christmas anywhere but from my own couch because I’m immunocompromised and can’t go out right now. I’ve lost almost everything, due to the pandemic. I feel LOW. But, I’ve always been able to hold it together and I’ve had amazing experiences like yours in the past. I know I will, again. So will you. \n\nGifts from the heart are so beautiful. They’re worth much more than the expensive, designer presents that were being exchanged all around you that night. This is a beautiful message written by a beautiful person. Hang in there, babe!!! You’ll have an amazing life. It’s coming.",
            "author": "FoxyFreckles1989",
            "id": "gf9drsg",
            "parent_id": "t3_k9zir3",
            "score": 0,
            "created_utc": 1607589041.0,
            "replies": [
                {
                    "body": "Okay then I wont lie either...I also cried writing it 😂 Thanks so much for saying all that. Did we just become best friends? Lol. Im sorry things are looking down this year for you as well! This too shall pass, I promise. Next year we will both look back and laugh.  Im also just chilling out on the couch, so if you need to vent or chit chat, im here!💓💕",
                    "author": "Empty-Friend-1086",
                    "id": "gfahchk",
                    "parent_id": "t1_gf9drsg",
                    "score": 3,
                    "created_utc": 1607615536.0,
                    "replies": [
                        {
                            "body": "Do you want to go do karate in the garage? \n\n(DM me any time!)",
                            "author": "FoxyFreckles1989",
                            "id": "gfbgm92",
                            "parent_id": "t1_gfahchk",
                            "score": 2,
                            "created_utc": 1607631295.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is really sweet, made me smile :\\]",
            "author": "seeyuspacecowboy",
            "id": "gf7ryal",
            "parent_id": "t3_k9zir3",
            "score": 1,
            "created_utc": 1607552458.0,
            "replies": [
                {
                    "body": "Good!! And thank you 💕❤",
                    "author": "Empty-Friend-1086",
                    "id": "gf7skdg",
                    "parent_id": "t1_gf7ryal",
                    "score": 1,
                    "created_utc": 1607552767.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for this!!!!",
            "author": "w4termelonsug4r",
            "id": "gf7sj9m",
            "parent_id": "t3_k9zir3",
            "score": 1,
            "created_utc": 1607552752.0,
            "replies": [
                {
                    "body": "You're welcome ❤💕 I knew it couldn't just be me who experienced this feeling!",
                    "author": "Empty-Friend-1086",
                    "id": "gf7sp52",
                    "parent_id": "t1_gf7sj9m",
                    "score": 1,
                    "created_utc": 1607552835.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Beautiful writing and story, Nicole. Thank you for sharing. I hope your personal situation has improved since this SR.\n\nMerry Christmas and happy holidays. 🎁🎄",
            "author": "SD-Casual-Fla",
            "id": "gf9w53f",
            "parent_id": "t3_k9zir3",
            "score": 1,
            "created_utc": 1607606680.0,
            "replies": []
        },
        {
            "body": "I love this so so much! There was so much thought and effort in your gift giving and he was a lucky guy to have received it. I'm so glad he appreciated your effort and you were able to let down your pride enough to allow him to tell you his appreciation! Loved it! 🖤🖤🖤",
            "author": "slbprincess",
            "id": "gf9xwlb",
            "parent_id": "t3_k9zir3",
            "score": 1,
            "created_utc": 1607607549.0,
            "replies": [
                {
                    "body": "💓💕❤Thank you!!",
                    "author": "Empty-Friend-1086",
                    "id": "gfagcz8",
                    "parent_id": "t1_gf9xwlb",
                    "score": 2,
                    "created_utc": 1607615190.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Cute story. But your SD,as well meaning as he might have been, set you up for that awkward experience. You didn't belong there,not because you weren't \"good\" enough, but because of your private relationship-perhaps inappropriate for an intimate family gathering unless he had been bringing you around the family before this. \n\nYou DID kill it and he was lucky to have you. The point is, it is the thought that counts.",
            "author": "GSSD",
            "id": "gfa41an",
            "parent_id": "t3_k9zir3",
            "score": 1,
            "created_utc": 1607610521.0,
            "replies": [
                {
                    "body": "Thank you so much for saying that 💕☺ I had met the mother and brother briefly before Christmas, but it was the 15 others that I was not prepared for. I saw sisters- their husbands- and nieces/nephews who were pretty close to my age/generation. They definitely were aware of what was going on, tho he seemed totally oblivious to it somehow. In hindsight, I believe he was trying to push me into something vanilla before the timing was right and that was his misguided attempt at it. He tried to force the circle shape thru the square hole. Painful, but it made it thru 😉",
                    "author": "Empty-Friend-1086",
                    "id": "gfad7j2",
                    "parent_id": "t1_gfa41an",
                    "score": 2,
                    "created_utc": 1607614070.0,
                    "replies": [
                        {
                            "body": "Frankly, I don't even want to go to my own extended family reunions,much less bring a new partner into the mix.He sounds very socially inept.",
                            "author": "GSSD",
                            "id": "gfaffdk",
                            "parent_id": "t1_gfad7j2",
                            "score": 3,
                            "created_utc": 1607614858.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Stop chopping the damn onions dammit!!\n\nAnd ffs, you went to every single thrift store in your area to find the ties. There can't be anything more valuable than someone looking in every store to find you something that you like. I hope you're not holding those feelings of shame anymore.",
            "author": "InnocentSweetTooth",
            "id": "gfd2xem",
            "parent_id": "t3_k9zir3",
            "score": 1,
            "created_utc": 1607663312.0,
            "replies": []
        },
        {
            "body": "Thank you for some input from the other side❤💕😍 We've gotta tune in and truly listen more. The clues and ques are there if you are paying enough attention..so true!! Damned Onions 😉",
            "author": "Empty-Friend-1086",
            "id": "gf7s9mp",
            "parent_id": "t1_gf7rt21",
            "score": 8,
            "created_utc": 1607552617.0,
            "replies": []
        },
        {
            "body": "I’m not an SB or SD, I just lurk out of fascination. But the best gift I’ve gotten for my partner this year was way cheaper than it should’ve been. It was CAMEO appearance by the girl who played Nellie Olsen on Little House on the the Prairie. (CAMEO for those who don’t know is an app where you can pay celebrities/ reality tv stars/ politicians) to read a message, give a note, whatever. The costs vary depending on their demand. She gave the most amazing personalized message to him, put on her Nellie Olsen wig, did the voice. It was awesome. \n\nWe had a small gathering of friends outside for his birthday, and I cast the video she sent onto oir outdoor TV. He burst into tears, and posted it online to hundreds of people saying what an amazing gift that was. I never told him how much it actually cost, I would’ve paid way more for the joy he got out of it. I tipped her well afterwards.  So it’s SO MUCH MORE than money, gift giving is a recognition that you understand this persons soul. \n\nNot to make this a promo for Cameo for anything but damn that worked out well. Covid friendly too.",
            "author": "Bryancreates",
            "id": "gf9b656",
            "parent_id": "t1_gf7rt21",
            "score": 3,
            "created_utc": 1607586566.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "gf9b668",
                    "parent_id": "t1_gf9b656",
                    "score": 1,
                    "created_utc": 1607586566.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is so true.  Also a card with a note about how the relationship has benefitted you in non financial ways ( or if you know it is in private) how his INVESTMENT in your dreams is changing your future.",
            "author": "pinotandsugar",
            "id": "gf8sjot",
            "parent_id": "t1_gf7rt21",
            "score": 5,
            "created_utc": 1607572537.0,
            "replies": []
        },
        {
            "body": "I love this!❤💕",
            "author": "Empty-Friend-1086",
            "id": "gf870v4",
            "parent_id": "t1_gf84iu6",
            "score": 1,
            "created_utc": 1607560386.0,
            "replies": []
        },
        {
            "body": "I hear you!! I was typing on the website then switched to the app...looks like the formatting did not follow over from my copy/paste, but thank you. Maybe I'll try to edit it when I have a minute :)",
            "author": "Empty-Friend-1086",
            "id": "gf7ke61",
            "parent_id": "t1_gf7j8iq",
            "score": 8,
            "created_utc": 1607548739.0,
            "replies": []
        },
        {
            "body": "So awesome! Truly listening and hearing somebody is such a valuable trait to possess and just cannot be over stated! Im sure your gesture spiced things up in more than one way!!😁 sometimes its the little things ❤ im sure he is soooo grateful and now you dont have to feel that tiny moment of defeat. Yes!! 👏",
            "author": "Empty-Friend-1086",
            "id": "gf7rua5",
            "parent_id": "t1_gf7phyg",
            "score": 4,
            "created_utc": 1607552401.0,
            "replies": []
        },
        {
            "body": "No...that thought is lying...you got this!! I dont think theres truly a bad gift to be getting ever :) If all else fails, be creative with an inside joke that belongs to just the 2 of you. A handmade card with your own thoughts can go a really long way. Im sure you'll do great!!",
            "author": "Empty-Friend-1086",
            "id": "gf88onm",
            "parent_id": "t1_gf7ohw1",
            "score": 1,
            "created_utc": 1607561303.0,
            "replies": []
        },
        {
            "body": "Okay then I wont lie either...I also cried writing it 😂 Thanks so much for saying all that. Did we just become best friends? Lol. Im sorry things are looking down this year for you as well! This too shall pass, I promise. Next year we will both look back and laugh.  Im also just chilling out on the couch, so if you need to vent or chit chat, im here!💓💕",
            "author": "Empty-Friend-1086",
            "id": "gfahchk",
            "parent_id": "t1_gf9drsg",
            "score": 3,
            "created_utc": 1607615536.0,
            "replies": [
                {
                    "body": "Do you want to go do karate in the garage? \n\n(DM me any time!)",
                    "author": "FoxyFreckles1989",
                    "id": "gfbgm92",
                    "parent_id": "t1_gfahchk",
                    "score": 2,
                    "created_utc": 1607631295.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good!! And thank you 💕❤",
            "author": "Empty-Friend-1086",
            "id": "gf7skdg",
            "parent_id": "t1_gf7ryal",
            "score": 1,
            "created_utc": 1607552767.0,
            "replies": []
        },
        {
            "body": "You're welcome ❤💕 I knew it couldn't just be me who experienced this feeling!",
            "author": "Empty-Friend-1086",
            "id": "gf7sp52",
            "parent_id": "t1_gf7sj9m",
            "score": 1,
            "created_utc": 1607552835.0,
            "replies": []
        },
        {
            "body": "💓💕❤Thank you!!",
            "author": "Empty-Friend-1086",
            "id": "gfagcz8",
            "parent_id": "t1_gf9xwlb",
            "score": 2,
            "created_utc": 1607615190.0,
            "replies": []
        },
        {
            "body": "Thank you so much for saying that 💕☺ I had met the mother and brother briefly before Christmas, but it was the 15 others that I was not prepared for. I saw sisters- their husbands- and nieces/nephews who were pretty close to my age/generation. They definitely were aware of what was going on, tho he seemed totally oblivious to it somehow. In hindsight, I believe he was trying to push me into something vanilla before the timing was right and that was his misguided attempt at it. He tried to force the circle shape thru the square hole. Painful, but it made it thru 😉",
            "author": "Empty-Friend-1086",
            "id": "gfad7j2",
            "parent_id": "t1_gfa41an",
            "score": 2,
            "created_utc": 1607614070.0,
            "replies": [
                {
                    "body": "Frankly, I don't even want to go to my own extended family reunions,much less bring a new partner into the mix.He sounds very socially inept.",
                    "author": "GSSD",
                    "id": "gfaffdk",
                    "parent_id": "t1_gfad7j2",
                    "score": 3,
                    "created_utc": 1607614858.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "gf9b668",
            "parent_id": "t1_gf9b656",
            "score": 1,
            "created_utc": 1607586566.0,
            "replies": []
        },
        {
            "body": "Do you want to go do karate in the garage? \n\n(DM me any time!)",
            "author": "FoxyFreckles1989",
            "id": "gfbgm92",
            "parent_id": "t1_gfahchk",
            "score": 2,
            "created_utc": 1607631295.0,
            "replies": []
        },
        {
            "body": "Frankly, I don't even want to go to my own extended family reunions,much less bring a new partner into the mix.He sounds very socially inept.",
            "author": "GSSD",
            "id": "gfaffdk",
            "parent_id": "t1_gfad7j2",
            "score": 3,
            "created_utc": 1607614858.0,
            "replies": []
        }
    ]
}