{
    "title": "HaHa is a top running man member",
    "post_id": "gw871q",
    "post_url": "https://www.reddit.com/r/runningman/comments/gw871q/haha_is_a_top_running_man_member/",
    "author": "keiibro",
    "body": "I'm from outside of South Korea so I don't know where HaHa is reserved in conversations concerning Rm, but i seriously think he is an important member alongside Jae Suk and Kwang Soo. In most comment sections on rm episodes, i dont see much love for HaHa but he creates a good atmosphere, is able to shift the energy in the scenes and always has a good remark or joke up his sleeve. In early RM, he basically created all the character types from playboy to betrayer which have been later taken on by Kwang Soo and So Min. \n\n I feel that because HaHa got married, he had to reshape his character and thus single members were given more light after adopting roles that HaHa created. I personally wouldn't put Seok Jin or So Min above HaHa but I see a lot of people do. Personally I think So Min tries too hard to be funny and theres nothing wrong with effort but to be funny we like to see it flow naturally and effortless and I believe HaHa does exactly that. \n\nHe's witty, funny, and physically good at games too despite members downplaying his ability bc hes small. And even guests don't seem to choose HaHa as a partner/group member like they do with the others and its just saddening bc HaHa is a member a guest should vie for. \n\nAlso, Rm rarely assemble Haha, Kwang Soo and Jae Seok in a group- i believe this would be the funniest combination bc of the betraying and their wits. \n\nIm just wondering if there are other avid watchers of rm who see the importance of HaHa on the show.",
    "url": "https://www.reddit.com/r/runningman/comments/gw871q/haha_is_a_top_running_man_member/",
    "score": 294,
    "upvote_ratio": 0.97,
    "created_utc": 1591236994.0,
    "num_comments": 52,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Agreed Haha is one of my favourite members because he is a mood maker, is super witty and funny, is sociable and genuinely a team player. He knows his strengths and doesn't necessarily go overboard to steal the limelight but is always willing to play support. \n\nI also love that he is the best sport and is able to take a joke and be least offended and goes along with things well. \n\nHe's a bit like Lee Soo Geun to me. Hilarious but in a witty way mainly. \n\nAlso to add, he is a great game changer in episodes where there is spies, role playing or betrayal. He is never as overtly suspicious as JSJ or LSK. And he doesn't play as nice as KJK so he's like a YJS but more cunning. I love it.",
            "author": "zaichii",
            "id": "fstgirf",
            "parent_id": "t3_gw871q",
            "score": 118,
            "created_utc": 1591237910.0,
            "replies": [
                {
                    "body": "THIS 100%! Haha and Lee Soo Geun make their shows so much more entertaining with their wit and humor!",
                    "author": "MinaBigBalls",
                    "id": "fstnrdq",
                    "parent_id": "t1_fstgirf",
                    "score": 32,
                    "created_utc": 1591242240.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed. In many of the earlier episodes, they would partner guests who were clearly more reserved/nervous/awkward with Haha bc he could adapt to their personality and put them at ease by being either overly silly or obnoxious (to break the ice).\n\nThis is also apparent in how close he is with many of the members. (Ji Hyo, for example, would constantly pick Haha as her partner after Gary left, and I can only assume this is bc she is comfortable with him. Even when Gary was here, and she needed to pick a 3rd member on her team, it was Haha. Gary also mentioned how he looked up to Haha when he started RM as he was new to variety shows)\n\nIn short, Haha's the man.",
            "author": "SuperSunnyMan",
            "id": "fstjrvf",
            "parent_id": "t3_gw871q",
            "score": 74,
            "created_utc": 1591239817.0,
            "replies": [
                {
                    "body": "in short eh? hahaha i don’t know if that was intentional but it was pretty funny!",
                    "author": "rapture64",
                    "id": "fstmktg",
                    "parent_id": "t1_fstjrvf",
                    "score": 37,
                    "created_utc": 1591241510.0,
                    "replies": []
                },
                {
                    "body": "I remember way back in the beginning when SJH and HaHa were paired together for the first time and SJH felt awkward about it bc she didn't know him well yet.. But in the end they had so much fun together. I think about that every time we see how comfortable SJH is with him now.",
                    "author": "tea_time96",
                    "id": "fstwje2",
                    "parent_id": "t1_fstjrvf",
                    "score": 13,
                    "created_utc": 1591248167.0,
                    "replies": [
                        {
                            "body": "Sorry do you know what episode?",
                            "author": "idkwiamanymore",
                            "id": "fsu6je6",
                            "parent_id": "t1_fstwje2",
                            "score": 2,
                            "created_utc": 1591256307.0,
                            "replies": [
                                {
                                    "body": "I think its ep 43",
                                    "author": "babymin",
                                    "id": "fsufz8s",
                                    "parent_id": "t1_fsu6je6",
                                    "score": 5,
                                    "created_utc": 1591265202.0,
                                    "replies": [
                                        {
                                            "body": "Thank you!",
                                            "author": "idkwiamanymore",
                                            "id": "fsuo2en",
                                            "parent_id": "t1_fsufz8s",
                                            "score": 2,
                                            "created_utc": 1591272011.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Yeah that's the one",
                                            "author": "tea_time96",
                                            "id": "fsv1p0h",
                                            "parent_id": "t1_fsufz8s",
                                            "score": 2,
                                            "created_utc": 1591280238.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "This! I love to see how she always chooses him as her partner before Spart-ace couple became a thing.",
                            "author": "keiibro",
                            "id": "fsx330n",
                            "parent_id": "t1_fstwje2",
                            "score": 0,
                            "created_utc": 1591315473.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Regarding his physical strength, there was an episode when Byul guested wherein Haha showed how strong he really is. I believe his strength is downplayed as his RM character has been more catered to the comedy rather than the physicality of the show.\n\nI think he really shines when it comes to spy episodes, as he can sway the opinion of other members when it comes time to catch the spy and/or elude detection (I'm really impressed with Haha on the recent ep when Jo Jung Suk guested to promote the film, Exit)\n\nHaha is so witty and versatile, and I think both Somin and Sechan has a lot to learn from him as their senior.",
            "author": "inosuke_unmasked",
            "id": "fstr8qj",
            "parent_id": "t3_gw871q",
            "score": 44,
            "created_utc": 1591244476.0,
            "replies": [
                {
                    "body": "Just watched episode 169 where HaHa had to use some strength in order not to embarass a civilian guest. Really showed how often he likely downplays his actual strength.",
                    "author": "Sig-martin",
                    "id": "fsv4pjw",
                    "parent_id": "t1_fstr8qj",
                    "score": 4,
                    "created_utc": 1591281777.0,
                    "replies": [
                        {
                            "body": "Ah. But let's not forget the episode when his wife was a guest of I recall correctly. He really didn't hold back that episode at all.",
                            "author": "CaissaIRL",
                            "id": "fsvn252",
                            "parent_id": "t1_fsv4pjw",
                            "score": 5,
                            "created_utc": 1591290479.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "i really love it when Haha's assigned to a special role. it cracks me up when he's roleplaying it.",
            "author": "Boiling-Point",
            "id": "fstnm8e",
            "parent_id": "t3_gw871q",
            "score": 35,
            "created_utc": 1591242150.0,
            "replies": [
                {
                    "body": "Omg yes. He is so extra when it comes to role playing.",
                    "author": "zaichii",
                    "id": "fstv7jp",
                    "parent_id": "t1_fstnm8e",
                    "score": 13,
                    "created_utc": 1591247201.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't know if this is something already well appreciated, but if you pay attention to Haha in the background a lot of the time he is silently observing things and then at the right opportunity he sets up a gag not for himself but for someone else to pay off and get a laugh. He could easily setup the gag for himself but he sets it up for others to receive screen time. Not only generous but shows great comedic awareness to be able to figure stuff out like that on the spot.",
            "author": "bezerk55",
            "id": "fstttcr",
            "parent_id": "t3_gw871q",
            "score": 36,
            "created_utc": 1591246216.0,
            "replies": []
        },
        {
            "body": "Haha always cracks me up. Consistently funny, knows when to grab the spotlight and when to take a step back and let others shine. And in games with deception he gets overshadowed some by others but he is very good in his own right.",
            "author": "jonnyd86",
            "id": "fstmjrp",
            "parent_id": "t3_gw871q",
            "score": 30,
            "created_utc": 1591241492.0,
            "replies": []
        },
        {
            "body": "I adore Haha. Sometimes I feel like he carries the show. All the inside jokes and funniest moments are usually instigated by him. I especially love his teasing with his snicker after pushing somebody's buttons.",
            "author": "kero-kero-keroppi",
            "id": "fstt476",
            "parent_id": "t3_gw871q",
            "score": 23,
            "created_utc": 1591245736.0,
            "replies": []
        },
        {
            "body": "Since this is an appreciation thread for HaHa, I would like to promote [HaHa's youtube channel](https://www.youtube.com/channel/UCK3p1wDoQYOkxi414EvBlLw) here. As an activity he started recently, he worked pretty hard to promote it on several live streams.\n\nThe core content on the channel currently is a web-comedy called Daddy Free. It is about people with super powers and HaHa plays a character in it. It's similiar to how HaHa having superpowers on Runningman, but with a background story along with it. It has 13 episodes as of now and full English subtitles. Besides the actual comedy, there are also a few making-films of it. He has also invited several Korean TV personalities to cameo in it, such as Noh Sa Yeon, Apink's Chorong and Shim Hyung-rae.",
            "author": "retaki",
            "id": "fsusjo9",
            "parent_id": "t3_gw871q",
            "score": 15,
            "created_utc": 1591275097.0,
            "replies": []
        },
        {
            "body": "He’s undeniably an essential member and especially in the earlier eps you realise how hard he worked to brighten the atmosphere, make guests comfortable and give members an out of having a character.\n\nAs for being strong, he is, he isn’t weak but when we’re comparing people to Jongkook or Kwangsoo, who are stronger than average, it comes across as though he’s not as strong. Also HaHa and Kwangsoo never use full strength, it doesn’t go with their characters.",
            "author": "real_highlight_reel",
            "id": "fstxk2a",
            "parent_id": "t3_gw871q",
            "score": 13,
            "created_utc": 1591248922.0,
            "replies": []
        },
        {
            "body": "PD Kim Taeho of Infinity Challenge once said that HaHa is a 'middleman' in his show. I guess that's true. He could help those who underperform in a show, and also pulls back those who overdo their roles even Jaeseok. And he also have good chemistry with everyone!",
            "author": "daneshikar",
            "id": "fsuazay",
            "parent_id": "t3_gw871q",
            "score": 11,
            "created_utc": 1591260408.0,
            "replies": []
        },
        {
            "body": "I love Haha’s personality and wits\nIt’s sad that people always hate on him for no reason just because he’s doesn’t gets the penalties.To me he’s comedy is after YJS and LKS",
            "author": "y978_2",
            "id": "fstsakr",
            "parent_id": "t3_gw871q",
            "score": 16,
            "created_utc": 1591245177.0,
            "replies": []
        },
        {
            "body": "Agree with you and what everyone else said. Also just want to add that Haha is scary smart when it comes to figuring out puzzles.",
            "author": "lilpuzz",
            "id": "fstx2yh",
            "parent_id": "t3_gw871q",
            "score": 7,
            "created_utc": 1591248566.0,
            "replies": []
        },
        {
            "body": "HaHa is one of favourite members. If I was a guest and it was a couples race. I'd choose HaHa or YJS because you are gauranteed to have so much fun. You will always have the screen time because they know how to involve you.",
            "author": "Dunkiez",
            "id": "fsuffjk",
            "parent_id": "t3_gw871q",
            "score": 7,
            "created_utc": 1591264693.0,
            "replies": []
        },
        {
            "body": "I completely agree. HaHa is a very integral and important part of the show. A lot of points were already made above about how he really is a top member. The PD who said that he’s sort of like a middleman can’t really be seen on-screen, but is really important.\n\nI remember in one of the episode where they could choose to be the center, he and Gary chose to be on the side as they almost always do says a lot about him. He’s one of the people the PD’s can count on whenever a particular bit doesn’t work that well or a guest isn’t particularly standing out because of normally being reserved or what have you. Again, as said above, he knows how to adapt to people and act overly silly or create bits to get the guest to stand out more = more screentime which is the main reason they’re guesting in the first place. I remember when Seo Jang Hoon first guested in RM when i guess he was still starting out in variety and being the grumpy goose that he was, HaHa overly annoyed him for laughs.\n\nI also think it helps a lot that he is very, very sociable and outgoing in real life, with him having real, personal friendships with a lot of celebrities off-screen (to use Jang Hoon again as an example, watch the episode of Knowing Brothers where he guested. It was really a treat to see him annoying the piss out of Jang Hoon).\n\nBeing in show business for a long time, he knows what his role is especially next to YJS. He compliments him well and with their combined know how, they know how to push the show forward for entertainments sake. HaHa really is one of the core members of the show especially now that he’s in the middle of the group age-wise to unify the members (not that they’re not close, but you get what I mean).",
            "author": "prunsPTRPMD",
            "id": "fsumguy",
            "parent_id": "t3_gw871q",
            "score": 5,
            "created_utc": 1591270806.0,
            "replies": []
        },
        {
            "body": "Haha is definitely one of the funniest comedians imo! In recent years I noticed that he’s the one who instigated a lot of funny/epic moments which he would let the other members catch on and I began to appreciate him a lot more. \nSomehow he just seems to be the cast member who’ll not be in the spotlight — although he gets a fair amount of screentime and important roles, I think that I’m less likely to associate him with a certain “character” in the show, as compared to Jaesuk or Kwangsoo. I can’t even remember if there’s any episode that was dedicated to him. Nonetheless I cannot imagine RM without him. I think he’s the wittiest member on the show.",
            "author": "iwantaspudgun",
            "id": "fsut2o4",
            "parent_id": "t3_gw871q",
            "score": 7,
            "created_utc": 1591275425.0,
            "replies": [
                {
                    "body": "These are my exact thoughts! HaHa really be doing the most for others. But you're right, on the top off my head i cant think of an episode dedicated to HaHa but I wish  he would have one bc I think every other member except him has had more than one, and the show has been on for 10 years.",
                    "author": "keiibro",
                    "id": "fsyust0",
                    "parent_id": "t1_fsut2o4",
                    "score": 1,
                    "created_utc": 1591361598.0,
                    "replies": [
                        {
                            "body": "He had that episode in Member's week where he had to choose who to save between two members because his character flaw was his indecision. It was a good one.",
                            "author": "springaugust",
                            "id": "ftkzdi2",
                            "parent_id": "t1_fsyust0",
                            "score": 1,
                            "created_utc": 1591795021.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Haha is one of my favourite members as well. He's super witty and I feel like he's not appreciated enough for it",
            "author": "justahalfling",
            "id": "fsttlqo",
            "parent_id": "t3_gw871q",
            "score": 3,
            "created_utc": 1591246068.0,
            "replies": []
        },
        {
            "body": "Seeing HaHa in infinity challenge(무한도전) i always knew the importance of him. I believe in RM he just try to be more reserve so others can shine better. He was so active in episodes before his marriage but that was because of his player character. After Marriage and Kids, i believe he is more conserved because of his health. Although i love his short funny dialogues all the time. His is dongseng of Yoo jaeseok . Without him there was no Infinity challenge and RM too",
            "author": "bugsbunny3110",
            "id": "fsv6ugh",
            "parent_id": "t3_gw871q",
            "score": 4,
            "created_utc": 1591282821.0,
            "replies": []
        },
        {
            "body": "HaHa is at his best when he become a spy. IMO nobody  was better than him to fill that role. Someone mentioned in this subreddit that there are 2 types of people in RM, someone who creates the contents and someone who responds to it and HH belong to both.",
            "author": "honechan",
            "id": "fsxr0zx",
            "parent_id": "t3_gw871q",
            "score": 3,
            "created_utc": 1591329425.0,
            "replies": []
        },
        {
            "body": "I've to admit. In early RM days, Haha antics were the stuff I anticipated in every episode. He was just hilarious and so mischievous. Still remember the episode where he trampled men's heartthrob like choi jiwoo and han hyo joo, got nicknamed as bad guy haroro. Now he rarely shows his antics but it's understandable.",
            "author": "ZrlSyM",
            "id": "fstt1ia",
            "parent_id": "t3_gw871q",
            "score": 10,
            "created_utc": 1591245686.0,
            "replies": []
        },
        {
            "body": "Are you going to downplay other casts now or what ? Surely seems like the direction you're inciting",
            "author": "klnic3ajer",
            "id": "ft4yr2h",
            "parent_id": "t3_gw871q",
            "score": 3,
            "created_utc": 1591458317.0,
            "replies": [
                {
                    "body": "by other casts do you mean so min? i only briefly mentioned how so min has a forced humour and now you're jumping to this conclusion. my point was i read many other threads with rankings of the members and HaHa was always ranked 6th-8th, and to validate my point in saying he was a top rm member, i merely stated how good he is in comparison to members like so min who ranked higher. if you wanna talk downplaying other cast members we can, but that's entirely different subject. this thread is for HaHa.",
                    "author": "keiibro",
                    "id": "ft7daq5",
                    "parent_id": "t1_ft4yr2h",
                    "score": 1,
                    "created_utc": 1591483672.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haha and Gary <3",
            "author": "VlCtaro",
            "id": "fsvt796",
            "parent_id": "t3_gw871q",
            "score": 2,
            "created_utc": 1591293295.0,
            "replies": []
        },
        {
            "body": "haha is great\n\nthe only thing he could be better at is being MC\n\nhes unbelievably witty, best spy, and content creator",
            "author": "walkingfann",
            "id": "ft9xyvn",
            "parent_id": "t3_gw871q",
            "score": 2,
            "created_utc": 1591544122.0,
            "replies": [
                {
                    "body": "i agree. If he could master the skill of mceeing, he'd be a variety monster like Jae Seok.",
                    "author": "keiibro",
                    "id": "ftc72xi",
                    "parent_id": "t1_ft9xyvn",
                    "score": 1,
                    "created_utc": 1591590692.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Here's what i think: Haha is the second to Jaeseok when it comes to improvisation, and he's the second to Jaeseok when it comes to wit, being second to Jaeseok is never a bad thing. But he's as experienced as Jaeseok when it comes to variety show, both can adapt quickly to any guest and situation.\n\nHaha and Jaeseok, and Kwangsoo too actually often makes funny scene, but they're not getting much attention, while Somin became trending just because her armpit sweating? A scene where i personally think isn't funny, rather gross, but the situation makes it funny.\n\nWhile those three above always makes their scene funny, but it's been 10 years, and they always be funny. When they makes a funny scene, it's another funny scene as usual, they're funny, everyone knows. But someone like Somin, who is an actress, suddenly becomes funny? People are gonna talk about it. because it's new, fresh, things they didn't expect to happen.\n\nYou might argue that Jaeseok often makes headline too, but it's not Jaeseok that makes the headline, for example: Jaeseok and Jessi, it's because Jessi doing something fresh, makes Jaeseok became trending as well. Jaeseok become Trot singer, it's Yoo Sanseul that makes Jaeseok became trending, something new, fresh.\n\nHaha is always consistent and funny, he is just like many big names like Jaeseok, Dongyup, Hodong, Soogeun, and Janghoon, he'll always be hired by a show, and people will always appreciate him, but don't be surprised if there's nothing new, there'll be no trending over him. To say that he's not getting enough appreciation is a bit not right IMO, maybe he's not getting enough spotlight is more suitable.\n\nI think just like anyone on the show he's super important, if i'm gonna rank him, i'll put him to the 2nd most important, and i think he's as important as a co-host to Jaeseok in RM as he is in Infinite Challenge. Kwangsoo next, Then Jongkook, Jihyo, Somin, Seokjin, Sechan.",
            "author": "grandpa_hyo",
            "id": "fstmnsb",
            "parent_id": "t3_gw871q",
            "score": 1,
            "created_utc": 1591241560.0,
            "replies": [
                {
                    "body": "i 100% agree with this although i just see both appreciation and spotlight very closely linked. For example, him not having any segments or episode specials where others like Jae Seok and So Min have. I dont think it means to show a lack of appreciation for HaHa, but it slightly shows that his character on the show isn't enough to have his own special. He's proved well with spy missions, but he hasn't in recent years been given that spotlight on an episode where it's HaHa's episode. But with this, i do understand that HaHa is the middleman and he humbly carries the show.",
                    "author": "keiibro",
                    "id": "fsungm3",
                    "parent_id": "t1_fstmnsb",
                    "score": 3,
                    "created_utc": 1591271559.0,
                    "replies": []
                },
                {
                    "body": "Yep, Haha is famed for his wit and general variety skill. But as for the \"trending\" tag lines, I think RM and the cast have evolved to where the older guys would take more of a back seat and show focus on the younger hosts. So Min is good too, with her off handed variety comments and the like and I wouldn't take anything away from her. \n\nIf YJS really wanted he could have enough content to outshine everyone else (He is a variety monster), but he prefers to accentuate the performance of the rest, particularly KS and JSJ. The older guys are kinda like the bass guitar in a rock band. Amazing performance but seldom heard by the masses. So instead of ranking our RM members, just enjoy them as a whole, even if we have our favorites (our hyung is not an idiot xD)",
                    "author": "Benzener",
                    "id": "fsvlc35",
                    "parent_id": "t1_fstmnsb",
                    "score": 4,
                    "created_utc": 1591289669.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "haha's my favourite member, he's able to make keen observations and i feel like if he personally wanted to, he could really win a ton of games - he usually wins when he's a spy, but prioritizes comedy over analyzing a situation and winning all the time. I think his also high eq understands and allows himself to be at the side, rather than try and get into the spotlight, and understands his role within Rm making sure he doesn't overlap with others. \n\nwish he was in more shows, but i think his nature to let other people speak first and take the spotlight makes him not the first choice when casting for other shows. would love to see kind of a \"the genius\" series with Dongmin, Soogeun, Haha and other similar gems that i believe are very very smart but understand, especially with the latter two, that it most of the time it doesn't lead to comedy. would love to see them in a situation that allows them to be comedic but also serious.",
            "author": "tea_boy99",
            "id": "fsu0qey",
            "parent_id": "t3_gw871q",
            "score": 2,
            "created_utc": 1591251353.0,
            "replies": [
                {
                    "body": "Omg a genius series with dongmin, soogeun, sangmin and haha. That would be epic. The amount of backstabbing and twists would be off the walls.",
                    "author": "swearyirishman",
                    "id": "ft93y52",
                    "parent_id": "t1_fsu0qey",
                    "score": 1,
                    "created_utc": 1591520402.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "hes really underrated imo",
            "author": null,
            "id": "fszwsw7",
            "parent_id": "t3_gw871q",
            "score": 2,
            "created_utc": 1591380859.0,
            "replies": []
        },
        {
            "body": "Haha, LKS, and SJH are my favourites. I’ve always liked Haha because he’s very witty and his reactions are always real and not exaggerated. I don’t like YJS that much because his humour is to be always mean and rude to JSJ and LKS. I agree with you that JSM is always exaggerating and trying too hard to be funny. Haha is definitely a top running man member.",
            "author": "queenzeus",
            "id": "fstuw7f",
            "parent_id": "t3_gw871q",
            "score": 1,
            "created_utc": 1591246971.0,
            "replies": [
                {
                    "body": "My thoughts exactly, love Haha, SJH, LKS,",
                    "author": "zhc207",
                    "id": "fsu7qab",
                    "parent_id": "t1_fstuw7f",
                    "score": 2,
                    "created_utc": 1591257385.0,
                    "replies": []
                },
                {
                    "body": "LOL somebody down voted me LOL.   \nI don't hate YJS it's just that he interrupts people, he's telling them to stop talking, I mean I'd like to hear other members/guests thoughts too, sometimes he's rude. but I don't hate him. i just don't like the slight rudeness LOL. He's funny though.  \nJSM i don't hate her too, i think she's intelligent, it's just that she's not funny when she tries to over do it.\n\nLooove RM.",
                    "author": "zhc207",
                    "id": "fsuyry0",
                    "parent_id": "t1_fstuw7f",
                    "score": 2,
                    "created_utc": 1591278691.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haha is my favourite member as well!! He's hilarious, knows how to time his jokes and had to transition between the pororo phase and being a playboy to another role.",
            "author": "blimpnuts",
            "id": "fsuditk",
            "parent_id": "t3_gw871q",
            "score": 1,
            "created_utc": 1591262873.0,
            "replies": []
        },
        {
            "body": "I rate him as my favourite member on the show just above sechan and jongkook since gary left. He is godly funny",
            "author": "Kunodan",
            "id": "fsv2yl9",
            "parent_id": "t3_gw871q",
            "score": 1,
            "created_utc": 1591280893.0,
            "replies": []
        },
        {
            "body": "I agree on all points! I couldn't remember which episode it was but I cracked up so much on one episode where YJS and Haha were on the same team. He's great with making guests feel welcome too",
            "author": "boredandhungryalways",
            "id": "fsv6k6q",
            "parent_id": "t3_gw871q",
            "score": 1,
            "created_utc": 1591282683.0,
            "replies": []
        },
        {
            "body": "I totally feel the same way as you. Haha has never been a “main” star in the show like Jaesuk or Kwangsoo but damn he’s a darn good support. He doesn’t get much screen time but his one liners always set the mood up and create more funny scenes or even them just showing a second of him laughing whenever something funny happens, makes it so much funnier as well!\n\nHe’s exactly like Soogeun in Knowing Brothers, they don’t need to be in the spotlight but when given the opportunity, they hella deliver. It’s hard to be a main star but I feel it’s way harder to be a good supporting role.",
            "author": "givemecovid",
            "id": "fsvuehi",
            "parent_id": "t3_gw871q",
            "score": 1,
            "created_utc": 1591293842.0,
            "replies": []
        },
        {
            "body": "I wish I could upvote this over and over again. Haha is the most versatile among them and I like that more often than not, his jokes/gag are not mean spirited. They are well thought out and hits like a punch! \n\nWhen I started watching RM, he was the one I always looked forward to watching.",
            "author": null,
            "id": "fsx6wt4",
            "parent_id": "t3_gw871q",
            "score": 1,
            "created_utc": 1591317616.0,
            "replies": [
                {
                    "body": "thats also a very good point, i think thats what makes him different compared to jae seok. \n\nbut yes totally agree! HaHa is such a treat to see.",
                    "author": "keiibro",
                    "id": "fsytxvt",
                    "parent_id": "t1_fsx6wt4",
                    "score": 1,
                    "created_utc": 1591361036.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "THIS 100%! Haha and Lee Soo Geun make their shows so much more entertaining with their wit and humor!",
            "author": "MinaBigBalls",
            "id": "fstnrdq",
            "parent_id": "t1_fstgirf",
            "score": 32,
            "created_utc": 1591242240.0,
            "replies": []
        },
        {
            "body": "in short eh? hahaha i don’t know if that was intentional but it was pretty funny!",
            "author": "rapture64",
            "id": "fstmktg",
            "parent_id": "t1_fstjrvf",
            "score": 37,
            "created_utc": 1591241510.0,
            "replies": []
        },
        {
            "body": "I remember way back in the beginning when SJH and HaHa were paired together for the first time and SJH felt awkward about it bc she didn't know him well yet.. But in the end they had so much fun together. I think about that every time we see how comfortable SJH is with him now.",
            "author": "tea_time96",
            "id": "fstwje2",
            "parent_id": "t1_fstjrvf",
            "score": 13,
            "created_utc": 1591248167.0,
            "replies": [
                {
                    "body": "Sorry do you know what episode?",
                    "author": "idkwiamanymore",
                    "id": "fsu6je6",
                    "parent_id": "t1_fstwje2",
                    "score": 2,
                    "created_utc": 1591256307.0,
                    "replies": [
                        {
                            "body": "I think its ep 43",
                            "author": "babymin",
                            "id": "fsufz8s",
                            "parent_id": "t1_fsu6je6",
                            "score": 5,
                            "created_utc": 1591265202.0,
                            "replies": [
                                {
                                    "body": "Thank you!",
                                    "author": "idkwiamanymore",
                                    "id": "fsuo2en",
                                    "parent_id": "t1_fsufz8s",
                                    "score": 2,
                                    "created_utc": 1591272011.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yeah that's the one",
                                    "author": "tea_time96",
                                    "id": "fsv1p0h",
                                    "parent_id": "t1_fsufz8s",
                                    "score": 2,
                                    "created_utc": 1591280238.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This! I love to see how she always chooses him as her partner before Spart-ace couple became a thing.",
                    "author": "keiibro",
                    "id": "fsx330n",
                    "parent_id": "t1_fstwje2",
                    "score": 0,
                    "created_utc": 1591315473.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just watched episode 169 where HaHa had to use some strength in order not to embarass a civilian guest. Really showed how often he likely downplays his actual strength.",
            "author": "Sig-martin",
            "id": "fsv4pjw",
            "parent_id": "t1_fstr8qj",
            "score": 4,
            "created_utc": 1591281777.0,
            "replies": [
                {
                    "body": "Ah. But let's not forget the episode when his wife was a guest of I recall correctly. He really didn't hold back that episode at all.",
                    "author": "CaissaIRL",
                    "id": "fsvn252",
                    "parent_id": "t1_fsv4pjw",
                    "score": 5,
                    "created_utc": 1591290479.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Omg yes. He is so extra when it comes to role playing.",
            "author": "zaichii",
            "id": "fstv7jp",
            "parent_id": "t1_fstnm8e",
            "score": 13,
            "created_utc": 1591247201.0,
            "replies": []
        },
        {
            "body": "These are my exact thoughts! HaHa really be doing the most for others. But you're right, on the top off my head i cant think of an episode dedicated to HaHa but I wish  he would have one bc I think every other member except him has had more than one, and the show has been on for 10 years.",
            "author": "keiibro",
            "id": "fsyust0",
            "parent_id": "t1_fsut2o4",
            "score": 1,
            "created_utc": 1591361598.0,
            "replies": [
                {
                    "body": "He had that episode in Member's week where he had to choose who to save between two members because his character flaw was his indecision. It was a good one.",
                    "author": "springaugust",
                    "id": "ftkzdi2",
                    "parent_id": "t1_fsyust0",
                    "score": 1,
                    "created_utc": 1591795021.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "by other casts do you mean so min? i only briefly mentioned how so min has a forced humour and now you're jumping to this conclusion. my point was i read many other threads with rankings of the members and HaHa was always ranked 6th-8th, and to validate my point in saying he was a top rm member, i merely stated how good he is in comparison to members like so min who ranked higher. if you wanna talk downplaying other cast members we can, but that's entirely different subject. this thread is for HaHa.",
            "author": "keiibro",
            "id": "ft7daq5",
            "parent_id": "t1_ft4yr2h",
            "score": 1,
            "created_utc": 1591483672.0,
            "replies": []
        },
        {
            "body": "i agree. If he could master the skill of mceeing, he'd be a variety monster like Jae Seok.",
            "author": "keiibro",
            "id": "ftc72xi",
            "parent_id": "t1_ft9xyvn",
            "score": 1,
            "created_utc": 1591590692.0,
            "replies": []
        },
        {
            "body": "i 100% agree with this although i just see both appreciation and spotlight very closely linked. For example, him not having any segments or episode specials where others like Jae Seok and So Min have. I dont think it means to show a lack of appreciation for HaHa, but it slightly shows that his character on the show isn't enough to have his own special. He's proved well with spy missions, but he hasn't in recent years been given that spotlight on an episode where it's HaHa's episode. But with this, i do understand that HaHa is the middleman and he humbly carries the show.",
            "author": "keiibro",
            "id": "fsungm3",
            "parent_id": "t1_fstmnsb",
            "score": 3,
            "created_utc": 1591271559.0,
            "replies": []
        },
        {
            "body": "Yep, Haha is famed for his wit and general variety skill. But as for the \"trending\" tag lines, I think RM and the cast have evolved to where the older guys would take more of a back seat and show focus on the younger hosts. So Min is good too, with her off handed variety comments and the like and I wouldn't take anything away from her. \n\nIf YJS really wanted he could have enough content to outshine everyone else (He is a variety monster), but he prefers to accentuate the performance of the rest, particularly KS and JSJ. The older guys are kinda like the bass guitar in a rock band. Amazing performance but seldom heard by the masses. So instead of ranking our RM members, just enjoy them as a whole, even if we have our favorites (our hyung is not an idiot xD)",
            "author": "Benzener",
            "id": "fsvlc35",
            "parent_id": "t1_fstmnsb",
            "score": 4,
            "created_utc": 1591289669.0,
            "replies": []
        },
        {
            "body": "Omg a genius series with dongmin, soogeun, sangmin and haha. That would be epic. The amount of backstabbing and twists would be off the walls.",
            "author": "swearyirishman",
            "id": "ft93y52",
            "parent_id": "t1_fsu0qey",
            "score": 1,
            "created_utc": 1591520402.0,
            "replies": []
        },
        {
            "body": "My thoughts exactly, love Haha, SJH, LKS,",
            "author": "zhc207",
            "id": "fsu7qab",
            "parent_id": "t1_fstuw7f",
            "score": 2,
            "created_utc": 1591257385.0,
            "replies": []
        },
        {
            "body": "LOL somebody down voted me LOL.   \nI don't hate YJS it's just that he interrupts people, he's telling them to stop talking, I mean I'd like to hear other members/guests thoughts too, sometimes he's rude. but I don't hate him. i just don't like the slight rudeness LOL. He's funny though.  \nJSM i don't hate her too, i think she's intelligent, it's just that she's not funny when she tries to over do it.\n\nLooove RM.",
            "author": "zhc207",
            "id": "fsuyry0",
            "parent_id": "t1_fstuw7f",
            "score": 2,
            "created_utc": 1591278691.0,
            "replies": []
        },
        {
            "body": "thats also a very good point, i think thats what makes him different compared to jae seok. \n\nbut yes totally agree! HaHa is such a treat to see.",
            "author": "keiibro",
            "id": "fsytxvt",
            "parent_id": "t1_fsx6wt4",
            "score": 1,
            "created_utc": 1591361036.0,
            "replies": []
        },
        {
            "body": "Sorry do you know what episode?",
            "author": "idkwiamanymore",
            "id": "fsu6je6",
            "parent_id": "t1_fstwje2",
            "score": 2,
            "created_utc": 1591256307.0,
            "replies": [
                {
                    "body": "I think its ep 43",
                    "author": "babymin",
                    "id": "fsufz8s",
                    "parent_id": "t1_fsu6je6",
                    "score": 5,
                    "created_utc": 1591265202.0,
                    "replies": [
                        {
                            "body": "Thank you!",
                            "author": "idkwiamanymore",
                            "id": "fsuo2en",
                            "parent_id": "t1_fsufz8s",
                            "score": 2,
                            "created_utc": 1591272011.0,
                            "replies": []
                        },
                        {
                            "body": "Yeah that's the one",
                            "author": "tea_time96",
                            "id": "fsv1p0h",
                            "parent_id": "t1_fsufz8s",
                            "score": 2,
                            "created_utc": 1591280238.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This! I love to see how she always chooses him as her partner before Spart-ace couple became a thing.",
            "author": "keiibro",
            "id": "fsx330n",
            "parent_id": "t1_fstwje2",
            "score": 0,
            "created_utc": 1591315473.0,
            "replies": []
        },
        {
            "body": "Ah. But let's not forget the episode when his wife was a guest of I recall correctly. He really didn't hold back that episode at all.",
            "author": "CaissaIRL",
            "id": "fsvn252",
            "parent_id": "t1_fsv4pjw",
            "score": 5,
            "created_utc": 1591290479.0,
            "replies": []
        },
        {
            "body": "He had that episode in Member's week where he had to choose who to save between two members because his character flaw was his indecision. It was a good one.",
            "author": "springaugust",
            "id": "ftkzdi2",
            "parent_id": "t1_fsyust0",
            "score": 1,
            "created_utc": 1591795021.0,
            "replies": []
        },
        {
            "body": "I think its ep 43",
            "author": "babymin",
            "id": "fsufz8s",
            "parent_id": "t1_fsu6je6",
            "score": 5,
            "created_utc": 1591265202.0,
            "replies": [
                {
                    "body": "Thank you!",
                    "author": "idkwiamanymore",
                    "id": "fsuo2en",
                    "parent_id": "t1_fsufz8s",
                    "score": 2,
                    "created_utc": 1591272011.0,
                    "replies": []
                },
                {
                    "body": "Yeah that's the one",
                    "author": "tea_time96",
                    "id": "fsv1p0h",
                    "parent_id": "t1_fsufz8s",
                    "score": 2,
                    "created_utc": 1591280238.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you!",
            "author": "idkwiamanymore",
            "id": "fsuo2en",
            "parent_id": "t1_fsufz8s",
            "score": 2,
            "created_utc": 1591272011.0,
            "replies": []
        },
        {
            "body": "Yeah that's the one",
            "author": "tea_time96",
            "id": "fsv1p0h",
            "parent_id": "t1_fsufz8s",
            "score": 2,
            "created_utc": 1591280238.0,
            "replies": []
        }
    ]
}