{
    "title": "I’m not crazy, right?",
    "post_id": "qz9uyc",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/qz9uyc/im_not_crazy_right/",
    "author": "AmazingMatter2233",
    "body": "I had a meet and greet last week that went very well. Not a looker, but super nice guy, chemistry was apparent. He bought lunch and we just chatted for an hour or so, then he took me home.\n\nWe text a bit and plan for an afternoon tomorrow. As soon as the plan is made, he starts asking for nudes, demands I open the door naked, and insists on rough play, something I’m not comfortable with. We previously agreed to lunch and a couple hours of play time, but he said we could just skip lunch and he’ll get something afterwards. I was like ok so you have ALL these demands and then you can’t even provide a meal? \n\nSo I texted this: \n\nI actually don't think I'm going to meet you. I feel uncomfortable now. I am getting the impression my boundaries don't matter and you're viewing me as an escort service. \n\nI ask you not to leave bruises, you say there may be bruises anyway. I offer a time frame for lunch and play, you remove lunch to try to get an extra hour of play. You assume I will be comfortable opening the door naked after only meeting you once.\n\nI'm not sure how many times you've done this or what kind of women you've been meeting, but these are all major red flags. I encourage you to learn to express your desires in a less entitled manner. I may be looking for financial assistance, but I'm still a human. \n\nUnfortunately, the risk I am sensing is not worth the projected reward. \n\n\nJust venting because this is the first dip back in the bowl after a long break and I already remember why I quit in the first place. How do I weed these people out earlier? This behavior didn’t show up in person at all at the meet and greet.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/qz9uyc/im_not_crazy_right/",
    "score": 137,
    "upvote_ratio": 0.97,
    "created_utc": 1637545059.0,
    "num_comments": 64,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "That is an absolutely phenomenal response.   I hope he learns something from it -- and it looks like you may have dodged a bullet.\n\nWell done.",
            "author": "spoilyou255",
            "id": "hlldf0k",
            "parent_id": "t3_qz9uyc",
            "score": 58,
            "created_utc": 1637549942.0,
            "replies": [
                {
                    "body": "Thanks. I guess my English education pays off sometimes!",
                    "author": "AmazingMatter2233",
                    "id": "hlldn2d",
                    "parent_id": "t1_hlldf0k",
                    "score": 15,
                    "created_utc": 1637550050.0,
                    "replies": [
                        {
                            "body": "Well articulated response, and I would have guessed you were an English and/or Language Arts major :)  You did the right thing.  And blocking is the right move.  His response was not going to be worth the second (s) it takes for you to read it.",
                            "author": "jeffzeke",
                            "id": "hlls96v",
                            "parent_id": "t1_hlldn2d",
                            "score": 7,
                            "created_utc": 1637557563.0,
                            "replies": []
                        },
                        {
                            "body": "It really has. I loved it!",
                            "author": "Darknlovely38",
                            "id": "hllkxmi",
                            "parent_id": "t1_hlldn2d",
                            "score": 2,
                            "created_utc": 1637553626.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "He's not likely to learn much of anything but you have provided your sugar sisters with a great lesson....... \n\nThe scary thing is that he may learn to disguise his intentions.",
                    "author": "pinotandsugar",
                    "id": "hpe7xj6",
                    "parent_id": "t1_hlldf0k",
                    "score": 1,
                    "created_utc": 1640066996.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You did exactly the right thing. You are safe and took yourself and your safety as a priority. Take a long hot bath and enjoy a glass or a blunt, you deserve it",
            "author": "Background_Work1418",
            "id": "hll4632",
            "parent_id": "t3_qz9uyc",
            "score": 44,
            "created_utc": 1637545587.0,
            "replies": [
                {
                    "body": "Thanks bro. I’m gonna smoke up now lol cheers",
                    "author": "AmazingMatter2233",
                    "id": "hll4gwg",
                    "parent_id": "t1_hll4632",
                    "score": 17,
                    "created_utc": 1637545726.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hll3bwl",
            "parent_id": "t3_qz9uyc",
            "score": 36,
            "created_utc": 1637545193.0,
            "replies": [
                {
                    "body": "Me too. I was starting to imagine all the horrible scenarios that could happen and just cancelled the whole thing.",
                    "author": "AmazingMatter2233",
                    "id": "hll3ktn",
                    "parent_id": "t1_hll3bwl",
                    "score": 17,
                    "created_utc": 1637545308.0,
                    "replies": [
                        {
                            "body": "Your reply was great.  I hope he doesn't learn too much from it and hide his true intentions better with the next girl.  You are fortunate he showed his \\^ss before you met in private.",
                            "author": "willfromvb",
                            "id": "hlmpdjz",
                            "parent_id": "t1_hll3ktn",
                            "score": 3,
                            "created_utc": 1637583252.0,
                            "replies": [
                                {
                                    "body": "This was my immediate thought. Once someone is obviously intentionally behaving poorly, why allow them to improve their approach and ensnare others in the future? \n\nI am missing the redeeming quality leading to why the feedback was even offered. OP is on point, I just disagree with providing such reasoning when another acts in bad faith.",
                                    "author": "Some_Random_SD",
                                    "id": "hlp1ahj",
                                    "parent_id": "t1_hlmpdjz",
                                    "score": 1,
                                    "created_utc": 1637619917.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Absolutely concur with this.  Sounds like she dodged a serious bullet.",
                    "author": "Y_4Z44",
                    "id": "hll3s6e",
                    "parent_id": "t1_hll3bwl",
                    "score": 11,
                    "created_utc": 1637545406.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "*How do I weed these people out earlier? This behavior didn’t show up in person at all at the meet and greet.*\n\nSometimes you can't. Always remember, trust isn't an on/off switch. Trust is built over time.",
            "author": "BinghamtonSD",
            "id": "hll50v7",
            "parent_id": "t3_qz9uyc",
            "score": 13,
            "created_utc": 1637545978.0,
            "replies": []
        },
        {
            "body": "You're weeding him out at the right time. \n\nGood for you for telling him off. On the slight chance it'll make a difference.",
            "author": null,
            "id": "hllc3dg",
            "parent_id": "t3_qz9uyc",
            "score": 11,
            "created_utc": 1637549311.0,
            "replies": [
                {
                    "body": "He probably won’t heed my advice but I’m always one to speak my mind.",
                    "author": "AmazingMatter2233",
                    "id": "hllcf05",
                    "parent_id": "t1_hllc3dg",
                    "score": 6,
                    "created_utc": 1637549463.0,
                    "replies": [
                        {
                            "body": "What you wrote was great and well-written but guys like this don’t care about your feelings or respect boundaries, so it is like throwing pearls to swine, when  you try to educate them. It’s a waste of your energy. Most aren’t even worth a response.",
                            "author": null,
                            "id": "hlnwuc7",
                            "parent_id": "t1_hllcf05",
                            "score": 5,
                            "created_utc": 1637603570.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I wouldn't say she even told him off, she just stated her objection in a calm and factual manner. Proud of OP",
                    "author": "sehns",
                    "id": "hlmoqie",
                    "parent_id": "t1_hllc3dg",
                    "score": 3,
                    "created_utc": 1637582797.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He's a narcissist, bordering on psychopath. Block him, and ignore him.\n\nThis is all we need to know, to reach this conclusion:\n\n\"I ask you not to leave bruises, you say there may be bruises anyway.\"",
            "author": "Nomad_Bill",
            "id": "hlln8lj",
            "parent_id": "t3_qz9uyc",
            "score": 10,
            "created_utc": 1637554814.0,
            "replies": []
        },
        {
            "body": "Nice post. I see so many SBs feeling horrible after allowing an SD to cross all sorts of boundaries. I hope they read this post and learn to take better care of themselves.",
            "author": "Monte_Sailor",
            "id": "hllnh8t",
            "parent_id": "t3_qz9uyc",
            "score": 10,
            "created_utc": 1637554934.0,
            "replies": []
        },
        {
            "body": "You're not crazy, you're awesome! It's great that you are standing up for yourself.",
            "author": null,
            "id": "hll78cc",
            "parent_id": "t3_qz9uyc",
            "score": 9,
            "created_utc": 1637547006.0,
            "replies": []
        },
        {
            "body": "Glad he actually said something ahead of time…bizarre and creepy.  I guess getting rinsed isn’t the worst risk.  \n\nI find undesirable characters have a difficult time having a continuous positive interaction and quickly veer off into their poor behavior quickly; I think they need to play a numbers game to find anyone compliant enough to play or pay along.",
            "author": "Alienrite",
            "id": "hll6el3",
            "parent_id": "t3_qz9uyc",
            "score": 13,
            "created_utc": 1637546624.0,
            "replies": [
                {
                    "body": "Makes me scared for other girls. I had to actively decide not to take the risk. I fortunately am not in a space where I am willing to sacrifice my mental health for anyone, but I wasn’t always like that and am extremely grateful I never got into any seriously dangerous situations.",
                    "author": "AmazingMatter2233",
                    "id": "hllbsud",
                    "parent_id": "t1_hll6el3",
                    "score": 13,
                    "created_utc": 1637549171.0,
                    "replies": [
                        {
                            "body": "You could contact the host of the meet and greet. Maybe he has received other complaints and this will be the last straw? Or maybe you speaking up will encourage others. You never know.\n\nHowever, it would be helpful for the hosts to know this information so they can make informed decisions about future guest lists.",
                            "author": "DaddyIshishtar",
                            "id": "hllqi96",
                            "parent_id": "t1_hllbsud",
                            "score": 1,
                            "created_utc": 1637556548.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Repeatedly we women (and some SDs here too u/sfwinefan comes to mind in particular) reiterate the physical harm and risks we face far far far outweigh the financial loss/risks of men losing xxx or xxxx dollars. \n\nAnd how repeatedly our voices get drowned out by many of the indignant men howling how dare we talk about losing some money like it’s nothing, how it’s the principle and not the actual money yaddi yadda.",
                    "author": "SerendipityX8",
                    "id": "hllujej",
                    "parent_id": "t1_hll6el3",
                    "score": 11,
                    "created_utc": 1637558956.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">How do I weed these people out earlier?\n\nJust spitballing here: an hour+ lunch in lieu of coffee might have seemed like a ***green light*** to POT—a green light is the exact opposite of a red flag: it gives a person the illusion that permissiveness exists where there is none.  \n\nOther potential ‘green lights:’\n\n* allowing him to take you home.  If you violate your own due diligence of maintaining your privacy—by revealing your address—then you can count on him getting the wrong idea.\n* accepting plans at your place.  Part of being an SD involves having the depth of pockets to provide experiences for your SB.  \n   * combine the luxurious / lifestyle stuff with your need for safety & privacy, and the idea of meeting in a no-man's-land comes to mind.  \n      * but you made plans to meet him at your place, thereby excusing a double performance that he owes you: meeting you in a hotel for safety, privacy, and potentially some pizazz \n\nPOT had the choice of cherishing the good vibe you broadcast and trying his darnedest to live up to it.  Alas, he decided to go for broke, and entreat you to some weird / ill-timed stuff.\n\nIf the above resonates in you, consider appearing a bit more distant and protective of your boundaries.  Moreover, I strongly recommend you do not contact POT again, nor accept communications from him.  \n\n&#x200B;\n\n>This behavior didn’t show up in person at all at the meet and greet.\n\nNo one can predict people's future behavior, but stopping green lights & catching red flags goes a long way.",
            "author": null,
            "id": "hlleez0",
            "parent_id": "t3_qz9uyc",
            "score": 8,
            "created_utc": 1637550424.0,
            "replies": [
                {
                    "body": "Solid advice all around. I’m a very personable person and I have a hard time being reserved. Maybe I’ll take a friend on a pretend meet and greet to practice or something haha",
                    "author": "AmazingMatter2233",
                    "id": "hllq6ix",
                    "parent_id": "t1_hlleez0",
                    "score": 1,
                    "created_utc": 1637556365.0,
                    "replies": [
                        {
                            "body": ">I’m a very personable person and I have a hard time being reserved. \n\nRestraint is a toughie for those of us who are expansive / exuberant.  When someone who falls in that category meets a like-minded person, it's like locating a long-lost sibling; it's wonderful.  Alas, the odds of finding people—who ‘get it’ and have the capacity & desire to honor that difference & pay it in kind—are very slim.  The odds are thinner yet where money is to change hands and posturing is rampant (SRs).\n\nAlso, I do not see a fundamental opposition between being personable and being reserved; only the way you erect & enforce your boundaries changes; that sounds fairly reasonable.  Anyone who'll appreciate your outgoing attributes will like them even more if they discover them fully over time.  Plus: they'll think themselves a genius for having discovered those treasures about your personality.  Ha!\n\n&#x200B;\n\n>Maybe I’ll take a friend on a pretend meet and greet to practice or something haha\n\nShoot me a message with penchants of yours and impulses you observe in yourself, and I'll reply with some feedback as to the way they might be construed in the bowl—if you want.",
                            "author": null,
                            "id": "hllvyyi",
                            "parent_id": "t1_hllq6ix",
                            "score": 1,
                            "created_utc": 1637559865.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"\"you say there may be bruises anyway. \"\"\"\n\nI say goodbyeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee\n\nBut you owe him thanks for the warning",
            "author": "pinotandsugar",
            "id": "hllqnv4",
            "parent_id": "t3_qz9uyc",
            "score": 5,
            "created_utc": 1637556635.0,
            "replies": []
        },
        {
            "body": "Bullet dodged, you definitely did the right thing by pulling the plug now.",
            "author": "mraspencer",
            "id": "hll7irc",
            "parent_id": "t3_qz9uyc",
            "score": 5,
            "created_utc": 1637547142.0,
            "replies": []
        },
        {
            "body": "This is an amazing piece of work, and while those of us on the outside think it's automatic and is the common sense reply, the fact is many would not be as brave as you. Part of me is so curious about his reaction to this but I presume you blocked him, which is the right move.",
            "author": "Intrepid_Seeker",
            "id": "hllfgux",
            "parent_id": "t3_qz9uyc",
            "score": 3,
            "created_utc": 1637550927.0,
            "replies": []
        },
        {
            "body": "Please do not meet him! He is not worth it and he sounds disrespectful so you do not know how he will treat you behind closed doors",
            "author": null,
            "id": "hll5vtn",
            "parent_id": "t3_qz9uyc",
            "score": 3,
            "created_utc": 1637546379.0,
            "replies": []
        },
        {
            "body": "Yep passing on this guy was the right thing to do",
            "author": "wb19081908",
            "id": "hllg0ag",
            "parent_id": "t3_qz9uyc",
            "score": 3,
            "created_utc": 1637551191.0,
            "replies": []
        },
        {
            "body": "Well, glad that he couldn't hold it in and let it out early.  The best thing to do during M&G is to ask more questions and some test questions like what kind of fantasy and play along like a psychologist would do to draw a profile of his personality.  I do the same with any POT SB, I need to see how loyal or serious she can be if I want to invest my time with her.",
            "author": "MKTekke",
            "id": "hlltnp8",
            "parent_id": "t3_qz9uyc",
            "score": 3,
            "created_utc": 1637558409.0,
            "replies": []
        },
        {
            "body": "Personally I think your message was over the top nice. For this kind of creep \"fuck off and leave me alone\" would have been sufficent.",
            "author": "AFSMSgt",
            "id": "hlmpz53",
            "parent_id": "t3_qz9uyc",
            "score": 3,
            "created_utc": 1637583665.0,
            "replies": []
        },
        {
            "body": "I’m so proud of you. You’d be CRAZY if you were to go along with this. Very predatory behavior, I’m glad you communicated all of this to him so eloquently!",
            "author": "fruters",
            "id": "hlnd1hy",
            "parent_id": "t3_qz9uyc",
            "score": 3,
            "created_utc": 1637595582.0,
            "replies": []
        },
        {
            "body": "thank the sugar gawds he showed his ugly true colors sooner rather than later. dodged a massive bullet!",
            "author": "fruters",
            "id": "hlnd7xo",
            "parent_id": "t3_qz9uyc",
            "score": 3,
            "created_utc": 1637595657.0,
            "replies": []
        },
        {
            "body": "Trust your gut.",
            "author": "pugglebutt914",
            "id": "hllp8bs",
            "parent_id": "t3_qz9uyc",
            "score": 2,
            "created_utc": 1637555847.0,
            "replies": []
        },
        {
            "body": "\"he starts asking for nudes, demands I open the door naked, and insists on rough play, something I’m not comfortable with.\"\n\nNever do anything you feel uncomfortable with.\n\nYou made the right decision not to proceed.",
            "author": "LuckyINTJ",
            "id": "hllpbty",
            "parent_id": "t3_qz9uyc",
            "score": 2,
            "created_utc": 1637555898.0,
            "replies": []
        },
        {
            "body": ">How do I weed these people out earlier? \n\nI'm not sure how, since they're good at seeming normal for a while. I mean you can stretch out the M&G and non-intimate period, maybe ask for 1-2 platonic dates before intimacy, but that will also filter non-weirdos out also.",
            "author": "emptyoverflow",
            "id": "hllrlrk",
            "parent_id": "t3_qz9uyc",
            "score": 2,
            "created_utc": 1637557180.0,
            "replies": []
        },
        {
            "body": "nope, you’re completely right. Thank you for standing your ground and not letting him walk over you. I WISH I was this intuitive when I first dipped into the bowl, rather than letting some of these guys walk over me. Hindsight is 20/20 I guess.",
            "author": "cherryribs",
            "id": "hlm2cz7",
            "parent_id": "t3_qz9uyc",
            "score": 2,
            "created_utc": 1637564284.0,
            "replies": []
        },
        {
            "body": "Right on, girl!  You handled it perfectly.",
            "author": null,
            "id": "hlmjgz3",
            "parent_id": "t3_qz9uyc",
            "score": 2,
            "created_utc": 1637578693.0,
            "replies": []
        },
        {
            "body": "he starts asking for nudes, demands I open the door naked, and insists on rough play, something I’m not comfortable with.\n\nNEXT ! That is an easy decision and is too bad the guy is a freak. But better to find out now than later.",
            "author": "GSSD",
            "id": "hln3dms",
            "parent_id": "t3_qz9uyc",
            "score": 2,
            "created_utc": 1637591251.0,
            "replies": []
        },
        {
            "body": "Not crazy at ALL! That’s some nonsense, what he’s pulling. You ARE a human, you DESERVE respect, and so do your boundaries. He’s definitely setting a principle for the rest of the SR if he’s immediately dismissing your boundaries and trying to get his way, regardless of what you want or need. BOOOOOO to him.",
            "author": "Crazy-Statistician-7",
            "id": "hln40fb",
            "parent_id": "t3_qz9uyc",
            "score": 2,
            "created_utc": 1637591556.0,
            "replies": []
        },
        {
            "body": "If writing that was cathartic or helpful, then that's great, but I generally don't bother with writing so much to entitle dbags like this. \"Sounds like we're not a match, good luck with your search\" is as much of my thought as they're going to get. He already told you he doesn't care about your boundaries, he certainly won't care about you telling him again. JMO.",
            "author": "NoLimitLexa",
            "id": "hlldr8i",
            "parent_id": "t3_qz9uyc",
            "score": 2,
            "created_utc": 1637550108.0,
            "replies": [
                {
                    "body": "Agree wholeheartedly. Definitely more cathartic. I blocked him after I sent the text so I don’t know what his response was, if there was one",
                    "author": "AmazingMatter2233",
                    "id": "hlldwoh",
                    "parent_id": "t1_hlldr8i",
                    "score": 5,
                    "created_utc": 1637550183.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are completely right. He should visit prostitute, why does he bother with SA?",
            "author": "cherrypick96",
            "id": "hll3y3h",
            "parent_id": "t3_qz9uyc",
            "score": 2,
            "created_utc": 1637545485.0,
            "replies": [
                {
                    "body": "I don't know. I hope prostitutes will kick him on the balls and send him flying if he gets rough...",
                    "author": "Monte_Sailor",
                    "id": "hlln38w",
                    "parent_id": "t1_hll3y3h",
                    "score": 6,
                    "created_utc": 1637554738.0,
                    "replies": []
                },
                {
                    "body": "Someone like that can't see a prostitute; he would be black-listed.  He's using SA because it is primarily a prostitution site without screening.",
                    "author": "NewOperation6666",
                    "id": "hlozbe5",
                    "parent_id": "t1_hll3y3h",
                    "score": 1,
                    "created_utc": 1637619067.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Holy shit... block this guy immediately. He wants to leave bruises??? You would be crazy to see him again.",
            "author": "fatsocalsd",
            "id": "hllhwie",
            "parent_id": "t3_qz9uyc",
            "score": 1,
            "created_utc": 1637552121.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hll4ql6",
            "parent_id": "t3_qz9uyc",
            "score": 1,
            "created_utc": 1637545848.0,
            "replies": [
                {
                    "body": "I feel like that just turns into sexting and I’m not into that even in vanilla relationships. I can sext with an SD if the relationship is established and I don’t feel like I’m being used for free jerk off material",
                    "author": "AmazingMatter2233",
                    "id": "hll53zs",
                    "parent_id": "t1_hll4ql6",
                    "score": 4,
                    "created_utc": 1637546017.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "One way to weed out the likes of him is to ask for money on the first meet and maybe do dinner instead, that way he knows you’re not here to play around",
            "author": "kikienen",
            "id": "hllo9qh",
            "parent_id": "t3_qz9uyc",
            "score": 0,
            "created_utc": 1637555355.0,
            "replies": [
                {
                    "body": ">One way to weed out the likes of him is to ask for money on the first meet and maybe do dinner instead.\n\nI really don't get why you think that would weed out SDs like OP's pot. You really think that throwing some $  to some platonic M&G's will weed out people who don't respect boundaries and other weirdo's?\n\nAll it will do is make *YOU* being weeded out by a lot of serious and trustworthy Pot's who think *both* parties should be willing to invest their precious time in getting to know each other.",
                    "author": "A-touchofreality",
                    "id": "hlmbk3x",
                    "parent_id": "t1_hllo9qh",
                    "score": 2,
                    "created_utc": 1637571685.0,
                    "replies": [
                        {
                            "body": "I said one way, if you have another point to add feel free to do so. I’m done explaining my stance on this particular subject",
                            "author": "kikienen",
                            "id": "hlmc0at",
                            "parent_id": "t1_hlmbk3x",
                            "score": 0,
                            "created_utc": 1637572081.0,
                            "replies": [
                                {
                                    "body": "And I said that this method is going to do nothing for the purpose of weeding out men like OP described.",
                                    "author": "A-touchofreality",
                                    "id": "hlmqgy6",
                                    "parent_id": "t1_hlmc0at",
                                    "score": 2,
                                    "created_utc": 1637584000.0,
                                    "replies": [
                                        {
                                            "body": "Not really because men like that are clearly cheap and not interest in investing in a future arrangement with a sugar baby.",
                                            "author": "kikienen",
                                            "id": "hlohqwr",
                                            "parent_id": "t1_hlmqgy6",
                                            "score": 3,
                                            "created_utc": 1637611913.0,
                                            "replies": [
                                                {
                                                    "body": "Oh c'mon...\n\nThis whole post wasn't about men being cheap, but men having weird expectations. Those things are not correlated. At all!\n\nEver heard of the Dubai potty?",
                                                    "author": "A-touchofreality",
                                                    "id": "hlom5qu",
                                                    "parent_id": "t1_hlohqwr",
                                                    "score": 1,
                                                    "created_utc": 1637613697.0,
                                                    "replies": [
                                                        {
                                                            "body": "My advice steal stands! Do you boo",
                                                            "author": "kikienen",
                                                            "id": "hlomnfo",
                                                            "parent_id": "t1_hlom5qu",
                                                            "score": 2,
                                                            "created_utc": 1637613900.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good job weeding this one out before things got really ugly. \n\nAs far as weeding guys out earlier goes, think back to your initial interactions with this guy and look at his profile again to dig up the yellow or orange flags you may have missed. Think about all of the things you noticed about him and what he told you.  Do this for every other prospective daddy or boyfriend you’ve come across. Of course, you’ve probably already done this. It’s helpful, but still kind of superficial. \n\nMore importantly, pay attention to every little thing a guy does. How he walks, moves, eats, drinks, drives etc. IMO, what a person does is often more telling than anything they can say or stick into a profile. Does he enter your personal space?  If so, in what way? Was he playfully testing you or was it a little desperate or menacing?  The only difference between a serial killer and a nice guy saying hi might be where they are standing relative to the trunk of their car, so every little detail could help. People write whole books on this sorta stuff and many are well worth the read. Pay attention to these things and let it go to your gut. Then follow your gut going forward. \n\nI would bet he did something that night that was a little bit off since it sounds like you had a pretty long meet and greet. You mentioned he took you home. Was this his idea?  I can see that as something slightly invasive. I hope you didn’t give up where you live.  You also mentioned that chemistry was apparent. Do you have a history of being attracted to assholes? If so, what about them might you not be spotting from a mile away. \n\nThen again, maybe you played it perfectly and you just have to deal with a few bad guys before you find another good one. \n\nDO NOT, ask for money for a meet and greet, at least not to weed people out. It will only weed out the guys who aren’t desperate, who are the ones you probably want to meet anyways.",
            "author": "Pronicator",
            "id": "hln8yu7",
            "parent_id": "t3_qz9uyc",
            "score": 1,
            "created_utc": 1637593817.0,
            "replies": []
        },
        {
            "body": "I don't think the skipping lunch here should of been your queue to bail, all those demands you are uncomfortable with should of done it.  Probably saved yourself some pain and aggravation in any case.  Weed earlier ?  Do a coffee m&g and not a lunch and  it will be less effort.",
            "author": "RedHeavyG603",
            "id": "hlngghm",
            "parent_id": "t3_qz9uyc",
            "score": 1,
            "created_utc": 1637597000.0,
            "replies": []
        },
        {
            "body": "You deserve better.",
            "author": "nosleep4eternity",
            "id": "hlnuyfl",
            "parent_id": "t3_qz9uyc",
            "score": 1,
            "created_utc": 1637602837.0,
            "replies": []
        },
        {
            "body": "You're in the right, weed him out.  It's going to take time to figure out if its someone you're comfortable with.",
            "author": "SeaRow",
            "id": "hlpd0er",
            "parent_id": "t3_qz9uyc",
            "score": 1,
            "created_utc": 1637625131.0,
            "replies": []
        },
        {
            "body": "Awesome job!\n\nSet strong boundaries early/earlier. Ideally your prospective SD has a good understanding of these boundaries well before you ever meet. This will do a fair bit of sorting for you so you're not as likely to be in a defensive position again.",
            "author": "Sugarchancedating",
            "id": "hlptusw",
            "parent_id": "t3_qz9uyc",
            "score": 1,
            "created_utc": 1637633056.0,
            "replies": []
        },
        {
            "body": " So many people have missed that you were looking for financial compensation or have sugar coated in so many ways thru all the sugar coated responses. You want to use someone but don’t want to be used back hmm am I missing the whole point? But wait it’s ok because you want to be financially compensated.  Stfu and do your diligence and put up with what you pay for.",
            "author": "Ok-Initiative-5427",
            "id": "hp9qlau",
            "parent_id": "t3_qz9uyc",
            "score": 1,
            "created_utc": 1639984906.0,
            "replies": []
        },
        {
            "body": "I feel like I know this guy - is he based in ATX?",
            "author": "AccomplishedSwim6595",
            "id": "hpe6ymj",
            "parent_id": "t3_qz9uyc",
            "score": 1,
            "created_utc": 1640066364.0,
            "replies": [
                {
                    "body": "Yes",
                    "author": "AmazingMatter2233",
                    "id": "hpgtqie",
                    "parent_id": "t1_hpe6ymj",
                    "score": 1,
                    "created_utc": 1640117873.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks. I guess my English education pays off sometimes!",
            "author": "AmazingMatter2233",
            "id": "hlldn2d",
            "parent_id": "t1_hlldf0k",
            "score": 15,
            "created_utc": 1637550050.0,
            "replies": [
                {
                    "body": "Well articulated response, and I would have guessed you were an English and/or Language Arts major :)  You did the right thing.  And blocking is the right move.  His response was not going to be worth the second (s) it takes for you to read it.",
                    "author": "jeffzeke",
                    "id": "hlls96v",
                    "parent_id": "t1_hlldn2d",
                    "score": 7,
                    "created_utc": 1637557563.0,
                    "replies": []
                },
                {
                    "body": "It really has. I loved it!",
                    "author": "Darknlovely38",
                    "id": "hllkxmi",
                    "parent_id": "t1_hlldn2d",
                    "score": 2,
                    "created_utc": 1637553626.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He's not likely to learn much of anything but you have provided your sugar sisters with a great lesson....... \n\nThe scary thing is that he may learn to disguise his intentions.",
            "author": "pinotandsugar",
            "id": "hpe7xj6",
            "parent_id": "t1_hlldf0k",
            "score": 1,
            "created_utc": 1640066996.0,
            "replies": []
        },
        {
            "body": "Thanks bro. I’m gonna smoke up now lol cheers",
            "author": "AmazingMatter2233",
            "id": "hll4gwg",
            "parent_id": "t1_hll4632",
            "score": 17,
            "created_utc": 1637545726.0,
            "replies": []
        },
        {
            "body": "Me too. I was starting to imagine all the horrible scenarios that could happen and just cancelled the whole thing.",
            "author": "AmazingMatter2233",
            "id": "hll3ktn",
            "parent_id": "t1_hll3bwl",
            "score": 17,
            "created_utc": 1637545308.0,
            "replies": [
                {
                    "body": "Your reply was great.  I hope he doesn't learn too much from it and hide his true intentions better with the next girl.  You are fortunate he showed his \\^ss before you met in private.",
                    "author": "willfromvb",
                    "id": "hlmpdjz",
                    "parent_id": "t1_hll3ktn",
                    "score": 3,
                    "created_utc": 1637583252.0,
                    "replies": [
                        {
                            "body": "This was my immediate thought. Once someone is obviously intentionally behaving poorly, why allow them to improve their approach and ensnare others in the future? \n\nI am missing the redeeming quality leading to why the feedback was even offered. OP is on point, I just disagree with providing such reasoning when another acts in bad faith.",
                            "author": "Some_Random_SD",
                            "id": "hlp1ahj",
                            "parent_id": "t1_hlmpdjz",
                            "score": 1,
                            "created_utc": 1637619917.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Absolutely concur with this.  Sounds like she dodged a serious bullet.",
            "author": "Y_4Z44",
            "id": "hll3s6e",
            "parent_id": "t1_hll3bwl",
            "score": 11,
            "created_utc": 1637545406.0,
            "replies": []
        },
        {
            "body": "He probably won’t heed my advice but I’m always one to speak my mind.",
            "author": "AmazingMatter2233",
            "id": "hllcf05",
            "parent_id": "t1_hllc3dg",
            "score": 6,
            "created_utc": 1637549463.0,
            "replies": [
                {
                    "body": "What you wrote was great and well-written but guys like this don’t care about your feelings or respect boundaries, so it is like throwing pearls to swine, when  you try to educate them. It’s a waste of your energy. Most aren’t even worth a response.",
                    "author": null,
                    "id": "hlnwuc7",
                    "parent_id": "t1_hllcf05",
                    "score": 5,
                    "created_utc": 1637603570.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wouldn't say she even told him off, she just stated her objection in a calm and factual manner. Proud of OP",
            "author": "sehns",
            "id": "hlmoqie",
            "parent_id": "t1_hllc3dg",
            "score": 3,
            "created_utc": 1637582797.0,
            "replies": []
        },
        {
            "body": "Makes me scared for other girls. I had to actively decide not to take the risk. I fortunately am not in a space where I am willing to sacrifice my mental health for anyone, but I wasn’t always like that and am extremely grateful I never got into any seriously dangerous situations.",
            "author": "AmazingMatter2233",
            "id": "hllbsud",
            "parent_id": "t1_hll6el3",
            "score": 13,
            "created_utc": 1637549171.0,
            "replies": [
                {
                    "body": "You could contact the host of the meet and greet. Maybe he has received other complaints and this will be the last straw? Or maybe you speaking up will encourage others. You never know.\n\nHowever, it would be helpful for the hosts to know this information so they can make informed decisions about future guest lists.",
                    "author": "DaddyIshishtar",
                    "id": "hllqi96",
                    "parent_id": "t1_hllbsud",
                    "score": 1,
                    "created_utc": 1637556548.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Repeatedly we women (and some SDs here too u/sfwinefan comes to mind in particular) reiterate the physical harm and risks we face far far far outweigh the financial loss/risks of men losing xxx or xxxx dollars. \n\nAnd how repeatedly our voices get drowned out by many of the indignant men howling how dare we talk about losing some money like it’s nothing, how it’s the principle and not the actual money yaddi yadda.",
            "author": "SerendipityX8",
            "id": "hllujej",
            "parent_id": "t1_hll6el3",
            "score": 11,
            "created_utc": 1637558956.0,
            "replies": []
        },
        {
            "body": "Solid advice all around. I’m a very personable person and I have a hard time being reserved. Maybe I’ll take a friend on a pretend meet and greet to practice or something haha",
            "author": "AmazingMatter2233",
            "id": "hllq6ix",
            "parent_id": "t1_hlleez0",
            "score": 1,
            "created_utc": 1637556365.0,
            "replies": [
                {
                    "body": ">I’m a very personable person and I have a hard time being reserved. \n\nRestraint is a toughie for those of us who are expansive / exuberant.  When someone who falls in that category meets a like-minded person, it's like locating a long-lost sibling; it's wonderful.  Alas, the odds of finding people—who ‘get it’ and have the capacity & desire to honor that difference & pay it in kind—are very slim.  The odds are thinner yet where money is to change hands and posturing is rampant (SRs).\n\nAlso, I do not see a fundamental opposition between being personable and being reserved; only the way you erect & enforce your boundaries changes; that sounds fairly reasonable.  Anyone who'll appreciate your outgoing attributes will like them even more if they discover them fully over time.  Plus: they'll think themselves a genius for having discovered those treasures about your personality.  Ha!\n\n&#x200B;\n\n>Maybe I’ll take a friend on a pretend meet and greet to practice or something haha\n\nShoot me a message with penchants of yours and impulses you observe in yourself, and I'll reply with some feedback as to the way they might be construed in the bowl—if you want.",
                    "author": null,
                    "id": "hllvyyi",
                    "parent_id": "t1_hllq6ix",
                    "score": 1,
                    "created_utc": 1637559865.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agree wholeheartedly. Definitely more cathartic. I blocked him after I sent the text so I don’t know what his response was, if there was one",
            "author": "AmazingMatter2233",
            "id": "hlldwoh",
            "parent_id": "t1_hlldr8i",
            "score": 5,
            "created_utc": 1637550183.0,
            "replies": []
        },
        {
            "body": "I don't know. I hope prostitutes will kick him on the balls and send him flying if he gets rough...",
            "author": "Monte_Sailor",
            "id": "hlln38w",
            "parent_id": "t1_hll3y3h",
            "score": 6,
            "created_utc": 1637554738.0,
            "replies": []
        },
        {
            "body": "Someone like that can't see a prostitute; he would be black-listed.  He's using SA because it is primarily a prostitution site without screening.",
            "author": "NewOperation6666",
            "id": "hlozbe5",
            "parent_id": "t1_hll3y3h",
            "score": 1,
            "created_utc": 1637619067.0,
            "replies": []
        },
        {
            "body": "I feel like that just turns into sexting and I’m not into that even in vanilla relationships. I can sext with an SD if the relationship is established and I don’t feel like I’m being used for free jerk off material",
            "author": "AmazingMatter2233",
            "id": "hll53zs",
            "parent_id": "t1_hll4ql6",
            "score": 4,
            "created_utc": 1637546017.0,
            "replies": []
        },
        {
            "body": ">One way to weed out the likes of him is to ask for money on the first meet and maybe do dinner instead.\n\nI really don't get why you think that would weed out SDs like OP's pot. You really think that throwing some $  to some platonic M&G's will weed out people who don't respect boundaries and other weirdo's?\n\nAll it will do is make *YOU* being weeded out by a lot of serious and trustworthy Pot's who think *both* parties should be willing to invest their precious time in getting to know each other.",
            "author": "A-touchofreality",
            "id": "hlmbk3x",
            "parent_id": "t1_hllo9qh",
            "score": 2,
            "created_utc": 1637571685.0,
            "replies": [
                {
                    "body": "I said one way, if you have another point to add feel free to do so. I’m done explaining my stance on this particular subject",
                    "author": "kikienen",
                    "id": "hlmc0at",
                    "parent_id": "t1_hlmbk3x",
                    "score": 0,
                    "created_utc": 1637572081.0,
                    "replies": [
                        {
                            "body": "And I said that this method is going to do nothing for the purpose of weeding out men like OP described.",
                            "author": "A-touchofreality",
                            "id": "hlmqgy6",
                            "parent_id": "t1_hlmc0at",
                            "score": 2,
                            "created_utc": 1637584000.0,
                            "replies": [
                                {
                                    "body": "Not really because men like that are clearly cheap and not interest in investing in a future arrangement with a sugar baby.",
                                    "author": "kikienen",
                                    "id": "hlohqwr",
                                    "parent_id": "t1_hlmqgy6",
                                    "score": 3,
                                    "created_utc": 1637611913.0,
                                    "replies": [
                                        {
                                            "body": "Oh c'mon...\n\nThis whole post wasn't about men being cheap, but men having weird expectations. Those things are not correlated. At all!\n\nEver heard of the Dubai potty?",
                                            "author": "A-touchofreality",
                                            "id": "hlom5qu",
                                            "parent_id": "t1_hlohqwr",
                                            "score": 1,
                                            "created_utc": 1637613697.0,
                                            "replies": [
                                                {
                                                    "body": "My advice steal stands! Do you boo",
                                                    "author": "kikienen",
                                                    "id": "hlomnfo",
                                                    "parent_id": "t1_hlom5qu",
                                                    "score": 2,
                                                    "created_utc": 1637613900.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes",
            "author": "AmazingMatter2233",
            "id": "hpgtqie",
            "parent_id": "t1_hpe6ymj",
            "score": 1,
            "created_utc": 1640117873.0,
            "replies": []
        },
        {
            "body": "Well articulated response, and I would have guessed you were an English and/or Language Arts major :)  You did the right thing.  And blocking is the right move.  His response was not going to be worth the second (s) it takes for you to read it.",
            "author": "jeffzeke",
            "id": "hlls96v",
            "parent_id": "t1_hlldn2d",
            "score": 7,
            "created_utc": 1637557563.0,
            "replies": []
        },
        {
            "body": "It really has. I loved it!",
            "author": "Darknlovely38",
            "id": "hllkxmi",
            "parent_id": "t1_hlldn2d",
            "score": 2,
            "created_utc": 1637553626.0,
            "replies": []
        },
        {
            "body": "Your reply was great.  I hope he doesn't learn too much from it and hide his true intentions better with the next girl.  You are fortunate he showed his \\^ss before you met in private.",
            "author": "willfromvb",
            "id": "hlmpdjz",
            "parent_id": "t1_hll3ktn",
            "score": 3,
            "created_utc": 1637583252.0,
            "replies": [
                {
                    "body": "This was my immediate thought. Once someone is obviously intentionally behaving poorly, why allow them to improve their approach and ensnare others in the future? \n\nI am missing the redeeming quality leading to why the feedback was even offered. OP is on point, I just disagree with providing such reasoning when another acts in bad faith.",
                    "author": "Some_Random_SD",
                    "id": "hlp1ahj",
                    "parent_id": "t1_hlmpdjz",
                    "score": 1,
                    "created_utc": 1637619917.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What you wrote was great and well-written but guys like this don’t care about your feelings or respect boundaries, so it is like throwing pearls to swine, when  you try to educate them. It’s a waste of your energy. Most aren’t even worth a response.",
            "author": null,
            "id": "hlnwuc7",
            "parent_id": "t1_hllcf05",
            "score": 5,
            "created_utc": 1637603570.0,
            "replies": []
        },
        {
            "body": "You could contact the host of the meet and greet. Maybe he has received other complaints and this will be the last straw? Or maybe you speaking up will encourage others. You never know.\n\nHowever, it would be helpful for the hosts to know this information so they can make informed decisions about future guest lists.",
            "author": "DaddyIshishtar",
            "id": "hllqi96",
            "parent_id": "t1_hllbsud",
            "score": 1,
            "created_utc": 1637556548.0,
            "replies": []
        },
        {
            "body": ">I’m a very personable person and I have a hard time being reserved. \n\nRestraint is a toughie for those of us who are expansive / exuberant.  When someone who falls in that category meets a like-minded person, it's like locating a long-lost sibling; it's wonderful.  Alas, the odds of finding people—who ‘get it’ and have the capacity & desire to honor that difference & pay it in kind—are very slim.  The odds are thinner yet where money is to change hands and posturing is rampant (SRs).\n\nAlso, I do not see a fundamental opposition between being personable and being reserved; only the way you erect & enforce your boundaries changes; that sounds fairly reasonable.  Anyone who'll appreciate your outgoing attributes will like them even more if they discover them fully over time.  Plus: they'll think themselves a genius for having discovered those treasures about your personality.  Ha!\n\n&#x200B;\n\n>Maybe I’ll take a friend on a pretend meet and greet to practice or something haha\n\nShoot me a message with penchants of yours and impulses you observe in yourself, and I'll reply with some feedback as to the way they might be construed in the bowl—if you want.",
            "author": null,
            "id": "hllvyyi",
            "parent_id": "t1_hllq6ix",
            "score": 1,
            "created_utc": 1637559865.0,
            "replies": []
        },
        {
            "body": "I said one way, if you have another point to add feel free to do so. I’m done explaining my stance on this particular subject",
            "author": "kikienen",
            "id": "hlmc0at",
            "parent_id": "t1_hlmbk3x",
            "score": 0,
            "created_utc": 1637572081.0,
            "replies": [
                {
                    "body": "And I said that this method is going to do nothing for the purpose of weeding out men like OP described.",
                    "author": "A-touchofreality",
                    "id": "hlmqgy6",
                    "parent_id": "t1_hlmc0at",
                    "score": 2,
                    "created_utc": 1637584000.0,
                    "replies": [
                        {
                            "body": "Not really because men like that are clearly cheap and not interest in investing in a future arrangement with a sugar baby.",
                            "author": "kikienen",
                            "id": "hlohqwr",
                            "parent_id": "t1_hlmqgy6",
                            "score": 3,
                            "created_utc": 1637611913.0,
                            "replies": [
                                {
                                    "body": "Oh c'mon...\n\nThis whole post wasn't about men being cheap, but men having weird expectations. Those things are not correlated. At all!\n\nEver heard of the Dubai potty?",
                                    "author": "A-touchofreality",
                                    "id": "hlom5qu",
                                    "parent_id": "t1_hlohqwr",
                                    "score": 1,
                                    "created_utc": 1637613697.0,
                                    "replies": [
                                        {
                                            "body": "My advice steal stands! Do you boo",
                                            "author": "kikienen",
                                            "id": "hlomnfo",
                                            "parent_id": "t1_hlom5qu",
                                            "score": 2,
                                            "created_utc": 1637613900.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This was my immediate thought. Once someone is obviously intentionally behaving poorly, why allow them to improve their approach and ensnare others in the future? \n\nI am missing the redeeming quality leading to why the feedback was even offered. OP is on point, I just disagree with providing such reasoning when another acts in bad faith.",
            "author": "Some_Random_SD",
            "id": "hlp1ahj",
            "parent_id": "t1_hlmpdjz",
            "score": 1,
            "created_utc": 1637619917.0,
            "replies": []
        },
        {
            "body": "And I said that this method is going to do nothing for the purpose of weeding out men like OP described.",
            "author": "A-touchofreality",
            "id": "hlmqgy6",
            "parent_id": "t1_hlmc0at",
            "score": 2,
            "created_utc": 1637584000.0,
            "replies": [
                {
                    "body": "Not really because men like that are clearly cheap and not interest in investing in a future arrangement with a sugar baby.",
                    "author": "kikienen",
                    "id": "hlohqwr",
                    "parent_id": "t1_hlmqgy6",
                    "score": 3,
                    "created_utc": 1637611913.0,
                    "replies": [
                        {
                            "body": "Oh c'mon...\n\nThis whole post wasn't about men being cheap, but men having weird expectations. Those things are not correlated. At all!\n\nEver heard of the Dubai potty?",
                            "author": "A-touchofreality",
                            "id": "hlom5qu",
                            "parent_id": "t1_hlohqwr",
                            "score": 1,
                            "created_utc": 1637613697.0,
                            "replies": [
                                {
                                    "body": "My advice steal stands! Do you boo",
                                    "author": "kikienen",
                                    "id": "hlomnfo",
                                    "parent_id": "t1_hlom5qu",
                                    "score": 2,
                                    "created_utc": 1637613900.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not really because men like that are clearly cheap and not interest in investing in a future arrangement with a sugar baby.",
            "author": "kikienen",
            "id": "hlohqwr",
            "parent_id": "t1_hlmqgy6",
            "score": 3,
            "created_utc": 1637611913.0,
            "replies": [
                {
                    "body": "Oh c'mon...\n\nThis whole post wasn't about men being cheap, but men having weird expectations. Those things are not correlated. At all!\n\nEver heard of the Dubai potty?",
                    "author": "A-touchofreality",
                    "id": "hlom5qu",
                    "parent_id": "t1_hlohqwr",
                    "score": 1,
                    "created_utc": 1637613697.0,
                    "replies": [
                        {
                            "body": "My advice steal stands! Do you boo",
                            "author": "kikienen",
                            "id": "hlomnfo",
                            "parent_id": "t1_hlom5qu",
                            "score": 2,
                            "created_utc": 1637613900.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh c'mon...\n\nThis whole post wasn't about men being cheap, but men having weird expectations. Those things are not correlated. At all!\n\nEver heard of the Dubai potty?",
            "author": "A-touchofreality",
            "id": "hlom5qu",
            "parent_id": "t1_hlohqwr",
            "score": 1,
            "created_utc": 1637613697.0,
            "replies": [
                {
                    "body": "My advice steal stands! Do you boo",
                    "author": "kikienen",
                    "id": "hlomnfo",
                    "parent_id": "t1_hlom5qu",
                    "score": 2,
                    "created_utc": 1637613900.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My advice steal stands! Do you boo",
            "author": "kikienen",
            "id": "hlomnfo",
            "parent_id": "t1_hlom5qu",
            "score": 2,
            "created_utc": 1637613900.0,
            "replies": []
        }
    ]
}