{
    "title": "Agree or disagree??",
    "post_id": "r2xvku",
    "post_url": "https://www.reddit.com/r/dankruto/comments/r2xvku/agree_or_disagree/",
    "author": "RPG-RAUPUNGA-MKYFY-_",
    "body": "",
    "url": "https://i.redd.it/dj31qkafi0281.jpg",
    "score": 5374,
    "upvote_ratio": 0.97,
    "created_utc": 1637964007.0,
    "num_comments": 170,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I didn't know people hated the Kazikage.\n\n\nBut now that I think about it, he is a dick",
            "author": "error5903",
            "id": "hm81j5l",
            "parent_id": "t3_r2xvku",
            "score": 307,
            "created_utc": 1637977200.0,
            "replies": [
                {
                    "body": "Yea I was thinking about why the fuck people could hate him, then I remembered Gaara and his childhood lol",
                    "author": "SMaxTH",
                    "id": "hm98aw1",
                    "parent_id": "t1_hm81j5l",
                    "score": 141,
                    "created_utc": 1638003485.0,
                    "replies": [
                        {
                            "body": "FUCK the Kazekage. \n\nAlso, who's the dude in the 3rd panel down?",
                            "author": "discerningpervert",
                            "id": "hm9obha",
                            "parent_id": "t1_hm98aw1",
                            "score": 55,
                            "created_utc": 1638016884.0,
                            "replies": [
                                {
                                    "body": "He’s a piece of shit who yells at naruto for looking at the shit he was selling. Basically call him a broke bitch in front of a ton of people and Hinata tries to defend him or something and her keeper stops her",
                                    "author": "Dear_Field_7182",
                                    "id": "hm9oupk",
                                    "parent_id": "t1_hm9obha",
                                    "score": 92,
                                    "created_utc": 1638017255.0,
                                    "replies": [
                                        {
                                            "body": "Naruto should’ve thrown a rasengan up that guys butthole",
                                            "author": "funny_gus",
                                            "id": "hmaruhm",
                                            "parent_id": "t1_hm9oupk",
                                            "score": 4,
                                            "created_utc": 1638036396.0,
                                            "replies": [
                                                {
                                                    "body": "In a separate thread Op was talking about if a rasengan can kill and I think this guy should be the test dummy. I was saying he’s mastered it so he could probably do something similar in all 5 chakra natures and he should test them all on this guy.",
                                                    "author": "Dear_Field_7182",
                                                    "id": "hmbm8wd",
                                                    "parent_id": "t1_hmaruhm",
                                                    "score": 2,
                                                    "created_utc": 1638049172.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "He was from a flashback that Naruto had a few times. In it the guy gets angry that Naruto is in his shop. Naruto was just looking at a cool mask. So the guy says, “oh? You want that? Take it!”\n\nHe pushes Naruto down and just fucking hurls it at his head. Then he gets a crowd of people to join in and they all start telling Naruto how much they hate him. Fun guy.\n\nEdit: Here’s the scene in question. Now that I think about it, I think this was part of a small filler three-parter after the Pain arc that is basically just Iruka looking back on his life up to that point and acknowledging how far Naruto has come. It’s actually very wholesome, I’d recommend it.\n\nhttps://youtu.be/POfboUjdpn4",
                                    "author": "BiSaxual",
                                    "id": "hm9p443",
                                    "parent_id": "t1_hm9obha",
                                    "score": 36,
                                    "created_utc": 1638017431.0,
                                    "replies": [
                                        {
                                            "body": "Ngl that stuff was at the beginning of Naruto I think.",
                                            "author": "darknioss",
                                            "id": "hma5dgg",
                                            "parent_id": "t1_hm9p443",
                                            "score": 4,
                                            "created_utc": 1638026527.0,
                                            "replies": [
                                                {
                                                    "body": "You’re probably right. There’s so many damn flashbacks in filler that it all just runs together lol",
                                                    "author": "BiSaxual",
                                                    "id": "hma8vac",
                                                    "parent_id": "t1_hma5dgg",
                                                    "score": 3,
                                                    "created_utc": 1638028158.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Same",
                            "author": "error5903",
                            "id": "hmajg7d",
                            "parent_id": "t1_hm98aw1",
                            "score": 1,
                            "created_utc": 1638032879.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It baffles my mind how Naruto wanted to save his village after they treated him like that almost all his life",
            "author": null,
            "id": "hm7bzu4",
            "parent_id": "t3_r2xvku",
            "score": 551,
            "created_utc": 1637964594.0,
            "replies": [
                {
                    "body": "That’s kinda the point I think\n\nNaruto had all the right in the world to hate the village and even want it destroyed but instead he manifested those feelings into wanting to prove them wrong by becoming the hokage, someone they would *have* to respect whether they liked it or not \n\nAnd he also knew that there were people who weren’t like those other villagers and would support him, like iruka.\n\nAnd i think it’s all supposed to be a big parallel to sasuke, who also has his reasons for hating the village, and people who want to support him as well, but instead choosing revenge falling into the “cycle of hatred” that’s brought up often in shippuden",
                    "author": "rad_dude124",
                    "id": "hm8fchs",
                    "parent_id": "t1_hm7bzu4",
                    "score": 35,
                    "created_utc": 1637984280.0,
                    "replies": []
                },
                {
                    "body": "well this was literally from a filler episode...Naruto was oastrized which is bad enough but I do not recall any instance in the manga of him being physically abused by anyone (unless you include Sakura and Sasuke)\n\nMost of the villagers are innocent so it does not baffle me at all.",
                    "author": null,
                    "id": "hm7jlkh",
                    "parent_id": "t1_hm7bzu4",
                    "score": 200,
                    "created_utc": 1637968228.0,
                    "replies": [
                        {
                            "body": "Naruto was  PG shounen series ofcourse they wouldn't show that much of what Naruto truly faced ,  realistically speaking Naruto could have turned evil and went rogue before Sasuke even thought about it  , its his kind heart and him being an \"idiot\" what stopped this plot from happening  \n\n\nHonestly I even question if Naruto was brainwashed to stay loyal to his village at some point",
                            "author": null,
                            "id": "hm7o0jw",
                            "parent_id": "t1_hm7jlkh",
                            "score": 194,
                            "created_utc": 1637970381.0,
                            "replies": [
                                {
                                    "body": "Tbh the village reaction to Pain destroying the village looking for Naruto could’ve been really bad. Sure Naruto beat him and he made friends in the village, but the other villagers easily could’ve turned on him since Pain only destroyed the village because he was looking for Naruto",
                                    "author": "britipinojeff",
                                    "id": "hm7vhim",
                                    "parent_id": "t1_hm7o0jw",
                                    "score": 86,
                                    "created_utc": 1637974128.0,
                                    "replies": [
                                        {
                                            "body": "Hmm at this point in the story he’s become respected but since Pain literally killed Jiraiya who the village ninjas seems to respect, they wouldn’t care who he’s after",
                                            "author": "Sealking13",
                                            "id": "hm7z2d0",
                                            "parent_id": "t1_hm7vhim",
                                            "score": 56,
                                            "created_utc": 1637975949.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Which wasn't true, pain hated konoha cause of danzo",
                                            "author": "Conscious-News-4433",
                                            "id": "hm9185m",
                                            "parent_id": "t1_hm7vhim",
                                            "score": 13,
                                            "created_utc": 1637997769.0,
                                            "replies": [
                                                {
                                                    "body": "I think he means the leaf villagers would like naruto since he got revenge for jiraiya by defeating pain, despite the fact pain destroyed konoha looking for naruto",
                                                    "author": null,
                                                    "id": "hm9o95p",
                                                    "parent_id": "t1_hm9185m",
                                                    "score": 10,
                                                    "created_utc": 1638016841.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "TV Execs: “We can’t show child abuse that’s too far. Anyway for the next part of the series, let’s show all these kids participating in World War 3 as child soldiers and having one of them get brutally crushed and have his crush stabbed by his best friend.”",
                                    "author": "SeductivePillowcase",
                                    "id": "hm7u0mb",
                                    "parent_id": "t1_hm7o0jw",
                                    "score": 67,
                                    "created_utc": 1637973376.0,
                                    "replies": [
                                        {
                                            "body": "It would hit too close to home for people so I do get it tbh",
                                            "author": "The_New_New",
                                            "id": "hm8utgr",
                                            "parent_id": "t1_hm7u0mb",
                                            "score": 10,
                                            "created_utc": 1637993285.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Naruto isn't an idiot at all. He took that persona to cope, that's why all the sad swing flashbacks lol. If he hadn't taken that, and for his good heart, he likely would've been a super Gaara.\n\nI also want to give giant credit to Minato for doing a pro sealing jutsu on Naruto with the nine tails and not a lame one. Gaara also couldn't control his beast and commonly slayed people, while Naruto had no corruption until much later.",
                                    "author": "Slimxshadyx",
                                    "id": "hm7tgwq",
                                    "parent_id": "t1_hm7o0jw",
                                    "score": 71,
                                    "created_utc": 1637973105.0,
                                    "replies": [
                                        {
                                            "body": "Naruto is definitely a idiot lol. Its a common anime thing, they're stupid af but also smart sometimes? look at Luffy or Goku",
                                            "author": "ToyrewaDokoDeska",
                                            "id": "hm80xcc",
                                            "parent_id": "t1_hm7tgwq",
                                            "score": 47,
                                            "created_utc": 1637976892.0,
                                            "replies": [
                                                {
                                                    "body": "Imbecile battle savant. Naruto, Ichigo, Goku... ancient trope tbh",
                                                    "author": "eRHachan",
                                                    "id": "hm9koy3",
                                                    "parent_id": "t1_hm80xcc",
                                                    "score": 10,
                                                    "created_utc": 1638014096.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thank you, yes perfect title lol ill definitely use this",
                                                            "author": "ToyrewaDokoDeska",
                                                            "id": "hm9o3ok",
                                                            "parent_id": "t1_hm9koy3",
                                                            "score": 5,
                                                            "created_utc": 1638016735.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Ichigo wasn't really an idiot though. At least not to the extent of Naruto and Goku.",
                                                            "author": "monhunt",
                                                            "id": "hma6mss",
                                                            "parent_id": "t1_hm9koy3",
                                                            "score": 4,
                                                            "created_utc": 1638027133.0,
                                                            "replies": [
                                                                {
                                                                    "body": "He was a bonafide punk who punched first and asked second. He wasn't brain-damaged like Goku, but he was pretty close.",
                                                                    "author": "eRHachan",
                                                                    "id": "hmaphyy",
                                                                    "parent_id": "t1_hma6mss",
                                                                    "score": 4,
                                                                    "created_utc": 1638035421.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I think you've been reading too many fanfics. Hes an idiot. Hes a standard Shonen MC who has insanly good instincts. We see this in the series when he's alone, and with others",
                                            "author": "xNuxIsGod",
                                            "id": "hm8nukz",
                                            "parent_id": "t1_hm7tgwq",
                                            "score": 16,
                                            "created_utc": 1637989009.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Minato could have sealed the good side of the Kyuubi in his son, but he gave him bad side lmao.",
                                            "author": "SaveThemKillYourself",
                                            "id": "hm80ik8",
                                            "parent_id": "t1_hm7tgwq",
                                            "score": -16,
                                            "created_utc": 1637976687.0,
                                            "replies": [
                                                {
                                                    "body": "Naruto was sealed with Yang-Kurama. Yang = positive, warm, light, and a slew of other things. Yin is the \"negative\" one.",
                                                    "author": "Catlover18",
                                                    "id": "hm80ync",
                                                    "parent_id": "t1_hm80ik8",
                                                    "score": 26,
                                                    "created_utc": 1637976910.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "He did though. The 9 tails is a massive ball of hate and distain for humans. The part Naruto got was the good side. He still had all his memory's, hence his dislike of humans and unwillingness to help them, but he never actively tried to harm them unless they bothered him or Naruto personally.",
                                                    "author": "xNuxIsGod",
                                                    "id": "hm8npbc",
                                                    "parent_id": "t1_hm80ik8",
                                                    "score": 10,
                                                    "created_utc": 1637988924.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I like to think that some of the filler like these few episodes and some closing are cannon like the one when ramen guy gave him free ramen whe he was little",
                                    "author": "CaptainBlaze22",
                                    "id": "hm8supx",
                                    "parent_id": "t1_hm7o0jw",
                                    "score": 8,
                                    "created_utc": 1637992029.0,
                                    "replies": []
                                },
                                {
                                    "body": "The village has a clan of mind rapists. Naruto is an idiot but also a savant.\n\nHim being brainwashed is supported by the setting quite handily. Basically, a certainty.",
                                    "author": "Inimposter",
                                    "id": "hm9e70s",
                                    "parent_id": "t1_hm7o0jw",
                                    "score": 4,
                                    "created_utc": 1638008563.0,
                                    "replies": []
                                },
                                {
                                    "body": "you could say that about the show in general and not just Naruto.  even sasuke's trauma of being a genocide victim is arguably tame.then we have itachi who is probably the most unhuman character in the whole show, no wonder edgelords stan him so hard.",
                                    "author": null,
                                    "id": "hm82re8",
                                    "parent_id": "t1_hm7o0jw",
                                    "score": 8,
                                    "created_utc": 1637977813.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Wtf it being filler have to with anything? It’s still a controversial episode. Doesn’t mean people can’t talk about it or discuss it.",
                            "author": "tonytonydavis",
                            "id": "hm8humw",
                            "parent_id": "t1_hm7jlkh",
                            "score": 5,
                            "created_utc": 1637985622.0,
                            "replies": []
                        },
                        {
                            "body": "Bullies",
                            "author": "1313goo",
                            "id": "hm7uya4",
                            "parent_id": "t1_hm7jlkh",
                            "score": 2,
                            "created_utc": 1637973856.0,
                            "replies": []
                        },
                        {
                            "body": "This shows how shitty hiruzen was as hokage. Allowing people to mistreat a guy who had the power to raze the village again, instead of trying to fit him in the village, especially since he had no fault in what happened, was just dumb.",
                            "author": "ravagerslb",
                            "id": "hm9qzcc",
                            "parent_id": "t1_hm7jlkh",
                            "score": 2,
                            "created_utc": 1638018667.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I get why. I was treated like crap my whole life and still tried to help people. When you are treated bad you just want something good in life. \n\nYou still try to hang onto hope and that people will change. Or that you can meet someone different who is good.\n\n You don't let yourself turn into the kind of person who'd hurt others so you stay good. \n\nNaruto is a good person and rises above it all. He's the bigger person. I think he's also so optimistic and wants people to change for the better/believes they will.",
                    "author": "Aandiarie_QueenofFa",
                    "id": "hm8lkts",
                    "parent_id": "t1_hm7bzu4",
                    "score": 14,
                    "created_utc": 1637987706.0,
                    "replies": [
                        {
                            "body": "This! You explained it so well amazing",
                            "author": "seahunter22",
                            "id": "hma2cao",
                            "parent_id": "t1_hm8lkts",
                            "score": 2,
                            "created_utc": 1638025059.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Tbf, he was so busy craving that other pay attention to him/love him, he ignored his anget at the village for it. Then he did address that part of him with Dark Naruto. Plus the villagers did genuinly change to love him by the time he brought Tsunade back.",
                    "author": "Few_Pay_5313",
                    "id": "hm85uui",
                    "parent_id": "t1_hm7bzu4",
                    "score": 7,
                    "created_utc": 1637979380.0,
                    "replies": []
                },
                {
                    "body": "I honestly wish things would have ended after the Pain arc without him becoming Hokage. I know that him becoming Hokage was sort of his way to flip the bird to the village and go “now you all have to respect me!”, but I think it would have been more meaningful for him to realize that he doesn’t need to be Hokage to mean something and that he did earn the respect of the village. \n\nThere’s a ton of other reasons why it should have ended after the Pain arc but that’s one of my top ones",
                    "author": null,
                    "id": "hm8qmig",
                    "parent_id": "t1_hm7bzu4",
                    "score": 5,
                    "created_utc": 1637990653.0,
                    "replies": []
                },
                {
                    "body": "It baffles my mind even harder when Hiruzen and everyone in Konoha knew how Kushina & Minato sacrificed themselves for Konoha and they still treated Naruto as shit. Sandaime practically abandoned Naruto too, only giving him monthly stipend, which isn't even enough. The villains in Naruto were right. Destroy this effing village.",
                    "author": "000vi",
                    "id": "hm8v9q7",
                    "parent_id": "t1_hm7bzu4",
                    "score": 8,
                    "created_utc": 1637993583.0,
                    "replies": []
                },
                {
                    "body": "He wanted acceptance, not vengeance. His whole character was based off of persevering through effort and positivity. Sasuke was his opposite because he embraced the negativity and the two were destined to clash.",
                    "author": "WickedRedemption",
                    "id": "hm86qvm",
                    "parent_id": "t1_hm7bzu4",
                    "score": 4,
                    "created_utc": 1637979830.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Underrated opinion",
            "author": "OrdinaryNail417",
            "id": "hm7cxnz",
            "parent_id": "t3_r2xvku",
            "score": 241,
            "created_utc": 1637965044.0,
            "replies": []
        },
        {
            "body": "There are like super villains such as Madara, Obito, Kaguya etc.. But noone can be worse than those bullies from Konoha. Why it is even normal to treat people like they did with Naruto, I guess Pain wasn't so wrong about destroying the village in the first place.",
            "author": "HRBKGames",
            "id": "hm83r8i",
            "parent_id": "t3_r2xvku",
            "score": 72,
            "created_utc": 1637978316.0,
            "replies": [
                {
                    "body": "Dunno why they just goes extra way out to be an extra dick toward Naruto just because he's jinchuriki and dunno what's Hiruzen doing if he's both letting Naruto know as jinchuriki while neglecting him as Minato son (sound weird but just let everyone not know he's Minato son).",
                    "author": "Nightfans",
                    "id": "hm8nr4q",
                    "parent_id": "t1_hm83r8i",
                    "score": 14,
                    "created_utc": 1637988953.0,
                    "replies": [
                        {
                            "body": "They didn't let them know he was Minato's son because those who hated his guts are gonna come for Naruto.",
                            "author": "No2AccOfSumUser",
                            "id": "hm9fry1",
                            "parent_id": "t1_hm8nr4q",
                            "score": 7,
                            "created_utc": 1638009943.0,
                            "replies": [
                                {
                                    "body": "But yeah it's fine to tell the entire public that he carries the strongest tailed beast\n\nYep nobody would go after him 100%",
                                    "author": "vedat07taskiran",
                                    "id": "hmb2a4l",
                                    "parent_id": "t1_hm9fry1",
                                    "score": 4,
                                    "created_utc": 1638040808.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Tbf, I would be scared of Naruto if I was an adult in konoha, but I wouldn't bully him, maybe I would stay a bit away but I definitely wouldn't bully him like tf that's the last thing you want to happen you don't want the kid to suddenly transform into nine tails in the middle of the village after you bullied him would you",
                    "author": "Konoha__Shinobi",
                    "id": "hm96tls",
                    "parent_id": "t1_hm83r8i",
                    "score": 3,
                    "created_utc": 1638002238.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't even know who that guy is.  Can someone fill me in?",
            "author": "TheWinterPrince52",
            "id": "hm7s6tj",
            "parent_id": "t3_r2xvku",
            "score": 130,
            "created_utc": 1637972458.0,
            "replies": [
                {
                    "body": "A shop owner who kicked Naruto out of his shop just for browsing and threw a mask at his head",
                    "author": "Yogami_asura",
                    "id": "hm7ss8e",
                    "parent_id": "t1_hm7s6tj",
                    "score": 238,
                    "created_utc": 1637972757.0,
                    "replies": [
                        {
                            "body": "Yeah that'd do it.",
                            "author": "TheWinterPrince52",
                            "id": "hm7vt7j",
                            "parent_id": "t1_hm7ss8e",
                            "score": 77,
                            "created_utc": 1637974292.0,
                            "replies": []
                        },
                        {
                            "body": "He ended up giving Naruto the mask for free. That should put him just below Teuchi!",
                            "author": "vvmello",
                            "id": "hm87ktv",
                            "parent_id": "t1_hm7ss8e",
                            "score": 53,
                            "created_utc": 1637980248.0,
                            "replies": [
                                {
                                    "body": "Then Naruto wears the mask thrown at him to become an ANBU vigilante",
                                    "author": "Yogami_asura",
                                    "id": "hm8fea1",
                                    "parent_id": "t1_hm87ktv",
                                    "score": 38,
                                    "created_utc": 1637984306.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Goddamn hated that guy, fkin bastard",
                            "author": "Konoha__Shinobi",
                            "id": "hm96up7",
                            "parent_id": "t1_hm7ss8e",
                            "score": 5,
                            "created_utc": 1638002262.0,
                            "replies": []
                        },
                        {
                            "body": "Can you tell me the episode number",
                            "author": "flying_jesus",
                            "id": "hmaittv",
                            "parent_id": "t1_hm7ss8e",
                            "score": 2,
                            "created_utc": 1638032606.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Unless I'm wrong, the shopkeep in the last picture literally threw Naruto out of his shop even though Naruto was just looking at the masks",
                    "author": "haloman711",
                    "id": "hm7ubs5",
                    "parent_id": "t1_hm7s6tj",
                    "score": 42,
                    "created_utc": 1637973536.0,
                    "replies": [
                        {
                            "body": "Naruto even had money and was gonna buy it 😭😭",
                            "author": "BlackoutGaming1",
                            "id": "hm85qep",
                            "parent_id": "t1_hm7ubs5",
                            "score": 43,
                            "created_utc": 1637979316.0,
                            "replies": []
                        },
                        {
                            "body": "I'm stupid af  I thought the post was talking about how everyone in the village hated naruto",
                            "author": "hereforthehentai6969",
                            "id": "hm7y5aw",
                            "parent_id": "t1_hm7ubs5",
                            "score": 4,
                            "created_utc": 1637975482.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "The first pic is danzo second Garras father and third is naruto",
                    "author": "hereforthehentai6969",
                    "id": "hm7sef2",
                    "parent_id": "t1_hm7s6tj",
                    "score": 15,
                    "created_utc": 1637972562.0,
                    "replies": [
                        {
                            "body": "LMFAO not Naruto, it's talking about the shop guy who yelled at him about looking at the masks. I hate that guy",
                            "author": "Slimxshadyx",
                            "id": "hm7tu05",
                            "parent_id": "t1_hm7sef2",
                            "score": 26,
                            "created_utc": 1637973284.0,
                            "replies": []
                        },
                        {
                            "body": "Are you the one joking, or was Naruto the subject the whole time?  I thought we were talking about the dude Naruto seems to be talking to.",
                            "author": "TheWinterPrince52",
                            "id": "hm7sn9l",
                            "parent_id": "t1_hm7sef2",
                            "score": 4,
                            "created_utc": 1637972686.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It's Naruto, man",
                    "author": "psychoticchicken1",
                    "id": "hm81mew",
                    "parent_id": "t1_hm7s6tj",
                    "score": 3,
                    "created_utc": 1637977245.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And those two girls that was talking shit when Naruto failed the transformation test.",
            "author": "autonomousfailure",
            "id": "hm85zx1",
            "parent_id": "t3_r2xvku",
            "score": 23,
            "created_utc": 1637979452.0,
            "replies": []
        },
        {
            "body": "Yeah fuck that guy",
            "author": "Psychopathetic-",
            "id": "hm7zfj9",
            "parent_id": "t3_r2xvku",
            "score": 18,
            "created_utc": 1637976134.0,
            "replies": []
        },
        {
            "body": "No i still believe danzo was just a dickhead.\nI mean 90% of the fandom was celebrating his death.",
            "author": "LIMELIMBO",
            "id": "hm8mtql",
            "parent_id": "t3_r2xvku",
            "score": 12,
            "created_utc": 1637988416.0,
            "replies": []
        },
        {
            "body": "Imagine being a asshole to a kid who wanted a buy a mask",
            "author": "JakeZero6969",
            "id": "hm856un",
            "parent_id": "t3_r2xvku",
            "score": 18,
            "created_utc": 1637979035.0,
            "replies": []
        },
        {
            "body": "How is garaas dad more hated he was a shitty father but danzo caused so much shit",
            "author": "Omarplay2",
            "id": "hm8pred",
            "parent_id": "t3_r2xvku",
            "score": 8,
            "created_utc": 1637990126.0,
            "replies": [
                {
                    "body": "He was a shitty dad but had a good redemption.",
                    "author": "OneHellOfAPotato",
                    "id": "hma2x3g",
                    "parent_id": "t1_hm8pred",
                    "score": 2,
                    "created_utc": 1638025347.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If it counts, Kawaki's dad?",
            "author": "TreeCitizen",
            "id": "hm8cfc2",
            "parent_id": "t3_r2xvku",
            "score": 8,
            "created_utc": 1637982736.0,
            "replies": [
                {
                    "body": "Kawaki's dads* except Naruto ofc.",
                    "author": "Tarkik_Vatsa",
                    "id": "hm8xymv",
                    "parent_id": "t1_hm8cfc2",
                    "score": 2,
                    "created_utc": 1637995408.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Danzo believed in making the village stronger through harsh means but nonetheless cared about the village. \nThe Kazekage may have pitted the only love Gaara had against him but it was to crush the fear of loss in Gaaras heart. Nonetheless he wanted gaara to be stronger\nThat clown hated a kid because of something the kid didnt even understand had happened.",
            "author": "Jlangley414",
            "id": "hm93c33",
            "parent_id": "t3_r2xvku",
            "score": 5,
            "created_utc": 1637999410.0,
            "replies": []
        },
        {
            "body": "Incorrect, not a picture of Sakura",
            "author": "CobaltCrusader123",
            "id": "hm7kay0",
            "parent_id": "t3_r2xvku",
            "score": 40,
            "created_utc": 1637968568.0,
            "replies": [
                {
                    "body": "I like sakura",
                    "author": "BrandExe",
                    "id": "hm7t5ls",
                    "parent_id": "t1_hm7kay0",
                    "score": 25,
                    "created_utc": 1637972945.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "hm812ek",
                            "parent_id": "t1_hm7t5ls",
                            "score": -6,
                            "created_utc": 1637976963.0,
                            "replies": [
                                {
                                    "body": "Those who thinks Hinata is stronger have downs",
                                    "author": "aicchisenpai",
                                    "id": "hm84r5c",
                                    "parent_id": "t1_hm812ek",
                                    "score": -15,
                                    "created_utc": 1637978813.0,
                                    "replies": [
                                        {
                                            "body": "I mean, she does have SOSP chakra",
                                            "author": "Conscious-News-4433",
                                            "id": "hm91j0b",
                                            "parent_id": "t1_hm84r5c",
                                            "score": 3,
                                            "created_utc": 1637998003.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Sakura is obv. stronger, but Hinata is better written",
                                            "author": "Economy_Ice5190",
                                            "id": "hm972gu",
                                            "parent_id": "t1_hm84r5c",
                                            "score": 3,
                                            "created_utc": 1638002440.0,
                                            "replies": [
                                                {
                                                    "body": "The number of my downvotes says otherwise. And Hinata isn’t better written. She kept saying Naruto this Naruto that the entire time. She only stopped doing that when Boruto exists. The author just suck at writing female characters",
                                                    "author": "aicchisenpai",
                                                    "id": "hm9jwd3",
                                                    "parent_id": "t1_hm972gu",
                                                    "score": -1,
                                                    "created_utc": 1638013442.0,
                                                    "replies": [
                                                        {
                                                            "body": "Hinata still feels much betfer written than Sakura though because she atleast had a compelling backstory. I agree with her not being a well written character completely though. Also, since Sakura was a main character, we definitely expected much more from her in comparison to Hinata.",
                                                            "author": "Tarkik_Vatsa",
                                                            "id": "hm9s6ap",
                                                            "parent_id": "t1_hm9jwd3",
                                                            "score": 2,
                                                            "created_utc": 1638019413.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "“Most people rejected his message. \nThey hated him because he told them the truth.”",
                                            "author": "AstronautAmazing7046",
                                            "id": "hm8hyp0",
                                            "parent_id": "t1_hm84r5c",
                                            "score": 0,
                                            "created_utc": 1637985685.0,
                                            "replies": [
                                                {
                                                    "body": "Which message?",
                                                    "author": "IAmYoDaddyDuh",
                                                    "id": "hm8nfcl",
                                                    "parent_id": "t1_hm8hyp0",
                                                    "score": 3,
                                                    "created_utc": 1637988761.0,
                                                    "replies": [
                                                        {
                                                            "body": "Kishomoto’s message since he confirmed that she’s stronger, facts over feelings",
                                                            "author": "AstronautAmazing7046",
                                                            "id": "hma9j49",
                                                            "parent_id": "t1_hm8nfcl",
                                                            "score": 1,
                                                            "created_utc": 1638028457.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Sakura is stronger than Hinata?",
                                                                    "author": "IAmYoDaddyDuh",
                                                                    "id": "hmaiw68",
                                                                    "parent_id": "t1_hma9j49",
                                                                    "score": 0,
                                                                    "created_utc": 1638032634.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yes, she surpassed Tsunade and the author said she’s the strongest Kunoichi in the leaf. Hinata has close range attacks to stop chakra, but sakura is faster and is physically stronger so it’s unlike hinata would even touch her . But even if hinata hit a chakra point, kakashi already mentioned sakuras chakra control was better than naruto and sasukes. This doesn’t mean she’s stronger than them though, Chakra control is her strong point which is why hinata who stops chakra is no match for her as sakura can control it. \n\nShe’s the only one besides tsunade able to do Strength Of A Hundred Seal and summon Katsuuya, now if we look a tsunade who did those things too, out of all the kages fighting against madara, it’s her strength he was more impressed by, she was the last one conscious and gave her left over strength to heal the other Kages. Say if hinata were to even match her speed and stop a chakra point, sakura’s technique means she stores an abundance of chakra in her seal and can reactivate it in her body, hinata can’t cut of her chakra as she can supply it again and again. Sakura is the same person who got stabbed by madara (as a decoy) and just healed herself from it, the same day sasuke almost died from madaras stab before he was given god-like powers. Hinata would not survive from a stab like that. It’s clear that sakura could end her and would be the last one standing.",
                                                                            "author": "AstronautAmazing7046",
                                                                            "id": "hmam12q",
                                                                            "parent_id": "t1_hmaiw68",
                                                                            "score": 1,
                                                                            "created_utc": 1638033982.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I loved him in The filler with Minato",
            "author": "Alcides_246",
            "id": "hm8c3k6",
            "parent_id": "t3_r2xvku",
            "score": 3,
            "created_utc": 1637982563.0,
            "replies": [
                {
                    "body": "what one",
                    "author": null,
                    "id": "hm94xiw",
                    "parent_id": "t1_hm8c3k6",
                    "score": -1,
                    "created_utc": 1638000671.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He was the most hated how dare he hurt my baby Naruto 🙄🖕🏻😤",
            "author": "_bakugou-_-",
            "id": "hm8psrl",
            "parent_id": "t3_r2xvku",
            "score": 4,
            "created_utc": 1637990149.0,
            "replies": []
        },
        {
            "body": "People hate Gaara's dad, Rasa? Yeah he was a bad father and put Shukaku inside Gaara and such, but everything he did was to make Sunagakure relevant and prosperous. He wasn't evil, just... misguided",
            "author": "XanthousRebel",
            "id": "hm8tozg",
            "parent_id": "t3_r2xvku",
            "score": 4,
            "created_utc": 1637992553.0,
            "replies": [
                {
                    "body": "Same could be said for Danzo",
                    "author": "coopstar777",
                    "id": "hm984d9",
                    "parent_id": "t1_hm8tozg",
                    "score": 2,
                    "created_utc": 1638003328.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He was even a piece of shit in the infinite tsukoyomi thats how much if a dick he was",
            "author": "AkatsukiGaara",
            "id": "hm8cogg",
            "parent_id": "t3_r2xvku",
            "score": 3,
            "created_utc": 1637982870.0,
            "replies": []
        },
        {
            "body": "Why ya hating on Gaara's dad?",
            "author": "shopskasalata1",
            "id": "hm81bux",
            "parent_id": "t3_r2xvku",
            "score": 5,
            "created_utc": 1637977095.0,
            "replies": [
                {
                    "body": "He made his son a jinchuriki  but unlike Minato, who did it since he knew Naruto would have to face Obito he did it to make him a weapon for the Sand. That lead to him getting the Naruto treatment, then he made Gaara's Iruka try to kill him.",
                    "author": "Few_Pay_5313",
                    "id": "hm863rr",
                    "parent_id": "t1_hm81bux",
                    "score": 23,
                    "created_utc": 1637979506.0,
                    "replies": [
                        {
                            "body": "Not to mention \"you made friends?!\"",
                            "author": null,
                            "id": "hm86evp",
                            "parent_id": "t1_hm863rr",
                            "score": 23,
                            "created_utc": 1637979662.0,
                            "replies": [
                                {
                                    "body": "I still like Gaaras down",
                                    "author": "IAmYoDaddyDuh",
                                    "id": "hm8na3m",
                                    "parent_id": "t1_hm86evp",
                                    "score": 2,
                                    "created_utc": 1637988678.0,
                                    "replies": []
                                },
                                {
                                    "body": "To be fair, Gaara last the Kazekage saw him was a bit... unhinged (due to the dad's fault obviously)",
                                    "author": "The_New_New",
                                    "id": "hm8v0gl",
                                    "parent_id": "t1_hm86evp",
                                    "score": 2,
                                    "created_utc": 1637993413.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I hate Gaara's dad as much as any other person here but IIRC making Gaara a Jinchuriki was a decision which everyone in the council told him to make. Granny Chiyo mentioned something like this in the first arc of Shippuden. Gaara's dad looked a good husband and dad before the birth of Gaara. Maybe it was the death of Gaara's mom that turned him into a complete asshole.",
                            "author": "Tarkik_Vatsa",
                            "id": "hm8y89j",
                            "parent_id": "t1_hm863rr",
                            "score": 3,
                            "created_utc": 1637995593.0,
                            "replies": [
                                {
                                    "body": "Still doesnt excuse SENDING ASSASSINS AFTER YOUR SON",
                                    "author": "Few_Pay_5313",
                                    "id": "hm8zudt",
                                    "parent_id": "t1_hm8y89j",
                                    "score": 3,
                                    "created_utc": 1637996733.0,
                                    "replies": [
                                        {
                                            "body": "I completely agree. And that too sending the only person who showed love to Gaara.",
                                            "author": "Tarkik_Vatsa",
                                            "id": "hm90ims",
                                            "parent_id": "t1_hm8zudt",
                                            "score": 2,
                                            "created_utc": 1637997236.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Horrifically abusive",
                    "author": "bealtimint",
                    "id": "hm8diae",
                    "parent_id": "t1_hm81bux",
                    "score": 6,
                    "created_utc": 1637983305.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why are you hating on naruto, man",
            "author": "psychoticchicken1",
            "id": "hm81qx0",
            "parent_id": "t3_r2xvku",
            "score": 4,
            "created_utc": 1637977307.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hm82qkc",
                    "parent_id": "t1_hm81qx0",
                    "score": -3,
                    "created_utc": 1637977802.0,
                    "replies": [
                        {
                            "body": "r/wooosh",
                            "author": "psychoticchicken1",
                            "id": "hm835y5",
                            "parent_id": "t1_hm82qkc",
                            "score": 7,
                            "created_utc": 1637978015.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Who got angry seeing that",
            "author": "ok_naruto_uzumaki",
            "id": "hm8ssr8",
            "parent_id": "t3_r2xvku",
            "score": 2,
            "created_utc": 1637991994.0,
            "replies": []
        },
        {
            "body": "Oh u meant the shopkeeper right, I thought it was Naruto...",
            "author": "hafiz_muhd_",
            "id": "hm91gab",
            "parent_id": "t3_r2xvku",
            "score": 2,
            "created_utc": 1637997944.0,
            "replies": [
                {
                    "body": "Oh u meanteth the shopkeeper right, i bethought t wast naruto\n\n***\n\n\n\n^(I am a bot and I swapp'd some of thy words with Shakespeare words.)\n\nCommands: `!ShakespeareInsult`, `!fordo`, `!optout`",
                    "author": "Shakespeare-Bot",
                    "id": "hm91ha0",
                    "parent_id": "t1_hm91gab",
                    "score": 2,
                    "created_utc": 1637997966.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I feel like gaaras dad was definitely a piece of shit, but there just wasn’t a whole lot of time spent on him in the show to call him the most hated character",
            "author": "Low-Speaker228",
            "id": "hm98fse",
            "parent_id": "t3_r2xvku",
            "score": 2,
            "created_utc": 1638003601.0,
            "replies": []
        },
        {
            "body": "The guy that denied bread to nagato \n\nHe is true evil",
            "author": "Spoopy_Doul",
            "id": "hm9afcf",
            "parent_id": "t3_r2xvku",
            "score": 2,
            "created_utc": 1638005318.0,
            "replies": []
        },
        {
            "body": "Well i'll just leave this comment here.....\n\n\n**I hate Hiruzen Sarutobi more than Danzo**",
            "author": "ShadowGamer0953",
            "id": "hm9eswb",
            "parent_id": "t3_r2xvku",
            "score": 2,
            "created_utc": 1638009097.0,
            "replies": []
        },
        {
            "body": "I don’t understand sauske isn’t in that last photo",
            "author": "MajorSaltyJenkins",
            "id": "innzttl",
            "parent_id": "t3_r2xvku",
            "score": 2,
            "created_utc": 1662685122.0,
            "replies": []
        },
        {
            "body": "How is danzo less hated than kazekage?",
            "author": "brzoza3",
            "id": "hm7z09k",
            "parent_id": "t3_r2xvku",
            "score": 2,
            "created_utc": 1637975919.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hm7lm2f",
            "parent_id": "t3_r2xvku",
            "score": -8,
            "created_utc": 1637969203.0,
            "replies": [
                {
                    "body": "Ok Danzo was a selfish man who would do anything for power. When pain was slaughtering the leaf village, he wanted his subordinates to sit back and do nothing to help. He wanted leaf village to be destroyed only because that would increase his chances of becoming a hokage. He didn't value lives of people. He thought that the people pain slaughtered were merely sacrifices necessary to make him hokage. Also he lead an organisation in which people were taught to bury their feelings. Shinobi were not mere weapons they were people too. Earlier generations may have liked these methods, but that was an era of war. The world changed but Danzo refused to change with it. Why was he even alive this long ! Just fck Danzo all my homies in konoha hate Danzo",
                    "author": "RPG-RAUPUNGA-MKYFY-_",
                    "id": "hm7mmf4",
                    "parent_id": "t1_hm7lm2f",
                    "score": 54,
                    "created_utc": 1637969698.0,
                    "replies": [
                        {
                            "body": "You literally explained why he is great villain",
                            "author": "zerquet",
                            "id": "hm7v09q",
                            "parent_id": "t1_hm7mmf4",
                            "score": 2,
                            "created_utc": 1637973884.0,
                            "replies": [
                                {
                                    "body": "Honestly to me a great villain is someone that you can see where they came from and why they'd think what they're doing is the right thing to do.\n\nItachi killed his clan for the sake of the village \n\nMadara wanted a perfect world for everyone\n\nPain was sick of his village being a battleground and wanted everyone to realize the hell he loved through\n\nDanzo was just a shithead that did evil shit for his own gain",
                                    "author": "Psychopathetic-",
                                    "id": "hm80uyh",
                                    "parent_id": "t1_hm7v09q",
                                    "score": 8,
                                    "created_utc": 1637976858.0,
                                    "replies": [
                                        {
                                            "body": "Pain is undoubtedly the best though. No one, not even Madara, had the presence that Pain had. Madara was super badass but no one gave me the chills that Pain gave.",
                                            "author": "Tarkik_Vatsa",
                                            "id": "hm8ygjq",
                                            "parent_id": "t1_hm80uyh",
                                            "score": 3,
                                            "created_utc": 1637995753.0,
                                            "replies": [
                                                {
                                                    "body": "Oh absolutely, Pain was the absolute GOAT, all the way till his death",
                                                    "author": "Psychopathetic-",
                                                    "id": "hm8ylbg",
                                                    "parent_id": "t1_hm8ygjq",
                                                    "score": 2,
                                                    "created_utc": 1637995844.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Well to me he was pretty lit but also a little wild. To me the fact that so many people hate him just proves his character is great",
                                            "author": "zerquet",
                                            "id": "hm883sb",
                                            "parent_id": "t1_hm80uyh",
                                            "score": 1,
                                            "created_utc": 1637980513.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Just want to point out this mentality Danzo helped implement into the leaf village arguably helped foster a undeniable balance of powerful and capable shinobi towards the leaf village in literal world ending events.",
                            "author": "jinzokan",
                            "id": "hm8n2ne",
                            "parent_id": "t1_hm7mmf4",
                            "score": 0,
                            "created_utc": 1637988558.0,
                            "replies": []
                        },
                        {
                            "body": "Facts!",
                            "author": null,
                            "id": "hm7wvdm",
                            "parent_id": "t1_hm7mmf4",
                            "score": 1,
                            "created_utc": 1637974839.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I hate danzo because every thing he does makes the world worse, and the fact that I hate him so much is a testament to how well written he is.\n\nEverything he does is \"For the sake of the village\" but he doesn't seem to realize that other villages could help, or that a good reputation could be beneficial in the future. He really is the overall bad guy throughout the entire series, the one who caused nearly every problem the village faced during his time, and every time you find out more about him, the worse he gets.\n\nAbsolute shithead, but a damn good one",
                    "author": "Psychopathetic-",
                    "id": "hm80ejj",
                    "parent_id": "t1_hm7lm2f",
                    "score": 3,
                    "created_utc": 1637976629.0,
                    "replies": [
                        {
                            "body": "Play a \"what if\" game in your head and imagine how worse the 4th ninja war would have been.",
                            "author": "jinzokan",
                            "id": "hm8njz7",
                            "parent_id": "t1_hm80ejj",
                            "score": 1,
                            "created_utc": 1637988838.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Hitler also think do best for germany",
                    "author": "wantquitelife",
                    "id": "hm8gvny",
                    "parent_id": "t1_hm7lm2f",
                    "score": 3,
                    "created_utc": 1637985093.0,
                    "replies": []
                },
                {
                    "body": "no, he does what he thinks is best for the foundation.",
                    "author": "ZlinkyNipz",
                    "id": "hm7m8oq",
                    "parent_id": "t1_hm7lm2f",
                    "score": 3,
                    "created_utc": 1637969522.0,
                    "replies": [
                        {
                            "body": "I really don't think he cares about the foundation any more than you'd care about a weapon. He made it clear that they were only there to do what he wants, and what they want is a non-factor",
                            "author": "Psychopathetic-",
                            "id": "hm813lm",
                            "parent_id": "t1_hm7m8oq",
                            "score": 2,
                            "created_utc": 1637976980.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "i also do not get the hate on him, but each time i mention that on here i get downvoted",
                    "author": "DerDeutscheHund",
                    "id": "hm7odwx",
                    "parent_id": "t1_hm7lm2f",
                    "score": 2,
                    "created_utc": 1637970561.0,
                    "replies": [
                        {
                            "body": "I dislike Danzo but I think he is well written and his character spot is important. We don't see much in fighting from the leaf, and his character made the uneasy sense of we can't trust anyone, including friends. I feel it's why every watcher gets a big sense of relief seeing Kakashi show up in a scene. Someone insanely dependable. \n\nSPOILER: Imagine if a foundation agent or Danzo or someone was the one to save Irruka (sorry if I misspelled) during the Pain Arc? I wouldn't feel half as relieved cause who knows what the fucks gonna happen then.",
                            "author": "Slimxshadyx",
                            "id": "hm7trs6",
                            "parent_id": "t1_hm7odwx",
                            "score": 11,
                            "created_utc": 1637973254.0,
                            "replies": []
                        },
                        {
                            "body": "I just think he's a cool character",
                            "author": "Kappakoenig",
                            "id": "hm7pjhj",
                            "parent_id": "t1_hm7odwx",
                            "score": 8,
                            "created_utc": 1637971133.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Well you have a point but the world doesn't think that way. \n\nThey want to be in the heaven but doesn't even want to know why there should be hell. \n\nThey want to have a easy life but don't want the hardwork.\n\nThat's the truth, so live it your way.",
                    "author": "Broad_Shoe_779",
                    "id": "hm9aa6o",
                    "parent_id": "t1_hm7lm2f",
                    "score": 1,
                    "created_utc": 1638005195.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Indeed",
            "author": null,
            "id": "hm8lvkj",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1637987872.0,
            "replies": []
        },
        {
            "body": "What about Obito? The bastard who started a war over some dead bitch.",
            "author": "Erik-P99",
            "id": "hm7teap",
            "parent_id": "t3_r2xvku",
            "score": -2,
            "created_utc": 1637973068.0,
            "replies": [
                {
                    "body": "This",
                    "author": "IAmYoDaddyDuh",
                    "id": "hm8nca4",
                    "parent_id": "t1_hm7teap",
                    "score": -2,
                    "created_utc": 1637988712.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If there was a nuclear bomb next to me. Even if unarmed with all technology in play to stop it from exploding, I would still want it as far away as possible",
            "author": "Qu1nn1fer",
            "id": "hm8asjw",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1637981888.0,
            "replies": []
        },
        {
            "body": "Rasa is dope idk what y’all are on",
            "author": "Runkert7VK",
            "id": "hm8atg0",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1637981901.0,
            "replies": [
                {
                    "body": "I just play it off saying that if rasa wasn't the way he is, we might not have got the current gaara and I also like his gold style a lot",
                    "author": "Familiar_Pay_3933",
                    "id": "hm8z9vx",
                    "parent_id": "t1_hm8atg0",
                    "score": 1,
                    "created_utc": 1637996329.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How tf do you read this format",
            "author": "nohacksjustretard",
            "id": "hm8ogrf",
            "parent_id": "t3_r2xvku",
            "score": 0,
            "created_utc": 1637989364.0,
            "replies": [
                {
                    "body": "Anime memes are usually read from left to right, like you read manga.",
                    "author": "hafiz_muhd_",
                    "id": "hm988ht",
                    "parent_id": "t1_hm8ogrf",
                    "score": 1,
                    "created_utc": 1638003430.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agree. Rasa is way worse than Danzo.",
            "author": "ShuBakuhatsuSatsujin",
            "id": "hm8pxl7",
            "parent_id": "t3_r2xvku",
            "score": 0,
            "created_utc": 1637990230.0,
            "replies": []
        },
        {
            "body": "Where did you get this meme from? If it's from a youtube video, pls specify the source because I am the creator and they stole my content without credit\n\nIf some other source, pls specify that too",
            "author": "SeaworthinessWeary68",
            "id": "hm8tcb6",
            "parent_id": "t3_r2xvku",
            "score": 0,
            "created_utc": 1637992329.0,
            "replies": []
        },
        {
            "body": "I just want to fuck he. just",
            "author": "Amiraa-23435_adtu",
            "id": "hm936nd",
            "parent_id": "t3_r2xvku",
            "score": 0,
            "created_utc": 1637999295.0,
            "replies": []
        },
        {
            "body": "Who",
            "author": "JoTheAnimator",
            "id": "hm9584k",
            "parent_id": "t3_r2xvku",
            "score": 0,
            "created_utc": 1638000914.0,
            "replies": []
        },
        {
            "body": "The sequence of this template makes zero sense at all",
            "author": "Minimalcarpenter",
            "id": "hm9a1qb",
            "parent_id": "t3_r2xvku",
            "score": 0,
            "created_utc": 1638004989.0,
            "replies": []
        },
        {
            "body": "Danzo is the winner",
            "author": null,
            "id": "hma1w5z",
            "parent_id": "t3_r2xvku",
            "score": 0,
            "created_utc": 1638024831.0,
            "replies": []
        },
        {
            "body": "Hello who is down for hookup \nDm @gabriela_Susan5",
            "author": "Zestyclose-Rise6511",
            "id": "hma9bj1",
            "parent_id": "t3_r2xvku",
            "score": 0,
            "created_utc": 1638028360.0,
            "replies": []
        },
        {
            "body": "https://t.me/joinchat/07lIJ1OQuMg4Yzk0",
            "author": "PralineBeneficial431",
            "id": "hm8eb1n",
            "parent_id": "t3_r2xvku",
            "score": -1,
            "created_utc": 1637983730.0,
            "replies": [
                {
                    "body": "https://t.me/joinchat/07lIJ1OQuMg4Yzk0",
                    "author": "PralineBeneficial431",
                    "id": "hm8ece0",
                    "parent_id": "t1_hm8eb1n",
                    "score": 0,
                    "created_utc": 1637983749.0,
                    "replies": []
                },
                {
                    "body": "https://t.me/joinchat/07lIJ1OQuMg4Yzk0",
                    "author": "PralineBeneficial431",
                    "id": "hm8ed2w",
                    "parent_id": "t1_hm8eb1n",
                    "score": 0,
                    "created_utc": 1637983759.0,
                    "replies": []
                },
                {
                    "body": "https://t.me/joinchat/07lIJ1OQuMg4Yzk0",
                    "author": "PralineBeneficial431",
                    "id": "hm8edgv",
                    "parent_id": "t1_hm8eb1n",
                    "score": 1,
                    "created_utc": 1637983765.0,
                    "replies": []
                },
                {
                    "body": "https://t.me/joinchat/07lIJ1OQuMg4Yzk0",
                    "author": "PralineBeneficial431",
                    "id": "hm8edsv",
                    "parent_id": "t1_hm8eb1n",
                    "score": 1,
                    "created_utc": 1637983770.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t watch naruto",
            "author": "Zendofrog",
            "id": "hm8gjdp",
            "parent_id": "t3_r2xvku",
            "score": -1,
            "created_utc": 1637984916.0,
            "replies": []
        },
        {
            "body": "YES",
            "author": null,
            "id": "hm8ldyq",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1637987596.0,
            "replies": []
        },
        {
            "body": "I mean naruto got that mask for free, I’d call that a win",
            "author": "pp-zuccer7777",
            "id": "hm8vsqf",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1637993943.0,
            "replies": []
        },
        {
            "body": "Wait should i hat gaaras father?",
            "author": "chillsmite",
            "id": "hm8wzjo",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1637994738.0,
            "replies": []
        },
        {
            "body": "Because we didn't see his back story. What if as a child he had only his father who was a skillful mask maker, then on the day of nine tail's attack, his father promised a big dinner and went out to sell the masks he made with such effort. But tragedy strucks when his father didn't make it home.. Nine tails killed his father and now that poor child is left with nothing but an art of mask making and a grudge to kill the nine tails. Even now at nights he wakes up to a nightmare of kurama having dinner with his father as the side dish.  :'(",
            "author": "Happy_Cauliflower223",
            "id": "hm8y82j",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1637995590.0,
            "replies": []
        },
        {
            "body": "Fuck Mask Seller\n\nAll my homies hate Mask Seller",
            "author": "_fairyy",
            "id": "hm8zm9i",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1637996572.0,
            "replies": []
        },
        {
            "body": "F##k that guy",
            "author": "TheKnightGame",
            "id": "hm94qyr",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1638000524.0,
            "replies": []
        },
        {
            "body": "Do people really hate gaara's dad tho? The guy got barely more Screentime than the dude selling masks.\n\nMaybe I'm wrong, but all I remember is how he got resurrected, was told how shit of a dad he was, admired what gaara has become and got sealed. And that was like in a span of 2 or so episodes?\n\nMaybe I'm wrong",
            "author": "Lotar31",
            "id": "hm9ddcb",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1638007835.0,
            "replies": []
        },
        {
            "body": "Fuck that dude. Throw a mask at small Naruto 🥺",
            "author": "DaisyoftheDay",
            "id": "hm9h28e",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1638011052.0,
            "replies": []
        },
        {
            "body": "Rasa isn't hated enough",
            "author": "mysterdio",
            "id": "hm9h93s",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1638011214.0,
            "replies": []
        },
        {
            "body": "r/FuckDanzo",
            "author": "Ajna936",
            "id": "hm9mvrt",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1638015845.0,
            "replies": []
        },
        {
            "body": "if it were me i would have hunted down that mf",
            "author": "Apprehensive-Rip-793",
            "id": "hm9ntn0",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1638016541.0,
            "replies": []
        },
        {
            "body": "Who hates gaara father more than Danzo.",
            "author": "Barbarrox",
            "id": "hm9r1yd",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1638018713.0,
            "replies": []
        },
        {
            "body": "The mask guy is more important than Danzo to make that Naruto wanted to become a Hokage\nHe made Naruto wants to be noted in a good way",
            "author": "Andirion",
            "id": "hm9sata",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1638019491.0,
            "replies": []
        },
        {
            "body": "Black zetsu sucks too",
            "author": "MysticWithThePhonk",
            "id": "hm9v4ry",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1638021189.0,
            "replies": []
        },
        {
            "body": "Yeah that is a bitch",
            "author": "PhanthomKnight",
            "id": "hm9x8jp",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1638022367.0,
            "replies": []
        },
        {
            "body": "Sometimes, I truly wish that Naruto went dark side and destroyed the village like Pain did. And Mizuki had almost pushed him over the edge too! To be treated as a criminal, and being hunted down, only for doing what he thought was right. Mizuki tricked him, told him the real reason why he was hated and ostracized by the villagers. And all the Ninjas of the village jumped at the chance to hunt him down.\n\nBut, the mere fact that Iruka acknowledged Naruto was enough for him to let go of all those dark emotions and bury them deep inside. Iruka's acknowledgement was the single ray of hope that he was looking for through the cloud of darkness that his whole life had been.\n\nReasons why I actually never thought that the Third was a good Hokage by any means and didn't feel bad at all when he died. Naruto had a horrible childhood under his watch.\n\nAnd to this day a part of me wishes that Naruto had destroyed the village. Those people did my boy really dirty. Of course, he got rid of all his demons at the Waterfall of Truth. I never did. So, I still hate all the villagers. 🤣",
            "author": "ArgoK92",
            "id": "hma1135",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1638024392.0,
            "replies": []
        },
        {
            "body": "That man was a literal motherfucker",
            "author": null,
            "id": "hmag4j4",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1638031435.0,
            "replies": []
        },
        {
            "body": "Naruto: Becomes A Hero And The Most Loved Person\n\n\nMask Guy In The Afterlife: Guess I'll Be Hated Then.",
            "author": "EgsBucks",
            "id": "hmanx20",
            "parent_id": "t3_r2xvku",
            "score": 1,
            "created_utc": 1638034767.0,
            "replies": []
        },
        {
            "body": "Yea I was thinking about why the fuck people could hate him, then I remembered Gaara and his childhood lol",
            "author": "SMaxTH",
            "id": "hm98aw1",
            "parent_id": "t1_hm81j5l",
            "score": 141,
            "created_utc": 1638003485.0,
            "replies": [
                {
                    "body": "FUCK the Kazekage. \n\nAlso, who's the dude in the 3rd panel down?",
                    "author": "discerningpervert",
                    "id": "hm9obha",
                    "parent_id": "t1_hm98aw1",
                    "score": 55,
                    "created_utc": 1638016884.0,
                    "replies": [
                        {
                            "body": "He’s a piece of shit who yells at naruto for looking at the shit he was selling. Basically call him a broke bitch in front of a ton of people and Hinata tries to defend him or something and her keeper stops her",
                            "author": "Dear_Field_7182",
                            "id": "hm9oupk",
                            "parent_id": "t1_hm9obha",
                            "score": 92,
                            "created_utc": 1638017255.0,
                            "replies": [
                                {
                                    "body": "Naruto should’ve thrown a rasengan up that guys butthole",
                                    "author": "funny_gus",
                                    "id": "hmaruhm",
                                    "parent_id": "t1_hm9oupk",
                                    "score": 4,
                                    "created_utc": 1638036396.0,
                                    "replies": [
                                        {
                                            "body": "In a separate thread Op was talking about if a rasengan can kill and I think this guy should be the test dummy. I was saying he’s mastered it so he could probably do something similar in all 5 chakra natures and he should test them all on this guy.",
                                            "author": "Dear_Field_7182",
                                            "id": "hmbm8wd",
                                            "parent_id": "t1_hmaruhm",
                                            "score": 2,
                                            "created_utc": 1638049172.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "He was from a flashback that Naruto had a few times. In it the guy gets angry that Naruto is in his shop. Naruto was just looking at a cool mask. So the guy says, “oh? You want that? Take it!”\n\nHe pushes Naruto down and just fucking hurls it at his head. Then he gets a crowd of people to join in and they all start telling Naruto how much they hate him. Fun guy.\n\nEdit: Here’s the scene in question. Now that I think about it, I think this was part of a small filler three-parter after the Pain arc that is basically just Iruka looking back on his life up to that point and acknowledging how far Naruto has come. It’s actually very wholesome, I’d recommend it.\n\nhttps://youtu.be/POfboUjdpn4",
                            "author": "BiSaxual",
                            "id": "hm9p443",
                            "parent_id": "t1_hm9obha",
                            "score": 36,
                            "created_utc": 1638017431.0,
                            "replies": [
                                {
                                    "body": "Ngl that stuff was at the beginning of Naruto I think.",
                                    "author": "darknioss",
                                    "id": "hma5dgg",
                                    "parent_id": "t1_hm9p443",
                                    "score": 4,
                                    "created_utc": 1638026527.0,
                                    "replies": [
                                        {
                                            "body": "You’re probably right. There’s so many damn flashbacks in filler that it all just runs together lol",
                                            "author": "BiSaxual",
                                            "id": "hma8vac",
                                            "parent_id": "t1_hma5dgg",
                                            "score": 3,
                                            "created_utc": 1638028158.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Same",
                    "author": "error5903",
                    "id": "hmajg7d",
                    "parent_id": "t1_hm98aw1",
                    "score": 1,
                    "created_utc": 1638032879.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s kinda the point I think\n\nNaruto had all the right in the world to hate the village and even want it destroyed but instead he manifested those feelings into wanting to prove them wrong by becoming the hokage, someone they would *have* to respect whether they liked it or not \n\nAnd he also knew that there were people who weren’t like those other villagers and would support him, like iruka.\n\nAnd i think it’s all supposed to be a big parallel to sasuke, who also has his reasons for hating the village, and people who want to support him as well, but instead choosing revenge falling into the “cycle of hatred” that’s brought up often in shippuden",
            "author": "rad_dude124",
            "id": "hm8fchs",
            "parent_id": "t1_hm7bzu4",
            "score": 35,
            "created_utc": 1637984280.0,
            "replies": []
        },
        {
            "body": "well this was literally from a filler episode...Naruto was oastrized which is bad enough but I do not recall any instance in the manga of him being physically abused by anyone (unless you include Sakura and Sasuke)\n\nMost of the villagers are innocent so it does not baffle me at all.",
            "author": null,
            "id": "hm7jlkh",
            "parent_id": "t1_hm7bzu4",
            "score": 200,
            "created_utc": 1637968228.0,
            "replies": [
                {
                    "body": "Naruto was  PG shounen series ofcourse they wouldn't show that much of what Naruto truly faced ,  realistically speaking Naruto could have turned evil and went rogue before Sasuke even thought about it  , its his kind heart and him being an \"idiot\" what stopped this plot from happening  \n\n\nHonestly I even question if Naruto was brainwashed to stay loyal to his village at some point",
                    "author": null,
                    "id": "hm7o0jw",
                    "parent_id": "t1_hm7jlkh",
                    "score": 194,
                    "created_utc": 1637970381.0,
                    "replies": [
                        {
                            "body": "Tbh the village reaction to Pain destroying the village looking for Naruto could’ve been really bad. Sure Naruto beat him and he made friends in the village, but the other villagers easily could’ve turned on him since Pain only destroyed the village because he was looking for Naruto",
                            "author": "britipinojeff",
                            "id": "hm7vhim",
                            "parent_id": "t1_hm7o0jw",
                            "score": 86,
                            "created_utc": 1637974128.0,
                            "replies": [
                                {
                                    "body": "Hmm at this point in the story he’s become respected but since Pain literally killed Jiraiya who the village ninjas seems to respect, they wouldn’t care who he’s after",
                                    "author": "Sealking13",
                                    "id": "hm7z2d0",
                                    "parent_id": "t1_hm7vhim",
                                    "score": 56,
                                    "created_utc": 1637975949.0,
                                    "replies": []
                                },
                                {
                                    "body": "Which wasn't true, pain hated konoha cause of danzo",
                                    "author": "Conscious-News-4433",
                                    "id": "hm9185m",
                                    "parent_id": "t1_hm7vhim",
                                    "score": 13,
                                    "created_utc": 1637997769.0,
                                    "replies": [
                                        {
                                            "body": "I think he means the leaf villagers would like naruto since he got revenge for jiraiya by defeating pain, despite the fact pain destroyed konoha looking for naruto",
                                            "author": null,
                                            "id": "hm9o95p",
                                            "parent_id": "t1_hm9185m",
                                            "score": 10,
                                            "created_utc": 1638016841.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "TV Execs: “We can’t show child abuse that’s too far. Anyway for the next part of the series, let’s show all these kids participating in World War 3 as child soldiers and having one of them get brutally crushed and have his crush stabbed by his best friend.”",
                            "author": "SeductivePillowcase",
                            "id": "hm7u0mb",
                            "parent_id": "t1_hm7o0jw",
                            "score": 67,
                            "created_utc": 1637973376.0,
                            "replies": [
                                {
                                    "body": "It would hit too close to home for people so I do get it tbh",
                                    "author": "The_New_New",
                                    "id": "hm8utgr",
                                    "parent_id": "t1_hm7u0mb",
                                    "score": 10,
                                    "created_utc": 1637993285.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Naruto isn't an idiot at all. He took that persona to cope, that's why all the sad swing flashbacks lol. If he hadn't taken that, and for his good heart, he likely would've been a super Gaara.\n\nI also want to give giant credit to Minato for doing a pro sealing jutsu on Naruto with the nine tails and not a lame one. Gaara also couldn't control his beast and commonly slayed people, while Naruto had no corruption until much later.",
                            "author": "Slimxshadyx",
                            "id": "hm7tgwq",
                            "parent_id": "t1_hm7o0jw",
                            "score": 71,
                            "created_utc": 1637973105.0,
                            "replies": [
                                {
                                    "body": "Naruto is definitely a idiot lol. Its a common anime thing, they're stupid af but also smart sometimes? look at Luffy or Goku",
                                    "author": "ToyrewaDokoDeska",
                                    "id": "hm80xcc",
                                    "parent_id": "t1_hm7tgwq",
                                    "score": 47,
                                    "created_utc": 1637976892.0,
                                    "replies": [
                                        {
                                            "body": "Imbecile battle savant. Naruto, Ichigo, Goku... ancient trope tbh",
                                            "author": "eRHachan",
                                            "id": "hm9koy3",
                                            "parent_id": "t1_hm80xcc",
                                            "score": 10,
                                            "created_utc": 1638014096.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you, yes perfect title lol ill definitely use this",
                                                    "author": "ToyrewaDokoDeska",
                                                    "id": "hm9o3ok",
                                                    "parent_id": "t1_hm9koy3",
                                                    "score": 5,
                                                    "created_utc": 1638016735.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Ichigo wasn't really an idiot though. At least not to the extent of Naruto and Goku.",
                                                    "author": "monhunt",
                                                    "id": "hma6mss",
                                                    "parent_id": "t1_hm9koy3",
                                                    "score": 4,
                                                    "created_utc": 1638027133.0,
                                                    "replies": [
                                                        {
                                                            "body": "He was a bonafide punk who punched first and asked second. He wasn't brain-damaged like Goku, but he was pretty close.",
                                                            "author": "eRHachan",
                                                            "id": "hmaphyy",
                                                            "parent_id": "t1_hma6mss",
                                                            "score": 4,
                                                            "created_utc": 1638035421.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I think you've been reading too many fanfics. Hes an idiot. Hes a standard Shonen MC who has insanly good instincts. We see this in the series when he's alone, and with others",
                                    "author": "xNuxIsGod",
                                    "id": "hm8nukz",
                                    "parent_id": "t1_hm7tgwq",
                                    "score": 16,
                                    "created_utc": 1637989009.0,
                                    "replies": []
                                },
                                {
                                    "body": "Minato could have sealed the good side of the Kyuubi in his son, but he gave him bad side lmao.",
                                    "author": "SaveThemKillYourself",
                                    "id": "hm80ik8",
                                    "parent_id": "t1_hm7tgwq",
                                    "score": -16,
                                    "created_utc": 1637976687.0,
                                    "replies": [
                                        {
                                            "body": "Naruto was sealed with Yang-Kurama. Yang = positive, warm, light, and a slew of other things. Yin is the \"negative\" one.",
                                            "author": "Catlover18",
                                            "id": "hm80ync",
                                            "parent_id": "t1_hm80ik8",
                                            "score": 26,
                                            "created_utc": 1637976910.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "He did though. The 9 tails is a massive ball of hate and distain for humans. The part Naruto got was the good side. He still had all his memory's, hence his dislike of humans and unwillingness to help them, but he never actively tried to harm them unless they bothered him or Naruto personally.",
                                            "author": "xNuxIsGod",
                                            "id": "hm8npbc",
                                            "parent_id": "t1_hm80ik8",
                                            "score": 10,
                                            "created_utc": 1637988924.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I like to think that some of the filler like these few episodes and some closing are cannon like the one when ramen guy gave him free ramen whe he was little",
                            "author": "CaptainBlaze22",
                            "id": "hm8supx",
                            "parent_id": "t1_hm7o0jw",
                            "score": 8,
                            "created_utc": 1637992029.0,
                            "replies": []
                        },
                        {
                            "body": "The village has a clan of mind rapists. Naruto is an idiot but also a savant.\n\nHim being brainwashed is supported by the setting quite handily. Basically, a certainty.",
                            "author": "Inimposter",
                            "id": "hm9e70s",
                            "parent_id": "t1_hm7o0jw",
                            "score": 4,
                            "created_utc": 1638008563.0,
                            "replies": []
                        },
                        {
                            "body": "you could say that about the show in general and not just Naruto.  even sasuke's trauma of being a genocide victim is arguably tame.then we have itachi who is probably the most unhuman character in the whole show, no wonder edgelords stan him so hard.",
                            "author": null,
                            "id": "hm82re8",
                            "parent_id": "t1_hm7o0jw",
                            "score": 8,
                            "created_utc": 1637977813.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Wtf it being filler have to with anything? It’s still a controversial episode. Doesn’t mean people can’t talk about it or discuss it.",
                    "author": "tonytonydavis",
                    "id": "hm8humw",
                    "parent_id": "t1_hm7jlkh",
                    "score": 5,
                    "created_utc": 1637985622.0,
                    "replies": []
                },
                {
                    "body": "Bullies",
                    "author": "1313goo",
                    "id": "hm7uya4",
                    "parent_id": "t1_hm7jlkh",
                    "score": 2,
                    "created_utc": 1637973856.0,
                    "replies": []
                },
                {
                    "body": "This shows how shitty hiruzen was as hokage. Allowing people to mistreat a guy who had the power to raze the village again, instead of trying to fit him in the village, especially since he had no fault in what happened, was just dumb.",
                    "author": "ravagerslb",
                    "id": "hm9qzcc",
                    "parent_id": "t1_hm7jlkh",
                    "score": 2,
                    "created_utc": 1638018667.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I get why. I was treated like crap my whole life and still tried to help people. When you are treated bad you just want something good in life. \n\nYou still try to hang onto hope and that people will change. Or that you can meet someone different who is good.\n\n You don't let yourself turn into the kind of person who'd hurt others so you stay good. \n\nNaruto is a good person and rises above it all. He's the bigger person. I think he's also so optimistic and wants people to change for the better/believes they will.",
            "author": "Aandiarie_QueenofFa",
            "id": "hm8lkts",
            "parent_id": "t1_hm7bzu4",
            "score": 14,
            "created_utc": 1637987706.0,
            "replies": [
                {
                    "body": "This! You explained it so well amazing",
                    "author": "seahunter22",
                    "id": "hma2cao",
                    "parent_id": "t1_hm8lkts",
                    "score": 2,
                    "created_utc": 1638025059.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tbf, he was so busy craving that other pay attention to him/love him, he ignored his anget at the village for it. Then he did address that part of him with Dark Naruto. Plus the villagers did genuinly change to love him by the time he brought Tsunade back.",
            "author": "Few_Pay_5313",
            "id": "hm85uui",
            "parent_id": "t1_hm7bzu4",
            "score": 7,
            "created_utc": 1637979380.0,
            "replies": []
        },
        {
            "body": "I honestly wish things would have ended after the Pain arc without him becoming Hokage. I know that him becoming Hokage was sort of his way to flip the bird to the village and go “now you all have to respect me!”, but I think it would have been more meaningful for him to realize that he doesn’t need to be Hokage to mean something and that he did earn the respect of the village. \n\nThere’s a ton of other reasons why it should have ended after the Pain arc but that’s one of my top ones",
            "author": null,
            "id": "hm8qmig",
            "parent_id": "t1_hm7bzu4",
            "score": 5,
            "created_utc": 1637990653.0,
            "replies": []
        },
        {
            "body": "It baffles my mind even harder when Hiruzen and everyone in Konoha knew how Kushina & Minato sacrificed themselves for Konoha and they still treated Naruto as shit. Sandaime practically abandoned Naruto too, only giving him monthly stipend, which isn't even enough. The villains in Naruto were right. Destroy this effing village.",
            "author": "000vi",
            "id": "hm8v9q7",
            "parent_id": "t1_hm7bzu4",
            "score": 8,
            "created_utc": 1637993583.0,
            "replies": []
        },
        {
            "body": "He wanted acceptance, not vengeance. His whole character was based off of persevering through effort and positivity. Sasuke was his opposite because he embraced the negativity and the two were destined to clash.",
            "author": "WickedRedemption",
            "id": "hm86qvm",
            "parent_id": "t1_hm7bzu4",
            "score": 4,
            "created_utc": 1637979830.0,
            "replies": []
        },
        {
            "body": "Dunno why they just goes extra way out to be an extra dick toward Naruto just because he's jinchuriki and dunno what's Hiruzen doing if he's both letting Naruto know as jinchuriki while neglecting him as Minato son (sound weird but just let everyone not know he's Minato son).",
            "author": "Nightfans",
            "id": "hm8nr4q",
            "parent_id": "t1_hm83r8i",
            "score": 14,
            "created_utc": 1637988953.0,
            "replies": [
                {
                    "body": "They didn't let them know he was Minato's son because those who hated his guts are gonna come for Naruto.",
                    "author": "No2AccOfSumUser",
                    "id": "hm9fry1",
                    "parent_id": "t1_hm8nr4q",
                    "score": 7,
                    "created_utc": 1638009943.0,
                    "replies": [
                        {
                            "body": "But yeah it's fine to tell the entire public that he carries the strongest tailed beast\n\nYep nobody would go after him 100%",
                            "author": "vedat07taskiran",
                            "id": "hmb2a4l",
                            "parent_id": "t1_hm9fry1",
                            "score": 4,
                            "created_utc": 1638040808.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tbf, I would be scared of Naruto if I was an adult in konoha, but I wouldn't bully him, maybe I would stay a bit away but I definitely wouldn't bully him like tf that's the last thing you want to happen you don't want the kid to suddenly transform into nine tails in the middle of the village after you bullied him would you",
            "author": "Konoha__Shinobi",
            "id": "hm96tls",
            "parent_id": "t1_hm83r8i",
            "score": 3,
            "created_utc": 1638002238.0,
            "replies": []
        },
        {
            "body": "A shop owner who kicked Naruto out of his shop just for browsing and threw a mask at his head",
            "author": "Yogami_asura",
            "id": "hm7ss8e",
            "parent_id": "t1_hm7s6tj",
            "score": 238,
            "created_utc": 1637972757.0,
            "replies": [
                {
                    "body": "Yeah that'd do it.",
                    "author": "TheWinterPrince52",
                    "id": "hm7vt7j",
                    "parent_id": "t1_hm7ss8e",
                    "score": 77,
                    "created_utc": 1637974292.0,
                    "replies": []
                },
                {
                    "body": "He ended up giving Naruto the mask for free. That should put him just below Teuchi!",
                    "author": "vvmello",
                    "id": "hm87ktv",
                    "parent_id": "t1_hm7ss8e",
                    "score": 53,
                    "created_utc": 1637980248.0,
                    "replies": [
                        {
                            "body": "Then Naruto wears the mask thrown at him to become an ANBU vigilante",
                            "author": "Yogami_asura",
                            "id": "hm8fea1",
                            "parent_id": "t1_hm87ktv",
                            "score": 38,
                            "created_utc": 1637984306.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Goddamn hated that guy, fkin bastard",
                    "author": "Konoha__Shinobi",
                    "id": "hm96up7",
                    "parent_id": "t1_hm7ss8e",
                    "score": 5,
                    "created_utc": 1638002262.0,
                    "replies": []
                },
                {
                    "body": "Can you tell me the episode number",
                    "author": "flying_jesus",
                    "id": "hmaittv",
                    "parent_id": "t1_hm7ss8e",
                    "score": 2,
                    "created_utc": 1638032606.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unless I'm wrong, the shopkeep in the last picture literally threw Naruto out of his shop even though Naruto was just looking at the masks",
            "author": "haloman711",
            "id": "hm7ubs5",
            "parent_id": "t1_hm7s6tj",
            "score": 42,
            "created_utc": 1637973536.0,
            "replies": [
                {
                    "body": "Naruto even had money and was gonna buy it 😭😭",
                    "author": "BlackoutGaming1",
                    "id": "hm85qep",
                    "parent_id": "t1_hm7ubs5",
                    "score": 43,
                    "created_utc": 1637979316.0,
                    "replies": []
                },
                {
                    "body": "I'm stupid af  I thought the post was talking about how everyone in the village hated naruto",
                    "author": "hereforthehentai6969",
                    "id": "hm7y5aw",
                    "parent_id": "t1_hm7ubs5",
                    "score": 4,
                    "created_utc": 1637975482.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The first pic is danzo second Garras father and third is naruto",
            "author": "hereforthehentai6969",
            "id": "hm7sef2",
            "parent_id": "t1_hm7s6tj",
            "score": 15,
            "created_utc": 1637972562.0,
            "replies": [
                {
                    "body": "LMFAO not Naruto, it's talking about the shop guy who yelled at him about looking at the masks. I hate that guy",
                    "author": "Slimxshadyx",
                    "id": "hm7tu05",
                    "parent_id": "t1_hm7sef2",
                    "score": 26,
                    "created_utc": 1637973284.0,
                    "replies": []
                },
                {
                    "body": "Are you the one joking, or was Naruto the subject the whole time?  I thought we were talking about the dude Naruto seems to be talking to.",
                    "author": "TheWinterPrince52",
                    "id": "hm7sn9l",
                    "parent_id": "t1_hm7sef2",
                    "score": 4,
                    "created_utc": 1637972686.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's Naruto, man",
            "author": "psychoticchicken1",
            "id": "hm81mew",
            "parent_id": "t1_hm7s6tj",
            "score": 3,
            "created_utc": 1637977245.0,
            "replies": []
        },
        {
            "body": "He was a shitty dad but had a good redemption.",
            "author": "OneHellOfAPotato",
            "id": "hma2x3g",
            "parent_id": "t1_hm8pred",
            "score": 2,
            "created_utc": 1638025347.0,
            "replies": []
        },
        {
            "body": "Kawaki's dads* except Naruto ofc.",
            "author": "Tarkik_Vatsa",
            "id": "hm8xymv",
            "parent_id": "t1_hm8cfc2",
            "score": 2,
            "created_utc": 1637995408.0,
            "replies": []
        },
        {
            "body": "I like sakura",
            "author": "BrandExe",
            "id": "hm7t5ls",
            "parent_id": "t1_hm7kay0",
            "score": 25,
            "created_utc": 1637972945.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "hm812ek",
                    "parent_id": "t1_hm7t5ls",
                    "score": -6,
                    "created_utc": 1637976963.0,
                    "replies": [
                        {
                            "body": "Those who thinks Hinata is stronger have downs",
                            "author": "aicchisenpai",
                            "id": "hm84r5c",
                            "parent_id": "t1_hm812ek",
                            "score": -15,
                            "created_utc": 1637978813.0,
                            "replies": [
                                {
                                    "body": "I mean, she does have SOSP chakra",
                                    "author": "Conscious-News-4433",
                                    "id": "hm91j0b",
                                    "parent_id": "t1_hm84r5c",
                                    "score": 3,
                                    "created_utc": 1637998003.0,
                                    "replies": []
                                },
                                {
                                    "body": "Sakura is obv. stronger, but Hinata is better written",
                                    "author": "Economy_Ice5190",
                                    "id": "hm972gu",
                                    "parent_id": "t1_hm84r5c",
                                    "score": 3,
                                    "created_utc": 1638002440.0,
                                    "replies": [
                                        {
                                            "body": "The number of my downvotes says otherwise. And Hinata isn’t better written. She kept saying Naruto this Naruto that the entire time. She only stopped doing that when Boruto exists. The author just suck at writing female characters",
                                            "author": "aicchisenpai",
                                            "id": "hm9jwd3",
                                            "parent_id": "t1_hm972gu",
                                            "score": -1,
                                            "created_utc": 1638013442.0,
                                            "replies": [
                                                {
                                                    "body": "Hinata still feels much betfer written than Sakura though because she atleast had a compelling backstory. I agree with her not being a well written character completely though. Also, since Sakura was a main character, we definitely expected much more from her in comparison to Hinata.",
                                                    "author": "Tarkik_Vatsa",
                                                    "id": "hm9s6ap",
                                                    "parent_id": "t1_hm9jwd3",
                                                    "score": 2,
                                                    "created_utc": 1638019413.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "“Most people rejected his message. \nThey hated him because he told them the truth.”",
                                    "author": "AstronautAmazing7046",
                                    "id": "hm8hyp0",
                                    "parent_id": "t1_hm84r5c",
                                    "score": 0,
                                    "created_utc": 1637985685.0,
                                    "replies": [
                                        {
                                            "body": "Which message?",
                                            "author": "IAmYoDaddyDuh",
                                            "id": "hm8nfcl",
                                            "parent_id": "t1_hm8hyp0",
                                            "score": 3,
                                            "created_utc": 1637988761.0,
                                            "replies": [
                                                {
                                                    "body": "Kishomoto’s message since he confirmed that she’s stronger, facts over feelings",
                                                    "author": "AstronautAmazing7046",
                                                    "id": "hma9j49",
                                                    "parent_id": "t1_hm8nfcl",
                                                    "score": 1,
                                                    "created_utc": 1638028457.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sakura is stronger than Hinata?",
                                                            "author": "IAmYoDaddyDuh",
                                                            "id": "hmaiw68",
                                                            "parent_id": "t1_hma9j49",
                                                            "score": 0,
                                                            "created_utc": 1638032634.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yes, she surpassed Tsunade and the author said she’s the strongest Kunoichi in the leaf. Hinata has close range attacks to stop chakra, but sakura is faster and is physically stronger so it’s unlike hinata would even touch her . But even if hinata hit a chakra point, kakashi already mentioned sakuras chakra control was better than naruto and sasukes. This doesn’t mean she’s stronger than them though, Chakra control is her strong point which is why hinata who stops chakra is no match for her as sakura can control it. \n\nShe’s the only one besides tsunade able to do Strength Of A Hundred Seal and summon Katsuuya, now if we look a tsunade who did those things too, out of all the kages fighting against madara, it’s her strength he was more impressed by, she was the last one conscious and gave her left over strength to heal the other Kages. Say if hinata were to even match her speed and stop a chakra point, sakura’s technique means she stores an abundance of chakra in her seal and can reactivate it in her body, hinata can’t cut of her chakra as she can supply it again and again. Sakura is the same person who got stabbed by madara (as a decoy) and just healed herself from it, the same day sasuke almost died from madaras stab before he was given god-like powers. Hinata would not survive from a stab like that. It’s clear that sakura could end her and would be the last one standing.",
                                                                    "author": "AstronautAmazing7046",
                                                                    "id": "hmam12q",
                                                                    "parent_id": "t1_hmaiw68",
                                                                    "score": 1,
                                                                    "created_utc": 1638033982.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "what one",
            "author": null,
            "id": "hm94xiw",
            "parent_id": "t1_hm8c3k6",
            "score": -1,
            "created_utc": 1638000671.0,
            "replies": []
        },
        {
            "body": "Same could be said for Danzo",
            "author": "coopstar777",
            "id": "hm984d9",
            "parent_id": "t1_hm8tozg",
            "score": 2,
            "created_utc": 1638003328.0,
            "replies": []
        },
        {
            "body": "He made his son a jinchuriki  but unlike Minato, who did it since he knew Naruto would have to face Obito he did it to make him a weapon for the Sand. That lead to him getting the Naruto treatment, then he made Gaara's Iruka try to kill him.",
            "author": "Few_Pay_5313",
            "id": "hm863rr",
            "parent_id": "t1_hm81bux",
            "score": 23,
            "created_utc": 1637979506.0,
            "replies": [
                {
                    "body": "Not to mention \"you made friends?!\"",
                    "author": null,
                    "id": "hm86evp",
                    "parent_id": "t1_hm863rr",
                    "score": 23,
                    "created_utc": 1637979662.0,
                    "replies": [
                        {
                            "body": "I still like Gaaras down",
                            "author": "IAmYoDaddyDuh",
                            "id": "hm8na3m",
                            "parent_id": "t1_hm86evp",
                            "score": 2,
                            "created_utc": 1637988678.0,
                            "replies": []
                        },
                        {
                            "body": "To be fair, Gaara last the Kazekage saw him was a bit... unhinged (due to the dad's fault obviously)",
                            "author": "The_New_New",
                            "id": "hm8v0gl",
                            "parent_id": "t1_hm86evp",
                            "score": 2,
                            "created_utc": 1637993413.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I hate Gaara's dad as much as any other person here but IIRC making Gaara a Jinchuriki was a decision which everyone in the council told him to make. Granny Chiyo mentioned something like this in the first arc of Shippuden. Gaara's dad looked a good husband and dad before the birth of Gaara. Maybe it was the death of Gaara's mom that turned him into a complete asshole.",
                    "author": "Tarkik_Vatsa",
                    "id": "hm8y89j",
                    "parent_id": "t1_hm863rr",
                    "score": 3,
                    "created_utc": 1637995593.0,
                    "replies": [
                        {
                            "body": "Still doesnt excuse SENDING ASSASSINS AFTER YOUR SON",
                            "author": "Few_Pay_5313",
                            "id": "hm8zudt",
                            "parent_id": "t1_hm8y89j",
                            "score": 3,
                            "created_utc": 1637996733.0,
                            "replies": [
                                {
                                    "body": "I completely agree. And that too sending the only person who showed love to Gaara.",
                                    "author": "Tarkik_Vatsa",
                                    "id": "hm90ims",
                                    "parent_id": "t1_hm8zudt",
                                    "score": 2,
                                    "created_utc": 1637997236.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Horrifically abusive",
            "author": "bealtimint",
            "id": "hm8diae",
            "parent_id": "t1_hm81bux",
            "score": 6,
            "created_utc": 1637983305.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hm82qkc",
            "parent_id": "t1_hm81qx0",
            "score": -3,
            "created_utc": 1637977802.0,
            "replies": [
                {
                    "body": "r/wooosh",
                    "author": "psychoticchicken1",
                    "id": "hm835y5",
                    "parent_id": "t1_hm82qkc",
                    "score": 7,
                    "created_utc": 1637978015.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh u meanteth the shopkeeper right, i bethought t wast naruto\n\n***\n\n\n\n^(I am a bot and I swapp'd some of thy words with Shakespeare words.)\n\nCommands: `!ShakespeareInsult`, `!fordo`, `!optout`",
            "author": "Shakespeare-Bot",
            "id": "hm91ha0",
            "parent_id": "t1_hm91gab",
            "score": 2,
            "created_utc": 1637997966.0,
            "replies": []
        },
        {
            "body": "Ok Danzo was a selfish man who would do anything for power. When pain was slaughtering the leaf village, he wanted his subordinates to sit back and do nothing to help. He wanted leaf village to be destroyed only because that would increase his chances of becoming a hokage. He didn't value lives of people. He thought that the people pain slaughtered were merely sacrifices necessary to make him hokage. Also he lead an organisation in which people were taught to bury their feelings. Shinobi were not mere weapons they were people too. Earlier generations may have liked these methods, but that was an era of war. The world changed but Danzo refused to change with it. Why was he even alive this long ! Just fck Danzo all my homies in konoha hate Danzo",
            "author": "RPG-RAUPUNGA-MKYFY-_",
            "id": "hm7mmf4",
            "parent_id": "t1_hm7lm2f",
            "score": 54,
            "created_utc": 1637969698.0,
            "replies": [
                {
                    "body": "You literally explained why he is great villain",
                    "author": "zerquet",
                    "id": "hm7v09q",
                    "parent_id": "t1_hm7mmf4",
                    "score": 2,
                    "created_utc": 1637973884.0,
                    "replies": [
                        {
                            "body": "Honestly to me a great villain is someone that you can see where they came from and why they'd think what they're doing is the right thing to do.\n\nItachi killed his clan for the sake of the village \n\nMadara wanted a perfect world for everyone\n\nPain was sick of his village being a battleground and wanted everyone to realize the hell he loved through\n\nDanzo was just a shithead that did evil shit for his own gain",
                            "author": "Psychopathetic-",
                            "id": "hm80uyh",
                            "parent_id": "t1_hm7v09q",
                            "score": 8,
                            "created_utc": 1637976858.0,
                            "replies": [
                                {
                                    "body": "Pain is undoubtedly the best though. No one, not even Madara, had the presence that Pain had. Madara was super badass but no one gave me the chills that Pain gave.",
                                    "author": "Tarkik_Vatsa",
                                    "id": "hm8ygjq",
                                    "parent_id": "t1_hm80uyh",
                                    "score": 3,
                                    "created_utc": 1637995753.0,
                                    "replies": [
                                        {
                                            "body": "Oh absolutely, Pain was the absolute GOAT, all the way till his death",
                                            "author": "Psychopathetic-",
                                            "id": "hm8ylbg",
                                            "parent_id": "t1_hm8ygjq",
                                            "score": 2,
                                            "created_utc": 1637995844.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Well to me he was pretty lit but also a little wild. To me the fact that so many people hate him just proves his character is great",
                                    "author": "zerquet",
                                    "id": "hm883sb",
                                    "parent_id": "t1_hm80uyh",
                                    "score": 1,
                                    "created_utc": 1637980513.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Just want to point out this mentality Danzo helped implement into the leaf village arguably helped foster a undeniable balance of powerful and capable shinobi towards the leaf village in literal world ending events.",
                    "author": "jinzokan",
                    "id": "hm8n2ne",
                    "parent_id": "t1_hm7mmf4",
                    "score": 0,
                    "created_utc": 1637988558.0,
                    "replies": []
                },
                {
                    "body": "Facts!",
                    "author": null,
                    "id": "hm7wvdm",
                    "parent_id": "t1_hm7mmf4",
                    "score": 1,
                    "created_utc": 1637974839.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I hate danzo because every thing he does makes the world worse, and the fact that I hate him so much is a testament to how well written he is.\n\nEverything he does is \"For the sake of the village\" but he doesn't seem to realize that other villages could help, or that a good reputation could be beneficial in the future. He really is the overall bad guy throughout the entire series, the one who caused nearly every problem the village faced during his time, and every time you find out more about him, the worse he gets.\n\nAbsolute shithead, but a damn good one",
            "author": "Psychopathetic-",
            "id": "hm80ejj",
            "parent_id": "t1_hm7lm2f",
            "score": 3,
            "created_utc": 1637976629.0,
            "replies": [
                {
                    "body": "Play a \"what if\" game in your head and imagine how worse the 4th ninja war would have been.",
                    "author": "jinzokan",
                    "id": "hm8njz7",
                    "parent_id": "t1_hm80ejj",
                    "score": 1,
                    "created_utc": 1637988838.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hitler also think do best for germany",
            "author": "wantquitelife",
            "id": "hm8gvny",
            "parent_id": "t1_hm7lm2f",
            "score": 3,
            "created_utc": 1637985093.0,
            "replies": []
        },
        {
            "body": "no, he does what he thinks is best for the foundation.",
            "author": "ZlinkyNipz",
            "id": "hm7m8oq",
            "parent_id": "t1_hm7lm2f",
            "score": 3,
            "created_utc": 1637969522.0,
            "replies": [
                {
                    "body": "I really don't think he cares about the foundation any more than you'd care about a weapon. He made it clear that they were only there to do what he wants, and what they want is a non-factor",
                    "author": "Psychopathetic-",
                    "id": "hm813lm",
                    "parent_id": "t1_hm7m8oq",
                    "score": 2,
                    "created_utc": 1637976980.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "i also do not get the hate on him, but each time i mention that on here i get downvoted",
            "author": "DerDeutscheHund",
            "id": "hm7odwx",
            "parent_id": "t1_hm7lm2f",
            "score": 2,
            "created_utc": 1637970561.0,
            "replies": [
                {
                    "body": "I dislike Danzo but I think he is well written and his character spot is important. We don't see much in fighting from the leaf, and his character made the uneasy sense of we can't trust anyone, including friends. I feel it's why every watcher gets a big sense of relief seeing Kakashi show up in a scene. Someone insanely dependable. \n\nSPOILER: Imagine if a foundation agent or Danzo or someone was the one to save Irruka (sorry if I misspelled) during the Pain Arc? I wouldn't feel half as relieved cause who knows what the fucks gonna happen then.",
                    "author": "Slimxshadyx",
                    "id": "hm7trs6",
                    "parent_id": "t1_hm7odwx",
                    "score": 11,
                    "created_utc": 1637973254.0,
                    "replies": []
                },
                {
                    "body": "I just think he's a cool character",
                    "author": "Kappakoenig",
                    "id": "hm7pjhj",
                    "parent_id": "t1_hm7odwx",
                    "score": 8,
                    "created_utc": 1637971133.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well you have a point but the world doesn't think that way. \n\nThey want to be in the heaven but doesn't even want to know why there should be hell. \n\nThey want to have a easy life but don't want the hardwork.\n\nThat's the truth, so live it your way.",
            "author": "Broad_Shoe_779",
            "id": "hm9aa6o",
            "parent_id": "t1_hm7lm2f",
            "score": 1,
            "created_utc": 1638005195.0,
            "replies": []
        },
        {
            "body": "This",
            "author": "IAmYoDaddyDuh",
            "id": "hm8nca4",
            "parent_id": "t1_hm7teap",
            "score": -2,
            "created_utc": 1637988712.0,
            "replies": []
        },
        {
            "body": "I just play it off saying that if rasa wasn't the way he is, we might not have got the current gaara and I also like his gold style a lot",
            "author": "Familiar_Pay_3933",
            "id": "hm8z9vx",
            "parent_id": "t1_hm8atg0",
            "score": 1,
            "created_utc": 1637996329.0,
            "replies": []
        },
        {
            "body": "Anime memes are usually read from left to right, like you read manga.",
            "author": "hafiz_muhd_",
            "id": "hm988ht",
            "parent_id": "t1_hm8ogrf",
            "score": 1,
            "created_utc": 1638003430.0,
            "replies": []
        },
        {
            "body": "https://t.me/joinchat/07lIJ1OQuMg4Yzk0",
            "author": "PralineBeneficial431",
            "id": "hm8ece0",
            "parent_id": "t1_hm8eb1n",
            "score": 0,
            "created_utc": 1637983749.0,
            "replies": []
        },
        {
            "body": "https://t.me/joinchat/07lIJ1OQuMg4Yzk0",
            "author": "PralineBeneficial431",
            "id": "hm8ed2w",
            "parent_id": "t1_hm8eb1n",
            "score": 0,
            "created_utc": 1637983759.0,
            "replies": []
        },
        {
            "body": "https://t.me/joinchat/07lIJ1OQuMg4Yzk0",
            "author": "PralineBeneficial431",
            "id": "hm8edgv",
            "parent_id": "t1_hm8eb1n",
            "score": 1,
            "created_utc": 1637983765.0,
            "replies": []
        },
        {
            "body": "https://t.me/joinchat/07lIJ1OQuMg4Yzk0",
            "author": "PralineBeneficial431",
            "id": "hm8edsv",
            "parent_id": "t1_hm8eb1n",
            "score": 1,
            "created_utc": 1637983770.0,
            "replies": []
        },
        {
            "body": "FUCK the Kazekage. \n\nAlso, who's the dude in the 3rd panel down?",
            "author": "discerningpervert",
            "id": "hm9obha",
            "parent_id": "t1_hm98aw1",
            "score": 55,
            "created_utc": 1638016884.0,
            "replies": [
                {
                    "body": "He’s a piece of shit who yells at naruto for looking at the shit he was selling. Basically call him a broke bitch in front of a ton of people and Hinata tries to defend him or something and her keeper stops her",
                    "author": "Dear_Field_7182",
                    "id": "hm9oupk",
                    "parent_id": "t1_hm9obha",
                    "score": 92,
                    "created_utc": 1638017255.0,
                    "replies": [
                        {
                            "body": "Naruto should’ve thrown a rasengan up that guys butthole",
                            "author": "funny_gus",
                            "id": "hmaruhm",
                            "parent_id": "t1_hm9oupk",
                            "score": 4,
                            "created_utc": 1638036396.0,
                            "replies": [
                                {
                                    "body": "In a separate thread Op was talking about if a rasengan can kill and I think this guy should be the test dummy. I was saying he’s mastered it so he could probably do something similar in all 5 chakra natures and he should test them all on this guy.",
                                    "author": "Dear_Field_7182",
                                    "id": "hmbm8wd",
                                    "parent_id": "t1_hmaruhm",
                                    "score": 2,
                                    "created_utc": 1638049172.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "He was from a flashback that Naruto had a few times. In it the guy gets angry that Naruto is in his shop. Naruto was just looking at a cool mask. So the guy says, “oh? You want that? Take it!”\n\nHe pushes Naruto down and just fucking hurls it at his head. Then he gets a crowd of people to join in and they all start telling Naruto how much they hate him. Fun guy.\n\nEdit: Here’s the scene in question. Now that I think about it, I think this was part of a small filler three-parter after the Pain arc that is basically just Iruka looking back on his life up to that point and acknowledging how far Naruto has come. It’s actually very wholesome, I’d recommend it.\n\nhttps://youtu.be/POfboUjdpn4",
                    "author": "BiSaxual",
                    "id": "hm9p443",
                    "parent_id": "t1_hm9obha",
                    "score": 36,
                    "created_utc": 1638017431.0,
                    "replies": [
                        {
                            "body": "Ngl that stuff was at the beginning of Naruto I think.",
                            "author": "darknioss",
                            "id": "hma5dgg",
                            "parent_id": "t1_hm9p443",
                            "score": 4,
                            "created_utc": 1638026527.0,
                            "replies": [
                                {
                                    "body": "You’re probably right. There’s so many damn flashbacks in filler that it all just runs together lol",
                                    "author": "BiSaxual",
                                    "id": "hma8vac",
                                    "parent_id": "t1_hma5dgg",
                                    "score": 3,
                                    "created_utc": 1638028158.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Same",
            "author": "error5903",
            "id": "hmajg7d",
            "parent_id": "t1_hm98aw1",
            "score": 1,
            "created_utc": 1638032879.0,
            "replies": []
        },
        {
            "body": "Naruto was  PG shounen series ofcourse they wouldn't show that much of what Naruto truly faced ,  realistically speaking Naruto could have turned evil and went rogue before Sasuke even thought about it  , its his kind heart and him being an \"idiot\" what stopped this plot from happening  \n\n\nHonestly I even question if Naruto was brainwashed to stay loyal to his village at some point",
            "author": null,
            "id": "hm7o0jw",
            "parent_id": "t1_hm7jlkh",
            "score": 194,
            "created_utc": 1637970381.0,
            "replies": [
                {
                    "body": "Tbh the village reaction to Pain destroying the village looking for Naruto could’ve been really bad. Sure Naruto beat him and he made friends in the village, but the other villagers easily could’ve turned on him since Pain only destroyed the village because he was looking for Naruto",
                    "author": "britipinojeff",
                    "id": "hm7vhim",
                    "parent_id": "t1_hm7o0jw",
                    "score": 86,
                    "created_utc": 1637974128.0,
                    "replies": [
                        {
                            "body": "Hmm at this point in the story he’s become respected but since Pain literally killed Jiraiya who the village ninjas seems to respect, they wouldn’t care who he’s after",
                            "author": "Sealking13",
                            "id": "hm7z2d0",
                            "parent_id": "t1_hm7vhim",
                            "score": 56,
                            "created_utc": 1637975949.0,
                            "replies": []
                        },
                        {
                            "body": "Which wasn't true, pain hated konoha cause of danzo",
                            "author": "Conscious-News-4433",
                            "id": "hm9185m",
                            "parent_id": "t1_hm7vhim",
                            "score": 13,
                            "created_utc": 1637997769.0,
                            "replies": [
                                {
                                    "body": "I think he means the leaf villagers would like naruto since he got revenge for jiraiya by defeating pain, despite the fact pain destroyed konoha looking for naruto",
                                    "author": null,
                                    "id": "hm9o95p",
                                    "parent_id": "t1_hm9185m",
                                    "score": 10,
                                    "created_utc": 1638016841.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "TV Execs: “We can’t show child abuse that’s too far. Anyway for the next part of the series, let’s show all these kids participating in World War 3 as child soldiers and having one of them get brutally crushed and have his crush stabbed by his best friend.”",
                    "author": "SeductivePillowcase",
                    "id": "hm7u0mb",
                    "parent_id": "t1_hm7o0jw",
                    "score": 67,
                    "created_utc": 1637973376.0,
                    "replies": [
                        {
                            "body": "It would hit too close to home for people so I do get it tbh",
                            "author": "The_New_New",
                            "id": "hm8utgr",
                            "parent_id": "t1_hm7u0mb",
                            "score": 10,
                            "created_utc": 1637993285.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Naruto isn't an idiot at all. He took that persona to cope, that's why all the sad swing flashbacks lol. If he hadn't taken that, and for his good heart, he likely would've been a super Gaara.\n\nI also want to give giant credit to Minato for doing a pro sealing jutsu on Naruto with the nine tails and not a lame one. Gaara also couldn't control his beast and commonly slayed people, while Naruto had no corruption until much later.",
                    "author": "Slimxshadyx",
                    "id": "hm7tgwq",
                    "parent_id": "t1_hm7o0jw",
                    "score": 71,
                    "created_utc": 1637973105.0,
                    "replies": [
                        {
                            "body": "Naruto is definitely a idiot lol. Its a common anime thing, they're stupid af but also smart sometimes? look at Luffy or Goku",
                            "author": "ToyrewaDokoDeska",
                            "id": "hm80xcc",
                            "parent_id": "t1_hm7tgwq",
                            "score": 47,
                            "created_utc": 1637976892.0,
                            "replies": [
                                {
                                    "body": "Imbecile battle savant. Naruto, Ichigo, Goku... ancient trope tbh",
                                    "author": "eRHachan",
                                    "id": "hm9koy3",
                                    "parent_id": "t1_hm80xcc",
                                    "score": 10,
                                    "created_utc": 1638014096.0,
                                    "replies": [
                                        {
                                            "body": "Thank you, yes perfect title lol ill definitely use this",
                                            "author": "ToyrewaDokoDeska",
                                            "id": "hm9o3ok",
                                            "parent_id": "t1_hm9koy3",
                                            "score": 5,
                                            "created_utc": 1638016735.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Ichigo wasn't really an idiot though. At least not to the extent of Naruto and Goku.",
                                            "author": "monhunt",
                                            "id": "hma6mss",
                                            "parent_id": "t1_hm9koy3",
                                            "score": 4,
                                            "created_utc": 1638027133.0,
                                            "replies": [
                                                {
                                                    "body": "He was a bonafide punk who punched first and asked second. He wasn't brain-damaged like Goku, but he was pretty close.",
                                                    "author": "eRHachan",
                                                    "id": "hmaphyy",
                                                    "parent_id": "t1_hma6mss",
                                                    "score": 4,
                                                    "created_utc": 1638035421.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I think you've been reading too many fanfics. Hes an idiot. Hes a standard Shonen MC who has insanly good instincts. We see this in the series when he's alone, and with others",
                            "author": "xNuxIsGod",
                            "id": "hm8nukz",
                            "parent_id": "t1_hm7tgwq",
                            "score": 16,
                            "created_utc": 1637989009.0,
                            "replies": []
                        },
                        {
                            "body": "Minato could have sealed the good side of the Kyuubi in his son, but he gave him bad side lmao.",
                            "author": "SaveThemKillYourself",
                            "id": "hm80ik8",
                            "parent_id": "t1_hm7tgwq",
                            "score": -16,
                            "created_utc": 1637976687.0,
                            "replies": [
                                {
                                    "body": "Naruto was sealed with Yang-Kurama. Yang = positive, warm, light, and a slew of other things. Yin is the \"negative\" one.",
                                    "author": "Catlover18",
                                    "id": "hm80ync",
                                    "parent_id": "t1_hm80ik8",
                                    "score": 26,
                                    "created_utc": 1637976910.0,
                                    "replies": []
                                },
                                {
                                    "body": "He did though. The 9 tails is a massive ball of hate and distain for humans. The part Naruto got was the good side. He still had all his memory's, hence his dislike of humans and unwillingness to help them, but he never actively tried to harm them unless they bothered him or Naruto personally.",
                                    "author": "xNuxIsGod",
                                    "id": "hm8npbc",
                                    "parent_id": "t1_hm80ik8",
                                    "score": 10,
                                    "created_utc": 1637988924.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I like to think that some of the filler like these few episodes and some closing are cannon like the one when ramen guy gave him free ramen whe he was little",
                    "author": "CaptainBlaze22",
                    "id": "hm8supx",
                    "parent_id": "t1_hm7o0jw",
                    "score": 8,
                    "created_utc": 1637992029.0,
                    "replies": []
                },
                {
                    "body": "The village has a clan of mind rapists. Naruto is an idiot but also a savant.\n\nHim being brainwashed is supported by the setting quite handily. Basically, a certainty.",
                    "author": "Inimposter",
                    "id": "hm9e70s",
                    "parent_id": "t1_hm7o0jw",
                    "score": 4,
                    "created_utc": 1638008563.0,
                    "replies": []
                },
                {
                    "body": "you could say that about the show in general and not just Naruto.  even sasuke's trauma of being a genocide victim is arguably tame.then we have itachi who is probably the most unhuman character in the whole show, no wonder edgelords stan him so hard.",
                    "author": null,
                    "id": "hm82re8",
                    "parent_id": "t1_hm7o0jw",
                    "score": 8,
                    "created_utc": 1637977813.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wtf it being filler have to with anything? It’s still a controversial episode. Doesn’t mean people can’t talk about it or discuss it.",
            "author": "tonytonydavis",
            "id": "hm8humw",
            "parent_id": "t1_hm7jlkh",
            "score": 5,
            "created_utc": 1637985622.0,
            "replies": []
        },
        {
            "body": "Bullies",
            "author": "1313goo",
            "id": "hm7uya4",
            "parent_id": "t1_hm7jlkh",
            "score": 2,
            "created_utc": 1637973856.0,
            "replies": []
        },
        {
            "body": "This shows how shitty hiruzen was as hokage. Allowing people to mistreat a guy who had the power to raze the village again, instead of trying to fit him in the village, especially since he had no fault in what happened, was just dumb.",
            "author": "ravagerslb",
            "id": "hm9qzcc",
            "parent_id": "t1_hm7jlkh",
            "score": 2,
            "created_utc": 1638018667.0,
            "replies": []
        },
        {
            "body": "This! You explained it so well amazing",
            "author": "seahunter22",
            "id": "hma2cao",
            "parent_id": "t1_hm8lkts",
            "score": 2,
            "created_utc": 1638025059.0,
            "replies": []
        },
        {
            "body": "They didn't let them know he was Minato's son because those who hated his guts are gonna come for Naruto.",
            "author": "No2AccOfSumUser",
            "id": "hm9fry1",
            "parent_id": "t1_hm8nr4q",
            "score": 7,
            "created_utc": 1638009943.0,
            "replies": [
                {
                    "body": "But yeah it's fine to tell the entire public that he carries the strongest tailed beast\n\nYep nobody would go after him 100%",
                    "author": "vedat07taskiran",
                    "id": "hmb2a4l",
                    "parent_id": "t1_hm9fry1",
                    "score": 4,
                    "created_utc": 1638040808.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah that'd do it.",
            "author": "TheWinterPrince52",
            "id": "hm7vt7j",
            "parent_id": "t1_hm7ss8e",
            "score": 77,
            "created_utc": 1637974292.0,
            "replies": []
        },
        {
            "body": "He ended up giving Naruto the mask for free. That should put him just below Teuchi!",
            "author": "vvmello",
            "id": "hm87ktv",
            "parent_id": "t1_hm7ss8e",
            "score": 53,
            "created_utc": 1637980248.0,
            "replies": [
                {
                    "body": "Then Naruto wears the mask thrown at him to become an ANBU vigilante",
                    "author": "Yogami_asura",
                    "id": "hm8fea1",
                    "parent_id": "t1_hm87ktv",
                    "score": 38,
                    "created_utc": 1637984306.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Goddamn hated that guy, fkin bastard",
            "author": "Konoha__Shinobi",
            "id": "hm96up7",
            "parent_id": "t1_hm7ss8e",
            "score": 5,
            "created_utc": 1638002262.0,
            "replies": []
        },
        {
            "body": "Can you tell me the episode number",
            "author": "flying_jesus",
            "id": "hmaittv",
            "parent_id": "t1_hm7ss8e",
            "score": 2,
            "created_utc": 1638032606.0,
            "replies": []
        },
        {
            "body": "Naruto even had money and was gonna buy it 😭😭",
            "author": "BlackoutGaming1",
            "id": "hm85qep",
            "parent_id": "t1_hm7ubs5",
            "score": 43,
            "created_utc": 1637979316.0,
            "replies": []
        },
        {
            "body": "I'm stupid af  I thought the post was talking about how everyone in the village hated naruto",
            "author": "hereforthehentai6969",
            "id": "hm7y5aw",
            "parent_id": "t1_hm7ubs5",
            "score": 4,
            "created_utc": 1637975482.0,
            "replies": []
        },
        {
            "body": "LMFAO not Naruto, it's talking about the shop guy who yelled at him about looking at the masks. I hate that guy",
            "author": "Slimxshadyx",
            "id": "hm7tu05",
            "parent_id": "t1_hm7sef2",
            "score": 26,
            "created_utc": 1637973284.0,
            "replies": []
        },
        {
            "body": "Are you the one joking, or was Naruto the subject the whole time?  I thought we were talking about the dude Naruto seems to be talking to.",
            "author": "TheWinterPrince52",
            "id": "hm7sn9l",
            "parent_id": "t1_hm7sef2",
            "score": 4,
            "created_utc": 1637972686.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hm812ek",
            "parent_id": "t1_hm7t5ls",
            "score": -6,
            "created_utc": 1637976963.0,
            "replies": [
                {
                    "body": "Those who thinks Hinata is stronger have downs",
                    "author": "aicchisenpai",
                    "id": "hm84r5c",
                    "parent_id": "t1_hm812ek",
                    "score": -15,
                    "created_utc": 1637978813.0,
                    "replies": [
                        {
                            "body": "I mean, she does have SOSP chakra",
                            "author": "Conscious-News-4433",
                            "id": "hm91j0b",
                            "parent_id": "t1_hm84r5c",
                            "score": 3,
                            "created_utc": 1637998003.0,
                            "replies": []
                        },
                        {
                            "body": "Sakura is obv. stronger, but Hinata is better written",
                            "author": "Economy_Ice5190",
                            "id": "hm972gu",
                            "parent_id": "t1_hm84r5c",
                            "score": 3,
                            "created_utc": 1638002440.0,
                            "replies": [
                                {
                                    "body": "The number of my downvotes says otherwise. And Hinata isn’t better written. She kept saying Naruto this Naruto that the entire time. She only stopped doing that when Boruto exists. The author just suck at writing female characters",
                                    "author": "aicchisenpai",
                                    "id": "hm9jwd3",
                                    "parent_id": "t1_hm972gu",
                                    "score": -1,
                                    "created_utc": 1638013442.0,
                                    "replies": [
                                        {
                                            "body": "Hinata still feels much betfer written than Sakura though because she atleast had a compelling backstory. I agree with her not being a well written character completely though. Also, since Sakura was a main character, we definitely expected much more from her in comparison to Hinata.",
                                            "author": "Tarkik_Vatsa",
                                            "id": "hm9s6ap",
                                            "parent_id": "t1_hm9jwd3",
                                            "score": 2,
                                            "created_utc": 1638019413.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "“Most people rejected his message. \nThey hated him because he told them the truth.”",
                            "author": "AstronautAmazing7046",
                            "id": "hm8hyp0",
                            "parent_id": "t1_hm84r5c",
                            "score": 0,
                            "created_utc": 1637985685.0,
                            "replies": [
                                {
                                    "body": "Which message?",
                                    "author": "IAmYoDaddyDuh",
                                    "id": "hm8nfcl",
                                    "parent_id": "t1_hm8hyp0",
                                    "score": 3,
                                    "created_utc": 1637988761.0,
                                    "replies": [
                                        {
                                            "body": "Kishomoto’s message since he confirmed that she’s stronger, facts over feelings",
                                            "author": "AstronautAmazing7046",
                                            "id": "hma9j49",
                                            "parent_id": "t1_hm8nfcl",
                                            "score": 1,
                                            "created_utc": 1638028457.0,
                                            "replies": [
                                                {
                                                    "body": "Sakura is stronger than Hinata?",
                                                    "author": "IAmYoDaddyDuh",
                                                    "id": "hmaiw68",
                                                    "parent_id": "t1_hma9j49",
                                                    "score": 0,
                                                    "created_utc": 1638032634.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes, she surpassed Tsunade and the author said she’s the strongest Kunoichi in the leaf. Hinata has close range attacks to stop chakra, but sakura is faster and is physically stronger so it’s unlike hinata would even touch her . But even if hinata hit a chakra point, kakashi already mentioned sakuras chakra control was better than naruto and sasukes. This doesn’t mean she’s stronger than them though, Chakra control is her strong point which is why hinata who stops chakra is no match for her as sakura can control it. \n\nShe’s the only one besides tsunade able to do Strength Of A Hundred Seal and summon Katsuuya, now if we look a tsunade who did those things too, out of all the kages fighting against madara, it’s her strength he was more impressed by, she was the last one conscious and gave her left over strength to heal the other Kages. Say if hinata were to even match her speed and stop a chakra point, sakura’s technique means she stores an abundance of chakra in her seal and can reactivate it in her body, hinata can’t cut of her chakra as she can supply it again and again. Sakura is the same person who got stabbed by madara (as a decoy) and just healed herself from it, the same day sasuke almost died from madaras stab before he was given god-like powers. Hinata would not survive from a stab like that. It’s clear that sakura could end her and would be the last one standing.",
                                                            "author": "AstronautAmazing7046",
                                                            "id": "hmam12q",
                                                            "parent_id": "t1_hmaiw68",
                                                            "score": 1,
                                                            "created_utc": 1638033982.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not to mention \"you made friends?!\"",
            "author": null,
            "id": "hm86evp",
            "parent_id": "t1_hm863rr",
            "score": 23,
            "created_utc": 1637979662.0,
            "replies": [
                {
                    "body": "I still like Gaaras down",
                    "author": "IAmYoDaddyDuh",
                    "id": "hm8na3m",
                    "parent_id": "t1_hm86evp",
                    "score": 2,
                    "created_utc": 1637988678.0,
                    "replies": []
                },
                {
                    "body": "To be fair, Gaara last the Kazekage saw him was a bit... unhinged (due to the dad's fault obviously)",
                    "author": "The_New_New",
                    "id": "hm8v0gl",
                    "parent_id": "t1_hm86evp",
                    "score": 2,
                    "created_utc": 1637993413.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I hate Gaara's dad as much as any other person here but IIRC making Gaara a Jinchuriki was a decision which everyone in the council told him to make. Granny Chiyo mentioned something like this in the first arc of Shippuden. Gaara's dad looked a good husband and dad before the birth of Gaara. Maybe it was the death of Gaara's mom that turned him into a complete asshole.",
            "author": "Tarkik_Vatsa",
            "id": "hm8y89j",
            "parent_id": "t1_hm863rr",
            "score": 3,
            "created_utc": 1637995593.0,
            "replies": [
                {
                    "body": "Still doesnt excuse SENDING ASSASSINS AFTER YOUR SON",
                    "author": "Few_Pay_5313",
                    "id": "hm8zudt",
                    "parent_id": "t1_hm8y89j",
                    "score": 3,
                    "created_utc": 1637996733.0,
                    "replies": [
                        {
                            "body": "I completely agree. And that too sending the only person who showed love to Gaara.",
                            "author": "Tarkik_Vatsa",
                            "id": "hm90ims",
                            "parent_id": "t1_hm8zudt",
                            "score": 2,
                            "created_utc": 1637997236.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "r/wooosh",
            "author": "psychoticchicken1",
            "id": "hm835y5",
            "parent_id": "t1_hm82qkc",
            "score": 7,
            "created_utc": 1637978015.0,
            "replies": []
        },
        {
            "body": "You literally explained why he is great villain",
            "author": "zerquet",
            "id": "hm7v09q",
            "parent_id": "t1_hm7mmf4",
            "score": 2,
            "created_utc": 1637973884.0,
            "replies": [
                {
                    "body": "Honestly to me a great villain is someone that you can see where they came from and why they'd think what they're doing is the right thing to do.\n\nItachi killed his clan for the sake of the village \n\nMadara wanted a perfect world for everyone\n\nPain was sick of his village being a battleground and wanted everyone to realize the hell he loved through\n\nDanzo was just a shithead that did evil shit for his own gain",
                    "author": "Psychopathetic-",
                    "id": "hm80uyh",
                    "parent_id": "t1_hm7v09q",
                    "score": 8,
                    "created_utc": 1637976858.0,
                    "replies": [
                        {
                            "body": "Pain is undoubtedly the best though. No one, not even Madara, had the presence that Pain had. Madara was super badass but no one gave me the chills that Pain gave.",
                            "author": "Tarkik_Vatsa",
                            "id": "hm8ygjq",
                            "parent_id": "t1_hm80uyh",
                            "score": 3,
                            "created_utc": 1637995753.0,
                            "replies": [
                                {
                                    "body": "Oh absolutely, Pain was the absolute GOAT, all the way till his death",
                                    "author": "Psychopathetic-",
                                    "id": "hm8ylbg",
                                    "parent_id": "t1_hm8ygjq",
                                    "score": 2,
                                    "created_utc": 1637995844.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Well to me he was pretty lit but also a little wild. To me the fact that so many people hate him just proves his character is great",
                            "author": "zerquet",
                            "id": "hm883sb",
                            "parent_id": "t1_hm80uyh",
                            "score": 1,
                            "created_utc": 1637980513.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just want to point out this mentality Danzo helped implement into the leaf village arguably helped foster a undeniable balance of powerful and capable shinobi towards the leaf village in literal world ending events.",
            "author": "jinzokan",
            "id": "hm8n2ne",
            "parent_id": "t1_hm7mmf4",
            "score": 0,
            "created_utc": 1637988558.0,
            "replies": []
        },
        {
            "body": "Facts!",
            "author": null,
            "id": "hm7wvdm",
            "parent_id": "t1_hm7mmf4",
            "score": 1,
            "created_utc": 1637974839.0,
            "replies": []
        },
        {
            "body": "Play a \"what if\" game in your head and imagine how worse the 4th ninja war would have been.",
            "author": "jinzokan",
            "id": "hm8njz7",
            "parent_id": "t1_hm80ejj",
            "score": 1,
            "created_utc": 1637988838.0,
            "replies": []
        },
        {
            "body": "I really don't think he cares about the foundation any more than you'd care about a weapon. He made it clear that they were only there to do what he wants, and what they want is a non-factor",
            "author": "Psychopathetic-",
            "id": "hm813lm",
            "parent_id": "t1_hm7m8oq",
            "score": 2,
            "created_utc": 1637976980.0,
            "replies": []
        },
        {
            "body": "I dislike Danzo but I think he is well written and his character spot is important. We don't see much in fighting from the leaf, and his character made the uneasy sense of we can't trust anyone, including friends. I feel it's why every watcher gets a big sense of relief seeing Kakashi show up in a scene. Someone insanely dependable. \n\nSPOILER: Imagine if a foundation agent or Danzo or someone was the one to save Irruka (sorry if I misspelled) during the Pain Arc? I wouldn't feel half as relieved cause who knows what the fucks gonna happen then.",
            "author": "Slimxshadyx",
            "id": "hm7trs6",
            "parent_id": "t1_hm7odwx",
            "score": 11,
            "created_utc": 1637973254.0,
            "replies": []
        },
        {
            "body": "I just think he's a cool character",
            "author": "Kappakoenig",
            "id": "hm7pjhj",
            "parent_id": "t1_hm7odwx",
            "score": 8,
            "created_utc": 1637971133.0,
            "replies": []
        },
        {
            "body": "He’s a piece of shit who yells at naruto for looking at the shit he was selling. Basically call him a broke bitch in front of a ton of people and Hinata tries to defend him or something and her keeper stops her",
            "author": "Dear_Field_7182",
            "id": "hm9oupk",
            "parent_id": "t1_hm9obha",
            "score": 92,
            "created_utc": 1638017255.0,
            "replies": [
                {
                    "body": "Naruto should’ve thrown a rasengan up that guys butthole",
                    "author": "funny_gus",
                    "id": "hmaruhm",
                    "parent_id": "t1_hm9oupk",
                    "score": 4,
                    "created_utc": 1638036396.0,
                    "replies": [
                        {
                            "body": "In a separate thread Op was talking about if a rasengan can kill and I think this guy should be the test dummy. I was saying he’s mastered it so he could probably do something similar in all 5 chakra natures and he should test them all on this guy.",
                            "author": "Dear_Field_7182",
                            "id": "hmbm8wd",
                            "parent_id": "t1_hmaruhm",
                            "score": 2,
                            "created_utc": 1638049172.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He was from a flashback that Naruto had a few times. In it the guy gets angry that Naruto is in his shop. Naruto was just looking at a cool mask. So the guy says, “oh? You want that? Take it!”\n\nHe pushes Naruto down and just fucking hurls it at his head. Then he gets a crowd of people to join in and they all start telling Naruto how much they hate him. Fun guy.\n\nEdit: Here’s the scene in question. Now that I think about it, I think this was part of a small filler three-parter after the Pain arc that is basically just Iruka looking back on his life up to that point and acknowledging how far Naruto has come. It’s actually very wholesome, I’d recommend it.\n\nhttps://youtu.be/POfboUjdpn4",
            "author": "BiSaxual",
            "id": "hm9p443",
            "parent_id": "t1_hm9obha",
            "score": 36,
            "created_utc": 1638017431.0,
            "replies": [
                {
                    "body": "Ngl that stuff was at the beginning of Naruto I think.",
                    "author": "darknioss",
                    "id": "hma5dgg",
                    "parent_id": "t1_hm9p443",
                    "score": 4,
                    "created_utc": 1638026527.0,
                    "replies": [
                        {
                            "body": "You’re probably right. There’s so many damn flashbacks in filler that it all just runs together lol",
                            "author": "BiSaxual",
                            "id": "hma8vac",
                            "parent_id": "t1_hma5dgg",
                            "score": 3,
                            "created_utc": 1638028158.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tbh the village reaction to Pain destroying the village looking for Naruto could’ve been really bad. Sure Naruto beat him and he made friends in the village, but the other villagers easily could’ve turned on him since Pain only destroyed the village because he was looking for Naruto",
            "author": "britipinojeff",
            "id": "hm7vhim",
            "parent_id": "t1_hm7o0jw",
            "score": 86,
            "created_utc": 1637974128.0,
            "replies": [
                {
                    "body": "Hmm at this point in the story he’s become respected but since Pain literally killed Jiraiya who the village ninjas seems to respect, they wouldn’t care who he’s after",
                    "author": "Sealking13",
                    "id": "hm7z2d0",
                    "parent_id": "t1_hm7vhim",
                    "score": 56,
                    "created_utc": 1637975949.0,
                    "replies": []
                },
                {
                    "body": "Which wasn't true, pain hated konoha cause of danzo",
                    "author": "Conscious-News-4433",
                    "id": "hm9185m",
                    "parent_id": "t1_hm7vhim",
                    "score": 13,
                    "created_utc": 1637997769.0,
                    "replies": [
                        {
                            "body": "I think he means the leaf villagers would like naruto since he got revenge for jiraiya by defeating pain, despite the fact pain destroyed konoha looking for naruto",
                            "author": null,
                            "id": "hm9o95p",
                            "parent_id": "t1_hm9185m",
                            "score": 10,
                            "created_utc": 1638016841.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "TV Execs: “We can’t show child abuse that’s too far. Anyway for the next part of the series, let’s show all these kids participating in World War 3 as child soldiers and having one of them get brutally crushed and have his crush stabbed by his best friend.”",
            "author": "SeductivePillowcase",
            "id": "hm7u0mb",
            "parent_id": "t1_hm7o0jw",
            "score": 67,
            "created_utc": 1637973376.0,
            "replies": [
                {
                    "body": "It would hit too close to home for people so I do get it tbh",
                    "author": "The_New_New",
                    "id": "hm8utgr",
                    "parent_id": "t1_hm7u0mb",
                    "score": 10,
                    "created_utc": 1637993285.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Naruto isn't an idiot at all. He took that persona to cope, that's why all the sad swing flashbacks lol. If he hadn't taken that, and for his good heart, he likely would've been a super Gaara.\n\nI also want to give giant credit to Minato for doing a pro sealing jutsu on Naruto with the nine tails and not a lame one. Gaara also couldn't control his beast and commonly slayed people, while Naruto had no corruption until much later.",
            "author": "Slimxshadyx",
            "id": "hm7tgwq",
            "parent_id": "t1_hm7o0jw",
            "score": 71,
            "created_utc": 1637973105.0,
            "replies": [
                {
                    "body": "Naruto is definitely a idiot lol. Its a common anime thing, they're stupid af but also smart sometimes? look at Luffy or Goku",
                    "author": "ToyrewaDokoDeska",
                    "id": "hm80xcc",
                    "parent_id": "t1_hm7tgwq",
                    "score": 47,
                    "created_utc": 1637976892.0,
                    "replies": [
                        {
                            "body": "Imbecile battle savant. Naruto, Ichigo, Goku... ancient trope tbh",
                            "author": "eRHachan",
                            "id": "hm9koy3",
                            "parent_id": "t1_hm80xcc",
                            "score": 10,
                            "created_utc": 1638014096.0,
                            "replies": [
                                {
                                    "body": "Thank you, yes perfect title lol ill definitely use this",
                                    "author": "ToyrewaDokoDeska",
                                    "id": "hm9o3ok",
                                    "parent_id": "t1_hm9koy3",
                                    "score": 5,
                                    "created_utc": 1638016735.0,
                                    "replies": []
                                },
                                {
                                    "body": "Ichigo wasn't really an idiot though. At least not to the extent of Naruto and Goku.",
                                    "author": "monhunt",
                                    "id": "hma6mss",
                                    "parent_id": "t1_hm9koy3",
                                    "score": 4,
                                    "created_utc": 1638027133.0,
                                    "replies": [
                                        {
                                            "body": "He was a bonafide punk who punched first and asked second. He wasn't brain-damaged like Goku, but he was pretty close.",
                                            "author": "eRHachan",
                                            "id": "hmaphyy",
                                            "parent_id": "t1_hma6mss",
                                            "score": 4,
                                            "created_utc": 1638035421.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I think you've been reading too many fanfics. Hes an idiot. Hes a standard Shonen MC who has insanly good instincts. We see this in the series when he's alone, and with others",
                    "author": "xNuxIsGod",
                    "id": "hm8nukz",
                    "parent_id": "t1_hm7tgwq",
                    "score": 16,
                    "created_utc": 1637989009.0,
                    "replies": []
                },
                {
                    "body": "Minato could have sealed the good side of the Kyuubi in his son, but he gave him bad side lmao.",
                    "author": "SaveThemKillYourself",
                    "id": "hm80ik8",
                    "parent_id": "t1_hm7tgwq",
                    "score": -16,
                    "created_utc": 1637976687.0,
                    "replies": [
                        {
                            "body": "Naruto was sealed with Yang-Kurama. Yang = positive, warm, light, and a slew of other things. Yin is the \"negative\" one.",
                            "author": "Catlover18",
                            "id": "hm80ync",
                            "parent_id": "t1_hm80ik8",
                            "score": 26,
                            "created_utc": 1637976910.0,
                            "replies": []
                        },
                        {
                            "body": "He did though. The 9 tails is a massive ball of hate and distain for humans. The part Naruto got was the good side. He still had all his memory's, hence his dislike of humans and unwillingness to help them, but he never actively tried to harm them unless they bothered him or Naruto personally.",
                            "author": "xNuxIsGod",
                            "id": "hm8npbc",
                            "parent_id": "t1_hm80ik8",
                            "score": 10,
                            "created_utc": 1637988924.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I like to think that some of the filler like these few episodes and some closing are cannon like the one when ramen guy gave him free ramen whe he was little",
            "author": "CaptainBlaze22",
            "id": "hm8supx",
            "parent_id": "t1_hm7o0jw",
            "score": 8,
            "created_utc": 1637992029.0,
            "replies": []
        },
        {
            "body": "The village has a clan of mind rapists. Naruto is an idiot but also a savant.\n\nHim being brainwashed is supported by the setting quite handily. Basically, a certainty.",
            "author": "Inimposter",
            "id": "hm9e70s",
            "parent_id": "t1_hm7o0jw",
            "score": 4,
            "created_utc": 1638008563.0,
            "replies": []
        },
        {
            "body": "you could say that about the show in general and not just Naruto.  even sasuke's trauma of being a genocide victim is arguably tame.then we have itachi who is probably the most unhuman character in the whole show, no wonder edgelords stan him so hard.",
            "author": null,
            "id": "hm82re8",
            "parent_id": "t1_hm7o0jw",
            "score": 8,
            "created_utc": 1637977813.0,
            "replies": []
        },
        {
            "body": "But yeah it's fine to tell the entire public that he carries the strongest tailed beast\n\nYep nobody would go after him 100%",
            "author": "vedat07taskiran",
            "id": "hmb2a4l",
            "parent_id": "t1_hm9fry1",
            "score": 4,
            "created_utc": 1638040808.0,
            "replies": []
        },
        {
            "body": "Then Naruto wears the mask thrown at him to become an ANBU vigilante",
            "author": "Yogami_asura",
            "id": "hm8fea1",
            "parent_id": "t1_hm87ktv",
            "score": 38,
            "created_utc": 1637984306.0,
            "replies": []
        },
        {
            "body": "Those who thinks Hinata is stronger have downs",
            "author": "aicchisenpai",
            "id": "hm84r5c",
            "parent_id": "t1_hm812ek",
            "score": -15,
            "created_utc": 1637978813.0,
            "replies": [
                {
                    "body": "I mean, she does have SOSP chakra",
                    "author": "Conscious-News-4433",
                    "id": "hm91j0b",
                    "parent_id": "t1_hm84r5c",
                    "score": 3,
                    "created_utc": 1637998003.0,
                    "replies": []
                },
                {
                    "body": "Sakura is obv. stronger, but Hinata is better written",
                    "author": "Economy_Ice5190",
                    "id": "hm972gu",
                    "parent_id": "t1_hm84r5c",
                    "score": 3,
                    "created_utc": 1638002440.0,
                    "replies": [
                        {
                            "body": "The number of my downvotes says otherwise. And Hinata isn’t better written. She kept saying Naruto this Naruto that the entire time. She only stopped doing that when Boruto exists. The author just suck at writing female characters",
                            "author": "aicchisenpai",
                            "id": "hm9jwd3",
                            "parent_id": "t1_hm972gu",
                            "score": -1,
                            "created_utc": 1638013442.0,
                            "replies": [
                                {
                                    "body": "Hinata still feels much betfer written than Sakura though because she atleast had a compelling backstory. I agree with her not being a well written character completely though. Also, since Sakura was a main character, we definitely expected much more from her in comparison to Hinata.",
                                    "author": "Tarkik_Vatsa",
                                    "id": "hm9s6ap",
                                    "parent_id": "t1_hm9jwd3",
                                    "score": 2,
                                    "created_utc": 1638019413.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "“Most people rejected his message. \nThey hated him because he told them the truth.”",
                    "author": "AstronautAmazing7046",
                    "id": "hm8hyp0",
                    "parent_id": "t1_hm84r5c",
                    "score": 0,
                    "created_utc": 1637985685.0,
                    "replies": [
                        {
                            "body": "Which message?",
                            "author": "IAmYoDaddyDuh",
                            "id": "hm8nfcl",
                            "parent_id": "t1_hm8hyp0",
                            "score": 3,
                            "created_utc": 1637988761.0,
                            "replies": [
                                {
                                    "body": "Kishomoto’s message since he confirmed that she’s stronger, facts over feelings",
                                    "author": "AstronautAmazing7046",
                                    "id": "hma9j49",
                                    "parent_id": "t1_hm8nfcl",
                                    "score": 1,
                                    "created_utc": 1638028457.0,
                                    "replies": [
                                        {
                                            "body": "Sakura is stronger than Hinata?",
                                            "author": "IAmYoDaddyDuh",
                                            "id": "hmaiw68",
                                            "parent_id": "t1_hma9j49",
                                            "score": 0,
                                            "created_utc": 1638032634.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, she surpassed Tsunade and the author said she’s the strongest Kunoichi in the leaf. Hinata has close range attacks to stop chakra, but sakura is faster and is physically stronger so it’s unlike hinata would even touch her . But even if hinata hit a chakra point, kakashi already mentioned sakuras chakra control was better than naruto and sasukes. This doesn’t mean she’s stronger than them though, Chakra control is her strong point which is why hinata who stops chakra is no match for her as sakura can control it. \n\nShe’s the only one besides tsunade able to do Strength Of A Hundred Seal and summon Katsuuya, now if we look a tsunade who did those things too, out of all the kages fighting against madara, it’s her strength he was more impressed by, she was the last one conscious and gave her left over strength to heal the other Kages. Say if hinata were to even match her speed and stop a chakra point, sakura’s technique means she stores an abundance of chakra in her seal and can reactivate it in her body, hinata can’t cut of her chakra as she can supply it again and again. Sakura is the same person who got stabbed by madara (as a decoy) and just healed herself from it, the same day sasuke almost died from madaras stab before he was given god-like powers. Hinata would not survive from a stab like that. It’s clear that sakura could end her and would be the last one standing.",
                                                    "author": "AstronautAmazing7046",
                                                    "id": "hmam12q",
                                                    "parent_id": "t1_hmaiw68",
                                                    "score": 1,
                                                    "created_utc": 1638033982.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I still like Gaaras down",
            "author": "IAmYoDaddyDuh",
            "id": "hm8na3m",
            "parent_id": "t1_hm86evp",
            "score": 2,
            "created_utc": 1637988678.0,
            "replies": []
        },
        {
            "body": "To be fair, Gaara last the Kazekage saw him was a bit... unhinged (due to the dad's fault obviously)",
            "author": "The_New_New",
            "id": "hm8v0gl",
            "parent_id": "t1_hm86evp",
            "score": 2,
            "created_utc": 1637993413.0,
            "replies": []
        },
        {
            "body": "Still doesnt excuse SENDING ASSASSINS AFTER YOUR SON",
            "author": "Few_Pay_5313",
            "id": "hm8zudt",
            "parent_id": "t1_hm8y89j",
            "score": 3,
            "created_utc": 1637996733.0,
            "replies": [
                {
                    "body": "I completely agree. And that too sending the only person who showed love to Gaara.",
                    "author": "Tarkik_Vatsa",
                    "id": "hm90ims",
                    "parent_id": "t1_hm8zudt",
                    "score": 2,
                    "created_utc": 1637997236.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly to me a great villain is someone that you can see where they came from and why they'd think what they're doing is the right thing to do.\n\nItachi killed his clan for the sake of the village \n\nMadara wanted a perfect world for everyone\n\nPain was sick of his village being a battleground and wanted everyone to realize the hell he loved through\n\nDanzo was just a shithead that did evil shit for his own gain",
            "author": "Psychopathetic-",
            "id": "hm80uyh",
            "parent_id": "t1_hm7v09q",
            "score": 8,
            "created_utc": 1637976858.0,
            "replies": [
                {
                    "body": "Pain is undoubtedly the best though. No one, not even Madara, had the presence that Pain had. Madara was super badass but no one gave me the chills that Pain gave.",
                    "author": "Tarkik_Vatsa",
                    "id": "hm8ygjq",
                    "parent_id": "t1_hm80uyh",
                    "score": 3,
                    "created_utc": 1637995753.0,
                    "replies": [
                        {
                            "body": "Oh absolutely, Pain was the absolute GOAT, all the way till his death",
                            "author": "Psychopathetic-",
                            "id": "hm8ylbg",
                            "parent_id": "t1_hm8ygjq",
                            "score": 2,
                            "created_utc": 1637995844.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Well to me he was pretty lit but also a little wild. To me the fact that so many people hate him just proves his character is great",
                    "author": "zerquet",
                    "id": "hm883sb",
                    "parent_id": "t1_hm80uyh",
                    "score": 1,
                    "created_utc": 1637980513.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Naruto should’ve thrown a rasengan up that guys butthole",
            "author": "funny_gus",
            "id": "hmaruhm",
            "parent_id": "t1_hm9oupk",
            "score": 4,
            "created_utc": 1638036396.0,
            "replies": [
                {
                    "body": "In a separate thread Op was talking about if a rasengan can kill and I think this guy should be the test dummy. I was saying he’s mastered it so he could probably do something similar in all 5 chakra natures and he should test them all on this guy.",
                    "author": "Dear_Field_7182",
                    "id": "hmbm8wd",
                    "parent_id": "t1_hmaruhm",
                    "score": 2,
                    "created_utc": 1638049172.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ngl that stuff was at the beginning of Naruto I think.",
            "author": "darknioss",
            "id": "hma5dgg",
            "parent_id": "t1_hm9p443",
            "score": 4,
            "created_utc": 1638026527.0,
            "replies": [
                {
                    "body": "You’re probably right. There’s so many damn flashbacks in filler that it all just runs together lol",
                    "author": "BiSaxual",
                    "id": "hma8vac",
                    "parent_id": "t1_hma5dgg",
                    "score": 3,
                    "created_utc": 1638028158.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hmm at this point in the story he’s become respected but since Pain literally killed Jiraiya who the village ninjas seems to respect, they wouldn’t care who he’s after",
            "author": "Sealking13",
            "id": "hm7z2d0",
            "parent_id": "t1_hm7vhim",
            "score": 56,
            "created_utc": 1637975949.0,
            "replies": []
        },
        {
            "body": "Which wasn't true, pain hated konoha cause of danzo",
            "author": "Conscious-News-4433",
            "id": "hm9185m",
            "parent_id": "t1_hm7vhim",
            "score": 13,
            "created_utc": 1637997769.0,
            "replies": [
                {
                    "body": "I think he means the leaf villagers would like naruto since he got revenge for jiraiya by defeating pain, despite the fact pain destroyed konoha looking for naruto",
                    "author": null,
                    "id": "hm9o95p",
                    "parent_id": "t1_hm9185m",
                    "score": 10,
                    "created_utc": 1638016841.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It would hit too close to home for people so I do get it tbh",
            "author": "The_New_New",
            "id": "hm8utgr",
            "parent_id": "t1_hm7u0mb",
            "score": 10,
            "created_utc": 1637993285.0,
            "replies": []
        },
        {
            "body": "Naruto is definitely a idiot lol. Its a common anime thing, they're stupid af but also smart sometimes? look at Luffy or Goku",
            "author": "ToyrewaDokoDeska",
            "id": "hm80xcc",
            "parent_id": "t1_hm7tgwq",
            "score": 47,
            "created_utc": 1637976892.0,
            "replies": [
                {
                    "body": "Imbecile battle savant. Naruto, Ichigo, Goku... ancient trope tbh",
                    "author": "eRHachan",
                    "id": "hm9koy3",
                    "parent_id": "t1_hm80xcc",
                    "score": 10,
                    "created_utc": 1638014096.0,
                    "replies": [
                        {
                            "body": "Thank you, yes perfect title lol ill definitely use this",
                            "author": "ToyrewaDokoDeska",
                            "id": "hm9o3ok",
                            "parent_id": "t1_hm9koy3",
                            "score": 5,
                            "created_utc": 1638016735.0,
                            "replies": []
                        },
                        {
                            "body": "Ichigo wasn't really an idiot though. At least not to the extent of Naruto and Goku.",
                            "author": "monhunt",
                            "id": "hma6mss",
                            "parent_id": "t1_hm9koy3",
                            "score": 4,
                            "created_utc": 1638027133.0,
                            "replies": [
                                {
                                    "body": "He was a bonafide punk who punched first and asked second. He wasn't brain-damaged like Goku, but he was pretty close.",
                                    "author": "eRHachan",
                                    "id": "hmaphyy",
                                    "parent_id": "t1_hma6mss",
                                    "score": 4,
                                    "created_utc": 1638035421.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think you've been reading too many fanfics. Hes an idiot. Hes a standard Shonen MC who has insanly good instincts. We see this in the series when he's alone, and with others",
            "author": "xNuxIsGod",
            "id": "hm8nukz",
            "parent_id": "t1_hm7tgwq",
            "score": 16,
            "created_utc": 1637989009.0,
            "replies": []
        },
        {
            "body": "Minato could have sealed the good side of the Kyuubi in his son, but he gave him bad side lmao.",
            "author": "SaveThemKillYourself",
            "id": "hm80ik8",
            "parent_id": "t1_hm7tgwq",
            "score": -16,
            "created_utc": 1637976687.0,
            "replies": [
                {
                    "body": "Naruto was sealed with Yang-Kurama. Yang = positive, warm, light, and a slew of other things. Yin is the \"negative\" one.",
                    "author": "Catlover18",
                    "id": "hm80ync",
                    "parent_id": "t1_hm80ik8",
                    "score": 26,
                    "created_utc": 1637976910.0,
                    "replies": []
                },
                {
                    "body": "He did though. The 9 tails is a massive ball of hate and distain for humans. The part Naruto got was the good side. He still had all his memory's, hence his dislike of humans and unwillingness to help them, but he never actively tried to harm them unless they bothered him or Naruto personally.",
                    "author": "xNuxIsGod",
                    "id": "hm8npbc",
                    "parent_id": "t1_hm80ik8",
                    "score": 10,
                    "created_utc": 1637988924.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean, she does have SOSP chakra",
            "author": "Conscious-News-4433",
            "id": "hm91j0b",
            "parent_id": "t1_hm84r5c",
            "score": 3,
            "created_utc": 1637998003.0,
            "replies": []
        },
        {
            "body": "Sakura is obv. stronger, but Hinata is better written",
            "author": "Economy_Ice5190",
            "id": "hm972gu",
            "parent_id": "t1_hm84r5c",
            "score": 3,
            "created_utc": 1638002440.0,
            "replies": [
                {
                    "body": "The number of my downvotes says otherwise. And Hinata isn’t better written. She kept saying Naruto this Naruto that the entire time. She only stopped doing that when Boruto exists. The author just suck at writing female characters",
                    "author": "aicchisenpai",
                    "id": "hm9jwd3",
                    "parent_id": "t1_hm972gu",
                    "score": -1,
                    "created_utc": 1638013442.0,
                    "replies": [
                        {
                            "body": "Hinata still feels much betfer written than Sakura though because she atleast had a compelling backstory. I agree with her not being a well written character completely though. Also, since Sakura was a main character, we definitely expected much more from her in comparison to Hinata.",
                            "author": "Tarkik_Vatsa",
                            "id": "hm9s6ap",
                            "parent_id": "t1_hm9jwd3",
                            "score": 2,
                            "created_utc": 1638019413.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "“Most people rejected his message. \nThey hated him because he told them the truth.”",
            "author": "AstronautAmazing7046",
            "id": "hm8hyp0",
            "parent_id": "t1_hm84r5c",
            "score": 0,
            "created_utc": 1637985685.0,
            "replies": [
                {
                    "body": "Which message?",
                    "author": "IAmYoDaddyDuh",
                    "id": "hm8nfcl",
                    "parent_id": "t1_hm8hyp0",
                    "score": 3,
                    "created_utc": 1637988761.0,
                    "replies": [
                        {
                            "body": "Kishomoto’s message since he confirmed that she’s stronger, facts over feelings",
                            "author": "AstronautAmazing7046",
                            "id": "hma9j49",
                            "parent_id": "t1_hm8nfcl",
                            "score": 1,
                            "created_utc": 1638028457.0,
                            "replies": [
                                {
                                    "body": "Sakura is stronger than Hinata?",
                                    "author": "IAmYoDaddyDuh",
                                    "id": "hmaiw68",
                                    "parent_id": "t1_hma9j49",
                                    "score": 0,
                                    "created_utc": 1638032634.0,
                                    "replies": [
                                        {
                                            "body": "Yes, she surpassed Tsunade and the author said she’s the strongest Kunoichi in the leaf. Hinata has close range attacks to stop chakra, but sakura is faster and is physically stronger so it’s unlike hinata would even touch her . But even if hinata hit a chakra point, kakashi already mentioned sakuras chakra control was better than naruto and sasukes. This doesn’t mean she’s stronger than them though, Chakra control is her strong point which is why hinata who stops chakra is no match for her as sakura can control it. \n\nShe’s the only one besides tsunade able to do Strength Of A Hundred Seal and summon Katsuuya, now if we look a tsunade who did those things too, out of all the kages fighting against madara, it’s her strength he was more impressed by, she was the last one conscious and gave her left over strength to heal the other Kages. Say if hinata were to even match her speed and stop a chakra point, sakura’s technique means she stores an abundance of chakra in her seal and can reactivate it in her body, hinata can’t cut of her chakra as she can supply it again and again. Sakura is the same person who got stabbed by madara (as a decoy) and just healed herself from it, the same day sasuke almost died from madaras stab before he was given god-like powers. Hinata would not survive from a stab like that. It’s clear that sakura could end her and would be the last one standing.",
                                            "author": "AstronautAmazing7046",
                                            "id": "hmam12q",
                                            "parent_id": "t1_hmaiw68",
                                            "score": 1,
                                            "created_utc": 1638033982.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I completely agree. And that too sending the only person who showed love to Gaara.",
            "author": "Tarkik_Vatsa",
            "id": "hm90ims",
            "parent_id": "t1_hm8zudt",
            "score": 2,
            "created_utc": 1637997236.0,
            "replies": []
        },
        {
            "body": "Pain is undoubtedly the best though. No one, not even Madara, had the presence that Pain had. Madara was super badass but no one gave me the chills that Pain gave.",
            "author": "Tarkik_Vatsa",
            "id": "hm8ygjq",
            "parent_id": "t1_hm80uyh",
            "score": 3,
            "created_utc": 1637995753.0,
            "replies": [
                {
                    "body": "Oh absolutely, Pain was the absolute GOAT, all the way till his death",
                    "author": "Psychopathetic-",
                    "id": "hm8ylbg",
                    "parent_id": "t1_hm8ygjq",
                    "score": 2,
                    "created_utc": 1637995844.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well to me he was pretty lit but also a little wild. To me the fact that so many people hate him just proves his character is great",
            "author": "zerquet",
            "id": "hm883sb",
            "parent_id": "t1_hm80uyh",
            "score": 1,
            "created_utc": 1637980513.0,
            "replies": []
        },
        {
            "body": "In a separate thread Op was talking about if a rasengan can kill and I think this guy should be the test dummy. I was saying he’s mastered it so he could probably do something similar in all 5 chakra natures and he should test them all on this guy.",
            "author": "Dear_Field_7182",
            "id": "hmbm8wd",
            "parent_id": "t1_hmaruhm",
            "score": 2,
            "created_utc": 1638049172.0,
            "replies": []
        },
        {
            "body": "You’re probably right. There’s so many damn flashbacks in filler that it all just runs together lol",
            "author": "BiSaxual",
            "id": "hma8vac",
            "parent_id": "t1_hma5dgg",
            "score": 3,
            "created_utc": 1638028158.0,
            "replies": []
        },
        {
            "body": "I think he means the leaf villagers would like naruto since he got revenge for jiraiya by defeating pain, despite the fact pain destroyed konoha looking for naruto",
            "author": null,
            "id": "hm9o95p",
            "parent_id": "t1_hm9185m",
            "score": 10,
            "created_utc": 1638016841.0,
            "replies": []
        },
        {
            "body": "Imbecile battle savant. Naruto, Ichigo, Goku... ancient trope tbh",
            "author": "eRHachan",
            "id": "hm9koy3",
            "parent_id": "t1_hm80xcc",
            "score": 10,
            "created_utc": 1638014096.0,
            "replies": [
                {
                    "body": "Thank you, yes perfect title lol ill definitely use this",
                    "author": "ToyrewaDokoDeska",
                    "id": "hm9o3ok",
                    "parent_id": "t1_hm9koy3",
                    "score": 5,
                    "created_utc": 1638016735.0,
                    "replies": []
                },
                {
                    "body": "Ichigo wasn't really an idiot though. At least not to the extent of Naruto and Goku.",
                    "author": "monhunt",
                    "id": "hma6mss",
                    "parent_id": "t1_hm9koy3",
                    "score": 4,
                    "created_utc": 1638027133.0,
                    "replies": [
                        {
                            "body": "He was a bonafide punk who punched first and asked second. He wasn't brain-damaged like Goku, but he was pretty close.",
                            "author": "eRHachan",
                            "id": "hmaphyy",
                            "parent_id": "t1_hma6mss",
                            "score": 4,
                            "created_utc": 1638035421.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Naruto was sealed with Yang-Kurama. Yang = positive, warm, light, and a slew of other things. Yin is the \"negative\" one.",
            "author": "Catlover18",
            "id": "hm80ync",
            "parent_id": "t1_hm80ik8",
            "score": 26,
            "created_utc": 1637976910.0,
            "replies": []
        },
        {
            "body": "He did though. The 9 tails is a massive ball of hate and distain for humans. The part Naruto got was the good side. He still had all his memory's, hence his dislike of humans and unwillingness to help them, but he never actively tried to harm them unless they bothered him or Naruto personally.",
            "author": "xNuxIsGod",
            "id": "hm8npbc",
            "parent_id": "t1_hm80ik8",
            "score": 10,
            "created_utc": 1637988924.0,
            "replies": []
        },
        {
            "body": "The number of my downvotes says otherwise. And Hinata isn’t better written. She kept saying Naruto this Naruto that the entire time. She only stopped doing that when Boruto exists. The author just suck at writing female characters",
            "author": "aicchisenpai",
            "id": "hm9jwd3",
            "parent_id": "t1_hm972gu",
            "score": -1,
            "created_utc": 1638013442.0,
            "replies": [
                {
                    "body": "Hinata still feels much betfer written than Sakura though because she atleast had a compelling backstory. I agree with her not being a well written character completely though. Also, since Sakura was a main character, we definitely expected much more from her in comparison to Hinata.",
                    "author": "Tarkik_Vatsa",
                    "id": "hm9s6ap",
                    "parent_id": "t1_hm9jwd3",
                    "score": 2,
                    "created_utc": 1638019413.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Which message?",
            "author": "IAmYoDaddyDuh",
            "id": "hm8nfcl",
            "parent_id": "t1_hm8hyp0",
            "score": 3,
            "created_utc": 1637988761.0,
            "replies": [
                {
                    "body": "Kishomoto’s message since he confirmed that she’s stronger, facts over feelings",
                    "author": "AstronautAmazing7046",
                    "id": "hma9j49",
                    "parent_id": "t1_hm8nfcl",
                    "score": 1,
                    "created_utc": 1638028457.0,
                    "replies": [
                        {
                            "body": "Sakura is stronger than Hinata?",
                            "author": "IAmYoDaddyDuh",
                            "id": "hmaiw68",
                            "parent_id": "t1_hma9j49",
                            "score": 0,
                            "created_utc": 1638032634.0,
                            "replies": [
                                {
                                    "body": "Yes, she surpassed Tsunade and the author said she’s the strongest Kunoichi in the leaf. Hinata has close range attacks to stop chakra, but sakura is faster and is physically stronger so it’s unlike hinata would even touch her . But even if hinata hit a chakra point, kakashi already mentioned sakuras chakra control was better than naruto and sasukes. This doesn’t mean she’s stronger than them though, Chakra control is her strong point which is why hinata who stops chakra is no match for her as sakura can control it. \n\nShe’s the only one besides tsunade able to do Strength Of A Hundred Seal and summon Katsuuya, now if we look a tsunade who did those things too, out of all the kages fighting against madara, it’s her strength he was more impressed by, she was the last one conscious and gave her left over strength to heal the other Kages. Say if hinata were to even match her speed and stop a chakra point, sakura’s technique means she stores an abundance of chakra in her seal and can reactivate it in her body, hinata can’t cut of her chakra as she can supply it again and again. Sakura is the same person who got stabbed by madara (as a decoy) and just healed herself from it, the same day sasuke almost died from madaras stab before he was given god-like powers. Hinata would not survive from a stab like that. It’s clear that sakura could end her and would be the last one standing.",
                                    "author": "AstronautAmazing7046",
                                    "id": "hmam12q",
                                    "parent_id": "t1_hmaiw68",
                                    "score": 1,
                                    "created_utc": 1638033982.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh absolutely, Pain was the absolute GOAT, all the way till his death",
            "author": "Psychopathetic-",
            "id": "hm8ylbg",
            "parent_id": "t1_hm8ygjq",
            "score": 2,
            "created_utc": 1637995844.0,
            "replies": []
        },
        {
            "body": "Thank you, yes perfect title lol ill definitely use this",
            "author": "ToyrewaDokoDeska",
            "id": "hm9o3ok",
            "parent_id": "t1_hm9koy3",
            "score": 5,
            "created_utc": 1638016735.0,
            "replies": []
        },
        {
            "body": "Ichigo wasn't really an idiot though. At least not to the extent of Naruto and Goku.",
            "author": "monhunt",
            "id": "hma6mss",
            "parent_id": "t1_hm9koy3",
            "score": 4,
            "created_utc": 1638027133.0,
            "replies": [
                {
                    "body": "He was a bonafide punk who punched first and asked second. He wasn't brain-damaged like Goku, but he was pretty close.",
                    "author": "eRHachan",
                    "id": "hmaphyy",
                    "parent_id": "t1_hma6mss",
                    "score": 4,
                    "created_utc": 1638035421.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hinata still feels much betfer written than Sakura though because she atleast had a compelling backstory. I agree with her not being a well written character completely though. Also, since Sakura was a main character, we definitely expected much more from her in comparison to Hinata.",
            "author": "Tarkik_Vatsa",
            "id": "hm9s6ap",
            "parent_id": "t1_hm9jwd3",
            "score": 2,
            "created_utc": 1638019413.0,
            "replies": []
        },
        {
            "body": "Kishomoto’s message since he confirmed that she’s stronger, facts over feelings",
            "author": "AstronautAmazing7046",
            "id": "hma9j49",
            "parent_id": "t1_hm8nfcl",
            "score": 1,
            "created_utc": 1638028457.0,
            "replies": [
                {
                    "body": "Sakura is stronger than Hinata?",
                    "author": "IAmYoDaddyDuh",
                    "id": "hmaiw68",
                    "parent_id": "t1_hma9j49",
                    "score": 0,
                    "created_utc": 1638032634.0,
                    "replies": [
                        {
                            "body": "Yes, she surpassed Tsunade and the author said she’s the strongest Kunoichi in the leaf. Hinata has close range attacks to stop chakra, but sakura is faster and is physically stronger so it’s unlike hinata would even touch her . But even if hinata hit a chakra point, kakashi already mentioned sakuras chakra control was better than naruto and sasukes. This doesn’t mean she’s stronger than them though, Chakra control is her strong point which is why hinata who stops chakra is no match for her as sakura can control it. \n\nShe’s the only one besides tsunade able to do Strength Of A Hundred Seal and summon Katsuuya, now if we look a tsunade who did those things too, out of all the kages fighting against madara, it’s her strength he was more impressed by, she was the last one conscious and gave her left over strength to heal the other Kages. Say if hinata were to even match her speed and stop a chakra point, sakura’s technique means she stores an abundance of chakra in her seal and can reactivate it in her body, hinata can’t cut of her chakra as she can supply it again and again. Sakura is the same person who got stabbed by madara (as a decoy) and just healed herself from it, the same day sasuke almost died from madaras stab before he was given god-like powers. Hinata would not survive from a stab like that. It’s clear that sakura could end her and would be the last one standing.",
                            "author": "AstronautAmazing7046",
                            "id": "hmam12q",
                            "parent_id": "t1_hmaiw68",
                            "score": 1,
                            "created_utc": 1638033982.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He was a bonafide punk who punched first and asked second. He wasn't brain-damaged like Goku, but he was pretty close.",
            "author": "eRHachan",
            "id": "hmaphyy",
            "parent_id": "t1_hma6mss",
            "score": 4,
            "created_utc": 1638035421.0,
            "replies": []
        },
        {
            "body": "Sakura is stronger than Hinata?",
            "author": "IAmYoDaddyDuh",
            "id": "hmaiw68",
            "parent_id": "t1_hma9j49",
            "score": 0,
            "created_utc": 1638032634.0,
            "replies": [
                {
                    "body": "Yes, she surpassed Tsunade and the author said she’s the strongest Kunoichi in the leaf. Hinata has close range attacks to stop chakra, but sakura is faster and is physically stronger so it’s unlike hinata would even touch her . But even if hinata hit a chakra point, kakashi already mentioned sakuras chakra control was better than naruto and sasukes. This doesn’t mean she’s stronger than them though, Chakra control is her strong point which is why hinata who stops chakra is no match for her as sakura can control it. \n\nShe’s the only one besides tsunade able to do Strength Of A Hundred Seal and summon Katsuuya, now if we look a tsunade who did those things too, out of all the kages fighting against madara, it’s her strength he was more impressed by, she was the last one conscious and gave her left over strength to heal the other Kages. Say if hinata were to even match her speed and stop a chakra point, sakura’s technique means she stores an abundance of chakra in her seal and can reactivate it in her body, hinata can’t cut of her chakra as she can supply it again and again. Sakura is the same person who got stabbed by madara (as a decoy) and just healed herself from it, the same day sasuke almost died from madaras stab before he was given god-like powers. Hinata would not survive from a stab like that. It’s clear that sakura could end her and would be the last one standing.",
                    "author": "AstronautAmazing7046",
                    "id": "hmam12q",
                    "parent_id": "t1_hmaiw68",
                    "score": 1,
                    "created_utc": 1638033982.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, she surpassed Tsunade and the author said she’s the strongest Kunoichi in the leaf. Hinata has close range attacks to stop chakra, but sakura is faster and is physically stronger so it’s unlike hinata would even touch her . But even if hinata hit a chakra point, kakashi already mentioned sakuras chakra control was better than naruto and sasukes. This doesn’t mean she’s stronger than them though, Chakra control is her strong point which is why hinata who stops chakra is no match for her as sakura can control it. \n\nShe’s the only one besides tsunade able to do Strength Of A Hundred Seal and summon Katsuuya, now if we look a tsunade who did those things too, out of all the kages fighting against madara, it’s her strength he was more impressed by, she was the last one conscious and gave her left over strength to heal the other Kages. Say if hinata were to even match her speed and stop a chakra point, sakura’s technique means she stores an abundance of chakra in her seal and can reactivate it in her body, hinata can’t cut of her chakra as she can supply it again and again. Sakura is the same person who got stabbed by madara (as a decoy) and just healed herself from it, the same day sasuke almost died from madaras stab before he was given god-like powers. Hinata would not survive from a stab like that. It’s clear that sakura could end her and would be the last one standing.",
            "author": "AstronautAmazing7046",
            "id": "hmam12q",
            "parent_id": "t1_hmaiw68",
            "score": 1,
            "created_utc": 1638033982.0,
            "replies": []
        }
    ]
}