{
    "title": "Granny tsunade",
    "post_id": "qy2dhm",
    "post_url": "https://www.reddit.com/r/dankruto/comments/qy2dhm/granny_tsunade/",
    "author": "Fragrant-Abalone4029",
    "body": "",
    "url": "https://i.redd.it/68xd2a0l2q081.jpg",
    "score": 4554,
    "upvote_ratio": 0.99,
    "created_utc": 1637401762.0,
    "num_comments": 84,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "To be fair, she’s an old lady. She just masks her appearance to look younger",
            "author": "smyth101-",
            "id": "hldkjpf",
            "parent_id": "t3_qy2dhm",
            "score": 375,
            "created_utc": 1637409416.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hldn0f2",
                    "parent_id": "t1_hldkjpf",
                    "score": 108,
                    "created_utc": 1637411273.0,
                    "replies": [
                        {
                            "body": "She’s hiding behind a transformation jutsu lmao. Why do you think her hand got fucking wrinkled like a old grandma when she fell in a coma",
                            "author": "HmmmMzawarudo",
                            "id": "hldu3pz",
                            "parent_id": "t1_hldn0f2",
                            "score": 158,
                            "created_utc": 1637415812.0,
                            "replies": [
                                {
                                    "body": ">She’s hiding behind a transformation jutsu\n\nSo what tho. Looks is looks, what difference does it make whether it's achieved through genetics or ninjutsu",
                                    "author": "YoYo375",
                                    "id": "hleyj1d",
                                    "parent_id": "t1_hldu3pz",
                                    "score": 3,
                                    "created_utc": 1637434003.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hlducyt",
                                    "parent_id": "t1_hldu3pz",
                                    "score": 56,
                                    "created_utc": 1637415957.0,
                                    "replies": [
                                        {
                                            "body": "They explain this for every character who has healing powers, including Naruto. Regeneration is done by the dividing of cells of the individual. Cells have a limit to how much they can divide.  This is why tsunade has aged quicker than her peers. She’s constantly shortening her life to rapidly heal. Although it’s never been stated why hashirama died an early death, it’s implied that his life span was significantly shortened due to all his healing he has done in battle and what not.",
                                            "author": "HeraldofblueRP",
                                            "id": "hldx0g4",
                                            "parent_id": "t1_hlducyt",
                                            "score": 127,
                                            "created_utc": 1637417426.0,
                                            "replies": [
                                                {
                                                    "body": "Side note, all you need to do is regenerate the cell telomeres themselves and you would fix the base problem of the cell only being able to divide so many times.\n\n**Edit**: I see people don't understand cells.",
                                                    "author": "DisneyPrincessDVorah",
                                                    "id": "hldzf2r",
                                                    "parent_id": "t1_hldx0g4",
                                                    "score": -7,
                                                    "created_utc": 1637418697.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well, not necessarily, it also depends on amount of mutations that had taken place in parts of DNA that are coding. Sometimes mutations are not causing cells to die, but can cause problems when some accumulate therefore making cells ineffective in their purposes.\n\nThere is no real solution to this because mutations are happening constantly from before your birth to the end. Even with a way to replenish mutated cells they would appear again.",
                                                            "author": null,
                                                            "id": "hlef1fa",
                                                            "parent_id": "t1_hldzf2r",
                                                            "score": 6,
                                                            "created_utc": 1637425844.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Maybe in real life, Naruto clearly ain't real life.",
                                                            "author": "EmbarrassedMonk6591",
                                                            "id": "hlfk5ij",
                                                            "parent_id": "t1_hldzf2r",
                                                            "score": -6,
                                                            "created_utc": 1637443593.0,
                                                            "replies": [
                                                                {
                                                                    "body": "So, wait, there's cells and cloning but telomeres are too far? \n\nGet out of here with that wack ass shit.",
                                                                    "author": "DisneyPrincessDVorah",
                                                                    "id": "hlfzy1h",
                                                                    "parent_id": "t1_hlfk5ij",
                                                                    "score": -1,
                                                                    "created_utc": 1637450800.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "No you fucking idiot, have you seen healing Ninjutsu or these god damn Hodge podge transplantations? Biology clearly isn't the same in the Naruto universe so why are you assuming telomeres exist? I never said telomeres are \"too far\".",
                                                                            "author": "EmbarrassedMonk6591",
                                                                            "id": "hlg06pd",
                                                                            "parent_id": "t1_hlfzy1h",
                                                                            "score": 0,
                                                                            "created_utc": 1637450909.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "It doesn't make you age older in appearance wise... There's no evidence, you're just guessing even though Lady Tsunade said when she's most out of chakara her side affects appear. Who's this \"they\" because Lady Tsunade and Hashirama are the best healers to ever and not regular healers",
                                                    "author": null,
                                                    "id": "hldxrw6",
                                                    "parent_id": "t1_hldx0g4",
                                                    "score": -32,
                                                    "created_utc": 1637417831.0,
                                                    "replies": [
                                                        {
                                                            "body": "Tsunade would specifically change her appearance due to gambling debts etc...   \n\n\nThere was a whole plot-point about her being older than her appearance before the time skip in Naruto, you prolly just don't remember/didn't watch it.",
                                                            "author": "Caststarman",
                                                            "id": "hle2i37",
                                                            "parent_id": "t1_hldxrw6",
                                                            "score": 43,
                                                            "created_utc": 1637420221.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It's called a transformation jutsu everyone uses it for their benefit... What's your point? We know she looks younger than her real age,  im saying her wrinkly form is not what she looks like if she was natrual. It happens when she's almost out of chakara. That's why it's a side effect... \n\nWhat's your next excuse to bash Lady Tsunade's appearance?",
                                                                    "author": null,
                                                                    "id": "hle2z22",
                                                                    "parent_id": "t1_hle2i37",
                                                                    "score": -34,
                                                                    "created_utc": 1637420455.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Your so dumb when she runs out of chakra she can no longer hold the transformation simple",
                                                                            "author": "dexanor",
                                                                            "id": "hle76vy",
                                                                            "parent_id": "t1_hle2z22",
                                                                            "score": 22,
                                                                            "created_utc": 1637422399.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I don't think it's a transformation, just a continual healing of cells to prevent them from aging, but then when she's out of Chakra she can't continue to hold that jutsu. Not quite the transformation jutsu we see others do.",
                                                                                    "author": "Hevens-assassin",
                                                                                    "id": "hlfjzr1",
                                                                                    "parent_id": "t1_hle76vy",
                                                                                    "score": -2,
                                                                                    "created_utc": 1637443523.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "u may think thats how it works but I know its a transformation cause it was stated many times in canon",
                                                                                            "author": "dexanor",
                                                                                            "id": "hlfk56e",
                                                                                            "parent_id": "t1_hlfjzr1",
                                                                                            "score": 4,
                                                                                            "created_utc": 1637443589.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Its a transformation, but not a transformation jutsu, correct? It's not the same as a sexy jutsu or genjutsu. I just wanted to clarify that it's not a \"transformation jutsu\" so much as a healing jutsu that just happens to keep the body looking a certain way.",
                                                                                                    "author": "Hevens-assassin",
                                                                                                    "id": "hlfki4r",
                                                                                                    "parent_id": "t1_hlfk56e",
                                                                                                    "score": -2,
                                                                                                    "created_utc": 1637443745.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "The fact that u think genjutsu is a transformation says alot finish naruto before u start debating in the comments",
                                                                                                            "author": "dexanor",
                                                                                                            "id": "hlfkodo",
                                                                                                            "parent_id": "t1_hlfki4r",
                                                                                                            "score": 2,
                                                                                                            "created_utc": 1637443823.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "I never said genjutsu was a transformation jutsu. You should learn to read before reading Naruto, I think.",
                                                                                                                    "author": "Hevens-assassin",
                                                                                                                    "id": "hlgen6w",
                                                                                                                    "parent_id": "t1_hlfkodo",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1637457719.0,
                                                                                                                    "replies": []
                                                                                                                },
                                                                                                                {
                                                                                                                    "body": "Genjutsu, when the victim to it, does involve transformation of one's perceptions, whereas sexy jutsu is an actual transformation. Tsunade transformed her appearance by using her own healing to create a younger look. It's a healing jutsu, not a transformation jutsu where the victim sees something different. There is no \"underlying\" Tsunade. It's fully her, just a perpetual youthfulness. So when her passive healing is stopped due to lack of Chakra, her cells rapidly age, which, is not a transformation jutsu, it is a lack of healing.",
                                                                                                                    "author": "Hevens-assassin",
                                                                                                                    "id": "hlgf78d",
                                                                                                                    "parent_id": "t1_hlfkodo",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1637457989.0,
                                                                                                                    "replies": []
                                                                                                                },
                                                                                                                {
                                                                                                                    "body": "Its a form of transformation jutsu, but not the standard transformation jutsu.",
                                                                                                                    "author": "xNuxIsGod",
                                                                                                                    "id": "hlh6cct",
                                                                                                                    "parent_id": "t1_hlfkodo",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1637472674.0,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "body": "Kid read my comment, clearly you didn't read it. 👍🏻",
                                                                                    "author": null,
                                                                                    "id": "hle7ec5",
                                                                                    "parent_id": "t1_hle76vy",
                                                                                    "score": -27,
                                                                                    "created_utc": 1637422494.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I did",
                                                                                            "author": "dexanor",
                                                                                            "id": "hle7gs5",
                                                                                            "parent_id": "t1_hle7ec5",
                                                                                            "score": 10,
                                                                                            "created_utc": 1637422524.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "This guy is trolling hard af right now. I refuse to believe a Tsunade fan doesn't know how her powerset works.",
                                                                                                    "author": null,
                                                                                                    "id": "hlemwiq",
                                                                                                    "parent_id": "t1_hle7gs5",
                                                                                                    "score": 7,
                                                                                                    "created_utc": 1637429148.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "He must be",
                                                                                                            "author": "dexanor",
                                                                                                            "id": "hlen05e",
                                                                                                            "parent_id": "t1_hlemwiq",
                                                                                                            "score": 2,
                                                                                                            "created_utc": 1637429190.0,
                                                                                                            "replies": []
                                                                                                        },
                                                                                                        {
                                                                                                            "body": "He's just mad that a wrinkly old lady gave him a boner.",
                                                                                                            "author": "flippysquid",
                                                                                                            "id": "hlg278m",
                                                                                                            "parent_id": "t1_hlemwiq",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1637451828.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "body": "You are the WORST Tsunade fan I've ever seen. Lmfao",
                                                                                            "author": "Symmiie",
                                                                                            "id": "hlghl7r",
                                                                                            "parent_id": "t1_hle7ec5",
                                                                                            "score": 1,
                                                                                            "created_utc": 1637459160.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Cry more loser",
                                                                                                    "author": null,
                                                                                                    "id": "hlghndw",
                                                                                                    "parent_id": "t1_hlghl7r",
                                                                                                    "score": 0,
                                                                                                    "created_utc": 1637459189.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "Lmfao is crying now?",
                                                                                                            "author": "Symmiie",
                                                                                                            "id": "hlghrp0",
                                                                                                            "parent_id": "t1_hlghndw",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1637459248.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "They is Kakashi and Shizune. Kakashi when seeing naruto heal has explained that naruto using the nine tails chakra to heal will shorten his life-span. Shizune has explained  that the regeneration that tsunade uses is very stressful on her body. Shizune also explained that cells can only divide so much and that’s why tsunade appears to be a lot older than she actually is.",
                                                            "author": "HeraldofblueRP",
                                                            "id": "hleq8dd",
                                                            "parent_id": "t1_hldxrw6",
                                                            "score": 2,
                                                            "created_utc": 1637430544.0,
                                                            "replies": [
                                                                {
                                                                    "body": "What has this to do with the topic? I see you're avoiding everything I said",
                                                                    "author": null,
                                                                    "id": "hlfj2mx",
                                                                    "parent_id": "t1_hleq8dd",
                                                                    "score": -2,
                                                                    "created_utc": 1637443104.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Watch the show kid.",
                                                                            "author": "HeraldofblueRP",
                                                                            "id": "hliyz2z",
                                                                            "parent_id": "t1_hlfj2mx",
                                                                            "score": 0,
                                                                            "created_utc": 1637513042.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Get a better I.Q. kids in the comments",
                                                                                    "author": null,
                                                                                    "id": "hlj2ztf",
                                                                                    "parent_id": "t1_hliyz2z",
                                                                                    "score": 1,
                                                                                    "created_utc": 1637514692.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Dude its literally explained she uses a jutsu to make her look younger. The reason she wrinkles up when running out of Chakra is because she can't maintain her jutsu. Its why she stays hiden after the pain attack until she's fully replenished.",
                                                            "author": "xNuxIsGod",
                                                            "id": "hlh67bo",
                                                            "parent_id": "t1_hldxrw6",
                                                            "score": 1,
                                                            "created_utc": 1637472586.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Watch the show kid",
                                                                    "author": null,
                                                                    "id": "hlh69xs",
                                                                    "parent_id": "t1_hlh67bo",
                                                                    "score": -1,
                                                                    "created_utc": 1637472630.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I did. All 720 episodes 3 times. I think you need to re-watch the show",
                                                                            "author": "xNuxIsGod",
                                                                            "id": "hlh6gw3",
                                                                            "parent_id": "t1_hlh69xs",
                                                                            "score": 2,
                                                                            "created_utc": 1637472752.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Byakugo seal is shortening lifespan of a person using it (I think)",
                                            "author": "PanBizon",
                                            "id": "hldv25a",
                                            "parent_id": "t1_hlducyt",
                                            "score": 33,
                                            "created_utc": 1637416350.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "How was Jiraya treating his body worse? He wasn't using a seal that literally drains your life to heal you for an entire war. Nor was he a 24/7 alcoholic for the majority of his life.",
                                            "author": "TheHeadlessScholar",
                                            "id": "hlehqou",
                                            "parent_id": "t1_hlducyt",
                                            "score": 6,
                                            "created_utc": 1637427000.0,
                                            "replies": [
                                                {
                                                    "body": "Draining life doesn't make you look older only in its side effect when Tsunade is almost out of chakara. I don't think you understand or ignoring it to prove your flawed argument.\n\nJiraiya also drank and lived a life style with many girls that he probably had sex with them. He was addicted with spending to get to girls...\n\nJust look at the Tsunade Arc where he was in a building... With woman getting drunk and wasted. \n\nYeah he was alcoholic if he was around woman which was all his life.  So wrong",
                                                    "author": null,
                                                    "id": "hlfk87t",
                                                    "parent_id": "t1_hlehqou",
                                                    "score": 2,
                                                    "created_utc": 1637443625.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Ur a fuckin weirdo lol",
                            "author": "frubano21",
                            "id": "hlg02qq",
                            "parent_id": "t1_hldn0f2",
                            "score": 2,
                            "created_utc": 1637450860.0,
                            "replies": [
                                {
                                    "body": "Cry more 👍🏻",
                                    "author": null,
                                    "id": "hlg04n2",
                                    "parent_id": "t1_hlg02qq",
                                    "score": -2,
                                    "created_utc": 1637450884.0,
                                    "replies": [
                                        {
                                            "body": "Says the one vigorously defending a made up person",
                                            "author": "frubano21",
                                            "id": "hlg0quo",
                                            "parent_id": "t1_hlg04n2",
                                            "score": 3,
                                            "created_utc": 1637451163.0,
                                            "replies": [
                                                {
                                                    "body": "imagine going on a sub-reddit to talk about your passions. can't be me. no no. also, cope.",
                                                    "author": "xeno696969_",
                                                    "id": "hlgqt8o",
                                                    "parent_id": "t1_hlg0quo",
                                                    "score": 1,
                                                    "created_utc": 1637463838.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Didn't stop me from Nutting.",
                    "author": "Terminal_Monk",
                    "id": "hlgzj9p",
                    "parent_id": "t1_hldkjpf",
                    "score": 3,
                    "created_utc": 1637468588.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How konohamaru sees tsunade:\n\n(     \\    )😃(    /     )",
            "author": "Reverend_Lazerface",
            "id": "hlef9qc",
            "parent_id": "t3_qy2dhm",
            "score": 94,
            "created_utc": 1637425942.0,
            "replies": [
                {
                    "body": "Hold on a sec-",
                    "author": "TheThotSlayerDoggo",
                    "id": "hleh0kd",
                    "parent_id": "t1_hlef9qc",
                    "score": 23,
                    "created_utc": 1637426693.0,
                    "replies": [
                        {
                            "body": "Yeah, inverted nipples?",
                            "author": "Omega_Requiem",
                            "id": "hlexilc",
                            "parent_id": "t1_hleh0kd",
                            "score": 13,
                            "created_utc": 1637433577.0,
                            "replies": [
                                {
                                    "body": "I thought too, then its actually her dress",
                                    "author": "Yopapa291_real1",
                                    "id": "hlgmxky",
                                    "parent_id": "t1_hlexilc",
                                    "score": 6,
                                    "created_utc": 1637461834.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Your profile picture along with your comment is gold. 😂",
                            "author": "Just-call-me-TY",
                            "id": "hlfawji",
                            "parent_id": "t1_hleh0kd",
                            "score": 5,
                            "created_utc": 1637439435.0,
                            "replies": [
                                {
                                    "body": "Haha thanks",
                                    "author": "TheThotSlayerDoggo",
                                    "id": "hlfy0fz",
                                    "parent_id": "t1_hlfawji",
                                    "score": 5,
                                    "created_utc": 1637449894.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hmm, not a certain version of Naruto tho..",
            "author": "OverDrive316",
            "id": "hldgr5p",
            "parent_id": "t3_qy2dhm",
            "score": 84,
            "created_utc": 1637406377.0,
            "replies": [
                {
                    "body": "Naruhodo",
                    "author": "LeadPrevenger",
                    "id": "hlfdfs8",
                    "parent_id": "t1_hldgr5p",
                    "score": 13,
                    "created_utc": 1637440562.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Me who read the doujins 🗿",
            "author": "pranzal_",
            "id": "hleesdn",
            "parent_id": "t3_qy2dhm",
            "score": 56,
            "created_utc": 1637425739.0,
            "replies": []
        },
        {
            "body": "Where is that pic of Tsunade from? Anime or fan art?",
            "author": "GxTheBatmanYouTube",
            "id": "hleedlp",
            "parent_id": "t3_qy2dhm",
            "score": 15,
            "created_utc": 1637425564.0,
            "replies": [
                {
                    "body": "Asking for a friend",
                    "author": "Labranth",
                    "id": "hlekj4e",
                    "parent_id": "t1_hleedlp",
                    "score": 11,
                    "created_utc": 1637428141.0,
                    "replies": [
                        {
                            "body": "can confirm, I'm the friend.",
                            "author": "nohornii",
                            "id": "hlg2w9k",
                            "parent_id": "t1_hlekj4e",
                            "score": 8,
                            "created_utc": 1637452147.0,
                            "replies": [
                                {
                                    "body": "Can confirm, I'm asking.",
                                    "author": "Bananatistic",
                                    "id": "hlh2k3l",
                                    "parent_id": "t1_hlg2w9k",
                                    "score": 3,
                                    "created_utc": 1637470373.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nothing offends me more than a man who cannot appreciate the \"Mature\" category on PH.",
            "author": "Prince_Nipples",
            "id": "hldxle6",
            "parent_id": "t3_qy2dhm",
            "score": 49,
            "created_utc": 1637417735.0,
            "replies": []
        },
        {
            "body": "It feels weird that Tsunade never took a more prenatal role over Naruto while he was younger considering he was both an orphan and he reminded her heavily of her younger brother",
            "author": "Saltyfox99",
            "id": "hle9xru",
            "parent_id": "t3_qy2dhm",
            "score": 34,
            "created_utc": 1637423607.0,
            "replies": [
                {
                    "body": "Yeah, she should have been written to be Naruto's mother figure just like how Iruka, Jiraiya and Kakashi were his father figures. \n\nBut then again, she's a woman, and you know how much time, effort and love Kishimoto gives to the women in his series.",
                    "author": "UnoLaLaLa",
                    "id": "hlegflw",
                    "parent_id": "t1_hle9xru",
                    "score": 73,
                    "created_utc": 1637426441.0,
                    "replies": [
                        {
                            "body": "alot right?... Right?",
                            "author": null,
                            "id": "hlen0sa",
                            "parent_id": "t1_hlegflw",
                            "score": 12,
                            "created_utc": 1637429197.0,
                            "replies": [
                                {
                                    "body": "lets just say all women written by kishimoto are born with the strongest forbidden jutsu of all time called no-screentime-justu and in the history of shinobi world 1010 have mastered it to near perfection",
                                    "author": "No-Alfalfa8771",
                                    "id": "hlg95ve",
                                    "parent_id": "t1_hlen0sa",
                                    "score": 9,
                                    "created_utc": 1637455075.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "In a way she kind of was after she returned. She really cared for Naruto a lot, and even vouched for him to the Raikage when he beat him. But Kishi had to give plot reasons for Naruto to be alone, so her and Jiraya were both conveniently away\n\nBoruto even still calls her granny, so she’s close to Naruto’s family even now",
                            "author": "minkdraggingonfloor",
                            "id": "hleycqq",
                            "parent_id": "t1_hlegflw",
                            "score": 9,
                            "created_utc": 1637433929.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Give our boy a break, he doesn't know what a milf is and his only wet dreams consist of the three big R's: Ramen, Rasengan, and uhhh...Rasengan",
            "author": null,
            "id": "hlfiea5",
            "parent_id": "t3_qy2dhm",
            "score": 7,
            "created_utc": 1637442787.0,
            "replies": [
                {
                    "body": "Third R is...  Rasuke?",
                    "author": "Apprehensive-Ad-8099",
                    "id": "hzpix36",
                    "parent_id": "t1_hlfiea5",
                    "score": 1,
                    "created_utc": 1646664690.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She not even THAT old. Only reason why she even looks twice her actual age under all that glamour is her hundred Healing technique that rapidly accelerates her cell turnover. 💁🏽‍♂️",
            "author": "Shaedymo",
            "id": "hlg4aa2",
            "parent_id": "t3_qy2dhm",
            "score": 3,
            "created_utc": 1637452790.0,
            "replies": []
        },
        {
            "body": "Homie how you not gonna drop the source for the Tsunade at the top right",
            "author": "jairom",
            "id": "hleg5ja",
            "parent_id": "t3_qy2dhm",
            "score": 4,
            "created_utc": 1637426321.0,
            "replies": []
        },
        {
            "body": "Not according to the doujins I've read",
            "author": "rerorerorerp",
            "id": "hleimaz",
            "parent_id": "t3_qy2dhm",
            "score": 2,
            "created_utc": 1637427355.0,
            "replies": []
        },
        {
            "body": "She is the reason I grew up being a boobs lover.",
            "author": "nashk25",
            "id": "hlg1q1s",
            "parent_id": "t3_qy2dhm",
            "score": 2,
            "created_utc": 1637451611.0,
            "replies": []
        },
        {
            "body": "Mommy’s milk",
            "author": "mooritah",
            "id": "hlfiagu",
            "parent_id": "t3_qy2dhm",
            "score": 3,
            "created_utc": 1637442739.0,
            "replies": [
                {
                    "body": "Its the best",
                    "author": "FunHeat1853",
                    "id": "hlfzrjw",
                    "parent_id": "t1_hlfiagu",
                    "score": 2,
                    "created_utc": 1637450717.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "omg coraline",
            "author": "Negative-Delta",
            "id": "hldxb4s",
            "parent_id": "t3_qy2dhm",
            "score": 2,
            "created_utc": 1637417587.0,
            "replies": []
        },
        {
            "body": "Shit I’d still eat her shitter like an apple fritter",
            "author": "TheLoliSnatcher",
            "id": "hlfqzq2",
            "parent_id": "t3_qy2dhm",
            "score": 2,
            "created_utc": 1637446680.0,
            "replies": [
                {
                    "body": "Bro",
                    "author": null,
                    "id": "hlfs0gs",
                    "parent_id": "t1_hlfqzq2",
                    "score": 1,
                    "created_utc": 1637447156.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "!RemindMe 16 days",
            "author": "Hidden_Squid14",
            "id": "hle3y22",
            "parent_id": "t3_qy2dhm",
            "score": 0,
            "created_utc": 1637420913.0,
            "replies": [
                {
                    "body": "I will be messaging you in 16 days on [**2021-12-06 15:08:33 UTC**](http://www.wolframalpha.com/input/?i=2021-12-06%2015:08:33%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/dankruto/comments/qy2dhm/granny_tsunade/hle3y22/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fdankruto%2Fcomments%2Fqy2dhm%2Fgranny_tsunade%2Fhle3y22%2F%5D%0A%0ARemindMe%21%202021-12-06%2015%3A08%3A33%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20qy2dhm)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                    "author": "RemindMeBot",
                    "id": "hle41it",
                    "parent_id": "t1_hle3y22",
                    "score": 1,
                    "created_utc": 1637420958.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I feel this should be NSFW...",
            "author": "JaxTheGuitarNoob",
            "id": "hle0jbq",
            "parent_id": "t3_qy2dhm",
            "score": -10,
            "created_utc": 1637419265.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hle9emg",
            "parent_id": "t3_qy2dhm",
            "score": -5,
            "created_utc": 1637423379.0,
            "replies": [
                {
                    "body": "I just looked to see who that was…… you cappin…. She’s FAR from a Tsunade 🥴",
                    "author": "Mountain-Drama9574",
                    "id": "hleab7p",
                    "parent_id": "t1_hle9emg",
                    "score": 6,
                    "created_utc": 1637423772.0,
                    "replies": [
                        {
                            "body": "She's a fav of mine though",
                            "author": "Ok-Engine8044",
                            "id": "hleam0h",
                            "parent_id": "t1_hleab7p",
                            "score": -2,
                            "created_utc": 1637423902.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Naruto married the weakest fighter in the series... He never was the same after",
            "author": null,
            "id": "hldn7rf",
            "parent_id": "t3_qy2dhm",
            "score": -48,
            "created_utc": 1637411424.0,
            "replies": [
                {
                    "body": "Bro how is Hinata the weakest fighter",
                    "author": "BrandExe",
                    "id": "hldxkur",
                    "parent_id": "t1_hldn7rf",
                    "score": 10,
                    "created_utc": 1637417727.0,
                    "replies": [
                        {
                            "body": "Oh i saw i made the hentards rage by the downvotes (your down votes show im right) \n\nAnyways, she never won a fight and never displayed anything that was above her classmates. She's basically a jobber",
                            "author": null,
                            "id": "hldy1ce",
                            "parent_id": "t1_hldxkur",
                            "score": -28,
                            "created_utc": 1637417972.0,
                            "replies": [
                                {
                                    "body": "I love how you say hentards it’s sounds like some thing very different",
                                    "author": "Sonypak",
                                    "id": "hldyhk3",
                                    "parent_id": "t1_hldy1ce",
                                    "score": 11,
                                    "created_utc": 1637418208.0,
                                    "replies": []
                                },
                                {
                                    "body": "Hentards 💀",
                                    "author": "elysianyuri",
                                    "id": "hle2doc",
                                    "parent_id": "t1_hldy1ce",
                                    "score": 6,
                                    "created_utc": 1637420160.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hlfge87",
                                    "parent_id": "t1_hldy1ce",
                                    "score": 1,
                                    "created_utc": 1637441884.0,
                                    "replies": [
                                        {
                                            "body": "I don't like sakura but okay hentaitards...\n\nGo worship useless hyuga girl who's spineless and weak",
                                            "author": null,
                                            "id": "hlfj9w6",
                                            "parent_id": "t1_hlfge87",
                                            "score": 2,
                                            "created_utc": 1637443194.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hldn0f2",
            "parent_id": "t1_hldkjpf",
            "score": 108,
            "created_utc": 1637411273.0,
            "replies": [
                {
                    "body": "She’s hiding behind a transformation jutsu lmao. Why do you think her hand got fucking wrinkled like a old grandma when she fell in a coma",
                    "author": "HmmmMzawarudo",
                    "id": "hldu3pz",
                    "parent_id": "t1_hldn0f2",
                    "score": 158,
                    "created_utc": 1637415812.0,
                    "replies": [
                        {
                            "body": ">She’s hiding behind a transformation jutsu\n\nSo what tho. Looks is looks, what difference does it make whether it's achieved through genetics or ninjutsu",
                            "author": "YoYo375",
                            "id": "hleyj1d",
                            "parent_id": "t1_hldu3pz",
                            "score": 3,
                            "created_utc": 1637434003.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hlducyt",
                            "parent_id": "t1_hldu3pz",
                            "score": 56,
                            "created_utc": 1637415957.0,
                            "replies": [
                                {
                                    "body": "They explain this for every character who has healing powers, including Naruto. Regeneration is done by the dividing of cells of the individual. Cells have a limit to how much they can divide.  This is why tsunade has aged quicker than her peers. She’s constantly shortening her life to rapidly heal. Although it’s never been stated why hashirama died an early death, it’s implied that his life span was significantly shortened due to all his healing he has done in battle and what not.",
                                    "author": "HeraldofblueRP",
                                    "id": "hldx0g4",
                                    "parent_id": "t1_hlducyt",
                                    "score": 127,
                                    "created_utc": 1637417426.0,
                                    "replies": [
                                        {
                                            "body": "Side note, all you need to do is regenerate the cell telomeres themselves and you would fix the base problem of the cell only being able to divide so many times.\n\n**Edit**: I see people don't understand cells.",
                                            "author": "DisneyPrincessDVorah",
                                            "id": "hldzf2r",
                                            "parent_id": "t1_hldx0g4",
                                            "score": -7,
                                            "created_utc": 1637418697.0,
                                            "replies": [
                                                {
                                                    "body": "Well, not necessarily, it also depends on amount of mutations that had taken place in parts of DNA that are coding. Sometimes mutations are not causing cells to die, but can cause problems when some accumulate therefore making cells ineffective in their purposes.\n\nThere is no real solution to this because mutations are happening constantly from before your birth to the end. Even with a way to replenish mutated cells they would appear again.",
                                                    "author": null,
                                                    "id": "hlef1fa",
                                                    "parent_id": "t1_hldzf2r",
                                                    "score": 6,
                                                    "created_utc": 1637425844.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Maybe in real life, Naruto clearly ain't real life.",
                                                    "author": "EmbarrassedMonk6591",
                                                    "id": "hlfk5ij",
                                                    "parent_id": "t1_hldzf2r",
                                                    "score": -6,
                                                    "created_utc": 1637443593.0,
                                                    "replies": [
                                                        {
                                                            "body": "So, wait, there's cells and cloning but telomeres are too far? \n\nGet out of here with that wack ass shit.",
                                                            "author": "DisneyPrincessDVorah",
                                                            "id": "hlfzy1h",
                                                            "parent_id": "t1_hlfk5ij",
                                                            "score": -1,
                                                            "created_utc": 1637450800.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No you fucking idiot, have you seen healing Ninjutsu or these god damn Hodge podge transplantations? Biology clearly isn't the same in the Naruto universe so why are you assuming telomeres exist? I never said telomeres are \"too far\".",
                                                                    "author": "EmbarrassedMonk6591",
                                                                    "id": "hlg06pd",
                                                                    "parent_id": "t1_hlfzy1h",
                                                                    "score": 0,
                                                                    "created_utc": 1637450909.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "It doesn't make you age older in appearance wise... There's no evidence, you're just guessing even though Lady Tsunade said when she's most out of chakara her side affects appear. Who's this \"they\" because Lady Tsunade and Hashirama are the best healers to ever and not regular healers",
                                            "author": null,
                                            "id": "hldxrw6",
                                            "parent_id": "t1_hldx0g4",
                                            "score": -32,
                                            "created_utc": 1637417831.0,
                                            "replies": [
                                                {
                                                    "body": "Tsunade would specifically change her appearance due to gambling debts etc...   \n\n\nThere was a whole plot-point about her being older than her appearance before the time skip in Naruto, you prolly just don't remember/didn't watch it.",
                                                    "author": "Caststarman",
                                                    "id": "hle2i37",
                                                    "parent_id": "t1_hldxrw6",
                                                    "score": 43,
                                                    "created_utc": 1637420221.0,
                                                    "replies": [
                                                        {
                                                            "body": "It's called a transformation jutsu everyone uses it for their benefit... What's your point? We know she looks younger than her real age,  im saying her wrinkly form is not what she looks like if she was natrual. It happens when she's almost out of chakara. That's why it's a side effect... \n\nWhat's your next excuse to bash Lady Tsunade's appearance?",
                                                            "author": null,
                                                            "id": "hle2z22",
                                                            "parent_id": "t1_hle2i37",
                                                            "score": -34,
                                                            "created_utc": 1637420455.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Your so dumb when she runs out of chakra she can no longer hold the transformation simple",
                                                                    "author": "dexanor",
                                                                    "id": "hle76vy",
                                                                    "parent_id": "t1_hle2z22",
                                                                    "score": 22,
                                                                    "created_utc": 1637422399.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I don't think it's a transformation, just a continual healing of cells to prevent them from aging, but then when she's out of Chakra she can't continue to hold that jutsu. Not quite the transformation jutsu we see others do.",
                                                                            "author": "Hevens-assassin",
                                                                            "id": "hlfjzr1",
                                                                            "parent_id": "t1_hle76vy",
                                                                            "score": -2,
                                                                            "created_utc": 1637443523.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "u may think thats how it works but I know its a transformation cause it was stated many times in canon",
                                                                                    "author": "dexanor",
                                                                                    "id": "hlfk56e",
                                                                                    "parent_id": "t1_hlfjzr1",
                                                                                    "score": 4,
                                                                                    "created_utc": 1637443589.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Its a transformation, but not a transformation jutsu, correct? It's not the same as a sexy jutsu or genjutsu. I just wanted to clarify that it's not a \"transformation jutsu\" so much as a healing jutsu that just happens to keep the body looking a certain way.",
                                                                                            "author": "Hevens-assassin",
                                                                                            "id": "hlfki4r",
                                                                                            "parent_id": "t1_hlfk56e",
                                                                                            "score": -2,
                                                                                            "created_utc": 1637443745.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "The fact that u think genjutsu is a transformation says alot finish naruto before u start debating in the comments",
                                                                                                    "author": "dexanor",
                                                                                                    "id": "hlfkodo",
                                                                                                    "parent_id": "t1_hlfki4r",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1637443823.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "I never said genjutsu was a transformation jutsu. You should learn to read before reading Naruto, I think.",
                                                                                                            "author": "Hevens-assassin",
                                                                                                            "id": "hlgen6w",
                                                                                                            "parent_id": "t1_hlfkodo",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1637457719.0,
                                                                                                            "replies": []
                                                                                                        },
                                                                                                        {
                                                                                                            "body": "Genjutsu, when the victim to it, does involve transformation of one's perceptions, whereas sexy jutsu is an actual transformation. Tsunade transformed her appearance by using her own healing to create a younger look. It's a healing jutsu, not a transformation jutsu where the victim sees something different. There is no \"underlying\" Tsunade. It's fully her, just a perpetual youthfulness. So when her passive healing is stopped due to lack of Chakra, her cells rapidly age, which, is not a transformation jutsu, it is a lack of healing.",
                                                                                                            "author": "Hevens-assassin",
                                                                                                            "id": "hlgf78d",
                                                                                                            "parent_id": "t1_hlfkodo",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1637457989.0,
                                                                                                            "replies": []
                                                                                                        },
                                                                                                        {
                                                                                                            "body": "Its a form of transformation jutsu, but not the standard transformation jutsu.",
                                                                                                            "author": "xNuxIsGod",
                                                                                                            "id": "hlh6cct",
                                                                                                            "parent_id": "t1_hlfkodo",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1637472674.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "Kid read my comment, clearly you didn't read it. 👍🏻",
                                                                            "author": null,
                                                                            "id": "hle7ec5",
                                                                            "parent_id": "t1_hle76vy",
                                                                            "score": -27,
                                                                            "created_utc": 1637422494.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I did",
                                                                                    "author": "dexanor",
                                                                                    "id": "hle7gs5",
                                                                                    "parent_id": "t1_hle7ec5",
                                                                                    "score": 10,
                                                                                    "created_utc": 1637422524.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "This guy is trolling hard af right now. I refuse to believe a Tsunade fan doesn't know how her powerset works.",
                                                                                            "author": null,
                                                                                            "id": "hlemwiq",
                                                                                            "parent_id": "t1_hle7gs5",
                                                                                            "score": 7,
                                                                                            "created_utc": 1637429148.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "He must be",
                                                                                                    "author": "dexanor",
                                                                                                    "id": "hlen05e",
                                                                                                    "parent_id": "t1_hlemwiq",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1637429190.0,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "body": "He's just mad that a wrinkly old lady gave him a boner.",
                                                                                                    "author": "flippysquid",
                                                                                                    "id": "hlg278m",
                                                                                                    "parent_id": "t1_hlemwiq",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1637451828.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "body": "You are the WORST Tsunade fan I've ever seen. Lmfao",
                                                                                    "author": "Symmiie",
                                                                                    "id": "hlghl7r",
                                                                                    "parent_id": "t1_hle7ec5",
                                                                                    "score": 1,
                                                                                    "created_utc": 1637459160.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Cry more loser",
                                                                                            "author": null,
                                                                                            "id": "hlghndw",
                                                                                            "parent_id": "t1_hlghl7r",
                                                                                            "score": 0,
                                                                                            "created_utc": 1637459189.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Lmfao is crying now?",
                                                                                                    "author": "Symmiie",
                                                                                                    "id": "hlghrp0",
                                                                                                    "parent_id": "t1_hlghndw",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1637459248.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "They is Kakashi and Shizune. Kakashi when seeing naruto heal has explained that naruto using the nine tails chakra to heal will shorten his life-span. Shizune has explained  that the regeneration that tsunade uses is very stressful on her body. Shizune also explained that cells can only divide so much and that’s why tsunade appears to be a lot older than she actually is.",
                                                    "author": "HeraldofblueRP",
                                                    "id": "hleq8dd",
                                                    "parent_id": "t1_hldxrw6",
                                                    "score": 2,
                                                    "created_utc": 1637430544.0,
                                                    "replies": [
                                                        {
                                                            "body": "What has this to do with the topic? I see you're avoiding everything I said",
                                                            "author": null,
                                                            "id": "hlfj2mx",
                                                            "parent_id": "t1_hleq8dd",
                                                            "score": -2,
                                                            "created_utc": 1637443104.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Watch the show kid.",
                                                                    "author": "HeraldofblueRP",
                                                                    "id": "hliyz2z",
                                                                    "parent_id": "t1_hlfj2mx",
                                                                    "score": 0,
                                                                    "created_utc": 1637513042.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Get a better I.Q. kids in the comments",
                                                                            "author": null,
                                                                            "id": "hlj2ztf",
                                                                            "parent_id": "t1_hliyz2z",
                                                                            "score": 1,
                                                                            "created_utc": 1637514692.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Dude its literally explained she uses a jutsu to make her look younger. The reason she wrinkles up when running out of Chakra is because she can't maintain her jutsu. Its why she stays hiden after the pain attack until she's fully replenished.",
                                                    "author": "xNuxIsGod",
                                                    "id": "hlh67bo",
                                                    "parent_id": "t1_hldxrw6",
                                                    "score": 1,
                                                    "created_utc": 1637472586.0,
                                                    "replies": [
                                                        {
                                                            "body": "Watch the show kid",
                                                            "author": null,
                                                            "id": "hlh69xs",
                                                            "parent_id": "t1_hlh67bo",
                                                            "score": -1,
                                                            "created_utc": 1637472630.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I did. All 720 episodes 3 times. I think you need to re-watch the show",
                                                                    "author": "xNuxIsGod",
                                                                    "id": "hlh6gw3",
                                                                    "parent_id": "t1_hlh69xs",
                                                                    "score": 2,
                                                                    "created_utc": 1637472752.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Byakugo seal is shortening lifespan of a person using it (I think)",
                                    "author": "PanBizon",
                                    "id": "hldv25a",
                                    "parent_id": "t1_hlducyt",
                                    "score": 33,
                                    "created_utc": 1637416350.0,
                                    "replies": []
                                },
                                {
                                    "body": "How was Jiraya treating his body worse? He wasn't using a seal that literally drains your life to heal you for an entire war. Nor was he a 24/7 alcoholic for the majority of his life.",
                                    "author": "TheHeadlessScholar",
                                    "id": "hlehqou",
                                    "parent_id": "t1_hlducyt",
                                    "score": 6,
                                    "created_utc": 1637427000.0,
                                    "replies": [
                                        {
                                            "body": "Draining life doesn't make you look older only in its side effect when Tsunade is almost out of chakara. I don't think you understand or ignoring it to prove your flawed argument.\n\nJiraiya also drank and lived a life style with many girls that he probably had sex with them. He was addicted with spending to get to girls...\n\nJust look at the Tsunade Arc where he was in a building... With woman getting drunk and wasted. \n\nYeah he was alcoholic if he was around woman which was all his life.  So wrong",
                                            "author": null,
                                            "id": "hlfk87t",
                                            "parent_id": "t1_hlehqou",
                                            "score": 2,
                                            "created_utc": 1637443625.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Ur a fuckin weirdo lol",
                    "author": "frubano21",
                    "id": "hlg02qq",
                    "parent_id": "t1_hldn0f2",
                    "score": 2,
                    "created_utc": 1637450860.0,
                    "replies": [
                        {
                            "body": "Cry more 👍🏻",
                            "author": null,
                            "id": "hlg04n2",
                            "parent_id": "t1_hlg02qq",
                            "score": -2,
                            "created_utc": 1637450884.0,
                            "replies": [
                                {
                                    "body": "Says the one vigorously defending a made up person",
                                    "author": "frubano21",
                                    "id": "hlg0quo",
                                    "parent_id": "t1_hlg04n2",
                                    "score": 3,
                                    "created_utc": 1637451163.0,
                                    "replies": [
                                        {
                                            "body": "imagine going on a sub-reddit to talk about your passions. can't be me. no no. also, cope.",
                                            "author": "xeno696969_",
                                            "id": "hlgqt8o",
                                            "parent_id": "t1_hlg0quo",
                                            "score": 1,
                                            "created_utc": 1637463838.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Didn't stop me from Nutting.",
            "author": "Terminal_Monk",
            "id": "hlgzj9p",
            "parent_id": "t1_hldkjpf",
            "score": 3,
            "created_utc": 1637468588.0,
            "replies": []
        },
        {
            "body": "Hold on a sec-",
            "author": "TheThotSlayerDoggo",
            "id": "hleh0kd",
            "parent_id": "t1_hlef9qc",
            "score": 23,
            "created_utc": 1637426693.0,
            "replies": [
                {
                    "body": "Yeah, inverted nipples?",
                    "author": "Omega_Requiem",
                    "id": "hlexilc",
                    "parent_id": "t1_hleh0kd",
                    "score": 13,
                    "created_utc": 1637433577.0,
                    "replies": [
                        {
                            "body": "I thought too, then its actually her dress",
                            "author": "Yopapa291_real1",
                            "id": "hlgmxky",
                            "parent_id": "t1_hlexilc",
                            "score": 6,
                            "created_utc": 1637461834.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Your profile picture along with your comment is gold. 😂",
                    "author": "Just-call-me-TY",
                    "id": "hlfawji",
                    "parent_id": "t1_hleh0kd",
                    "score": 5,
                    "created_utc": 1637439435.0,
                    "replies": [
                        {
                            "body": "Haha thanks",
                            "author": "TheThotSlayerDoggo",
                            "id": "hlfy0fz",
                            "parent_id": "t1_hlfawji",
                            "score": 5,
                            "created_utc": 1637449894.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Naruhodo",
            "author": "LeadPrevenger",
            "id": "hlfdfs8",
            "parent_id": "t1_hldgr5p",
            "score": 13,
            "created_utc": 1637440562.0,
            "replies": []
        },
        {
            "body": "Asking for a friend",
            "author": "Labranth",
            "id": "hlekj4e",
            "parent_id": "t1_hleedlp",
            "score": 11,
            "created_utc": 1637428141.0,
            "replies": [
                {
                    "body": "can confirm, I'm the friend.",
                    "author": "nohornii",
                    "id": "hlg2w9k",
                    "parent_id": "t1_hlekj4e",
                    "score": 8,
                    "created_utc": 1637452147.0,
                    "replies": [
                        {
                            "body": "Can confirm, I'm asking.",
                            "author": "Bananatistic",
                            "id": "hlh2k3l",
                            "parent_id": "t1_hlg2w9k",
                            "score": 3,
                            "created_utc": 1637470373.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, she should have been written to be Naruto's mother figure just like how Iruka, Jiraiya and Kakashi were his father figures. \n\nBut then again, she's a woman, and you know how much time, effort and love Kishimoto gives to the women in his series.",
            "author": "UnoLaLaLa",
            "id": "hlegflw",
            "parent_id": "t1_hle9xru",
            "score": 73,
            "created_utc": 1637426441.0,
            "replies": [
                {
                    "body": "alot right?... Right?",
                    "author": null,
                    "id": "hlen0sa",
                    "parent_id": "t1_hlegflw",
                    "score": 12,
                    "created_utc": 1637429197.0,
                    "replies": [
                        {
                            "body": "lets just say all women written by kishimoto are born with the strongest forbidden jutsu of all time called no-screentime-justu and in the history of shinobi world 1010 have mastered it to near perfection",
                            "author": "No-Alfalfa8771",
                            "id": "hlg95ve",
                            "parent_id": "t1_hlen0sa",
                            "score": 9,
                            "created_utc": 1637455075.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "In a way she kind of was after she returned. She really cared for Naruto a lot, and even vouched for him to the Raikage when he beat him. But Kishi had to give plot reasons for Naruto to be alone, so her and Jiraya were both conveniently away\n\nBoruto even still calls her granny, so she’s close to Naruto’s family even now",
                    "author": "minkdraggingonfloor",
                    "id": "hleycqq",
                    "parent_id": "t1_hlegflw",
                    "score": 9,
                    "created_utc": 1637433929.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Third R is...  Rasuke?",
            "author": "Apprehensive-Ad-8099",
            "id": "hzpix36",
            "parent_id": "t1_hlfiea5",
            "score": 1,
            "created_utc": 1646664690.0,
            "replies": []
        },
        {
            "body": "Its the best",
            "author": "FunHeat1853",
            "id": "hlfzrjw",
            "parent_id": "t1_hlfiagu",
            "score": 2,
            "created_utc": 1637450717.0,
            "replies": []
        },
        {
            "body": "Bro",
            "author": null,
            "id": "hlfs0gs",
            "parent_id": "t1_hlfqzq2",
            "score": 1,
            "created_utc": 1637447156.0,
            "replies": []
        },
        {
            "body": "I will be messaging you in 16 days on [**2021-12-06 15:08:33 UTC**](http://www.wolframalpha.com/input/?i=2021-12-06%2015:08:33%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/dankruto/comments/qy2dhm/granny_tsunade/hle3y22/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fdankruto%2Fcomments%2Fqy2dhm%2Fgranny_tsunade%2Fhle3y22%2F%5D%0A%0ARemindMe%21%202021-12-06%2015%3A08%3A33%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20qy2dhm)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
            "author": "RemindMeBot",
            "id": "hle41it",
            "parent_id": "t1_hle3y22",
            "score": 1,
            "created_utc": 1637420958.0,
            "replies": []
        },
        {
            "body": "I just looked to see who that was…… you cappin…. She’s FAR from a Tsunade 🥴",
            "author": "Mountain-Drama9574",
            "id": "hleab7p",
            "parent_id": "t1_hle9emg",
            "score": 6,
            "created_utc": 1637423772.0,
            "replies": [
                {
                    "body": "She's a fav of mine though",
                    "author": "Ok-Engine8044",
                    "id": "hleam0h",
                    "parent_id": "t1_hleab7p",
                    "score": -2,
                    "created_utc": 1637423902.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bro how is Hinata the weakest fighter",
            "author": "BrandExe",
            "id": "hldxkur",
            "parent_id": "t1_hldn7rf",
            "score": 10,
            "created_utc": 1637417727.0,
            "replies": [
                {
                    "body": "Oh i saw i made the hentards rage by the downvotes (your down votes show im right) \n\nAnyways, she never won a fight and never displayed anything that was above her classmates. She's basically a jobber",
                    "author": null,
                    "id": "hldy1ce",
                    "parent_id": "t1_hldxkur",
                    "score": -28,
                    "created_utc": 1637417972.0,
                    "replies": [
                        {
                            "body": "I love how you say hentards it’s sounds like some thing very different",
                            "author": "Sonypak",
                            "id": "hldyhk3",
                            "parent_id": "t1_hldy1ce",
                            "score": 11,
                            "created_utc": 1637418208.0,
                            "replies": []
                        },
                        {
                            "body": "Hentards 💀",
                            "author": "elysianyuri",
                            "id": "hle2doc",
                            "parent_id": "t1_hldy1ce",
                            "score": 6,
                            "created_utc": 1637420160.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hlfge87",
                            "parent_id": "t1_hldy1ce",
                            "score": 1,
                            "created_utc": 1637441884.0,
                            "replies": [
                                {
                                    "body": "I don't like sakura but okay hentaitards...\n\nGo worship useless hyuga girl who's spineless and weak",
                                    "author": null,
                                    "id": "hlfj9w6",
                                    "parent_id": "t1_hlfge87",
                                    "score": 2,
                                    "created_utc": 1637443194.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "She’s hiding behind a transformation jutsu lmao. Why do you think her hand got fucking wrinkled like a old grandma when she fell in a coma",
            "author": "HmmmMzawarudo",
            "id": "hldu3pz",
            "parent_id": "t1_hldn0f2",
            "score": 158,
            "created_utc": 1637415812.0,
            "replies": [
                {
                    "body": ">She’s hiding behind a transformation jutsu\n\nSo what tho. Looks is looks, what difference does it make whether it's achieved through genetics or ninjutsu",
                    "author": "YoYo375",
                    "id": "hleyj1d",
                    "parent_id": "t1_hldu3pz",
                    "score": 3,
                    "created_utc": 1637434003.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hlducyt",
                    "parent_id": "t1_hldu3pz",
                    "score": 56,
                    "created_utc": 1637415957.0,
                    "replies": [
                        {
                            "body": "They explain this for every character who has healing powers, including Naruto. Regeneration is done by the dividing of cells of the individual. Cells have a limit to how much they can divide.  This is why tsunade has aged quicker than her peers. She’s constantly shortening her life to rapidly heal. Although it’s never been stated why hashirama died an early death, it’s implied that his life span was significantly shortened due to all his healing he has done in battle and what not.",
                            "author": "HeraldofblueRP",
                            "id": "hldx0g4",
                            "parent_id": "t1_hlducyt",
                            "score": 127,
                            "created_utc": 1637417426.0,
                            "replies": [
                                {
                                    "body": "Side note, all you need to do is regenerate the cell telomeres themselves and you would fix the base problem of the cell only being able to divide so many times.\n\n**Edit**: I see people don't understand cells.",
                                    "author": "DisneyPrincessDVorah",
                                    "id": "hldzf2r",
                                    "parent_id": "t1_hldx0g4",
                                    "score": -7,
                                    "created_utc": 1637418697.0,
                                    "replies": [
                                        {
                                            "body": "Well, not necessarily, it also depends on amount of mutations that had taken place in parts of DNA that are coding. Sometimes mutations are not causing cells to die, but can cause problems when some accumulate therefore making cells ineffective in their purposes.\n\nThere is no real solution to this because mutations are happening constantly from before your birth to the end. Even with a way to replenish mutated cells they would appear again.",
                                            "author": null,
                                            "id": "hlef1fa",
                                            "parent_id": "t1_hldzf2r",
                                            "score": 6,
                                            "created_utc": 1637425844.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Maybe in real life, Naruto clearly ain't real life.",
                                            "author": "EmbarrassedMonk6591",
                                            "id": "hlfk5ij",
                                            "parent_id": "t1_hldzf2r",
                                            "score": -6,
                                            "created_utc": 1637443593.0,
                                            "replies": [
                                                {
                                                    "body": "So, wait, there's cells and cloning but telomeres are too far? \n\nGet out of here with that wack ass shit.",
                                                    "author": "DisneyPrincessDVorah",
                                                    "id": "hlfzy1h",
                                                    "parent_id": "t1_hlfk5ij",
                                                    "score": -1,
                                                    "created_utc": 1637450800.0,
                                                    "replies": [
                                                        {
                                                            "body": "No you fucking idiot, have you seen healing Ninjutsu or these god damn Hodge podge transplantations? Biology clearly isn't the same in the Naruto universe so why are you assuming telomeres exist? I never said telomeres are \"too far\".",
                                                            "author": "EmbarrassedMonk6591",
                                                            "id": "hlg06pd",
                                                            "parent_id": "t1_hlfzy1h",
                                                            "score": 0,
                                                            "created_utc": 1637450909.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "It doesn't make you age older in appearance wise... There's no evidence, you're just guessing even though Lady Tsunade said when she's most out of chakara her side affects appear. Who's this \"they\" because Lady Tsunade and Hashirama are the best healers to ever and not regular healers",
                                    "author": null,
                                    "id": "hldxrw6",
                                    "parent_id": "t1_hldx0g4",
                                    "score": -32,
                                    "created_utc": 1637417831.0,
                                    "replies": [
                                        {
                                            "body": "Tsunade would specifically change her appearance due to gambling debts etc...   \n\n\nThere was a whole plot-point about her being older than her appearance before the time skip in Naruto, you prolly just don't remember/didn't watch it.",
                                            "author": "Caststarman",
                                            "id": "hle2i37",
                                            "parent_id": "t1_hldxrw6",
                                            "score": 43,
                                            "created_utc": 1637420221.0,
                                            "replies": [
                                                {
                                                    "body": "It's called a transformation jutsu everyone uses it for their benefit... What's your point? We know she looks younger than her real age,  im saying her wrinkly form is not what she looks like if she was natrual. It happens when she's almost out of chakara. That's why it's a side effect... \n\nWhat's your next excuse to bash Lady Tsunade's appearance?",
                                                    "author": null,
                                                    "id": "hle2z22",
                                                    "parent_id": "t1_hle2i37",
                                                    "score": -34,
                                                    "created_utc": 1637420455.0,
                                                    "replies": [
                                                        {
                                                            "body": "Your so dumb when she runs out of chakra she can no longer hold the transformation simple",
                                                            "author": "dexanor",
                                                            "id": "hle76vy",
                                                            "parent_id": "t1_hle2z22",
                                                            "score": 22,
                                                            "created_utc": 1637422399.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I don't think it's a transformation, just a continual healing of cells to prevent them from aging, but then when she's out of Chakra she can't continue to hold that jutsu. Not quite the transformation jutsu we see others do.",
                                                                    "author": "Hevens-assassin",
                                                                    "id": "hlfjzr1",
                                                                    "parent_id": "t1_hle76vy",
                                                                    "score": -2,
                                                                    "created_utc": 1637443523.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "u may think thats how it works but I know its a transformation cause it was stated many times in canon",
                                                                            "author": "dexanor",
                                                                            "id": "hlfk56e",
                                                                            "parent_id": "t1_hlfjzr1",
                                                                            "score": 4,
                                                                            "created_utc": 1637443589.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Its a transformation, but not a transformation jutsu, correct? It's not the same as a sexy jutsu or genjutsu. I just wanted to clarify that it's not a \"transformation jutsu\" so much as a healing jutsu that just happens to keep the body looking a certain way.",
                                                                                    "author": "Hevens-assassin",
                                                                                    "id": "hlfki4r",
                                                                                    "parent_id": "t1_hlfk56e",
                                                                                    "score": -2,
                                                                                    "created_utc": 1637443745.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "The fact that u think genjutsu is a transformation says alot finish naruto before u start debating in the comments",
                                                                                            "author": "dexanor",
                                                                                            "id": "hlfkodo",
                                                                                            "parent_id": "t1_hlfki4r",
                                                                                            "score": 2,
                                                                                            "created_utc": 1637443823.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "I never said genjutsu was a transformation jutsu. You should learn to read before reading Naruto, I think.",
                                                                                                    "author": "Hevens-assassin",
                                                                                                    "id": "hlgen6w",
                                                                                                    "parent_id": "t1_hlfkodo",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1637457719.0,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "body": "Genjutsu, when the victim to it, does involve transformation of one's perceptions, whereas sexy jutsu is an actual transformation. Tsunade transformed her appearance by using her own healing to create a younger look. It's a healing jutsu, not a transformation jutsu where the victim sees something different. There is no \"underlying\" Tsunade. It's fully her, just a perpetual youthfulness. So when her passive healing is stopped due to lack of Chakra, her cells rapidly age, which, is not a transformation jutsu, it is a lack of healing.",
                                                                                                    "author": "Hevens-assassin",
                                                                                                    "id": "hlgf78d",
                                                                                                    "parent_id": "t1_hlfkodo",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1637457989.0,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "body": "Its a form of transformation jutsu, but not the standard transformation jutsu.",
                                                                                                    "author": "xNuxIsGod",
                                                                                                    "id": "hlh6cct",
                                                                                                    "parent_id": "t1_hlfkodo",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1637472674.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Kid read my comment, clearly you didn't read it. 👍🏻",
                                                                    "author": null,
                                                                    "id": "hle7ec5",
                                                                    "parent_id": "t1_hle76vy",
                                                                    "score": -27,
                                                                    "created_utc": 1637422494.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I did",
                                                                            "author": "dexanor",
                                                                            "id": "hle7gs5",
                                                                            "parent_id": "t1_hle7ec5",
                                                                            "score": 10,
                                                                            "created_utc": 1637422524.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "This guy is trolling hard af right now. I refuse to believe a Tsunade fan doesn't know how her powerset works.",
                                                                                    "author": null,
                                                                                    "id": "hlemwiq",
                                                                                    "parent_id": "t1_hle7gs5",
                                                                                    "score": 7,
                                                                                    "created_utc": 1637429148.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "He must be",
                                                                                            "author": "dexanor",
                                                                                            "id": "hlen05e",
                                                                                            "parent_id": "t1_hlemwiq",
                                                                                            "score": 2,
                                                                                            "created_utc": 1637429190.0,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "body": "He's just mad that a wrinkly old lady gave him a boner.",
                                                                                            "author": "flippysquid",
                                                                                            "id": "hlg278m",
                                                                                            "parent_id": "t1_hlemwiq",
                                                                                            "score": 1,
                                                                                            "created_utc": 1637451828.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "You are the WORST Tsunade fan I've ever seen. Lmfao",
                                                                            "author": "Symmiie",
                                                                            "id": "hlghl7r",
                                                                            "parent_id": "t1_hle7ec5",
                                                                            "score": 1,
                                                                            "created_utc": 1637459160.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Cry more loser",
                                                                                    "author": null,
                                                                                    "id": "hlghndw",
                                                                                    "parent_id": "t1_hlghl7r",
                                                                                    "score": 0,
                                                                                    "created_utc": 1637459189.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Lmfao is crying now?",
                                                                                            "author": "Symmiie",
                                                                                            "id": "hlghrp0",
                                                                                            "parent_id": "t1_hlghndw",
                                                                                            "score": 1,
                                                                                            "created_utc": 1637459248.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "They is Kakashi and Shizune. Kakashi when seeing naruto heal has explained that naruto using the nine tails chakra to heal will shorten his life-span. Shizune has explained  that the regeneration that tsunade uses is very stressful on her body. Shizune also explained that cells can only divide so much and that’s why tsunade appears to be a lot older than she actually is.",
                                            "author": "HeraldofblueRP",
                                            "id": "hleq8dd",
                                            "parent_id": "t1_hldxrw6",
                                            "score": 2,
                                            "created_utc": 1637430544.0,
                                            "replies": [
                                                {
                                                    "body": "What has this to do with the topic? I see you're avoiding everything I said",
                                                    "author": null,
                                                    "id": "hlfj2mx",
                                                    "parent_id": "t1_hleq8dd",
                                                    "score": -2,
                                                    "created_utc": 1637443104.0,
                                                    "replies": [
                                                        {
                                                            "body": "Watch the show kid.",
                                                            "author": "HeraldofblueRP",
                                                            "id": "hliyz2z",
                                                            "parent_id": "t1_hlfj2mx",
                                                            "score": 0,
                                                            "created_utc": 1637513042.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Get a better I.Q. kids in the comments",
                                                                    "author": null,
                                                                    "id": "hlj2ztf",
                                                                    "parent_id": "t1_hliyz2z",
                                                                    "score": 1,
                                                                    "created_utc": 1637514692.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Dude its literally explained she uses a jutsu to make her look younger. The reason she wrinkles up when running out of Chakra is because she can't maintain her jutsu. Its why she stays hiden after the pain attack until she's fully replenished.",
                                            "author": "xNuxIsGod",
                                            "id": "hlh67bo",
                                            "parent_id": "t1_hldxrw6",
                                            "score": 1,
                                            "created_utc": 1637472586.0,
                                            "replies": [
                                                {
                                                    "body": "Watch the show kid",
                                                    "author": null,
                                                    "id": "hlh69xs",
                                                    "parent_id": "t1_hlh67bo",
                                                    "score": -1,
                                                    "created_utc": 1637472630.0,
                                                    "replies": [
                                                        {
                                                            "body": "I did. All 720 episodes 3 times. I think you need to re-watch the show",
                                                            "author": "xNuxIsGod",
                                                            "id": "hlh6gw3",
                                                            "parent_id": "t1_hlh69xs",
                                                            "score": 2,
                                                            "created_utc": 1637472752.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Byakugo seal is shortening lifespan of a person using it (I think)",
                            "author": "PanBizon",
                            "id": "hldv25a",
                            "parent_id": "t1_hlducyt",
                            "score": 33,
                            "created_utc": 1637416350.0,
                            "replies": []
                        },
                        {
                            "body": "How was Jiraya treating his body worse? He wasn't using a seal that literally drains your life to heal you for an entire war. Nor was he a 24/7 alcoholic for the majority of his life.",
                            "author": "TheHeadlessScholar",
                            "id": "hlehqou",
                            "parent_id": "t1_hlducyt",
                            "score": 6,
                            "created_utc": 1637427000.0,
                            "replies": [
                                {
                                    "body": "Draining life doesn't make you look older only in its side effect when Tsunade is almost out of chakara. I don't think you understand or ignoring it to prove your flawed argument.\n\nJiraiya also drank and lived a life style with many girls that he probably had sex with them. He was addicted with spending to get to girls...\n\nJust look at the Tsunade Arc where he was in a building... With woman getting drunk and wasted. \n\nYeah he was alcoholic if he was around woman which was all his life.  So wrong",
                                    "author": null,
                                    "id": "hlfk87t",
                                    "parent_id": "t1_hlehqou",
                                    "score": 2,
                                    "created_utc": 1637443625.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ur a fuckin weirdo lol",
            "author": "frubano21",
            "id": "hlg02qq",
            "parent_id": "t1_hldn0f2",
            "score": 2,
            "created_utc": 1637450860.0,
            "replies": [
                {
                    "body": "Cry more 👍🏻",
                    "author": null,
                    "id": "hlg04n2",
                    "parent_id": "t1_hlg02qq",
                    "score": -2,
                    "created_utc": 1637450884.0,
                    "replies": [
                        {
                            "body": "Says the one vigorously defending a made up person",
                            "author": "frubano21",
                            "id": "hlg0quo",
                            "parent_id": "t1_hlg04n2",
                            "score": 3,
                            "created_utc": 1637451163.0,
                            "replies": [
                                {
                                    "body": "imagine going on a sub-reddit to talk about your passions. can't be me. no no. also, cope.",
                                    "author": "xeno696969_",
                                    "id": "hlgqt8o",
                                    "parent_id": "t1_hlg0quo",
                                    "score": 1,
                                    "created_utc": 1637463838.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, inverted nipples?",
            "author": "Omega_Requiem",
            "id": "hlexilc",
            "parent_id": "t1_hleh0kd",
            "score": 13,
            "created_utc": 1637433577.0,
            "replies": [
                {
                    "body": "I thought too, then its actually her dress",
                    "author": "Yopapa291_real1",
                    "id": "hlgmxky",
                    "parent_id": "t1_hlexilc",
                    "score": 6,
                    "created_utc": 1637461834.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your profile picture along with your comment is gold. 😂",
            "author": "Just-call-me-TY",
            "id": "hlfawji",
            "parent_id": "t1_hleh0kd",
            "score": 5,
            "created_utc": 1637439435.0,
            "replies": [
                {
                    "body": "Haha thanks",
                    "author": "TheThotSlayerDoggo",
                    "id": "hlfy0fz",
                    "parent_id": "t1_hlfawji",
                    "score": 5,
                    "created_utc": 1637449894.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "can confirm, I'm the friend.",
            "author": "nohornii",
            "id": "hlg2w9k",
            "parent_id": "t1_hlekj4e",
            "score": 8,
            "created_utc": 1637452147.0,
            "replies": [
                {
                    "body": "Can confirm, I'm asking.",
                    "author": "Bananatistic",
                    "id": "hlh2k3l",
                    "parent_id": "t1_hlg2w9k",
                    "score": 3,
                    "created_utc": 1637470373.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "alot right?... Right?",
            "author": null,
            "id": "hlen0sa",
            "parent_id": "t1_hlegflw",
            "score": 12,
            "created_utc": 1637429197.0,
            "replies": [
                {
                    "body": "lets just say all women written by kishimoto are born with the strongest forbidden jutsu of all time called no-screentime-justu and in the history of shinobi world 1010 have mastered it to near perfection",
                    "author": "No-Alfalfa8771",
                    "id": "hlg95ve",
                    "parent_id": "t1_hlen0sa",
                    "score": 9,
                    "created_utc": 1637455075.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In a way she kind of was after she returned. She really cared for Naruto a lot, and even vouched for him to the Raikage when he beat him. But Kishi had to give plot reasons for Naruto to be alone, so her and Jiraya were both conveniently away\n\nBoruto even still calls her granny, so she’s close to Naruto’s family even now",
            "author": "minkdraggingonfloor",
            "id": "hleycqq",
            "parent_id": "t1_hlegflw",
            "score": 9,
            "created_utc": 1637433929.0,
            "replies": []
        },
        {
            "body": "She's a fav of mine though",
            "author": "Ok-Engine8044",
            "id": "hleam0h",
            "parent_id": "t1_hleab7p",
            "score": -2,
            "created_utc": 1637423902.0,
            "replies": []
        },
        {
            "body": "Oh i saw i made the hentards rage by the downvotes (your down votes show im right) \n\nAnyways, she never won a fight and never displayed anything that was above her classmates. She's basically a jobber",
            "author": null,
            "id": "hldy1ce",
            "parent_id": "t1_hldxkur",
            "score": -28,
            "created_utc": 1637417972.0,
            "replies": [
                {
                    "body": "I love how you say hentards it’s sounds like some thing very different",
                    "author": "Sonypak",
                    "id": "hldyhk3",
                    "parent_id": "t1_hldy1ce",
                    "score": 11,
                    "created_utc": 1637418208.0,
                    "replies": []
                },
                {
                    "body": "Hentards 💀",
                    "author": "elysianyuri",
                    "id": "hle2doc",
                    "parent_id": "t1_hldy1ce",
                    "score": 6,
                    "created_utc": 1637420160.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hlfge87",
                    "parent_id": "t1_hldy1ce",
                    "score": 1,
                    "created_utc": 1637441884.0,
                    "replies": [
                        {
                            "body": "I don't like sakura but okay hentaitards...\n\nGo worship useless hyuga girl who's spineless and weak",
                            "author": null,
                            "id": "hlfj9w6",
                            "parent_id": "t1_hlfge87",
                            "score": 2,
                            "created_utc": 1637443194.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">She’s hiding behind a transformation jutsu\n\nSo what tho. Looks is looks, what difference does it make whether it's achieved through genetics or ninjutsu",
            "author": "YoYo375",
            "id": "hleyj1d",
            "parent_id": "t1_hldu3pz",
            "score": 3,
            "created_utc": 1637434003.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hlducyt",
            "parent_id": "t1_hldu3pz",
            "score": 56,
            "created_utc": 1637415957.0,
            "replies": [
                {
                    "body": "They explain this for every character who has healing powers, including Naruto. Regeneration is done by the dividing of cells of the individual. Cells have a limit to how much they can divide.  This is why tsunade has aged quicker than her peers. She’s constantly shortening her life to rapidly heal. Although it’s never been stated why hashirama died an early death, it’s implied that his life span was significantly shortened due to all his healing he has done in battle and what not.",
                    "author": "HeraldofblueRP",
                    "id": "hldx0g4",
                    "parent_id": "t1_hlducyt",
                    "score": 127,
                    "created_utc": 1637417426.0,
                    "replies": [
                        {
                            "body": "Side note, all you need to do is regenerate the cell telomeres themselves and you would fix the base problem of the cell only being able to divide so many times.\n\n**Edit**: I see people don't understand cells.",
                            "author": "DisneyPrincessDVorah",
                            "id": "hldzf2r",
                            "parent_id": "t1_hldx0g4",
                            "score": -7,
                            "created_utc": 1637418697.0,
                            "replies": [
                                {
                                    "body": "Well, not necessarily, it also depends on amount of mutations that had taken place in parts of DNA that are coding. Sometimes mutations are not causing cells to die, but can cause problems when some accumulate therefore making cells ineffective in their purposes.\n\nThere is no real solution to this because mutations are happening constantly from before your birth to the end. Even with a way to replenish mutated cells they would appear again.",
                                    "author": null,
                                    "id": "hlef1fa",
                                    "parent_id": "t1_hldzf2r",
                                    "score": 6,
                                    "created_utc": 1637425844.0,
                                    "replies": []
                                },
                                {
                                    "body": "Maybe in real life, Naruto clearly ain't real life.",
                                    "author": "EmbarrassedMonk6591",
                                    "id": "hlfk5ij",
                                    "parent_id": "t1_hldzf2r",
                                    "score": -6,
                                    "created_utc": 1637443593.0,
                                    "replies": [
                                        {
                                            "body": "So, wait, there's cells and cloning but telomeres are too far? \n\nGet out of here with that wack ass shit.",
                                            "author": "DisneyPrincessDVorah",
                                            "id": "hlfzy1h",
                                            "parent_id": "t1_hlfk5ij",
                                            "score": -1,
                                            "created_utc": 1637450800.0,
                                            "replies": [
                                                {
                                                    "body": "No you fucking idiot, have you seen healing Ninjutsu or these god damn Hodge podge transplantations? Biology clearly isn't the same in the Naruto universe so why are you assuming telomeres exist? I never said telomeres are \"too far\".",
                                                    "author": "EmbarrassedMonk6591",
                                                    "id": "hlg06pd",
                                                    "parent_id": "t1_hlfzy1h",
                                                    "score": 0,
                                                    "created_utc": 1637450909.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "It doesn't make you age older in appearance wise... There's no evidence, you're just guessing even though Lady Tsunade said when she's most out of chakara her side affects appear. Who's this \"they\" because Lady Tsunade and Hashirama are the best healers to ever and not regular healers",
                            "author": null,
                            "id": "hldxrw6",
                            "parent_id": "t1_hldx0g4",
                            "score": -32,
                            "created_utc": 1637417831.0,
                            "replies": [
                                {
                                    "body": "Tsunade would specifically change her appearance due to gambling debts etc...   \n\n\nThere was a whole plot-point about her being older than her appearance before the time skip in Naruto, you prolly just don't remember/didn't watch it.",
                                    "author": "Caststarman",
                                    "id": "hle2i37",
                                    "parent_id": "t1_hldxrw6",
                                    "score": 43,
                                    "created_utc": 1637420221.0,
                                    "replies": [
                                        {
                                            "body": "It's called a transformation jutsu everyone uses it for their benefit... What's your point? We know she looks younger than her real age,  im saying her wrinkly form is not what she looks like if she was natrual. It happens when she's almost out of chakara. That's why it's a side effect... \n\nWhat's your next excuse to bash Lady Tsunade's appearance?",
                                            "author": null,
                                            "id": "hle2z22",
                                            "parent_id": "t1_hle2i37",
                                            "score": -34,
                                            "created_utc": 1637420455.0,
                                            "replies": [
                                                {
                                                    "body": "Your so dumb when she runs out of chakra she can no longer hold the transformation simple",
                                                    "author": "dexanor",
                                                    "id": "hle76vy",
                                                    "parent_id": "t1_hle2z22",
                                                    "score": 22,
                                                    "created_utc": 1637422399.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don't think it's a transformation, just a continual healing of cells to prevent them from aging, but then when she's out of Chakra she can't continue to hold that jutsu. Not quite the transformation jutsu we see others do.",
                                                            "author": "Hevens-assassin",
                                                            "id": "hlfjzr1",
                                                            "parent_id": "t1_hle76vy",
                                                            "score": -2,
                                                            "created_utc": 1637443523.0,
                                                            "replies": [
                                                                {
                                                                    "body": "u may think thats how it works but I know its a transformation cause it was stated many times in canon",
                                                                    "author": "dexanor",
                                                                    "id": "hlfk56e",
                                                                    "parent_id": "t1_hlfjzr1",
                                                                    "score": 4,
                                                                    "created_utc": 1637443589.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Its a transformation, but not a transformation jutsu, correct? It's not the same as a sexy jutsu or genjutsu. I just wanted to clarify that it's not a \"transformation jutsu\" so much as a healing jutsu that just happens to keep the body looking a certain way.",
                                                                            "author": "Hevens-assassin",
                                                                            "id": "hlfki4r",
                                                                            "parent_id": "t1_hlfk56e",
                                                                            "score": -2,
                                                                            "created_utc": 1637443745.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "The fact that u think genjutsu is a transformation says alot finish naruto before u start debating in the comments",
                                                                                    "author": "dexanor",
                                                                                    "id": "hlfkodo",
                                                                                    "parent_id": "t1_hlfki4r",
                                                                                    "score": 2,
                                                                                    "created_utc": 1637443823.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I never said genjutsu was a transformation jutsu. You should learn to read before reading Naruto, I think.",
                                                                                            "author": "Hevens-assassin",
                                                                                            "id": "hlgen6w",
                                                                                            "parent_id": "t1_hlfkodo",
                                                                                            "score": 1,
                                                                                            "created_utc": 1637457719.0,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "body": "Genjutsu, when the victim to it, does involve transformation of one's perceptions, whereas sexy jutsu is an actual transformation. Tsunade transformed her appearance by using her own healing to create a younger look. It's a healing jutsu, not a transformation jutsu where the victim sees something different. There is no \"underlying\" Tsunade. It's fully her, just a perpetual youthfulness. So when her passive healing is stopped due to lack of Chakra, her cells rapidly age, which, is not a transformation jutsu, it is a lack of healing.",
                                                                                            "author": "Hevens-assassin",
                                                                                            "id": "hlgf78d",
                                                                                            "parent_id": "t1_hlfkodo",
                                                                                            "score": 1,
                                                                                            "created_utc": 1637457989.0,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "body": "Its a form of transformation jutsu, but not the standard transformation jutsu.",
                                                                                            "author": "xNuxIsGod",
                                                                                            "id": "hlh6cct",
                                                                                            "parent_id": "t1_hlfkodo",
                                                                                            "score": 1,
                                                                                            "created_utc": 1637472674.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Kid read my comment, clearly you didn't read it. 👍🏻",
                                                            "author": null,
                                                            "id": "hle7ec5",
                                                            "parent_id": "t1_hle76vy",
                                                            "score": -27,
                                                            "created_utc": 1637422494.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I did",
                                                                    "author": "dexanor",
                                                                    "id": "hle7gs5",
                                                                    "parent_id": "t1_hle7ec5",
                                                                    "score": 10,
                                                                    "created_utc": 1637422524.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "This guy is trolling hard af right now. I refuse to believe a Tsunade fan doesn't know how her powerset works.",
                                                                            "author": null,
                                                                            "id": "hlemwiq",
                                                                            "parent_id": "t1_hle7gs5",
                                                                            "score": 7,
                                                                            "created_utc": 1637429148.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "He must be",
                                                                                    "author": "dexanor",
                                                                                    "id": "hlen05e",
                                                                                    "parent_id": "t1_hlemwiq",
                                                                                    "score": 2,
                                                                                    "created_utc": 1637429190.0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "body": "He's just mad that a wrinkly old lady gave him a boner.",
                                                                                    "author": "flippysquid",
                                                                                    "id": "hlg278m",
                                                                                    "parent_id": "t1_hlemwiq",
                                                                                    "score": 1,
                                                                                    "created_utc": 1637451828.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "You are the WORST Tsunade fan I've ever seen. Lmfao",
                                                                    "author": "Symmiie",
                                                                    "id": "hlghl7r",
                                                                    "parent_id": "t1_hle7ec5",
                                                                    "score": 1,
                                                                    "created_utc": 1637459160.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Cry more loser",
                                                                            "author": null,
                                                                            "id": "hlghndw",
                                                                            "parent_id": "t1_hlghl7r",
                                                                            "score": 0,
                                                                            "created_utc": 1637459189.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Lmfao is crying now?",
                                                                                    "author": "Symmiie",
                                                                                    "id": "hlghrp0",
                                                                                    "parent_id": "t1_hlghndw",
                                                                                    "score": 1,
                                                                                    "created_utc": 1637459248.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "They is Kakashi and Shizune. Kakashi when seeing naruto heal has explained that naruto using the nine tails chakra to heal will shorten his life-span. Shizune has explained  that the regeneration that tsunade uses is very stressful on her body. Shizune also explained that cells can only divide so much and that’s why tsunade appears to be a lot older than she actually is.",
                                    "author": "HeraldofblueRP",
                                    "id": "hleq8dd",
                                    "parent_id": "t1_hldxrw6",
                                    "score": 2,
                                    "created_utc": 1637430544.0,
                                    "replies": [
                                        {
                                            "body": "What has this to do with the topic? I see you're avoiding everything I said",
                                            "author": null,
                                            "id": "hlfj2mx",
                                            "parent_id": "t1_hleq8dd",
                                            "score": -2,
                                            "created_utc": 1637443104.0,
                                            "replies": [
                                                {
                                                    "body": "Watch the show kid.",
                                                    "author": "HeraldofblueRP",
                                                    "id": "hliyz2z",
                                                    "parent_id": "t1_hlfj2mx",
                                                    "score": 0,
                                                    "created_utc": 1637513042.0,
                                                    "replies": [
                                                        {
                                                            "body": "Get a better I.Q. kids in the comments",
                                                            "author": null,
                                                            "id": "hlj2ztf",
                                                            "parent_id": "t1_hliyz2z",
                                                            "score": 1,
                                                            "created_utc": 1637514692.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Dude its literally explained she uses a jutsu to make her look younger. The reason she wrinkles up when running out of Chakra is because she can't maintain her jutsu. Its why she stays hiden after the pain attack until she's fully replenished.",
                                    "author": "xNuxIsGod",
                                    "id": "hlh67bo",
                                    "parent_id": "t1_hldxrw6",
                                    "score": 1,
                                    "created_utc": 1637472586.0,
                                    "replies": [
                                        {
                                            "body": "Watch the show kid",
                                            "author": null,
                                            "id": "hlh69xs",
                                            "parent_id": "t1_hlh67bo",
                                            "score": -1,
                                            "created_utc": 1637472630.0,
                                            "replies": [
                                                {
                                                    "body": "I did. All 720 episodes 3 times. I think you need to re-watch the show",
                                                    "author": "xNuxIsGod",
                                                    "id": "hlh6gw3",
                                                    "parent_id": "t1_hlh69xs",
                                                    "score": 2,
                                                    "created_utc": 1637472752.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Byakugo seal is shortening lifespan of a person using it (I think)",
                    "author": "PanBizon",
                    "id": "hldv25a",
                    "parent_id": "t1_hlducyt",
                    "score": 33,
                    "created_utc": 1637416350.0,
                    "replies": []
                },
                {
                    "body": "How was Jiraya treating his body worse? He wasn't using a seal that literally drains your life to heal you for an entire war. Nor was he a 24/7 alcoholic for the majority of his life.",
                    "author": "TheHeadlessScholar",
                    "id": "hlehqou",
                    "parent_id": "t1_hlducyt",
                    "score": 6,
                    "created_utc": 1637427000.0,
                    "replies": [
                        {
                            "body": "Draining life doesn't make you look older only in its side effect when Tsunade is almost out of chakara. I don't think you understand or ignoring it to prove your flawed argument.\n\nJiraiya also drank and lived a life style with many girls that he probably had sex with them. He was addicted with spending to get to girls...\n\nJust look at the Tsunade Arc where he was in a building... With woman getting drunk and wasted. \n\nYeah he was alcoholic if he was around woman which was all his life.  So wrong",
                            "author": null,
                            "id": "hlfk87t",
                            "parent_id": "t1_hlehqou",
                            "score": 2,
                            "created_utc": 1637443625.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Cry more 👍🏻",
            "author": null,
            "id": "hlg04n2",
            "parent_id": "t1_hlg02qq",
            "score": -2,
            "created_utc": 1637450884.0,
            "replies": [
                {
                    "body": "Says the one vigorously defending a made up person",
                    "author": "frubano21",
                    "id": "hlg0quo",
                    "parent_id": "t1_hlg04n2",
                    "score": 3,
                    "created_utc": 1637451163.0,
                    "replies": [
                        {
                            "body": "imagine going on a sub-reddit to talk about your passions. can't be me. no no. also, cope.",
                            "author": "xeno696969_",
                            "id": "hlgqt8o",
                            "parent_id": "t1_hlg0quo",
                            "score": 1,
                            "created_utc": 1637463838.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I thought too, then its actually her dress",
            "author": "Yopapa291_real1",
            "id": "hlgmxky",
            "parent_id": "t1_hlexilc",
            "score": 6,
            "created_utc": 1637461834.0,
            "replies": []
        },
        {
            "body": "Haha thanks",
            "author": "TheThotSlayerDoggo",
            "id": "hlfy0fz",
            "parent_id": "t1_hlfawji",
            "score": 5,
            "created_utc": 1637449894.0,
            "replies": []
        },
        {
            "body": "Can confirm, I'm asking.",
            "author": "Bananatistic",
            "id": "hlh2k3l",
            "parent_id": "t1_hlg2w9k",
            "score": 3,
            "created_utc": 1637470373.0,
            "replies": []
        },
        {
            "body": "lets just say all women written by kishimoto are born with the strongest forbidden jutsu of all time called no-screentime-justu and in the history of shinobi world 1010 have mastered it to near perfection",
            "author": "No-Alfalfa8771",
            "id": "hlg95ve",
            "parent_id": "t1_hlen0sa",
            "score": 9,
            "created_utc": 1637455075.0,
            "replies": []
        },
        {
            "body": "I love how you say hentards it’s sounds like some thing very different",
            "author": "Sonypak",
            "id": "hldyhk3",
            "parent_id": "t1_hldy1ce",
            "score": 11,
            "created_utc": 1637418208.0,
            "replies": []
        },
        {
            "body": "Hentards 💀",
            "author": "elysianyuri",
            "id": "hle2doc",
            "parent_id": "t1_hldy1ce",
            "score": 6,
            "created_utc": 1637420160.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hlfge87",
            "parent_id": "t1_hldy1ce",
            "score": 1,
            "created_utc": 1637441884.0,
            "replies": [
                {
                    "body": "I don't like sakura but okay hentaitards...\n\nGo worship useless hyuga girl who's spineless and weak",
                    "author": null,
                    "id": "hlfj9w6",
                    "parent_id": "t1_hlfge87",
                    "score": 2,
                    "created_utc": 1637443194.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They explain this for every character who has healing powers, including Naruto. Regeneration is done by the dividing of cells of the individual. Cells have a limit to how much they can divide.  This is why tsunade has aged quicker than her peers. She’s constantly shortening her life to rapidly heal. Although it’s never been stated why hashirama died an early death, it’s implied that his life span was significantly shortened due to all his healing he has done in battle and what not.",
            "author": "HeraldofblueRP",
            "id": "hldx0g4",
            "parent_id": "t1_hlducyt",
            "score": 127,
            "created_utc": 1637417426.0,
            "replies": [
                {
                    "body": "Side note, all you need to do is regenerate the cell telomeres themselves and you would fix the base problem of the cell only being able to divide so many times.\n\n**Edit**: I see people don't understand cells.",
                    "author": "DisneyPrincessDVorah",
                    "id": "hldzf2r",
                    "parent_id": "t1_hldx0g4",
                    "score": -7,
                    "created_utc": 1637418697.0,
                    "replies": [
                        {
                            "body": "Well, not necessarily, it also depends on amount of mutations that had taken place in parts of DNA that are coding. Sometimes mutations are not causing cells to die, but can cause problems when some accumulate therefore making cells ineffective in their purposes.\n\nThere is no real solution to this because mutations are happening constantly from before your birth to the end. Even with a way to replenish mutated cells they would appear again.",
                            "author": null,
                            "id": "hlef1fa",
                            "parent_id": "t1_hldzf2r",
                            "score": 6,
                            "created_utc": 1637425844.0,
                            "replies": []
                        },
                        {
                            "body": "Maybe in real life, Naruto clearly ain't real life.",
                            "author": "EmbarrassedMonk6591",
                            "id": "hlfk5ij",
                            "parent_id": "t1_hldzf2r",
                            "score": -6,
                            "created_utc": 1637443593.0,
                            "replies": [
                                {
                                    "body": "So, wait, there's cells and cloning but telomeres are too far? \n\nGet out of here with that wack ass shit.",
                                    "author": "DisneyPrincessDVorah",
                                    "id": "hlfzy1h",
                                    "parent_id": "t1_hlfk5ij",
                                    "score": -1,
                                    "created_utc": 1637450800.0,
                                    "replies": [
                                        {
                                            "body": "No you fucking idiot, have you seen healing Ninjutsu or these god damn Hodge podge transplantations? Biology clearly isn't the same in the Naruto universe so why are you assuming telomeres exist? I never said telomeres are \"too far\".",
                                            "author": "EmbarrassedMonk6591",
                                            "id": "hlg06pd",
                                            "parent_id": "t1_hlfzy1h",
                                            "score": 0,
                                            "created_utc": 1637450909.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It doesn't make you age older in appearance wise... There's no evidence, you're just guessing even though Lady Tsunade said when she's most out of chakara her side affects appear. Who's this \"they\" because Lady Tsunade and Hashirama are the best healers to ever and not regular healers",
                    "author": null,
                    "id": "hldxrw6",
                    "parent_id": "t1_hldx0g4",
                    "score": -32,
                    "created_utc": 1637417831.0,
                    "replies": [
                        {
                            "body": "Tsunade would specifically change her appearance due to gambling debts etc...   \n\n\nThere was a whole plot-point about her being older than her appearance before the time skip in Naruto, you prolly just don't remember/didn't watch it.",
                            "author": "Caststarman",
                            "id": "hle2i37",
                            "parent_id": "t1_hldxrw6",
                            "score": 43,
                            "created_utc": 1637420221.0,
                            "replies": [
                                {
                                    "body": "It's called a transformation jutsu everyone uses it for their benefit... What's your point? We know she looks younger than her real age,  im saying her wrinkly form is not what she looks like if she was natrual. It happens when she's almost out of chakara. That's why it's a side effect... \n\nWhat's your next excuse to bash Lady Tsunade's appearance?",
                                    "author": null,
                                    "id": "hle2z22",
                                    "parent_id": "t1_hle2i37",
                                    "score": -34,
                                    "created_utc": 1637420455.0,
                                    "replies": [
                                        {
                                            "body": "Your so dumb when she runs out of chakra she can no longer hold the transformation simple",
                                            "author": "dexanor",
                                            "id": "hle76vy",
                                            "parent_id": "t1_hle2z22",
                                            "score": 22,
                                            "created_utc": 1637422399.0,
                                            "replies": [
                                                {
                                                    "body": "I don't think it's a transformation, just a continual healing of cells to prevent them from aging, but then when she's out of Chakra she can't continue to hold that jutsu. Not quite the transformation jutsu we see others do.",
                                                    "author": "Hevens-assassin",
                                                    "id": "hlfjzr1",
                                                    "parent_id": "t1_hle76vy",
                                                    "score": -2,
                                                    "created_utc": 1637443523.0,
                                                    "replies": [
                                                        {
                                                            "body": "u may think thats how it works but I know its a transformation cause it was stated many times in canon",
                                                            "author": "dexanor",
                                                            "id": "hlfk56e",
                                                            "parent_id": "t1_hlfjzr1",
                                                            "score": 4,
                                                            "created_utc": 1637443589.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Its a transformation, but not a transformation jutsu, correct? It's not the same as a sexy jutsu or genjutsu. I just wanted to clarify that it's not a \"transformation jutsu\" so much as a healing jutsu that just happens to keep the body looking a certain way.",
                                                                    "author": "Hevens-assassin",
                                                                    "id": "hlfki4r",
                                                                    "parent_id": "t1_hlfk56e",
                                                                    "score": -2,
                                                                    "created_utc": 1637443745.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "The fact that u think genjutsu is a transformation says alot finish naruto before u start debating in the comments",
                                                                            "author": "dexanor",
                                                                            "id": "hlfkodo",
                                                                            "parent_id": "t1_hlfki4r",
                                                                            "score": 2,
                                                                            "created_utc": 1637443823.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I never said genjutsu was a transformation jutsu. You should learn to read before reading Naruto, I think.",
                                                                                    "author": "Hevens-assassin",
                                                                                    "id": "hlgen6w",
                                                                                    "parent_id": "t1_hlfkodo",
                                                                                    "score": 1,
                                                                                    "created_utc": 1637457719.0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "body": "Genjutsu, when the victim to it, does involve transformation of one's perceptions, whereas sexy jutsu is an actual transformation. Tsunade transformed her appearance by using her own healing to create a younger look. It's a healing jutsu, not a transformation jutsu where the victim sees something different. There is no \"underlying\" Tsunade. It's fully her, just a perpetual youthfulness. So when her passive healing is stopped due to lack of Chakra, her cells rapidly age, which, is not a transformation jutsu, it is a lack of healing.",
                                                                                    "author": "Hevens-assassin",
                                                                                    "id": "hlgf78d",
                                                                                    "parent_id": "t1_hlfkodo",
                                                                                    "score": 1,
                                                                                    "created_utc": 1637457989.0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "body": "Its a form of transformation jutsu, but not the standard transformation jutsu.",
                                                                                    "author": "xNuxIsGod",
                                                                                    "id": "hlh6cct",
                                                                                    "parent_id": "t1_hlfkodo",
                                                                                    "score": 1,
                                                                                    "created_utc": 1637472674.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Kid read my comment, clearly you didn't read it. 👍🏻",
                                                    "author": null,
                                                    "id": "hle7ec5",
                                                    "parent_id": "t1_hle76vy",
                                                    "score": -27,
                                                    "created_utc": 1637422494.0,
                                                    "replies": [
                                                        {
                                                            "body": "I did",
                                                            "author": "dexanor",
                                                            "id": "hle7gs5",
                                                            "parent_id": "t1_hle7ec5",
                                                            "score": 10,
                                                            "created_utc": 1637422524.0,
                                                            "replies": [
                                                                {
                                                                    "body": "This guy is trolling hard af right now. I refuse to believe a Tsunade fan doesn't know how her powerset works.",
                                                                    "author": null,
                                                                    "id": "hlemwiq",
                                                                    "parent_id": "t1_hle7gs5",
                                                                    "score": 7,
                                                                    "created_utc": 1637429148.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "He must be",
                                                                            "author": "dexanor",
                                                                            "id": "hlen05e",
                                                                            "parent_id": "t1_hlemwiq",
                                                                            "score": 2,
                                                                            "created_utc": 1637429190.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "He's just mad that a wrinkly old lady gave him a boner.",
                                                                            "author": "flippysquid",
                                                                            "id": "hlg278m",
                                                                            "parent_id": "t1_hlemwiq",
                                                                            "score": 1,
                                                                            "created_utc": 1637451828.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "You are the WORST Tsunade fan I've ever seen. Lmfao",
                                                            "author": "Symmiie",
                                                            "id": "hlghl7r",
                                                            "parent_id": "t1_hle7ec5",
                                                            "score": 1,
                                                            "created_utc": 1637459160.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Cry more loser",
                                                                    "author": null,
                                                                    "id": "hlghndw",
                                                                    "parent_id": "t1_hlghl7r",
                                                                    "score": 0,
                                                                    "created_utc": 1637459189.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Lmfao is crying now?",
                                                                            "author": "Symmiie",
                                                                            "id": "hlghrp0",
                                                                            "parent_id": "t1_hlghndw",
                                                                            "score": 1,
                                                                            "created_utc": 1637459248.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "They is Kakashi and Shizune. Kakashi when seeing naruto heal has explained that naruto using the nine tails chakra to heal will shorten his life-span. Shizune has explained  that the regeneration that tsunade uses is very stressful on her body. Shizune also explained that cells can only divide so much and that’s why tsunade appears to be a lot older than she actually is.",
                            "author": "HeraldofblueRP",
                            "id": "hleq8dd",
                            "parent_id": "t1_hldxrw6",
                            "score": 2,
                            "created_utc": 1637430544.0,
                            "replies": [
                                {
                                    "body": "What has this to do with the topic? I see you're avoiding everything I said",
                                    "author": null,
                                    "id": "hlfj2mx",
                                    "parent_id": "t1_hleq8dd",
                                    "score": -2,
                                    "created_utc": 1637443104.0,
                                    "replies": [
                                        {
                                            "body": "Watch the show kid.",
                                            "author": "HeraldofblueRP",
                                            "id": "hliyz2z",
                                            "parent_id": "t1_hlfj2mx",
                                            "score": 0,
                                            "created_utc": 1637513042.0,
                                            "replies": [
                                                {
                                                    "body": "Get a better I.Q. kids in the comments",
                                                    "author": null,
                                                    "id": "hlj2ztf",
                                                    "parent_id": "t1_hliyz2z",
                                                    "score": 1,
                                                    "created_utc": 1637514692.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Dude its literally explained she uses a jutsu to make her look younger. The reason she wrinkles up when running out of Chakra is because she can't maintain her jutsu. Its why she stays hiden after the pain attack until she's fully replenished.",
                            "author": "xNuxIsGod",
                            "id": "hlh67bo",
                            "parent_id": "t1_hldxrw6",
                            "score": 1,
                            "created_utc": 1637472586.0,
                            "replies": [
                                {
                                    "body": "Watch the show kid",
                                    "author": null,
                                    "id": "hlh69xs",
                                    "parent_id": "t1_hlh67bo",
                                    "score": -1,
                                    "created_utc": 1637472630.0,
                                    "replies": [
                                        {
                                            "body": "I did. All 720 episodes 3 times. I think you need to re-watch the show",
                                            "author": "xNuxIsGod",
                                            "id": "hlh6gw3",
                                            "parent_id": "t1_hlh69xs",
                                            "score": 2,
                                            "created_utc": 1637472752.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Byakugo seal is shortening lifespan of a person using it (I think)",
            "author": "PanBizon",
            "id": "hldv25a",
            "parent_id": "t1_hlducyt",
            "score": 33,
            "created_utc": 1637416350.0,
            "replies": []
        },
        {
            "body": "How was Jiraya treating his body worse? He wasn't using a seal that literally drains your life to heal you for an entire war. Nor was he a 24/7 alcoholic for the majority of his life.",
            "author": "TheHeadlessScholar",
            "id": "hlehqou",
            "parent_id": "t1_hlducyt",
            "score": 6,
            "created_utc": 1637427000.0,
            "replies": [
                {
                    "body": "Draining life doesn't make you look older only in its side effect when Tsunade is almost out of chakara. I don't think you understand or ignoring it to prove your flawed argument.\n\nJiraiya also drank and lived a life style with many girls that he probably had sex with them. He was addicted with spending to get to girls...\n\nJust look at the Tsunade Arc where he was in a building... With woman getting drunk and wasted. \n\nYeah he was alcoholic if he was around woman which was all his life.  So wrong",
                    "author": null,
                    "id": "hlfk87t",
                    "parent_id": "t1_hlehqou",
                    "score": 2,
                    "created_utc": 1637443625.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Says the one vigorously defending a made up person",
            "author": "frubano21",
            "id": "hlg0quo",
            "parent_id": "t1_hlg04n2",
            "score": 3,
            "created_utc": 1637451163.0,
            "replies": [
                {
                    "body": "imagine going on a sub-reddit to talk about your passions. can't be me. no no. also, cope.",
                    "author": "xeno696969_",
                    "id": "hlgqt8o",
                    "parent_id": "t1_hlg0quo",
                    "score": 1,
                    "created_utc": 1637463838.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't like sakura but okay hentaitards...\n\nGo worship useless hyuga girl who's spineless and weak",
            "author": null,
            "id": "hlfj9w6",
            "parent_id": "t1_hlfge87",
            "score": 2,
            "created_utc": 1637443194.0,
            "replies": []
        },
        {
            "body": "Side note, all you need to do is regenerate the cell telomeres themselves and you would fix the base problem of the cell only being able to divide so many times.\n\n**Edit**: I see people don't understand cells.",
            "author": "DisneyPrincessDVorah",
            "id": "hldzf2r",
            "parent_id": "t1_hldx0g4",
            "score": -7,
            "created_utc": 1637418697.0,
            "replies": [
                {
                    "body": "Well, not necessarily, it also depends on amount of mutations that had taken place in parts of DNA that are coding. Sometimes mutations are not causing cells to die, but can cause problems when some accumulate therefore making cells ineffective in their purposes.\n\nThere is no real solution to this because mutations are happening constantly from before your birth to the end. Even with a way to replenish mutated cells they would appear again.",
                    "author": null,
                    "id": "hlef1fa",
                    "parent_id": "t1_hldzf2r",
                    "score": 6,
                    "created_utc": 1637425844.0,
                    "replies": []
                },
                {
                    "body": "Maybe in real life, Naruto clearly ain't real life.",
                    "author": "EmbarrassedMonk6591",
                    "id": "hlfk5ij",
                    "parent_id": "t1_hldzf2r",
                    "score": -6,
                    "created_utc": 1637443593.0,
                    "replies": [
                        {
                            "body": "So, wait, there's cells and cloning but telomeres are too far? \n\nGet out of here with that wack ass shit.",
                            "author": "DisneyPrincessDVorah",
                            "id": "hlfzy1h",
                            "parent_id": "t1_hlfk5ij",
                            "score": -1,
                            "created_utc": 1637450800.0,
                            "replies": [
                                {
                                    "body": "No you fucking idiot, have you seen healing Ninjutsu or these god damn Hodge podge transplantations? Biology clearly isn't the same in the Naruto universe so why are you assuming telomeres exist? I never said telomeres are \"too far\".",
                                    "author": "EmbarrassedMonk6591",
                                    "id": "hlg06pd",
                                    "parent_id": "t1_hlfzy1h",
                                    "score": 0,
                                    "created_utc": 1637450909.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It doesn't make you age older in appearance wise... There's no evidence, you're just guessing even though Lady Tsunade said when she's most out of chakara her side affects appear. Who's this \"they\" because Lady Tsunade and Hashirama are the best healers to ever and not regular healers",
            "author": null,
            "id": "hldxrw6",
            "parent_id": "t1_hldx0g4",
            "score": -32,
            "created_utc": 1637417831.0,
            "replies": [
                {
                    "body": "Tsunade would specifically change her appearance due to gambling debts etc...   \n\n\nThere was a whole plot-point about her being older than her appearance before the time skip in Naruto, you prolly just don't remember/didn't watch it.",
                    "author": "Caststarman",
                    "id": "hle2i37",
                    "parent_id": "t1_hldxrw6",
                    "score": 43,
                    "created_utc": 1637420221.0,
                    "replies": [
                        {
                            "body": "It's called a transformation jutsu everyone uses it for their benefit... What's your point? We know she looks younger than her real age,  im saying her wrinkly form is not what she looks like if she was natrual. It happens when she's almost out of chakara. That's why it's a side effect... \n\nWhat's your next excuse to bash Lady Tsunade's appearance?",
                            "author": null,
                            "id": "hle2z22",
                            "parent_id": "t1_hle2i37",
                            "score": -34,
                            "created_utc": 1637420455.0,
                            "replies": [
                                {
                                    "body": "Your so dumb when she runs out of chakra she can no longer hold the transformation simple",
                                    "author": "dexanor",
                                    "id": "hle76vy",
                                    "parent_id": "t1_hle2z22",
                                    "score": 22,
                                    "created_utc": 1637422399.0,
                                    "replies": [
                                        {
                                            "body": "I don't think it's a transformation, just a continual healing of cells to prevent them from aging, but then when she's out of Chakra she can't continue to hold that jutsu. Not quite the transformation jutsu we see others do.",
                                            "author": "Hevens-assassin",
                                            "id": "hlfjzr1",
                                            "parent_id": "t1_hle76vy",
                                            "score": -2,
                                            "created_utc": 1637443523.0,
                                            "replies": [
                                                {
                                                    "body": "u may think thats how it works but I know its a transformation cause it was stated many times in canon",
                                                    "author": "dexanor",
                                                    "id": "hlfk56e",
                                                    "parent_id": "t1_hlfjzr1",
                                                    "score": 4,
                                                    "created_utc": 1637443589.0,
                                                    "replies": [
                                                        {
                                                            "body": "Its a transformation, but not a transformation jutsu, correct? It's not the same as a sexy jutsu or genjutsu. I just wanted to clarify that it's not a \"transformation jutsu\" so much as a healing jutsu that just happens to keep the body looking a certain way.",
                                                            "author": "Hevens-assassin",
                                                            "id": "hlfki4r",
                                                            "parent_id": "t1_hlfk56e",
                                                            "score": -2,
                                                            "created_utc": 1637443745.0,
                                                            "replies": [
                                                                {
                                                                    "body": "The fact that u think genjutsu is a transformation says alot finish naruto before u start debating in the comments",
                                                                    "author": "dexanor",
                                                                    "id": "hlfkodo",
                                                                    "parent_id": "t1_hlfki4r",
                                                                    "score": 2,
                                                                    "created_utc": 1637443823.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I never said genjutsu was a transformation jutsu. You should learn to read before reading Naruto, I think.",
                                                                            "author": "Hevens-assassin",
                                                                            "id": "hlgen6w",
                                                                            "parent_id": "t1_hlfkodo",
                                                                            "score": 1,
                                                                            "created_utc": 1637457719.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "Genjutsu, when the victim to it, does involve transformation of one's perceptions, whereas sexy jutsu is an actual transformation. Tsunade transformed her appearance by using her own healing to create a younger look. It's a healing jutsu, not a transformation jutsu where the victim sees something different. There is no \"underlying\" Tsunade. It's fully her, just a perpetual youthfulness. So when her passive healing is stopped due to lack of Chakra, her cells rapidly age, which, is not a transformation jutsu, it is a lack of healing.",
                                                                            "author": "Hevens-assassin",
                                                                            "id": "hlgf78d",
                                                                            "parent_id": "t1_hlfkodo",
                                                                            "score": 1,
                                                                            "created_utc": 1637457989.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "Its a form of transformation jutsu, but not the standard transformation jutsu.",
                                                                            "author": "xNuxIsGod",
                                                                            "id": "hlh6cct",
                                                                            "parent_id": "t1_hlfkodo",
                                                                            "score": 1,
                                                                            "created_utc": 1637472674.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Kid read my comment, clearly you didn't read it. 👍🏻",
                                            "author": null,
                                            "id": "hle7ec5",
                                            "parent_id": "t1_hle76vy",
                                            "score": -27,
                                            "created_utc": 1637422494.0,
                                            "replies": [
                                                {
                                                    "body": "I did",
                                                    "author": "dexanor",
                                                    "id": "hle7gs5",
                                                    "parent_id": "t1_hle7ec5",
                                                    "score": 10,
                                                    "created_utc": 1637422524.0,
                                                    "replies": [
                                                        {
                                                            "body": "This guy is trolling hard af right now. I refuse to believe a Tsunade fan doesn't know how her powerset works.",
                                                            "author": null,
                                                            "id": "hlemwiq",
                                                            "parent_id": "t1_hle7gs5",
                                                            "score": 7,
                                                            "created_utc": 1637429148.0,
                                                            "replies": [
                                                                {
                                                                    "body": "He must be",
                                                                    "author": "dexanor",
                                                                    "id": "hlen05e",
                                                                    "parent_id": "t1_hlemwiq",
                                                                    "score": 2,
                                                                    "created_utc": 1637429190.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "He's just mad that a wrinkly old lady gave him a boner.",
                                                                    "author": "flippysquid",
                                                                    "id": "hlg278m",
                                                                    "parent_id": "t1_hlemwiq",
                                                                    "score": 1,
                                                                    "created_utc": 1637451828.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "You are the WORST Tsunade fan I've ever seen. Lmfao",
                                                    "author": "Symmiie",
                                                    "id": "hlghl7r",
                                                    "parent_id": "t1_hle7ec5",
                                                    "score": 1,
                                                    "created_utc": 1637459160.0,
                                                    "replies": [
                                                        {
                                                            "body": "Cry more loser",
                                                            "author": null,
                                                            "id": "hlghndw",
                                                            "parent_id": "t1_hlghl7r",
                                                            "score": 0,
                                                            "created_utc": 1637459189.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Lmfao is crying now?",
                                                                    "author": "Symmiie",
                                                                    "id": "hlghrp0",
                                                                    "parent_id": "t1_hlghndw",
                                                                    "score": 1,
                                                                    "created_utc": 1637459248.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "They is Kakashi and Shizune. Kakashi when seeing naruto heal has explained that naruto using the nine tails chakra to heal will shorten his life-span. Shizune has explained  that the regeneration that tsunade uses is very stressful on her body. Shizune also explained that cells can only divide so much and that’s why tsunade appears to be a lot older than she actually is.",
                    "author": "HeraldofblueRP",
                    "id": "hleq8dd",
                    "parent_id": "t1_hldxrw6",
                    "score": 2,
                    "created_utc": 1637430544.0,
                    "replies": [
                        {
                            "body": "What has this to do with the topic? I see you're avoiding everything I said",
                            "author": null,
                            "id": "hlfj2mx",
                            "parent_id": "t1_hleq8dd",
                            "score": -2,
                            "created_utc": 1637443104.0,
                            "replies": [
                                {
                                    "body": "Watch the show kid.",
                                    "author": "HeraldofblueRP",
                                    "id": "hliyz2z",
                                    "parent_id": "t1_hlfj2mx",
                                    "score": 0,
                                    "created_utc": 1637513042.0,
                                    "replies": [
                                        {
                                            "body": "Get a better I.Q. kids in the comments",
                                            "author": null,
                                            "id": "hlj2ztf",
                                            "parent_id": "t1_hliyz2z",
                                            "score": 1,
                                            "created_utc": 1637514692.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Dude its literally explained she uses a jutsu to make her look younger. The reason she wrinkles up when running out of Chakra is because she can't maintain her jutsu. Its why she stays hiden after the pain attack until she's fully replenished.",
                    "author": "xNuxIsGod",
                    "id": "hlh67bo",
                    "parent_id": "t1_hldxrw6",
                    "score": 1,
                    "created_utc": 1637472586.0,
                    "replies": [
                        {
                            "body": "Watch the show kid",
                            "author": null,
                            "id": "hlh69xs",
                            "parent_id": "t1_hlh67bo",
                            "score": -1,
                            "created_utc": 1637472630.0,
                            "replies": [
                                {
                                    "body": "I did. All 720 episodes 3 times. I think you need to re-watch the show",
                                    "author": "xNuxIsGod",
                                    "id": "hlh6gw3",
                                    "parent_id": "t1_hlh69xs",
                                    "score": 2,
                                    "created_utc": 1637472752.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Draining life doesn't make you look older only in its side effect when Tsunade is almost out of chakara. I don't think you understand or ignoring it to prove your flawed argument.\n\nJiraiya also drank and lived a life style with many girls that he probably had sex with them. He was addicted with spending to get to girls...\n\nJust look at the Tsunade Arc where he was in a building... With woman getting drunk and wasted. \n\nYeah he was alcoholic if he was around woman which was all his life.  So wrong",
            "author": null,
            "id": "hlfk87t",
            "parent_id": "t1_hlehqou",
            "score": 2,
            "created_utc": 1637443625.0,
            "replies": []
        },
        {
            "body": "imagine going on a sub-reddit to talk about your passions. can't be me. no no. also, cope.",
            "author": "xeno696969_",
            "id": "hlgqt8o",
            "parent_id": "t1_hlg0quo",
            "score": 1,
            "created_utc": 1637463838.0,
            "replies": []
        },
        {
            "body": "Well, not necessarily, it also depends on amount of mutations that had taken place in parts of DNA that are coding. Sometimes mutations are not causing cells to die, but can cause problems when some accumulate therefore making cells ineffective in their purposes.\n\nThere is no real solution to this because mutations are happening constantly from before your birth to the end. Even with a way to replenish mutated cells they would appear again.",
            "author": null,
            "id": "hlef1fa",
            "parent_id": "t1_hldzf2r",
            "score": 6,
            "created_utc": 1637425844.0,
            "replies": []
        },
        {
            "body": "Maybe in real life, Naruto clearly ain't real life.",
            "author": "EmbarrassedMonk6591",
            "id": "hlfk5ij",
            "parent_id": "t1_hldzf2r",
            "score": -6,
            "created_utc": 1637443593.0,
            "replies": [
                {
                    "body": "So, wait, there's cells and cloning but telomeres are too far? \n\nGet out of here with that wack ass shit.",
                    "author": "DisneyPrincessDVorah",
                    "id": "hlfzy1h",
                    "parent_id": "t1_hlfk5ij",
                    "score": -1,
                    "created_utc": 1637450800.0,
                    "replies": [
                        {
                            "body": "No you fucking idiot, have you seen healing Ninjutsu or these god damn Hodge podge transplantations? Biology clearly isn't the same in the Naruto universe so why are you assuming telomeres exist? I never said telomeres are \"too far\".",
                            "author": "EmbarrassedMonk6591",
                            "id": "hlg06pd",
                            "parent_id": "t1_hlfzy1h",
                            "score": 0,
                            "created_utc": 1637450909.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tsunade would specifically change her appearance due to gambling debts etc...   \n\n\nThere was a whole plot-point about her being older than her appearance before the time skip in Naruto, you prolly just don't remember/didn't watch it.",
            "author": "Caststarman",
            "id": "hle2i37",
            "parent_id": "t1_hldxrw6",
            "score": 43,
            "created_utc": 1637420221.0,
            "replies": [
                {
                    "body": "It's called a transformation jutsu everyone uses it for their benefit... What's your point? We know she looks younger than her real age,  im saying her wrinkly form is not what she looks like if she was natrual. It happens when she's almost out of chakara. That's why it's a side effect... \n\nWhat's your next excuse to bash Lady Tsunade's appearance?",
                    "author": null,
                    "id": "hle2z22",
                    "parent_id": "t1_hle2i37",
                    "score": -34,
                    "created_utc": 1637420455.0,
                    "replies": [
                        {
                            "body": "Your so dumb when she runs out of chakra she can no longer hold the transformation simple",
                            "author": "dexanor",
                            "id": "hle76vy",
                            "parent_id": "t1_hle2z22",
                            "score": 22,
                            "created_utc": 1637422399.0,
                            "replies": [
                                {
                                    "body": "I don't think it's a transformation, just a continual healing of cells to prevent them from aging, but then when she's out of Chakra she can't continue to hold that jutsu. Not quite the transformation jutsu we see others do.",
                                    "author": "Hevens-assassin",
                                    "id": "hlfjzr1",
                                    "parent_id": "t1_hle76vy",
                                    "score": -2,
                                    "created_utc": 1637443523.0,
                                    "replies": [
                                        {
                                            "body": "u may think thats how it works but I know its a transformation cause it was stated many times in canon",
                                            "author": "dexanor",
                                            "id": "hlfk56e",
                                            "parent_id": "t1_hlfjzr1",
                                            "score": 4,
                                            "created_utc": 1637443589.0,
                                            "replies": [
                                                {
                                                    "body": "Its a transformation, but not a transformation jutsu, correct? It's not the same as a sexy jutsu or genjutsu. I just wanted to clarify that it's not a \"transformation jutsu\" so much as a healing jutsu that just happens to keep the body looking a certain way.",
                                                    "author": "Hevens-assassin",
                                                    "id": "hlfki4r",
                                                    "parent_id": "t1_hlfk56e",
                                                    "score": -2,
                                                    "created_utc": 1637443745.0,
                                                    "replies": [
                                                        {
                                                            "body": "The fact that u think genjutsu is a transformation says alot finish naruto before u start debating in the comments",
                                                            "author": "dexanor",
                                                            "id": "hlfkodo",
                                                            "parent_id": "t1_hlfki4r",
                                                            "score": 2,
                                                            "created_utc": 1637443823.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I never said genjutsu was a transformation jutsu. You should learn to read before reading Naruto, I think.",
                                                                    "author": "Hevens-assassin",
                                                                    "id": "hlgen6w",
                                                                    "parent_id": "t1_hlfkodo",
                                                                    "score": 1,
                                                                    "created_utc": 1637457719.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Genjutsu, when the victim to it, does involve transformation of one's perceptions, whereas sexy jutsu is an actual transformation. Tsunade transformed her appearance by using her own healing to create a younger look. It's a healing jutsu, not a transformation jutsu where the victim sees something different. There is no \"underlying\" Tsunade. It's fully her, just a perpetual youthfulness. So when her passive healing is stopped due to lack of Chakra, her cells rapidly age, which, is not a transformation jutsu, it is a lack of healing.",
                                                                    "author": "Hevens-assassin",
                                                                    "id": "hlgf78d",
                                                                    "parent_id": "t1_hlfkodo",
                                                                    "score": 1,
                                                                    "created_utc": 1637457989.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Its a form of transformation jutsu, but not the standard transformation jutsu.",
                                                                    "author": "xNuxIsGod",
                                                                    "id": "hlh6cct",
                                                                    "parent_id": "t1_hlfkodo",
                                                                    "score": 1,
                                                                    "created_utc": 1637472674.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Kid read my comment, clearly you didn't read it. 👍🏻",
                                    "author": null,
                                    "id": "hle7ec5",
                                    "parent_id": "t1_hle76vy",
                                    "score": -27,
                                    "created_utc": 1637422494.0,
                                    "replies": [
                                        {
                                            "body": "I did",
                                            "author": "dexanor",
                                            "id": "hle7gs5",
                                            "parent_id": "t1_hle7ec5",
                                            "score": 10,
                                            "created_utc": 1637422524.0,
                                            "replies": [
                                                {
                                                    "body": "This guy is trolling hard af right now. I refuse to believe a Tsunade fan doesn't know how her powerset works.",
                                                    "author": null,
                                                    "id": "hlemwiq",
                                                    "parent_id": "t1_hle7gs5",
                                                    "score": 7,
                                                    "created_utc": 1637429148.0,
                                                    "replies": [
                                                        {
                                                            "body": "He must be",
                                                            "author": "dexanor",
                                                            "id": "hlen05e",
                                                            "parent_id": "t1_hlemwiq",
                                                            "score": 2,
                                                            "created_utc": 1637429190.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "He's just mad that a wrinkly old lady gave him a boner.",
                                                            "author": "flippysquid",
                                                            "id": "hlg278m",
                                                            "parent_id": "t1_hlemwiq",
                                                            "score": 1,
                                                            "created_utc": 1637451828.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "You are the WORST Tsunade fan I've ever seen. Lmfao",
                                            "author": "Symmiie",
                                            "id": "hlghl7r",
                                            "parent_id": "t1_hle7ec5",
                                            "score": 1,
                                            "created_utc": 1637459160.0,
                                            "replies": [
                                                {
                                                    "body": "Cry more loser",
                                                    "author": null,
                                                    "id": "hlghndw",
                                                    "parent_id": "t1_hlghl7r",
                                                    "score": 0,
                                                    "created_utc": 1637459189.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lmfao is crying now?",
                                                            "author": "Symmiie",
                                                            "id": "hlghrp0",
                                                            "parent_id": "t1_hlghndw",
                                                            "score": 1,
                                                            "created_utc": 1637459248.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "They is Kakashi and Shizune. Kakashi when seeing naruto heal has explained that naruto using the nine tails chakra to heal will shorten his life-span. Shizune has explained  that the regeneration that tsunade uses is very stressful on her body. Shizune also explained that cells can only divide so much and that’s why tsunade appears to be a lot older than she actually is.",
            "author": "HeraldofblueRP",
            "id": "hleq8dd",
            "parent_id": "t1_hldxrw6",
            "score": 2,
            "created_utc": 1637430544.0,
            "replies": [
                {
                    "body": "What has this to do with the topic? I see you're avoiding everything I said",
                    "author": null,
                    "id": "hlfj2mx",
                    "parent_id": "t1_hleq8dd",
                    "score": -2,
                    "created_utc": 1637443104.0,
                    "replies": [
                        {
                            "body": "Watch the show kid.",
                            "author": "HeraldofblueRP",
                            "id": "hliyz2z",
                            "parent_id": "t1_hlfj2mx",
                            "score": 0,
                            "created_utc": 1637513042.0,
                            "replies": [
                                {
                                    "body": "Get a better I.Q. kids in the comments",
                                    "author": null,
                                    "id": "hlj2ztf",
                                    "parent_id": "t1_hliyz2z",
                                    "score": 1,
                                    "created_utc": 1637514692.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dude its literally explained she uses a jutsu to make her look younger. The reason she wrinkles up when running out of Chakra is because she can't maintain her jutsu. Its why she stays hiden after the pain attack until she's fully replenished.",
            "author": "xNuxIsGod",
            "id": "hlh67bo",
            "parent_id": "t1_hldxrw6",
            "score": 1,
            "created_utc": 1637472586.0,
            "replies": [
                {
                    "body": "Watch the show kid",
                    "author": null,
                    "id": "hlh69xs",
                    "parent_id": "t1_hlh67bo",
                    "score": -1,
                    "created_utc": 1637472630.0,
                    "replies": [
                        {
                            "body": "I did. All 720 episodes 3 times. I think you need to re-watch the show",
                            "author": "xNuxIsGod",
                            "id": "hlh6gw3",
                            "parent_id": "t1_hlh69xs",
                            "score": 2,
                            "created_utc": 1637472752.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So, wait, there's cells and cloning but telomeres are too far? \n\nGet out of here with that wack ass shit.",
            "author": "DisneyPrincessDVorah",
            "id": "hlfzy1h",
            "parent_id": "t1_hlfk5ij",
            "score": -1,
            "created_utc": 1637450800.0,
            "replies": [
                {
                    "body": "No you fucking idiot, have you seen healing Ninjutsu or these god damn Hodge podge transplantations? Biology clearly isn't the same in the Naruto universe so why are you assuming telomeres exist? I never said telomeres are \"too far\".",
                    "author": "EmbarrassedMonk6591",
                    "id": "hlg06pd",
                    "parent_id": "t1_hlfzy1h",
                    "score": 0,
                    "created_utc": 1637450909.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's called a transformation jutsu everyone uses it for their benefit... What's your point? We know she looks younger than her real age,  im saying her wrinkly form is not what she looks like if she was natrual. It happens when she's almost out of chakara. That's why it's a side effect... \n\nWhat's your next excuse to bash Lady Tsunade's appearance?",
            "author": null,
            "id": "hle2z22",
            "parent_id": "t1_hle2i37",
            "score": -34,
            "created_utc": 1637420455.0,
            "replies": [
                {
                    "body": "Your so dumb when she runs out of chakra she can no longer hold the transformation simple",
                    "author": "dexanor",
                    "id": "hle76vy",
                    "parent_id": "t1_hle2z22",
                    "score": 22,
                    "created_utc": 1637422399.0,
                    "replies": [
                        {
                            "body": "I don't think it's a transformation, just a continual healing of cells to prevent them from aging, but then when she's out of Chakra she can't continue to hold that jutsu. Not quite the transformation jutsu we see others do.",
                            "author": "Hevens-assassin",
                            "id": "hlfjzr1",
                            "parent_id": "t1_hle76vy",
                            "score": -2,
                            "created_utc": 1637443523.0,
                            "replies": [
                                {
                                    "body": "u may think thats how it works but I know its a transformation cause it was stated many times in canon",
                                    "author": "dexanor",
                                    "id": "hlfk56e",
                                    "parent_id": "t1_hlfjzr1",
                                    "score": 4,
                                    "created_utc": 1637443589.0,
                                    "replies": [
                                        {
                                            "body": "Its a transformation, but not a transformation jutsu, correct? It's not the same as a sexy jutsu or genjutsu. I just wanted to clarify that it's not a \"transformation jutsu\" so much as a healing jutsu that just happens to keep the body looking a certain way.",
                                            "author": "Hevens-assassin",
                                            "id": "hlfki4r",
                                            "parent_id": "t1_hlfk56e",
                                            "score": -2,
                                            "created_utc": 1637443745.0,
                                            "replies": [
                                                {
                                                    "body": "The fact that u think genjutsu is a transformation says alot finish naruto before u start debating in the comments",
                                                    "author": "dexanor",
                                                    "id": "hlfkodo",
                                                    "parent_id": "t1_hlfki4r",
                                                    "score": 2,
                                                    "created_utc": 1637443823.0,
                                                    "replies": [
                                                        {
                                                            "body": "I never said genjutsu was a transformation jutsu. You should learn to read before reading Naruto, I think.",
                                                            "author": "Hevens-assassin",
                                                            "id": "hlgen6w",
                                                            "parent_id": "t1_hlfkodo",
                                                            "score": 1,
                                                            "created_utc": 1637457719.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Genjutsu, when the victim to it, does involve transformation of one's perceptions, whereas sexy jutsu is an actual transformation. Tsunade transformed her appearance by using her own healing to create a younger look. It's a healing jutsu, not a transformation jutsu where the victim sees something different. There is no \"underlying\" Tsunade. It's fully her, just a perpetual youthfulness. So when her passive healing is stopped due to lack of Chakra, her cells rapidly age, which, is not a transformation jutsu, it is a lack of healing.",
                                                            "author": "Hevens-assassin",
                                                            "id": "hlgf78d",
                                                            "parent_id": "t1_hlfkodo",
                                                            "score": 1,
                                                            "created_utc": 1637457989.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Its a form of transformation jutsu, but not the standard transformation jutsu.",
                                                            "author": "xNuxIsGod",
                                                            "id": "hlh6cct",
                                                            "parent_id": "t1_hlfkodo",
                                                            "score": 1,
                                                            "created_utc": 1637472674.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Kid read my comment, clearly you didn't read it. 👍🏻",
                            "author": null,
                            "id": "hle7ec5",
                            "parent_id": "t1_hle76vy",
                            "score": -27,
                            "created_utc": 1637422494.0,
                            "replies": [
                                {
                                    "body": "I did",
                                    "author": "dexanor",
                                    "id": "hle7gs5",
                                    "parent_id": "t1_hle7ec5",
                                    "score": 10,
                                    "created_utc": 1637422524.0,
                                    "replies": [
                                        {
                                            "body": "This guy is trolling hard af right now. I refuse to believe a Tsunade fan doesn't know how her powerset works.",
                                            "author": null,
                                            "id": "hlemwiq",
                                            "parent_id": "t1_hle7gs5",
                                            "score": 7,
                                            "created_utc": 1637429148.0,
                                            "replies": [
                                                {
                                                    "body": "He must be",
                                                    "author": "dexanor",
                                                    "id": "hlen05e",
                                                    "parent_id": "t1_hlemwiq",
                                                    "score": 2,
                                                    "created_utc": 1637429190.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "He's just mad that a wrinkly old lady gave him a boner.",
                                                    "author": "flippysquid",
                                                    "id": "hlg278m",
                                                    "parent_id": "t1_hlemwiq",
                                                    "score": 1,
                                                    "created_utc": 1637451828.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You are the WORST Tsunade fan I've ever seen. Lmfao",
                                    "author": "Symmiie",
                                    "id": "hlghl7r",
                                    "parent_id": "t1_hle7ec5",
                                    "score": 1,
                                    "created_utc": 1637459160.0,
                                    "replies": [
                                        {
                                            "body": "Cry more loser",
                                            "author": null,
                                            "id": "hlghndw",
                                            "parent_id": "t1_hlghl7r",
                                            "score": 0,
                                            "created_utc": 1637459189.0,
                                            "replies": [
                                                {
                                                    "body": "Lmfao is crying now?",
                                                    "author": "Symmiie",
                                                    "id": "hlghrp0",
                                                    "parent_id": "t1_hlghndw",
                                                    "score": 1,
                                                    "created_utc": 1637459248.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What has this to do with the topic? I see you're avoiding everything I said",
            "author": null,
            "id": "hlfj2mx",
            "parent_id": "t1_hleq8dd",
            "score": -2,
            "created_utc": 1637443104.0,
            "replies": [
                {
                    "body": "Watch the show kid.",
                    "author": "HeraldofblueRP",
                    "id": "hliyz2z",
                    "parent_id": "t1_hlfj2mx",
                    "score": 0,
                    "created_utc": 1637513042.0,
                    "replies": [
                        {
                            "body": "Get a better I.Q. kids in the comments",
                            "author": null,
                            "id": "hlj2ztf",
                            "parent_id": "t1_hliyz2z",
                            "score": 1,
                            "created_utc": 1637514692.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Watch the show kid",
            "author": null,
            "id": "hlh69xs",
            "parent_id": "t1_hlh67bo",
            "score": -1,
            "created_utc": 1637472630.0,
            "replies": [
                {
                    "body": "I did. All 720 episodes 3 times. I think you need to re-watch the show",
                    "author": "xNuxIsGod",
                    "id": "hlh6gw3",
                    "parent_id": "t1_hlh69xs",
                    "score": 2,
                    "created_utc": 1637472752.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No you fucking idiot, have you seen healing Ninjutsu or these god damn Hodge podge transplantations? Biology clearly isn't the same in the Naruto universe so why are you assuming telomeres exist? I never said telomeres are \"too far\".",
            "author": "EmbarrassedMonk6591",
            "id": "hlg06pd",
            "parent_id": "t1_hlfzy1h",
            "score": 0,
            "created_utc": 1637450909.0,
            "replies": []
        },
        {
            "body": "Your so dumb when she runs out of chakra she can no longer hold the transformation simple",
            "author": "dexanor",
            "id": "hle76vy",
            "parent_id": "t1_hle2z22",
            "score": 22,
            "created_utc": 1637422399.0,
            "replies": [
                {
                    "body": "I don't think it's a transformation, just a continual healing of cells to prevent them from aging, but then when she's out of Chakra she can't continue to hold that jutsu. Not quite the transformation jutsu we see others do.",
                    "author": "Hevens-assassin",
                    "id": "hlfjzr1",
                    "parent_id": "t1_hle76vy",
                    "score": -2,
                    "created_utc": 1637443523.0,
                    "replies": [
                        {
                            "body": "u may think thats how it works but I know its a transformation cause it was stated many times in canon",
                            "author": "dexanor",
                            "id": "hlfk56e",
                            "parent_id": "t1_hlfjzr1",
                            "score": 4,
                            "created_utc": 1637443589.0,
                            "replies": [
                                {
                                    "body": "Its a transformation, but not a transformation jutsu, correct? It's not the same as a sexy jutsu or genjutsu. I just wanted to clarify that it's not a \"transformation jutsu\" so much as a healing jutsu that just happens to keep the body looking a certain way.",
                                    "author": "Hevens-assassin",
                                    "id": "hlfki4r",
                                    "parent_id": "t1_hlfk56e",
                                    "score": -2,
                                    "created_utc": 1637443745.0,
                                    "replies": [
                                        {
                                            "body": "The fact that u think genjutsu is a transformation says alot finish naruto before u start debating in the comments",
                                            "author": "dexanor",
                                            "id": "hlfkodo",
                                            "parent_id": "t1_hlfki4r",
                                            "score": 2,
                                            "created_utc": 1637443823.0,
                                            "replies": [
                                                {
                                                    "body": "I never said genjutsu was a transformation jutsu. You should learn to read before reading Naruto, I think.",
                                                    "author": "Hevens-assassin",
                                                    "id": "hlgen6w",
                                                    "parent_id": "t1_hlfkodo",
                                                    "score": 1,
                                                    "created_utc": 1637457719.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Genjutsu, when the victim to it, does involve transformation of one's perceptions, whereas sexy jutsu is an actual transformation. Tsunade transformed her appearance by using her own healing to create a younger look. It's a healing jutsu, not a transformation jutsu where the victim sees something different. There is no \"underlying\" Tsunade. It's fully her, just a perpetual youthfulness. So when her passive healing is stopped due to lack of Chakra, her cells rapidly age, which, is not a transformation jutsu, it is a lack of healing.",
                                                    "author": "Hevens-assassin",
                                                    "id": "hlgf78d",
                                                    "parent_id": "t1_hlfkodo",
                                                    "score": 1,
                                                    "created_utc": 1637457989.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Its a form of transformation jutsu, but not the standard transformation jutsu.",
                                                    "author": "xNuxIsGod",
                                                    "id": "hlh6cct",
                                                    "parent_id": "t1_hlfkodo",
                                                    "score": 1,
                                                    "created_utc": 1637472674.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Kid read my comment, clearly you didn't read it. 👍🏻",
                    "author": null,
                    "id": "hle7ec5",
                    "parent_id": "t1_hle76vy",
                    "score": -27,
                    "created_utc": 1637422494.0,
                    "replies": [
                        {
                            "body": "I did",
                            "author": "dexanor",
                            "id": "hle7gs5",
                            "parent_id": "t1_hle7ec5",
                            "score": 10,
                            "created_utc": 1637422524.0,
                            "replies": [
                                {
                                    "body": "This guy is trolling hard af right now. I refuse to believe a Tsunade fan doesn't know how her powerset works.",
                                    "author": null,
                                    "id": "hlemwiq",
                                    "parent_id": "t1_hle7gs5",
                                    "score": 7,
                                    "created_utc": 1637429148.0,
                                    "replies": [
                                        {
                                            "body": "He must be",
                                            "author": "dexanor",
                                            "id": "hlen05e",
                                            "parent_id": "t1_hlemwiq",
                                            "score": 2,
                                            "created_utc": 1637429190.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "He's just mad that a wrinkly old lady gave him a boner.",
                                            "author": "flippysquid",
                                            "id": "hlg278m",
                                            "parent_id": "t1_hlemwiq",
                                            "score": 1,
                                            "created_utc": 1637451828.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You are the WORST Tsunade fan I've ever seen. Lmfao",
                            "author": "Symmiie",
                            "id": "hlghl7r",
                            "parent_id": "t1_hle7ec5",
                            "score": 1,
                            "created_utc": 1637459160.0,
                            "replies": [
                                {
                                    "body": "Cry more loser",
                                    "author": null,
                                    "id": "hlghndw",
                                    "parent_id": "t1_hlghl7r",
                                    "score": 0,
                                    "created_utc": 1637459189.0,
                                    "replies": [
                                        {
                                            "body": "Lmfao is crying now?",
                                            "author": "Symmiie",
                                            "id": "hlghrp0",
                                            "parent_id": "t1_hlghndw",
                                            "score": 1,
                                            "created_utc": 1637459248.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Watch the show kid.",
            "author": "HeraldofblueRP",
            "id": "hliyz2z",
            "parent_id": "t1_hlfj2mx",
            "score": 0,
            "created_utc": 1637513042.0,
            "replies": [
                {
                    "body": "Get a better I.Q. kids in the comments",
                    "author": null,
                    "id": "hlj2ztf",
                    "parent_id": "t1_hliyz2z",
                    "score": 1,
                    "created_utc": 1637514692.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I did. All 720 episodes 3 times. I think you need to re-watch the show",
            "author": "xNuxIsGod",
            "id": "hlh6gw3",
            "parent_id": "t1_hlh69xs",
            "score": 2,
            "created_utc": 1637472752.0,
            "replies": []
        },
        {
            "body": "I don't think it's a transformation, just a continual healing of cells to prevent them from aging, but then when she's out of Chakra she can't continue to hold that jutsu. Not quite the transformation jutsu we see others do.",
            "author": "Hevens-assassin",
            "id": "hlfjzr1",
            "parent_id": "t1_hle76vy",
            "score": -2,
            "created_utc": 1637443523.0,
            "replies": [
                {
                    "body": "u may think thats how it works but I know its a transformation cause it was stated many times in canon",
                    "author": "dexanor",
                    "id": "hlfk56e",
                    "parent_id": "t1_hlfjzr1",
                    "score": 4,
                    "created_utc": 1637443589.0,
                    "replies": [
                        {
                            "body": "Its a transformation, but not a transformation jutsu, correct? It's not the same as a sexy jutsu or genjutsu. I just wanted to clarify that it's not a \"transformation jutsu\" so much as a healing jutsu that just happens to keep the body looking a certain way.",
                            "author": "Hevens-assassin",
                            "id": "hlfki4r",
                            "parent_id": "t1_hlfk56e",
                            "score": -2,
                            "created_utc": 1637443745.0,
                            "replies": [
                                {
                                    "body": "The fact that u think genjutsu is a transformation says alot finish naruto before u start debating in the comments",
                                    "author": "dexanor",
                                    "id": "hlfkodo",
                                    "parent_id": "t1_hlfki4r",
                                    "score": 2,
                                    "created_utc": 1637443823.0,
                                    "replies": [
                                        {
                                            "body": "I never said genjutsu was a transformation jutsu. You should learn to read before reading Naruto, I think.",
                                            "author": "Hevens-assassin",
                                            "id": "hlgen6w",
                                            "parent_id": "t1_hlfkodo",
                                            "score": 1,
                                            "created_utc": 1637457719.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Genjutsu, when the victim to it, does involve transformation of one's perceptions, whereas sexy jutsu is an actual transformation. Tsunade transformed her appearance by using her own healing to create a younger look. It's a healing jutsu, not a transformation jutsu where the victim sees something different. There is no \"underlying\" Tsunade. It's fully her, just a perpetual youthfulness. So when her passive healing is stopped due to lack of Chakra, her cells rapidly age, which, is not a transformation jutsu, it is a lack of healing.",
                                            "author": "Hevens-assassin",
                                            "id": "hlgf78d",
                                            "parent_id": "t1_hlfkodo",
                                            "score": 1,
                                            "created_utc": 1637457989.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Its a form of transformation jutsu, but not the standard transformation jutsu.",
                                            "author": "xNuxIsGod",
                                            "id": "hlh6cct",
                                            "parent_id": "t1_hlfkodo",
                                            "score": 1,
                                            "created_utc": 1637472674.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Kid read my comment, clearly you didn't read it. 👍🏻",
            "author": null,
            "id": "hle7ec5",
            "parent_id": "t1_hle76vy",
            "score": -27,
            "created_utc": 1637422494.0,
            "replies": [
                {
                    "body": "I did",
                    "author": "dexanor",
                    "id": "hle7gs5",
                    "parent_id": "t1_hle7ec5",
                    "score": 10,
                    "created_utc": 1637422524.0,
                    "replies": [
                        {
                            "body": "This guy is trolling hard af right now. I refuse to believe a Tsunade fan doesn't know how her powerset works.",
                            "author": null,
                            "id": "hlemwiq",
                            "parent_id": "t1_hle7gs5",
                            "score": 7,
                            "created_utc": 1637429148.0,
                            "replies": [
                                {
                                    "body": "He must be",
                                    "author": "dexanor",
                                    "id": "hlen05e",
                                    "parent_id": "t1_hlemwiq",
                                    "score": 2,
                                    "created_utc": 1637429190.0,
                                    "replies": []
                                },
                                {
                                    "body": "He's just mad that a wrinkly old lady gave him a boner.",
                                    "author": "flippysquid",
                                    "id": "hlg278m",
                                    "parent_id": "t1_hlemwiq",
                                    "score": 1,
                                    "created_utc": 1637451828.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You are the WORST Tsunade fan I've ever seen. Lmfao",
                    "author": "Symmiie",
                    "id": "hlghl7r",
                    "parent_id": "t1_hle7ec5",
                    "score": 1,
                    "created_utc": 1637459160.0,
                    "replies": [
                        {
                            "body": "Cry more loser",
                            "author": null,
                            "id": "hlghndw",
                            "parent_id": "t1_hlghl7r",
                            "score": 0,
                            "created_utc": 1637459189.0,
                            "replies": [
                                {
                                    "body": "Lmfao is crying now?",
                                    "author": "Symmiie",
                                    "id": "hlghrp0",
                                    "parent_id": "t1_hlghndw",
                                    "score": 1,
                                    "created_utc": 1637459248.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Get a better I.Q. kids in the comments",
            "author": null,
            "id": "hlj2ztf",
            "parent_id": "t1_hliyz2z",
            "score": 1,
            "created_utc": 1637514692.0,
            "replies": []
        },
        {
            "body": "u may think thats how it works but I know its a transformation cause it was stated many times in canon",
            "author": "dexanor",
            "id": "hlfk56e",
            "parent_id": "t1_hlfjzr1",
            "score": 4,
            "created_utc": 1637443589.0,
            "replies": [
                {
                    "body": "Its a transformation, but not a transformation jutsu, correct? It's not the same as a sexy jutsu or genjutsu. I just wanted to clarify that it's not a \"transformation jutsu\" so much as a healing jutsu that just happens to keep the body looking a certain way.",
                    "author": "Hevens-assassin",
                    "id": "hlfki4r",
                    "parent_id": "t1_hlfk56e",
                    "score": -2,
                    "created_utc": 1637443745.0,
                    "replies": [
                        {
                            "body": "The fact that u think genjutsu is a transformation says alot finish naruto before u start debating in the comments",
                            "author": "dexanor",
                            "id": "hlfkodo",
                            "parent_id": "t1_hlfki4r",
                            "score": 2,
                            "created_utc": 1637443823.0,
                            "replies": [
                                {
                                    "body": "I never said genjutsu was a transformation jutsu. You should learn to read before reading Naruto, I think.",
                                    "author": "Hevens-assassin",
                                    "id": "hlgen6w",
                                    "parent_id": "t1_hlfkodo",
                                    "score": 1,
                                    "created_utc": 1637457719.0,
                                    "replies": []
                                },
                                {
                                    "body": "Genjutsu, when the victim to it, does involve transformation of one's perceptions, whereas sexy jutsu is an actual transformation. Tsunade transformed her appearance by using her own healing to create a younger look. It's a healing jutsu, not a transformation jutsu where the victim sees something different. There is no \"underlying\" Tsunade. It's fully her, just a perpetual youthfulness. So when her passive healing is stopped due to lack of Chakra, her cells rapidly age, which, is not a transformation jutsu, it is a lack of healing.",
                                    "author": "Hevens-assassin",
                                    "id": "hlgf78d",
                                    "parent_id": "t1_hlfkodo",
                                    "score": 1,
                                    "created_utc": 1637457989.0,
                                    "replies": []
                                },
                                {
                                    "body": "Its a form of transformation jutsu, but not the standard transformation jutsu.",
                                    "author": "xNuxIsGod",
                                    "id": "hlh6cct",
                                    "parent_id": "t1_hlfkodo",
                                    "score": 1,
                                    "created_utc": 1637472674.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I did",
            "author": "dexanor",
            "id": "hle7gs5",
            "parent_id": "t1_hle7ec5",
            "score": 10,
            "created_utc": 1637422524.0,
            "replies": [
                {
                    "body": "This guy is trolling hard af right now. I refuse to believe a Tsunade fan doesn't know how her powerset works.",
                    "author": null,
                    "id": "hlemwiq",
                    "parent_id": "t1_hle7gs5",
                    "score": 7,
                    "created_utc": 1637429148.0,
                    "replies": [
                        {
                            "body": "He must be",
                            "author": "dexanor",
                            "id": "hlen05e",
                            "parent_id": "t1_hlemwiq",
                            "score": 2,
                            "created_utc": 1637429190.0,
                            "replies": []
                        },
                        {
                            "body": "He's just mad that a wrinkly old lady gave him a boner.",
                            "author": "flippysquid",
                            "id": "hlg278m",
                            "parent_id": "t1_hlemwiq",
                            "score": 1,
                            "created_utc": 1637451828.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are the WORST Tsunade fan I've ever seen. Lmfao",
            "author": "Symmiie",
            "id": "hlghl7r",
            "parent_id": "t1_hle7ec5",
            "score": 1,
            "created_utc": 1637459160.0,
            "replies": [
                {
                    "body": "Cry more loser",
                    "author": null,
                    "id": "hlghndw",
                    "parent_id": "t1_hlghl7r",
                    "score": 0,
                    "created_utc": 1637459189.0,
                    "replies": [
                        {
                            "body": "Lmfao is crying now?",
                            "author": "Symmiie",
                            "id": "hlghrp0",
                            "parent_id": "t1_hlghndw",
                            "score": 1,
                            "created_utc": 1637459248.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Its a transformation, but not a transformation jutsu, correct? It's not the same as a sexy jutsu or genjutsu. I just wanted to clarify that it's not a \"transformation jutsu\" so much as a healing jutsu that just happens to keep the body looking a certain way.",
            "author": "Hevens-assassin",
            "id": "hlfki4r",
            "parent_id": "t1_hlfk56e",
            "score": -2,
            "created_utc": 1637443745.0,
            "replies": [
                {
                    "body": "The fact that u think genjutsu is a transformation says alot finish naruto before u start debating in the comments",
                    "author": "dexanor",
                    "id": "hlfkodo",
                    "parent_id": "t1_hlfki4r",
                    "score": 2,
                    "created_utc": 1637443823.0,
                    "replies": [
                        {
                            "body": "I never said genjutsu was a transformation jutsu. You should learn to read before reading Naruto, I think.",
                            "author": "Hevens-assassin",
                            "id": "hlgen6w",
                            "parent_id": "t1_hlfkodo",
                            "score": 1,
                            "created_utc": 1637457719.0,
                            "replies": []
                        },
                        {
                            "body": "Genjutsu, when the victim to it, does involve transformation of one's perceptions, whereas sexy jutsu is an actual transformation. Tsunade transformed her appearance by using her own healing to create a younger look. It's a healing jutsu, not a transformation jutsu where the victim sees something different. There is no \"underlying\" Tsunade. It's fully her, just a perpetual youthfulness. So when her passive healing is stopped due to lack of Chakra, her cells rapidly age, which, is not a transformation jutsu, it is a lack of healing.",
                            "author": "Hevens-assassin",
                            "id": "hlgf78d",
                            "parent_id": "t1_hlfkodo",
                            "score": 1,
                            "created_utc": 1637457989.0,
                            "replies": []
                        },
                        {
                            "body": "Its a form of transformation jutsu, but not the standard transformation jutsu.",
                            "author": "xNuxIsGod",
                            "id": "hlh6cct",
                            "parent_id": "t1_hlfkodo",
                            "score": 1,
                            "created_utc": 1637472674.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This guy is trolling hard af right now. I refuse to believe a Tsunade fan doesn't know how her powerset works.",
            "author": null,
            "id": "hlemwiq",
            "parent_id": "t1_hle7gs5",
            "score": 7,
            "created_utc": 1637429148.0,
            "replies": [
                {
                    "body": "He must be",
                    "author": "dexanor",
                    "id": "hlen05e",
                    "parent_id": "t1_hlemwiq",
                    "score": 2,
                    "created_utc": 1637429190.0,
                    "replies": []
                },
                {
                    "body": "He's just mad that a wrinkly old lady gave him a boner.",
                    "author": "flippysquid",
                    "id": "hlg278m",
                    "parent_id": "t1_hlemwiq",
                    "score": 1,
                    "created_utc": 1637451828.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Cry more loser",
            "author": null,
            "id": "hlghndw",
            "parent_id": "t1_hlghl7r",
            "score": 0,
            "created_utc": 1637459189.0,
            "replies": [
                {
                    "body": "Lmfao is crying now?",
                    "author": "Symmiie",
                    "id": "hlghrp0",
                    "parent_id": "t1_hlghndw",
                    "score": 1,
                    "created_utc": 1637459248.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The fact that u think genjutsu is a transformation says alot finish naruto before u start debating in the comments",
            "author": "dexanor",
            "id": "hlfkodo",
            "parent_id": "t1_hlfki4r",
            "score": 2,
            "created_utc": 1637443823.0,
            "replies": [
                {
                    "body": "I never said genjutsu was a transformation jutsu. You should learn to read before reading Naruto, I think.",
                    "author": "Hevens-assassin",
                    "id": "hlgen6w",
                    "parent_id": "t1_hlfkodo",
                    "score": 1,
                    "created_utc": 1637457719.0,
                    "replies": []
                },
                {
                    "body": "Genjutsu, when the victim to it, does involve transformation of one's perceptions, whereas sexy jutsu is an actual transformation. Tsunade transformed her appearance by using her own healing to create a younger look. It's a healing jutsu, not a transformation jutsu where the victim sees something different. There is no \"underlying\" Tsunade. It's fully her, just a perpetual youthfulness. So when her passive healing is stopped due to lack of Chakra, her cells rapidly age, which, is not a transformation jutsu, it is a lack of healing.",
                    "author": "Hevens-assassin",
                    "id": "hlgf78d",
                    "parent_id": "t1_hlfkodo",
                    "score": 1,
                    "created_utc": 1637457989.0,
                    "replies": []
                },
                {
                    "body": "Its a form of transformation jutsu, but not the standard transformation jutsu.",
                    "author": "xNuxIsGod",
                    "id": "hlh6cct",
                    "parent_id": "t1_hlfkodo",
                    "score": 1,
                    "created_utc": 1637472674.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He must be",
            "author": "dexanor",
            "id": "hlen05e",
            "parent_id": "t1_hlemwiq",
            "score": 2,
            "created_utc": 1637429190.0,
            "replies": []
        },
        {
            "body": "He's just mad that a wrinkly old lady gave him a boner.",
            "author": "flippysquid",
            "id": "hlg278m",
            "parent_id": "t1_hlemwiq",
            "score": 1,
            "created_utc": 1637451828.0,
            "replies": []
        },
        {
            "body": "Lmfao is crying now?",
            "author": "Symmiie",
            "id": "hlghrp0",
            "parent_id": "t1_hlghndw",
            "score": 1,
            "created_utc": 1637459248.0,
            "replies": []
        },
        {
            "body": "I never said genjutsu was a transformation jutsu. You should learn to read before reading Naruto, I think.",
            "author": "Hevens-assassin",
            "id": "hlgen6w",
            "parent_id": "t1_hlfkodo",
            "score": 1,
            "created_utc": 1637457719.0,
            "replies": []
        },
        {
            "body": "Genjutsu, when the victim to it, does involve transformation of one's perceptions, whereas sexy jutsu is an actual transformation. Tsunade transformed her appearance by using her own healing to create a younger look. It's a healing jutsu, not a transformation jutsu where the victim sees something different. There is no \"underlying\" Tsunade. It's fully her, just a perpetual youthfulness. So when her passive healing is stopped due to lack of Chakra, her cells rapidly age, which, is not a transformation jutsu, it is a lack of healing.",
            "author": "Hevens-assassin",
            "id": "hlgf78d",
            "parent_id": "t1_hlfkodo",
            "score": 1,
            "created_utc": 1637457989.0,
            "replies": []
        },
        {
            "body": "Its a form of transformation jutsu, but not the standard transformation jutsu.",
            "author": "xNuxIsGod",
            "id": "hlh6cct",
            "parent_id": "t1_hlfkodo",
            "score": 1,
            "created_utc": 1637472674.0,
            "replies": []
        }
    ]
}