{
    "title": "The potential ugly side for SBs.",
    "post_id": "sebwa7",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/sebwa7/the_potential_ugly_side_for_sbs/",
    "author": "bubblerush",
    "body": "I’ve been a SB for a few years and I’ve met quite a few SBs along the way. I’ve seen an increased interest with these relationships since the pandemic, and I just wanted to share some things with aspiring/new SBs. One thing I can not stress enough is the fact that this is NOT easy. You come to learn very quickly that everything comes with a price, which is why I wanted to make a post about the uglier side of sugar dating because I find it’s not really talked about. Here are some of the things that many SBs experience. Obviously it’s very dependent on what type of SD you have but here are some common ones I’ve seen women struggle with. \n\n1. You’ll get a lot of very judgmental looks while out in public with your SD. Looks of disgust or pity and it’s something you’ll have to get used to. \n\n2. Depending on how long you do it; you’ll most likely lose friends and family. At the very least it will change the way they see you. \n\n3. There will most likely come a time where you meet someone that you genuinely want a relationship with and you might need to walk away from it because of the lifestyle. \n\n4. You’ll meet men that use financial support to manipulate you. You’ll need to have strong boundaries and a savings account or your mental health will take a hit. \n\n5. If you’re doing this because you’re desperate for financial support, you’ll find yourself laying on a hotel bed with a man you’re disgusted with, staring at the ceiling and waiting for it to be over so you can take a hot shower. (Trust me you don’t want to get here) \n\n6. Using things to cope with the lifestyle. I’ve seen this a lot and it’s a very dangerous habit. It’s not uncommon for girls to develop addictions while doing this. \n\n7. Not being honest with yourself. I’ve seen many friends of mine try to talk themselves into having a better outlook on their sugar relationships. Be honest with yourself, if you’re unhappy take care of your mental health. Don’t try to convince yourself that you’re enjoying anything just to make it a little easier. \n\n\nIf you find the right SD it can be amazing but it takes time. Don’t rush anything out of desperation. Take care of yourself girls, nothing is worth damaging your mental health over. <3",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/sebwa7/the_potential_ugly_side_for_sbs/",
    "score": 442,
    "upvote_ratio": 0.97,
    "created_utc": 1643325936.0,
    "num_comments": 107,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Thanks for posting this! I’ve been so so so discouraged, I’m about ready to just call it quits. I had two successful SD relationships a few years ago, took a break for mental health reasons and decided to try it again as of a few months ago. \n\nI met a guy who took me for a nice dinner and was a really great person, a lot of fun to talk to. I got excited! But he then informed me at the end of the night that he “thought this was just a dating site for rich guys” and wanted me to be attracted to him for him, not his money. He wanted a girlfriend to take home to the family, not an SB. That was disappointing. We’re actually platonic friends now so that’s kinda cool I guess.\n\nThen I met a guy who totally disregarded the safety boundaries I have which are non negotiable. My private info (address, real phone number, last name, social media) is private until I feel that I can trust someone. I don’t budge on that even outside the bowl. He was absolutely downright *nasty* about it. I went to sleep sobbing.\n\nThe last POT I met was one that I had gone on a date with before a couple years ago. He had been nice, but the arrangement he wanted wasn’t something I was looking for, so we just parted ways. Then a few months ago we got back in touch. And I was roofied and raped.\n\nI’m a gentle and kind person. I’m very easy to talk to. I’m intelligent and engaging. I dress fashionably. I’m a great communicator. I’m just not sure what I’m doing wrong. \n\nIs it my area, do you think? Or is the bowl more full of rotten people than it was two years ago?",
            "author": "grishaelle",
            "id": "huj9ct6",
            "parent_id": "t3_sebwa7",
            "score": 62,
            "created_utc": 1643340341.0,
            "replies": [
                {
                    "body": "You did nothing wrong. A rapist is gonna rape. An asshole is gonna be an asshole. Keep your guard up... don't let anyone kill your light. We live in a bad world.",
                    "author": "Brilliant_Ad2518",
                    "id": "hujc0xa",
                    "parent_id": "t1_huj9ct6",
                    "score": 66,
                    "created_utc": 1643341541.0,
                    "replies": [
                        {
                            "body": "Thanks for saying this 💕",
                            "author": "grishaelle",
                            "id": "hujc4zv",
                            "parent_id": "t1_hujc0xa",
                            "score": 10,
                            "created_utc": 1643341596.0,
                            "replies": []
                        },
                        {
                            "body": "Preach.",
                            "author": "music4galz",
                            "id": "huni4e2",
                            "parent_id": "t1_hujc0xa",
                            "score": 2,
                            "created_utc": 1643413475.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I’m sorry love. My heart goes out to you, you didn’t deserve that.",
                    "author": "bubblerush",
                    "id": "hujtp3p",
                    "parent_id": "t1_huj9ct6",
                    "score": 16,
                    "created_utc": 1643350827.0,
                    "replies": []
                },
                {
                    "body": "It’s just full of more rotten people as time goes on!",
                    "author": "iwishyouwo0d",
                    "id": "hujb7ph",
                    "parent_id": "t1_huj9ct6",
                    "score": 10,
                    "created_utc": 1643341171.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"If you’re doing this because you’re desperate for financial support, you’ll find yourself laying on a hotel bed with a man you’re disgusted with, staring at the ceiling and waiting for it to be over so you can take a hot shower. (Trust me you don’t want to get here)\"  \n\n\nThis should be a warning sticker affixed to SB credit cards. before you spend money on bullshit, remember how you earn it.   \nAnd when shopping online a large popup window should appear and read: \"are you SURE you want to find yourself laying on a hotel bed with a man you’re disgusted with in exchange for this bullshit item?\"",
            "author": "JeaneyBowl",
            "id": "humafa3",
            "parent_id": "t3_sebwa7",
            "score": 42,
            "created_utc": 1643396347.0,
            "replies": [
                {
                    "body": "This has happened to me in the past: yes. 100%",
                    "author": null,
                    "id": "hvat0wg",
                    "parent_id": "t1_humafa3",
                    "score": 1,
                    "created_utc": 1643822330.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good advice. #4 is very true, I had a M&G and 2 dinners then intimate dates with an SD and thought it was going well. On the 2nd date, right after he finished and we were talking, he told me \"You're too intellectual, you need to turn that off when you're with me.\" The tone and overall delivery was so nasty. I was shocked and hurt and went quiet. Luckily I was able to leave shortly after, and once I got home I texted him that I was ending the arrangement. \n\nI can pay my own bills and started this just for the fun of it. I will not be demeaned or basically told to shut up.",
            "author": "TasteofChocolate69",
            "id": "hul70ie",
            "parent_id": "t3_sebwa7",
            "score": 30,
            "created_utc": 1643381631.0,
            "replies": [
                {
                    "body": "Lmao dude was like \"I'm paying you to pretend that I'm smarter than you\" n o p e",
                    "author": null,
                    "id": "hurbhw9",
                    "parent_id": "t1_hul70ie",
                    "score": 10,
                    "created_utc": 1643486018.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm long out of the bowl (39) but I remember the exact moment that I realized I was done with it. \n\nIt had been fun for a few years. It took one SD that RUIN it. \n\nMind you. I was actually a professional woman. I had a good job. My own home. I didn't need to do this. I did it for purely selfish and materialistic reasons. I had a flexible schedule so it made it easy to meet my SDs. I did it purely for the thrill and the pretty things I could get that I wouldn't otherwise be able to afford. Shoot me. \n\nHe was married. Wife worked outside the home doing charity. He was semi retired. Gorgeous house. A garden I could sit nude in because the neighbors couldn't see. For the first 6 months is was WONDERFUL. Our arrangement was pay for play (I met with him 3 days per week)  but he also took me on dates, nice restaurants, theater, movies, to the zoo. He also bought me presents all the time. New purse? Done. Need new tires for my car. No problem. Random trinket at the mall? Hed hand me his wallet. \n\nThat was until his wife decided to step down from the charity. No problem. We started meeting at hotels. \n\nThen the problem started. He decided that buying a nice hotels was a \"waste of money\" for a couple of hours of play time so he started getting cheap rooms. Then it turned to roach motels.\n\nThen he decided he only wanted to pay me when played and the dates and fun things went away. So did my presents. \n\nI finally cut him off the third time he drove me around for an hour looking for a place to play in the backseat of his SUV and he tossed cash and a pack of baby wipes at me like a hooker. (No shade to hookers but that is NOT how a SD arrangement is supposed to work)\n\nForget that. I didn't need his money. He was actually fun until that point. I think he just got too comfortable and thought that I was desperate. I wasn't. I didn't need a 68 year old fat dude with a micropenis to pay my bills. \n\nI don't regret my time in the sugar bowl. I met some REALLY amazing men. One was the VP of Communications good sized company. He was from Australia and traveled about 250 days of the year and didn't even want sex (though that did happen) he wanted someone with half a brain cell (I have an Aeronautics degree) to talk with, someone to come to dinner with, someone to come to corporate functions with that knew how to dress and talk the part. He treated me like a princess. He gave me a debit card that he loaded every month and it was GENEROUS. \n\nThere was another man, awkward,shy, balding, that NEVER asked me for sex. Just to come with him to work events...he would buy me REALLY beautiful outfits, suits for work, and paid for my cat to have surgery. In addition to a monthly allowance. \n\nBabies, if it isn't fun, then its not worth it. Don't ever get into a situation when you HAVE to do this. You can tend bar and flirt your way to big   tips. (I've done it) Don't settle for the back seat and it  thrown at you. \n\nGood luck!",
            "author": "Glass_Status_5837",
            "id": "huikygh",
            "parent_id": "t3_sebwa7",
            "score": 189,
            "created_utc": 1643329861.0,
            "replies": [
                {
                    "body": "I’m so longer looking for a SD relationship, but wow this was really insightful. Thank you. Your good experiences are the way it should be. So many of these men are just looking for hookers.",
                    "author": "elizabath_135",
                    "id": "hujv08o",
                    "parent_id": "t1_huikygh",
                    "score": 18,
                    "created_utc": 1643351636.0,
                    "replies": []
                },
                {
                    "body": "Thank you so much for sharing. This is so so important for new SBs to hear.",
                    "author": "bubblerush",
                    "id": "huint1c",
                    "parent_id": "t1_huikygh",
                    "score": 24,
                    "created_utc": 1643331047.0,
                    "replies": [
                        {
                            "body": "You're welcome, dear! Like I said, I am long out of the bowl. It was fun while it lasted, though!",
                            "author": "Glass_Status_5837",
                            "id": "huj9hqz",
                            "parent_id": "t1_huint1c",
                            "score": 9,
                            "created_utc": 1643340401.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Part of my conversation with any new POT is that I will not promise something that is cannot 100% deliver 100% of the time.  I won’t start out at the Ritz and end up banging in my car.   I offer a fair, slightly above average ppm for my market plus gifts and extras.  I can always do more but I can’t do less and I hate disappointing people or leaving them hanging.  I’m putting a down payment on a boob job tomorrow morning for my main SB.  I feel terrible for girls that fall for the bait and switch.",
                    "author": "LotBuilder",
                    "id": "huiyots",
                    "parent_id": "t1_huikygh",
                    "score": 44,
                    "created_utc": 1643335677.0,
                    "replies": [
                        {
                            "body": "No SB should agree to play on the first meet. Ever. You need to work out each other's personalities and agree on terms and boundaries. I had some that tried. REALLY tried. Offered to give me money right there. \n\nTerms first, THEN fun.",
                            "author": "Glass_Status_5837",
                            "id": "huj9uyu",
                            "parent_id": "t1_huiyots",
                            "score": 24,
                            "created_utc": 1643340564.0,
                            "replies": [
                                {
                                    "body": "When I (50 at the time) was a SR noob, while chatting with the woman (23) that turned out to be my 1st LTSR, we were both looking at Google, trying to find a mutually convenient place to have a M&G. I was to be her 4th SD. She interjected, \"Or we could just meet at a hotel and hang out. I've done that with my previous SDs.\" So we did.. We chatted clothed, w/o touching for 30-45 min introducing ourselves. We then were intimate. We had a good time for a year, meeting weekly. \n\nI've also chatted with several women from SA who refused to do even a paid M&G, but wanted to begin with an intimate 1st meeting for a full ppm. I would understand if you wanted to call them prostitutes and not SBs. I had a post a while ago asking about both SDs & SBs from SA meeting for intimate 1st dates, where both parties were upfront about this being a 1 and done intimate encounter. Both men & women admitted to knowingly participating.",
                                    "author": "docrolling",
                                    "id": "hukcx0s",
                                    "parent_id": "t1_huj9uyu",
                                    "score": 7,
                                    "created_utc": 1643364682.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Ugh you sound amazing. I wish there were more men like you on SA…. I look online for a few mins and log off. Thank god atp it’s not desperation purposes where I feel like there are those who sniff it out and take advantage of… so I hope I’ll find someone like you where there is mutual respect, and ofc benefits.",
                            "author": null,
                            "id": "hvawx3y",
                            "parent_id": "t1_huiyots",
                            "score": 1,
                            "created_utc": 1643823742.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Aeronautics degree? Hot nerd girls are such a rare treat",
                    "author": "StunnedSilencer",
                    "id": "huj8e0c",
                    "parent_id": "t1_huikygh",
                    "score": 13,
                    "created_utc": 1643339917.0,
                    "replies": [
                        {
                            "body": "Lol. I am neither hot anymore, nor young. And I'm engaged. You deserve a lot more for your money, dear. But I appreciate it. :)",
                            "author": "Glass_Status_5837",
                            "id": "huj8kod",
                            "parent_id": "t1_huj8e0c",
                            "score": 11,
                            "created_utc": 1643340000.0,
                            "replies": [
                                {
                                    "body": "Congratulate! And, trust me, you're younger and hotter than I am or will ever be! Probably smarter too. I can fly one but I've no idea how to build one (or what keeps them up in the air)",
                                    "author": "StunnedSilencer",
                                    "id": "huj9rfr",
                                    "parent_id": "t1_huj8kod",
                                    "score": 5,
                                    "created_utc": 1643340520.0,
                                    "replies": [
                                        {
                                            "body": "Lol. Thank you. I can fly them. Not build them. But I know how to keep them in the air and not crash into anything. I worked as a flight dispatcher before the 'rona took the industry down. I was able to regroup pretty quickly though. My data processing skills turned out to be a pretty good fit for a pharmaceutical development company in the patient assistance program. I get paid to sweet talk health insurance companies all day. \n\nNot much different than sweet talking air traffic control.",
                                            "author": "Glass_Status_5837",
                                            "id": "hujaw56",
                                            "parent_id": "t1_huj9rfr",
                                            "score": 10,
                                            "created_utc": 1643341026.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Does your fiance know about you being an SB? always curious about that",
                                    "author": "Hungboy6969420",
                                    "id": "huvil1n",
                                    "parent_id": "t1_huj8kod",
                                    "score": 1,
                                    "created_utc": 1643563481.0,
                                    "replies": [
                                        {
                                            "body": "He knows it was part of my past, yes.",
                                            "author": "Glass_Status_5837",
                                            "id": "huviryy",
                                            "parent_id": "t1_huvil1n",
                                            "score": 5,
                                            "created_utc": 1643563553.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Wow, I can’t believe that took such a sharp turn. I really don’t understand how some people can put up such a good front for so long",
                    "author": null,
                    "id": "hujihob",
                    "parent_id": "t1_huikygh",
                    "score": 2,
                    "created_utc": 1643344641.0,
                    "replies": [
                        {
                            "body": "It did. Took about 3 weeks. I wasn't stupid.",
                            "author": "Glass_Status_5837",
                            "id": "hujiv6z",
                            "parent_id": "t1_hujihob",
                            "score": 1,
                            "created_utc": 1643344830.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "huikyk0",
                    "parent_id": "t1_huikygh",
                    "score": -4,
                    "created_utc": 1643329862.0,
                    "replies": [
                        {
                            "body": "Fixed it. I was referring to what some sex workers charge for backseat sex.",
                            "author": "Glass_Status_5837",
                            "id": "huilws0",
                            "parent_id": "t1_huikyk0",
                            "score": 7,
                            "created_utc": 1643330259.0,
                            "replies": [
                                {
                                    "body": "Happy cake day! Good thing you fixed your post, you almost got serrrvvvvveddd! Like serving cake, 'cause it's your cake day. You get it.",
                                    "author": "music4galz",
                                    "id": "hunjl8i",
                                    "parent_id": "t1_huilws0",
                                    "score": 1,
                                    "created_utc": 1643414107.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm sure there are a lot of girls laying on a cheesy mattress in a fleabag motel praying the guy will cum quickly. In polls 50+ % of SBs are not attracted to their SDs(and see them for money). \n\nThat is the seamier side of sugar life.",
            "author": "GSSD",
            "id": "hukw4ef",
            "parent_id": "t3_sebwa7",
            "score": 22,
            "created_utc": 1643376844.0,
            "replies": [
                {
                    "body": "Not surprised although it's interesting to see so many SA profiles where the SB highlights that she should be attracted to you",
                    "author": "Hungboy6969420",
                    "id": "huvirhc",
                    "parent_id": "t1_hukw4ef",
                    "score": 3,
                    "created_utc": 1643563548.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was just feeling this and feeling like I need more sugar baby friends because I find myself not wanting to hang with certain friends anymore because I can’t share things with them / feel like they’d judge me.",
            "author": "Anastasiaxoxox",
            "id": "hujbf8a",
            "parent_id": "t3_sebwa7",
            "score": 16,
            "created_utc": 1643341267.0,
            "replies": []
        },
        {
            "body": "Looks of pity I could always handle, I get stared at or grimaced at or leered at for anything frankly, (and frankly, i found it funny that they judged me and not the older men ever,) but it was definitely 4 and 5 that got me out the bowl. Too many pricks with money thinking that dangling money over my head would be oh so attractive, as if even on my brokest day back then I wouldn't sacrifice a night of fancy tiny portioned dinners and really bad sex and cringey ass conversation for a can of chili from the back of the cupboards and my own hand paired with Netflix and some cocoa.\n\nTo any girl or whatever gender who's got a bad sugar daddy or is trading their sanity or self respect or body or time for someone disrespectful and gross: leave. Or at least, set boundaries, leave if giving sex offender or traumatizer vibes, and save your cash sooo much.\n\nTake it from me, sure I got money that kept me afloat during hard times but I also needed a year to process my trauma from it.",
            "author": "sbgonebroke",
            "id": "hujsid2",
            "parent_id": "t3_sebwa7",
            "score": 25,
            "created_utc": 1643350095.0,
            "replies": [
                {
                    "body": "> i found it funny that they judged me and not the older men ever,\n\nI think that's only your perception, they judge you but they also chuckle and gossip behind the older man's back.",
                    "author": "A-touchofreality",
                    "id": "huk3fse",
                    "parent_id": "t1_hujsid2",
                    "score": 7,
                    "created_utc": 1643357323.0,
                    "replies": [
                        {
                            "body": "Fair enough! I've had multiple occasions of ladies straight up going out of their way to ignore their own Valentines Day date to gawk with their mouth open and unbreaking eye contact at me from the next table and reaaaaaally annoyed me. Good to know the dude is also being roasted as well.\n\nIt's so weird when they do that. Like geez lady, can't only ONE of us lack shame in public, please?/j",
                            "author": "sbgonebroke",
                            "id": "hun76in",
                            "parent_id": "t1_huk3fse",
                            "score": 2,
                            "created_utc": 1643408963.0,
                            "replies": [
                                {
                                    "body": "Yes, that's absolutely weird, I agree.\n\nBut it's a fact that unmatched couples attract attention, like most things out of the ordinary. And maybe some of the older women who stare might have daughters your age and it comes too close?",
                                    "author": "A-touchofreality",
                                    "id": "hun8to2",
                                    "parent_id": "t1_hun76in",
                                    "score": 2,
                                    "created_utc": 1643409632.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s really really good advice for newbies.  Girls need to be reading this and not the tik tok video which promote sugaring.",
            "author": "wb19081908",
            "id": "huii3n0",
            "parent_id": "t3_sebwa7",
            "score": 31,
            "created_utc": 1643328672.0,
            "replies": []
        },
        {
            "body": "For all the new SB out there: there moral of this story is: don’t sugar date out of desperation for money or you will quickly learn that there is a slippery slope of going from being a SB to becoming an escort and you’ll end up seeing the dark side of what sex work can do to a woman who is only there out of despair.",
            "author": "WineDineN69me",
            "id": "hukjk21",
            "parent_id": "t3_sebwa7",
            "score": 17,
            "created_utc": 1643369593.0,
            "replies": [
                {
                    "body": "Take my upvote and award.  I hesitated posting the same thing- because I felt if it came from an SD - it would downvoted.  But this is EXACTLY what happens.\n\nIf you want to go down that path (becoming an escort) there are SAFER ways to do it - then being a pseudo SB on SA.",
                    "author": "SDstartingOut",
                    "id": "hum5tur",
                    "parent_id": "t1_hukjk21",
                    "score": 5,
                    "created_utc": 1643394637.0,
                    "replies": [
                        {
                            "body": "If you want to go down that path (becoming an escort) there are SAFER ways to do it - then being a pseudo SB on SA.\n\n^^This 👍",
                            "author": "sweetlady247",
                            "id": "humj0k8",
                            "parent_id": "t1_hum5tur",
                            "score": 2,
                            "created_utc": 1643399576.0,
                            "replies": []
                        },
                        {
                            "body": "thanks! Unfortunately many women have no understanding of what a real sugar relationship is and when they join SA they assume all men are SD. \n\nJust look how many SB come on here confused when they get hit up by Johns and they have no idea those men are not real SD.\n\nMany women in my age bracket and younger grew up with apps like Tinder, so hookup culture is very prevalent so a lot of women end up acting the same way on SA and basically end up being low volume escorts whether they realize it or not. Things only get worse for them if they’re financially desperate and make poor decisions.\n\nIf a woman wants to be an escort there is no shame in that, but she shouldn’t do it out of desperation nor should she do it on Seeking.",
                            "author": "WineDineN69me",
                            "id": "humsvub",
                            "parent_id": "t1_hum5tur",
                            "score": 2,
                            "created_utc": 1643403348.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Needed to read this. Thank you! ❤️",
            "author": "cdnpeach",
            "id": "huim0mm",
            "parent_id": "t3_sebwa7",
            "score": 7,
            "created_utc": 1643330303.0,
            "replies": []
        },
        {
            "body": "Thanks for your honesty in posting this.",
            "author": "LuckyINTJ",
            "id": "huifw01",
            "parent_id": "t3_sebwa7",
            "score": 13,
            "created_utc": 1643327739.0,
            "replies": []
        },
        {
            "body": "I’m in big city  and I don’t think I have ever had an issue with “looks of disgust or pity” 🤷‍♀️ Age gap/ sugar dating is a lot more mainstream now IMO, but maybe more judgement in smaller towns. I also have been in this life , working in clubs and stuff for almost 8 years now and my family has never found out. \nI agree with most everything you said otherwise though. I think my biggest piece of advice for aspiring SB is make sure you have one friend who you always share your location with & if you have any childhood trauma or issues , make sure your mental health is in check before you start this wild ride.",
            "author": "TranslatorNo2049",
            "id": "huinzd5",
            "parent_id": "t3_sebwa7",
            "score": 21,
            "created_utc": 1643331120.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "humnsn0",
            "parent_id": "t3_sebwa7",
            "score": 9,
            "created_utc": 1643401397.0,
            "replies": [
                {
                    "body": "THIS right here. 100%",
                    "author": "bubblerush",
                    "id": "humoom8",
                    "parent_id": "t1_humnsn0",
                    "score": 3,
                    "created_utc": 1643401733.0,
                    "replies": []
                },
                {
                    "body": "What about all the escorts on sa when the site specifically says no escorts.  It makes the site such a chore having to weed out these profiles",
                    "author": "wb19081908",
                    "id": "huzfbok",
                    "parent_id": "t1_humnsn0",
                    "score": 2,
                    "created_utc": 1643630641.0,
                    "replies": [
                        {
                            "body": "Lol, yes a seasoned professional wouldn't go for whatever it is I imagine you're offering, or your dates would be 30 minutes to an hour.  Do you ever feel guilty for tricking civilians into such laborious work for such low pay?",
                            "author": "Zealousideal-Emu-863",
                            "id": "hv61v1q",
                            "parent_id": "t1_huzfbok",
                            "score": 2,
                            "created_utc": 1643741314.0,
                            "replies": [
                                {
                                    "body": "My ppm was more than I paid for escorts so I don’t know what you mean ?  My preference with an escorts of course was for very short booking\n\nPlus I’m not really into seasoned professionals tbh",
                                    "author": "wb19081908",
                                    "id": "hv6oeo0",
                                    "parent_id": "t1_hv61v1q",
                                    "score": 0,
                                    "created_utc": 1643749732.0,
                                    "replies": [
                                        {
                                            "body": "Excuse me if I’m wrong, but aren’t you the person who posts into hobbying forums boasting about SA and how they will go raw for the first time etc etc?",
                                            "author": null,
                                            "id": "hvaynhi",
                                            "parent_id": "t1_hv6oeo0",
                                            "score": 3,
                                            "created_utc": 1643824372.0,
                                            "replies": [
                                                {
                                                    "body": "Thanks for paying so much attention to my posts it’s flattering.",
                                                    "author": "wb19081908",
                                                    "id": "hvbyyf8",
                                                    "parent_id": "t1_hvaynhi",
                                                    "score": 0,
                                                    "created_utc": 1643837819.0,
                                                    "replies": [
                                                        {
                                                            "body": "I wish I didn’t have to 😂",
                                                            "author": null,
                                                            "id": "hvc09ez",
                                                            "parent_id": "t1_hvbyyf8",
                                                            "score": 2,
                                                            "created_utc": 1643838291.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You don’t have too at all.  There are like a million other things you could look at on reddit.  I’m sure if you look long enough you will find something that amuses you",
                                                                    "author": "wb19081908",
                                                                    "id": "hvc0nf6",
                                                                    "parent_id": "t1_hvc09ez",
                                                                    "score": 0,
                                                                    "created_utc": 1643838432.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Unfortunately people have mentioned you in several posts- so yes, I had to. Thank god I did, I will be on the lookout for men like you",
                                                                            "author": null,
                                                                            "id": "hvc156x",
                                                                            "parent_id": "t1_hvc0nf6",
                                                                            "score": 2,
                                                                            "created_utc": 1643838611.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Yeh I understand some of the long term sb who post on the sugar baby forum don’t like me.  I find it amusing.  I’ve never even spoken to any of them either.  Oh well\n\nYour last comment is weird.  I’m not looking for an sb and if I were it wouldn’t be on reddit.  I’m just here to kill time.",
                                                                                    "author": "wb19081908",
                                                                                    "id": "hvc1hgs",
                                                                                    "parent_id": "t1_hvc156x",
                                                                                    "score": 1,
                                                                                    "created_utc": 1643838735.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Yeah there’s probably reasons for that. Can’t say I have been in this forum too long, and definitely haven’t been a long term sb as of yet, but your posts in other forums are definitely eye opening. Your comments in the hobbying forum are weird. ✨",
                                                                                            "author": null,
                                                                                            "id": "hvc2gl0",
                                                                                            "parent_id": "t1_hvc1hgs",
                                                                                            "score": 3,
                                                                                            "created_utc": 1643839096.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Again thanks for the attention it’s flattering lol",
                                                                                                    "author": "wb19081908",
                                                                                                    "id": "hvc2oh3",
                                                                                                    "parent_id": "t1_hvc2gl0",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1643839177.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Great post! I can't agree with you more. It's definitely not a easy relationship to have and maintain. Finding the right one takes time and patience. Research is definitely something SBs need to do before pursing this lifestyle and make sure you have a backup plan. You never want to do this out of financial constraints because you will get taken advantage of . You must be mentally prepared to deal with this relationship. \n\nThere are many wonderful things that can happen while your having a SR but don't let that fool you because there is a dark side to this. \n\nLastly,  don't turn this into a career make sure you use this lifestyle to help you elevate yourself and put you in a better standing in society.  Take the money and connections to create something long-term for yourself. Don't blow the money on unnecessary material things.. Your SD should be able to provide you with gifts here and there that may quench that there should have to buy luxury items. Don't waste the money because that's money you can't get back remember that.",
            "author": "marirenz",
            "id": "hxvc94o",
            "parent_id": "t3_sebwa7",
            "score": 4,
            "created_utc": 1645472541.0,
            "replies": []
        },
        {
            "body": "> There will most likely come a time where you meet someone that you genuinely want a relationship with and you might need to walk away from it because of the lifestyle.\n\nMaybe because I'm in NYC and LA it's a little different. I'm polyamorous (not promiscuous) and every SB of mine has had a significant other.\n\nOne of my current SBs of 8 months is married & her wife sees it as a great way to get the house to herself & help with the bills.\n\nJust saying, it's not all doom & gloom. SRs shouldn't feel like a chore if you're doing it right.",
            "author": "notnoteworthyatall",
            "id": "huifca6",
            "parent_id": "t3_sebwa7",
            "score": 19,
            "created_utc": 1643327510.0,
            "replies": [
                {
                    "body": "These are just things I’ve seen happen. The potential bad side isn’t talked about enough and these are things I think new SBs should know to be cautious with.",
                    "author": "bubblerush",
                    "id": "huiftk2",
                    "parent_id": "t1_huifca6",
                    "score": 17,
                    "created_utc": 1643327710.0,
                    "replies": []
                },
                {
                    "body": "Do you find it difficult to find folks that are ok with polyamorous SB or that find polyamory understandable?",
                    "author": "theladysupernova",
                    "id": "huldlg8",
                    "parent_id": "t1_huifca6",
                    "score": 1,
                    "created_utc": 1643384198.0,
                    "replies": [
                        {
                            "body": "I put it clearly in my profile and am able to speak to my reasoning for being polyamorous. This attracts other open & poly people.\n\nI always ask if someone read my profile & then remember to bring it up before we video or M&G so I don't waste our time.\n\nI imagine being a polyamorous SB you don't necessarily need to disclose. Most of these guys are married - why can't you have a boyfriend?",
                            "author": "notnoteworthyatall",
                            "id": "hv6086s",
                            "parent_id": "t1_huldlg8",
                            "score": 3,
                            "created_utc": 1643740711.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes. Job 1 for a SB (and I help my SB's do this), is to be financially not dependent on sugar. Have side hustles and/or grow your own business. Then, just save/invest your sugar. It's obviously much better for your mental health, to have a balance of power in your SR. Needing sugar to pay rent is a very dangerous/desperate imbalance of power.\n\nMore broadly speaking, it's Life Skills 101: Always err on the side of caution, and save way more than you think you need to, while you're in your 20s and 30s.\n\nAs to the judgmental looks in public? .... both me and my SB's actually love that part of it. One of my SB's loves pissing off the middle aged women who look at her in disgust.",
            "author": "Nomad_Bill",
            "id": "huijt99",
            "parent_id": "t3_sebwa7",
            "score": 11,
            "created_utc": 1643329385.0,
            "replies": []
        },
        {
            "body": "Thank you for this",
            "author": "Ketamine-pigeon",
            "id": "hujd6do",
            "parent_id": "t3_sebwa7",
            "score": 3,
            "created_utc": 1643342071.0,
            "replies": []
        },
        {
            "body": "I care absolutely nothing about the looks of disdain lol we usually turn heads when we’re out, even if the difference in ages weren’t obvious I dress like I’m in an anime ALL the time. Thigh his, cat ears, etc. He says the guys gawk at me(which I do enjoy hearing anyway😂) and some of the ladies look at me weird or in an upset or disapproving way while others just smile. Either way it never bothers me much.\nGiven my anxiety I very rarely make eye contact with other people anyway unless it’s him or my friends and family.",
            "author": "AnitaShott",
            "id": "hukbinf",
            "parent_id": "t3_sebwa7",
            "score": 3,
            "created_utc": 1643363558.0,
            "replies": []
        },
        {
            "body": "What can a guy do to make it easier?   Coach us to make this more pleasant for you",
            "author": "DrZenRoot",
            "id": "huip4wc",
            "parent_id": "t3_sebwa7",
            "score": 10,
            "created_utc": 1643331603.0,
            "replies": []
        },
        {
            "body": "Good post and honest. Sadly 5 is the reality for most SBs.",
            "author": null,
            "id": "hujx6ue",
            "parent_id": "t3_sebwa7",
            "score": 2,
            "created_utc": 1643353030.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hul30ct",
            "parent_id": "t3_sebwa7",
            "score": 2,
            "created_utc": 1643379964.0,
            "replies": [
                {
                    "body": "If you’re at the point where you forcing yourself to go through the motions with your SD then you won’t just be ending it for some boy. You’ll be ending it for yourself as well.",
                    "author": "bubblerush",
                    "id": "hulykel",
                    "parent_id": "t1_hul30ct",
                    "score": 7,
                    "created_utc": 1643391951.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I must got very thick skin because 3. has never happened to me",
            "author": "ElaineDoll",
            "id": "hujczzj",
            "parent_id": "t3_sebwa7",
            "score": 2,
            "created_utc": 1643341988.0,
            "replies": []
        },
        {
            "body": "> Looks of ... pity\n\nReally?",
            "author": "Y_4Z44",
            "id": "huiee39",
            "parent_id": "t3_sebwa7",
            "score": 1,
            "created_utc": 1643327116.0,
            "replies": [
                {
                    "body": "Yup!",
                    "author": "bubblerush",
                    "id": "huieygz",
                    "parent_id": "t1_huiee39",
                    "score": 20,
                    "created_utc": 1643327352.0,
                    "replies": [
                        {
                            "body": "I’m not an SB but I’m 29 and my boyfriend is 58. Nobody looks at us with pity. If anything they look at us with envy.",
                            "author": "supermarket_Ba",
                            "id": "huinxhr",
                            "parent_id": "t1_huieygz",
                            "score": 0,
                            "created_utc": 1643331098.0,
                            "replies": [
                                {
                                    "body": "keep telling yourself that",
                                    "author": null,
                                    "id": "hum1lmy",
                                    "parent_id": "t1_huinxhr",
                                    "score": 8,
                                    "created_utc": 1643393063.0,
                                    "replies": [
                                        {
                                            "body": "Lol I will",
                                            "author": "supermarket_Ba",
                                            "id": "hum2c3v",
                                            "parent_id": "t1_hum1lmy",
                                            "score": -1,
                                            "created_utc": 1643393337.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "yeah, sure they do LOL",
                                    "author": "Clektr",
                                    "id": "huiozdv",
                                    "parent_id": "t1_huinxhr",
                                    "score": 29,
                                    "created_utc": 1643331538.0,
                                    "replies": [
                                        {
                                            "body": "Sorry nobody looks at you that way. My boyfriend is extremely attractive and so am I.",
                                            "author": "supermarket_Ba",
                                            "id": "huip4tj",
                                            "parent_id": "t1_huiozdv",
                                            "score": -11,
                                            "created_utc": 1643331602.0,
                                            "replies": [
                                                {
                                                    "body": "I’m very happy for y’all",
                                                    "author": "Clektr",
                                                    "id": "huirt02",
                                                    "parent_id": "t1_huip4tj",
                                                    "score": 9,
                                                    "created_utc": 1643332734.0,
                                                    "replies": [
                                                        {
                                                            "body": "I’m dying at these comments lol",
                                                            "author": "chinaacatt",
                                                            "id": "hujc660",
                                                            "parent_id": "t1_huirt02",
                                                            "score": 14,
                                                            "created_utc": 1643341611.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Thanks!",
                                                            "author": "supermarket_Ba",
                                                            "id": "huisdr6",
                                                            "parent_id": "t1_huirt02",
                                                            "score": 1,
                                                            "created_utc": 1643332981.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "We are the same ages, and I also find absolutely no one looks at us with pity or ever anger.   But, many people smile and probably wish they were in our shoes.",
                                    "author": "HappyBear1952",
                                    "id": "hujklft",
                                    "parent_id": "t1_huinxhr",
                                    "score": -3,
                                    "created_utc": 1643345700.0,
                                    "replies": []
                                },
                                {
                                    "body": "when me (55 at time) and my SGF (29 at the time) would be out, so many people would stop us and say what a great couple we made, and we must be in love based on how we looked at each other and interacted. it was a little disconcerting since we both had reasons for wanting to be somewhat discreet, but also very flattering at the same time.",
                                    "author": "joc13",
                                    "id": "hulfkmz",
                                    "parent_id": "t1_huinxhr",
                                    "score": -2,
                                    "created_utc": 1643384941.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Who is pitying you? And why are you hanging out with anyone so horrible that you need to be pitied…?",
                            "author": "WineDineN69me",
                            "id": "huilnxv",
                            "parent_id": "t1_huieygz",
                            "score": -6,
                            "created_utc": 1643330157.0,
                            "replies": [
                                {
                                    "body": "cause no other guys would agree to date her?  or, she needed the money that bad?\n\nI remember seeing what I was certain had to be a sugar date, and the young lady looked miserable. I did pity her in a sense, and wondered if there was anything I could do to \"rescue\" her. but, then, I was like \"she chose to be in this situation for whatever reason, so it's her problem to deal with\"",
                                    "author": "joc13",
                                    "id": "hulezbz",
                                    "parent_id": "t1_huilnxv",
                                    "score": 0,
                                    "created_utc": 1643384721.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes, pity.\n\nI know it is more alluring to delude yourself by thinking 'sugar outsiders' stares come from jealousy, but it is often pity.\n\nPity for the young girl to 'have to sell herself', pity for the old man to 'pay for company/sex'",
                    "author": "A-touchofreality",
                    "id": "huihwhc",
                    "parent_id": "t1_huiee39",
                    "score": 38,
                    "created_utc": 1643328587.0,
                    "replies": [
                        {
                            "body": "Exactly. I see so many posts talking about how people are throwing looks of jealousy especially older women towards the way of sugar couples. I’m not saying you should put much stock in these stares, but let’s not kid ourself either.",
                            "author": "GoodyGoobert",
                            "id": "huiwlto",
                            "parent_id": "t1_huihwhc",
                            "score": 27,
                            "created_utc": 1643334778.0,
                            "replies": []
                        },
                        {
                            "body": "> I know it is more alluring to allude yourself \n\nDelude*",
                            "author": "Y_4Z44",
                            "id": "huiierv",
                            "parent_id": "t1_huihwhc",
                            "score": 0,
                            "created_utc": 1643328802.0,
                            "replies": [
                                {
                                    "body": "Haha, sorry typo!",
                                    "author": "A-touchofreality",
                                    "id": "huk324p",
                                    "parent_id": "t1_huiierv",
                                    "score": 4,
                                    "created_utc": 1643357053.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah lol. I was once out with an ex SD (early 60s) at a really fancy place and the lady (mid 40s) next to me whispered not so quietly to her husband (50s) “I would fucking kill myself” talking about me. So embarrassing.",
                    "author": null,
                    "id": "huig2sb",
                    "parent_id": "t1_huiee39",
                    "score": 19,
                    "created_utc": 1643327819.0,
                    "replies": [
                        {
                            "body": "Sounds like a typical Karen 😉",
                            "author": "WineDineN69me",
                            "id": "huipdt3",
                            "parent_id": "t1_huig2sb",
                            "score": 5,
                            "created_utc": 1643331706.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "huje617",
            "parent_id": "t3_sebwa7",
            "score": 1,
            "created_utc": 1643342535.0,
            "replies": [
                {
                    "body": "Very few women will be honest with a sugar daddy about their experience",
                    "author": "bubblerush",
                    "id": "huju1yo",
                    "parent_id": "t1_huje617",
                    "score": 13,
                    "created_utc": 1643351046.0,
                    "replies": [
                        {
                            "body": "Denggggg!!!!",
                            "author": "A-touchofreality",
                            "id": "huk3j5b",
                            "parent_id": "t1_huju1yo",
                            "score": 7,
                            "created_utc": 1643357393.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Why is every SB who is honest saying something about her sugaring experience (and no that's not always what SDs would like to hear) immediately 'escort shamed'?",
                    "author": "A-touchofreality",
                    "id": "huk3o5t",
                    "parent_id": "t1_huje617",
                    "score": 8,
                    "created_utc": 1643357494.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m sure many of the things you say can happen to some but are far from inevitable.  \n\nI think most of the SBs I’ve had, simply don’t tell others they are sugaring which avoids all the judgement issues you’ve mentioned.    I’ve never had a SB develop a drug addiction and see no reason why SBs would be any more prone than anyone else.   My first serious SR ended because she decided she wanted to have a family.  Nothing committed her to staying a SB, which I think is the bottom line:   If sugaring is no longer right for you, then give it up.",
            "author": "63daddy",
            "id": "huigeph",
            "parent_id": "t3_sebwa7",
            "score": 1,
            "created_utc": 1643327960.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "huij57x",
            "parent_id": "t3_sebwa7",
            "score": 0,
            "created_utc": 1643329109.0,
            "replies": [
                {
                    "body": "“Burden on SDs too.” I think we should be focusing on the risks for young women with this post. I don’t think men that are 40+ years old need someone to advocate for them. This is an important message for girls, sometimes even teens that are getting into this. If a young woman is uncomfortable because she doesn’t want to be intimate with an older man that’s no “burden” on him.",
                    "author": "bubblerush",
                    "id": "huil63o",
                    "parent_id": "t1_huij57x",
                    "score": 11,
                    "created_utc": 1643329950.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Money makes it all go away!",
            "author": "Montypython2010",
            "id": "hukxk62",
            "parent_id": "t3_sebwa7",
            "score": 0,
            "created_utc": 1643377528.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "huivnrk",
            "parent_id": "t3_sebwa7",
            "score": 0,
            "created_utc": 1643334374.0,
            "replies": [
                {
                    "body": "Mostly in seeking.com but also in other platforms and in the wild too",
                    "author": "shamloo77",
                    "id": "hujkpsp",
                    "parent_id": "t1_huivnrk",
                    "score": 2,
                    "created_utc": 1643345765.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You lost me after the first 2 since neither of them ring true for me.",
            "author": "WestCoastCompanion",
            "id": "huja9qh",
            "parent_id": "t3_sebwa7",
            "score": -4,
            "created_utc": 1643340749.0,
            "replies": []
        },
        {
            "body": "this advice applies to ANY relationship, sugar or not. this could literally be applied to a woman in a marriage.",
            "author": "vtec__",
            "id": "hujevom",
            "parent_id": "t3_sebwa7",
            "score": -3,
            "created_utc": 1643342881.0,
            "replies": []
        },
        {
            "body": "Of course you’re going to run into issues when people here are mostly looking for “pay to play” relationships instead of true sugar relationships.",
            "author": "dtan777",
            "id": "hujl93q",
            "parent_id": "t3_sebwa7",
            "score": 0,
            "created_utc": 1643346045.0,
            "replies": []
        },
        {
            "body": "This is actually good advice for these chicks, except for the staring-at-the-ceiling bit. That's just par for the course. Hard to imagine being so naïve or entitled as think you could get \"sugar\" and also be attracted to the person at the same time. In that scenario what are you bringing to the table?",
            "author": "SouthernOhioRedsFan",
            "id": "hulwx9k",
            "parent_id": "t3_sebwa7",
            "score": -2,
            "created_utc": 1643391349.0,
            "replies": []
        },
        {
            "body": "I believe most of these issues are related to your financial position rather than sugar status.  If you have a good education or skills to support yourself without the need for income from sugaring, you are completely free to avoid or end any relationship that is problematic in these ways.   These issues are really dependent on yourself rather than a sugar partner.",
            "author": "HappyBear1952",
            "id": "hujlgak",
            "parent_id": "t3_sebwa7",
            "score": -6,
            "created_utc": 1643346150.0,
            "replies": [
                {
                    "body": "Why do you think they do it? Men being disrespectful to women is THEIR problem, action, and responsibility. It's not ok to take advantage of women who have not been as lucky as the men. It is not the young woman's fault, good grief.",
                    "author": "throwanon4",
                    "id": "hujtlsb",
                    "parent_id": "t1_hujlgak",
                    "score": 12,
                    "created_utc": 1643350770.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "huj7l0e",
            "parent_id": "t3_sebwa7",
            "score": 1,
            "created_utc": 1643339558.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "huj7l1m",
                    "parent_id": "t1_huj7l0e",
                    "score": 1,
                    "created_utc": 1643339559.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think the hard part (at least I have noticed) is finding a legitimate SD. Some men say they will pay you a small amount for sex, or you meet with a SD and you work out an agreement and you don’t see what was promised. I finally met a SD that was absolutely wonderful and we became fast friends but he also paid off my credit card debt and paid for me to get my hair done. We’re still friends but not in a SD/SB relationship anymore. I’ve tried looking for a new one as I need the money unfortunately but would like to become friends with the SD but finding a legitimate one has become impossible.",
            "author": "ApplePieAnonymous",
            "id": "hwlx02n",
            "parent_id": "t3_sebwa7",
            "score": 1,
            "created_utc": 1644643428.0,
            "replies": []
        },
        {
            "body": "Thank you so much, I've been thinking about it lately.",
            "author": "Littlevixen97",
            "id": "hxd2ny2",
            "parent_id": "t3_sebwa7",
            "score": 1,
            "created_utc": 1645133719.0,
            "replies": []
        },
        {
            "body": "I used to care about #1 when I was first starting and now who caresssss lol. Trust me you get over it",
            "author": "sienfiekdsa",
            "id": "hz01d6q",
            "parent_id": "t3_sebwa7",
            "score": 1,
            "created_utc": 1646190287.0,
            "replies": []
        },
        {
            "body": "Bruh I need some bread help me out",
            "author": "Miserable_inside999",
            "id": "hztxcmz",
            "parent_id": "t3_sebwa7",
            "score": 1,
            "created_utc": 1646743629.0,
            "replies": []
        },
        {
            "body": "You did nothing wrong. A rapist is gonna rape. An asshole is gonna be an asshole. Keep your guard up... don't let anyone kill your light. We live in a bad world.",
            "author": "Brilliant_Ad2518",
            "id": "hujc0xa",
            "parent_id": "t1_huj9ct6",
            "score": 66,
            "created_utc": 1643341541.0,
            "replies": [
                {
                    "body": "Thanks for saying this 💕",
                    "author": "grishaelle",
                    "id": "hujc4zv",
                    "parent_id": "t1_hujc0xa",
                    "score": 10,
                    "created_utc": 1643341596.0,
                    "replies": []
                },
                {
                    "body": "Preach.",
                    "author": "music4galz",
                    "id": "huni4e2",
                    "parent_id": "t1_hujc0xa",
                    "score": 2,
                    "created_utc": 1643413475.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m sorry love. My heart goes out to you, you didn’t deserve that.",
            "author": "bubblerush",
            "id": "hujtp3p",
            "parent_id": "t1_huj9ct6",
            "score": 16,
            "created_utc": 1643350827.0,
            "replies": []
        },
        {
            "body": "It’s just full of more rotten people as time goes on!",
            "author": "iwishyouwo0d",
            "id": "hujb7ph",
            "parent_id": "t1_huj9ct6",
            "score": 10,
            "created_utc": 1643341171.0,
            "replies": []
        },
        {
            "body": "This has happened to me in the past: yes. 100%",
            "author": null,
            "id": "hvat0wg",
            "parent_id": "t1_humafa3",
            "score": 1,
            "created_utc": 1643822330.0,
            "replies": []
        },
        {
            "body": "Lmao dude was like \"I'm paying you to pretend that I'm smarter than you\" n o p e",
            "author": null,
            "id": "hurbhw9",
            "parent_id": "t1_hul70ie",
            "score": 10,
            "created_utc": 1643486018.0,
            "replies": []
        },
        {
            "body": "I’m so longer looking for a SD relationship, but wow this was really insightful. Thank you. Your good experiences are the way it should be. So many of these men are just looking for hookers.",
            "author": "elizabath_135",
            "id": "hujv08o",
            "parent_id": "t1_huikygh",
            "score": 18,
            "created_utc": 1643351636.0,
            "replies": []
        },
        {
            "body": "Thank you so much for sharing. This is so so important for new SBs to hear.",
            "author": "bubblerush",
            "id": "huint1c",
            "parent_id": "t1_huikygh",
            "score": 24,
            "created_utc": 1643331047.0,
            "replies": [
                {
                    "body": "You're welcome, dear! Like I said, I am long out of the bowl. It was fun while it lasted, though!",
                    "author": "Glass_Status_5837",
                    "id": "huj9hqz",
                    "parent_id": "t1_huint1c",
                    "score": 9,
                    "created_utc": 1643340401.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Part of my conversation with any new POT is that I will not promise something that is cannot 100% deliver 100% of the time.  I won’t start out at the Ritz and end up banging in my car.   I offer a fair, slightly above average ppm for my market plus gifts and extras.  I can always do more but I can’t do less and I hate disappointing people or leaving them hanging.  I’m putting a down payment on a boob job tomorrow morning for my main SB.  I feel terrible for girls that fall for the bait and switch.",
            "author": "LotBuilder",
            "id": "huiyots",
            "parent_id": "t1_huikygh",
            "score": 44,
            "created_utc": 1643335677.0,
            "replies": [
                {
                    "body": "No SB should agree to play on the first meet. Ever. You need to work out each other's personalities and agree on terms and boundaries. I had some that tried. REALLY tried. Offered to give me money right there. \n\nTerms first, THEN fun.",
                    "author": "Glass_Status_5837",
                    "id": "huj9uyu",
                    "parent_id": "t1_huiyots",
                    "score": 24,
                    "created_utc": 1643340564.0,
                    "replies": [
                        {
                            "body": "When I (50 at the time) was a SR noob, while chatting with the woman (23) that turned out to be my 1st LTSR, we were both looking at Google, trying to find a mutually convenient place to have a M&G. I was to be her 4th SD. She interjected, \"Or we could just meet at a hotel and hang out. I've done that with my previous SDs.\" So we did.. We chatted clothed, w/o touching for 30-45 min introducing ourselves. We then were intimate. We had a good time for a year, meeting weekly. \n\nI've also chatted with several women from SA who refused to do even a paid M&G, but wanted to begin with an intimate 1st meeting for a full ppm. I would understand if you wanted to call them prostitutes and not SBs. I had a post a while ago asking about both SDs & SBs from SA meeting for intimate 1st dates, where both parties were upfront about this being a 1 and done intimate encounter. Both men & women admitted to knowingly participating.",
                            "author": "docrolling",
                            "id": "hukcx0s",
                            "parent_id": "t1_huj9uyu",
                            "score": 7,
                            "created_utc": 1643364682.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Ugh you sound amazing. I wish there were more men like you on SA…. I look online for a few mins and log off. Thank god atp it’s not desperation purposes where I feel like there are those who sniff it out and take advantage of… so I hope I’ll find someone like you where there is mutual respect, and ofc benefits.",
                    "author": null,
                    "id": "hvawx3y",
                    "parent_id": "t1_huiyots",
                    "score": 1,
                    "created_utc": 1643823742.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Aeronautics degree? Hot nerd girls are such a rare treat",
            "author": "StunnedSilencer",
            "id": "huj8e0c",
            "parent_id": "t1_huikygh",
            "score": 13,
            "created_utc": 1643339917.0,
            "replies": [
                {
                    "body": "Lol. I am neither hot anymore, nor young. And I'm engaged. You deserve a lot more for your money, dear. But I appreciate it. :)",
                    "author": "Glass_Status_5837",
                    "id": "huj8kod",
                    "parent_id": "t1_huj8e0c",
                    "score": 11,
                    "created_utc": 1643340000.0,
                    "replies": [
                        {
                            "body": "Congratulate! And, trust me, you're younger and hotter than I am or will ever be! Probably smarter too. I can fly one but I've no idea how to build one (or what keeps them up in the air)",
                            "author": "StunnedSilencer",
                            "id": "huj9rfr",
                            "parent_id": "t1_huj8kod",
                            "score": 5,
                            "created_utc": 1643340520.0,
                            "replies": [
                                {
                                    "body": "Lol. Thank you. I can fly them. Not build them. But I know how to keep them in the air and not crash into anything. I worked as a flight dispatcher before the 'rona took the industry down. I was able to regroup pretty quickly though. My data processing skills turned out to be a pretty good fit for a pharmaceutical development company in the patient assistance program. I get paid to sweet talk health insurance companies all day. \n\nNot much different than sweet talking air traffic control.",
                                    "author": "Glass_Status_5837",
                                    "id": "hujaw56",
                                    "parent_id": "t1_huj9rfr",
                                    "score": 10,
                                    "created_utc": 1643341026.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Does your fiance know about you being an SB? always curious about that",
                            "author": "Hungboy6969420",
                            "id": "huvil1n",
                            "parent_id": "t1_huj8kod",
                            "score": 1,
                            "created_utc": 1643563481.0,
                            "replies": [
                                {
                                    "body": "He knows it was part of my past, yes.",
                                    "author": "Glass_Status_5837",
                                    "id": "huviryy",
                                    "parent_id": "t1_huvil1n",
                                    "score": 5,
                                    "created_utc": 1643563553.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow, I can’t believe that took such a sharp turn. I really don’t understand how some people can put up such a good front for so long",
            "author": null,
            "id": "hujihob",
            "parent_id": "t1_huikygh",
            "score": 2,
            "created_utc": 1643344641.0,
            "replies": [
                {
                    "body": "It did. Took about 3 weeks. I wasn't stupid.",
                    "author": "Glass_Status_5837",
                    "id": "hujiv6z",
                    "parent_id": "t1_hujihob",
                    "score": 1,
                    "created_utc": 1643344830.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "huikyk0",
            "parent_id": "t1_huikygh",
            "score": -4,
            "created_utc": 1643329862.0,
            "replies": [
                {
                    "body": "Fixed it. I was referring to what some sex workers charge for backseat sex.",
                    "author": "Glass_Status_5837",
                    "id": "huilws0",
                    "parent_id": "t1_huikyk0",
                    "score": 7,
                    "created_utc": 1643330259.0,
                    "replies": [
                        {
                            "body": "Happy cake day! Good thing you fixed your post, you almost got serrrvvvvveddd! Like serving cake, 'cause it's your cake day. You get it.",
                            "author": "music4galz",
                            "id": "hunjl8i",
                            "parent_id": "t1_huilws0",
                            "score": 1,
                            "created_utc": 1643414107.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not surprised although it's interesting to see so many SA profiles where the SB highlights that she should be attracted to you",
            "author": "Hungboy6969420",
            "id": "huvirhc",
            "parent_id": "t1_hukw4ef",
            "score": 3,
            "created_utc": 1643563548.0,
            "replies": []
        },
        {
            "body": "> i found it funny that they judged me and not the older men ever,\n\nI think that's only your perception, they judge you but they also chuckle and gossip behind the older man's back.",
            "author": "A-touchofreality",
            "id": "huk3fse",
            "parent_id": "t1_hujsid2",
            "score": 7,
            "created_utc": 1643357323.0,
            "replies": [
                {
                    "body": "Fair enough! I've had multiple occasions of ladies straight up going out of their way to ignore their own Valentines Day date to gawk with their mouth open and unbreaking eye contact at me from the next table and reaaaaaally annoyed me. Good to know the dude is also being roasted as well.\n\nIt's so weird when they do that. Like geez lady, can't only ONE of us lack shame in public, please?/j",
                    "author": "sbgonebroke",
                    "id": "hun76in",
                    "parent_id": "t1_huk3fse",
                    "score": 2,
                    "created_utc": 1643408963.0,
                    "replies": [
                        {
                            "body": "Yes, that's absolutely weird, I agree.\n\nBut it's a fact that unmatched couples attract attention, like most things out of the ordinary. And maybe some of the older women who stare might have daughters your age and it comes too close?",
                            "author": "A-touchofreality",
                            "id": "hun8to2",
                            "parent_id": "t1_hun76in",
                            "score": 2,
                            "created_utc": 1643409632.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Take my upvote and award.  I hesitated posting the same thing- because I felt if it came from an SD - it would downvoted.  But this is EXACTLY what happens.\n\nIf you want to go down that path (becoming an escort) there are SAFER ways to do it - then being a pseudo SB on SA.",
            "author": "SDstartingOut",
            "id": "hum5tur",
            "parent_id": "t1_hukjk21",
            "score": 5,
            "created_utc": 1643394637.0,
            "replies": [
                {
                    "body": "If you want to go down that path (becoming an escort) there are SAFER ways to do it - then being a pseudo SB on SA.\n\n^^This 👍",
                    "author": "sweetlady247",
                    "id": "humj0k8",
                    "parent_id": "t1_hum5tur",
                    "score": 2,
                    "created_utc": 1643399576.0,
                    "replies": []
                },
                {
                    "body": "thanks! Unfortunately many women have no understanding of what a real sugar relationship is and when they join SA they assume all men are SD. \n\nJust look how many SB come on here confused when they get hit up by Johns and they have no idea those men are not real SD.\n\nMany women in my age bracket and younger grew up with apps like Tinder, so hookup culture is very prevalent so a lot of women end up acting the same way on SA and basically end up being low volume escorts whether they realize it or not. Things only get worse for them if they’re financially desperate and make poor decisions.\n\nIf a woman wants to be an escort there is no shame in that, but she shouldn’t do it out of desperation nor should she do it on Seeking.",
                    "author": "WineDineN69me",
                    "id": "humsvub",
                    "parent_id": "t1_hum5tur",
                    "score": 2,
                    "created_utc": 1643403348.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "THIS right here. 100%",
            "author": "bubblerush",
            "id": "humoom8",
            "parent_id": "t1_humnsn0",
            "score": 3,
            "created_utc": 1643401733.0,
            "replies": []
        },
        {
            "body": "What about all the escorts on sa when the site specifically says no escorts.  It makes the site such a chore having to weed out these profiles",
            "author": "wb19081908",
            "id": "huzfbok",
            "parent_id": "t1_humnsn0",
            "score": 2,
            "created_utc": 1643630641.0,
            "replies": [
                {
                    "body": "Lol, yes a seasoned professional wouldn't go for whatever it is I imagine you're offering, or your dates would be 30 minutes to an hour.  Do you ever feel guilty for tricking civilians into such laborious work for such low pay?",
                    "author": "Zealousideal-Emu-863",
                    "id": "hv61v1q",
                    "parent_id": "t1_huzfbok",
                    "score": 2,
                    "created_utc": 1643741314.0,
                    "replies": [
                        {
                            "body": "My ppm was more than I paid for escorts so I don’t know what you mean ?  My preference with an escorts of course was for very short booking\n\nPlus I’m not really into seasoned professionals tbh",
                            "author": "wb19081908",
                            "id": "hv6oeo0",
                            "parent_id": "t1_hv61v1q",
                            "score": 0,
                            "created_utc": 1643749732.0,
                            "replies": [
                                {
                                    "body": "Excuse me if I’m wrong, but aren’t you the person who posts into hobbying forums boasting about SA and how they will go raw for the first time etc etc?",
                                    "author": null,
                                    "id": "hvaynhi",
                                    "parent_id": "t1_hv6oeo0",
                                    "score": 3,
                                    "created_utc": 1643824372.0,
                                    "replies": [
                                        {
                                            "body": "Thanks for paying so much attention to my posts it’s flattering.",
                                            "author": "wb19081908",
                                            "id": "hvbyyf8",
                                            "parent_id": "t1_hvaynhi",
                                            "score": 0,
                                            "created_utc": 1643837819.0,
                                            "replies": [
                                                {
                                                    "body": "I wish I didn’t have to 😂",
                                                    "author": null,
                                                    "id": "hvc09ez",
                                                    "parent_id": "t1_hvbyyf8",
                                                    "score": 2,
                                                    "created_utc": 1643838291.0,
                                                    "replies": [
                                                        {
                                                            "body": "You don’t have too at all.  There are like a million other things you could look at on reddit.  I’m sure if you look long enough you will find something that amuses you",
                                                            "author": "wb19081908",
                                                            "id": "hvc0nf6",
                                                            "parent_id": "t1_hvc09ez",
                                                            "score": 0,
                                                            "created_utc": 1643838432.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Unfortunately people have mentioned you in several posts- so yes, I had to. Thank god I did, I will be on the lookout for men like you",
                                                                    "author": null,
                                                                    "id": "hvc156x",
                                                                    "parent_id": "t1_hvc0nf6",
                                                                    "score": 2,
                                                                    "created_utc": 1643838611.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yeh I understand some of the long term sb who post on the sugar baby forum don’t like me.  I find it amusing.  I’ve never even spoken to any of them either.  Oh well\n\nYour last comment is weird.  I’m not looking for an sb and if I were it wouldn’t be on reddit.  I’m just here to kill time.",
                                                                            "author": "wb19081908",
                                                                            "id": "hvc1hgs",
                                                                            "parent_id": "t1_hvc156x",
                                                                            "score": 1,
                                                                            "created_utc": 1643838735.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Yeah there’s probably reasons for that. Can’t say I have been in this forum too long, and definitely haven’t been a long term sb as of yet, but your posts in other forums are definitely eye opening. Your comments in the hobbying forum are weird. ✨",
                                                                                    "author": null,
                                                                                    "id": "hvc2gl0",
                                                                                    "parent_id": "t1_hvc1hgs",
                                                                                    "score": 3,
                                                                                    "created_utc": 1643839096.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Again thanks for the attention it’s flattering lol",
                                                                                            "author": "wb19081908",
                                                                                            "id": "hvc2oh3",
                                                                                            "parent_id": "t1_hvc2gl0",
                                                                                            "score": 1,
                                                                                            "created_utc": 1643839177.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "These are just things I’ve seen happen. The potential bad side isn’t talked about enough and these are things I think new SBs should know to be cautious with.",
            "author": "bubblerush",
            "id": "huiftk2",
            "parent_id": "t1_huifca6",
            "score": 17,
            "created_utc": 1643327710.0,
            "replies": []
        },
        {
            "body": "Do you find it difficult to find folks that are ok with polyamorous SB or that find polyamory understandable?",
            "author": "theladysupernova",
            "id": "huldlg8",
            "parent_id": "t1_huifca6",
            "score": 1,
            "created_utc": 1643384198.0,
            "replies": [
                {
                    "body": "I put it clearly in my profile and am able to speak to my reasoning for being polyamorous. This attracts other open & poly people.\n\nI always ask if someone read my profile & then remember to bring it up before we video or M&G so I don't waste our time.\n\nI imagine being a polyamorous SB you don't necessarily need to disclose. Most of these guys are married - why can't you have a boyfriend?",
                    "author": "notnoteworthyatall",
                    "id": "hv6086s",
                    "parent_id": "t1_huldlg8",
                    "score": 3,
                    "created_utc": 1643740711.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you’re at the point where you forcing yourself to go through the motions with your SD then you won’t just be ending it for some boy. You’ll be ending it for yourself as well.",
            "author": "bubblerush",
            "id": "hulykel",
            "parent_id": "t1_hul30ct",
            "score": 7,
            "created_utc": 1643391951.0,
            "replies": []
        },
        {
            "body": "Yup!",
            "author": "bubblerush",
            "id": "huieygz",
            "parent_id": "t1_huiee39",
            "score": 20,
            "created_utc": 1643327352.0,
            "replies": [
                {
                    "body": "I’m not an SB but I’m 29 and my boyfriend is 58. Nobody looks at us with pity. If anything they look at us with envy.",
                    "author": "supermarket_Ba",
                    "id": "huinxhr",
                    "parent_id": "t1_huieygz",
                    "score": 0,
                    "created_utc": 1643331098.0,
                    "replies": [
                        {
                            "body": "keep telling yourself that",
                            "author": null,
                            "id": "hum1lmy",
                            "parent_id": "t1_huinxhr",
                            "score": 8,
                            "created_utc": 1643393063.0,
                            "replies": [
                                {
                                    "body": "Lol I will",
                                    "author": "supermarket_Ba",
                                    "id": "hum2c3v",
                                    "parent_id": "t1_hum1lmy",
                                    "score": -1,
                                    "created_utc": 1643393337.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "yeah, sure they do LOL",
                            "author": "Clektr",
                            "id": "huiozdv",
                            "parent_id": "t1_huinxhr",
                            "score": 29,
                            "created_utc": 1643331538.0,
                            "replies": [
                                {
                                    "body": "Sorry nobody looks at you that way. My boyfriend is extremely attractive and so am I.",
                                    "author": "supermarket_Ba",
                                    "id": "huip4tj",
                                    "parent_id": "t1_huiozdv",
                                    "score": -11,
                                    "created_utc": 1643331602.0,
                                    "replies": [
                                        {
                                            "body": "I’m very happy for y’all",
                                            "author": "Clektr",
                                            "id": "huirt02",
                                            "parent_id": "t1_huip4tj",
                                            "score": 9,
                                            "created_utc": 1643332734.0,
                                            "replies": [
                                                {
                                                    "body": "I’m dying at these comments lol",
                                                    "author": "chinaacatt",
                                                    "id": "hujc660",
                                                    "parent_id": "t1_huirt02",
                                                    "score": 14,
                                                    "created_utc": 1643341611.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Thanks!",
                                                    "author": "supermarket_Ba",
                                                    "id": "huisdr6",
                                                    "parent_id": "t1_huirt02",
                                                    "score": 1,
                                                    "created_utc": 1643332981.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "We are the same ages, and I also find absolutely no one looks at us with pity or ever anger.   But, many people smile and probably wish they were in our shoes.",
                            "author": "HappyBear1952",
                            "id": "hujklft",
                            "parent_id": "t1_huinxhr",
                            "score": -3,
                            "created_utc": 1643345700.0,
                            "replies": []
                        },
                        {
                            "body": "when me (55 at time) and my SGF (29 at the time) would be out, so many people would stop us and say what a great couple we made, and we must be in love based on how we looked at each other and interacted. it was a little disconcerting since we both had reasons for wanting to be somewhat discreet, but also very flattering at the same time.",
                            "author": "joc13",
                            "id": "hulfkmz",
                            "parent_id": "t1_huinxhr",
                            "score": -2,
                            "created_utc": 1643384941.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Who is pitying you? And why are you hanging out with anyone so horrible that you need to be pitied…?",
                    "author": "WineDineN69me",
                    "id": "huilnxv",
                    "parent_id": "t1_huieygz",
                    "score": -6,
                    "created_utc": 1643330157.0,
                    "replies": [
                        {
                            "body": "cause no other guys would agree to date her?  or, she needed the money that bad?\n\nI remember seeing what I was certain had to be a sugar date, and the young lady looked miserable. I did pity her in a sense, and wondered if there was anything I could do to \"rescue\" her. but, then, I was like \"she chose to be in this situation for whatever reason, so it's her problem to deal with\"",
                            "author": "joc13",
                            "id": "hulezbz",
                            "parent_id": "t1_huilnxv",
                            "score": 0,
                            "created_utc": 1643384721.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, pity.\n\nI know it is more alluring to delude yourself by thinking 'sugar outsiders' stares come from jealousy, but it is often pity.\n\nPity for the young girl to 'have to sell herself', pity for the old man to 'pay for company/sex'",
            "author": "A-touchofreality",
            "id": "huihwhc",
            "parent_id": "t1_huiee39",
            "score": 38,
            "created_utc": 1643328587.0,
            "replies": [
                {
                    "body": "Exactly. I see so many posts talking about how people are throwing looks of jealousy especially older women towards the way of sugar couples. I’m not saying you should put much stock in these stares, but let’s not kid ourself either.",
                    "author": "GoodyGoobert",
                    "id": "huiwlto",
                    "parent_id": "t1_huihwhc",
                    "score": 27,
                    "created_utc": 1643334778.0,
                    "replies": []
                },
                {
                    "body": "> I know it is more alluring to allude yourself \n\nDelude*",
                    "author": "Y_4Z44",
                    "id": "huiierv",
                    "parent_id": "t1_huihwhc",
                    "score": 0,
                    "created_utc": 1643328802.0,
                    "replies": [
                        {
                            "body": "Haha, sorry typo!",
                            "author": "A-touchofreality",
                            "id": "huk324p",
                            "parent_id": "t1_huiierv",
                            "score": 4,
                            "created_utc": 1643357053.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah lol. I was once out with an ex SD (early 60s) at a really fancy place and the lady (mid 40s) next to me whispered not so quietly to her husband (50s) “I would fucking kill myself” talking about me. So embarrassing.",
            "author": null,
            "id": "huig2sb",
            "parent_id": "t1_huiee39",
            "score": 19,
            "created_utc": 1643327819.0,
            "replies": [
                {
                    "body": "Sounds like a typical Karen 😉",
                    "author": "WineDineN69me",
                    "id": "huipdt3",
                    "parent_id": "t1_huig2sb",
                    "score": 5,
                    "created_utc": 1643331706.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Very few women will be honest with a sugar daddy about their experience",
            "author": "bubblerush",
            "id": "huju1yo",
            "parent_id": "t1_huje617",
            "score": 13,
            "created_utc": 1643351046.0,
            "replies": [
                {
                    "body": "Denggggg!!!!",
                    "author": "A-touchofreality",
                    "id": "huk3j5b",
                    "parent_id": "t1_huju1yo",
                    "score": 7,
                    "created_utc": 1643357393.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why is every SB who is honest saying something about her sugaring experience (and no that's not always what SDs would like to hear) immediately 'escort shamed'?",
            "author": "A-touchofreality",
            "id": "huk3o5t",
            "parent_id": "t1_huje617",
            "score": 8,
            "created_utc": 1643357494.0,
            "replies": []
        },
        {
            "body": "“Burden on SDs too.” I think we should be focusing on the risks for young women with this post. I don’t think men that are 40+ years old need someone to advocate for them. This is an important message for girls, sometimes even teens that are getting into this. If a young woman is uncomfortable because she doesn’t want to be intimate with an older man that’s no “burden” on him.",
            "author": "bubblerush",
            "id": "huil63o",
            "parent_id": "t1_huij57x",
            "score": 11,
            "created_utc": 1643329950.0,
            "replies": []
        },
        {
            "body": "Mostly in seeking.com but also in other platforms and in the wild too",
            "author": "shamloo77",
            "id": "hujkpsp",
            "parent_id": "t1_huivnrk",
            "score": 2,
            "created_utc": 1643345765.0,
            "replies": []
        },
        {
            "body": "Why do you think they do it? Men being disrespectful to women is THEIR problem, action, and responsibility. It's not ok to take advantage of women who have not been as lucky as the men. It is not the young woman's fault, good grief.",
            "author": "throwanon4",
            "id": "hujtlsb",
            "parent_id": "t1_hujlgak",
            "score": 12,
            "created_utc": 1643350770.0,
            "replies": []
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "huj7l1m",
            "parent_id": "t1_huj7l0e",
            "score": 1,
            "created_utc": 1643339559.0,
            "replies": []
        },
        {
            "body": "Thanks for saying this 💕",
            "author": "grishaelle",
            "id": "hujc4zv",
            "parent_id": "t1_hujc0xa",
            "score": 10,
            "created_utc": 1643341596.0,
            "replies": []
        },
        {
            "body": "Preach.",
            "author": "music4galz",
            "id": "huni4e2",
            "parent_id": "t1_hujc0xa",
            "score": 2,
            "created_utc": 1643413475.0,
            "replies": []
        },
        {
            "body": "You're welcome, dear! Like I said, I am long out of the bowl. It was fun while it lasted, though!",
            "author": "Glass_Status_5837",
            "id": "huj9hqz",
            "parent_id": "t1_huint1c",
            "score": 9,
            "created_utc": 1643340401.0,
            "replies": []
        },
        {
            "body": "No SB should agree to play on the first meet. Ever. You need to work out each other's personalities and agree on terms and boundaries. I had some that tried. REALLY tried. Offered to give me money right there. \n\nTerms first, THEN fun.",
            "author": "Glass_Status_5837",
            "id": "huj9uyu",
            "parent_id": "t1_huiyots",
            "score": 24,
            "created_utc": 1643340564.0,
            "replies": [
                {
                    "body": "When I (50 at the time) was a SR noob, while chatting with the woman (23) that turned out to be my 1st LTSR, we were both looking at Google, trying to find a mutually convenient place to have a M&G. I was to be her 4th SD. She interjected, \"Or we could just meet at a hotel and hang out. I've done that with my previous SDs.\" So we did.. We chatted clothed, w/o touching for 30-45 min introducing ourselves. We then were intimate. We had a good time for a year, meeting weekly. \n\nI've also chatted with several women from SA who refused to do even a paid M&G, but wanted to begin with an intimate 1st meeting for a full ppm. I would understand if you wanted to call them prostitutes and not SBs. I had a post a while ago asking about both SDs & SBs from SA meeting for intimate 1st dates, where both parties were upfront about this being a 1 and done intimate encounter. Both men & women admitted to knowingly participating.",
                    "author": "docrolling",
                    "id": "hukcx0s",
                    "parent_id": "t1_huj9uyu",
                    "score": 7,
                    "created_utc": 1643364682.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ugh you sound amazing. I wish there were more men like you on SA…. I look online for a few mins and log off. Thank god atp it’s not desperation purposes where I feel like there are those who sniff it out and take advantage of… so I hope I’ll find someone like you where there is mutual respect, and ofc benefits.",
            "author": null,
            "id": "hvawx3y",
            "parent_id": "t1_huiyots",
            "score": 1,
            "created_utc": 1643823742.0,
            "replies": []
        },
        {
            "body": "Lol. I am neither hot anymore, nor young. And I'm engaged. You deserve a lot more for your money, dear. But I appreciate it. :)",
            "author": "Glass_Status_5837",
            "id": "huj8kod",
            "parent_id": "t1_huj8e0c",
            "score": 11,
            "created_utc": 1643340000.0,
            "replies": [
                {
                    "body": "Congratulate! And, trust me, you're younger and hotter than I am or will ever be! Probably smarter too. I can fly one but I've no idea how to build one (or what keeps them up in the air)",
                    "author": "StunnedSilencer",
                    "id": "huj9rfr",
                    "parent_id": "t1_huj8kod",
                    "score": 5,
                    "created_utc": 1643340520.0,
                    "replies": [
                        {
                            "body": "Lol. Thank you. I can fly them. Not build them. But I know how to keep them in the air and not crash into anything. I worked as a flight dispatcher before the 'rona took the industry down. I was able to regroup pretty quickly though. My data processing skills turned out to be a pretty good fit for a pharmaceutical development company in the patient assistance program. I get paid to sweet talk health insurance companies all day. \n\nNot much different than sweet talking air traffic control.",
                            "author": "Glass_Status_5837",
                            "id": "hujaw56",
                            "parent_id": "t1_huj9rfr",
                            "score": 10,
                            "created_utc": 1643341026.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Does your fiance know about you being an SB? always curious about that",
                    "author": "Hungboy6969420",
                    "id": "huvil1n",
                    "parent_id": "t1_huj8kod",
                    "score": 1,
                    "created_utc": 1643563481.0,
                    "replies": [
                        {
                            "body": "He knows it was part of my past, yes.",
                            "author": "Glass_Status_5837",
                            "id": "huviryy",
                            "parent_id": "t1_huvil1n",
                            "score": 5,
                            "created_utc": 1643563553.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It did. Took about 3 weeks. I wasn't stupid.",
            "author": "Glass_Status_5837",
            "id": "hujiv6z",
            "parent_id": "t1_hujihob",
            "score": 1,
            "created_utc": 1643344830.0,
            "replies": []
        },
        {
            "body": "Fixed it. I was referring to what some sex workers charge for backseat sex.",
            "author": "Glass_Status_5837",
            "id": "huilws0",
            "parent_id": "t1_huikyk0",
            "score": 7,
            "created_utc": 1643330259.0,
            "replies": [
                {
                    "body": "Happy cake day! Good thing you fixed your post, you almost got serrrvvvvveddd! Like serving cake, 'cause it's your cake day. You get it.",
                    "author": "music4galz",
                    "id": "hunjl8i",
                    "parent_id": "t1_huilws0",
                    "score": 1,
                    "created_utc": 1643414107.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fair enough! I've had multiple occasions of ladies straight up going out of their way to ignore their own Valentines Day date to gawk with their mouth open and unbreaking eye contact at me from the next table and reaaaaaally annoyed me. Good to know the dude is also being roasted as well.\n\nIt's so weird when they do that. Like geez lady, can't only ONE of us lack shame in public, please?/j",
            "author": "sbgonebroke",
            "id": "hun76in",
            "parent_id": "t1_huk3fse",
            "score": 2,
            "created_utc": 1643408963.0,
            "replies": [
                {
                    "body": "Yes, that's absolutely weird, I agree.\n\nBut it's a fact that unmatched couples attract attention, like most things out of the ordinary. And maybe some of the older women who stare might have daughters your age and it comes too close?",
                    "author": "A-touchofreality",
                    "id": "hun8to2",
                    "parent_id": "t1_hun76in",
                    "score": 2,
                    "created_utc": 1643409632.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you want to go down that path (becoming an escort) there are SAFER ways to do it - then being a pseudo SB on SA.\n\n^^This 👍",
            "author": "sweetlady247",
            "id": "humj0k8",
            "parent_id": "t1_hum5tur",
            "score": 2,
            "created_utc": 1643399576.0,
            "replies": []
        },
        {
            "body": "thanks! Unfortunately many women have no understanding of what a real sugar relationship is and when they join SA they assume all men are SD. \n\nJust look how many SB come on here confused when they get hit up by Johns and they have no idea those men are not real SD.\n\nMany women in my age bracket and younger grew up with apps like Tinder, so hookup culture is very prevalent so a lot of women end up acting the same way on SA and basically end up being low volume escorts whether they realize it or not. Things only get worse for them if they’re financially desperate and make poor decisions.\n\nIf a woman wants to be an escort there is no shame in that, but she shouldn’t do it out of desperation nor should she do it on Seeking.",
            "author": "WineDineN69me",
            "id": "humsvub",
            "parent_id": "t1_hum5tur",
            "score": 2,
            "created_utc": 1643403348.0,
            "replies": []
        },
        {
            "body": "Lol, yes a seasoned professional wouldn't go for whatever it is I imagine you're offering, or your dates would be 30 minutes to an hour.  Do you ever feel guilty for tricking civilians into such laborious work for such low pay?",
            "author": "Zealousideal-Emu-863",
            "id": "hv61v1q",
            "parent_id": "t1_huzfbok",
            "score": 2,
            "created_utc": 1643741314.0,
            "replies": [
                {
                    "body": "My ppm was more than I paid for escorts so I don’t know what you mean ?  My preference with an escorts of course was for very short booking\n\nPlus I’m not really into seasoned professionals tbh",
                    "author": "wb19081908",
                    "id": "hv6oeo0",
                    "parent_id": "t1_hv61v1q",
                    "score": 0,
                    "created_utc": 1643749732.0,
                    "replies": [
                        {
                            "body": "Excuse me if I’m wrong, but aren’t you the person who posts into hobbying forums boasting about SA and how they will go raw for the first time etc etc?",
                            "author": null,
                            "id": "hvaynhi",
                            "parent_id": "t1_hv6oeo0",
                            "score": 3,
                            "created_utc": 1643824372.0,
                            "replies": [
                                {
                                    "body": "Thanks for paying so much attention to my posts it’s flattering.",
                                    "author": "wb19081908",
                                    "id": "hvbyyf8",
                                    "parent_id": "t1_hvaynhi",
                                    "score": 0,
                                    "created_utc": 1643837819.0,
                                    "replies": [
                                        {
                                            "body": "I wish I didn’t have to 😂",
                                            "author": null,
                                            "id": "hvc09ez",
                                            "parent_id": "t1_hvbyyf8",
                                            "score": 2,
                                            "created_utc": 1643838291.0,
                                            "replies": [
                                                {
                                                    "body": "You don’t have too at all.  There are like a million other things you could look at on reddit.  I’m sure if you look long enough you will find something that amuses you",
                                                    "author": "wb19081908",
                                                    "id": "hvc0nf6",
                                                    "parent_id": "t1_hvc09ez",
                                                    "score": 0,
                                                    "created_utc": 1643838432.0,
                                                    "replies": [
                                                        {
                                                            "body": "Unfortunately people have mentioned you in several posts- so yes, I had to. Thank god I did, I will be on the lookout for men like you",
                                                            "author": null,
                                                            "id": "hvc156x",
                                                            "parent_id": "t1_hvc0nf6",
                                                            "score": 2,
                                                            "created_utc": 1643838611.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeh I understand some of the long term sb who post on the sugar baby forum don’t like me.  I find it amusing.  I’ve never even spoken to any of them either.  Oh well\n\nYour last comment is weird.  I’m not looking for an sb and if I were it wouldn’t be on reddit.  I’m just here to kill time.",
                                                                    "author": "wb19081908",
                                                                    "id": "hvc1hgs",
                                                                    "parent_id": "t1_hvc156x",
                                                                    "score": 1,
                                                                    "created_utc": 1643838735.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yeah there’s probably reasons for that. Can’t say I have been in this forum too long, and definitely haven’t been a long term sb as of yet, but your posts in other forums are definitely eye opening. Your comments in the hobbying forum are weird. ✨",
                                                                            "author": null,
                                                                            "id": "hvc2gl0",
                                                                            "parent_id": "t1_hvc1hgs",
                                                                            "score": 3,
                                                                            "created_utc": 1643839096.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Again thanks for the attention it’s flattering lol",
                                                                                    "author": "wb19081908",
                                                                                    "id": "hvc2oh3",
                                                                                    "parent_id": "t1_hvc2gl0",
                                                                                    "score": 1,
                                                                                    "created_utc": 1643839177.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I put it clearly in my profile and am able to speak to my reasoning for being polyamorous. This attracts other open & poly people.\n\nI always ask if someone read my profile & then remember to bring it up before we video or M&G so I don't waste our time.\n\nI imagine being a polyamorous SB you don't necessarily need to disclose. Most of these guys are married - why can't you have a boyfriend?",
            "author": "notnoteworthyatall",
            "id": "hv6086s",
            "parent_id": "t1_huldlg8",
            "score": 3,
            "created_utc": 1643740711.0,
            "replies": []
        },
        {
            "body": "I’m not an SB but I’m 29 and my boyfriend is 58. Nobody looks at us with pity. If anything they look at us with envy.",
            "author": "supermarket_Ba",
            "id": "huinxhr",
            "parent_id": "t1_huieygz",
            "score": 0,
            "created_utc": 1643331098.0,
            "replies": [
                {
                    "body": "keep telling yourself that",
                    "author": null,
                    "id": "hum1lmy",
                    "parent_id": "t1_huinxhr",
                    "score": 8,
                    "created_utc": 1643393063.0,
                    "replies": [
                        {
                            "body": "Lol I will",
                            "author": "supermarket_Ba",
                            "id": "hum2c3v",
                            "parent_id": "t1_hum1lmy",
                            "score": -1,
                            "created_utc": 1643393337.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "yeah, sure they do LOL",
                    "author": "Clektr",
                    "id": "huiozdv",
                    "parent_id": "t1_huinxhr",
                    "score": 29,
                    "created_utc": 1643331538.0,
                    "replies": [
                        {
                            "body": "Sorry nobody looks at you that way. My boyfriend is extremely attractive and so am I.",
                            "author": "supermarket_Ba",
                            "id": "huip4tj",
                            "parent_id": "t1_huiozdv",
                            "score": -11,
                            "created_utc": 1643331602.0,
                            "replies": [
                                {
                                    "body": "I’m very happy for y’all",
                                    "author": "Clektr",
                                    "id": "huirt02",
                                    "parent_id": "t1_huip4tj",
                                    "score": 9,
                                    "created_utc": 1643332734.0,
                                    "replies": [
                                        {
                                            "body": "I’m dying at these comments lol",
                                            "author": "chinaacatt",
                                            "id": "hujc660",
                                            "parent_id": "t1_huirt02",
                                            "score": 14,
                                            "created_utc": 1643341611.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Thanks!",
                                            "author": "supermarket_Ba",
                                            "id": "huisdr6",
                                            "parent_id": "t1_huirt02",
                                            "score": 1,
                                            "created_utc": 1643332981.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "We are the same ages, and I also find absolutely no one looks at us with pity or ever anger.   But, many people smile and probably wish they were in our shoes.",
                    "author": "HappyBear1952",
                    "id": "hujklft",
                    "parent_id": "t1_huinxhr",
                    "score": -3,
                    "created_utc": 1643345700.0,
                    "replies": []
                },
                {
                    "body": "when me (55 at time) and my SGF (29 at the time) would be out, so many people would stop us and say what a great couple we made, and we must be in love based on how we looked at each other and interacted. it was a little disconcerting since we both had reasons for wanting to be somewhat discreet, but also very flattering at the same time.",
                    "author": "joc13",
                    "id": "hulfkmz",
                    "parent_id": "t1_huinxhr",
                    "score": -2,
                    "created_utc": 1643384941.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Who is pitying you? And why are you hanging out with anyone so horrible that you need to be pitied…?",
            "author": "WineDineN69me",
            "id": "huilnxv",
            "parent_id": "t1_huieygz",
            "score": -6,
            "created_utc": 1643330157.0,
            "replies": [
                {
                    "body": "cause no other guys would agree to date her?  or, she needed the money that bad?\n\nI remember seeing what I was certain had to be a sugar date, and the young lady looked miserable. I did pity her in a sense, and wondered if there was anything I could do to \"rescue\" her. but, then, I was like \"she chose to be in this situation for whatever reason, so it's her problem to deal with\"",
                    "author": "joc13",
                    "id": "hulezbz",
                    "parent_id": "t1_huilnxv",
                    "score": 0,
                    "created_utc": 1643384721.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly. I see so many posts talking about how people are throwing looks of jealousy especially older women towards the way of sugar couples. I’m not saying you should put much stock in these stares, but let’s not kid ourself either.",
            "author": "GoodyGoobert",
            "id": "huiwlto",
            "parent_id": "t1_huihwhc",
            "score": 27,
            "created_utc": 1643334778.0,
            "replies": []
        },
        {
            "body": "> I know it is more alluring to allude yourself \n\nDelude*",
            "author": "Y_4Z44",
            "id": "huiierv",
            "parent_id": "t1_huihwhc",
            "score": 0,
            "created_utc": 1643328802.0,
            "replies": [
                {
                    "body": "Haha, sorry typo!",
                    "author": "A-touchofreality",
                    "id": "huk324p",
                    "parent_id": "t1_huiierv",
                    "score": 4,
                    "created_utc": 1643357053.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like a typical Karen 😉",
            "author": "WineDineN69me",
            "id": "huipdt3",
            "parent_id": "t1_huig2sb",
            "score": 5,
            "created_utc": 1643331706.0,
            "replies": []
        },
        {
            "body": "Denggggg!!!!",
            "author": "A-touchofreality",
            "id": "huk3j5b",
            "parent_id": "t1_huju1yo",
            "score": 7,
            "created_utc": 1643357393.0,
            "replies": []
        },
        {
            "body": "When I (50 at the time) was a SR noob, while chatting with the woman (23) that turned out to be my 1st LTSR, we were both looking at Google, trying to find a mutually convenient place to have a M&G. I was to be her 4th SD. She interjected, \"Or we could just meet at a hotel and hang out. I've done that with my previous SDs.\" So we did.. We chatted clothed, w/o touching for 30-45 min introducing ourselves. We then were intimate. We had a good time for a year, meeting weekly. \n\nI've also chatted with several women from SA who refused to do even a paid M&G, but wanted to begin with an intimate 1st meeting for a full ppm. I would understand if you wanted to call them prostitutes and not SBs. I had a post a while ago asking about both SDs & SBs from SA meeting for intimate 1st dates, where both parties were upfront about this being a 1 and done intimate encounter. Both men & women admitted to knowingly participating.",
            "author": "docrolling",
            "id": "hukcx0s",
            "parent_id": "t1_huj9uyu",
            "score": 7,
            "created_utc": 1643364682.0,
            "replies": []
        },
        {
            "body": "Congratulate! And, trust me, you're younger and hotter than I am or will ever be! Probably smarter too. I can fly one but I've no idea how to build one (or what keeps them up in the air)",
            "author": "StunnedSilencer",
            "id": "huj9rfr",
            "parent_id": "t1_huj8kod",
            "score": 5,
            "created_utc": 1643340520.0,
            "replies": [
                {
                    "body": "Lol. Thank you. I can fly them. Not build them. But I know how to keep them in the air and not crash into anything. I worked as a flight dispatcher before the 'rona took the industry down. I was able to regroup pretty quickly though. My data processing skills turned out to be a pretty good fit for a pharmaceutical development company in the patient assistance program. I get paid to sweet talk health insurance companies all day. \n\nNot much different than sweet talking air traffic control.",
                    "author": "Glass_Status_5837",
                    "id": "hujaw56",
                    "parent_id": "t1_huj9rfr",
                    "score": 10,
                    "created_utc": 1643341026.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Does your fiance know about you being an SB? always curious about that",
            "author": "Hungboy6969420",
            "id": "huvil1n",
            "parent_id": "t1_huj8kod",
            "score": 1,
            "created_utc": 1643563481.0,
            "replies": [
                {
                    "body": "He knows it was part of my past, yes.",
                    "author": "Glass_Status_5837",
                    "id": "huviryy",
                    "parent_id": "t1_huvil1n",
                    "score": 5,
                    "created_utc": 1643563553.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Happy cake day! Good thing you fixed your post, you almost got serrrvvvvveddd! Like serving cake, 'cause it's your cake day. You get it.",
            "author": "music4galz",
            "id": "hunjl8i",
            "parent_id": "t1_huilws0",
            "score": 1,
            "created_utc": 1643414107.0,
            "replies": []
        },
        {
            "body": "Yes, that's absolutely weird, I agree.\n\nBut it's a fact that unmatched couples attract attention, like most things out of the ordinary. And maybe some of the older women who stare might have daughters your age and it comes too close?",
            "author": "A-touchofreality",
            "id": "hun8to2",
            "parent_id": "t1_hun76in",
            "score": 2,
            "created_utc": 1643409632.0,
            "replies": []
        },
        {
            "body": "My ppm was more than I paid for escorts so I don’t know what you mean ?  My preference with an escorts of course was for very short booking\n\nPlus I’m not really into seasoned professionals tbh",
            "author": "wb19081908",
            "id": "hv6oeo0",
            "parent_id": "t1_hv61v1q",
            "score": 0,
            "created_utc": 1643749732.0,
            "replies": [
                {
                    "body": "Excuse me if I’m wrong, but aren’t you the person who posts into hobbying forums boasting about SA and how they will go raw for the first time etc etc?",
                    "author": null,
                    "id": "hvaynhi",
                    "parent_id": "t1_hv6oeo0",
                    "score": 3,
                    "created_utc": 1643824372.0,
                    "replies": [
                        {
                            "body": "Thanks for paying so much attention to my posts it’s flattering.",
                            "author": "wb19081908",
                            "id": "hvbyyf8",
                            "parent_id": "t1_hvaynhi",
                            "score": 0,
                            "created_utc": 1643837819.0,
                            "replies": [
                                {
                                    "body": "I wish I didn’t have to 😂",
                                    "author": null,
                                    "id": "hvc09ez",
                                    "parent_id": "t1_hvbyyf8",
                                    "score": 2,
                                    "created_utc": 1643838291.0,
                                    "replies": [
                                        {
                                            "body": "You don’t have too at all.  There are like a million other things you could look at on reddit.  I’m sure if you look long enough you will find something that amuses you",
                                            "author": "wb19081908",
                                            "id": "hvc0nf6",
                                            "parent_id": "t1_hvc09ez",
                                            "score": 0,
                                            "created_utc": 1643838432.0,
                                            "replies": [
                                                {
                                                    "body": "Unfortunately people have mentioned you in several posts- so yes, I had to. Thank god I did, I will be on the lookout for men like you",
                                                    "author": null,
                                                    "id": "hvc156x",
                                                    "parent_id": "t1_hvc0nf6",
                                                    "score": 2,
                                                    "created_utc": 1643838611.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeh I understand some of the long term sb who post on the sugar baby forum don’t like me.  I find it amusing.  I’ve never even spoken to any of them either.  Oh well\n\nYour last comment is weird.  I’m not looking for an sb and if I were it wouldn’t be on reddit.  I’m just here to kill time.",
                                                            "author": "wb19081908",
                                                            "id": "hvc1hgs",
                                                            "parent_id": "t1_hvc156x",
                                                            "score": 1,
                                                            "created_utc": 1643838735.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah there’s probably reasons for that. Can’t say I have been in this forum too long, and definitely haven’t been a long term sb as of yet, but your posts in other forums are definitely eye opening. Your comments in the hobbying forum are weird. ✨",
                                                                    "author": null,
                                                                    "id": "hvc2gl0",
                                                                    "parent_id": "t1_hvc1hgs",
                                                                    "score": 3,
                                                                    "created_utc": 1643839096.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Again thanks for the attention it’s flattering lol",
                                                                            "author": "wb19081908",
                                                                            "id": "hvc2oh3",
                                                                            "parent_id": "t1_hvc2gl0",
                                                                            "score": 1,
                                                                            "created_utc": 1643839177.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "keep telling yourself that",
            "author": null,
            "id": "hum1lmy",
            "parent_id": "t1_huinxhr",
            "score": 8,
            "created_utc": 1643393063.0,
            "replies": [
                {
                    "body": "Lol I will",
                    "author": "supermarket_Ba",
                    "id": "hum2c3v",
                    "parent_id": "t1_hum1lmy",
                    "score": -1,
                    "created_utc": 1643393337.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "yeah, sure they do LOL",
            "author": "Clektr",
            "id": "huiozdv",
            "parent_id": "t1_huinxhr",
            "score": 29,
            "created_utc": 1643331538.0,
            "replies": [
                {
                    "body": "Sorry nobody looks at you that way. My boyfriend is extremely attractive and so am I.",
                    "author": "supermarket_Ba",
                    "id": "huip4tj",
                    "parent_id": "t1_huiozdv",
                    "score": -11,
                    "created_utc": 1643331602.0,
                    "replies": [
                        {
                            "body": "I’m very happy for y’all",
                            "author": "Clektr",
                            "id": "huirt02",
                            "parent_id": "t1_huip4tj",
                            "score": 9,
                            "created_utc": 1643332734.0,
                            "replies": [
                                {
                                    "body": "I’m dying at these comments lol",
                                    "author": "chinaacatt",
                                    "id": "hujc660",
                                    "parent_id": "t1_huirt02",
                                    "score": 14,
                                    "created_utc": 1643341611.0,
                                    "replies": []
                                },
                                {
                                    "body": "Thanks!",
                                    "author": "supermarket_Ba",
                                    "id": "huisdr6",
                                    "parent_id": "t1_huirt02",
                                    "score": 1,
                                    "created_utc": 1643332981.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "We are the same ages, and I also find absolutely no one looks at us with pity or ever anger.   But, many people smile and probably wish they were in our shoes.",
            "author": "HappyBear1952",
            "id": "hujklft",
            "parent_id": "t1_huinxhr",
            "score": -3,
            "created_utc": 1643345700.0,
            "replies": []
        },
        {
            "body": "when me (55 at time) and my SGF (29 at the time) would be out, so many people would stop us and say what a great couple we made, and we must be in love based on how we looked at each other and interacted. it was a little disconcerting since we both had reasons for wanting to be somewhat discreet, but also very flattering at the same time.",
            "author": "joc13",
            "id": "hulfkmz",
            "parent_id": "t1_huinxhr",
            "score": -2,
            "created_utc": 1643384941.0,
            "replies": []
        },
        {
            "body": "cause no other guys would agree to date her?  or, she needed the money that bad?\n\nI remember seeing what I was certain had to be a sugar date, and the young lady looked miserable. I did pity her in a sense, and wondered if there was anything I could do to \"rescue\" her. but, then, I was like \"she chose to be in this situation for whatever reason, so it's her problem to deal with\"",
            "author": "joc13",
            "id": "hulezbz",
            "parent_id": "t1_huilnxv",
            "score": 0,
            "created_utc": 1643384721.0,
            "replies": []
        },
        {
            "body": "Haha, sorry typo!",
            "author": "A-touchofreality",
            "id": "huk324p",
            "parent_id": "t1_huiierv",
            "score": 4,
            "created_utc": 1643357053.0,
            "replies": []
        },
        {
            "body": "Lol. Thank you. I can fly them. Not build them. But I know how to keep them in the air and not crash into anything. I worked as a flight dispatcher before the 'rona took the industry down. I was able to regroup pretty quickly though. My data processing skills turned out to be a pretty good fit for a pharmaceutical development company in the patient assistance program. I get paid to sweet talk health insurance companies all day. \n\nNot much different than sweet talking air traffic control.",
            "author": "Glass_Status_5837",
            "id": "hujaw56",
            "parent_id": "t1_huj9rfr",
            "score": 10,
            "created_utc": 1643341026.0,
            "replies": []
        },
        {
            "body": "He knows it was part of my past, yes.",
            "author": "Glass_Status_5837",
            "id": "huviryy",
            "parent_id": "t1_huvil1n",
            "score": 5,
            "created_utc": 1643563553.0,
            "replies": []
        },
        {
            "body": "Excuse me if I’m wrong, but aren’t you the person who posts into hobbying forums boasting about SA and how they will go raw for the first time etc etc?",
            "author": null,
            "id": "hvaynhi",
            "parent_id": "t1_hv6oeo0",
            "score": 3,
            "created_utc": 1643824372.0,
            "replies": [
                {
                    "body": "Thanks for paying so much attention to my posts it’s flattering.",
                    "author": "wb19081908",
                    "id": "hvbyyf8",
                    "parent_id": "t1_hvaynhi",
                    "score": 0,
                    "created_utc": 1643837819.0,
                    "replies": [
                        {
                            "body": "I wish I didn’t have to 😂",
                            "author": null,
                            "id": "hvc09ez",
                            "parent_id": "t1_hvbyyf8",
                            "score": 2,
                            "created_utc": 1643838291.0,
                            "replies": [
                                {
                                    "body": "You don’t have too at all.  There are like a million other things you could look at on reddit.  I’m sure if you look long enough you will find something that amuses you",
                                    "author": "wb19081908",
                                    "id": "hvc0nf6",
                                    "parent_id": "t1_hvc09ez",
                                    "score": 0,
                                    "created_utc": 1643838432.0,
                                    "replies": [
                                        {
                                            "body": "Unfortunately people have mentioned you in several posts- so yes, I had to. Thank god I did, I will be on the lookout for men like you",
                                            "author": null,
                                            "id": "hvc156x",
                                            "parent_id": "t1_hvc0nf6",
                                            "score": 2,
                                            "created_utc": 1643838611.0,
                                            "replies": [
                                                {
                                                    "body": "Yeh I understand some of the long term sb who post on the sugar baby forum don’t like me.  I find it amusing.  I’ve never even spoken to any of them either.  Oh well\n\nYour last comment is weird.  I’m not looking for an sb and if I were it wouldn’t be on reddit.  I’m just here to kill time.",
                                                    "author": "wb19081908",
                                                    "id": "hvc1hgs",
                                                    "parent_id": "t1_hvc156x",
                                                    "score": 1,
                                                    "created_utc": 1643838735.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah there’s probably reasons for that. Can’t say I have been in this forum too long, and definitely haven’t been a long term sb as of yet, but your posts in other forums are definitely eye opening. Your comments in the hobbying forum are weird. ✨",
                                                            "author": null,
                                                            "id": "hvc2gl0",
                                                            "parent_id": "t1_hvc1hgs",
                                                            "score": 3,
                                                            "created_utc": 1643839096.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Again thanks for the attention it’s flattering lol",
                                                                    "author": "wb19081908",
                                                                    "id": "hvc2oh3",
                                                                    "parent_id": "t1_hvc2gl0",
                                                                    "score": 1,
                                                                    "created_utc": 1643839177.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol I will",
            "author": "supermarket_Ba",
            "id": "hum2c3v",
            "parent_id": "t1_hum1lmy",
            "score": -1,
            "created_utc": 1643393337.0,
            "replies": []
        },
        {
            "body": "Sorry nobody looks at you that way. My boyfriend is extremely attractive and so am I.",
            "author": "supermarket_Ba",
            "id": "huip4tj",
            "parent_id": "t1_huiozdv",
            "score": -11,
            "created_utc": 1643331602.0,
            "replies": [
                {
                    "body": "I’m very happy for y’all",
                    "author": "Clektr",
                    "id": "huirt02",
                    "parent_id": "t1_huip4tj",
                    "score": 9,
                    "created_utc": 1643332734.0,
                    "replies": [
                        {
                            "body": "I’m dying at these comments lol",
                            "author": "chinaacatt",
                            "id": "hujc660",
                            "parent_id": "t1_huirt02",
                            "score": 14,
                            "created_utc": 1643341611.0,
                            "replies": []
                        },
                        {
                            "body": "Thanks!",
                            "author": "supermarket_Ba",
                            "id": "huisdr6",
                            "parent_id": "t1_huirt02",
                            "score": 1,
                            "created_utc": 1643332981.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks for paying so much attention to my posts it’s flattering.",
            "author": "wb19081908",
            "id": "hvbyyf8",
            "parent_id": "t1_hvaynhi",
            "score": 0,
            "created_utc": 1643837819.0,
            "replies": [
                {
                    "body": "I wish I didn’t have to 😂",
                    "author": null,
                    "id": "hvc09ez",
                    "parent_id": "t1_hvbyyf8",
                    "score": 2,
                    "created_utc": 1643838291.0,
                    "replies": [
                        {
                            "body": "You don’t have too at all.  There are like a million other things you could look at on reddit.  I’m sure if you look long enough you will find something that amuses you",
                            "author": "wb19081908",
                            "id": "hvc0nf6",
                            "parent_id": "t1_hvc09ez",
                            "score": 0,
                            "created_utc": 1643838432.0,
                            "replies": [
                                {
                                    "body": "Unfortunately people have mentioned you in several posts- so yes, I had to. Thank god I did, I will be on the lookout for men like you",
                                    "author": null,
                                    "id": "hvc156x",
                                    "parent_id": "t1_hvc0nf6",
                                    "score": 2,
                                    "created_utc": 1643838611.0,
                                    "replies": [
                                        {
                                            "body": "Yeh I understand some of the long term sb who post on the sugar baby forum don’t like me.  I find it amusing.  I’ve never even spoken to any of them either.  Oh well\n\nYour last comment is weird.  I’m not looking for an sb and if I were it wouldn’t be on reddit.  I’m just here to kill time.",
                                            "author": "wb19081908",
                                            "id": "hvc1hgs",
                                            "parent_id": "t1_hvc156x",
                                            "score": 1,
                                            "created_utc": 1643838735.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah there’s probably reasons for that. Can’t say I have been in this forum too long, and definitely haven’t been a long term sb as of yet, but your posts in other forums are definitely eye opening. Your comments in the hobbying forum are weird. ✨",
                                                    "author": null,
                                                    "id": "hvc2gl0",
                                                    "parent_id": "t1_hvc1hgs",
                                                    "score": 3,
                                                    "created_utc": 1643839096.0,
                                                    "replies": [
                                                        {
                                                            "body": "Again thanks for the attention it’s flattering lol",
                                                            "author": "wb19081908",
                                                            "id": "hvc2oh3",
                                                            "parent_id": "t1_hvc2gl0",
                                                            "score": 1,
                                                            "created_utc": 1643839177.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m very happy for y’all",
            "author": "Clektr",
            "id": "huirt02",
            "parent_id": "t1_huip4tj",
            "score": 9,
            "created_utc": 1643332734.0,
            "replies": [
                {
                    "body": "I’m dying at these comments lol",
                    "author": "chinaacatt",
                    "id": "hujc660",
                    "parent_id": "t1_huirt02",
                    "score": 14,
                    "created_utc": 1643341611.0,
                    "replies": []
                },
                {
                    "body": "Thanks!",
                    "author": "supermarket_Ba",
                    "id": "huisdr6",
                    "parent_id": "t1_huirt02",
                    "score": 1,
                    "created_utc": 1643332981.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wish I didn’t have to 😂",
            "author": null,
            "id": "hvc09ez",
            "parent_id": "t1_hvbyyf8",
            "score": 2,
            "created_utc": 1643838291.0,
            "replies": [
                {
                    "body": "You don’t have too at all.  There are like a million other things you could look at on reddit.  I’m sure if you look long enough you will find something that amuses you",
                    "author": "wb19081908",
                    "id": "hvc0nf6",
                    "parent_id": "t1_hvc09ez",
                    "score": 0,
                    "created_utc": 1643838432.0,
                    "replies": [
                        {
                            "body": "Unfortunately people have mentioned you in several posts- so yes, I had to. Thank god I did, I will be on the lookout for men like you",
                            "author": null,
                            "id": "hvc156x",
                            "parent_id": "t1_hvc0nf6",
                            "score": 2,
                            "created_utc": 1643838611.0,
                            "replies": [
                                {
                                    "body": "Yeh I understand some of the long term sb who post on the sugar baby forum don’t like me.  I find it amusing.  I’ve never even spoken to any of them either.  Oh well\n\nYour last comment is weird.  I’m not looking for an sb and if I were it wouldn’t be on reddit.  I’m just here to kill time.",
                                    "author": "wb19081908",
                                    "id": "hvc1hgs",
                                    "parent_id": "t1_hvc156x",
                                    "score": 1,
                                    "created_utc": 1643838735.0,
                                    "replies": [
                                        {
                                            "body": "Yeah there’s probably reasons for that. Can’t say I have been in this forum too long, and definitely haven’t been a long term sb as of yet, but your posts in other forums are definitely eye opening. Your comments in the hobbying forum are weird. ✨",
                                            "author": null,
                                            "id": "hvc2gl0",
                                            "parent_id": "t1_hvc1hgs",
                                            "score": 3,
                                            "created_utc": 1643839096.0,
                                            "replies": [
                                                {
                                                    "body": "Again thanks for the attention it’s flattering lol",
                                                    "author": "wb19081908",
                                                    "id": "hvc2oh3",
                                                    "parent_id": "t1_hvc2gl0",
                                                    "score": 1,
                                                    "created_utc": 1643839177.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m dying at these comments lol",
            "author": "chinaacatt",
            "id": "hujc660",
            "parent_id": "t1_huirt02",
            "score": 14,
            "created_utc": 1643341611.0,
            "replies": []
        },
        {
            "body": "Thanks!",
            "author": "supermarket_Ba",
            "id": "huisdr6",
            "parent_id": "t1_huirt02",
            "score": 1,
            "created_utc": 1643332981.0,
            "replies": []
        },
        {
            "body": "You don’t have too at all.  There are like a million other things you could look at on reddit.  I’m sure if you look long enough you will find something that amuses you",
            "author": "wb19081908",
            "id": "hvc0nf6",
            "parent_id": "t1_hvc09ez",
            "score": 0,
            "created_utc": 1643838432.0,
            "replies": [
                {
                    "body": "Unfortunately people have mentioned you in several posts- so yes, I had to. Thank god I did, I will be on the lookout for men like you",
                    "author": null,
                    "id": "hvc156x",
                    "parent_id": "t1_hvc0nf6",
                    "score": 2,
                    "created_utc": 1643838611.0,
                    "replies": [
                        {
                            "body": "Yeh I understand some of the long term sb who post on the sugar baby forum don’t like me.  I find it amusing.  I’ve never even spoken to any of them either.  Oh well\n\nYour last comment is weird.  I’m not looking for an sb and if I were it wouldn’t be on reddit.  I’m just here to kill time.",
                            "author": "wb19081908",
                            "id": "hvc1hgs",
                            "parent_id": "t1_hvc156x",
                            "score": 1,
                            "created_utc": 1643838735.0,
                            "replies": [
                                {
                                    "body": "Yeah there’s probably reasons for that. Can’t say I have been in this forum too long, and definitely haven’t been a long term sb as of yet, but your posts in other forums are definitely eye opening. Your comments in the hobbying forum are weird. ✨",
                                    "author": null,
                                    "id": "hvc2gl0",
                                    "parent_id": "t1_hvc1hgs",
                                    "score": 3,
                                    "created_utc": 1643839096.0,
                                    "replies": [
                                        {
                                            "body": "Again thanks for the attention it’s flattering lol",
                                            "author": "wb19081908",
                                            "id": "hvc2oh3",
                                            "parent_id": "t1_hvc2gl0",
                                            "score": 1,
                                            "created_utc": 1643839177.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Unfortunately people have mentioned you in several posts- so yes, I had to. Thank god I did, I will be on the lookout for men like you",
            "author": null,
            "id": "hvc156x",
            "parent_id": "t1_hvc0nf6",
            "score": 2,
            "created_utc": 1643838611.0,
            "replies": [
                {
                    "body": "Yeh I understand some of the long term sb who post on the sugar baby forum don’t like me.  I find it amusing.  I’ve never even spoken to any of them either.  Oh well\n\nYour last comment is weird.  I’m not looking for an sb and if I were it wouldn’t be on reddit.  I’m just here to kill time.",
                    "author": "wb19081908",
                    "id": "hvc1hgs",
                    "parent_id": "t1_hvc156x",
                    "score": 1,
                    "created_utc": 1643838735.0,
                    "replies": [
                        {
                            "body": "Yeah there’s probably reasons for that. Can’t say I have been in this forum too long, and definitely haven’t been a long term sb as of yet, but your posts in other forums are definitely eye opening. Your comments in the hobbying forum are weird. ✨",
                            "author": null,
                            "id": "hvc2gl0",
                            "parent_id": "t1_hvc1hgs",
                            "score": 3,
                            "created_utc": 1643839096.0,
                            "replies": [
                                {
                                    "body": "Again thanks for the attention it’s flattering lol",
                                    "author": "wb19081908",
                                    "id": "hvc2oh3",
                                    "parent_id": "t1_hvc2gl0",
                                    "score": 1,
                                    "created_utc": 1643839177.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeh I understand some of the long term sb who post on the sugar baby forum don’t like me.  I find it amusing.  I’ve never even spoken to any of them either.  Oh well\n\nYour last comment is weird.  I’m not looking for an sb and if I were it wouldn’t be on reddit.  I’m just here to kill time.",
            "author": "wb19081908",
            "id": "hvc1hgs",
            "parent_id": "t1_hvc156x",
            "score": 1,
            "created_utc": 1643838735.0,
            "replies": [
                {
                    "body": "Yeah there’s probably reasons for that. Can’t say I have been in this forum too long, and definitely haven’t been a long term sb as of yet, but your posts in other forums are definitely eye opening. Your comments in the hobbying forum are weird. ✨",
                    "author": null,
                    "id": "hvc2gl0",
                    "parent_id": "t1_hvc1hgs",
                    "score": 3,
                    "created_utc": 1643839096.0,
                    "replies": [
                        {
                            "body": "Again thanks for the attention it’s flattering lol",
                            "author": "wb19081908",
                            "id": "hvc2oh3",
                            "parent_id": "t1_hvc2gl0",
                            "score": 1,
                            "created_utc": 1643839177.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah there’s probably reasons for that. Can’t say I have been in this forum too long, and definitely haven’t been a long term sb as of yet, but your posts in other forums are definitely eye opening. Your comments in the hobbying forum are weird. ✨",
            "author": null,
            "id": "hvc2gl0",
            "parent_id": "t1_hvc1hgs",
            "score": 3,
            "created_utc": 1643839096.0,
            "replies": [
                {
                    "body": "Again thanks for the attention it’s flattering lol",
                    "author": "wb19081908",
                    "id": "hvc2oh3",
                    "parent_id": "t1_hvc2gl0",
                    "score": 1,
                    "created_utc": 1643839177.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Again thanks for the attention it’s flattering lol",
            "author": "wb19081908",
            "id": "hvc2oh3",
            "parent_id": "t1_hvc2gl0",
            "score": 1,
            "created_utc": 1643839177.0,
            "replies": []
        }
    ]
}