{
    "title": "When Daddy doesn’t know how to...",
    "post_id": "mllaxq",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mllaxq/when_daddy_doesnt_know_how_to/",
    "author": "SassySugar4u",
    "body": "Today I was chatting with a POT, one who messaged me even though he lives a handful of hours away and professes not to be able to meet until COVID is somewhat resolved.\n\nGot the sense he’d be a prolific texter, which, amidst a nice arrangement, I really enjoy, but with a man who I’ve not met yet, who I’ll likely only see 6-10 a year, if and only if a successful M+G happens wheneverrrrr COVID is over?? 🧐 not so much, unless he’s being as generous with his resources as I am with my texting time. Mutually beneficial relationships, am I right??\n\nTbh I’m getting timewaster vibes. He’s probably the type to angrily state that he’d NEVER send an Amazon gift, even tho he expects hours of dirty texting before the first meet. Who’s the bad actor in the bowl in this situation? Doesn’t seem like me. \n\nAnyways, I was like “fuck it, I’m just gonna broach the PPM chat, cause I’m not about texting forever to find out that our PPM ranges are miles apart”. \n\nThen it goes down like this: \n\n* I ask him if he’d like to share the range he typically gives for PPM. \n\n* He ignores my question, and then two texts later asks me if I would be comfortable sharing my range\n*(Imagine thinking that would work hahahahahaha)*\n\n* I literally copied and pasted the text I originally sent, with me asking him if he’d like to share \n\n* he responds that he’d prefer if I share and he just says if my numbers will work or not. \n\n* I tell him that’s also what I prefer and that I asked first 😂\n\n#Now he’s silent LOL\nSuits me fine, as I’m not typically into beta men, anyways 🤷🏼‍♀️\n\n\nThe moral of this story? Expecting hours of texting before an arrangement begins is inappropriate. Get to know each other enough to schedule a meet and greet and then have the damn meet and greet. Seeking isnt 1900FreeTexts. \n\nAlso: Dont share your real number with people, especially if it brings up your full name, LinkedIn and your wife’s names on google. I’m not a blackmailer but some women are. \n\nFinally: bring up money first, if you want the upper hand. Otherwise known as “be a gd gentleman and get money talks out of the way, so you both can enjoy each other”. Imagine being the national manager of a large multinational and still not knowing how to confidently state your range or talk about money!\n\nImagine expecting hours of texting with a woman you’ve never met or given anything to ....that doesn’t make you a SD, it makes you a user trying to take advantage of someone.\n\nThoughts on this? Is it the new normal that a man expects to engage in countless hours of texting before even meeting you?\n\n#UPDATE\nJust got a message here, calling me a cynical, jaded bitch. Ummm? Why am I cynical for wanting ROI? \n\nFor all those thinking “ROI?? Sounds like a pro treating this like a business!!” - just remember that next time you’re dropping some comment about how you pay the lowest PPM you can manage, but “that’s what the market will bear”",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mllaxq/when_daddy_doesnt_know_how_to/",
    "score": 124,
    "upvote_ratio": 0.87,
    "created_utc": 1617741937.0,
    "num_comments": 87,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtmcda8",
            "parent_id": "t3_mllaxq",
            "score": 39,
            "created_utc": 1617746388.0,
            "replies": [
                {
                    "body": "I don't get the whole range thing either.  If an SB gives me a range, kneejerk reaction is to say \"I got you on $X\".  If I give her a range, of course I expect her to say \"$Y is good for me\".  And putting myself in a POT SB's shoes, she has every right to feel bad if I tell her \"I give my SBs anywhere from $X to $Y\", and then I offer her the very bottom of the range.\n\nTo me the whole range thing feels like just more game-playing because someone feels \"awkward\".  What I've found makes me the most comfortable is that I give my offer first, and it's $Z, not a range.  And as debated ad nauseum in other threads, I'm totally open if she wants to suggest something else.",
                    "author": "Azurecole",
                    "id": "gtmhwcm",
                    "parent_id": "t1_gtmcda8",
                    "score": 24,
                    "created_utc": 1617749171.0,
                    "replies": [
                        {
                            "body": "Similar to salary negotiations. Why offer a range?  Nobody will be happy unless they get the top end.",
                            "author": "timrid",
                            "id": "gtmm8fr",
                            "parent_id": "t1_gtmhwcm",
                            "score": 9,
                            "created_utc": 1617751344.0,
                            "replies": []
                        },
                        {
                            "body": "The only time I think a range makes sense is when it's contingent on certain extras. I've had some arrangements where on top of my PPM I was given a lot of expensive gifts, taken on trips, went to shows, etc. I'm willing to go for a slightly lower amount in that situation. Conversely, I've insisted on higher PPMs from people who lived far away as I had to factor 2+ hours of driving into the equation. So a range *can* make sense if there is justification as to what is expected from the top and bottom end of it.",
                            "author": "clashingtaco",
                            "id": "gtnbngp",
                            "parent_id": "t1_gtmhwcm",
                            "score": 10,
                            "created_utc": 1617764554.0,
                            "replies": [
                                {
                                    "body": "Tbh I’d rather just have an average number without all the extras. Those extras aren’t guaranteed and you can make a separate agreement on gifts or trips. To me a gift is a gift because you wanted to do something special, not because you are going to factor it into the ppm. Are kinky or extra sexual acts that make my SD feel special extra? No I do it cause I know he likes it it’s not a tit for tat to me that’s off putting and transactional",
                                    "author": "PrettyFlyForABlasian",
                                    "id": "gtnh2cp",
                                    "parent_id": "t1_gtnbngp",
                                    "score": 4,
                                    "created_utc": 1617767826.0,
                                    "replies": [
                                        {
                                            "body": "I think it's very situational. I've had SDs who preferred to buy me things/pay bills directly, as if it was sort of a fetish of theirs, so I was okay with getting more gifts for a lower PPM even though I typically prefer cash. Gifts here and there are one thing but large ticket items every week is something I'll negotiate my PPM for.",
                                            "author": "clashingtaco",
                                            "id": "gtni8t3",
                                            "parent_id": "t1_gtnh2cp",
                                            "score": 2,
                                            "created_utc": 1617768585.0,
                                            "replies": [
                                                {
                                                    "body": "To each their own. As long as it’s what you both want and consensual it’s fair game.",
                                                    "author": "PrettyFlyForABlasian",
                                                    "id": "gtnlyss",
                                                    "parent_id": "t1_gtni8t3",
                                                    "score": 0,
                                                    "created_utc": 1617771121.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I do not believe it is in either party's interest to discuss a specific number before a meeting .  YES   verify that she is pursuing an intimate arrangement and YES  he is prepared to provide an allowance ( perhaps  a broad range) .  \n\nAs the other party noted in a business transaction,  I could name the price if he got to name the terms (after I set the price) \n\nThe reason for my hesitancy to discuss this with someone I have not met is not so much wanting to see them in real life but rather to communicate where words, facial expressions and body language are all available for interpretation. \n\nAlso the M&G is an opportunity to discover added attractions of the other party.  Finally it is a place to discuss the \"rules of the road\" in terms expectations, limitations  etc. Finally a way to find creative bridges across areas where there is not full agreement .  \n\nOne example was (some time ago when it was more traditional to monthly allowance) that this worked with a half month prior to  initial intimacy  and converted to the equivalent of a monthly allowance repeated every 4th meeting (discourages cancellations that are not infrequent with monthly allowance) \n\n(( a note to SB   there are 13   4 week periods in a year.  For the reliable this is an extra allowance period per year)) \n\nLastly,  I think discussing and then seeking a common agreement in real time and having met the person is much more likely to result in a lasting relationship.",
                    "author": "pinotandsugar",
                    "id": "gtn4osy",
                    "parent_id": "t1_gtmcda8",
                    "score": 4,
                    "created_utc": 1617760761.0,
                    "replies": []
                },
                {
                    "body": "Interesting. So is the number you are comfortable with the lower X or higher Y?",
                    "author": "uniballSD",
                    "id": "gtmdqgb",
                    "parent_id": "t1_gtmcda8",
                    "score": 3,
                    "created_utc": 1617747057.0,
                    "replies": [
                        {
                            "body": "(x+y)/2 lol",
                            "author": "scumbagprincess1991",
                            "id": "gtmv582",
                            "parent_id": "t1_gtmdqgb",
                            "score": 4,
                            "created_utc": 1617755900.0,
                            "replies": [
                                {
                                    "body": "😂🤣",
                                    "author": "PrettyFlyForABlasian",
                                    "id": "gtnjh4q",
                                    "parent_id": "t1_gtmv582",
                                    "score": 1,
                                    "created_utc": 1617769412.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "it's literally the first thing you learn in negotiations.  No one hears the higher or lower number, depending on whether you're on the side of buying or selling.",
                    "author": null,
                    "id": "gtp3jrc",
                    "parent_id": "t1_gtmcda8",
                    "score": 0,
                    "created_utc": 1617808805.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtma2zy",
            "parent_id": "t3_mllaxq",
            "score": 14,
            "created_utc": 1617745295.0,
            "replies": [
                {
                    "body": "After he didn’t respond I wrote back w “cheers” Ans then blocked him on Seeking",
                    "author": "SassySugar4u",
                    "id": "gtmafih",
                    "parent_id": "t1_gtma2zy",
                    "score": 9,
                    "created_utc": 1617745462.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love this post. Asking him to name a number first is the right move. \n\nSDs, don’t be that guy where the baby has to push for a number. Offer your number early. Yes, in traditional negotiations the first person to say a number looses.  But be the gentleman here.  There is so little risk and so much to gain.",
            "author": "sandman200",
            "id": "gtmjwby",
            "parent_id": "t3_mllaxq",
            "score": 23,
            "created_utc": 1617750183.0,
            "replies": []
        },
        {
            "body": "You spotted this timewaster BS on day 1. You know there's never going to be ppm. Think of all the new SBs who don't know about SLF that spend days/weeks with these timewasters.",
            "author": "bluelunarmonkey",
            "id": "gtmq4q6",
            "parent_id": "t3_mllaxq",
            "score": 10,
            "created_utc": 1617753343.0,
            "replies": [
                {
                    "body": "Hence my post",
                    "author": "SassySugar4u",
                    "id": "gtmqwe8",
                    "parent_id": "t1_gtmq4q6",
                    "score": 5,
                    "created_utc": 1617753737.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"\"\"got a message here, calling me a cynical, jaded bitch. \"\"\"\n\nTranslated into \n\nsugarcode =   bullseye, sugar gamer target destroyed",
            "author": "pinotandsugar",
            "id": "gtm788g",
            "parent_id": "t3_mllaxq",
            "score": 32,
            "created_utc": 1617743956.0,
            "replies": []
        },
        {
            "body": "Fuck the men calling you cynical.  I’ve wasted hours that turned into days (when you add it all up) of chatting with POTs out of me being nice.  And I ended up with no $ to show from it.  \n\nI think most legit SDs don’t want to chat forever.  They also do not have the time to waste on that because their time is valuable just as ours is!  They want to meet, gauge chemistry and proceed one way or the other.  I have a full time job and sugaring helps me with bills...no time to chat with men who have no intention of a real & consistent SR. \n\nThank you for calling these time wasters out!",
            "author": "BBSFSA",
            "id": "gtmjoks",
            "parent_id": "t3_mllaxq",
            "score": 21,
            "created_utc": 1617750071.0,
            "replies": []
        },
        {
            "body": "I never mind going first when asked. I'll give the experiences I've had and the range of PPM's that they've consisted of. Either we are on the right track and can continue a discussion or we aren't and can go our separate ways.\n\nNo harm, no foul.",
            "author": "mraspencer",
            "id": "gtmvasi",
            "parent_id": "t3_mllaxq",
            "score": 7,
            "created_utc": 1617755980.0,
            "replies": []
        },
        {
            "body": "As they say, time is money.",
            "author": "kiwii_x",
            "id": "gtmmzzv",
            "parent_id": "t3_mllaxq",
            "score": 3,
            "created_utc": 1617751731.0,
            "replies": []
        },
        {
            "body": ">Who’s the bad actor in the bowl in this situation? Doesn’t seem like me.\n\nDoesnt really matter does it.  He's not right for you so move on.  From this point on you are wasting your own time surely",
            "author": "lookingforlaughter",
            "id": "gtnzz93",
            "parent_id": "t3_mllaxq",
            "score": 3,
            "created_utc": 1617783299.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtmdsb5",
            "parent_id": "t3_mllaxq",
            "score": 5,
            "created_utc": 1617747084.0,
            "replies": [
                {
                    "body": "Hmm I like this idea of a bidding system. Thinking about becoming an intermediary and all of the sudden realizing that kind of sounds like a pimp. Oh well, capitalist dreams destroyed.",
                    "author": "TrumpsCovidfefe",
                    "id": "gtmmxdg",
                    "parent_id": "t1_gtmdsb5",
                    "score": 2,
                    "created_utc": 1617751695.0,
                    "replies": []
                },
                {
                    "body": "Why the wink?",
                    "author": "SassySugar4u",
                    "id": "gtmhk6q",
                    "parent_id": "t1_gtmdsb5",
                    "score": -1,
                    "created_utc": 1617749001.0,
                    "replies": [
                        {
                            "body": "Why NOT the wink?",
                            "author": "timrid",
                            "id": "gtmmji6",
                            "parent_id": "t1_gtmhk6q",
                            "score": 3,
                            "created_utc": 1617751499.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Game theory is for gamers ......... \n\n Allowances are something that is agreeable to and honors both   balances the scale of what each brings to the table in terms of value to the other and what each expects to receive.",
                    "author": "pinotandsugar",
                    "id": "gtn5o5a",
                    "parent_id": "t1_gtmdsb5",
                    "score": -1,
                    "created_utc": 1617761277.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gtp5krn",
                            "parent_id": "t1_gtn5o5a",
                            "score": 1,
                            "created_utc": 1617809691.0,
                            "replies": [
                                {
                                    "body": ">\" Game theory is at the heart of modern understandings of contracts and negotiations. I pity that you don't know about it. It isn't at ALL about games/gamers.  \"\n\nI do appreciate the advice.  However, I was studying game theory at a well known eastern business school around the time yo mama was  trying to potty train you. But of more relevance to sugar arrangements is that you have illustrated one of two approaches to relationships. \n\nThe missing ingredients are an understanding of the mission and value.  \n\nThe wizards of wall street were smug in their financial markets of the 2006 era.  Game Theory flowed from multiple orifices.  They were the masters of the universe, making billions with complex financial transactions that were above mortal understanding. \n\nThey had, they proclaimed, repealed the laws of financial physics. I worked with them as part of my role as an adjunct faculty gig helping to organize several public programs on securitized finance.  \n\nThere was also a young grad student who also looked at the same financial markets, all the synthetic vehicles   and the fundamentals. He carefully traced the path from the homeowner getting a loan to the securitization, to the financial vehicles created by the banks and wall street to the bets placed for and against them. \n\nHis well researched analysis was that the housing finance market and the banking industry  were going to collapse with catastrophic global consequences. He was having difficulty raising capital for a fund that would bet against the tycoons of Wall Street,  but finally was successful. Unfortunately, unlike prior abuses of the markets, the then administration decided that the Wizards were so important they should not serve  the hard time they deserved. \n\n Only 18 months later the grad student  had, according to The Economist, the highest performing hedge fund in the world while many of the banks were just looking to survive. The masters of the financial universe were crushed along with their clients.  His farewell letter to wall street, published in the WSJ and other national/international journals was a classic. \n\nHe returned from self imposed exile a few  years ago with another well researched , out of the box , idea and strategy.  Today an investment of $1,000 is worth $ 30,000 , throughout ,the investment has been secured with physical ownership and possession of an un-leveraged commodity.  The relevance to sugar is that the primary focus  should be on a methodical analysis of what is  important (creates value)  to you and only then search to find someone whose characteristics best fit your needs with a minimum of conflict areas. \n\n The relevance to Arrangements is finding success through recognition of value rather than playing with game theory.  There's also the matter of the allowance you deliver and the way you treat an SB will eventually be reflected in her relationship with you. \n\n It is a lesson far too many SD fail to learn until  the have suffered from the  \"allowance is everything\" SB sticking and the quality, broader relationship seeking SB's having disappeared into the arms of an SD who understood value in a relationship and that relationships seldom flower when they are not mutually beneficial.\n\nI regret that I have no interest in another Porsche",
                                    "author": "pinotandsugar",
                                    "id": "gtpf2ap",
                                    "parent_id": "t1_gtp5krn",
                                    "score": 0,
                                    "created_utc": 1617813764.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He should have been forthcoming with the PPM numbers, but the rest of this is based on a lot of assumptions.\n\nYou \"got the sense\" that he would be a prolific texter, but he didn't \"expect hours of texting\" or \"engage in countless hours of texting\" in reality.\n\nNor did he owe you an Amazon gift.\n\nWeird flex overall.",
            "author": null,
            "id": "gtmu456",
            "parent_id": "t3_mllaxq",
            "score": 6,
            "created_utc": 1617755378.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtmx7q0",
                    "parent_id": "t1_gtmu456",
                    "score": 7,
                    "created_utc": 1617756964.0,
                    "replies": [
                        {
                            "body": "maybe, maybe not",
                            "author": null,
                            "id": "gtn3i47",
                            "parent_id": "t1_gtmx7q0",
                            "score": 2,
                            "created_utc": 1617760145.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gtn4b44",
                                    "parent_id": "t1_gtn3i47",
                                    "score": 2,
                                    "created_utc": 1617760559.0,
                                    "replies": [
                                        {
                                            "body": "In the context of SA, a certain amount of banter before a M&G is pretty normal. but usually I would expect it to taper off once two people have either made plans to meet, or decided that for whatever reason it wouldn't work.\n\nIn this case it sounds like OP was hoping (to herself, without ever discussing it with this guy) that she would get paid for her time texting with him\\*, decided she wouldn't, decided that made him cheap, and then came on SLF to crow about shutting him down over PPM negotiations.\n\nMy main point is just that this scenario never even played itself out.\n\nA second point would be that getting paid for a texting-only relationship isn't really part of this sub (there are other subs for that).\n\nInstead, I would expect a message like \"hey, when you're ready to meet let me know\" and just not responding to excessive texts would be a fine way to handle it. Again, we will never know because this whole thing only lasted 15 minutes.\n\nThe use of the word \"imagine\" in this line is telling: \"Imagine expecting hours of texting with a woman you’ve never met or given anything to ....that doesn’t make you a SD, it makes you a user trying to take advantage of someone.\"\n\nIn fact, in this case it was OP doing the imagining.  Maybe she was right, but maybe not.\n\nFinal note: OP's profile asks for Amazon gifts in exchange for \\_Reddit DMs\\_.\\*\\* This is not sugar in the SLF sense. \n\n\\*\"unless he’s being as generous with his resources as I am with my texting time\"\n\n\\*\\*\"No DMs for chats unless you’re ready to buy me a treat! \"",
                                            "author": null,
                                            "id": "gtoc158",
                                            "parent_id": "t1_gtn4b44",
                                            "score": 1,
                                            "created_utc": 1617794333.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "r/niceguys in the sugar world.",
            "author": "Cdnsugarr",
            "id": "gtmj4xd",
            "parent_id": "t3_mllaxq",
            "score": 2,
            "created_utc": 1617749796.0,
            "replies": []
        },
        {
            "body": "This. This. This. They’re just lonely, time wasters. 🙄 Very annoying.",
            "author": "Guilty_Goose6170",
            "id": "gtn35zp",
            "parent_id": "t3_mllaxq",
            "score": 2,
            "created_utc": 1617759973.0,
            "replies": []
        },
        {
            "body": "You should have texted him an outrageously high amount and see if he agrees or not 🤷‍♂️😂🤷‍♂️",
            "author": "Truckcanman2",
            "id": "gtn8iv2",
            "parent_id": "t3_mllaxq",
            "score": 2,
            "created_utc": 1617762814.0,
            "replies": [
                {
                    "body": "Lol I should!!\n\nNext time some twat wants to play chicken or go I’ll respond “2000 dollhairs  Monsieurrrrrrr, and I won’t take no for an answer”",
                    "author": "SassySugar4u",
                    "id": "gtn9dgm",
                    "parent_id": "t1_gtn8iv2",
                    "score": 3,
                    "created_utc": 1617763278.0,
                    "replies": [
                        {
                            "body": "👍👍👍",
                            "author": "Truckcanman2",
                            "id": "gtn9xvt",
                            "parent_id": "t1_gtn9dgm",
                            "score": 1,
                            "created_utc": 1617763595.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "A lot of valid points especially from SB's here.  For those of us who aren't novices though a few texts, M&G, then go from there is easy.  \n\nHowever if there's a pre-pay request (before meeting initially) that's a hard no, or if neither person is as advertised then that's the end of that.  With respect to ROI, and time value of money, I will say that most SB's have no  problems with being late (including standing up a potential SD, or being very late) while completely ignoring the fact that they insist a SB's time is priceless.  SD's time be damned I guess, because frequently SB's are late, or often stand men up, so what's the ROI on that?  Honest questions and a lot of the answers don't make sense.",
            "author": "Snoo71180",
            "id": "gtoi68l",
            "parent_id": "t3_mllaxq",
            "score": 2,
            "created_utc": 1617798374.0,
            "replies": []
        },
        {
            "body": "You guys need to take a class in negotiating.  Making the first offer (and anchoring low if a SD / high if A SB) is an advantage in negotiations — this is fairly universally agreed upon.\n\nI still try to get a girl to go first.  Not because I’m trying to negotiate, but because I want to see if she is an adult not worried about talking about money.  Few do, and then I make an offer.\n\nBy the way, I DO think OP is handling this too much like a negotiation.  If your goal is to min/Max/optimize, you may bit have the best experiences in the long run.",
            "author": "AnonAccountSexyTime",
            "id": "gtojgk4",
            "parent_id": "t3_mllaxq",
            "score": 2,
            "created_utc": 1617799112.0,
            "replies": []
        },
        {
            "body": "Best to stay away from guys who are too shy or embarrassed to tell you their PPM/allowance.",
            "author": "uniballSD",
            "id": "gtmefzd",
            "parent_id": "t3_mllaxq",
            "score": 5,
            "created_utc": 1617747417.0,
            "replies": [
                {
                    "body": "Quite! \nImagine been too much of a little baby to reveal your number 😂 I think he is just salty that I went there first lol",
                    "author": "SassySugar4u",
                    "id": "gtmhgsr",
                    "parent_id": "t1_gtmefzd",
                    "score": 0,
                    "created_utc": 1617748952.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gtmahvf",
            "parent_id": "t3_mllaxq",
            "score": 2,
            "created_utc": 1617745494.0,
            "replies": [
                {
                    "body": "My comment was drawing attention to the fact that many SD will talk to the ends of the earth about sugaring being amazing and authentic, but escorting being horrible.",
                    "author": "SassySugar4u",
                    "id": "gtmbf5b",
                    "parent_id": "t1_gtmahvf",
                    "score": 5,
                    "created_utc": 1617745932.0,
                    "replies": [
                        {
                            "body": "Trust me...Im the first to call out SD's who say that shit for being delusional.",
                            "author": "AlaskanSnowDragon",
                            "id": "gtmbm6t",
                            "parent_id": "t1_gtmbf5b",
                            "score": 2,
                            "created_utc": 1617746027.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gtmcot4",
                                    "parent_id": "t1_gtmbm6t",
                                    "score": -7,
                                    "created_utc": 1617746543.0,
                                    "replies": [
                                        {
                                            "body": "We're not talking about all...we're talking about the terminology you use.",
                                            "author": "AlaskanSnowDragon",
                                            "id": "gtmdu0g",
                                            "parent_id": "t1_gtmcot4",
                                            "score": 0,
                                            "created_utc": 1617747107.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Not you again?! Second post of yours i’ve seen along these lines and it’s not okay.\n\nIt. Is. Not. Just. Sex. For. Money.",
                    "author": "Gee_n_tonic",
                    "id": "gtmenxo",
                    "parent_id": "t1_gtmahvf",
                    "score": -5,
                    "created_utc": 1617747529.0,
                    "replies": [
                        {
                            "body": "Then SB's need to be consistent in how they view and discuss it.  Because PPMs, hooking up on first/second meeting, SBs admitting they dont find their SDs attractive, talking about ROI like OP...Sounds like sex work.\n\nSo there needs to be some reconciling in language and approach because you may like to say its not **JUST** sex for money.  But it is **MOSTLY** sex for money.\n\nNo doubt you're gonna disagree, but we'll just have to agree to disagree then.",
                            "author": "AlaskanSnowDragon",
                            "id": "gtmf76r",
                            "parent_id": "t1_gtmenxo",
                            "score": 1,
                            "created_utc": 1617747800.0,
                            "replies": [
                                {
                                    "body": "Why does the responsibility fall to SBs?\n\nAll of my SDs wanted to start with PPM and to hook up almost immediately. It takes two to tango.",
                                    "author": "Gee_n_tonic",
                                    "id": "gtmhjx2",
                                    "parent_id": "t1_gtmf76r",
                                    "score": 8,
                                    "created_utc": 1617748997.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gtmhvz3",
                                            "parent_id": "t1_gtmhjx2",
                                            "score": 0,
                                            "created_utc": 1617749166.0,
                                            "replies": [
                                                {
                                                    "body": "Seriously?! 🙄 More SBs than SDs think this way? Did you do a poll?  Or you’re just pulling shit out of thin air? \n\nSugar dating is a FORM of sw. So is cam-ing. So is onlyfans. It’s all under the umbrella of sw. \n\nAnd anyway, who cares how one defines it. Society views all of that as taboo and we’re all going to hell for being in the sugar life.",
                                                    "author": "ExExpectations",
                                                    "id": "gtmkpul",
                                                    "parent_id": "t1_gtmhvz3",
                                                    "score": 9,
                                                    "created_utc": 1617750596.0,
                                                    "replies": [
                                                        {
                                                            "body": "\\*\\*\\*bows down to the TRUTH\\*\\*\\*\\*\\*",
                                                            "author": "mischiefmolly",
                                                            "id": "gtmw5rb",
                                                            "parent_id": "t1_gtmkpul",
                                                            "score": 3,
                                                            "created_utc": 1617756422.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "gtml5pb",
                                                            "parent_id": "t1_gtmkpul",
                                                            "score": -1,
                                                            "created_utc": 1617750817.0,
                                                            "replies": [
                                                                {
                                                                    "body": "🙄🙄🙄 look no further than SLF to see that’s not true at all. Men of SLF are always saying it’s not sw.",
                                                                    "author": "ExExpectations",
                                                                    "id": "gtmlbvz",
                                                                    "parent_id": "t1_gtml5pb",
                                                                    "score": 8,
                                                                    "created_utc": 1617750904.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "They can keep telling themselves that as long as they’re paying",
                                                                            "author": "scumbagprincess1991",
                                                                            "id": "gtmw0a1",
                                                                            "parent_id": "t1_gtmlbvz",
                                                                            "score": 3,
                                                                            "created_utc": 1617756344.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Paying. But it’s not a form of sw! \n\nOh the irony 😂",
                                                                                    "author": "ExExpectations",
                                                                                    "id": "gtmzazy",
                                                                                    "parent_id": "t1_gtmw0a1",
                                                                                    "score": 2,
                                                                                    "created_utc": 1617758030.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[deleted]",
                                                                                            "author": null,
                                                                                            "id": "gtn455l",
                                                                                            "parent_id": "t1_gtmzazy",
                                                                                            "score": 2,
                                                                                            "created_utc": 1617760472.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Same. \n\nBut what goes on here, does affect what happens out there too, to some degree. Sometimes much more than I/we want (and largely in quite negative ways, to SBs)...",
                                                                                                    "author": "ExExpectations",
                                                                                                    "id": "gtn4qtw",
                                                                                                    "parent_id": "t1_gtn455l",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1617760790.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "[deleted]",
                                                                                                            "author": null,
                                                                                                            "id": "gtn5p3d",
                                                                                                            "parent_id": "t1_gtn4qtw",
                                                                                                            "score": 2,
                                                                                                            "created_utc": 1617761292.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "To be clear, I’ve only been within the sugar world. Not escort or onlyfans or other types of sw.\n\nI agree though, many men aren’t exactly SDs... :(",
                                                                                                                    "author": "ExExpectations",
                                                                                                                    "id": "gtn6gen",
                                                                                                                    "parent_id": "t1_gtn5p3d",
                                                                                                                    "score": 2,
                                                                                                                    "created_utc": 1617761704.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "[deleted]",
                                                                                                                            "author": null,
                                                                                                                            "id": "gtn7ijj",
                                                                                                                            "parent_id": "t1_gtn6gen",
                                                                                                                            "score": 2,
                                                                                                                            "created_utc": 1617762267.0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "body": "For sure I’ve had been in “relationships” with Johnny or John-Lites masquerading as SDs. Sigh.\n\nDefinitely overlaps in the Venn.",
                                                                                                                                    "author": "ExExpectations",
                                                                                                                                    "id": "gtn9192",
                                                                                                                                    "parent_id": "t1_gtn7ijj",
                                                                                                                                    "score": 3,
                                                                                                                                    "created_utc": 1617763093.0,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "And those guys are delusional",
                                                                            "author": "AlaskanSnowDragon",
                                                                            "id": "gtmlv5y",
                                                                            "parent_id": "t1_gtmlbvz",
                                                                            "score": -1,
                                                                            "created_utc": 1617751167.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "You’re completely contradictory. Just enjoy picking on the women eh? 🤦🏻‍♀️🤦🏻‍♀️ Goodbye. Blocking you.",
                                                                                    "author": "ExExpectations",
                                                                                    "id": "gtmmb6b",
                                                                                    "parent_id": "t1_gtmlv5y",
                                                                                    "score": 1,
                                                                                    "created_utc": 1617751382.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "😘",
                                                                                            "author": "AlaskanSnowDragon",
                                                                                            "id": "gtmmf0p",
                                                                                            "parent_id": "t1_gtmmb6b",
                                                                                            "score": 0,
                                                                                            "created_utc": 1617751437.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": ">And any SD who says its not sex for money is delusional too.\n\nIt's not sex for money",
                                                    "author": "mraspencer",
                                                    "id": "gtmv32y",
                                                    "parent_id": "t1_gtmhvz3",
                                                    "score": 1,
                                                    "created_utc": 1617755870.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree! Sounds like you two are playing the \"who goes first\" game. I agree with you that there are better ways to negotiate, and that SD was a jerk.",
            "author": "emptyoverflow",
            "id": "gtmdkse",
            "parent_id": "t3_mllaxq",
            "score": 2,
            "created_utc": 1617746979.0,
            "replies": [
                {
                    "body": "It doesn’t “sound like” that. That IS what is was.\n\nExcept if you don’t want to go first then you better be the first to ask, and he wasn’t lol",
                    "author": "SassySugar4u",
                    "id": "gtmhe7j",
                    "parent_id": "t1_gtmdkse",
                    "score": -1,
                    "created_utc": 1617748916.0,
                    "replies": [
                        {
                            "body": "> It doesn’t “sound like” that. That IS what is was.\n\nThat's what I thought I was saying.",
                            "author": "emptyoverflow",
                            "id": "gtmod0c",
                            "parent_id": "t1_gtmhe7j",
                            "score": 3,
                            "created_utc": 1617752422.0,
                            "replies": [
                                {
                                    "body": "Ok, so you wrote a response to paraphrase me? Thank youuuuu for your ...contribution? 🥰",
                                    "author": "SassySugar4u",
                                    "id": "gtmqz0i",
                                    "parent_id": "t1_gtmod0c",
                                    "score": -2,
                                    "created_utc": 1617753775.0,
                                    "replies": [
                                        {
                                            "body": "Commenters paraphrase OPs when they strongly agree with them. I agreed with you, but I guess I phrased it poorly. Sorry to bother you.",
                                            "author": "emptyoverflow",
                                            "id": "gtmzm9e",
                                            "parent_id": "t1_gtmqz0i",
                                            "score": 5,
                                            "created_utc": 1617758191.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If a person is willing to text endlessly, and they do not treat texting as a vehicle to help them reach a destination, they might just be enjoying the ride.",
            "author": null,
            "id": "gtmodbe",
            "parent_id": "t3_mllaxq",
            "score": 2,
            "created_utc": 1617752427.0,
            "replies": [
                {
                    "body": "It’s almost like that’s what I was saying in my post?  🧐🤔🧐",
                    "author": "SassySugar4u",
                    "id": "gtmok4n",
                    "parent_id": "t1_gtmodbe",
                    "score": 4,
                    "created_utc": 1617752525.0,
                    "replies": [
                        {
                            "body": "Sometimes, respondents wholeheartedly agree with OP, and their reaction may sound like they're paraphrasing OP.  I aimed for my post to accessorize—not dilute—the topic you brilliantly shared.  I accept the possibility that I failed.",
                            "author": null,
                            "id": "gtmwfyb",
                            "parent_id": "t1_gtmok4n",
                            "score": 2,
                            "created_utc": 1617756566.0,
                            "replies": [
                                {
                                    "body": "I got your intent.",
                                    "author": "BlissfulSB",
                                    "id": "gtn4yvs",
                                    "parent_id": "t1_gtmwfyb",
                                    "score": 3,
                                    "created_utc": 1617760908.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "For the most part, I agree with you. No real worthwhile SD is going to want to endlessly text. Also no good one will expect a negotiation angle to arrive at his end of the bargain.  I do agree however, with other posters who asked \"why the range\". I know you have given your reason, but speaking as an SD with a lot of positive experience, I don't want my initial PPM to be dependent on a time constraint. I know what I am willing to give and it does not change with age or physical attributes. I start with a specific amount and as things progress, it is likely to get better as the relationship grows. Very simple and fully disclosed immediately during texts PRIOR to meeting for the first time.",
            "author": "Teejaynj",
            "id": "gtmwtg6",
            "parent_id": "t3_mllaxq",
            "score": 1,
            "created_utc": 1617756757.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtmcq48",
            "parent_id": "t3_mllaxq",
            "score": 1,
            "created_utc": 1617746561.0,
            "replies": [
                {
                    "body": "I discerned the situation within 15 minutes. But thanks.",
                    "author": "SassySugar4u",
                    "id": "gtmharv",
                    "parent_id": "t1_gtmcq48",
                    "score": -1,
                    "created_utc": 1617748867.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fuck i am doing this wrong or else I'm just bored. I spend a lot of time texting people just for the fun of it.",
            "author": "TrumpsCovidfefe",
            "id": "gtmmnip",
            "parent_id": "t3_mllaxq",
            "score": 1,
            "created_utc": 1617751555.0,
            "replies": []
        },
        {
            "body": "I get so annoyed when I ask a common sugar question like that, they don’t answer, then ask me the question back. It never goes well after that.",
            "author": "garret6758",
            "id": "gtn04h4",
            "parent_id": "t3_mllaxq",
            "score": 1,
            "created_utc": 1617758441.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtmtiq5",
            "parent_id": "t3_mllaxq",
            "score": 0,
            "created_utc": 1617755071.0,
            "replies": []
        },
        {
            "body": "what’s a pot?",
            "author": "Alternative-Waters",
            "id": "gtmj2vu",
            "parent_id": "t3_mllaxq",
            "score": -1,
            "created_utc": 1617749767.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtntxdy",
                    "parent_id": "t1_gtmj2vu",
                    "score": 2,
                    "created_utc": 1617777586.0,
                    "replies": [
                        {
                            "body": "lmfao thank you no idea why i got downvoted for asking a simple question i’m new to this sub but a long time sb 😭💀💀",
                            "author": "Alternative-Waters",
                            "id": "gtofl07",
                            "parent_id": "t1_gtntxdy",
                            "score": 2,
                            "created_utc": 1617796770.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am going to church right now to thank the Lord that my SB is the opposite of you - kind, courteous, appreciative, and most importantly, not jaded.",
            "author": "IAMDIRECT",
            "id": "gtmfxz1",
            "parent_id": "t3_mllaxq",
            "score": -11,
            "created_utc": 1617748173.0,
            "replies": [
                {
                    "body": "Sorry ...couldn’t hear you over the sound of Satan calling me back to his lair 😂😂😂",
                    "author": "SassySugar4u",
                    "id": "gtmiewg",
                    "parent_id": "t1_gtmfxz1",
                    "score": 6,
                    "created_utc": 1617749432.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Don’t wast time with long distance start ups.  If someone won’t meet they are not going to give you a real arrangement.  Works both ways.",
            "author": "RedHeavyG603",
            "id": "gtn9q97",
            "parent_id": "t3_mllaxq",
            "score": 1,
            "created_utc": 1617763476.0,
            "replies": []
        },
        {
            "body": "It’s been awhile since I’ve done this in any meaningful way. However may I ask why SBs wouldn’t set the tone or the lead with the following: \nA few good pictures. At least one full,body shot and one smiling. Keep it brief and upbeat. Put in the profile to contact you. In the profile state up front that you don’t want to text initially. Get a Google number and set up a meet and greet at a nice place. If they cancel twice then next them. Near the sugar baby’s home or in the middle. Before you meet have one long phone call where the SB is effectively prescreening before they meet. Have a seemingly organic cOnversation. Don’t ask about what they do or family or anything like that. Teasingly say I know you are successful but if you won 3xs what you make what would you do with it? The answers will naturally spark a convo and in many ways he will be qualifying himself. He will talk about boats if he has them or had them. Skiing, would he start a restaurant cause he is a foodie? Or is he strictly middle management? All will be revealed within the conversation. If he comes up light then later regretfully break the date and be polite. If you get a good vibe then end the call in less than a hour with the objective of setting up the M&G.  Less time is wasted for you. If he is not interested enough to wait for a second or third date then he is not interested enough period.\n\nOnce you qualify him during that initial phone conversation, then you tell him what you are looking for in a allowance , how and when you need it. Let him know you will send this via email after the date. Don’t ask for money but make sure you don’t go to far out of the way for him either. Choose a great place that YOU want to go to. Make sure it is close to home. Keep it light, sexy and touch him unnecessarily. Don’t use the word dont, won’t or hate. Don’t let him nor you, talk about ex’s or the sucky bowl. Don’t talk about work. Keep the convo soft focus and slightly naughty. Talk about the future, things you both love to do,or want to try. At the end of the date, no more than three hours if you are having fun, end the date. Lean into him and make out like teenagers in the parking lot then go home. If he wants you he will contact you and there will be a second or third date. Leave him with something to want. \n\nIf he does NOT contact you you did not put out for nothing in a sense. Unless you don’t mind doing Pay per play sessions. You did not drive that far and you had a great meal. It takes less time and aggravation to do that than endless texting that peters out. If he can’t take you to a nice place without hedging then he can’t afford what you want. Again you qualified him. You set the tone by having subtle sequential steps that you set up and drive forward. Energy and excitement needs to be created and men are visual and action oriented so SB has to know how to amp up sexual tension and how to close the deal. To be blunt give him some green lights. \n\nAlso these things seldom last more than a year. 6 months is the average. Time is really on the SB side for about 6 months. Typically that is when they are the hottest for you. It’s just nature unless the SB is unusually adept at extending these situations. So again to be blunt the SB is most likely to get what she wants within the first three months. Money, a trip, a class whatever, that is when a SD will put out. \nSo in like a lion, out like a lamb. Not the other way around. \n\nInstead of texting send a cute photo of yourself whatever you are doing. No full nudes. Provoke a little jealousy by letting him see you smile at other men but not disrespectfully. Ask how he likes women to dress when he is out that way and actually DRESS that way. Ask him if he likes the out fit, you wore it for him. \nIt’s up to the SB IMO to set the pace and mix it up. If he only does indoors make damn sure you are going to high end hotels and that you order in for the next 24 hrs. Even if he has to go make sure you keep the room. Order breakfast in with champagne, get in that hot tub. Tell him you saw that they had a spa there and you would like to have both of you go or they come to the room. Have a sushi night where you get buzzed on saki and he eats sushi off your naked body. It’s corny but amusing. If he mentions he loved smoking pot but hasn’t done it in years, next time you meet have a big blunt rolled, vape or whatever. Just start smoking it in a place that is safe and secure. Tell him weed makes you extra wild and that you know he loves it but hadn’t smoked in a while. Have a munchie basket set aside. \n\nIf he can’t or won’t afford what YOU want, what ever that is then you should know by the second date if it gets that far. I would keep track of them to. There is not a infinite pool,of qualified SD out there if SB are just using this medium to meet. Eventually the same top tier of the SD and SB will be recycled until new talent comes in. Personally I would try and have 2 or three SDs that I would see a month. \n\nI agree with sassysugar’s approach for the most part. \n\nThe crux is its a business it just can’t be presented as such. Entertainment is big business and a human need. 🤷‍♂️",
            "author": "sunlightonthewater",
            "id": "h1l6g3r",
            "parent_id": "t3_mllaxq",
            "score": 1,
            "created_utc": 1623557466.0,
            "replies": []
        },
        {
            "body": "I don't get the whole range thing either.  If an SB gives me a range, kneejerk reaction is to say \"I got you on $X\".  If I give her a range, of course I expect her to say \"$Y is good for me\".  And putting myself in a POT SB's shoes, she has every right to feel bad if I tell her \"I give my SBs anywhere from $X to $Y\", and then I offer her the very bottom of the range.\n\nTo me the whole range thing feels like just more game-playing because someone feels \"awkward\".  What I've found makes me the most comfortable is that I give my offer first, and it's $Z, not a range.  And as debated ad nauseum in other threads, I'm totally open if she wants to suggest something else.",
            "author": "Azurecole",
            "id": "gtmhwcm",
            "parent_id": "t1_gtmcda8",
            "score": 24,
            "created_utc": 1617749171.0,
            "replies": [
                {
                    "body": "Similar to salary negotiations. Why offer a range?  Nobody will be happy unless they get the top end.",
                    "author": "timrid",
                    "id": "gtmm8fr",
                    "parent_id": "t1_gtmhwcm",
                    "score": 9,
                    "created_utc": 1617751344.0,
                    "replies": []
                },
                {
                    "body": "The only time I think a range makes sense is when it's contingent on certain extras. I've had some arrangements where on top of my PPM I was given a lot of expensive gifts, taken on trips, went to shows, etc. I'm willing to go for a slightly lower amount in that situation. Conversely, I've insisted on higher PPMs from people who lived far away as I had to factor 2+ hours of driving into the equation. So a range *can* make sense if there is justification as to what is expected from the top and bottom end of it.",
                    "author": "clashingtaco",
                    "id": "gtnbngp",
                    "parent_id": "t1_gtmhwcm",
                    "score": 10,
                    "created_utc": 1617764554.0,
                    "replies": [
                        {
                            "body": "Tbh I’d rather just have an average number without all the extras. Those extras aren’t guaranteed and you can make a separate agreement on gifts or trips. To me a gift is a gift because you wanted to do something special, not because you are going to factor it into the ppm. Are kinky or extra sexual acts that make my SD feel special extra? No I do it cause I know he likes it it’s not a tit for tat to me that’s off putting and transactional",
                            "author": "PrettyFlyForABlasian",
                            "id": "gtnh2cp",
                            "parent_id": "t1_gtnbngp",
                            "score": 4,
                            "created_utc": 1617767826.0,
                            "replies": [
                                {
                                    "body": "I think it's very situational. I've had SDs who preferred to buy me things/pay bills directly, as if it was sort of a fetish of theirs, so I was okay with getting more gifts for a lower PPM even though I typically prefer cash. Gifts here and there are one thing but large ticket items every week is something I'll negotiate my PPM for.",
                                    "author": "clashingtaco",
                                    "id": "gtni8t3",
                                    "parent_id": "t1_gtnh2cp",
                                    "score": 2,
                                    "created_utc": 1617768585.0,
                                    "replies": [
                                        {
                                            "body": "To each their own. As long as it’s what you both want and consensual it’s fair game.",
                                            "author": "PrettyFlyForABlasian",
                                            "id": "gtnlyss",
                                            "parent_id": "t1_gtni8t3",
                                            "score": 0,
                                            "created_utc": 1617771121.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I do not believe it is in either party's interest to discuss a specific number before a meeting .  YES   verify that she is pursuing an intimate arrangement and YES  he is prepared to provide an allowance ( perhaps  a broad range) .  \n\nAs the other party noted in a business transaction,  I could name the price if he got to name the terms (after I set the price) \n\nThe reason for my hesitancy to discuss this with someone I have not met is not so much wanting to see them in real life but rather to communicate where words, facial expressions and body language are all available for interpretation. \n\nAlso the M&G is an opportunity to discover added attractions of the other party.  Finally it is a place to discuss the \"rules of the road\" in terms expectations, limitations  etc. Finally a way to find creative bridges across areas where there is not full agreement .  \n\nOne example was (some time ago when it was more traditional to monthly allowance) that this worked with a half month prior to  initial intimacy  and converted to the equivalent of a monthly allowance repeated every 4th meeting (discourages cancellations that are not infrequent with monthly allowance) \n\n(( a note to SB   there are 13   4 week periods in a year.  For the reliable this is an extra allowance period per year)) \n\nLastly,  I think discussing and then seeking a common agreement in real time and having met the person is much more likely to result in a lasting relationship.",
            "author": "pinotandsugar",
            "id": "gtn4osy",
            "parent_id": "t1_gtmcda8",
            "score": 4,
            "created_utc": 1617760761.0,
            "replies": []
        },
        {
            "body": "Interesting. So is the number you are comfortable with the lower X or higher Y?",
            "author": "uniballSD",
            "id": "gtmdqgb",
            "parent_id": "t1_gtmcda8",
            "score": 3,
            "created_utc": 1617747057.0,
            "replies": [
                {
                    "body": "(x+y)/2 lol",
                    "author": "scumbagprincess1991",
                    "id": "gtmv582",
                    "parent_id": "t1_gtmdqgb",
                    "score": 4,
                    "created_utc": 1617755900.0,
                    "replies": [
                        {
                            "body": "😂🤣",
                            "author": "PrettyFlyForABlasian",
                            "id": "gtnjh4q",
                            "parent_id": "t1_gtmv582",
                            "score": 1,
                            "created_utc": 1617769412.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "it's literally the first thing you learn in negotiations.  No one hears the higher or lower number, depending on whether you're on the side of buying or selling.",
            "author": null,
            "id": "gtp3jrc",
            "parent_id": "t1_gtmcda8",
            "score": 0,
            "created_utc": 1617808805.0,
            "replies": []
        },
        {
            "body": "After he didn’t respond I wrote back w “cheers” Ans then blocked him on Seeking",
            "author": "SassySugar4u",
            "id": "gtmafih",
            "parent_id": "t1_gtma2zy",
            "score": 9,
            "created_utc": 1617745462.0,
            "replies": []
        },
        {
            "body": "Hence my post",
            "author": "SassySugar4u",
            "id": "gtmqwe8",
            "parent_id": "t1_gtmq4q6",
            "score": 5,
            "created_utc": 1617753737.0,
            "replies": []
        },
        {
            "body": "Hmm I like this idea of a bidding system. Thinking about becoming an intermediary and all of the sudden realizing that kind of sounds like a pimp. Oh well, capitalist dreams destroyed.",
            "author": "TrumpsCovidfefe",
            "id": "gtmmxdg",
            "parent_id": "t1_gtmdsb5",
            "score": 2,
            "created_utc": 1617751695.0,
            "replies": []
        },
        {
            "body": "Why the wink?",
            "author": "SassySugar4u",
            "id": "gtmhk6q",
            "parent_id": "t1_gtmdsb5",
            "score": -1,
            "created_utc": 1617749001.0,
            "replies": [
                {
                    "body": "Why NOT the wink?",
                    "author": "timrid",
                    "id": "gtmmji6",
                    "parent_id": "t1_gtmhk6q",
                    "score": 3,
                    "created_utc": 1617751499.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Game theory is for gamers ......... \n\n Allowances are something that is agreeable to and honors both   balances the scale of what each brings to the table in terms of value to the other and what each expects to receive.",
            "author": "pinotandsugar",
            "id": "gtn5o5a",
            "parent_id": "t1_gtmdsb5",
            "score": -1,
            "created_utc": 1617761277.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtp5krn",
                    "parent_id": "t1_gtn5o5a",
                    "score": 1,
                    "created_utc": 1617809691.0,
                    "replies": [
                        {
                            "body": ">\" Game theory is at the heart of modern understandings of contracts and negotiations. I pity that you don't know about it. It isn't at ALL about games/gamers.  \"\n\nI do appreciate the advice.  However, I was studying game theory at a well known eastern business school around the time yo mama was  trying to potty train you. But of more relevance to sugar arrangements is that you have illustrated one of two approaches to relationships. \n\nThe missing ingredients are an understanding of the mission and value.  \n\nThe wizards of wall street were smug in their financial markets of the 2006 era.  Game Theory flowed from multiple orifices.  They were the masters of the universe, making billions with complex financial transactions that were above mortal understanding. \n\nThey had, they proclaimed, repealed the laws of financial physics. I worked with them as part of my role as an adjunct faculty gig helping to organize several public programs on securitized finance.  \n\nThere was also a young grad student who also looked at the same financial markets, all the synthetic vehicles   and the fundamentals. He carefully traced the path from the homeowner getting a loan to the securitization, to the financial vehicles created by the banks and wall street to the bets placed for and against them. \n\nHis well researched analysis was that the housing finance market and the banking industry  were going to collapse with catastrophic global consequences. He was having difficulty raising capital for a fund that would bet against the tycoons of Wall Street,  but finally was successful. Unfortunately, unlike prior abuses of the markets, the then administration decided that the Wizards were so important they should not serve  the hard time they deserved. \n\n Only 18 months later the grad student  had, according to The Economist, the highest performing hedge fund in the world while many of the banks were just looking to survive. The masters of the financial universe were crushed along with their clients.  His farewell letter to wall street, published in the WSJ and other national/international journals was a classic. \n\nHe returned from self imposed exile a few  years ago with another well researched , out of the box , idea and strategy.  Today an investment of $1,000 is worth $ 30,000 , throughout ,the investment has been secured with physical ownership and possession of an un-leveraged commodity.  The relevance to sugar is that the primary focus  should be on a methodical analysis of what is  important (creates value)  to you and only then search to find someone whose characteristics best fit your needs with a minimum of conflict areas. \n\n The relevance to Arrangements is finding success through recognition of value rather than playing with game theory.  There's also the matter of the allowance you deliver and the way you treat an SB will eventually be reflected in her relationship with you. \n\n It is a lesson far too many SD fail to learn until  the have suffered from the  \"allowance is everything\" SB sticking and the quality, broader relationship seeking SB's having disappeared into the arms of an SD who understood value in a relationship and that relationships seldom flower when they are not mutually beneficial.\n\nI regret that I have no interest in another Porsche",
                            "author": "pinotandsugar",
                            "id": "gtpf2ap",
                            "parent_id": "t1_gtp5krn",
                            "score": 0,
                            "created_utc": 1617813764.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtmx7q0",
            "parent_id": "t1_gtmu456",
            "score": 7,
            "created_utc": 1617756964.0,
            "replies": [
                {
                    "body": "maybe, maybe not",
                    "author": null,
                    "id": "gtn3i47",
                    "parent_id": "t1_gtmx7q0",
                    "score": 2,
                    "created_utc": 1617760145.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gtn4b44",
                            "parent_id": "t1_gtn3i47",
                            "score": 2,
                            "created_utc": 1617760559.0,
                            "replies": [
                                {
                                    "body": "In the context of SA, a certain amount of banter before a M&G is pretty normal. but usually I would expect it to taper off once two people have either made plans to meet, or decided that for whatever reason it wouldn't work.\n\nIn this case it sounds like OP was hoping (to herself, without ever discussing it with this guy) that she would get paid for her time texting with him\\*, decided she wouldn't, decided that made him cheap, and then came on SLF to crow about shutting him down over PPM negotiations.\n\nMy main point is just that this scenario never even played itself out.\n\nA second point would be that getting paid for a texting-only relationship isn't really part of this sub (there are other subs for that).\n\nInstead, I would expect a message like \"hey, when you're ready to meet let me know\" and just not responding to excessive texts would be a fine way to handle it. Again, we will never know because this whole thing only lasted 15 minutes.\n\nThe use of the word \"imagine\" in this line is telling: \"Imagine expecting hours of texting with a woman you’ve never met or given anything to ....that doesn’t make you a SD, it makes you a user trying to take advantage of someone.\"\n\nIn fact, in this case it was OP doing the imagining.  Maybe she was right, but maybe not.\n\nFinal note: OP's profile asks for Amazon gifts in exchange for \\_Reddit DMs\\_.\\*\\* This is not sugar in the SLF sense. \n\n\\*\"unless he’s being as generous with his resources as I am with my texting time\"\n\n\\*\\*\"No DMs for chats unless you’re ready to buy me a treat! \"",
                                    "author": null,
                                    "id": "gtoc158",
                                    "parent_id": "t1_gtn4b44",
                                    "score": 1,
                                    "created_utc": 1617794333.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol I should!!\n\nNext time some twat wants to play chicken or go I’ll respond “2000 dollhairs  Monsieurrrrrrr, and I won’t take no for an answer”",
            "author": "SassySugar4u",
            "id": "gtn9dgm",
            "parent_id": "t1_gtn8iv2",
            "score": 3,
            "created_utc": 1617763278.0,
            "replies": [
                {
                    "body": "👍👍👍",
                    "author": "Truckcanman2",
                    "id": "gtn9xvt",
                    "parent_id": "t1_gtn9dgm",
                    "score": 1,
                    "created_utc": 1617763595.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Quite! \nImagine been too much of a little baby to reveal your number 😂 I think he is just salty that I went there first lol",
            "author": "SassySugar4u",
            "id": "gtmhgsr",
            "parent_id": "t1_gtmefzd",
            "score": 0,
            "created_utc": 1617748952.0,
            "replies": []
        },
        {
            "body": "My comment was drawing attention to the fact that many SD will talk to the ends of the earth about sugaring being amazing and authentic, but escorting being horrible.",
            "author": "SassySugar4u",
            "id": "gtmbf5b",
            "parent_id": "t1_gtmahvf",
            "score": 5,
            "created_utc": 1617745932.0,
            "replies": [
                {
                    "body": "Trust me...Im the first to call out SD's who say that shit for being delusional.",
                    "author": "AlaskanSnowDragon",
                    "id": "gtmbm6t",
                    "parent_id": "t1_gtmbf5b",
                    "score": 2,
                    "created_utc": 1617746027.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gtmcot4",
                            "parent_id": "t1_gtmbm6t",
                            "score": -7,
                            "created_utc": 1617746543.0,
                            "replies": [
                                {
                                    "body": "We're not talking about all...we're talking about the terminology you use.",
                                    "author": "AlaskanSnowDragon",
                                    "id": "gtmdu0g",
                                    "parent_id": "t1_gtmcot4",
                                    "score": 0,
                                    "created_utc": 1617747107.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not you again?! Second post of yours i’ve seen along these lines and it’s not okay.\n\nIt. Is. Not. Just. Sex. For. Money.",
            "author": "Gee_n_tonic",
            "id": "gtmenxo",
            "parent_id": "t1_gtmahvf",
            "score": -5,
            "created_utc": 1617747529.0,
            "replies": [
                {
                    "body": "Then SB's need to be consistent in how they view and discuss it.  Because PPMs, hooking up on first/second meeting, SBs admitting they dont find their SDs attractive, talking about ROI like OP...Sounds like sex work.\n\nSo there needs to be some reconciling in language and approach because you may like to say its not **JUST** sex for money.  But it is **MOSTLY** sex for money.\n\nNo doubt you're gonna disagree, but we'll just have to agree to disagree then.",
                    "author": "AlaskanSnowDragon",
                    "id": "gtmf76r",
                    "parent_id": "t1_gtmenxo",
                    "score": 1,
                    "created_utc": 1617747800.0,
                    "replies": [
                        {
                            "body": "Why does the responsibility fall to SBs?\n\nAll of my SDs wanted to start with PPM and to hook up almost immediately. It takes two to tango.",
                            "author": "Gee_n_tonic",
                            "id": "gtmhjx2",
                            "parent_id": "t1_gtmf76r",
                            "score": 8,
                            "created_utc": 1617748997.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gtmhvz3",
                                    "parent_id": "t1_gtmhjx2",
                                    "score": 0,
                                    "created_utc": 1617749166.0,
                                    "replies": [
                                        {
                                            "body": "Seriously?! 🙄 More SBs than SDs think this way? Did you do a poll?  Or you’re just pulling shit out of thin air? \n\nSugar dating is a FORM of sw. So is cam-ing. So is onlyfans. It’s all under the umbrella of sw. \n\nAnd anyway, who cares how one defines it. Society views all of that as taboo and we’re all going to hell for being in the sugar life.",
                                            "author": "ExExpectations",
                                            "id": "gtmkpul",
                                            "parent_id": "t1_gtmhvz3",
                                            "score": 9,
                                            "created_utc": 1617750596.0,
                                            "replies": [
                                                {
                                                    "body": "\\*\\*\\*bows down to the TRUTH\\*\\*\\*\\*\\*",
                                                    "author": "mischiefmolly",
                                                    "id": "gtmw5rb",
                                                    "parent_id": "t1_gtmkpul",
                                                    "score": 3,
                                                    "created_utc": 1617756422.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gtml5pb",
                                                    "parent_id": "t1_gtmkpul",
                                                    "score": -1,
                                                    "created_utc": 1617750817.0,
                                                    "replies": [
                                                        {
                                                            "body": "🙄🙄🙄 look no further than SLF to see that’s not true at all. Men of SLF are always saying it’s not sw.",
                                                            "author": "ExExpectations",
                                                            "id": "gtmlbvz",
                                                            "parent_id": "t1_gtml5pb",
                                                            "score": 8,
                                                            "created_utc": 1617750904.0,
                                                            "replies": [
                                                                {
                                                                    "body": "They can keep telling themselves that as long as they’re paying",
                                                                    "author": "scumbagprincess1991",
                                                                    "id": "gtmw0a1",
                                                                    "parent_id": "t1_gtmlbvz",
                                                                    "score": 3,
                                                                    "created_utc": 1617756344.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Paying. But it’s not a form of sw! \n\nOh the irony 😂",
                                                                            "author": "ExExpectations",
                                                                            "id": "gtmzazy",
                                                                            "parent_id": "t1_gtmw0a1",
                                                                            "score": 2,
                                                                            "created_utc": 1617758030.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "gtn455l",
                                                                                    "parent_id": "t1_gtmzazy",
                                                                                    "score": 2,
                                                                                    "created_utc": 1617760472.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Same. \n\nBut what goes on here, does affect what happens out there too, to some degree. Sometimes much more than I/we want (and largely in quite negative ways, to SBs)...",
                                                                                            "author": "ExExpectations",
                                                                                            "id": "gtn4qtw",
                                                                                            "parent_id": "t1_gtn455l",
                                                                                            "score": 2,
                                                                                            "created_utc": 1617760790.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "[deleted]",
                                                                                                    "author": null,
                                                                                                    "id": "gtn5p3d",
                                                                                                    "parent_id": "t1_gtn4qtw",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1617761292.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "To be clear, I’ve only been within the sugar world. Not escort or onlyfans or other types of sw.\n\nI agree though, many men aren’t exactly SDs... :(",
                                                                                                            "author": "ExExpectations",
                                                                                                            "id": "gtn6gen",
                                                                                                            "parent_id": "t1_gtn5p3d",
                                                                                                            "score": 2,
                                                                                                            "created_utc": 1617761704.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "[deleted]",
                                                                                                                    "author": null,
                                                                                                                    "id": "gtn7ijj",
                                                                                                                    "parent_id": "t1_gtn6gen",
                                                                                                                    "score": 2,
                                                                                                                    "created_utc": 1617762267.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "For sure I’ve had been in “relationships” with Johnny or John-Lites masquerading as SDs. Sigh.\n\nDefinitely overlaps in the Venn.",
                                                                                                                            "author": "ExExpectations",
                                                                                                                            "id": "gtn9192",
                                                                                                                            "parent_id": "t1_gtn7ijj",
                                                                                                                            "score": 3,
                                                                                                                            "created_utc": 1617763093.0,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "And those guys are delusional",
                                                                    "author": "AlaskanSnowDragon",
                                                                    "id": "gtmlv5y",
                                                                    "parent_id": "t1_gtmlbvz",
                                                                    "score": -1,
                                                                    "created_utc": 1617751167.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "You’re completely contradictory. Just enjoy picking on the women eh? 🤦🏻‍♀️🤦🏻‍♀️ Goodbye. Blocking you.",
                                                                            "author": "ExExpectations",
                                                                            "id": "gtmmb6b",
                                                                            "parent_id": "t1_gtmlv5y",
                                                                            "score": 1,
                                                                            "created_utc": 1617751382.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "😘",
                                                                                    "author": "AlaskanSnowDragon",
                                                                                    "id": "gtmmf0p",
                                                                                    "parent_id": "t1_gtmmb6b",
                                                                                    "score": 0,
                                                                                    "created_utc": 1617751437.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": ">And any SD who says its not sex for money is delusional too.\n\nIt's not sex for money",
                                            "author": "mraspencer",
                                            "id": "gtmv32y",
                                            "parent_id": "t1_gtmhvz3",
                                            "score": 1,
                                            "created_utc": 1617755870.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It doesn’t “sound like” that. That IS what is was.\n\nExcept if you don’t want to go first then you better be the first to ask, and he wasn’t lol",
            "author": "SassySugar4u",
            "id": "gtmhe7j",
            "parent_id": "t1_gtmdkse",
            "score": -1,
            "created_utc": 1617748916.0,
            "replies": [
                {
                    "body": "> It doesn’t “sound like” that. That IS what is was.\n\nThat's what I thought I was saying.",
                    "author": "emptyoverflow",
                    "id": "gtmod0c",
                    "parent_id": "t1_gtmhe7j",
                    "score": 3,
                    "created_utc": 1617752422.0,
                    "replies": [
                        {
                            "body": "Ok, so you wrote a response to paraphrase me? Thank youuuuu for your ...contribution? 🥰",
                            "author": "SassySugar4u",
                            "id": "gtmqz0i",
                            "parent_id": "t1_gtmod0c",
                            "score": -2,
                            "created_utc": 1617753775.0,
                            "replies": [
                                {
                                    "body": "Commenters paraphrase OPs when they strongly agree with them. I agreed with you, but I guess I phrased it poorly. Sorry to bother you.",
                                    "author": "emptyoverflow",
                                    "id": "gtmzm9e",
                                    "parent_id": "t1_gtmqz0i",
                                    "score": 5,
                                    "created_utc": 1617758191.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s almost like that’s what I was saying in my post?  🧐🤔🧐",
            "author": "SassySugar4u",
            "id": "gtmok4n",
            "parent_id": "t1_gtmodbe",
            "score": 4,
            "created_utc": 1617752525.0,
            "replies": [
                {
                    "body": "Sometimes, respondents wholeheartedly agree with OP, and their reaction may sound like they're paraphrasing OP.  I aimed for my post to accessorize—not dilute—the topic you brilliantly shared.  I accept the possibility that I failed.",
                    "author": null,
                    "id": "gtmwfyb",
                    "parent_id": "t1_gtmok4n",
                    "score": 2,
                    "created_utc": 1617756566.0,
                    "replies": [
                        {
                            "body": "I got your intent.",
                            "author": "BlissfulSB",
                            "id": "gtn4yvs",
                            "parent_id": "t1_gtmwfyb",
                            "score": 3,
                            "created_utc": 1617760908.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I discerned the situation within 15 minutes. But thanks.",
            "author": "SassySugar4u",
            "id": "gtmharv",
            "parent_id": "t1_gtmcq48",
            "score": -1,
            "created_utc": 1617748867.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtntxdy",
            "parent_id": "t1_gtmj2vu",
            "score": 2,
            "created_utc": 1617777586.0,
            "replies": [
                {
                    "body": "lmfao thank you no idea why i got downvoted for asking a simple question i’m new to this sub but a long time sb 😭💀💀",
                    "author": "Alternative-Waters",
                    "id": "gtofl07",
                    "parent_id": "t1_gtntxdy",
                    "score": 2,
                    "created_utc": 1617796770.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry ...couldn’t hear you over the sound of Satan calling me back to his lair 😂😂😂",
            "author": "SassySugar4u",
            "id": "gtmiewg",
            "parent_id": "t1_gtmfxz1",
            "score": 6,
            "created_utc": 1617749432.0,
            "replies": []
        },
        {
            "body": "Similar to salary negotiations. Why offer a range?  Nobody will be happy unless they get the top end.",
            "author": "timrid",
            "id": "gtmm8fr",
            "parent_id": "t1_gtmhwcm",
            "score": 9,
            "created_utc": 1617751344.0,
            "replies": []
        },
        {
            "body": "The only time I think a range makes sense is when it's contingent on certain extras. I've had some arrangements where on top of my PPM I was given a lot of expensive gifts, taken on trips, went to shows, etc. I'm willing to go for a slightly lower amount in that situation. Conversely, I've insisted on higher PPMs from people who lived far away as I had to factor 2+ hours of driving into the equation. So a range *can* make sense if there is justification as to what is expected from the top and bottom end of it.",
            "author": "clashingtaco",
            "id": "gtnbngp",
            "parent_id": "t1_gtmhwcm",
            "score": 10,
            "created_utc": 1617764554.0,
            "replies": [
                {
                    "body": "Tbh I’d rather just have an average number without all the extras. Those extras aren’t guaranteed and you can make a separate agreement on gifts or trips. To me a gift is a gift because you wanted to do something special, not because you are going to factor it into the ppm. Are kinky or extra sexual acts that make my SD feel special extra? No I do it cause I know he likes it it’s not a tit for tat to me that’s off putting and transactional",
                    "author": "PrettyFlyForABlasian",
                    "id": "gtnh2cp",
                    "parent_id": "t1_gtnbngp",
                    "score": 4,
                    "created_utc": 1617767826.0,
                    "replies": [
                        {
                            "body": "I think it's very situational. I've had SDs who preferred to buy me things/pay bills directly, as if it was sort of a fetish of theirs, so I was okay with getting more gifts for a lower PPM even though I typically prefer cash. Gifts here and there are one thing but large ticket items every week is something I'll negotiate my PPM for.",
                            "author": "clashingtaco",
                            "id": "gtni8t3",
                            "parent_id": "t1_gtnh2cp",
                            "score": 2,
                            "created_utc": 1617768585.0,
                            "replies": [
                                {
                                    "body": "To each their own. As long as it’s what you both want and consensual it’s fair game.",
                                    "author": "PrettyFlyForABlasian",
                                    "id": "gtnlyss",
                                    "parent_id": "t1_gtni8t3",
                                    "score": 0,
                                    "created_utc": 1617771121.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "(x+y)/2 lol",
            "author": "scumbagprincess1991",
            "id": "gtmv582",
            "parent_id": "t1_gtmdqgb",
            "score": 4,
            "created_utc": 1617755900.0,
            "replies": [
                {
                    "body": "😂🤣",
                    "author": "PrettyFlyForABlasian",
                    "id": "gtnjh4q",
                    "parent_id": "t1_gtmv582",
                    "score": 1,
                    "created_utc": 1617769412.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why NOT the wink?",
            "author": "timrid",
            "id": "gtmmji6",
            "parent_id": "t1_gtmhk6q",
            "score": 3,
            "created_utc": 1617751499.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtp5krn",
            "parent_id": "t1_gtn5o5a",
            "score": 1,
            "created_utc": 1617809691.0,
            "replies": [
                {
                    "body": ">\" Game theory is at the heart of modern understandings of contracts and negotiations. I pity that you don't know about it. It isn't at ALL about games/gamers.  \"\n\nI do appreciate the advice.  However, I was studying game theory at a well known eastern business school around the time yo mama was  trying to potty train you. But of more relevance to sugar arrangements is that you have illustrated one of two approaches to relationships. \n\nThe missing ingredients are an understanding of the mission and value.  \n\nThe wizards of wall street were smug in their financial markets of the 2006 era.  Game Theory flowed from multiple orifices.  They were the masters of the universe, making billions with complex financial transactions that were above mortal understanding. \n\nThey had, they proclaimed, repealed the laws of financial physics. I worked with them as part of my role as an adjunct faculty gig helping to organize several public programs on securitized finance.  \n\nThere was also a young grad student who also looked at the same financial markets, all the synthetic vehicles   and the fundamentals. He carefully traced the path from the homeowner getting a loan to the securitization, to the financial vehicles created by the banks and wall street to the bets placed for and against them. \n\nHis well researched analysis was that the housing finance market and the banking industry  were going to collapse with catastrophic global consequences. He was having difficulty raising capital for a fund that would bet against the tycoons of Wall Street,  but finally was successful. Unfortunately, unlike prior abuses of the markets, the then administration decided that the Wizards were so important they should not serve  the hard time they deserved. \n\n Only 18 months later the grad student  had, according to The Economist, the highest performing hedge fund in the world while many of the banks were just looking to survive. The masters of the financial universe were crushed along with their clients.  His farewell letter to wall street, published in the WSJ and other national/international journals was a classic. \n\nHe returned from self imposed exile a few  years ago with another well researched , out of the box , idea and strategy.  Today an investment of $1,000 is worth $ 30,000 , throughout ,the investment has been secured with physical ownership and possession of an un-leveraged commodity.  The relevance to sugar is that the primary focus  should be on a methodical analysis of what is  important (creates value)  to you and only then search to find someone whose characteristics best fit your needs with a minimum of conflict areas. \n\n The relevance to Arrangements is finding success through recognition of value rather than playing with game theory.  There's also the matter of the allowance you deliver and the way you treat an SB will eventually be reflected in her relationship with you. \n\n It is a lesson far too many SD fail to learn until  the have suffered from the  \"allowance is everything\" SB sticking and the quality, broader relationship seeking SB's having disappeared into the arms of an SD who understood value in a relationship and that relationships seldom flower when they are not mutually beneficial.\n\nI regret that I have no interest in another Porsche",
                    "author": "pinotandsugar",
                    "id": "gtpf2ap",
                    "parent_id": "t1_gtp5krn",
                    "score": 0,
                    "created_utc": 1617813764.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "maybe, maybe not",
            "author": null,
            "id": "gtn3i47",
            "parent_id": "t1_gtmx7q0",
            "score": 2,
            "created_utc": 1617760145.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtn4b44",
                    "parent_id": "t1_gtn3i47",
                    "score": 2,
                    "created_utc": 1617760559.0,
                    "replies": [
                        {
                            "body": "In the context of SA, a certain amount of banter before a M&G is pretty normal. but usually I would expect it to taper off once two people have either made plans to meet, or decided that for whatever reason it wouldn't work.\n\nIn this case it sounds like OP was hoping (to herself, without ever discussing it with this guy) that she would get paid for her time texting with him\\*, decided she wouldn't, decided that made him cheap, and then came on SLF to crow about shutting him down over PPM negotiations.\n\nMy main point is just that this scenario never even played itself out.\n\nA second point would be that getting paid for a texting-only relationship isn't really part of this sub (there are other subs for that).\n\nInstead, I would expect a message like \"hey, when you're ready to meet let me know\" and just not responding to excessive texts would be a fine way to handle it. Again, we will never know because this whole thing only lasted 15 minutes.\n\nThe use of the word \"imagine\" in this line is telling: \"Imagine expecting hours of texting with a woman you’ve never met or given anything to ....that doesn’t make you a SD, it makes you a user trying to take advantage of someone.\"\n\nIn fact, in this case it was OP doing the imagining.  Maybe she was right, but maybe not.\n\nFinal note: OP's profile asks for Amazon gifts in exchange for \\_Reddit DMs\\_.\\*\\* This is not sugar in the SLF sense. \n\n\\*\"unless he’s being as generous with his resources as I am with my texting time\"\n\n\\*\\*\"No DMs for chats unless you’re ready to buy me a treat! \"",
                            "author": null,
                            "id": "gtoc158",
                            "parent_id": "t1_gtn4b44",
                            "score": 1,
                            "created_utc": 1617794333.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "👍👍👍",
            "author": "Truckcanman2",
            "id": "gtn9xvt",
            "parent_id": "t1_gtn9dgm",
            "score": 1,
            "created_utc": 1617763595.0,
            "replies": []
        },
        {
            "body": "Trust me...Im the first to call out SD's who say that shit for being delusional.",
            "author": "AlaskanSnowDragon",
            "id": "gtmbm6t",
            "parent_id": "t1_gtmbf5b",
            "score": 2,
            "created_utc": 1617746027.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtmcot4",
                    "parent_id": "t1_gtmbm6t",
                    "score": -7,
                    "created_utc": 1617746543.0,
                    "replies": [
                        {
                            "body": "We're not talking about all...we're talking about the terminology you use.",
                            "author": "AlaskanSnowDragon",
                            "id": "gtmdu0g",
                            "parent_id": "t1_gtmcot4",
                            "score": 0,
                            "created_utc": 1617747107.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Then SB's need to be consistent in how they view and discuss it.  Because PPMs, hooking up on first/second meeting, SBs admitting they dont find their SDs attractive, talking about ROI like OP...Sounds like sex work.\n\nSo there needs to be some reconciling in language and approach because you may like to say its not **JUST** sex for money.  But it is **MOSTLY** sex for money.\n\nNo doubt you're gonna disagree, but we'll just have to agree to disagree then.",
            "author": "AlaskanSnowDragon",
            "id": "gtmf76r",
            "parent_id": "t1_gtmenxo",
            "score": 1,
            "created_utc": 1617747800.0,
            "replies": [
                {
                    "body": "Why does the responsibility fall to SBs?\n\nAll of my SDs wanted to start with PPM and to hook up almost immediately. It takes two to tango.",
                    "author": "Gee_n_tonic",
                    "id": "gtmhjx2",
                    "parent_id": "t1_gtmf76r",
                    "score": 8,
                    "created_utc": 1617748997.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gtmhvz3",
                            "parent_id": "t1_gtmhjx2",
                            "score": 0,
                            "created_utc": 1617749166.0,
                            "replies": [
                                {
                                    "body": "Seriously?! 🙄 More SBs than SDs think this way? Did you do a poll?  Or you’re just pulling shit out of thin air? \n\nSugar dating is a FORM of sw. So is cam-ing. So is onlyfans. It’s all under the umbrella of sw. \n\nAnd anyway, who cares how one defines it. Society views all of that as taboo and we’re all going to hell for being in the sugar life.",
                                    "author": "ExExpectations",
                                    "id": "gtmkpul",
                                    "parent_id": "t1_gtmhvz3",
                                    "score": 9,
                                    "created_utc": 1617750596.0,
                                    "replies": [
                                        {
                                            "body": "\\*\\*\\*bows down to the TRUTH\\*\\*\\*\\*\\*",
                                            "author": "mischiefmolly",
                                            "id": "gtmw5rb",
                                            "parent_id": "t1_gtmkpul",
                                            "score": 3,
                                            "created_utc": 1617756422.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gtml5pb",
                                            "parent_id": "t1_gtmkpul",
                                            "score": -1,
                                            "created_utc": 1617750817.0,
                                            "replies": [
                                                {
                                                    "body": "🙄🙄🙄 look no further than SLF to see that’s not true at all. Men of SLF are always saying it’s not sw.",
                                                    "author": "ExExpectations",
                                                    "id": "gtmlbvz",
                                                    "parent_id": "t1_gtml5pb",
                                                    "score": 8,
                                                    "created_utc": 1617750904.0,
                                                    "replies": [
                                                        {
                                                            "body": "They can keep telling themselves that as long as they’re paying",
                                                            "author": "scumbagprincess1991",
                                                            "id": "gtmw0a1",
                                                            "parent_id": "t1_gtmlbvz",
                                                            "score": 3,
                                                            "created_utc": 1617756344.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Paying. But it’s not a form of sw! \n\nOh the irony 😂",
                                                                    "author": "ExExpectations",
                                                                    "id": "gtmzazy",
                                                                    "parent_id": "t1_gtmw0a1",
                                                                    "score": 2,
                                                                    "created_utc": 1617758030.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "gtn455l",
                                                                            "parent_id": "t1_gtmzazy",
                                                                            "score": 2,
                                                                            "created_utc": 1617760472.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Same. \n\nBut what goes on here, does affect what happens out there too, to some degree. Sometimes much more than I/we want (and largely in quite negative ways, to SBs)...",
                                                                                    "author": "ExExpectations",
                                                                                    "id": "gtn4qtw",
                                                                                    "parent_id": "t1_gtn455l",
                                                                                    "score": 2,
                                                                                    "created_utc": 1617760790.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[deleted]",
                                                                                            "author": null,
                                                                                            "id": "gtn5p3d",
                                                                                            "parent_id": "t1_gtn4qtw",
                                                                                            "score": 2,
                                                                                            "created_utc": 1617761292.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "To be clear, I’ve only been within the sugar world. Not escort or onlyfans or other types of sw.\n\nI agree though, many men aren’t exactly SDs... :(",
                                                                                                    "author": "ExExpectations",
                                                                                                    "id": "gtn6gen",
                                                                                                    "parent_id": "t1_gtn5p3d",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1617761704.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "[deleted]",
                                                                                                            "author": null,
                                                                                                            "id": "gtn7ijj",
                                                                                                            "parent_id": "t1_gtn6gen",
                                                                                                            "score": 2,
                                                                                                            "created_utc": 1617762267.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "For sure I’ve had been in “relationships” with Johnny or John-Lites masquerading as SDs. Sigh.\n\nDefinitely overlaps in the Venn.",
                                                                                                                    "author": "ExExpectations",
                                                                                                                    "id": "gtn9192",
                                                                                                                    "parent_id": "t1_gtn7ijj",
                                                                                                                    "score": 3,
                                                                                                                    "created_utc": 1617763093.0,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "And those guys are delusional",
                                                            "author": "AlaskanSnowDragon",
                                                            "id": "gtmlv5y",
                                                            "parent_id": "t1_gtmlbvz",
                                                            "score": -1,
                                                            "created_utc": 1617751167.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You’re completely contradictory. Just enjoy picking on the women eh? 🤦🏻‍♀️🤦🏻‍♀️ Goodbye. Blocking you.",
                                                                    "author": "ExExpectations",
                                                                    "id": "gtmmb6b",
                                                                    "parent_id": "t1_gtmlv5y",
                                                                    "score": 1,
                                                                    "created_utc": 1617751382.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "😘",
                                                                            "author": "AlaskanSnowDragon",
                                                                            "id": "gtmmf0p",
                                                                            "parent_id": "t1_gtmmb6b",
                                                                            "score": 0,
                                                                            "created_utc": 1617751437.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": ">And any SD who says its not sex for money is delusional too.\n\nIt's not sex for money",
                                    "author": "mraspencer",
                                    "id": "gtmv32y",
                                    "parent_id": "t1_gtmhvz3",
                                    "score": 1,
                                    "created_utc": 1617755870.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> It doesn’t “sound like” that. That IS what is was.\n\nThat's what I thought I was saying.",
            "author": "emptyoverflow",
            "id": "gtmod0c",
            "parent_id": "t1_gtmhe7j",
            "score": 3,
            "created_utc": 1617752422.0,
            "replies": [
                {
                    "body": "Ok, so you wrote a response to paraphrase me? Thank youuuuu for your ...contribution? 🥰",
                    "author": "SassySugar4u",
                    "id": "gtmqz0i",
                    "parent_id": "t1_gtmod0c",
                    "score": -2,
                    "created_utc": 1617753775.0,
                    "replies": [
                        {
                            "body": "Commenters paraphrase OPs when they strongly agree with them. I agreed with you, but I guess I phrased it poorly. Sorry to bother you.",
                            "author": "emptyoverflow",
                            "id": "gtmzm9e",
                            "parent_id": "t1_gtmqz0i",
                            "score": 5,
                            "created_utc": 1617758191.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sometimes, respondents wholeheartedly agree with OP, and their reaction may sound like they're paraphrasing OP.  I aimed for my post to accessorize—not dilute—the topic you brilliantly shared.  I accept the possibility that I failed.",
            "author": null,
            "id": "gtmwfyb",
            "parent_id": "t1_gtmok4n",
            "score": 2,
            "created_utc": 1617756566.0,
            "replies": [
                {
                    "body": "I got your intent.",
                    "author": "BlissfulSB",
                    "id": "gtn4yvs",
                    "parent_id": "t1_gtmwfyb",
                    "score": 3,
                    "created_utc": 1617760908.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "lmfao thank you no idea why i got downvoted for asking a simple question i’m new to this sub but a long time sb 😭💀💀",
            "author": "Alternative-Waters",
            "id": "gtofl07",
            "parent_id": "t1_gtntxdy",
            "score": 2,
            "created_utc": 1617796770.0,
            "replies": []
        },
        {
            "body": "Tbh I’d rather just have an average number without all the extras. Those extras aren’t guaranteed and you can make a separate agreement on gifts or trips. To me a gift is a gift because you wanted to do something special, not because you are going to factor it into the ppm. Are kinky or extra sexual acts that make my SD feel special extra? No I do it cause I know he likes it it’s not a tit for tat to me that’s off putting and transactional",
            "author": "PrettyFlyForABlasian",
            "id": "gtnh2cp",
            "parent_id": "t1_gtnbngp",
            "score": 4,
            "created_utc": 1617767826.0,
            "replies": [
                {
                    "body": "I think it's very situational. I've had SDs who preferred to buy me things/pay bills directly, as if it was sort of a fetish of theirs, so I was okay with getting more gifts for a lower PPM even though I typically prefer cash. Gifts here and there are one thing but large ticket items every week is something I'll negotiate my PPM for.",
                    "author": "clashingtaco",
                    "id": "gtni8t3",
                    "parent_id": "t1_gtnh2cp",
                    "score": 2,
                    "created_utc": 1617768585.0,
                    "replies": [
                        {
                            "body": "To each their own. As long as it’s what you both want and consensual it’s fair game.",
                            "author": "PrettyFlyForABlasian",
                            "id": "gtnlyss",
                            "parent_id": "t1_gtni8t3",
                            "score": 0,
                            "created_utc": 1617771121.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "😂🤣",
            "author": "PrettyFlyForABlasian",
            "id": "gtnjh4q",
            "parent_id": "t1_gtmv582",
            "score": 1,
            "created_utc": 1617769412.0,
            "replies": []
        },
        {
            "body": ">\" Game theory is at the heart of modern understandings of contracts and negotiations. I pity that you don't know about it. It isn't at ALL about games/gamers.  \"\n\nI do appreciate the advice.  However, I was studying game theory at a well known eastern business school around the time yo mama was  trying to potty train you. But of more relevance to sugar arrangements is that you have illustrated one of two approaches to relationships. \n\nThe missing ingredients are an understanding of the mission and value.  \n\nThe wizards of wall street were smug in their financial markets of the 2006 era.  Game Theory flowed from multiple orifices.  They were the masters of the universe, making billions with complex financial transactions that were above mortal understanding. \n\nThey had, they proclaimed, repealed the laws of financial physics. I worked with them as part of my role as an adjunct faculty gig helping to organize several public programs on securitized finance.  \n\nThere was also a young grad student who also looked at the same financial markets, all the synthetic vehicles   and the fundamentals. He carefully traced the path from the homeowner getting a loan to the securitization, to the financial vehicles created by the banks and wall street to the bets placed for and against them. \n\nHis well researched analysis was that the housing finance market and the banking industry  were going to collapse with catastrophic global consequences. He was having difficulty raising capital for a fund that would bet against the tycoons of Wall Street,  but finally was successful. Unfortunately, unlike prior abuses of the markets, the then administration decided that the Wizards were so important they should not serve  the hard time they deserved. \n\n Only 18 months later the grad student  had, according to The Economist, the highest performing hedge fund in the world while many of the banks were just looking to survive. The masters of the financial universe were crushed along with their clients.  His farewell letter to wall street, published in the WSJ and other national/international journals was a classic. \n\nHe returned from self imposed exile a few  years ago with another well researched , out of the box , idea and strategy.  Today an investment of $1,000 is worth $ 30,000 , throughout ,the investment has been secured with physical ownership and possession of an un-leveraged commodity.  The relevance to sugar is that the primary focus  should be on a methodical analysis of what is  important (creates value)  to you and only then search to find someone whose characteristics best fit your needs with a minimum of conflict areas. \n\n The relevance to Arrangements is finding success through recognition of value rather than playing with game theory.  There's also the matter of the allowance you deliver and the way you treat an SB will eventually be reflected in her relationship with you. \n\n It is a lesson far too many SD fail to learn until  the have suffered from the  \"allowance is everything\" SB sticking and the quality, broader relationship seeking SB's having disappeared into the arms of an SD who understood value in a relationship and that relationships seldom flower when they are not mutually beneficial.\n\nI regret that I have no interest in another Porsche",
            "author": "pinotandsugar",
            "id": "gtpf2ap",
            "parent_id": "t1_gtp5krn",
            "score": 0,
            "created_utc": 1617813764.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtn4b44",
            "parent_id": "t1_gtn3i47",
            "score": 2,
            "created_utc": 1617760559.0,
            "replies": [
                {
                    "body": "In the context of SA, a certain amount of banter before a M&G is pretty normal. but usually I would expect it to taper off once two people have either made plans to meet, or decided that for whatever reason it wouldn't work.\n\nIn this case it sounds like OP was hoping (to herself, without ever discussing it with this guy) that she would get paid for her time texting with him\\*, decided she wouldn't, decided that made him cheap, and then came on SLF to crow about shutting him down over PPM negotiations.\n\nMy main point is just that this scenario never even played itself out.\n\nA second point would be that getting paid for a texting-only relationship isn't really part of this sub (there are other subs for that).\n\nInstead, I would expect a message like \"hey, when you're ready to meet let me know\" and just not responding to excessive texts would be a fine way to handle it. Again, we will never know because this whole thing only lasted 15 minutes.\n\nThe use of the word \"imagine\" in this line is telling: \"Imagine expecting hours of texting with a woman you’ve never met or given anything to ....that doesn’t make you a SD, it makes you a user trying to take advantage of someone.\"\n\nIn fact, in this case it was OP doing the imagining.  Maybe she was right, but maybe not.\n\nFinal note: OP's profile asks for Amazon gifts in exchange for \\_Reddit DMs\\_.\\*\\* This is not sugar in the SLF sense. \n\n\\*\"unless he’s being as generous with his resources as I am with my texting time\"\n\n\\*\\*\"No DMs for chats unless you’re ready to buy me a treat! \"",
                    "author": null,
                    "id": "gtoc158",
                    "parent_id": "t1_gtn4b44",
                    "score": 1,
                    "created_utc": 1617794333.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtmcot4",
            "parent_id": "t1_gtmbm6t",
            "score": -7,
            "created_utc": 1617746543.0,
            "replies": [
                {
                    "body": "We're not talking about all...we're talking about the terminology you use.",
                    "author": "AlaskanSnowDragon",
                    "id": "gtmdu0g",
                    "parent_id": "t1_gtmcot4",
                    "score": 0,
                    "created_utc": 1617747107.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why does the responsibility fall to SBs?\n\nAll of my SDs wanted to start with PPM and to hook up almost immediately. It takes two to tango.",
            "author": "Gee_n_tonic",
            "id": "gtmhjx2",
            "parent_id": "t1_gtmf76r",
            "score": 8,
            "created_utc": 1617748997.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtmhvz3",
                    "parent_id": "t1_gtmhjx2",
                    "score": 0,
                    "created_utc": 1617749166.0,
                    "replies": [
                        {
                            "body": "Seriously?! 🙄 More SBs than SDs think this way? Did you do a poll?  Or you’re just pulling shit out of thin air? \n\nSugar dating is a FORM of sw. So is cam-ing. So is onlyfans. It’s all under the umbrella of sw. \n\nAnd anyway, who cares how one defines it. Society views all of that as taboo and we’re all going to hell for being in the sugar life.",
                            "author": "ExExpectations",
                            "id": "gtmkpul",
                            "parent_id": "t1_gtmhvz3",
                            "score": 9,
                            "created_utc": 1617750596.0,
                            "replies": [
                                {
                                    "body": "\\*\\*\\*bows down to the TRUTH\\*\\*\\*\\*\\*",
                                    "author": "mischiefmolly",
                                    "id": "gtmw5rb",
                                    "parent_id": "t1_gtmkpul",
                                    "score": 3,
                                    "created_utc": 1617756422.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gtml5pb",
                                    "parent_id": "t1_gtmkpul",
                                    "score": -1,
                                    "created_utc": 1617750817.0,
                                    "replies": [
                                        {
                                            "body": "🙄🙄🙄 look no further than SLF to see that’s not true at all. Men of SLF are always saying it’s not sw.",
                                            "author": "ExExpectations",
                                            "id": "gtmlbvz",
                                            "parent_id": "t1_gtml5pb",
                                            "score": 8,
                                            "created_utc": 1617750904.0,
                                            "replies": [
                                                {
                                                    "body": "They can keep telling themselves that as long as they’re paying",
                                                    "author": "scumbagprincess1991",
                                                    "id": "gtmw0a1",
                                                    "parent_id": "t1_gtmlbvz",
                                                    "score": 3,
                                                    "created_utc": 1617756344.0,
                                                    "replies": [
                                                        {
                                                            "body": "Paying. But it’s not a form of sw! \n\nOh the irony 😂",
                                                            "author": "ExExpectations",
                                                            "id": "gtmzazy",
                                                            "parent_id": "t1_gtmw0a1",
                                                            "score": 2,
                                                            "created_utc": 1617758030.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "gtn455l",
                                                                    "parent_id": "t1_gtmzazy",
                                                                    "score": 2,
                                                                    "created_utc": 1617760472.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Same. \n\nBut what goes on here, does affect what happens out there too, to some degree. Sometimes much more than I/we want (and largely in quite negative ways, to SBs)...",
                                                                            "author": "ExExpectations",
                                                                            "id": "gtn4qtw",
                                                                            "parent_id": "t1_gtn455l",
                                                                            "score": 2,
                                                                            "created_utc": 1617760790.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "gtn5p3d",
                                                                                    "parent_id": "t1_gtn4qtw",
                                                                                    "score": 2,
                                                                                    "created_utc": 1617761292.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "To be clear, I’ve only been within the sugar world. Not escort or onlyfans or other types of sw.\n\nI agree though, many men aren’t exactly SDs... :(",
                                                                                            "author": "ExExpectations",
                                                                                            "id": "gtn6gen",
                                                                                            "parent_id": "t1_gtn5p3d",
                                                                                            "score": 2,
                                                                                            "created_utc": 1617761704.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "[deleted]",
                                                                                                    "author": null,
                                                                                                    "id": "gtn7ijj",
                                                                                                    "parent_id": "t1_gtn6gen",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1617762267.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "For sure I’ve had been in “relationships” with Johnny or John-Lites masquerading as SDs. Sigh.\n\nDefinitely overlaps in the Venn.",
                                                                                                            "author": "ExExpectations",
                                                                                                            "id": "gtn9192",
                                                                                                            "parent_id": "t1_gtn7ijj",
                                                                                                            "score": 3,
                                                                                                            "created_utc": 1617763093.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "And those guys are delusional",
                                                    "author": "AlaskanSnowDragon",
                                                    "id": "gtmlv5y",
                                                    "parent_id": "t1_gtmlbvz",
                                                    "score": -1,
                                                    "created_utc": 1617751167.0,
                                                    "replies": [
                                                        {
                                                            "body": "You’re completely contradictory. Just enjoy picking on the women eh? 🤦🏻‍♀️🤦🏻‍♀️ Goodbye. Blocking you.",
                                                            "author": "ExExpectations",
                                                            "id": "gtmmb6b",
                                                            "parent_id": "t1_gtmlv5y",
                                                            "score": 1,
                                                            "created_utc": 1617751382.0,
                                                            "replies": [
                                                                {
                                                                    "body": "😘",
                                                                    "author": "AlaskanSnowDragon",
                                                                    "id": "gtmmf0p",
                                                                    "parent_id": "t1_gtmmb6b",
                                                                    "score": 0,
                                                                    "created_utc": 1617751437.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">And any SD who says its not sex for money is delusional too.\n\nIt's not sex for money",
                            "author": "mraspencer",
                            "id": "gtmv32y",
                            "parent_id": "t1_gtmhvz3",
                            "score": 1,
                            "created_utc": 1617755870.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ok, so you wrote a response to paraphrase me? Thank youuuuu for your ...contribution? 🥰",
            "author": "SassySugar4u",
            "id": "gtmqz0i",
            "parent_id": "t1_gtmod0c",
            "score": -2,
            "created_utc": 1617753775.0,
            "replies": [
                {
                    "body": "Commenters paraphrase OPs when they strongly agree with them. I agreed with you, but I guess I phrased it poorly. Sorry to bother you.",
                    "author": "emptyoverflow",
                    "id": "gtmzm9e",
                    "parent_id": "t1_gtmqz0i",
                    "score": 5,
                    "created_utc": 1617758191.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I got your intent.",
            "author": "BlissfulSB",
            "id": "gtn4yvs",
            "parent_id": "t1_gtmwfyb",
            "score": 3,
            "created_utc": 1617760908.0,
            "replies": []
        },
        {
            "body": "I think it's very situational. I've had SDs who preferred to buy me things/pay bills directly, as if it was sort of a fetish of theirs, so I was okay with getting more gifts for a lower PPM even though I typically prefer cash. Gifts here and there are one thing but large ticket items every week is something I'll negotiate my PPM for.",
            "author": "clashingtaco",
            "id": "gtni8t3",
            "parent_id": "t1_gtnh2cp",
            "score": 2,
            "created_utc": 1617768585.0,
            "replies": [
                {
                    "body": "To each their own. As long as it’s what you both want and consensual it’s fair game.",
                    "author": "PrettyFlyForABlasian",
                    "id": "gtnlyss",
                    "parent_id": "t1_gtni8t3",
                    "score": 0,
                    "created_utc": 1617771121.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In the context of SA, a certain amount of banter before a M&G is pretty normal. but usually I would expect it to taper off once two people have either made plans to meet, or decided that for whatever reason it wouldn't work.\n\nIn this case it sounds like OP was hoping (to herself, without ever discussing it with this guy) that she would get paid for her time texting with him\\*, decided she wouldn't, decided that made him cheap, and then came on SLF to crow about shutting him down over PPM negotiations.\n\nMy main point is just that this scenario never even played itself out.\n\nA second point would be that getting paid for a texting-only relationship isn't really part of this sub (there are other subs for that).\n\nInstead, I would expect a message like \"hey, when you're ready to meet let me know\" and just not responding to excessive texts would be a fine way to handle it. Again, we will never know because this whole thing only lasted 15 minutes.\n\nThe use of the word \"imagine\" in this line is telling: \"Imagine expecting hours of texting with a woman you’ve never met or given anything to ....that doesn’t make you a SD, it makes you a user trying to take advantage of someone.\"\n\nIn fact, in this case it was OP doing the imagining.  Maybe she was right, but maybe not.\n\nFinal note: OP's profile asks for Amazon gifts in exchange for \\_Reddit DMs\\_.\\*\\* This is not sugar in the SLF sense. \n\n\\*\"unless he’s being as generous with his resources as I am with my texting time\"\n\n\\*\\*\"No DMs for chats unless you’re ready to buy me a treat! \"",
            "author": null,
            "id": "gtoc158",
            "parent_id": "t1_gtn4b44",
            "score": 1,
            "created_utc": 1617794333.0,
            "replies": []
        },
        {
            "body": "We're not talking about all...we're talking about the terminology you use.",
            "author": "AlaskanSnowDragon",
            "id": "gtmdu0g",
            "parent_id": "t1_gtmcot4",
            "score": 0,
            "created_utc": 1617747107.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtmhvz3",
            "parent_id": "t1_gtmhjx2",
            "score": 0,
            "created_utc": 1617749166.0,
            "replies": [
                {
                    "body": "Seriously?! 🙄 More SBs than SDs think this way? Did you do a poll?  Or you’re just pulling shit out of thin air? \n\nSugar dating is a FORM of sw. So is cam-ing. So is onlyfans. It’s all under the umbrella of sw. \n\nAnd anyway, who cares how one defines it. Society views all of that as taboo and we’re all going to hell for being in the sugar life.",
                    "author": "ExExpectations",
                    "id": "gtmkpul",
                    "parent_id": "t1_gtmhvz3",
                    "score": 9,
                    "created_utc": 1617750596.0,
                    "replies": [
                        {
                            "body": "\\*\\*\\*bows down to the TRUTH\\*\\*\\*\\*\\*",
                            "author": "mischiefmolly",
                            "id": "gtmw5rb",
                            "parent_id": "t1_gtmkpul",
                            "score": 3,
                            "created_utc": 1617756422.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gtml5pb",
                            "parent_id": "t1_gtmkpul",
                            "score": -1,
                            "created_utc": 1617750817.0,
                            "replies": [
                                {
                                    "body": "🙄🙄🙄 look no further than SLF to see that’s not true at all. Men of SLF are always saying it’s not sw.",
                                    "author": "ExExpectations",
                                    "id": "gtmlbvz",
                                    "parent_id": "t1_gtml5pb",
                                    "score": 8,
                                    "created_utc": 1617750904.0,
                                    "replies": [
                                        {
                                            "body": "They can keep telling themselves that as long as they’re paying",
                                            "author": "scumbagprincess1991",
                                            "id": "gtmw0a1",
                                            "parent_id": "t1_gtmlbvz",
                                            "score": 3,
                                            "created_utc": 1617756344.0,
                                            "replies": [
                                                {
                                                    "body": "Paying. But it’s not a form of sw! \n\nOh the irony 😂",
                                                    "author": "ExExpectations",
                                                    "id": "gtmzazy",
                                                    "parent_id": "t1_gtmw0a1",
                                                    "score": 2,
                                                    "created_utc": 1617758030.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "gtn455l",
                                                            "parent_id": "t1_gtmzazy",
                                                            "score": 2,
                                                            "created_utc": 1617760472.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Same. \n\nBut what goes on here, does affect what happens out there too, to some degree. Sometimes much more than I/we want (and largely in quite negative ways, to SBs)...",
                                                                    "author": "ExExpectations",
                                                                    "id": "gtn4qtw",
                                                                    "parent_id": "t1_gtn455l",
                                                                    "score": 2,
                                                                    "created_utc": 1617760790.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "gtn5p3d",
                                                                            "parent_id": "t1_gtn4qtw",
                                                                            "score": 2,
                                                                            "created_utc": 1617761292.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "To be clear, I’ve only been within the sugar world. Not escort or onlyfans or other types of sw.\n\nI agree though, many men aren’t exactly SDs... :(",
                                                                                    "author": "ExExpectations",
                                                                                    "id": "gtn6gen",
                                                                                    "parent_id": "t1_gtn5p3d",
                                                                                    "score": 2,
                                                                                    "created_utc": 1617761704.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[deleted]",
                                                                                            "author": null,
                                                                                            "id": "gtn7ijj",
                                                                                            "parent_id": "t1_gtn6gen",
                                                                                            "score": 2,
                                                                                            "created_utc": 1617762267.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "For sure I’ve had been in “relationships” with Johnny or John-Lites masquerading as SDs. Sigh.\n\nDefinitely overlaps in the Venn.",
                                                                                                    "author": "ExExpectations",
                                                                                                    "id": "gtn9192",
                                                                                                    "parent_id": "t1_gtn7ijj",
                                                                                                    "score": 3,
                                                                                                    "created_utc": 1617763093.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "And those guys are delusional",
                                            "author": "AlaskanSnowDragon",
                                            "id": "gtmlv5y",
                                            "parent_id": "t1_gtmlbvz",
                                            "score": -1,
                                            "created_utc": 1617751167.0,
                                            "replies": [
                                                {
                                                    "body": "You’re completely contradictory. Just enjoy picking on the women eh? 🤦🏻‍♀️🤦🏻‍♀️ Goodbye. Blocking you.",
                                                    "author": "ExExpectations",
                                                    "id": "gtmmb6b",
                                                    "parent_id": "t1_gtmlv5y",
                                                    "score": 1,
                                                    "created_utc": 1617751382.0,
                                                    "replies": [
                                                        {
                                                            "body": "😘",
                                                            "author": "AlaskanSnowDragon",
                                                            "id": "gtmmf0p",
                                                            "parent_id": "t1_gtmmb6b",
                                                            "score": 0,
                                                            "created_utc": 1617751437.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">And any SD who says its not sex for money is delusional too.\n\nIt's not sex for money",
                    "author": "mraspencer",
                    "id": "gtmv32y",
                    "parent_id": "t1_gtmhvz3",
                    "score": 1,
                    "created_utc": 1617755870.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Commenters paraphrase OPs when they strongly agree with them. I agreed with you, but I guess I phrased it poorly. Sorry to bother you.",
            "author": "emptyoverflow",
            "id": "gtmzm9e",
            "parent_id": "t1_gtmqz0i",
            "score": 5,
            "created_utc": 1617758191.0,
            "replies": []
        },
        {
            "body": "To each their own. As long as it’s what you both want and consensual it’s fair game.",
            "author": "PrettyFlyForABlasian",
            "id": "gtnlyss",
            "parent_id": "t1_gtni8t3",
            "score": 0,
            "created_utc": 1617771121.0,
            "replies": []
        },
        {
            "body": "Seriously?! 🙄 More SBs than SDs think this way? Did you do a poll?  Or you’re just pulling shit out of thin air? \n\nSugar dating is a FORM of sw. So is cam-ing. So is onlyfans. It’s all under the umbrella of sw. \n\nAnd anyway, who cares how one defines it. Society views all of that as taboo and we’re all going to hell for being in the sugar life.",
            "author": "ExExpectations",
            "id": "gtmkpul",
            "parent_id": "t1_gtmhvz3",
            "score": 9,
            "created_utc": 1617750596.0,
            "replies": [
                {
                    "body": "\\*\\*\\*bows down to the TRUTH\\*\\*\\*\\*\\*",
                    "author": "mischiefmolly",
                    "id": "gtmw5rb",
                    "parent_id": "t1_gtmkpul",
                    "score": 3,
                    "created_utc": 1617756422.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtml5pb",
                    "parent_id": "t1_gtmkpul",
                    "score": -1,
                    "created_utc": 1617750817.0,
                    "replies": [
                        {
                            "body": "🙄🙄🙄 look no further than SLF to see that’s not true at all. Men of SLF are always saying it’s not sw.",
                            "author": "ExExpectations",
                            "id": "gtmlbvz",
                            "parent_id": "t1_gtml5pb",
                            "score": 8,
                            "created_utc": 1617750904.0,
                            "replies": [
                                {
                                    "body": "They can keep telling themselves that as long as they’re paying",
                                    "author": "scumbagprincess1991",
                                    "id": "gtmw0a1",
                                    "parent_id": "t1_gtmlbvz",
                                    "score": 3,
                                    "created_utc": 1617756344.0,
                                    "replies": [
                                        {
                                            "body": "Paying. But it’s not a form of sw! \n\nOh the irony 😂",
                                            "author": "ExExpectations",
                                            "id": "gtmzazy",
                                            "parent_id": "t1_gtmw0a1",
                                            "score": 2,
                                            "created_utc": 1617758030.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gtn455l",
                                                    "parent_id": "t1_gtmzazy",
                                                    "score": 2,
                                                    "created_utc": 1617760472.0,
                                                    "replies": [
                                                        {
                                                            "body": "Same. \n\nBut what goes on here, does affect what happens out there too, to some degree. Sometimes much more than I/we want (and largely in quite negative ways, to SBs)...",
                                                            "author": "ExExpectations",
                                                            "id": "gtn4qtw",
                                                            "parent_id": "t1_gtn455l",
                                                            "score": 2,
                                                            "created_utc": 1617760790.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "gtn5p3d",
                                                                    "parent_id": "t1_gtn4qtw",
                                                                    "score": 2,
                                                                    "created_utc": 1617761292.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "To be clear, I’ve only been within the sugar world. Not escort or onlyfans or other types of sw.\n\nI agree though, many men aren’t exactly SDs... :(",
                                                                            "author": "ExExpectations",
                                                                            "id": "gtn6gen",
                                                                            "parent_id": "t1_gtn5p3d",
                                                                            "score": 2,
                                                                            "created_utc": 1617761704.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "gtn7ijj",
                                                                                    "parent_id": "t1_gtn6gen",
                                                                                    "score": 2,
                                                                                    "created_utc": 1617762267.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "For sure I’ve had been in “relationships” with Johnny or John-Lites masquerading as SDs. Sigh.\n\nDefinitely overlaps in the Venn.",
                                                                                            "author": "ExExpectations",
                                                                                            "id": "gtn9192",
                                                                                            "parent_id": "t1_gtn7ijj",
                                                                                            "score": 3,
                                                                                            "created_utc": 1617763093.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "And those guys are delusional",
                                    "author": "AlaskanSnowDragon",
                                    "id": "gtmlv5y",
                                    "parent_id": "t1_gtmlbvz",
                                    "score": -1,
                                    "created_utc": 1617751167.0,
                                    "replies": [
                                        {
                                            "body": "You’re completely contradictory. Just enjoy picking on the women eh? 🤦🏻‍♀️🤦🏻‍♀️ Goodbye. Blocking you.",
                                            "author": "ExExpectations",
                                            "id": "gtmmb6b",
                                            "parent_id": "t1_gtmlv5y",
                                            "score": 1,
                                            "created_utc": 1617751382.0,
                                            "replies": [
                                                {
                                                    "body": "😘",
                                                    "author": "AlaskanSnowDragon",
                                                    "id": "gtmmf0p",
                                                    "parent_id": "t1_gtmmb6b",
                                                    "score": 0,
                                                    "created_utc": 1617751437.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">And any SD who says its not sex for money is delusional too.\n\nIt's not sex for money",
            "author": "mraspencer",
            "id": "gtmv32y",
            "parent_id": "t1_gtmhvz3",
            "score": 1,
            "created_utc": 1617755870.0,
            "replies": []
        },
        {
            "body": "\\*\\*\\*bows down to the TRUTH\\*\\*\\*\\*\\*",
            "author": "mischiefmolly",
            "id": "gtmw5rb",
            "parent_id": "t1_gtmkpul",
            "score": 3,
            "created_utc": 1617756422.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtml5pb",
            "parent_id": "t1_gtmkpul",
            "score": -1,
            "created_utc": 1617750817.0,
            "replies": [
                {
                    "body": "🙄🙄🙄 look no further than SLF to see that’s not true at all. Men of SLF are always saying it’s not sw.",
                    "author": "ExExpectations",
                    "id": "gtmlbvz",
                    "parent_id": "t1_gtml5pb",
                    "score": 8,
                    "created_utc": 1617750904.0,
                    "replies": [
                        {
                            "body": "They can keep telling themselves that as long as they’re paying",
                            "author": "scumbagprincess1991",
                            "id": "gtmw0a1",
                            "parent_id": "t1_gtmlbvz",
                            "score": 3,
                            "created_utc": 1617756344.0,
                            "replies": [
                                {
                                    "body": "Paying. But it’s not a form of sw! \n\nOh the irony 😂",
                                    "author": "ExExpectations",
                                    "id": "gtmzazy",
                                    "parent_id": "t1_gtmw0a1",
                                    "score": 2,
                                    "created_utc": 1617758030.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gtn455l",
                                            "parent_id": "t1_gtmzazy",
                                            "score": 2,
                                            "created_utc": 1617760472.0,
                                            "replies": [
                                                {
                                                    "body": "Same. \n\nBut what goes on here, does affect what happens out there too, to some degree. Sometimes much more than I/we want (and largely in quite negative ways, to SBs)...",
                                                    "author": "ExExpectations",
                                                    "id": "gtn4qtw",
                                                    "parent_id": "t1_gtn455l",
                                                    "score": 2,
                                                    "created_utc": 1617760790.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "gtn5p3d",
                                                            "parent_id": "t1_gtn4qtw",
                                                            "score": 2,
                                                            "created_utc": 1617761292.0,
                                                            "replies": [
                                                                {
                                                                    "body": "To be clear, I’ve only been within the sugar world. Not escort or onlyfans or other types of sw.\n\nI agree though, many men aren’t exactly SDs... :(",
                                                                    "author": "ExExpectations",
                                                                    "id": "gtn6gen",
                                                                    "parent_id": "t1_gtn5p3d",
                                                                    "score": 2,
                                                                    "created_utc": 1617761704.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "gtn7ijj",
                                                                            "parent_id": "t1_gtn6gen",
                                                                            "score": 2,
                                                                            "created_utc": 1617762267.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "For sure I’ve had been in “relationships” with Johnny or John-Lites masquerading as SDs. Sigh.\n\nDefinitely overlaps in the Venn.",
                                                                                    "author": "ExExpectations",
                                                                                    "id": "gtn9192",
                                                                                    "parent_id": "t1_gtn7ijj",
                                                                                    "score": 3,
                                                                                    "created_utc": 1617763093.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "And those guys are delusional",
                            "author": "AlaskanSnowDragon",
                            "id": "gtmlv5y",
                            "parent_id": "t1_gtmlbvz",
                            "score": -1,
                            "created_utc": 1617751167.0,
                            "replies": [
                                {
                                    "body": "You’re completely contradictory. Just enjoy picking on the women eh? 🤦🏻‍♀️🤦🏻‍♀️ Goodbye. Blocking you.",
                                    "author": "ExExpectations",
                                    "id": "gtmmb6b",
                                    "parent_id": "t1_gtmlv5y",
                                    "score": 1,
                                    "created_utc": 1617751382.0,
                                    "replies": [
                                        {
                                            "body": "😘",
                                            "author": "AlaskanSnowDragon",
                                            "id": "gtmmf0p",
                                            "parent_id": "t1_gtmmb6b",
                                            "score": 0,
                                            "created_utc": 1617751437.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "🙄🙄🙄 look no further than SLF to see that’s not true at all. Men of SLF are always saying it’s not sw.",
            "author": "ExExpectations",
            "id": "gtmlbvz",
            "parent_id": "t1_gtml5pb",
            "score": 8,
            "created_utc": 1617750904.0,
            "replies": [
                {
                    "body": "They can keep telling themselves that as long as they’re paying",
                    "author": "scumbagprincess1991",
                    "id": "gtmw0a1",
                    "parent_id": "t1_gtmlbvz",
                    "score": 3,
                    "created_utc": 1617756344.0,
                    "replies": [
                        {
                            "body": "Paying. But it’s not a form of sw! \n\nOh the irony 😂",
                            "author": "ExExpectations",
                            "id": "gtmzazy",
                            "parent_id": "t1_gtmw0a1",
                            "score": 2,
                            "created_utc": 1617758030.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gtn455l",
                                    "parent_id": "t1_gtmzazy",
                                    "score": 2,
                                    "created_utc": 1617760472.0,
                                    "replies": [
                                        {
                                            "body": "Same. \n\nBut what goes on here, does affect what happens out there too, to some degree. Sometimes much more than I/we want (and largely in quite negative ways, to SBs)...",
                                            "author": "ExExpectations",
                                            "id": "gtn4qtw",
                                            "parent_id": "t1_gtn455l",
                                            "score": 2,
                                            "created_utc": 1617760790.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gtn5p3d",
                                                    "parent_id": "t1_gtn4qtw",
                                                    "score": 2,
                                                    "created_utc": 1617761292.0,
                                                    "replies": [
                                                        {
                                                            "body": "To be clear, I’ve only been within the sugar world. Not escort or onlyfans or other types of sw.\n\nI agree though, many men aren’t exactly SDs... :(",
                                                            "author": "ExExpectations",
                                                            "id": "gtn6gen",
                                                            "parent_id": "t1_gtn5p3d",
                                                            "score": 2,
                                                            "created_utc": 1617761704.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "gtn7ijj",
                                                                    "parent_id": "t1_gtn6gen",
                                                                    "score": 2,
                                                                    "created_utc": 1617762267.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "For sure I’ve had been in “relationships” with Johnny or John-Lites masquerading as SDs. Sigh.\n\nDefinitely overlaps in the Venn.",
                                                                            "author": "ExExpectations",
                                                                            "id": "gtn9192",
                                                                            "parent_id": "t1_gtn7ijj",
                                                                            "score": 3,
                                                                            "created_utc": 1617763093.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "And those guys are delusional",
                    "author": "AlaskanSnowDragon",
                    "id": "gtmlv5y",
                    "parent_id": "t1_gtmlbvz",
                    "score": -1,
                    "created_utc": 1617751167.0,
                    "replies": [
                        {
                            "body": "You’re completely contradictory. Just enjoy picking on the women eh? 🤦🏻‍♀️🤦🏻‍♀️ Goodbye. Blocking you.",
                            "author": "ExExpectations",
                            "id": "gtmmb6b",
                            "parent_id": "t1_gtmlv5y",
                            "score": 1,
                            "created_utc": 1617751382.0,
                            "replies": [
                                {
                                    "body": "😘",
                                    "author": "AlaskanSnowDragon",
                                    "id": "gtmmf0p",
                                    "parent_id": "t1_gtmmb6b",
                                    "score": 0,
                                    "created_utc": 1617751437.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "They can keep telling themselves that as long as they’re paying",
            "author": "scumbagprincess1991",
            "id": "gtmw0a1",
            "parent_id": "t1_gtmlbvz",
            "score": 3,
            "created_utc": 1617756344.0,
            "replies": [
                {
                    "body": "Paying. But it’s not a form of sw! \n\nOh the irony 😂",
                    "author": "ExExpectations",
                    "id": "gtmzazy",
                    "parent_id": "t1_gtmw0a1",
                    "score": 2,
                    "created_utc": 1617758030.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gtn455l",
                            "parent_id": "t1_gtmzazy",
                            "score": 2,
                            "created_utc": 1617760472.0,
                            "replies": [
                                {
                                    "body": "Same. \n\nBut what goes on here, does affect what happens out there too, to some degree. Sometimes much more than I/we want (and largely in quite negative ways, to SBs)...",
                                    "author": "ExExpectations",
                                    "id": "gtn4qtw",
                                    "parent_id": "t1_gtn455l",
                                    "score": 2,
                                    "created_utc": 1617760790.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gtn5p3d",
                                            "parent_id": "t1_gtn4qtw",
                                            "score": 2,
                                            "created_utc": 1617761292.0,
                                            "replies": [
                                                {
                                                    "body": "To be clear, I’ve only been within the sugar world. Not escort or onlyfans or other types of sw.\n\nI agree though, many men aren’t exactly SDs... :(",
                                                    "author": "ExExpectations",
                                                    "id": "gtn6gen",
                                                    "parent_id": "t1_gtn5p3d",
                                                    "score": 2,
                                                    "created_utc": 1617761704.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "gtn7ijj",
                                                            "parent_id": "t1_gtn6gen",
                                                            "score": 2,
                                                            "created_utc": 1617762267.0,
                                                            "replies": [
                                                                {
                                                                    "body": "For sure I’ve had been in “relationships” with Johnny or John-Lites masquerading as SDs. Sigh.\n\nDefinitely overlaps in the Venn.",
                                                                    "author": "ExExpectations",
                                                                    "id": "gtn9192",
                                                                    "parent_id": "t1_gtn7ijj",
                                                                    "score": 3,
                                                                    "created_utc": 1617763093.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And those guys are delusional",
            "author": "AlaskanSnowDragon",
            "id": "gtmlv5y",
            "parent_id": "t1_gtmlbvz",
            "score": -1,
            "created_utc": 1617751167.0,
            "replies": [
                {
                    "body": "You’re completely contradictory. Just enjoy picking on the women eh? 🤦🏻‍♀️🤦🏻‍♀️ Goodbye. Blocking you.",
                    "author": "ExExpectations",
                    "id": "gtmmb6b",
                    "parent_id": "t1_gtmlv5y",
                    "score": 1,
                    "created_utc": 1617751382.0,
                    "replies": [
                        {
                            "body": "😘",
                            "author": "AlaskanSnowDragon",
                            "id": "gtmmf0p",
                            "parent_id": "t1_gtmmb6b",
                            "score": 0,
                            "created_utc": 1617751437.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Paying. But it’s not a form of sw! \n\nOh the irony 😂",
            "author": "ExExpectations",
            "id": "gtmzazy",
            "parent_id": "t1_gtmw0a1",
            "score": 2,
            "created_utc": 1617758030.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtn455l",
                    "parent_id": "t1_gtmzazy",
                    "score": 2,
                    "created_utc": 1617760472.0,
                    "replies": [
                        {
                            "body": "Same. \n\nBut what goes on here, does affect what happens out there too, to some degree. Sometimes much more than I/we want (and largely in quite negative ways, to SBs)...",
                            "author": "ExExpectations",
                            "id": "gtn4qtw",
                            "parent_id": "t1_gtn455l",
                            "score": 2,
                            "created_utc": 1617760790.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gtn5p3d",
                                    "parent_id": "t1_gtn4qtw",
                                    "score": 2,
                                    "created_utc": 1617761292.0,
                                    "replies": [
                                        {
                                            "body": "To be clear, I’ve only been within the sugar world. Not escort or onlyfans or other types of sw.\n\nI agree though, many men aren’t exactly SDs... :(",
                                            "author": "ExExpectations",
                                            "id": "gtn6gen",
                                            "parent_id": "t1_gtn5p3d",
                                            "score": 2,
                                            "created_utc": 1617761704.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gtn7ijj",
                                                    "parent_id": "t1_gtn6gen",
                                                    "score": 2,
                                                    "created_utc": 1617762267.0,
                                                    "replies": [
                                                        {
                                                            "body": "For sure I’ve had been in “relationships” with Johnny or John-Lites masquerading as SDs. Sigh.\n\nDefinitely overlaps in the Venn.",
                                                            "author": "ExExpectations",
                                                            "id": "gtn9192",
                                                            "parent_id": "t1_gtn7ijj",
                                                            "score": 3,
                                                            "created_utc": 1617763093.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You’re completely contradictory. Just enjoy picking on the women eh? 🤦🏻‍♀️🤦🏻‍♀️ Goodbye. Blocking you.",
            "author": "ExExpectations",
            "id": "gtmmb6b",
            "parent_id": "t1_gtmlv5y",
            "score": 1,
            "created_utc": 1617751382.0,
            "replies": [
                {
                    "body": "😘",
                    "author": "AlaskanSnowDragon",
                    "id": "gtmmf0p",
                    "parent_id": "t1_gtmmb6b",
                    "score": 0,
                    "created_utc": 1617751437.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtn455l",
            "parent_id": "t1_gtmzazy",
            "score": 2,
            "created_utc": 1617760472.0,
            "replies": [
                {
                    "body": "Same. \n\nBut what goes on here, does affect what happens out there too, to some degree. Sometimes much more than I/we want (and largely in quite negative ways, to SBs)...",
                    "author": "ExExpectations",
                    "id": "gtn4qtw",
                    "parent_id": "t1_gtn455l",
                    "score": 2,
                    "created_utc": 1617760790.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gtn5p3d",
                            "parent_id": "t1_gtn4qtw",
                            "score": 2,
                            "created_utc": 1617761292.0,
                            "replies": [
                                {
                                    "body": "To be clear, I’ve only been within the sugar world. Not escort or onlyfans or other types of sw.\n\nI agree though, many men aren’t exactly SDs... :(",
                                    "author": "ExExpectations",
                                    "id": "gtn6gen",
                                    "parent_id": "t1_gtn5p3d",
                                    "score": 2,
                                    "created_utc": 1617761704.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gtn7ijj",
                                            "parent_id": "t1_gtn6gen",
                                            "score": 2,
                                            "created_utc": 1617762267.0,
                                            "replies": [
                                                {
                                                    "body": "For sure I’ve had been in “relationships” with Johnny or John-Lites masquerading as SDs. Sigh.\n\nDefinitely overlaps in the Venn.",
                                                    "author": "ExExpectations",
                                                    "id": "gtn9192",
                                                    "parent_id": "t1_gtn7ijj",
                                                    "score": 3,
                                                    "created_utc": 1617763093.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "😘",
            "author": "AlaskanSnowDragon",
            "id": "gtmmf0p",
            "parent_id": "t1_gtmmb6b",
            "score": 0,
            "created_utc": 1617751437.0,
            "replies": []
        },
        {
            "body": "Same. \n\nBut what goes on here, does affect what happens out there too, to some degree. Sometimes much more than I/we want (and largely in quite negative ways, to SBs)...",
            "author": "ExExpectations",
            "id": "gtn4qtw",
            "parent_id": "t1_gtn455l",
            "score": 2,
            "created_utc": 1617760790.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtn5p3d",
                    "parent_id": "t1_gtn4qtw",
                    "score": 2,
                    "created_utc": 1617761292.0,
                    "replies": [
                        {
                            "body": "To be clear, I’ve only been within the sugar world. Not escort or onlyfans or other types of sw.\n\nI agree though, many men aren’t exactly SDs... :(",
                            "author": "ExExpectations",
                            "id": "gtn6gen",
                            "parent_id": "t1_gtn5p3d",
                            "score": 2,
                            "created_utc": 1617761704.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gtn7ijj",
                                    "parent_id": "t1_gtn6gen",
                                    "score": 2,
                                    "created_utc": 1617762267.0,
                                    "replies": [
                                        {
                                            "body": "For sure I’ve had been in “relationships” with Johnny or John-Lites masquerading as SDs. Sigh.\n\nDefinitely overlaps in the Venn.",
                                            "author": "ExExpectations",
                                            "id": "gtn9192",
                                            "parent_id": "t1_gtn7ijj",
                                            "score": 3,
                                            "created_utc": 1617763093.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtn5p3d",
            "parent_id": "t1_gtn4qtw",
            "score": 2,
            "created_utc": 1617761292.0,
            "replies": [
                {
                    "body": "To be clear, I’ve only been within the sugar world. Not escort or onlyfans or other types of sw.\n\nI agree though, many men aren’t exactly SDs... :(",
                    "author": "ExExpectations",
                    "id": "gtn6gen",
                    "parent_id": "t1_gtn5p3d",
                    "score": 2,
                    "created_utc": 1617761704.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gtn7ijj",
                            "parent_id": "t1_gtn6gen",
                            "score": 2,
                            "created_utc": 1617762267.0,
                            "replies": [
                                {
                                    "body": "For sure I’ve had been in “relationships” with Johnny or John-Lites masquerading as SDs. Sigh.\n\nDefinitely overlaps in the Venn.",
                                    "author": "ExExpectations",
                                    "id": "gtn9192",
                                    "parent_id": "t1_gtn7ijj",
                                    "score": 3,
                                    "created_utc": 1617763093.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "To be clear, I’ve only been within the sugar world. Not escort or onlyfans or other types of sw.\n\nI agree though, many men aren’t exactly SDs... :(",
            "author": "ExExpectations",
            "id": "gtn6gen",
            "parent_id": "t1_gtn5p3d",
            "score": 2,
            "created_utc": 1617761704.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtn7ijj",
                    "parent_id": "t1_gtn6gen",
                    "score": 2,
                    "created_utc": 1617762267.0,
                    "replies": [
                        {
                            "body": "For sure I’ve had been in “relationships” with Johnny or John-Lites masquerading as SDs. Sigh.\n\nDefinitely overlaps in the Venn.",
                            "author": "ExExpectations",
                            "id": "gtn9192",
                            "parent_id": "t1_gtn7ijj",
                            "score": 3,
                            "created_utc": 1617763093.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtn7ijj",
            "parent_id": "t1_gtn6gen",
            "score": 2,
            "created_utc": 1617762267.0,
            "replies": [
                {
                    "body": "For sure I’ve had been in “relationships” with Johnny or John-Lites masquerading as SDs. Sigh.\n\nDefinitely overlaps in the Venn.",
                    "author": "ExExpectations",
                    "id": "gtn9192",
                    "parent_id": "t1_gtn7ijj",
                    "score": 3,
                    "created_utc": 1617763093.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For sure I’ve had been in “relationships” with Johnny or John-Lites masquerading as SDs. Sigh.\n\nDefinitely overlaps in the Venn.",
            "author": "ExExpectations",
            "id": "gtn9192",
            "parent_id": "t1_gtn7ijj",
            "score": 3,
            "created_utc": 1617763093.0,
            "replies": []
        }
    ]
}