{
    "title": "SB's stay safe: Personal Alarm recommendation",
    "post_id": "q6musy",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/q6musy/sbs_stay_safe_personal_alarm_recommendation/",
    "author": "TwerkingAvocado",
    "body": "The most important part of any arrangement is your safety. The amount of violence toward women is horrific. We all know the stats. Sadly, the sugar world is no different, and potentially worse.\n\nThere is a lot of great advice in this forum to help you stay safe. Read it, take your time, be careful, trust your instincts.\n\nBut I also recommend having a personal alarm (I give these to my SB's). It's a safe way to attract attention and stop an attack in many situations (including a hotel room). If you are a SB and you aren't carrying some sort of personal protection please consider picking up something like this:\n\n[https://www.amazon.com/Self-Defense-Siren-Keychain-Emergency/dp/B08CCCB58N/?\\_encoding=UTF8&pd\\_rd\\_w=Dhp6h&pf\\_rd\\_p=ed0a22d3-02a9-43b9-a7a8-2632c9eb2ad8&pf\\_rd\\_r=5Y4WKYDDQXJ2EXF0JPPD&pd\\_rd\\_r=124d6f2c-de1d-462f-acac-e286e1e1f9b2&pd\\_rd\\_wg=328AK&ref\\_=pd\\_gw\\_ci\\_mcx\\_mr\\_hp\\_atf\\_m&th=1](https://www.amazon.com/Self-Defense-Siren-Keychain-Emergency/dp/B08CCCB58N/?_encoding=UTF8&pd_rd_w=Dhp6h&pf_rd_p=ed0a22d3-02a9-43b9-a7a8-2632c9eb2ad8&pf_rd_r=5Y4WKYDDQXJ2EXF0JPPD&pd_rd_r=124d6f2c-de1d-462f-acac-e286e1e1f9b2&pd_rd_wg=328AK&ref_=pd_gw_ci_mcx_mr_hp_atf_m&th=1)\n\nIf bills are super tight and you can't find an extra $20, DM me and I will buy it for you. If you don't want to share your address with a strange avocado then setup an amazon wishlist with your address marked private and I will order, pay for it and have it sent to you without having to see anything about you (delivering to a nearby Amazon Lockbox is also valid).\n\nStay safe.\n\n**10/12/21 update:** I've gone through all my DM's and ordered alarms for everyone that requested one. They are on their way. Please let me know if I missed you, I got a lot of requests (and a lot of sweet personal messages). The offer is still open for anyone who needs it.\n\n**10/13/21 update:** I've gone through all my DM's and ordered alarms for everyone that requested one. As above, please let me know if I missed anyone. Hopefully this coming weekend is a little safer for everyone.\n\n**10/14/21 update:** Alarms have gone out to everyone that requested one. The first people should be receiving their alarms today. Today will be the last day to contact me to get an alarm.\n\n**10/15/21 update:** The offer is over. Alarms have been sent around the world. If you have already requested one and we are waiting for you to setup a wishlist or add your address I'll still send it when you are ready. Thank you to everyone who posted their words of encouragement and advice here to help keep SB's safe. Operation 'TA protects the T&A' was a success.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/q6musy/sbs_stay_safe_personal_alarm_recommendation/",
    "score": 206,
    "upvote_ratio": 0.96,
    "created_utc": 1634047289.0,
    "num_comments": 51,
    "links": [
        [
            "https://www.amazon.com/Self-Defense-Siren-Keychain-Emergency/dp/B08CCCB58N/?_encoding=UTF8&pd_rd_w=Dhp6h&pf_rd_p=ed0a22d3-02a9-43b9-a7a8-2632c9eb2ad8&pf_rd_r=5Y4WKYDDQXJ2EXF0JPPD&pd_rd_r=124d6f2c-de1d-462f-acac-e286e1e1f9b2&pd_rd_wg=328AK&ref_=pd_gw_ci_mcx_mr_hp_atf_m&th=1"
        ]
    ],
    "comments": [
        {
            "body": "This is so sweet!",
            "author": null,
            "id": "hgdevkm",
            "parent_id": "t3_q6musy",
            "score": 18,
            "created_utc": 1634056703.0,
            "replies": []
        },
        {
            "body": "This is so nice and wholesome - the face of human kindness is an avocado and it's twerking",
            "author": "badmonopoly",
            "id": "hgf7sos",
            "parent_id": "t3_q6musy",
            "score": 14,
            "created_utc": 1634084118.0,
            "replies": []
        },
        {
            "body": "If you have an iPhone, there are shortcuts that also allow this. For example, holding the power button and a volume button down for 7s turns on an emergency siren. For older iPhones, you tap the power button 5 times or something. It’s worth learning.",
            "author": "LiliaTheSuccubus",
            "id": "hgg98tz",
            "parent_id": "t3_q6musy",
            "score": 8,
            "created_utc": 1634103407.0,
            "replies": [
                {
                    "body": "This is great feedback. Thank you for sharing.",
                    "author": "TwerkingAvocado",
                    "id": "hgh1114",
                    "parent_id": "t1_hgg98tz",
                    "score": 3,
                    "created_utc": 1634126158.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you so much!  I knew I liked you the first time I saw your avocado twerk. :)",
            "author": null,
            "id": "hgdrgdn",
            "parent_id": "t3_q6musy",
            "score": 6,
            "created_utc": 1634061887.0,
            "replies": []
        },
        {
            "body": "This is very thoughtful, and kind. 🖤",
            "author": "Cdnsugarr",
            "id": "hgdjqit",
            "parent_id": "t3_q6musy",
            "score": 6,
            "created_utc": 1634058728.0,
            "replies": []
        },
        {
            "body": "This is the sweetest thing.",
            "author": "sweeteggie",
            "id": "hgdw9he",
            "parent_id": "t3_q6musy",
            "score": 3,
            "created_utc": 1634063864.0,
            "replies": []
        },
        {
            "body": "TA, great post. I have been giving pepper sprays to the lovely ladies in my life for years. Any reason to choose a personal alarm over the spray?",
            "author": "PB6161",
            "id": "hgcz4pe",
            "parent_id": "t3_q6musy",
            "score": 7,
            "created_utc": 1634050224.0,
            "replies": [
                {
                    "body": "Maybe I just have a lot of acquaintances who don’t do well in high pressure situations, but I know quite a few who have aimed the wrong way and accidentally sprayed themselves.",
                    "author": null,
                    "id": "hgd2scm",
                    "parent_id": "t1_hgcz4pe",
                    "score": 14,
                    "created_utc": 1634051783.0,
                    "replies": [
                        {
                            "body": "That’s exactly why many self-defense trainers dissuade people from carrying weapons. It’s likely that the weapon will be used improperly or the attacker will take it away and use it against you.",
                            "author": "HereToStirItUp",
                            "id": "hgdhria",
                            "parent_id": "t1_hgd2scm",
                            "score": 4,
                            "created_utc": 1634057894.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "My thinking there is a personal alarm is better in a small space, like a hotel room. The spray also requires aim and focus. It is difficult to use effectively if someone is grabbing you. With the alarm you just hit the button.",
                    "author": "TwerkingAvocado",
                    "id": "hgd01br",
                    "parent_id": "t1_hgcz4pe",
                    "score": 12,
                    "created_utc": 1634050615.0,
                    "replies": []
                },
                {
                    "body": "Lot's of good suggestions but the first thing that needs to be armed is your brain,  to recognize the signs of danger (and get out of the denial mode)  early.  \n\nWhile SA triggers Seeking Arrangement visions lust and liquidity in most of our brains it should also trigger the alternate message  Situational Awareness.  \n\nThere's no better place than reading Gavin deBecker's  Gift of Fear  AND watching some of his lectures (youtube) directed towards young women. \n\nThis is probably his best lecture aimed at women....  https://www.youtube.com/watch?v=zNtXjIiJ0PU\n\nBy way of background his clients have included Presidents, police departments, businesses.  In the pre computer days Police Departments often used his questionnaire to evaluate the probability of domestic violence through asking the potential victim 20 questions.   Sadly the LAPD officers responding to OJ Simpson's wife's complaints never did this as he would have scored a perfect 20/20  where something like 14/20 was considered a very significant risk.  \n\ndeBecker has made a computerized version of the questionnaire, modified for different situations, available on the internet .   Recently I had the wife of someone suffering from combat related PTSD run the analysis while I ran it from just what I knew to be fact.  We both came up with a very troubling answer and similar results that have motivated us to become much more proactive.",
                    "author": "pinotandsugar",
                    "id": "hgdn13c",
                    "parent_id": "t1_hgcz4pe",
                    "score": 12,
                    "created_utc": 1634060086.0,
                    "replies": [
                        {
                            "body": "Excellent point. The best solution is to avoid a bad situation to begin with. Thanks for the detailed post. I hope SBs here read it",
                            "author": "PB6161",
                            "id": "hgdrahl",
                            "parent_id": "t1_hgdn13c",
                            "score": 4,
                            "created_utc": 1634061818.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Not legal in Canada",
                    "author": "GirlybutNerdy",
                    "id": "hge4hk9",
                    "parent_id": "t1_hgcz4pe",
                    "score": 1,
                    "created_utc": 1634067204.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hgcvu0a",
            "parent_id": "t3_q6musy",
            "score": 11,
            "created_utc": 1634048795.0,
            "replies": [
                {
                    "body": "*laughs in european*",
                    "author": "ok-person-at-eating",
                    "id": "hgdb9r5",
                    "parent_id": "t1_hgcvu0a",
                    "score": 10,
                    "created_utc": 1634055231.0,
                    "replies": []
                },
                {
                    "body": "Apologies for the length and the deviation from the normal delicious discussions of sugar pleasures...... \n\nHighly recommend Krav Maga for young women for its self defense uses and as a great exercise and a confidence builder.  Its goal was to create an easy to learn series of self defense techniques that cover the most common situations. \n\n Where female students are involved the emphasis is on deterring a larger, stronger opponent by focusing on vulnerabilities sufficient to break contact or discourage further intent, using women's greater flexibility, superior ability to follow instructions and sharp nails. \n\nThe goal is not to defeat the threat in hand to hand combat but rather to prevent his gaining control, cause damage/pain ,  break contact and escape. \n\nOne other thought that deBecker emphasizes that is relevant to M&G situations is the danger of getting into or being forced into a car by someone who intends to abuse you justifies the use of virtually any means of escape. \n\n.",
                    "author": "pinotandsugar",
                    "id": "hgdrulo",
                    "parent_id": "t1_hgcvu0a",
                    "score": 6,
                    "created_utc": 1634062051.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Upvoted cause this is important",
            "author": "Obv_Dreamer",
            "id": "hgfafnm",
            "parent_id": "t3_q6musy",
            "score": 3,
            "created_utc": 1634085354.0,
            "replies": []
        },
        {
            "body": "I didn't know avocados could be so sweet!",
            "author": null,
            "id": "hgfh7a3",
            "parent_id": "t3_q6musy",
            "score": 3,
            "created_utc": 1634088468.0,
            "replies": []
        },
        {
            "body": "You're an awesome person.  Thanks for looking out for folks!",
            "author": "usernema",
            "id": "hgfw7ep",
            "parent_id": "t3_q6musy",
            "score": 3,
            "created_utc": 1634095751.0,
            "replies": []
        },
        {
            "body": "This is such a wonderful and sweet post, thank you for this!",
            "author": "verryberrymuch",
            "id": "hgg3bng",
            "parent_id": "t3_q6musy",
            "score": 3,
            "created_utc": 1634099657.0,
            "replies": []
        },
        {
            "body": "Post of the month, folks. And probably of the year. OP, you hero, you!",
            "author": "chairman212121",
            "id": "hghf1st",
            "parent_id": "t3_q6musy",
            "score": 3,
            "created_utc": 1634133513.0,
            "replies": []
        },
        {
            "body": "I will order, pay for it and have it sent to you \n\nClassy Avocado!",
            "author": "GSSD",
            "id": "hghqoks",
            "parent_id": "t3_q6musy",
            "score": 3,
            "created_utc": 1634138390.0,
            "replies": []
        },
        {
            "body": "This is incredibly kind of you to offer!",
            "author": "glittered437737",
            "id": "hgddm5w",
            "parent_id": "t3_q6musy",
            "score": 6,
            "created_utc": 1634056189.0,
            "replies": [
                {
                    "body": "If it helps one girl it will be the best money I ever spent.",
                    "author": "TwerkingAvocado",
                    "id": "hgdf371",
                    "parent_id": "t1_hgddm5w",
                    "score": 10,
                    "created_utc": 1634056788.0,
                    "replies": [
                        {
                            "body": "🥲",
                            "author": "glittered437737",
                            "id": "hgdfpg1",
                            "parent_id": "t1_hgdf371",
                            "score": 1,
                            "created_utc": 1634057040.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I do have a question about this product. It looks like you have to disengage a pin, not just push a button. So if a woman has this on her keychain in a hotel room sitting on a bedside table, and she is coerced or forced sexually, it doesn't seem like it would help her much if she can't reach it. Do any of you know anyone who is actually used this?",
            "author": null,
            "id": "hge37vz",
            "parent_id": "t3_q6musy",
            "score": 2,
            "created_utc": 1634066696.0,
            "replies": [
                {
                    "body": "That is true. You need to pull out the pin. A button would be to easy to set off.",
                    "author": "TwerkingAvocado",
                    "id": "hge3qys",
                    "parent_id": "t1_hge37vz",
                    "score": 1,
                    "created_utc": 1634066905.0,
                    "replies": [
                        {
                            "body": "Yes, I agree. Just want to not create a false sense of security for a woman if she's alone with a man, especially naked or undressing.",
                            "author": null,
                            "id": "hge49xj",
                            "parent_id": "t1_hge3qys",
                            "score": 2,
                            "created_utc": 1634067116.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You, sir, are awesome!",
            "author": "MrRhoarke",
            "id": "hgemw9v",
            "parent_id": "t3_q6musy",
            "score": 2,
            "created_utc": 1634074732.0,
            "replies": []
        },
        {
            "body": "This is sooooo sweet, I definitely like you more now!",
            "author": "QueenLeo1998",
            "id": "hgj7srx",
            "parent_id": "t3_q6musy",
            "score": 2,
            "created_utc": 1634159841.0,
            "replies": []
        },
        {
            "body": "this is so sweet omg...so sad i missed it.",
            "author": "terrible_Khonie",
            "id": "ihwoiev",
            "parent_id": "t3_q6musy",
            "score": 2,
            "created_utc": 1658957423.0,
            "replies": []
        },
        {
            "body": "wow this is such a nice thing to do! 🥹 everytime i see posts like this or experience this level of care, i always find myself reflecting on how i (or any person) deserves to be treated",
            "author": "heraclituris",
            "id": "iunkqz0",
            "parent_id": "t3_q6musy",
            "score": 2,
            "created_utc": 1667325926.0,
            "replies": []
        },
        {
            "body": "Who’s better than you, TA?  Nobody, I say!  👏🏻👍🏻👏🏻👍🏻👏🏻",
            "author": "Chill_SD1974",
            "id": "hgds7e5",
            "parent_id": "t3_q6musy",
            "score": 4,
            "created_utc": 1634062200.0,
            "replies": []
        },
        {
            "body": "You’re a lovely man for offering that. \n\nPSA to anyone taking up his kind offer: Some amazon drivers take pics of the item at delivery time and upload it to the purchaser’s account.. and sometimes, the address label is viewable in the picture.",
            "author": "Throwawayalways666",
            "id": "hgei1vp",
            "parent_id": "t3_q6musy",
            "score": 2,
            "created_utc": 1634072717.0,
            "replies": [
                {
                    "body": "I’ve never seen that while ordering from a private wishlist. That would undermine Amazon’s whole purpose in adding that feature. And make me concerned for the OF girls that use this heavily and really don’t want their fans knowing where they live.\n\nBut, I certainly want everyone to be safe so if anyone is concerned about this feel free to use the Amazon lockbox option.",
                    "author": "TwerkingAvocado",
                    "id": "hgeixa2",
                    "parent_id": "t1_hgei1vp",
                    "score": 3,
                    "created_utc": 1634073074.0,
                    "replies": [
                        {
                            "body": "From Amazon:   \nIf your address is marked as confidential, to protect your privacy, we don't post a delivery photo. Addresses marked as confidential include Wish List or registry addresses.  \n\n\nhttps://www.amazon.com/gp/help/customer/display.html?nodeId=GEE76GMYKN4HEYLK",
                            "author": "Gentlemistress_Beth",
                            "id": "hgekp20",
                            "parent_id": "t1_hgeixa2",
                            "score": 8,
                            "created_utc": 1634073813.0,
                            "replies": [
                                {
                                    "body": "Awesome. Thank you for checking that out.",
                                    "author": "TwerkingAvocado",
                                    "id": "hgel4sk",
                                    "parent_id": "t1_hgekp20",
                                    "score": 5,
                                    "created_utc": 1634073995.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't feel safe going on dates with POTs without playing some Playstation games before. Unfortunately, I don't have a PS5. Can you please buy one for me? Thanks!! 🤗🤗🤗",
            "author": "non_giant_panda",
            "id": "hgdxhij",
            "parent_id": "t3_q6musy",
            "score": 2,
            "created_utc": 1634064356.0,
            "replies": [
                {
                    "body": "Same here please",
                    "author": "Church42",
                    "id": "hgdy7ii",
                    "parent_id": "t1_hgdxhij",
                    "score": 0,
                    "created_utc": 1634064648.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Very nice Sir, sincerely. I am a long-time former U.S. Military Officer and as a very \"different\" atypical assignment I served for a period of time on a very high-ranking (and  later quite famous) Flag Rank Officers Personal Security Detail/Detachment. Most certainly a very unique and interesting assignment!  Protection of just one person as opposed to being a member of \"The Force\" as a large group of military people doing what we were asked/ordered/expected by the American People to do...I make a higher income now, but there is no question in my mind those years wearing a \"tree suit\" were the most personally professionally rewarding of my life!! The friendships both with those I served with and people of other cultures and countries was so satisfying! I don't like young women (or any human for that matter) to have to have a constant feeling of apprehension/fear but it is wise to be forward thinking and assess one's personal tolerance for safety risk. This I would believe could be a wise choice!",
            "author": "puckhead4",
            "id": "hgcwk8y",
            "parent_id": "t3_q6musy",
            "score": -1,
            "created_utc": 1634049108.0,
            "replies": []
        },
        {
            "body": "I live in a firearm friendly state, so I offer to take my SBs to the range if they want to learn to shoot. Not a flex, just a statement.",
            "author": "squareC1999",
            "id": "hges2w5",
            "parent_id": "t3_q6musy",
            "score": 0,
            "created_utc": 1634076951.0,
            "replies": [
                {
                    "body": "I love the shooting range. I’m a damn good shot too. SDs seem to love that sort of thing. \nHumble flex and totally worth flexing IMO",
                    "author": null,
                    "id": "hh7svi2",
                    "parent_id": "t1_hges2w5",
                    "score": 4,
                    "created_utc": 1634638900.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m a long time martial arts nerd and licensed concealed carrier. \n\nI recommend Tim Larkin’s training for people who just wanna learn to defend themselves. Gavin De Becker’s books are also essential. \n\nKrav, close quarters combat courses or any martial art can be a mixed bag. I’ve met more bad teachers than good. If you have the time and discipline to really get into it and sort the wheat from the chaff, great. But if not, at least learn to trust your gut and gouge some eyes.",
            "author": "Pronicator",
            "id": "hggsbtd",
            "parent_id": "t3_q6musy",
            "score": 0,
            "created_utc": 1634119883.0,
            "replies": []
        },
        {
            "body": "savior of woman is here fellas",
            "author": "naIamgood",
            "id": "hi4rmn1",
            "parent_id": "t3_q6musy",
            "score": 0,
            "created_utc": 1635265866.0,
            "replies": []
        },
        {
            "body": "Can I give you my PayPal so I can order it myself?\n🥺",
            "author": "Neko333Kitsune",
            "id": "hgcvqul",
            "parent_id": "t3_q6musy",
            "score": -6,
            "created_utc": 1634048757.0,
            "replies": [
                {
                    "body": "No, sorry. I won’t be paypal’ing anyone cash. \n\nBut you can setup an Amazon wishlist with your name and address private and I will pay for it so Amazon will ship it to you without giving me any of your info.",
                    "author": "TwerkingAvocado",
                    "id": "hgcxhb1",
                    "parent_id": "t1_hgcvqul",
                    "score": 14,
                    "created_utc": 1634049513.0,
                    "replies": [
                        {
                            "body": "It was a joke. 🙃\n\nI'll probably order one myself though, so thanks!",
                            "author": "Neko333Kitsune",
                            "id": "hgcxmzp",
                            "parent_id": "t1_hgcxhb1",
                            "score": 1,
                            "created_utc": 1634049582.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hi I tried to dm you idk if I did it correctly.",
            "author": "Woahyeah1",
            "id": "hhi4sod",
            "parent_id": "t3_q6musy",
            "score": 1,
            "created_utc": 1634831458.0,
            "replies": [
                {
                    "body": "You did. Replying now.",
                    "author": "TwerkingAvocado",
                    "id": "hhi82lt",
                    "parent_id": "t1_hhi4sod",
                    "score": 1,
                    "created_utc": 1634832804.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is great feedback. Thank you for sharing.",
            "author": "TwerkingAvocado",
            "id": "hgh1114",
            "parent_id": "t1_hgg98tz",
            "score": 3,
            "created_utc": 1634126158.0,
            "replies": []
        },
        {
            "body": "Maybe I just have a lot of acquaintances who don’t do well in high pressure situations, but I know quite a few who have aimed the wrong way and accidentally sprayed themselves.",
            "author": null,
            "id": "hgd2scm",
            "parent_id": "t1_hgcz4pe",
            "score": 14,
            "created_utc": 1634051783.0,
            "replies": [
                {
                    "body": "That’s exactly why many self-defense trainers dissuade people from carrying weapons. It’s likely that the weapon will be used improperly or the attacker will take it away and use it against you.",
                    "author": "HereToStirItUp",
                    "id": "hgdhria",
                    "parent_id": "t1_hgd2scm",
                    "score": 4,
                    "created_utc": 1634057894.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My thinking there is a personal alarm is better in a small space, like a hotel room. The spray also requires aim and focus. It is difficult to use effectively if someone is grabbing you. With the alarm you just hit the button.",
            "author": "TwerkingAvocado",
            "id": "hgd01br",
            "parent_id": "t1_hgcz4pe",
            "score": 12,
            "created_utc": 1634050615.0,
            "replies": []
        },
        {
            "body": "Lot's of good suggestions but the first thing that needs to be armed is your brain,  to recognize the signs of danger (and get out of the denial mode)  early.  \n\nWhile SA triggers Seeking Arrangement visions lust and liquidity in most of our brains it should also trigger the alternate message  Situational Awareness.  \n\nThere's no better place than reading Gavin deBecker's  Gift of Fear  AND watching some of his lectures (youtube) directed towards young women. \n\nThis is probably his best lecture aimed at women....  https://www.youtube.com/watch?v=zNtXjIiJ0PU\n\nBy way of background his clients have included Presidents, police departments, businesses.  In the pre computer days Police Departments often used his questionnaire to evaluate the probability of domestic violence through asking the potential victim 20 questions.   Sadly the LAPD officers responding to OJ Simpson's wife's complaints never did this as he would have scored a perfect 20/20  where something like 14/20 was considered a very significant risk.  \n\ndeBecker has made a computerized version of the questionnaire, modified for different situations, available on the internet .   Recently I had the wife of someone suffering from combat related PTSD run the analysis while I ran it from just what I knew to be fact.  We both came up with a very troubling answer and similar results that have motivated us to become much more proactive.",
            "author": "pinotandsugar",
            "id": "hgdn13c",
            "parent_id": "t1_hgcz4pe",
            "score": 12,
            "created_utc": 1634060086.0,
            "replies": [
                {
                    "body": "Excellent point. The best solution is to avoid a bad situation to begin with. Thanks for the detailed post. I hope SBs here read it",
                    "author": "PB6161",
                    "id": "hgdrahl",
                    "parent_id": "t1_hgdn13c",
                    "score": 4,
                    "created_utc": 1634061818.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not legal in Canada",
            "author": "GirlybutNerdy",
            "id": "hge4hk9",
            "parent_id": "t1_hgcz4pe",
            "score": 1,
            "created_utc": 1634067204.0,
            "replies": []
        },
        {
            "body": "*laughs in european*",
            "author": "ok-person-at-eating",
            "id": "hgdb9r5",
            "parent_id": "t1_hgcvu0a",
            "score": 10,
            "created_utc": 1634055231.0,
            "replies": []
        },
        {
            "body": "Apologies for the length and the deviation from the normal delicious discussions of sugar pleasures...... \n\nHighly recommend Krav Maga for young women for its self defense uses and as a great exercise and a confidence builder.  Its goal was to create an easy to learn series of self defense techniques that cover the most common situations. \n\n Where female students are involved the emphasis is on deterring a larger, stronger opponent by focusing on vulnerabilities sufficient to break contact or discourage further intent, using women's greater flexibility, superior ability to follow instructions and sharp nails. \n\nThe goal is not to defeat the threat in hand to hand combat but rather to prevent his gaining control, cause damage/pain ,  break contact and escape. \n\nOne other thought that deBecker emphasizes that is relevant to M&G situations is the danger of getting into or being forced into a car by someone who intends to abuse you justifies the use of virtually any means of escape. \n\n.",
            "author": "pinotandsugar",
            "id": "hgdrulo",
            "parent_id": "t1_hgcvu0a",
            "score": 6,
            "created_utc": 1634062051.0,
            "replies": []
        },
        {
            "body": "If it helps one girl it will be the best money I ever spent.",
            "author": "TwerkingAvocado",
            "id": "hgdf371",
            "parent_id": "t1_hgddm5w",
            "score": 10,
            "created_utc": 1634056788.0,
            "replies": [
                {
                    "body": "🥲",
                    "author": "glittered437737",
                    "id": "hgdfpg1",
                    "parent_id": "t1_hgdf371",
                    "score": 1,
                    "created_utc": 1634057040.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is true. You need to pull out the pin. A button would be to easy to set off.",
            "author": "TwerkingAvocado",
            "id": "hge3qys",
            "parent_id": "t1_hge37vz",
            "score": 1,
            "created_utc": 1634066905.0,
            "replies": [
                {
                    "body": "Yes, I agree. Just want to not create a false sense of security for a woman if she's alone with a man, especially naked or undressing.",
                    "author": null,
                    "id": "hge49xj",
                    "parent_id": "t1_hge3qys",
                    "score": 2,
                    "created_utc": 1634067116.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ve never seen that while ordering from a private wishlist. That would undermine Amazon’s whole purpose in adding that feature. And make me concerned for the OF girls that use this heavily and really don’t want their fans knowing where they live.\n\nBut, I certainly want everyone to be safe so if anyone is concerned about this feel free to use the Amazon lockbox option.",
            "author": "TwerkingAvocado",
            "id": "hgeixa2",
            "parent_id": "t1_hgei1vp",
            "score": 3,
            "created_utc": 1634073074.0,
            "replies": [
                {
                    "body": "From Amazon:   \nIf your address is marked as confidential, to protect your privacy, we don't post a delivery photo. Addresses marked as confidential include Wish List or registry addresses.  \n\n\nhttps://www.amazon.com/gp/help/customer/display.html?nodeId=GEE76GMYKN4HEYLK",
                    "author": "Gentlemistress_Beth",
                    "id": "hgekp20",
                    "parent_id": "t1_hgeixa2",
                    "score": 8,
                    "created_utc": 1634073813.0,
                    "replies": [
                        {
                            "body": "Awesome. Thank you for checking that out.",
                            "author": "TwerkingAvocado",
                            "id": "hgel4sk",
                            "parent_id": "t1_hgekp20",
                            "score": 5,
                            "created_utc": 1634073995.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Same here please",
            "author": "Church42",
            "id": "hgdy7ii",
            "parent_id": "t1_hgdxhij",
            "score": 0,
            "created_utc": 1634064648.0,
            "replies": []
        },
        {
            "body": "I love the shooting range. I’m a damn good shot too. SDs seem to love that sort of thing. \nHumble flex and totally worth flexing IMO",
            "author": null,
            "id": "hh7svi2",
            "parent_id": "t1_hges2w5",
            "score": 4,
            "created_utc": 1634638900.0,
            "replies": []
        },
        {
            "body": "No, sorry. I won’t be paypal’ing anyone cash. \n\nBut you can setup an Amazon wishlist with your name and address private and I will pay for it so Amazon will ship it to you without giving me any of your info.",
            "author": "TwerkingAvocado",
            "id": "hgcxhb1",
            "parent_id": "t1_hgcvqul",
            "score": 14,
            "created_utc": 1634049513.0,
            "replies": [
                {
                    "body": "It was a joke. 🙃\n\nI'll probably order one myself though, so thanks!",
                    "author": "Neko333Kitsune",
                    "id": "hgcxmzp",
                    "parent_id": "t1_hgcxhb1",
                    "score": 1,
                    "created_utc": 1634049582.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You did. Replying now.",
            "author": "TwerkingAvocado",
            "id": "hhi82lt",
            "parent_id": "t1_hhi4sod",
            "score": 1,
            "created_utc": 1634832804.0,
            "replies": []
        },
        {
            "body": "That’s exactly why many self-defense trainers dissuade people from carrying weapons. It’s likely that the weapon will be used improperly or the attacker will take it away and use it against you.",
            "author": "HereToStirItUp",
            "id": "hgdhria",
            "parent_id": "t1_hgd2scm",
            "score": 4,
            "created_utc": 1634057894.0,
            "replies": []
        },
        {
            "body": "Excellent point. The best solution is to avoid a bad situation to begin with. Thanks for the detailed post. I hope SBs here read it",
            "author": "PB6161",
            "id": "hgdrahl",
            "parent_id": "t1_hgdn13c",
            "score": 4,
            "created_utc": 1634061818.0,
            "replies": []
        },
        {
            "body": "🥲",
            "author": "glittered437737",
            "id": "hgdfpg1",
            "parent_id": "t1_hgdf371",
            "score": 1,
            "created_utc": 1634057040.0,
            "replies": []
        },
        {
            "body": "Yes, I agree. Just want to not create a false sense of security for a woman if she's alone with a man, especially naked or undressing.",
            "author": null,
            "id": "hge49xj",
            "parent_id": "t1_hge3qys",
            "score": 2,
            "created_utc": 1634067116.0,
            "replies": []
        },
        {
            "body": "From Amazon:   \nIf your address is marked as confidential, to protect your privacy, we don't post a delivery photo. Addresses marked as confidential include Wish List or registry addresses.  \n\n\nhttps://www.amazon.com/gp/help/customer/display.html?nodeId=GEE76GMYKN4HEYLK",
            "author": "Gentlemistress_Beth",
            "id": "hgekp20",
            "parent_id": "t1_hgeixa2",
            "score": 8,
            "created_utc": 1634073813.0,
            "replies": [
                {
                    "body": "Awesome. Thank you for checking that out.",
                    "author": "TwerkingAvocado",
                    "id": "hgel4sk",
                    "parent_id": "t1_hgekp20",
                    "score": 5,
                    "created_utc": 1634073995.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It was a joke. 🙃\n\nI'll probably order one myself though, so thanks!",
            "author": "Neko333Kitsune",
            "id": "hgcxmzp",
            "parent_id": "t1_hgcxhb1",
            "score": 1,
            "created_utc": 1634049582.0,
            "replies": []
        },
        {
            "body": "Awesome. Thank you for checking that out.",
            "author": "TwerkingAvocado",
            "id": "hgel4sk",
            "parent_id": "t1_hgekp20",
            "score": 5,
            "created_utc": 1634073995.0,
            "replies": []
        }
    ]
}