{
    "title": "SDs - is it a turn-off when pot SBs are protective over their time? Story in comments.",
    "post_id": "10l1gk3",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/10l1gk3/sds_is_it_a_turnoff_when_pot_sbs_are_protective/",
    "author": "savrhys",
    "body": "",
    "url": "https://i.redd.it/ez2s69u039ea1.jpg",
    "score": 125,
    "upvote_ratio": 0.94,
    "created_utc": 1674661023.0,
    "num_comments": 119,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I’m a huge planner and my dates come with agendas to be respectful of her time and schedule. I don’t want her to worry about anything so she will know where we are going and about when everything is happening. And most importantly when to show up and the latest possible time she will be on her way back home.\n\nThis isn’t romantic. But it helps in so many ways. She may want to suggest tweaks to the schedule, want to know how to dress, be able to make the most of the rest of her day, be able to relax and know everything is taken care of, etc.\n\nSometimes the answer from her is that she has the whole day free. Sometimes we change plans in the moment. But I love having a plan in place.",
            "author": "TwerkingAvocado",
            "id": "j5u1ext",
            "parent_id": "t3_10l1gk3",
            "score": 156,
            "created_utc": 1674662005.0,
            "replies": [
                {
                    "body": "You are gold. Men with plans🙌❤️😍",
                    "author": "natayy",
                    "id": "j5v0dkh",
                    "parent_id": "t1_j5u1ext",
                    "score": 38,
                    "created_utc": 1674674944.0,
                    "replies": []
                },
                {
                    "body": "You are a beautiful person. A blanched knight in a world of darkness. I wish every SD could be like you.",
                    "author": "Sufficient_Rooster32",
                    "id": "j5ukw5f",
                    "parent_id": "t1_j5u1ext",
                    "score": 24,
                    "created_utc": 1674669311.0,
                    "replies": []
                },
                {
                    "body": "This is SO romantic. Not having to worry or try to politely get the guy to wrap it up when I need to leave? I’m in love.",
                    "author": "_lil_one_",
                    "id": "j5xgp5e",
                    "parent_id": "t1_j5u1ext",
                    "score": 12,
                    "created_utc": 1674712270.0,
                    "replies": []
                },
                {
                    "body": "You give me hope in humanity again 🫶🏻",
                    "author": "ccii22",
                    "id": "j5yd1w5",
                    "parent_id": "t1_j5u1ext",
                    "score": 3,
                    "created_utc": 1674736546.0,
                    "replies": []
                },
                {
                    "body": "That's awesome.  \n\n\n2145   Finish dinner \n2215   Arrive at SD home \n1116   Button 1 \n\n0645   Shower  together \n0747   Breakfast at LeBisket",
                    "author": "pinotandsugar",
                    "id": "j5uvcdo",
                    "parent_id": "t1_j5u1ext",
                    "score": 8,
                    "created_utc": 1674673089.0,
                    "replies": [
                        {
                            "body": "Lol. Sadly you aren't far off. The times aren't down to the minute and maybe not as specific as \"shower together\", but it typically will include links to the places we are going to so she can checkout the menu or venue for more info.",
                            "author": "TwerkingAvocado",
                            "id": "j5v08au",
                            "parent_id": "t1_j5uvcdo",
                            "score": 16,
                            "created_utc": 1674674891.0,
                            "replies": [
                                {
                                    "body": "Some people have that quirk or they are trying to maintain an element of control. Sometimes we address the symptoms rather than the underlying cause.\n\nFor the younger generation checking out the venue may just be part of the anticipatory fun and to make sure that they are prepared and do not miss anything .    Sometimes it is fun to sit at the computer and explore the menu or check out social media for comments regarding the menu or where one should ask for a table.",
                                    "author": "pinotandsugar",
                                    "id": "j5ve4q6",
                                    "parent_id": "t1_j5v08au",
                                    "score": 5,
                                    "created_utc": 1674679947.0,
                                    "replies": []
                                },
                                {
                                    "body": "I actually love your entire process and I, myself like to schedule time for “winging it” hahahaah. Thank you for being an awesome SD",
                                    "author": "kitkatsugarcat",
                                    "id": "j5x689v",
                                    "parent_id": "t1_j5v08au",
                                    "score": 3,
                                    "created_utc": 1674706462.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Honestly this is a great idea! Saves time and is respectfully for both parties. Kudos to you sir",
                    "author": "SBKoko",
                    "id": "j5viba9",
                    "parent_id": "t1_j5u1ext",
                    "score": 5,
                    "created_utc": 1674681456.0,
                    "replies": []
                },
                {
                    "body": "Do you guys take minutes, too? :) Hard to follow Roberts Rules with just 2 peeps... 🙃",
                    "author": "quietgrey1",
                    "id": "j5uc892",
                    "parent_id": "t1_j5u1ext",
                    "score": 6,
                    "created_utc": 1674666119.0,
                    "replies": [
                        {
                            "body": "She does take Dicktation",
                            "author": "TwerkingAvocado",
                            "id": "j5ueice",
                            "parent_id": "t1_j5uc892",
                            "score": 27,
                            "created_utc": 1674666977.0,
                            "replies": [
                                {
                                    "body": "I am deceased.",
                                    "author": "savrhys",
                                    "id": "j5uq161",
                                    "parent_id": "t1_j5ueice",
                                    "score": 2,
                                    "created_utc": 1674671173.0,
                                    "replies": [
                                        {
                                            "body": "same.",
                                            "author": "InteractionSalt2770",
                                            "id": "j5uvqkc",
                                            "parent_id": "t1_j5uq161",
                                            "score": 1,
                                            "created_utc": 1674673232.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I definitely got the escort vibe from the messages even before reading the story behind this. He “wants something discreet while in town” usually translate to meet at the hotel, have sex and leave until next time he’s in town. He does not sound interested in building a connection or doing activities just wants a cheap escort. I’d have not wasted a response after his “a few available others” response… Lmao, bye.",
            "author": "Latter_Ground6737",
            "id": "j5u9hz6",
            "parent_id": "t3_10l1gk3",
            "score": 76,
            "created_utc": 1674665090.0,
            "replies": [
                {
                    "body": "Thank you for the feedback and the specifics that made you suspicious- that’s very helpful for those of us still developing our radar in this dynamic! 🙌🏻",
                    "author": "savrhys",
                    "id": "j5ua34n",
                    "parent_id": "t1_j5u9hz6",
                    "score": 30,
                    "created_utc": 1674665310.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean it’s not unreasonable for you to ask him to describe what he wants to do - your time commitment is not open ended - it’s just basic courtesy \n\nMaybe next time word it differently? Say - “ I would love to meet up - what do you think we are doing ? So I can plan my time accordingly “\n\nIf someone balks at this , block and move on",
            "author": "OCbird22",
            "id": "j5tzl8o",
            "parent_id": "t3_10l1gk3",
            "score": 67,
            "created_utc": 1674661307.0,
            "replies": [
                {
                    "body": "Mostly this \\^ Was there supposed to be a story in addition to the pic? We only have a snippet, but that kinda sounds like an interview question. Maybe the prior comments did too, maybe not. The \"I'm not a pro\" is weird, but maybe makes sense in context. Asking how long, I'm sure that's what escorts ask, so I can see how he would be put off if that's too direct or too soon, but it's a reasonable question, if asked appropriately.\n\nBasically, no context or explanation... this just sounds like two people not having a productive conversation and then getting snippy and throwing a bunch of salt on their way out the door. Waste of time, just move on.",
                    "author": "NoLimitLexa",
                    "id": "j5u12be",
                    "parent_id": "t1_j5tzl8o",
                    "score": 16,
                    "created_utc": 1674661871.0,
                    "replies": [
                        {
                            "body": "In retrospect, I do agree that my response was a waste of time, but I was feelin a little defensive because I felt like I didn’t ask anything out of the ordinary for a true SD/SB dynamic.",
                            "author": "savrhys",
                            "id": "j5u2lbb",
                            "parent_id": "t1_j5u12be",
                            "score": 11,
                            "created_utc": 1674662449.0,
                            "replies": [
                                {
                                    "body": "I don't think you did anything wrong, communicating expectations seems to make sense to me",
                                    "author": "Hopehorizon12",
                                    "id": "j5x43fd",
                                    "parent_id": "t1_j5u2lbb",
                                    "score": 3,
                                    "created_utc": 1674705415.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How fortunate the trash took itself out so early on ☺️",
            "author": "Sunhillian",
            "id": "j5u9029",
            "parent_id": "t3_10l1gk3",
            "score": 44,
            "created_utc": 1674664906.0,
            "replies": [
                {
                    "body": "Thats kinda how I felt too hahahaha. Bless and release ✨",
                    "author": "savrhys",
                    "id": "j5ugsyq",
                    "parent_id": "t1_j5u9029",
                    "score": 10,
                    "created_utc": 1674667821.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So many words... \n\n\"That's unfortunate.  Best of luck.\" [Block].",
            "author": "rodeopete3281",
            "id": "j5u0zni",
            "parent_id": "t3_10l1gk3",
            "score": 27,
            "created_utc": 1674661843.0,
            "replies": [
                {
                    "body": ">\"That's unfortunate.  Best of luck.\"\n\nThis \\^\n\nFeel free to cut that a bit shorter if you want to. Do not expand under any circumstances.",
                    "author": "NoLimitLexa",
                    "id": "j5u1lyc",
                    "parent_id": "t1_j5u0zni",
                    "score": 10,
                    "created_utc": 1674662078.0,
                    "replies": []
                },
                {
                    "body": "I messaged a POT that it seemed like we'd be a good match on paper and as soon as he said \"doubt it\" i messaged that I was sorry to hear that and blocked him. If you have to respond at all, keep it short, sweet and block.",
                    "author": "iismelldaisiesii",
                    "id": "j5uorrs",
                    "parent_id": "t1_j5u0zni",
                    "score": 2,
                    "created_utc": 1674670720.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You have asked basic and reaaonable questions and this guy is looking for a SW. I would have not even sent your response. Just block and move on.",
            "author": "SugarDaddyinTraining",
            "id": "j5u7eys",
            "parent_id": "t3_10l1gk3",
            "score": 10,
            "created_utc": 1674664305.0,
            "replies": []
        },
        {
            "body": "“Quite a few available today”. First of all he’s a manipulative twat. Second he’s a blacklisted John or can’t afford an escort so he’s trying to scam naive sugar babies. Block and move on.",
            "author": "MsDReid",
            "id": "j5u6ihj",
            "parent_id": "t3_10l1gk3",
            "score": 39,
            "created_utc": 1674663963.0,
            "replies": [
                {
                    "body": ">“Quite a few available today”. First of all he’s a manipulative twat. \n\nYeah, because of the other issues, people have pretty much glossed over how awful this sentence is. Just... wow.",
                    "author": "NoLimitLexa",
                    "id": "j5u7zti",
                    "parent_id": "t1_j5u6ihj",
                    "score": 18,
                    "created_utc": 1674664528.0,
                    "replies": [
                        {
                            "body": "I think reading that sentence was what got me so triggered to respond with a lil salt haha",
                            "author": "savrhys",
                            "id": "j5uaslc",
                            "parent_id": "t1_j5u7zti",
                            "score": 15,
                            "created_utc": 1674665580.0,
                            "replies": []
                        },
                        {
                            "body": "Agreed. Let’s be real there ain’t nobody available for this John today 😂",
                            "author": null,
                            "id": "j5urd1h",
                            "parent_id": "t1_j5u7zti",
                            "score": 7,
                            "created_utc": 1674671651.0,
                            "replies": [
                                {
                                    "body": "sorry but what does John mean in this context? never heard this before 😂",
                                    "author": "spongykiwi",
                                    "id": "j5wks9g",
                                    "parent_id": "t1_j5urd1h",
                                    "score": 1,
                                    "created_utc": 1674697102.0,
                                    "replies": [
                                        {
                                            "body": "A person pretending to be a SD so they can get sex for cheaper. A John would use you as a cheap escort 😂",
                                            "author": null,
                                            "id": "j5ynydw",
                                            "parent_id": "t1_j5wks9g",
                                            "score": 1,
                                            "created_utc": 1674742096.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I was just going to comment this! Definitely would cause me to next him immediately. Like you’re the one reaching out to her???",
                    "author": "Siren_eyes256",
                    "id": "j5ul2gl",
                    "parent_id": "t1_j5u6ihj",
                    "score": 2,
                    "created_utc": 1674669375.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Omg what is up with these men!? Apparently communication is too ‘informal’ now? Good thing he made it abundantly clear early on that he doesn’t care about your safety and wellbeing. Nor his honestly! OP you did nothing wrong!",
            "author": "Radiant-Zone-2581",
            "id": "j5urefj",
            "parent_id": "t3_10l1gk3",
            "score": 7,
            "created_utc": 1674671665.0,
            "replies": []
        },
        {
            "body": "Story (though short, gives more context) -\n\nMy profile is admittedly a bit long-winded, but I do so in order to hopefully weed out some of the ones who equate the titles SB and Escort. I’m sure it’s not perfect by any means, but I’m still kind of new to this and it’s a work in progress. However, the recurring theme throughout is the desire for a quality connection vs “hmu when yer horny.”\n\nHis profile was pretty vague, generic sentence or two, had to ask for a pic. I tend to lean toward giving the benefit of the doubt given some people just are discrete, new to the site and still trying to feel it out and learn about the lifestyle, etc. He quickly jumped to asking me if I had plans today, and then segued into him wanting to drive up to my city today, so I moved us to text so we could get down to the nitty gritty.\n\nI got the sense he was looking for more of a escort service vs a true SR - that’s where the question regarding time came from (that as others have pointed out, seems like a red flag on my part - I appreciate the feedback, btw). My thought was I could quickly weed him out if his response was along the lines of “we meet, have sex, I go back home.”\n\nAs mentioned in a comment - in retrospect, I definitely wasted my time with my response. I was feelin a lil triggered for sure 🤣\n\n**\\*\\*Edited to add, the preceding conversation was as follows:**\n\n*Him: \"Hi! It's \\_\\_\\_\\_\\_\\_\\_\\_.\"*   \nMe: \"Hey there! Thanks for texting - I have to be careful about what is said on SA because it often gets falsely flagged for solicitation.\"   \n*Him: \"No worries.\"*  \nMe: \"So, can you tell me what you are looking for?\"  \nMe: \"Do you have experience with sugar dynamics?\"",
            "author": "savrhys",
            "id": "j5u50xv",
            "parent_id": "t3_10l1gk3",
            "score": 14,
            "created_utc": 1674663389.0,
            "replies": [
                {
                    "body": "From my experiences in the sugar bowl, out of town travelers are only looking for a one time encounter, but don’t want to pay escort prices. I wouldn’t waste my time. Block him unless getting paid for a one time deal is something you’re open to.",
                    "author": "The_Keto_Sis",
                    "id": "j5ufohv",
                    "parent_id": "t1_j5u50xv",
                    "score": 7,
                    "created_utc": 1674667409.0,
                    "replies": []
                },
                {
                    "body": "He’s looking for a SW. He wasn’t even keen to start a convo beyond the very basic of greetings.\n\nHe’s got “quite a few available”. This is unnecessary. He’d have turned me off by there. You gave too much time to him.",
                    "author": "Ok_Bus1797",
                    "id": "j5whfqo",
                    "parent_id": "t1_j5u50xv",
                    "score": 2,
                    "created_utc": 1674695803.0,
                    "replies": []
                },
                {
                    "body": "Not knowing the previous questions and interaction makes it hard to say for sure what this guy was looking for. I'm leaning more towards he's a twat but in the same vein your answers and retort at the end give me escort vibes from you. You're asking about activities and length of time like you're going to charge by those metrics and then you stating you're doing \"screening\" questions is definitely an escort term and vibe. This conversation is via a text app, not Seeking messaging (or something similar) so what made you move to text message so quick?",
                    "author": null,
                    "id": "j5ujvnk",
                    "parent_id": "t1_j5u50xv",
                    "score": -1,
                    "created_utc": 1674668945.0,
                    "replies": [
                        {
                            "body": "I actually edited to add the preceding convo before seeing this response! hahah because the post was originally blocked, I went off to do something and came back to a bunch of notifications so I hastily typed it up, but forgot to include the preceding conversation.   \n\n\nI appreciate the perspective for sure! The metrics part makes total sense as to why it comes across as an escort's response. I will be more casual about asking questions around time involvement moving forward ☺️☺️☺️",
                            "author": "savrhys",
                            "id": "j5un2mo",
                            "parent_id": "t1_j5ujvnk",
                            "score": 2,
                            "created_utc": 1674670104.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My opinion is he just wanted to have sex with someone and doesn’t ever plan to treat this as a relationship of any meaning. I wouldn’t have justified him with a response after though. He sounds manipulative and not worth the time.",
            "author": "Empressofthemall",
            "id": "j5uadsx",
            "parent_id": "t3_10l1gk3",
            "score": 10,
            "created_utc": 1674665421.0,
            "replies": []
        },
        {
            "body": "He wants to “meet and see what happens”.. thats strange. Not being clear on expectations can be a total waste of time, or even dangerous for us.",
            "author": "icequeen1999",
            "id": "j5u441d",
            "parent_id": "t3_10l1gk3",
            "score": 20,
            "created_utc": 1674663034.0,
            "replies": [
                {
                    "body": "If its a first meeting, it may be about the ability to run away",
                    "author": "zapzangboombang",
                    "id": "j5uuswa",
                    "parent_id": "t1_j5u441d",
                    "score": 3,
                    "created_utc": 1674672892.0,
                    "replies": []
                },
                {
                    "body": "No woman wants to hear: let’s meet and see what happens or let’s go with the flow. Ugh, total turn off !!!!",
                    "author": "natayy",
                    "id": "j5v0lq8",
                    "parent_id": "t1_j5u441d",
                    "score": 5,
                    "created_utc": 1674675028.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The takeaway from this interaction should be you need to learn the clues that you are dealing with a John. This guy was looking for what he should get by seeing an escort from a naive SB (“I am not a pro at this”🙄), clearly wanting to skip the proper date and courting. I could tell from his first message visible in this screenshot. Work on your raider and don’t waste your energy on someone like this. What he is looking for is not what you are looking for.",
            "author": "BlissfulSB",
            "id": "j5u4jta",
            "parent_id": "t3_10l1gk3",
            "score": 15,
            "created_utc": 1674663205.0,
            "replies": [
                {
                    "body": "So much this 🙌🏻 thank you for this feedback in such a kind and helpful way.",
                    "author": "savrhys",
                    "id": "j5u5wn9",
                    "parent_id": "t1_j5u4jta",
                    "score": 3,
                    "created_utc": 1674663733.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree with the lady.",
            "author": "southernslick",
            "id": "j5ufvsv",
            "parent_id": "t3_10l1gk3",
            "score": 4,
            "created_utc": 1674667484.0,
            "replies": []
        },
        {
            "body": "I just don't see why some are saying the  \"... how long...\" question is somehow off-putting. Seems like a totally reasonable question to ask early on when trying to get a clear view of the potential date / SR dynamics. Is he looking for a 2hour hotel hookup, a long evening that includes dinner, a comedy club show then a hotel? Is he looking for an overnight stay? An afternoon hike? The length (\"how long\") and type of dates the SD is wanting from his SB is a pretty fundamental factor in determining sugar compatibility.",
            "author": "CaptBrewster",
            "id": "j5uvepl",
            "parent_id": "t3_10l1gk3",
            "score": 4,
            "created_utc": 1674673112.0,
            "replies": [
                {
                    "body": "This was my thought process when I asked it, though the feedback here has been valuable in seeing a variety of perspectives as far as the wording goes. I'm pretty naive to both sugaring and FSSW (I was in a controlling monogamous relationship from age 17-26, so I find that even vanilla dating involved a lot of lessons learned), so the perception of others with more knowledge and experience is definitely helpful!",
                    "author": "savrhys",
                    "id": "j5vyltw",
                    "parent_id": "t1_j5uvepl",
                    "score": 2,
                    "created_utc": 1674687708.0,
                    "replies": [
                        {
                            "body": "The right person is not going to storm off because you asked what you thought was a reasonable question.  Dating controlling people makes us forget this. :)",
                            "author": "dgreensp",
                            "id": "j5xdacm",
                            "parent_id": "t1_j5vyltw",
                            "score": 5,
                            "created_utc": 1674710240.0,
                            "replies": [
                                {
                                    "body": "So true, thank you for the reminder 🥰",
                                    "author": "savrhys",
                                    "id": "j5xf66y",
                                    "parent_id": "t1_j5xdacm",
                                    "score": 3,
                                    "created_utc": 1674711341.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Your position is valid and don't compromise it for anyone. I'd be a little concerned if my POT SB wasn't asking screening questions. You just saved yourself time and headache.",
            "author": "OurLttlSecret719",
            "id": "j5uvhja",
            "parent_id": "t3_10l1gk3",
            "score": 4,
            "created_utc": 1674673141.0,
            "replies": [
                {
                    "body": "Thank you! And I agree - the process ultimately did what it was supposed to do, I think I was mostly just taken back by the fact that he thought me asking two open-ended questions was \"too much\" hahaha",
                    "author": "savrhys",
                    "id": "j5vxk05",
                    "parent_id": "t1_j5uvhja",
                    "score": 1,
                    "created_utc": 1674687259.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think you handled this well and the bonus of communicating like this is that it will intimidate the sort of person you don't want (like this person). \n\nYour time is valuable and asking about someone's expectations before meeting them is in no way unreasonable. Keep using your screening questions!",
            "author": "Stardust_Loren",
            "id": "j5uwaa3",
            "parent_id": "t3_10l1gk3",
            "score": 3,
            "created_utc": 1674673435.0,
            "replies": [
                {
                    "body": "I don't think what I responded with was necessarily *rude* \\- just direct, which makes people uncomfy in a lot of cases. I'm usually so kind and not as blunt, but it rubbed me the wrong way before I had my morning coffee and I may have been a lil salty hahaha",
                    "author": "savrhys",
                    "id": "j5vx8lu",
                    "parent_id": "t1_j5uwaa3",
                    "score": 6,
                    "created_utc": 1674687128.0,
                    "replies": [
                        {
                            "body": "You weren't rude at all from what I can see. Being direct is a good thing and you weren't at all impolite in your response. You were right to be salty about the way he responded to you!",
                            "author": "Stardust_Loren",
                            "id": "j5w0r48",
                            "parent_id": "t1_j5vx8lu",
                            "score": 3,
                            "created_utc": 1674688639.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "One of the strengths of SRs over Vanilla is that discussion of details like these are considered normal. That way a lot of steps can be skipped and you only end up in a relationship with someone whose interests/needs are similar.\n\nThat guy is a whacko.",
            "author": "gamergainzgal",
            "id": "j5za2y5",
            "parent_id": "t3_10l1gk3",
            "score": 4,
            "created_utc": 1674751042.0,
            "replies": []
        },
        {
            "body": "Your ask is very reasonable. \n\n\"let's meet and see what happens\" means\" I wanna fuck\"\n\nGuy speak. You dodged a bullet",
            "author": "GSSD",
            "id": "j5ucfu5",
            "parent_id": "t3_10l1gk3",
            "score": 11,
            "created_utc": 1674666200.0,
            "replies": [
                {
                    "body": "I was a lesbian up until a year ago, so still learning guy speak hahahah - I appreciate the education!",
                    "author": "savrhys",
                    "id": "j5uj71i",
                    "parent_id": "t1_j5ucfu5",
                    "score": 5,
                    "created_utc": 1674668697.0,
                    "replies": [
                        {
                            "body": "> I appreciate the education!\n\nGlad to help ! After you see what jerks guys can be you might return to team lesbian /s",
                            "author": "GSSD",
                            "id": "j5umfa1",
                            "parent_id": "t1_j5uj71i",
                            "score": 3,
                            "created_utc": 1674669869.0,
                            "replies": [
                                {
                                    "body": "These days I'm just embracing the fluidity of sexuality and focusing my energy on spending time with fellow good humans regardless of body parts :)\n\nGirls can be jerks too. Just tends to be more drama involved 🤣",
                                    "author": "savrhys",
                                    "id": "j5uo388",
                                    "parent_id": "t1_j5umfa1",
                                    "score": 1,
                                    "created_utc": 1674670473.0,
                                    "replies": [
                                        {
                                            "body": "Whatever makes you happy",
                                            "author": "GSSD",
                                            "id": "j5uq2po",
                                            "parent_id": "t1_j5uo388",
                                            "score": 2,
                                            "created_utc": 1674671189.0,
                                            "replies": [
                                                {
                                                    "body": "Agreed! Life is too short <3",
                                                    "author": "savrhys",
                                                    "id": "j5ur56j",
                                                    "parent_id": "t1_j5uq2po",
                                                    "score": 1,
                                                    "created_utc": 1674671571.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well, he's a John so... there's that",
            "author": "woodkirk",
            "id": "j5ua92h",
            "parent_id": "t3_10l1gk3",
            "score": 9,
            "created_utc": 1674665371.0,
            "replies": []
        },
        {
            "body": "I think your question was reasonable, if very uncommon to hear.  Since it's uncommon, I'd understand if he was a little surprised by it, but not by how strong  his reaction was, including the little taunt he did at the end.\n\nThat said, I notice he said \"this is too much like an interview\" and of course **we can't see the conversation that preceded this**.   If you go through a dry checklist of questions, at some point many SDs will have had it.  If he wasn't really reacting to that specific question, but this was more of the last straw, in a string of interview-like questions, I totally understand that at some point he felt he had to draw the line.  You don't have to post it, but it is worth thinking about what preceded the screenshot -- it matters.",
            "author": "Azurecole",
            "id": "j5udpur",
            "parent_id": "t3_10l1gk3",
            "score": 6,
            "created_utc": 1674666679.0,
            "replies": [
                {
                    "body": "Ugh, you are SO right! This post originally got blocked, so I was going to put it in the story in the comments. And then when I checked in and saw all the responses to the post, I furiously typed out a story, but forgot to include the preceding context. \n\nI will edit the comment now, but just so that it is here for you too, the conversation beforehand was...\n\nHim: \"Hi! It's \\_\\_\\_\\_\\_\\_\\_\\_.\" \n\nMe: \"Hey there! Thanks for texting - I have to be careful about what is said on SA because it often gets falsely flagged for solicitation.\" \n\nHim: \"No worries.\"\n\nMe: \"So, can you tell me what you are looking for?\"  \nMe: \"Do you have experience with sugar dynamics?\"",
                    "author": "savrhys",
                    "id": "j5ukuul",
                    "parent_id": "t1_j5udpur",
                    "score": 6,
                    "created_utc": 1674669297.0,
                    "replies": [
                        {
                            "body": "Often, when you post a screenshot, it gets flagged by automod, and a mod has to approve your post by hand (in this case, I approved your post :)   .  It usually doesn't take too terribly long for one of the mods to see your post and either approve it or not.  Just FYI!  \n\nAnyway, the context is good to see -- no interview checklist preceding this!",
                            "author": "Azurecole",
                            "id": "j5uo3xv",
                            "parent_id": "t1_j5ukuul",
                            "score": 3,
                            "created_utc": 1674670480.0,
                            "replies": [
                                {
                                    "body": "Oh that makes sense! Thank you so much for the insight - I'm definitely still a reddit newbie hahah",
                                    "author": "savrhys",
                                    "id": "j5upjwj",
                                    "parent_id": "t1_j5uo3xv",
                                    "score": 2,
                                    "created_utc": 1674671000.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">This is too much like an interview\n\nFollowed by\n\n>there are quite a few available today\n\nSort of business like, but not business like. I think the response from you seems angry. I mean, definitely it worked because you guys are unlikely to get on in real life that is for sure.\n\nThe only thing I'd say is when you ask \"How long\" it sort of comes across that you want out of there asap and it's a bit like you want to calculate the bill? That's probably reading to much into it.\n\nWhatever though, you definitely screened right as I think it's almost garaunteed you wouldn't get on that great!",
            "author": "C12H22O11-EU",
            "id": "j5v4mcl",
            "parent_id": "t3_10l1gk3",
            "score": 6,
            "created_utc": 1674676503.0,
            "replies": []
        },
        {
            "body": "am I the only one that was confused and couldn't figure out who the girl was and who the guy was?\n\nuser account has no flair and the username is not obviously a SD or a SB\n\nwhile the title is eliciting responses from SDs, it gives no indication if the author is SD or SB\n\nin the screenshot, the \"left hand messages\" (usually the \"other\" person) include \"I am not a pro at this\", with \"pro\" in this context usually referring to a SB, typically one behaving more like an escort, so I was thinking SB on left and SD on right.\n\nbut, other comments seem to indicate it is the other way around",
            "author": "joc13",
            "id": "j5u8580",
            "parent_id": "t3_10l1gk3",
            "score": 3,
            "created_utc": 1674664586.0,
            "replies": [
                {
                    "body": "1st message LHS is obv. SD 🤷",
                    "author": "Sunhillian",
                    "id": "j5u8soc",
                    "parent_id": "t1_j5u8580",
                    "score": 2,
                    "created_utc": 1674664829.0,
                    "replies": [
                        {
                            "body": "no, it's not. plenty of SBs also travel, and the \"I'm not a pro at this\" sounds more like a SB responding to someone implying they are a pro SB\n\nthe term \"pro\" is hardly ever used to describe a SD",
                            "author": "joc13",
                            "id": "j5ura2h",
                            "parent_id": "t1_j5u8soc",
                            "score": 2,
                            "created_utc": 1674671621.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "My apologies for not making it clear. I didn't really think about this perspective, and tbh i'm still really new to reddit and still learning about flair and such. To clarify; I'm (RHS messages) the SB.",
                    "author": "savrhys",
                    "id": "j5ugm1j",
                    "parent_id": "t1_j5u8580",
                    "score": 1,
                    "created_utc": 1674667750.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I value your time more than my own, it would not bother me at all to discuss that, in fact, I think \"organic\" is unrealistic, unless say for a date to Disneyland or something open ended.",
            "author": "SDInLeather",
            "id": "j5uh73n",
            "parent_id": "t3_10l1gk3",
            "score": 3,
            "created_utc": 1674667964.0,
            "replies": []
        },
        {
            "body": "I think your question was very appropriate. There's a difference between \"we'll spend the weekend together\" vs \"we'll spend a few hours in the evening together\". You could put the \"how long\" at the end rather than the beginning, and sprinkle it with \"that sounds great\" or \"I would love that\".\n\nAs to your last text to him, that was worded rather strongly. \"No worries, best of luck\" would be sufficient, after he rejected you there's no need for you to let him know that it's mutual.",
            "author": "geeky-sd",
            "id": "j5u20lx",
            "parent_id": "t3_10l1gk3",
            "score": 5,
            "created_utc": 1674662231.0,
            "replies": []
        },
        {
            "body": "I don't see any story 😔. I hope someone sings me a lullaby.",
            "author": null,
            "id": "j5u0o3u",
            "parent_id": "t3_10l1gk3",
            "score": 4,
            "created_utc": 1674661720.0,
            "replies": [
                {
                    "body": "The story is posted now - it originally blocked my post so i didnt think it actually went through in order for me to post the story in the comments. Sorry about that!",
                    "author": "savrhys",
                    "id": "j5uiwjm",
                    "parent_id": "t1_j5u0o3u",
                    "score": 2,
                    "created_utc": 1674668589.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see him as a red flag in this situation to be honest, with nothing pre planned it can be quite dangerous.",
            "author": "MysteryDolly",
            "id": "j5um1l7",
            "parent_id": "t3_10l1gk3",
            "score": 3,
            "created_utc": 1674669729.0,
            "replies": []
        },
        {
            "body": "This stuff break my heart. He's clearly a John. But it muddies the water for everyone else. Gosh, I wish we had a separate category for people who truly want a relationship. I get a lot of insight from this sub, but my experiences are NOT what most describe in here.",
            "author": "niceissexy",
            "id": "j5uzgcu",
            "parent_id": "t3_10l1gk3",
            "score": 4,
            "created_utc": 1674674606.0,
            "replies": [
                {
                    "body": "This is almost exclusively what I encounter on SA now. Almost EXCLUSIVELY this.",
                    "author": "Spongebobeatingass",
                    "id": "j5v9f9b",
                    "parent_id": "t1_j5uzgcu",
                    "score": 3,
                    "created_utc": 1674678252.0,
                    "replies": [
                        {
                            "body": "Same here, unfortunately.",
                            "author": "savrhys",
                            "id": "j5vwd81",
                            "parent_id": "t1_j5v9f9b",
                            "score": 2,
                            "created_utc": 1674686761.0,
                            "replies": []
                        },
                        {
                            "body": "Well, I loathe SA. Mostly because of this. I had much better luck on another site.... but still lots of rinsers.",
                            "author": "niceissexy",
                            "id": "j6a3jc5",
                            "parent_id": "t1_j5v9f9b",
                            "score": 1,
                            "created_utc": 1674940301.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Real SDs do not. Not everyone on seeking is an SD or SB. This person isn’t looking to form a respectful generous arrangement with you because they are likely neither respectful or generous, not because you were protective of your time.",
            "author": "Aphrodisiatic922",
            "id": "j5u794f",
            "parent_id": "t3_10l1gk3",
            "score": 6,
            "created_utc": 1674664245.0,
            "replies": []
        },
        {
            "body": "Oops, it said it originally didn’t post and was blocked, so I didn’t get to post the story.",
            "author": "savrhys",
            "id": "j5u28ll",
            "parent_id": "t3_10l1gk3",
            "score": 2,
            "created_utc": 1674662316.0,
            "replies": []
        },
        {
            "body": "Count your blessings.",
            "author": "gamrguypb",
            "id": "j5u8ckp",
            "parent_id": "t3_10l1gk3",
            "score": 2,
            "created_utc": 1674664662.0,
            "replies": []
        },
        {
            "body": "Keep it simple, does it appear to follow the golden or no, if it's doesn't next him.\n\nIt's take more time to find real people in a world of projection of fakes.\n\nKeep it real and you will usually not be disappointed",
            "author": "TrainAppropriate3692",
            "id": "j5um4q0",
            "parent_id": "t3_10l1gk3",
            "score": 2,
            "created_utc": 1674669761.0,
            "replies": []
        },
        {
            "body": "That's weird he acted like that. He could have responded that he wanted to meet and greet to talk and let see if there's a \"vibe\" between you too.",
            "author": "Vegetable_Specific45",
            "id": "j5ur5ly",
            "parent_id": "t3_10l1gk3",
            "score": 2,
            "created_utc": 1674671576.0,
            "replies": [
                {
                    "body": "I agree, but is it not customary to chat a little prior to meeting to, at minimum, ensure we are in alignment with what we are seeking?",
                    "author": "savrhys",
                    "id": "j5urr2b",
                    "parent_id": "t1_j5ur5ly",
                    "score": 2,
                    "created_utc": 1674671793.0,
                    "replies": [
                        {
                            "body": "Yes, it is. Personally, I like to chat/text a bit with my SD to figure him out more than his profile and pictures. But clearly, this guy just wants to see her without the regular m&g.\n\nSeriously, he took himself out, and she didn't need to take the trash out today 😅",
                            "author": "Vegetable_Specific45",
                            "id": "j5usgs5",
                            "parent_id": "t1_j5urr2b",
                            "score": 3,
                            "created_utc": 1674672050.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If its the beginning of conversations then to just jump right to the m&g would  be a bit silly anyway.  There's  nothing wrong  with a few preliminary questions to get to know someone and see how the conversation (albeit via text) goes because most of those chats fizzle out anyway.  Each step of the process, initial messaging, texting, vid calls, m&g, etc act as filters.  To just do away with a filter means you're going to waste more time further along by taking on m&gs with people who never  should have made it that far.\n\nThe whole point of being efficient here is to not waste time with people who aren't going to work out.  It's part of why I try to get the money conversation taken care of early on.  If we can't make the money part work there's no point in wasting  time on any of the rest of it.  Same with what you're  doing here.  If you don't have enough commonality then why would you waste time getting dressed, making your way to a m&g and spending your time there.   You're asking very basic questions there too.   I mean if someone can't or won't share even a basic overview of how they want to spend time with you, be it dinners, trips or just intimacy between the sheets, then how can  you possibly know you're aligned?\n\nSo yeah, I think if an SB went way overboard on being protective with the time to the point in which it felt like I was being catfished then that would be a problem, but that's  not what I see here.   I don't think you did anything wrong judging by the text you shared and I would expect a girl to ask me questions like that and to answer them were I to pose them as its a natural part of the getting to know you phase.",
            "author": "coolbaby1978",
            "id": "j5w0wqf",
            "parent_id": "t3_10l1gk3",
            "score": 2,
            "created_utc": 1674688708.0,
            "replies": [
                {
                    "body": "Thank you for this response! It’s so helpful to have the SDs perspective and the reminder that there are good ones out there who actually respect and validate the process.",
                    "author": "savrhys",
                    "id": "j5wd05c",
                    "parent_id": "t1_j5w0wqf",
                    "score": 0,
                    "created_utc": 1674693897.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nah. You fine. If someone can't respectfully sit through the logistics discussion, they aren't worth.",
            "author": "xa3D",
            "id": "j5w5wbw",
            "parent_id": "t3_10l1gk3",
            "score": 2,
            "created_utc": 1674690880.0,
            "replies": []
        },
        {
            "body": "There's no offense here at all, the  first messages should be determining your compatibility and you found that out early on.  Time saved and it was an honest exchange.",
            "author": "BrattyBritches",
            "id": "j5xh0qu",
            "parent_id": "t3_10l1gk3",
            "score": 2,
            "created_utc": 1674712466.0,
            "replies": []
        },
        {
            "body": "“There are quite a few available today”\n\nLMAO who even asked though.\nIt’s like people flexing bills in social media… they don’t really have money, heh.",
            "author": "christinaelainee",
            "id": "j5yc4k2",
            "parent_id": "t3_10l1gk3",
            "score": 2,
            "created_utc": 1674735985.0,
            "replies": []
        },
        {
            "body": "I had a recent experience where I began talking to someone who seemed like they would be a good fit and asked to video chat. He wanted to do it earlier than I could since I was at work, so we scheduled for the next day instead. I was answering relatively quickly for being at work. The next day he tells me he found someone else because I “don’t trust him and barely respond”. Most responses from me were in just a couple minutes. HUGE red flag, I dodged a bullet there. In my opinion if you haven’t even met and they are already demanding your undivided attention,  stay away",
            "author": "killaqueeenn",
            "id": "j69do5q",
            "parent_id": "t3_10l1gk3",
            "score": 2,
            "created_utc": 1674929621.0,
            "replies": []
        },
        {
            "body": "SDs, is it a turn off when an SB has communication skills and wants to establish clear expectations?",
            "author": "Charming-Eye-1309",
            "id": "j6fev5e",
            "parent_id": "t3_10l1gk3",
            "score": 2,
            "created_utc": 1675034292.0,
            "replies": []
        },
        {
            "body": "He’s trash. Don’t wanna talk and set expectations so he can try to swindle you",
            "author": "BreathtakingBeauty",
            "id": "j5uh97o",
            "parent_id": "t3_10l1gk3",
            "score": 5,
            "created_utc": 1674667987.0,
            "replies": []
        },
        {
            "body": "I think your question is fair in general and his response seems like an over reaction, but the 'How long' could understandably throw someone off. If you elaborate on why you are asking that exactly (could be several good reasons), there could be a better way of asking.",
            "author": "whatever-tata",
            "id": "j5u0kmy",
            "parent_id": "t3_10l1gk3",
            "score": 3,
            "created_utc": 1674661684.0,
            "replies": [
                {
                    "body": "Yea the how long question would’ve been a red flag for me.",
                    "author": "NewYorkSD",
                    "id": "j5u6aa1",
                    "parent_id": "t1_j5u0kmy",
                    "score": 2,
                    "created_utc": 1674663876.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think it is all in the verbiage. Think of a more casual way to say what you’re saying. This is a learning experience in marketing.",
            "author": "CaffineandGasoline",
            "id": "j5u1ibt",
            "parent_id": "t3_10l1gk3",
            "score": 3,
            "created_utc": 1674662040.0,
            "replies": [
                {
                    "body": "Absolutely agree! Happy to have the feedback of this community to help me learn how to better communicate within this dynamic.",
                    "author": "savrhys",
                    "id": "j5u5eq9",
                    "parent_id": "t1_j5u1ibt",
                    "score": 2,
                    "created_utc": 1674663540.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "the 'you aren't someone i want to spend my time with anyway' does come off a bit harsh. most of that last message could have been dropped and it would have the same effect\n\ni've found that a shorter 'sounds like this won't work out. best of luck to you' is often better. there's no need for a long explanation, especially if things are getting heated. a long reply like this is not going to change their mind or be taken as a learning opportunity anyway so you're mostly talking to yourself",
            "author": "davitech73",
            "id": "j5uagqw",
            "parent_id": "t3_10l1gk3",
            "score": 2,
            "created_utc": 1674665453.0,
            "replies": [
                {
                    "body": "Very true; see my comments above that are introspective about my thought process.",
                    "author": "savrhys",
                    "id": "j5uhh8c",
                    "parent_id": "t1_j5uagqw",
                    "score": 1,
                    "created_utc": 1674668068.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> there are quite a few available today.\n\nGuy isn't looking for an SR;  sounds like he's just looking for sex.\n\nFWIW, as an SD, I casually slip in questions/conversations about meeting length;  not to put a specific time frame on it, but to be clear I'm looking for more time than 2-3 hours meets in a hotel room (with maybe food before).",
            "author": "SDstartingOut",
            "id": "j5ubca2",
            "parent_id": "t3_10l1gk3",
            "score": 2,
            "created_utc": 1674665787.0,
            "replies": [
                {
                    "body": "Yes, I could definitely have asked in a more casual manner. Thank you for your feedback!",
                    "author": "savrhys",
                    "id": "j5ujdoh",
                    "parent_id": "t1_j5ubca2",
                    "score": 0,
                    "created_utc": 1674668763.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He’s a dickhead",
            "author": "ma-ri-ah",
            "id": "j5uek86",
            "parent_id": "t3_10l1gk3",
            "score": 2,
            "created_utc": 1674666996.0,
            "replies": []
        },
        {
            "body": "Don’t complain, don’t explain",
            "author": "JSBelle",
            "id": "j5u4fs3",
            "parent_id": "t3_10l1gk3",
            "score": 1,
            "created_utc": 1674663161.0,
            "replies": []
        },
        {
            "body": "Screenshotting this. So good!",
            "author": "Tit_for_tatts",
            "id": "j5u1qwc",
            "parent_id": "t3_10l1gk3",
            "score": 1,
            "created_utc": 1674662129.0,
            "replies": []
        },
        {
            "body": "This has nothing to do with a preference or a turn on/off. The guy is trying to be as vague as possible  to manipulate imo. You dodged a bullet.",
            "author": "b_n008",
            "id": "j5vx2ba",
            "parent_id": "t3_10l1gk3",
            "score": 1,
            "created_utc": 1674687055.0,
            "replies": []
        },
        {
            "body": "The time comment would be an instant gnext for me.  It tells me every time we see eachother I’ m on a clock.  That simply doesn’t work for me.  Also using the phrase “screening questions” combined with the time question gives me escort vibes.\n\nBut there’s so much context missing here.\n\nProtip to SBs: Stop with the wordy responses when a POT SD has already ended the conversation. “Good luck”, block, and move on.  There’s no need to have the last word.",
            "author": "BigPoppa3232",
            "id": "j5u2q2y",
            "parent_id": "t3_10l1gk3",
            "score": -1,
            "created_utc": 1674662500.0,
            "replies": [
                {
                    "body": "I also don't enjoy feeling like we are on a clock, so my question was meant to help me solidify the already existing hunch that he was a John. In retrospect, this could have been worded differently or left out completely. I could have gotten the sense of time he wanted depending on his answer to what he envisioned our time together like.\n\nThe phrase \"screening questions\" was to be transparent and a bit blunt when I already knew the conversation was done. \n\nYou're absolutely right though - the desire to have the last word was definitely there. And I think sometimes I get caught up in the idea that I need to set a precedent with these guys that they are not thinking with empathy from a SBs perspective - though when thinking logically, its highly unlikely that they would change their behavior based on my opinion/words anyway.\n\nThe closing response has also been perhaps a bit of a way for me to get my feelings out and help me get over it - a quick \"journal entry\" of self-validation, especially as someone who is newer to this lifestyle (lacking confidence with the skills) and trying to learn the right ways of doing things.",
                    "author": "savrhys",
                    "id": "j5udyb5",
                    "parent_id": "t1_j5u2q2y",
                    "score": 2,
                    "created_utc": 1674666768.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congrats on making 0 dollars, I guess 😁",
            "author": "sugardad123",
            "id": "j5wbwui",
            "parent_id": "t3_10l1gk3",
            "score": 0,
            "created_utc": 1674693429.0,
            "replies": []
        },
        {
            "body": "Both sides seem off to me.",
            "author": "saltykeep",
            "id": "j5zswjx",
            "parent_id": "t3_10l1gk3",
            "score": 0,
            "created_utc": 1674758041.0,
            "replies": []
        },
        {
            "body": "You come across as narcissistic- why the heck do you feel you have to tell him that your time is so precious? Are you God’s gift to SR’s? Don’t you think his time is precious too? For your own sake, show a bit of courtesy and humility - I’d have dumped you too with replies like that.",
            "author": "Regular_Lettuce_9064",
            "id": "j5u4zxv",
            "parent_id": "t3_10l1gk3",
            "score": -5,
            "created_utc": 1674663379.0,
            "replies": [
                {
                    "body": "The last response was intended to be somewhat of a clap back, especially after he was like \"there are multiple available today.\" It was meant to be the last word.\n\nI'm extremely respectful of time for both parties as I recognize its an invaluable resource. Ive experienced a lot of situations where pot SDs put off the vibe that \"because I have a resource you want (money/gifts), you should worship the ground I walk on.\" As an SB, my time and my energy are a large component of the resources I have that are desired by a SD.\n\nIm also a nurse with a career of my own and a side business, so ultimately the time I would spend getting ready/meeting and spending time together for someone needs to be reserved for pot SDs that I have a good feeling about through basic conversation. Otherwise, I could be doing better things with my time.",
                    "author": "savrhys",
                    "id": "j5ug1re",
                    "parent_id": "t1_j5u4zxv",
                    "score": 3,
                    "created_utc": 1674667543.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "To many words????? Daddys cant seem to remeee sugar bays arehuman with feelings too. Daddy is valid. I also understand where baby is coming from.",
            "author": "user00000804",
            "id": "j5u86n6",
            "parent_id": "t3_10l1gk3",
            "score": -2,
            "created_utc": 1674664600.0,
            "replies": []
        },
        {
            "body": "It is if there becomes a payment per hour talk that gives me the escort not an SB vibe",
            "author": "Critical-Midnight591",
            "id": "j5uoftq",
            "parent_id": "t3_10l1gk3",
            "score": 1,
            "created_utc": 1674670600.0,
            "replies": [
                {
                    "body": "Oh absolutely, I agree with that.",
                    "author": "savrhys",
                    "id": "j5vyrsm",
                    "parent_id": "t1_j5uoftq",
                    "score": 1,
                    "created_utc": 1674687777.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not an unreasonable thing to want, but for the future, keep it at “Okay, thanks, Bye!” \n\nCos that final reply from you, while thorough and again, reasonable af, made me go “he aint gonna read all that”\n\n\nThe part that clued me in that he might be a TW is “i have many other girls i could talk to”\n\nThat’s the most convenient lie a chump will use",
            "author": "Legitimate_Ranger583",
            "id": "j5uxm44",
            "parent_id": "t3_10l1gk3",
            "score": 1,
            "created_utc": 1674673926.0,
            "replies": []
        },
        {
            "body": "You are gold. Men with plans🙌❤️😍",
            "author": "natayy",
            "id": "j5v0dkh",
            "parent_id": "t1_j5u1ext",
            "score": 38,
            "created_utc": 1674674944.0,
            "replies": []
        },
        {
            "body": "You are a beautiful person. A blanched knight in a world of darkness. I wish every SD could be like you.",
            "author": "Sufficient_Rooster32",
            "id": "j5ukw5f",
            "parent_id": "t1_j5u1ext",
            "score": 24,
            "created_utc": 1674669311.0,
            "replies": []
        },
        {
            "body": "This is SO romantic. Not having to worry or try to politely get the guy to wrap it up when I need to leave? I’m in love.",
            "author": "_lil_one_",
            "id": "j5xgp5e",
            "parent_id": "t1_j5u1ext",
            "score": 12,
            "created_utc": 1674712270.0,
            "replies": []
        },
        {
            "body": "You give me hope in humanity again 🫶🏻",
            "author": "ccii22",
            "id": "j5yd1w5",
            "parent_id": "t1_j5u1ext",
            "score": 3,
            "created_utc": 1674736546.0,
            "replies": []
        },
        {
            "body": "That's awesome.  \n\n\n2145   Finish dinner \n2215   Arrive at SD home \n1116   Button 1 \n\n0645   Shower  together \n0747   Breakfast at LeBisket",
            "author": "pinotandsugar",
            "id": "j5uvcdo",
            "parent_id": "t1_j5u1ext",
            "score": 8,
            "created_utc": 1674673089.0,
            "replies": [
                {
                    "body": "Lol. Sadly you aren't far off. The times aren't down to the minute and maybe not as specific as \"shower together\", but it typically will include links to the places we are going to so she can checkout the menu or venue for more info.",
                    "author": "TwerkingAvocado",
                    "id": "j5v08au",
                    "parent_id": "t1_j5uvcdo",
                    "score": 16,
                    "created_utc": 1674674891.0,
                    "replies": [
                        {
                            "body": "Some people have that quirk or they are trying to maintain an element of control. Sometimes we address the symptoms rather than the underlying cause.\n\nFor the younger generation checking out the venue may just be part of the anticipatory fun and to make sure that they are prepared and do not miss anything .    Sometimes it is fun to sit at the computer and explore the menu or check out social media for comments regarding the menu or where one should ask for a table.",
                            "author": "pinotandsugar",
                            "id": "j5ve4q6",
                            "parent_id": "t1_j5v08au",
                            "score": 5,
                            "created_utc": 1674679947.0,
                            "replies": []
                        },
                        {
                            "body": "I actually love your entire process and I, myself like to schedule time for “winging it” hahahaah. Thank you for being an awesome SD",
                            "author": "kitkatsugarcat",
                            "id": "j5x689v",
                            "parent_id": "t1_j5v08au",
                            "score": 3,
                            "created_utc": 1674706462.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly this is a great idea! Saves time and is respectfully for both parties. Kudos to you sir",
            "author": "SBKoko",
            "id": "j5viba9",
            "parent_id": "t1_j5u1ext",
            "score": 5,
            "created_utc": 1674681456.0,
            "replies": []
        },
        {
            "body": "Do you guys take minutes, too? :) Hard to follow Roberts Rules with just 2 peeps... 🙃",
            "author": "quietgrey1",
            "id": "j5uc892",
            "parent_id": "t1_j5u1ext",
            "score": 6,
            "created_utc": 1674666119.0,
            "replies": [
                {
                    "body": "She does take Dicktation",
                    "author": "TwerkingAvocado",
                    "id": "j5ueice",
                    "parent_id": "t1_j5uc892",
                    "score": 27,
                    "created_utc": 1674666977.0,
                    "replies": [
                        {
                            "body": "I am deceased.",
                            "author": "savrhys",
                            "id": "j5uq161",
                            "parent_id": "t1_j5ueice",
                            "score": 2,
                            "created_utc": 1674671173.0,
                            "replies": [
                                {
                                    "body": "same.",
                                    "author": "InteractionSalt2770",
                                    "id": "j5uvqkc",
                                    "parent_id": "t1_j5uq161",
                                    "score": 1,
                                    "created_utc": 1674673232.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for the feedback and the specifics that made you suspicious- that’s very helpful for those of us still developing our radar in this dynamic! 🙌🏻",
            "author": "savrhys",
            "id": "j5ua34n",
            "parent_id": "t1_j5u9hz6",
            "score": 30,
            "created_utc": 1674665310.0,
            "replies": []
        },
        {
            "body": "Mostly this \\^ Was there supposed to be a story in addition to the pic? We only have a snippet, but that kinda sounds like an interview question. Maybe the prior comments did too, maybe not. The \"I'm not a pro\" is weird, but maybe makes sense in context. Asking how long, I'm sure that's what escorts ask, so I can see how he would be put off if that's too direct or too soon, but it's a reasonable question, if asked appropriately.\n\nBasically, no context or explanation... this just sounds like two people not having a productive conversation and then getting snippy and throwing a bunch of salt on their way out the door. Waste of time, just move on.",
            "author": "NoLimitLexa",
            "id": "j5u12be",
            "parent_id": "t1_j5tzl8o",
            "score": 16,
            "created_utc": 1674661871.0,
            "replies": [
                {
                    "body": "In retrospect, I do agree that my response was a waste of time, but I was feelin a little defensive because I felt like I didn’t ask anything out of the ordinary for a true SD/SB dynamic.",
                    "author": "savrhys",
                    "id": "j5u2lbb",
                    "parent_id": "t1_j5u12be",
                    "score": 11,
                    "created_utc": 1674662449.0,
                    "replies": [
                        {
                            "body": "I don't think you did anything wrong, communicating expectations seems to make sense to me",
                            "author": "Hopehorizon12",
                            "id": "j5x43fd",
                            "parent_id": "t1_j5u2lbb",
                            "score": 3,
                            "created_utc": 1674705415.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thats kinda how I felt too hahahaha. Bless and release ✨",
            "author": "savrhys",
            "id": "j5ugsyq",
            "parent_id": "t1_j5u9029",
            "score": 10,
            "created_utc": 1674667821.0,
            "replies": []
        },
        {
            "body": ">\"That's unfortunate.  Best of luck.\"\n\nThis \\^\n\nFeel free to cut that a bit shorter if you want to. Do not expand under any circumstances.",
            "author": "NoLimitLexa",
            "id": "j5u1lyc",
            "parent_id": "t1_j5u0zni",
            "score": 10,
            "created_utc": 1674662078.0,
            "replies": []
        },
        {
            "body": "I messaged a POT that it seemed like we'd be a good match on paper and as soon as he said \"doubt it\" i messaged that I was sorry to hear that and blocked him. If you have to respond at all, keep it short, sweet and block.",
            "author": "iismelldaisiesii",
            "id": "j5uorrs",
            "parent_id": "t1_j5u0zni",
            "score": 2,
            "created_utc": 1674670720.0,
            "replies": []
        },
        {
            "body": ">“Quite a few available today”. First of all he’s a manipulative twat. \n\nYeah, because of the other issues, people have pretty much glossed over how awful this sentence is. Just... wow.",
            "author": "NoLimitLexa",
            "id": "j5u7zti",
            "parent_id": "t1_j5u6ihj",
            "score": 18,
            "created_utc": 1674664528.0,
            "replies": [
                {
                    "body": "I think reading that sentence was what got me so triggered to respond with a lil salt haha",
                    "author": "savrhys",
                    "id": "j5uaslc",
                    "parent_id": "t1_j5u7zti",
                    "score": 15,
                    "created_utc": 1674665580.0,
                    "replies": []
                },
                {
                    "body": "Agreed. Let’s be real there ain’t nobody available for this John today 😂",
                    "author": null,
                    "id": "j5urd1h",
                    "parent_id": "t1_j5u7zti",
                    "score": 7,
                    "created_utc": 1674671651.0,
                    "replies": [
                        {
                            "body": "sorry but what does John mean in this context? never heard this before 😂",
                            "author": "spongykiwi",
                            "id": "j5wks9g",
                            "parent_id": "t1_j5urd1h",
                            "score": 1,
                            "created_utc": 1674697102.0,
                            "replies": [
                                {
                                    "body": "A person pretending to be a SD so they can get sex for cheaper. A John would use you as a cheap escort 😂",
                                    "author": null,
                                    "id": "j5ynydw",
                                    "parent_id": "t1_j5wks9g",
                                    "score": 1,
                                    "created_utc": 1674742096.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I was just going to comment this! Definitely would cause me to next him immediately. Like you’re the one reaching out to her???",
            "author": "Siren_eyes256",
            "id": "j5ul2gl",
            "parent_id": "t1_j5u6ihj",
            "score": 2,
            "created_utc": 1674669375.0,
            "replies": []
        },
        {
            "body": "From my experiences in the sugar bowl, out of town travelers are only looking for a one time encounter, but don’t want to pay escort prices. I wouldn’t waste my time. Block him unless getting paid for a one time deal is something you’re open to.",
            "author": "The_Keto_Sis",
            "id": "j5ufohv",
            "parent_id": "t1_j5u50xv",
            "score": 7,
            "created_utc": 1674667409.0,
            "replies": []
        },
        {
            "body": "He’s looking for a SW. He wasn’t even keen to start a convo beyond the very basic of greetings.\n\nHe’s got “quite a few available”. This is unnecessary. He’d have turned me off by there. You gave too much time to him.",
            "author": "Ok_Bus1797",
            "id": "j5whfqo",
            "parent_id": "t1_j5u50xv",
            "score": 2,
            "created_utc": 1674695803.0,
            "replies": []
        },
        {
            "body": "Not knowing the previous questions and interaction makes it hard to say for sure what this guy was looking for. I'm leaning more towards he's a twat but in the same vein your answers and retort at the end give me escort vibes from you. You're asking about activities and length of time like you're going to charge by those metrics and then you stating you're doing \"screening\" questions is definitely an escort term and vibe. This conversation is via a text app, not Seeking messaging (or something similar) so what made you move to text message so quick?",
            "author": null,
            "id": "j5ujvnk",
            "parent_id": "t1_j5u50xv",
            "score": -1,
            "created_utc": 1674668945.0,
            "replies": [
                {
                    "body": "I actually edited to add the preceding convo before seeing this response! hahah because the post was originally blocked, I went off to do something and came back to a bunch of notifications so I hastily typed it up, but forgot to include the preceding conversation.   \n\n\nI appreciate the perspective for sure! The metrics part makes total sense as to why it comes across as an escort's response. I will be more casual about asking questions around time involvement moving forward ☺️☺️☺️",
                    "author": "savrhys",
                    "id": "j5un2mo",
                    "parent_id": "t1_j5ujvnk",
                    "score": 2,
                    "created_utc": 1674670104.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If its a first meeting, it may be about the ability to run away",
            "author": "zapzangboombang",
            "id": "j5uuswa",
            "parent_id": "t1_j5u441d",
            "score": 3,
            "created_utc": 1674672892.0,
            "replies": []
        },
        {
            "body": "No woman wants to hear: let’s meet and see what happens or let’s go with the flow. Ugh, total turn off !!!!",
            "author": "natayy",
            "id": "j5v0lq8",
            "parent_id": "t1_j5u441d",
            "score": 5,
            "created_utc": 1674675028.0,
            "replies": []
        },
        {
            "body": "So much this 🙌🏻 thank you for this feedback in such a kind and helpful way.",
            "author": "savrhys",
            "id": "j5u5wn9",
            "parent_id": "t1_j5u4jta",
            "score": 3,
            "created_utc": 1674663733.0,
            "replies": []
        },
        {
            "body": "This was my thought process when I asked it, though the feedback here has been valuable in seeing a variety of perspectives as far as the wording goes. I'm pretty naive to both sugaring and FSSW (I was in a controlling monogamous relationship from age 17-26, so I find that even vanilla dating involved a lot of lessons learned), so the perception of others with more knowledge and experience is definitely helpful!",
            "author": "savrhys",
            "id": "j5vyltw",
            "parent_id": "t1_j5uvepl",
            "score": 2,
            "created_utc": 1674687708.0,
            "replies": [
                {
                    "body": "The right person is not going to storm off because you asked what you thought was a reasonable question.  Dating controlling people makes us forget this. :)",
                    "author": "dgreensp",
                    "id": "j5xdacm",
                    "parent_id": "t1_j5vyltw",
                    "score": 5,
                    "created_utc": 1674710240.0,
                    "replies": [
                        {
                            "body": "So true, thank you for the reminder 🥰",
                            "author": "savrhys",
                            "id": "j5xf66y",
                            "parent_id": "t1_j5xdacm",
                            "score": 3,
                            "created_utc": 1674711341.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you! And I agree - the process ultimately did what it was supposed to do, I think I was mostly just taken back by the fact that he thought me asking two open-ended questions was \"too much\" hahaha",
            "author": "savrhys",
            "id": "j5vxk05",
            "parent_id": "t1_j5uvhja",
            "score": 1,
            "created_utc": 1674687259.0,
            "replies": []
        },
        {
            "body": "I don't think what I responded with was necessarily *rude* \\- just direct, which makes people uncomfy in a lot of cases. I'm usually so kind and not as blunt, but it rubbed me the wrong way before I had my morning coffee and I may have been a lil salty hahaha",
            "author": "savrhys",
            "id": "j5vx8lu",
            "parent_id": "t1_j5uwaa3",
            "score": 6,
            "created_utc": 1674687128.0,
            "replies": [
                {
                    "body": "You weren't rude at all from what I can see. Being direct is a good thing and you weren't at all impolite in your response. You were right to be salty about the way he responded to you!",
                    "author": "Stardust_Loren",
                    "id": "j5w0r48",
                    "parent_id": "t1_j5vx8lu",
                    "score": 3,
                    "created_utc": 1674688639.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was a lesbian up until a year ago, so still learning guy speak hahahah - I appreciate the education!",
            "author": "savrhys",
            "id": "j5uj71i",
            "parent_id": "t1_j5ucfu5",
            "score": 5,
            "created_utc": 1674668697.0,
            "replies": [
                {
                    "body": "> I appreciate the education!\n\nGlad to help ! After you see what jerks guys can be you might return to team lesbian /s",
                    "author": "GSSD",
                    "id": "j5umfa1",
                    "parent_id": "t1_j5uj71i",
                    "score": 3,
                    "created_utc": 1674669869.0,
                    "replies": [
                        {
                            "body": "These days I'm just embracing the fluidity of sexuality and focusing my energy on spending time with fellow good humans regardless of body parts :)\n\nGirls can be jerks too. Just tends to be more drama involved 🤣",
                            "author": "savrhys",
                            "id": "j5uo388",
                            "parent_id": "t1_j5umfa1",
                            "score": 1,
                            "created_utc": 1674670473.0,
                            "replies": [
                                {
                                    "body": "Whatever makes you happy",
                                    "author": "GSSD",
                                    "id": "j5uq2po",
                                    "parent_id": "t1_j5uo388",
                                    "score": 2,
                                    "created_utc": 1674671189.0,
                                    "replies": [
                                        {
                                            "body": "Agreed! Life is too short <3",
                                            "author": "savrhys",
                                            "id": "j5ur56j",
                                            "parent_id": "t1_j5uq2po",
                                            "score": 1,
                                            "created_utc": 1674671571.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ugh, you are SO right! This post originally got blocked, so I was going to put it in the story in the comments. And then when I checked in and saw all the responses to the post, I furiously typed out a story, but forgot to include the preceding context. \n\nI will edit the comment now, but just so that it is here for you too, the conversation beforehand was...\n\nHim: \"Hi! It's \\_\\_\\_\\_\\_\\_\\_\\_.\" \n\nMe: \"Hey there! Thanks for texting - I have to be careful about what is said on SA because it often gets falsely flagged for solicitation.\" \n\nHim: \"No worries.\"\n\nMe: \"So, can you tell me what you are looking for?\"  \nMe: \"Do you have experience with sugar dynamics?\"",
            "author": "savrhys",
            "id": "j5ukuul",
            "parent_id": "t1_j5udpur",
            "score": 6,
            "created_utc": 1674669297.0,
            "replies": [
                {
                    "body": "Often, when you post a screenshot, it gets flagged by automod, and a mod has to approve your post by hand (in this case, I approved your post :)   .  It usually doesn't take too terribly long for one of the mods to see your post and either approve it or not.  Just FYI!  \n\nAnyway, the context is good to see -- no interview checklist preceding this!",
                    "author": "Azurecole",
                    "id": "j5uo3xv",
                    "parent_id": "t1_j5ukuul",
                    "score": 3,
                    "created_utc": 1674670480.0,
                    "replies": [
                        {
                            "body": "Oh that makes sense! Thank you so much for the insight - I'm definitely still a reddit newbie hahah",
                            "author": "savrhys",
                            "id": "j5upjwj",
                            "parent_id": "t1_j5uo3xv",
                            "score": 2,
                            "created_utc": 1674671000.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "1st message LHS is obv. SD 🤷",
            "author": "Sunhillian",
            "id": "j5u8soc",
            "parent_id": "t1_j5u8580",
            "score": 2,
            "created_utc": 1674664829.0,
            "replies": [
                {
                    "body": "no, it's not. plenty of SBs also travel, and the \"I'm not a pro at this\" sounds more like a SB responding to someone implying they are a pro SB\n\nthe term \"pro\" is hardly ever used to describe a SD",
                    "author": "joc13",
                    "id": "j5ura2h",
                    "parent_id": "t1_j5u8soc",
                    "score": 2,
                    "created_utc": 1674671621.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My apologies for not making it clear. I didn't really think about this perspective, and tbh i'm still really new to reddit and still learning about flair and such. To clarify; I'm (RHS messages) the SB.",
            "author": "savrhys",
            "id": "j5ugm1j",
            "parent_id": "t1_j5u8580",
            "score": 1,
            "created_utc": 1674667750.0,
            "replies": []
        },
        {
            "body": "The story is posted now - it originally blocked my post so i didnt think it actually went through in order for me to post the story in the comments. Sorry about that!",
            "author": "savrhys",
            "id": "j5uiwjm",
            "parent_id": "t1_j5u0o3u",
            "score": 2,
            "created_utc": 1674668589.0,
            "replies": []
        },
        {
            "body": "This is almost exclusively what I encounter on SA now. Almost EXCLUSIVELY this.",
            "author": "Spongebobeatingass",
            "id": "j5v9f9b",
            "parent_id": "t1_j5uzgcu",
            "score": 3,
            "created_utc": 1674678252.0,
            "replies": [
                {
                    "body": "Same here, unfortunately.",
                    "author": "savrhys",
                    "id": "j5vwd81",
                    "parent_id": "t1_j5v9f9b",
                    "score": 2,
                    "created_utc": 1674686761.0,
                    "replies": []
                },
                {
                    "body": "Well, I loathe SA. Mostly because of this. I had much better luck on another site.... but still lots of rinsers.",
                    "author": "niceissexy",
                    "id": "j6a3jc5",
                    "parent_id": "t1_j5v9f9b",
                    "score": 1,
                    "created_utc": 1674940301.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree, but is it not customary to chat a little prior to meeting to, at minimum, ensure we are in alignment with what we are seeking?",
            "author": "savrhys",
            "id": "j5urr2b",
            "parent_id": "t1_j5ur5ly",
            "score": 2,
            "created_utc": 1674671793.0,
            "replies": [
                {
                    "body": "Yes, it is. Personally, I like to chat/text a bit with my SD to figure him out more than his profile and pictures. But clearly, this guy just wants to see her without the regular m&g.\n\nSeriously, he took himself out, and she didn't need to take the trash out today 😅",
                    "author": "Vegetable_Specific45",
                    "id": "j5usgs5",
                    "parent_id": "t1_j5urr2b",
                    "score": 3,
                    "created_utc": 1674672050.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for this response! It’s so helpful to have the SDs perspective and the reminder that there are good ones out there who actually respect and validate the process.",
            "author": "savrhys",
            "id": "j5wd05c",
            "parent_id": "t1_j5w0wqf",
            "score": 0,
            "created_utc": 1674693897.0,
            "replies": []
        },
        {
            "body": "Yea the how long question would’ve been a red flag for me.",
            "author": "NewYorkSD",
            "id": "j5u6aa1",
            "parent_id": "t1_j5u0kmy",
            "score": 2,
            "created_utc": 1674663876.0,
            "replies": []
        },
        {
            "body": "Absolutely agree! Happy to have the feedback of this community to help me learn how to better communicate within this dynamic.",
            "author": "savrhys",
            "id": "j5u5eq9",
            "parent_id": "t1_j5u1ibt",
            "score": 2,
            "created_utc": 1674663540.0,
            "replies": []
        },
        {
            "body": "Very true; see my comments above that are introspective about my thought process.",
            "author": "savrhys",
            "id": "j5uhh8c",
            "parent_id": "t1_j5uagqw",
            "score": 1,
            "created_utc": 1674668068.0,
            "replies": []
        },
        {
            "body": "Yes, I could definitely have asked in a more casual manner. Thank you for your feedback!",
            "author": "savrhys",
            "id": "j5ujdoh",
            "parent_id": "t1_j5ubca2",
            "score": 0,
            "created_utc": 1674668763.0,
            "replies": []
        },
        {
            "body": "I also don't enjoy feeling like we are on a clock, so my question was meant to help me solidify the already existing hunch that he was a John. In retrospect, this could have been worded differently or left out completely. I could have gotten the sense of time he wanted depending on his answer to what he envisioned our time together like.\n\nThe phrase \"screening questions\" was to be transparent and a bit blunt when I already knew the conversation was done. \n\nYou're absolutely right though - the desire to have the last word was definitely there. And I think sometimes I get caught up in the idea that I need to set a precedent with these guys that they are not thinking with empathy from a SBs perspective - though when thinking logically, its highly unlikely that they would change their behavior based on my opinion/words anyway.\n\nThe closing response has also been perhaps a bit of a way for me to get my feelings out and help me get over it - a quick \"journal entry\" of self-validation, especially as someone who is newer to this lifestyle (lacking confidence with the skills) and trying to learn the right ways of doing things.",
            "author": "savrhys",
            "id": "j5udyb5",
            "parent_id": "t1_j5u2q2y",
            "score": 2,
            "created_utc": 1674666768.0,
            "replies": []
        },
        {
            "body": "The last response was intended to be somewhat of a clap back, especially after he was like \"there are multiple available today.\" It was meant to be the last word.\n\nI'm extremely respectful of time for both parties as I recognize its an invaluable resource. Ive experienced a lot of situations where pot SDs put off the vibe that \"because I have a resource you want (money/gifts), you should worship the ground I walk on.\" As an SB, my time and my energy are a large component of the resources I have that are desired by a SD.\n\nIm also a nurse with a career of my own and a side business, so ultimately the time I would spend getting ready/meeting and spending time together for someone needs to be reserved for pot SDs that I have a good feeling about through basic conversation. Otherwise, I could be doing better things with my time.",
            "author": "savrhys",
            "id": "j5ug1re",
            "parent_id": "t1_j5u4zxv",
            "score": 3,
            "created_utc": 1674667543.0,
            "replies": []
        },
        {
            "body": "Oh absolutely, I agree with that.",
            "author": "savrhys",
            "id": "j5vyrsm",
            "parent_id": "t1_j5uoftq",
            "score": 1,
            "created_utc": 1674687777.0,
            "replies": []
        },
        {
            "body": "Lol. Sadly you aren't far off. The times aren't down to the minute and maybe not as specific as \"shower together\", but it typically will include links to the places we are going to so she can checkout the menu or venue for more info.",
            "author": "TwerkingAvocado",
            "id": "j5v08au",
            "parent_id": "t1_j5uvcdo",
            "score": 16,
            "created_utc": 1674674891.0,
            "replies": [
                {
                    "body": "Some people have that quirk or they are trying to maintain an element of control. Sometimes we address the symptoms rather than the underlying cause.\n\nFor the younger generation checking out the venue may just be part of the anticipatory fun and to make sure that they are prepared and do not miss anything .    Sometimes it is fun to sit at the computer and explore the menu or check out social media for comments regarding the menu or where one should ask for a table.",
                    "author": "pinotandsugar",
                    "id": "j5ve4q6",
                    "parent_id": "t1_j5v08au",
                    "score": 5,
                    "created_utc": 1674679947.0,
                    "replies": []
                },
                {
                    "body": "I actually love your entire process and I, myself like to schedule time for “winging it” hahahaah. Thank you for being an awesome SD",
                    "author": "kitkatsugarcat",
                    "id": "j5x689v",
                    "parent_id": "t1_j5v08au",
                    "score": 3,
                    "created_utc": 1674706462.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She does take Dicktation",
            "author": "TwerkingAvocado",
            "id": "j5ueice",
            "parent_id": "t1_j5uc892",
            "score": 27,
            "created_utc": 1674666977.0,
            "replies": [
                {
                    "body": "I am deceased.",
                    "author": "savrhys",
                    "id": "j5uq161",
                    "parent_id": "t1_j5ueice",
                    "score": 2,
                    "created_utc": 1674671173.0,
                    "replies": [
                        {
                            "body": "same.",
                            "author": "InteractionSalt2770",
                            "id": "j5uvqkc",
                            "parent_id": "t1_j5uq161",
                            "score": 1,
                            "created_utc": 1674673232.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "In retrospect, I do agree that my response was a waste of time, but I was feelin a little defensive because I felt like I didn’t ask anything out of the ordinary for a true SD/SB dynamic.",
            "author": "savrhys",
            "id": "j5u2lbb",
            "parent_id": "t1_j5u12be",
            "score": 11,
            "created_utc": 1674662449.0,
            "replies": [
                {
                    "body": "I don't think you did anything wrong, communicating expectations seems to make sense to me",
                    "author": "Hopehorizon12",
                    "id": "j5x43fd",
                    "parent_id": "t1_j5u2lbb",
                    "score": 3,
                    "created_utc": 1674705415.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think reading that sentence was what got me so triggered to respond with a lil salt haha",
            "author": "savrhys",
            "id": "j5uaslc",
            "parent_id": "t1_j5u7zti",
            "score": 15,
            "created_utc": 1674665580.0,
            "replies": []
        },
        {
            "body": "Agreed. Let’s be real there ain’t nobody available for this John today 😂",
            "author": null,
            "id": "j5urd1h",
            "parent_id": "t1_j5u7zti",
            "score": 7,
            "created_utc": 1674671651.0,
            "replies": [
                {
                    "body": "sorry but what does John mean in this context? never heard this before 😂",
                    "author": "spongykiwi",
                    "id": "j5wks9g",
                    "parent_id": "t1_j5urd1h",
                    "score": 1,
                    "created_utc": 1674697102.0,
                    "replies": [
                        {
                            "body": "A person pretending to be a SD so they can get sex for cheaper. A John would use you as a cheap escort 😂",
                            "author": null,
                            "id": "j5ynydw",
                            "parent_id": "t1_j5wks9g",
                            "score": 1,
                            "created_utc": 1674742096.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I actually edited to add the preceding convo before seeing this response! hahah because the post was originally blocked, I went off to do something and came back to a bunch of notifications so I hastily typed it up, but forgot to include the preceding conversation.   \n\n\nI appreciate the perspective for sure! The metrics part makes total sense as to why it comes across as an escort's response. I will be more casual about asking questions around time involvement moving forward ☺️☺️☺️",
            "author": "savrhys",
            "id": "j5un2mo",
            "parent_id": "t1_j5ujvnk",
            "score": 2,
            "created_utc": 1674670104.0,
            "replies": []
        },
        {
            "body": "The right person is not going to storm off because you asked what you thought was a reasonable question.  Dating controlling people makes us forget this. :)",
            "author": "dgreensp",
            "id": "j5xdacm",
            "parent_id": "t1_j5vyltw",
            "score": 5,
            "created_utc": 1674710240.0,
            "replies": [
                {
                    "body": "So true, thank you for the reminder 🥰",
                    "author": "savrhys",
                    "id": "j5xf66y",
                    "parent_id": "t1_j5xdacm",
                    "score": 3,
                    "created_utc": 1674711341.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You weren't rude at all from what I can see. Being direct is a good thing and you weren't at all impolite in your response. You were right to be salty about the way he responded to you!",
            "author": "Stardust_Loren",
            "id": "j5w0r48",
            "parent_id": "t1_j5vx8lu",
            "score": 3,
            "created_utc": 1674688639.0,
            "replies": []
        },
        {
            "body": "> I appreciate the education!\n\nGlad to help ! After you see what jerks guys can be you might return to team lesbian /s",
            "author": "GSSD",
            "id": "j5umfa1",
            "parent_id": "t1_j5uj71i",
            "score": 3,
            "created_utc": 1674669869.0,
            "replies": [
                {
                    "body": "These days I'm just embracing the fluidity of sexuality and focusing my energy on spending time with fellow good humans regardless of body parts :)\n\nGirls can be jerks too. Just tends to be more drama involved 🤣",
                    "author": "savrhys",
                    "id": "j5uo388",
                    "parent_id": "t1_j5umfa1",
                    "score": 1,
                    "created_utc": 1674670473.0,
                    "replies": [
                        {
                            "body": "Whatever makes you happy",
                            "author": "GSSD",
                            "id": "j5uq2po",
                            "parent_id": "t1_j5uo388",
                            "score": 2,
                            "created_utc": 1674671189.0,
                            "replies": [
                                {
                                    "body": "Agreed! Life is too short <3",
                                    "author": "savrhys",
                                    "id": "j5ur56j",
                                    "parent_id": "t1_j5uq2po",
                                    "score": 1,
                                    "created_utc": 1674671571.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Often, when you post a screenshot, it gets flagged by automod, and a mod has to approve your post by hand (in this case, I approved your post :)   .  It usually doesn't take too terribly long for one of the mods to see your post and either approve it or not.  Just FYI!  \n\nAnyway, the context is good to see -- no interview checklist preceding this!",
            "author": "Azurecole",
            "id": "j5uo3xv",
            "parent_id": "t1_j5ukuul",
            "score": 3,
            "created_utc": 1674670480.0,
            "replies": [
                {
                    "body": "Oh that makes sense! Thank you so much for the insight - I'm definitely still a reddit newbie hahah",
                    "author": "savrhys",
                    "id": "j5upjwj",
                    "parent_id": "t1_j5uo3xv",
                    "score": 2,
                    "created_utc": 1674671000.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "no, it's not. plenty of SBs also travel, and the \"I'm not a pro at this\" sounds more like a SB responding to someone implying they are a pro SB\n\nthe term \"pro\" is hardly ever used to describe a SD",
            "author": "joc13",
            "id": "j5ura2h",
            "parent_id": "t1_j5u8soc",
            "score": 2,
            "created_utc": 1674671621.0,
            "replies": []
        },
        {
            "body": "Same here, unfortunately.",
            "author": "savrhys",
            "id": "j5vwd81",
            "parent_id": "t1_j5v9f9b",
            "score": 2,
            "created_utc": 1674686761.0,
            "replies": []
        },
        {
            "body": "Well, I loathe SA. Mostly because of this. I had much better luck on another site.... but still lots of rinsers.",
            "author": "niceissexy",
            "id": "j6a3jc5",
            "parent_id": "t1_j5v9f9b",
            "score": 1,
            "created_utc": 1674940301.0,
            "replies": []
        },
        {
            "body": "Yes, it is. Personally, I like to chat/text a bit with my SD to figure him out more than his profile and pictures. But clearly, this guy just wants to see her without the regular m&g.\n\nSeriously, he took himself out, and she didn't need to take the trash out today 😅",
            "author": "Vegetable_Specific45",
            "id": "j5usgs5",
            "parent_id": "t1_j5urr2b",
            "score": 3,
            "created_utc": 1674672050.0,
            "replies": []
        },
        {
            "body": "Some people have that quirk or they are trying to maintain an element of control. Sometimes we address the symptoms rather than the underlying cause.\n\nFor the younger generation checking out the venue may just be part of the anticipatory fun and to make sure that they are prepared and do not miss anything .    Sometimes it is fun to sit at the computer and explore the menu or check out social media for comments regarding the menu or where one should ask for a table.",
            "author": "pinotandsugar",
            "id": "j5ve4q6",
            "parent_id": "t1_j5v08au",
            "score": 5,
            "created_utc": 1674679947.0,
            "replies": []
        },
        {
            "body": "I actually love your entire process and I, myself like to schedule time for “winging it” hahahaah. Thank you for being an awesome SD",
            "author": "kitkatsugarcat",
            "id": "j5x689v",
            "parent_id": "t1_j5v08au",
            "score": 3,
            "created_utc": 1674706462.0,
            "replies": []
        },
        {
            "body": "I am deceased.",
            "author": "savrhys",
            "id": "j5uq161",
            "parent_id": "t1_j5ueice",
            "score": 2,
            "created_utc": 1674671173.0,
            "replies": [
                {
                    "body": "same.",
                    "author": "InteractionSalt2770",
                    "id": "j5uvqkc",
                    "parent_id": "t1_j5uq161",
                    "score": 1,
                    "created_utc": 1674673232.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't think you did anything wrong, communicating expectations seems to make sense to me",
            "author": "Hopehorizon12",
            "id": "j5x43fd",
            "parent_id": "t1_j5u2lbb",
            "score": 3,
            "created_utc": 1674705415.0,
            "replies": []
        },
        {
            "body": "sorry but what does John mean in this context? never heard this before 😂",
            "author": "spongykiwi",
            "id": "j5wks9g",
            "parent_id": "t1_j5urd1h",
            "score": 1,
            "created_utc": 1674697102.0,
            "replies": [
                {
                    "body": "A person pretending to be a SD so they can get sex for cheaper. A John would use you as a cheap escort 😂",
                    "author": null,
                    "id": "j5ynydw",
                    "parent_id": "t1_j5wks9g",
                    "score": 1,
                    "created_utc": 1674742096.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So true, thank you for the reminder 🥰",
            "author": "savrhys",
            "id": "j5xf66y",
            "parent_id": "t1_j5xdacm",
            "score": 3,
            "created_utc": 1674711341.0,
            "replies": []
        },
        {
            "body": "These days I'm just embracing the fluidity of sexuality and focusing my energy on spending time with fellow good humans regardless of body parts :)\n\nGirls can be jerks too. Just tends to be more drama involved 🤣",
            "author": "savrhys",
            "id": "j5uo388",
            "parent_id": "t1_j5umfa1",
            "score": 1,
            "created_utc": 1674670473.0,
            "replies": [
                {
                    "body": "Whatever makes you happy",
                    "author": "GSSD",
                    "id": "j5uq2po",
                    "parent_id": "t1_j5uo388",
                    "score": 2,
                    "created_utc": 1674671189.0,
                    "replies": [
                        {
                            "body": "Agreed! Life is too short <3",
                            "author": "savrhys",
                            "id": "j5ur56j",
                            "parent_id": "t1_j5uq2po",
                            "score": 1,
                            "created_utc": 1674671571.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh that makes sense! Thank you so much for the insight - I'm definitely still a reddit newbie hahah",
            "author": "savrhys",
            "id": "j5upjwj",
            "parent_id": "t1_j5uo3xv",
            "score": 2,
            "created_utc": 1674671000.0,
            "replies": []
        },
        {
            "body": "same.",
            "author": "InteractionSalt2770",
            "id": "j5uvqkc",
            "parent_id": "t1_j5uq161",
            "score": 1,
            "created_utc": 1674673232.0,
            "replies": []
        },
        {
            "body": "A person pretending to be a SD so they can get sex for cheaper. A John would use you as a cheap escort 😂",
            "author": null,
            "id": "j5ynydw",
            "parent_id": "t1_j5wks9g",
            "score": 1,
            "created_utc": 1674742096.0,
            "replies": []
        },
        {
            "body": "Whatever makes you happy",
            "author": "GSSD",
            "id": "j5uq2po",
            "parent_id": "t1_j5uo388",
            "score": 2,
            "created_utc": 1674671189.0,
            "replies": [
                {
                    "body": "Agreed! Life is too short <3",
                    "author": "savrhys",
                    "id": "j5ur56j",
                    "parent_id": "t1_j5uq2po",
                    "score": 1,
                    "created_utc": 1674671571.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed! Life is too short <3",
            "author": "savrhys",
            "id": "j5ur56j",
            "parent_id": "t1_j5uq2po",
            "score": 1,
            "created_utc": 1674671571.0,
            "replies": []
        }
    ]
}