{
    "title": "Sexual Consent",
    "post_id": "uiiejn",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/uiiejn/sexual_consent/",
    "author": "bubblerush",
    "body": "You do not have consent if… \n\n•They are under the influence of drugs and/or alcohol \n\n•They are being pressured, manipulated, tricked or scared into giving “consent”\n\n•You ignore their wishes or nonverbal cues to stop, like pushing away\n\n•You have consent for one sexual act, but not another sexual act (example: oral sex, anal sex) \n\n•They change their mind — earlier consent doesn’t count as consent later\n\n•You have a partner who is disengaged, nonresponsive, or visibly upset\n\n______\n\nYou do not have consent if it is not informed consent…\n\n•”Rape by deception is a situation in which the perpetrator obtains the victim's agreement to engage in sexual intercourse or other sex acts, but gains it by deception, such as false statements or actions, including leading the target into illusory perceptions in order to get sex.” \n\n•”Sexual encounters involving deception that may qualify as sexual misconduct include (among many others) lying about the use of contraception, lying about your age, marital status, lying about having been tested for sexually transmitted diseases and infections.” \n\n______\n\nConsent looks like…\n\n•Asking permission before you change the type or degree of sexual activity with phrases like “Is this OK?”\n\n•Confirming that there is reciprocal interest before initiating any physical touch.\n\n•Letting your partner know that you can stop at any time.\n\n•Periodically checking in with your partner, such as asking “Is this still okay?”\n\n______\n\nEdit: Some of you are really getting mad over a post about consent..? A post that’s meant for men and women? I genuinely don’t understand how this could upset anyone.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/uiiejn/sexual_consent/",
    "score": 103,
    "upvote_ratio": 0.69,
    "created_utc": 1651703473.0,
    "num_comments": 140,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "> They are being pressured, manipulated, tricked or scared into giving “consent”\n\nI think men read this and dont worry about being on the other side of it.\n\nI was scared into sex daily with an ex.  If I didnt do it it would escalate into her threaten to call the police and get me falsely arrested for DV, cause a scene when my status with aoao was literally close to forcing me to sell, pretend things were only mildly bad then start driving crazy when we got in the car. She had texts and recordings of me writing weird shit on ambien and threatened to show them to my family and claim I was using street drugs as I had in the past. \n\nIm just not the same sexual person anymore.  I think I went to sugaring in part because I need the sexual motivation of the best looking women combined with the security of relationships with boundaries to feel fully sexual.\n\nIm not going to say I was raped because I think it was more like sexual extortion.  But I understand sexual abuse better than Id like.",
            "author": "JDMultralight",
            "id": "i7d7uc8",
            "parent_id": "t3_uiiejn",
            "score": 46,
            "created_utc": 1651711772.0,
            "replies": [
                {
                    "body": "I’m so sorry, you didn’t deserve that. Whatever you consider it is completely valid, the abuse wasn’t okay. I’m really happy to hear that you’re out of that relationship, and I’m glad your sugar relationships are helping you heal. Sending hugs <3",
                    "author": "bubblerush",
                    "id": "i7d8neb",
                    "parent_id": "t1_i7d7uc8",
                    "score": 19,
                    "created_utc": 1651712127.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Informed consent is emotionally mature and sexy af!",
            "author": "LadyMorgan2018",
            "id": "i7d55gu",
            "parent_id": "t3_uiiejn",
            "score": 55,
            "created_utc": 1651710571.0,
            "replies": [
                {
                    "body": "Yes!! 👏🏼👏🏼",
                    "author": "bubblerush",
                    "id": "i7d5mbo",
                    "parent_id": "t1_i7d55gu",
                    "score": 5,
                    "created_utc": 1651710781.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Curious that consent is apparently such a touchy subject and regarded as an “attack on men”. I don’t see any attack on men. It’s just a discussion. If you don’t have issues with consent, why would you feel attacked? \n\nNot sure why this is so controversial. 🤷‍♀️\n\nWould be interesting to see more people engaging with the topic at hand in a mature way (at least there’s some), rather than dishing out ad hominem attacks on the OP. \n\n“Me no likey, OP silly wooman!”",
            "author": "xWaterlooSunset",
            "id": "i7cww3p",
            "parent_id": "t3_uiiejn",
            "score": 21,
            "created_utc": 1651706880.0,
            "replies": [
                {
                    "body": "Some of this comes from the fact that OP is debatably an unreasonable and vitriolic poster but responses do demonstrate a weird defensiveness on the topic for sure.",
                    "author": "JDMultralight",
                    "id": "i7d5773",
                    "parent_id": "t1_i7cww3p",
                    "score": 4,
                    "created_utc": 1651710593.0,
                    "replies": [
                        {
                            "body": "“Responses do demonstrate a weird defensiveness on this topic for sure”.\n\nGlad someone else can recognise this.",
                            "author": "xWaterlooSunset",
                            "id": "i7d5cnl",
                            "parent_id": "t1_i7d5773",
                            "score": 4,
                            "created_utc": 1651710661.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I mean its targeted at men.  I have never needed to read these rules to understand how to sex.\n\nWhat is there actually to engage with here?  The rapist are not going to come in here and argue.\n\nIs this like some kind of educational course?  Do you think men are going to look at this and be like, oh shit, I learned something new today?\n\nThis to me is a bunch of HR legal stuff that is there to defeat defenses that an actual rapist is going to try to do to get away with rape.\n\nCan you imagine actual sex going this way?  \"Periodically checking in with your partner?\"\n\n\"Do you want me to keep going\"  pump pump pump.  \"More?\"  pump pump pump.  \"Are you sure this is ok?\" pump pump pump.  \"we don't have to do this\"..\n\nI mean, come on..",
                    "author": "rougeforces",
                    "id": "i7d0agt",
                    "parent_id": "t1_i7cww3p",
                    "score": 0,
                    "created_utc": 1651708409.0,
                    "replies": [
                        {
                            "body": "Please, tell me how this post targets men? If you read my comments, you’ll see that this post is for both men and women. Now, if you’re feeling targeted, that’s a you problem…",
                            "author": "bubblerush",
                            "id": "i7d2dew",
                            "parent_id": "t1_i7d0agt",
                            "score": 12,
                            "created_utc": 1651709335.0,
                            "replies": [
                                {
                                    "body": "Are you clueless about how sex works?  Just for reference, the woman is the lock the man is the key.  Inert the key into the lock.  Turn, open.  \n\nPoint is, no one ever talks about consent in terms of the man giving consent.  so when consent is brought up, its implied that its consent of a woman to allow a man to penetrate her body. \n\nYou are being so obtuse in your arguments.  who actually trolls a community where consent is paramount with a consent thread and then takes it personal when someone give there view on it. \n\nI don't feel targeted as a man, and a man with money, I got a bullseye on my back every day.  I am targeted.  What I feel is that you are trying to stir shit up cause you got nothin else better to do.",
                                    "author": "rougeforces",
                                    "id": "i7d32tf",
                                    "parent_id": "t1_i7d2dew",
                                    "score": -11,
                                    "created_utc": 1651709657.0,
                                    "replies": [
                                        {
                                            "body": "Again, read my comments. I’ve made multiple comments about how consent from the male partner is just as important.",
                                            "author": "bubblerush",
                                            "id": "i7d3dtd",
                                            "parent_id": "t1_i7d32tf",
                                            "score": 7,
                                            "created_utc": 1651709792.0,
                                            "replies": [
                                                {
                                                    "body": "right, imagine both partners continuously evaluating consent, that is even worse than just targeting men.  I cannot imagine any woman including yourself laying on your back in the throws of passion asking yourself if he is still ok with what is happening every so often. \n\nIt's pretty damn obvious when a woman removes her consent.  Just like it's pretty damn obvious when she gives it.  I mock the rules because I am a man that understands how to treat a woman, not a boy that has never experienced sex before, nor a psychopath that is trying to rape someone.\n\nThat is all.",
                                                    "author": "rougeforces",
                                                    "id": "i7d5ivb",
                                                    "parent_id": "t1_i7d3dtd",
                                                    "score": -5,
                                                    "created_utc": 1651710737.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "So when she says ‘yes, yes, yes’,  maybe it could work?\n\n/s",
                            "author": "timrid",
                            "id": "i7d2ex3",
                            "parent_id": "t1_i7d0agt",
                            "score": 4,
                            "created_utc": 1651709354.0,
                            "replies": []
                        },
                        {
                            "body": "I mean, that’s a fun form of tease and denial play …. “I’m not putting that cock back in unless you beg me…”",
                            "author": "57hz",
                            "id": "i7dokc9",
                            "parent_id": "t1_i7d0agt",
                            "score": 2,
                            "created_utc": 1651719396.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">touchy subject \n\n<Giggle!>",
                    "author": "Chill_SD1974",
                    "id": "i7dowo6",
                    "parent_id": "t1_i7cww3p",
                    "score": 2,
                    "created_utc": 1651719565.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "i7cv0b0",
            "parent_id": "t3_uiiejn",
            "score": 17,
            "created_utc": 1651706011.0,
            "replies": [
                {
                    "body": "💯",
                    "author": "usererror403",
                    "id": "i7dloue",
                    "parent_id": "t1_i7cv0b0",
                    "score": 3,
                    "created_utc": 1651718034.0,
                    "replies": []
                },
                {
                    "body": "This post isn’t just for SBs, it’s also for SDs. Consent isn’t just for women, consent goes both ways.",
                    "author": "bubblerush",
                    "id": "i7cv841",
                    "parent_id": "t1_i7cv0b0",
                    "score": 3,
                    "created_utc": 1651706109.0,
                    "replies": [
                        {
                            "body": "Consider the point missed.",
                            "author": "timrid",
                            "id": "i7d29m2",
                            "parent_id": "t1_i7cv841",
                            "score": 5,
                            "created_utc": 1651709286.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol not the SDs in the comments all being butthurt about this post. Embarrassing honestly",
            "author": "RaiseQuirky1152",
            "id": "i7dc6fo",
            "parent_id": "t3_uiiejn",
            "score": 11,
            "created_utc": 1651713682.0,
            "replies": []
        },
        {
            "body": "I'm sorry but if someone repeatedly asked me if something was ok before every single kiss or position change etc  it would 100% kill the mood. I will tell them No if I need to.  If I don't say no he has consent.",
            "author": "tamenwild",
            "id": "i7cqmvl",
            "parent_id": "t3_uiiejn",
            "score": 26,
            "created_utc": 1651704071.0,
            "replies": [
                {
                    "body": "I think there's a distinction here. If there's precedent (e.g.  a kiss) and it's within the realm of what's expected you don't have to ask all the time. But if you're unexpectedly changing what's happening you should make sure it's ok. \n\nI think anal is a great example. If you're switching from vaginal to that, there should be at least a moment of \"is it ok if I...\" Since she may not be prepared/in the mood for that. V.S. changing positions while still in vaginal, which could reasonably be expected to be part of sex. \n\nIt's kind of just common sense. If there's any question or potential doubt, better to ask. But no one is going to arrest you for kissing your girlfriend unexpectedly 🤦",
                    "author": "sinperviren",
                    "id": "i7ctc87",
                    "parent_id": "t1_i7cqmvl",
                    "score": 41,
                    "created_utc": 1651705259.0,
                    "replies": [
                        {
                            "body": "Anal is a hard limit I discuss before any clothes come off with a new partner. But if it were on the table then yes certainly ask.  But that's very different from \"can I kiss you?\" \"Can I touch your breasts?\" \"Can I touch your p***y?\" \"Can I go down on you?\" \"Can I be inside you now?\"  Asking if EVERY little thing is ok is ridiculous. If I'm there and participating,  unless I say no or do this instead,  he has consent. \n\nBefore anyone says I don't understand if I've never been assaulted...I have, on more than one occasion.  And I made it clear it wasn't ok and they did it anyway. The people who are going to take advantage of someone being drunk/ passed out or hold them down and do it anyway are still going to do those things.  Even if 90% of the men in the world asked for consent before every single thing. I can understand maybe asking once the first time you are together if she's sure this is something she wants.  But before every act is ridiculous. If we're talking BDSM or something away from the \"norm\" than yes conversations need to be had. But that's a different conversation than what the OP said.",
                            "author": "tamenwild",
                            "id": "i7cw9xs",
                            "parent_id": "t1_i7ctc87",
                            "score": 14,
                            "created_utc": 1651706600.0,
                            "replies": [
                                {
                                    "body": "To the three ladies above me thank you so much for being reasonable about this I mean where does the OP go with her writing? I mean I’m trying to envision myself asking a woman hey Miss do you mind if I unbutton the top button of your blouse how about the second button how about the third where the hell does that shit end",
                                    "author": "puckhead4",
                                    "id": "i7cy9p1",
                                    "parent_id": "t1_i7cw9xs",
                                    "score": -1,
                                    "created_utc": 1651707502.0,
                                    "replies": [
                                        {
                                            "body": "IDK I don't actually disagree with OP, I think it's just about not interpreting it too literally. \n\nI think the main point of stuff like this is \"don't assume consent\". Can consent be implied nonverbally? Totally! No one expects you to ask every time you kiss, especially when both parties are showing enthusiasm.\n\nNow if your partner has an unclear reaction to something you're doing e.g. freezing up a little, it's probably good to check in, which doesn't always mean \"is this ok\" but could be something along the lines of \"do you like that?\" It doesnt have to be \"may I penetrate you vaginally\" it can be \"tell me how badly you want me to fuck you\". Long story short if there's any doubt, you can still have fun while checking in. \n\nI think the misunderstanding of points like OP's is that all couples communicate differently and there's never going to be one perfect formula to discern consent. We tried \"no means no\" and you end up with cases of people getting raped while crying, then the rapist says \"well they never actually said no\". Interpreting that literally clearly doesn't work. So we get enthusiastic consent. And yes, ask if you're unsure is the safest bet, but no, there isn't some secret agenda to stop people from having sex without asking every few minutes. And this one shouldn't be taken 100% literally either.",
                                            "author": "sinperviren",
                                            "id": "i7d0mel",
                                            "parent_id": "t1_i7cy9p1",
                                            "score": 29,
                                            "created_utc": 1651708558.0,
                                            "replies": [
                                                {
                                                    "body": "That’s where it gets complicated. What does it mean to be under the influence of drugs or alcohol?\n\nThey took an edible and a benzo before the date to “set the vibe”. Now they can’t give consent, and if they change their mind after the fact you never had consent to begin with. \n\nI mean reasonable people understand the difference between someone who is buzzing and having a good time and someone who is wasted. However people are not reasonable…\n\nI guess I get hung up on scenarios where people give consent, change their mind during the act, don’t clearly voice that they changed their mind (for whatever reason) and then retroactive withdrawal consent and the call it sexual assault.\n\nThat scenario is fundamentally different the a physically violent sexual assault where consent was never given and active physical resistance is used. \n\nWhat do I know… I am just a man who has never been manipulated into doing anything I didn’t want to do by the fairer sex. ;)",
                                                    "author": null,
                                                    "id": "i7df8rl",
                                                    "parent_id": "t1_i7d0mel",
                                                    "score": 0,
                                                    "created_utc": 1651715064.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Idk someone doesn't like my opinion and is down voting 🤣🤣🤣",
                                            "author": "tamenwild",
                                            "id": "i7cymcf",
                                            "parent_id": "t1_i7cy9p1",
                                            "score": 0,
                                            "created_utc": 1651707657.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Thank you for being the voice of reason here!",
                            "author": "57hz",
                            "id": "i7dhqhx",
                            "parent_id": "t1_i7ctc87",
                            "score": -7,
                            "created_utc": 1651716190.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You can give implied consent. It doesn’t always have to be verbal.",
                    "author": "xWaterlooSunset",
                    "id": "i7cx6ke",
                    "parent_id": "t1_i7cqmvl",
                    "score": 23,
                    "created_utc": 1651707010.0,
                    "replies": [
                        {
                            "body": "\"Consent looks like…\n\n•Asking permission before you change the type or degree of sexual activity with phrases like “Is this OK?”\n\n•Confirming that there is reciprocal interest before initiating any physical touch.\n\n•Letting your partner know that you can stop at any time.\n\n•Periodically checking in with your partner, such as asking “Is this still okay?” \"\n\nI agree there is/ can be implied consent but according to the OP you need to verbally ask \"is this ok?\" And \"is this still ok?\"",
                            "author": "tamenwild",
                            "id": "i7d16lp",
                            "parent_id": "t1_i7cx6ke",
                            "score": 6,
                            "created_utc": 1651708804.0,
                            "replies": [
                                {
                                    "body": "“Confirming that there is reciprocal interest” doesn’t need to be verbal. You can pick up on your partners non-verbal cues, and it’s important to confirm (verbally or non-verbally) that they’re also enjoying themselves and comfortable with what’s happening.",
                                    "author": "bubblerush",
                                    "id": "i7d25zo",
                                    "parent_id": "t1_i7d16lp",
                                    "score": 18,
                                    "created_utc": 1651709240.0,
                                    "replies": []
                                },
                                {
                                    "body": "To me the foundation of consent is empowering her to be expressive and responding.  To me it is fun to let her take the lead once started.\n\n I prefer to let her decide when it is time to change from cowgirl oral. \n\nTotally agree that anal ( not something for which I have any enthusiasm) should  require affirmation prior as the intent might not be apparent.",
                                    "author": "pinotandsugar",
                                    "id": "i7dofac",
                                    "parent_id": "t1_i7d16lp",
                                    "score": 4,
                                    "created_utc": 1651719328.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "OP is not suggesting this is should be done. Does she say someone should ask if it's ok at every kiss?  \nUsually people can make it sexy too. Dirty talk, ask \"do you like that?\" and etc  \nI don't know why people assume it should be aseptic and boring.",
                    "author": "Ok_Bid_1487",
                    "id": "i7dkywo",
                    "parent_id": "t1_i7cqmvl",
                    "score": 15,
                    "created_utc": 1651717696.0,
                    "replies": [
                        {
                            "body": "She clarified what she meant further down in the comments.  But that is not how I interpret the wording of the post.",
                            "author": "tamenwild",
                            "id": "i7dn99o",
                            "parent_id": "t1_i7dkywo",
                            "score": 1,
                            "created_utc": 1651718781.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> If I don't say no he has consent.\n\nI think if more people articulated this at the outset, it would go a long way toward eliminating a lot of the angst around the subject (especially in itinerant hookups and the like)",
                    "author": "Y_4Z44",
                    "id": "i7crb0o",
                    "parent_id": "t1_i7cqmvl",
                    "score": 5,
                    "created_utc": 1651704361.0,
                    "replies": []
                },
                {
                    "body": "If you have a partner who is engaging enthusiastically that’s one thing, but if you have a partner who is disengaged, check in and ask if it’s okay.",
                    "author": "bubblerush",
                    "id": "i7cs7at",
                    "parent_id": "t1_i7cqmvl",
                    "score": 4,
                    "created_utc": 1651704754.0,
                    "replies": [
                        {
                            "body": "But that's not what your post is saying at all.",
                            "author": "mraspencer",
                            "id": "i7ct4sj",
                            "parent_id": "t1_i7cs7at",
                            "score": 5,
                            "created_utc": 1651705170.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "SMH. That train of thought is exactly what the issue is. So let’s say you pass out, and while ur asleep someone takes it upon himself to help himself (and a friend) to your vagina. “Well you didn’t say no!” Are saying that you won’t feel violated? Waking up wet?",
                    "author": "Terry_romulus",
                    "id": "i7ct7fi",
                    "parent_id": "t1_i7cqmvl",
                    "score": 2,
                    "created_utc": 1651705203.0,
                    "replies": [
                        {
                            "body": "Seriously?  That's what you take from my comment? There is no question that if someone is passed out it's rape. My comment was in regard to asking permission for every little thing.",
                            "author": "tamenwild",
                            "id": "i7cx6w4",
                            "parent_id": "t1_i7ct7fi",
                            "score": 12,
                            "created_utc": 1651707014.0,
                            "replies": [
                                {
                                    "body": "“Asking permission for every little thing.” Consent doesn’t always have to be verbal, if it’s something that’s in the realm of what you normally do with your partner (kissing, touching, vaginal intercourse) and they’re engaged and reciprocating that’s one thing, but when changing the “type or degree” of sexual activity there needs to be consent. If you were to initiate anal sex, bdsm, kink/fetish, or anything more than what you know is within your partner’s comfort zone, you need to ask if it’s okay.",
                                    "author": "bubblerush",
                                    "id": "i7cz6f6",
                                    "parent_id": "t1_i7cx6w4",
                                    "score": 4,
                                    "created_utc": 1651707905.0,
                                    "replies": [
                                        {
                                            "body": "But that is not what you imply on your OP.",
                                            "author": "tamenwild",
                                            "id": "i7czie7",
                                            "parent_id": "t1_i7cz6f6",
                                            "score": 5,
                                            "created_utc": 1651708056.0,
                                            "replies": [
                                                {
                                                    "body": "I don’t understand, I’m assuming you’re talking about one of these points, which one “implies” that your partner needs to “ask permission for every little thing”? \n\n•Asking permission before you change the type or degree of sexual activity with phrases like \"Is this OK?\"\n\nSo, asking if it’s okay before switching to anal sex. Asking if they’re comfortable before oral sex, some partners are not. Asking if it’s okay to up the degree, example, if you were to up the degree to BSDM. \n\n•Confirming that there is reciprocal interest\nbefore initiating any physical touch.\n\nSo, making sure that your partner is also into it, picking up on their non-verbal cues. Not just assuming that you have consent to pull their pants off. Making sure that they’re “reciprocating.”",
                                                    "author": "bubblerush",
                                                    "id": "i7d16kl",
                                                    "parent_id": "t1_i7czie7",
                                                    "score": 5,
                                                    "created_utc": 1651708804.0,
                                                    "replies": [
                                                        {
                                                            "body": "You probably should have explained what you meant in the original because that is not the impression I get when reading it. For either bullet point.",
                                                            "author": "tamenwild",
                                                            "id": "i7d25ev",
                                                            "parent_id": "t1_i7d16kl",
                                                            "score": 5,
                                                            "created_utc": 1651709233.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Me neither.",
                                                                    "author": "ShaArt5",
                                                                    "id": "i7d6vlq",
                                                                    "parent_id": "t1_i7d25ev",
                                                                    "score": 2,
                                                                    "created_utc": 1651711339.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Careful, recognizing a woman's responsibility in consent issues is absolutely not what the OP is aiming for with this post.",
                    "author": "storm170",
                    "id": "i7d3w0j",
                    "parent_id": "t1_i7cqmvl",
                    "score": -1,
                    "created_utc": 1651710014.0,
                    "replies": []
                },
                {
                    "body": "thank you for speaking up as a women! This would absolutely kill the mood if we as men had to ask you before every single move we make. This OP has some kind of agenda, his/her posts are always controversial.",
                    "author": "NickPfromYuma",
                    "id": "i7csfgv",
                    "parent_id": "t1_i7cqmvl",
                    "score": -7,
                    "created_utc": 1651704857.0,
                    "replies": [
                        {
                            "body": "How is consent controversial?",
                            "author": "bubblerush",
                            "id": "i7csmyt",
                            "parent_id": "t1_i7csfgv",
                            "score": 3,
                            "created_utc": 1651704949.0,
                            "replies": [
                                {
                                    "body": "Consent is not controversial.  Your definition of consent is.",
                                    "author": null,
                                    "id": "i7d26i5",
                                    "parent_id": "t1_i7csmyt",
                                    "score": 13,
                                    "created_utc": 1651709247.0,
                                    "replies": []
                                },
                                {
                                    "body": "Could I respectfully ask why you post here despite the earlier post that made it clear you’re against sugaring?",
                                    "author": "JDMultralight",
                                    "id": "i7d47wl",
                                    "parent_id": "t1_i7csmyt",
                                    "score": 0,
                                    "created_utc": 1651710157.0,
                                    "replies": [
                                        {
                                            "body": "Never said I was against sugaring, I just think it needs to be safer, for men and women.",
                                            "author": "bubblerush",
                                            "id": "i7d4d4u",
                                            "parent_id": "t1_i7d47wl",
                                            "score": 6,
                                            "created_utc": 1651710221.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "i7csel6",
                    "parent_id": "t1_i7cqmvl",
                    "score": -7,
                    "created_utc": 1651704846.0,
                    "replies": [
                        {
                            "body": "Oh I know the crazy anxiety of going in for that first kiss… don’t crash into her teeth… watch out for the nose… oh no braces 😬",
                            "author": null,
                            "id": "i7dfixy",
                            "parent_id": "t1_i7csel6",
                            "score": -2,
                            "created_utc": 1651715190.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "If I said “is this ok?“ my SB would think I’m a simp and walk out.",
                    "author": "UnearthlyDinosaur",
                    "id": "i7ct71x",
                    "parent_id": "t1_i7cqmvl",
                    "score": -6,
                    "created_utc": 1651705198.0,
                    "replies": [
                        {
                            "body": "If a guy used the word “simp”, I would be out.",
                            "author": "xWaterlooSunset",
                            "id": "i7cx9wj",
                            "parent_id": "t1_i7ct71x",
                            "score": 20,
                            "created_utc": 1651707052.0,
                            "replies": [
                                {
                                    "body": "Simp. \n\nYou out?",
                                    "author": "timrid",
                                    "id": "i7d1e4m",
                                    "parent_id": "t1_i7cx9wj",
                                    "score": -5,
                                    "created_utc": 1651708895.0,
                                    "replies": [
                                        {
                                            "body": "Was never in, hun",
                                            "author": "xWaterlooSunset",
                                            "id": "i7d45c0",
                                            "parent_id": "t1_i7d1e4m",
                                            "score": 13,
                                            "created_utc": 1651710126.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "i7d140x",
            "parent_id": "t3_uiiejn",
            "score": 5,
            "created_utc": 1651708772.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "i7dc0gi",
                    "parent_id": "t1_i7d140x",
                    "score": 4,
                    "created_utc": 1651713609.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "i7dd5ks",
                            "parent_id": "t1_i7dc0gi",
                            "score": 2,
                            "created_utc": 1651714117.0,
                            "replies": [
                                {
                                    "body": "Not right is not the same as “sexual misconduct”.",
                                    "author": "57hz",
                                    "id": "i7doa5j",
                                    "parent_id": "t1_i7dd5ks",
                                    "score": 2,
                                    "created_utc": 1651719259.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yeah, this is just North Carolina 18th century crap. Most states do not punish adultery in either criminal or civil arenas.",
                            "author": "57hz",
                            "id": "i7do80w",
                            "parent_id": "t1_i7dc0gi",
                            "score": 1,
                            "created_utc": 1651719231.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "And women who lie about being on birth control.",
                    "author": "BinghamtonSD",
                    "id": "i7dd3u8",
                    "parent_id": "t1_i7d140x",
                    "score": 1,
                    "created_utc": 1651714095.0,
                    "replies": [
                        {
                            "body": "Yes exactly, lying about contraception is never okay. Women lying about being on birth control, men lying about having a vasectomy, or either partner removing a condom without consent.",
                            "author": "bubblerush",
                            "id": "i7de8d4",
                            "parent_id": "t1_i7dd3u8",
                            "score": 6,
                            "created_utc": 1651714609.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "As a victim of rape and other levels of abuse/sexual violence, I don’t know if I like consent being laid out so black and white like this. When you make consent a list of technicalities like a to do list, (or as you said to “teach people” what consent is) it leaves you open to error of omission or possibly put in a situation you hadn’t prepared for leaving you open to the “well you/i didn’t [blank] so it’s not rape”. Demonstrations of consent are entirely up to the individuals involved and their own boundaries, so I feel that a lot of things can be cleared up in the initial limits conversation(s) and not have to be brought up again unless there’s a new activity that opens them up to new levels of consent. People should be aware NOT consenting has many other forms than loudly saying no and that there are sensual ways of asking for consent, yes, but boundaries and silent cues/how people show consent differ from person to person.",
            "author": "usererror403",
            "id": "i7dcyia",
            "parent_id": "t3_uiiejn",
            "score": 5,
            "created_utc": 1651714030.0,
            "replies": [
                {
                    "body": "As another victim of rape and other levels of abuse, as an estimated 1 in 3 women are, I’m not saying that this is a complete black and white list of what consent looks like. Obviously it varies from couple to couple, but since nearly 1 in 10 women are raped by an intimate partner in their lifetime, I thought it was important to share. Consent shouldn’t be assumed just because you’re in a relationship, and it’s important to know what consent DOESN’T look like, because as we both know not everyone does.",
                    "author": "bubblerush",
                    "id": "i7ddv3z",
                    "parent_id": "t1_i7dcyia",
                    "score": 8,
                    "created_utc": 1651714441.0,
                    "replies": [
                        {
                            "body": "It is important, absolutely. But I think you may want to watch your wording in the future so as not to seem to be generalizing and keep in mind you probably lost a lot of SD’s here benefit of the doubt based on your previous posts about sugar dating. You make a lot of valid points but tend to come off condescending which can just lead to people not listening at all to your core, important message.",
                            "author": "usererror403",
                            "id": "i7dfuuh",
                            "parent_id": "t1_i7ddv3z",
                            "score": 2,
                            "created_utc": 1651715338.0,
                            "replies": [
                                {
                                    "body": "The men here aren’t disagreeing because I’m the one that posted it and I lost their “benefit of the doubt.” The men that are offended by this post are offended for other reasons unfortunately. If 1 in 3 women are victims of sexual violence, where are the perpetrators? I’d assume at least a handful of the men getting upset here.",
                                    "author": "bubblerush",
                                    "id": "i7dgrv4",
                                    "parent_id": "t1_i7dfuuh",
                                    "score": 6,
                                    "created_utc": 1651715757.0,
                                    "replies": [
                                        {
                                            "body": "I’m just saying as a woman and a victim I didn’t agree with how you worded either post, so I can just imagine how they read it. And generally yes there’s usually smoke where there’s fire, but it’s very disingenuous and damaging to assume whenever men are upset at your views/wording it’s because they’re a perpetrator.",
                                            "author": "usererror403",
                                            "id": "i7di09y",
                                            "parent_id": "t1_i7dgrv4",
                                            "score": 10,
                                            "created_utc": 1651716310.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have been in multiple situations (after they express their desire for me to be dominant sexually) where I essentially have to assume consent when I start, though they do often lay down ground rules beforehand (e.g. - no anal, don't cum in my face, etc.). But it is a little strange to navigate still at times with a new partner. Very few men want to be rapists. But I think the onus is on men to listen to both verbal and nonverbal (body language mostly) communication, especially that first time. I have never had a woman after the first time ever accuse me of taking it too far (and I always have talked to them after), so I don't see this as a problem for me, but I also recognize that it is absolutely a problem for a lot of men.\n\nMaybe an SB has some tips for navigating the dominant and rough sex world when it comes to consent from their perspective, because I think I would even learn something.",
            "author": "elpinguino82",
            "id": "i7d85qd",
            "parent_id": "t3_uiiejn",
            "score": 4,
            "created_utc": 1651711914.0,
            "replies": [
                {
                    "body": "Talking about ground rules for more intense sex, before diving into it, is super important! Everyone has different comfort levels. Personally, when I’m navigating sex that’s a little more extreme or different from what I normally do with my partner, we use red/yellow light safe words. Yellow, meaning slow down or be more gentle. Red, meaning hard stop.",
                    "author": "bubblerush",
                    "id": "i7d99ki",
                    "parent_id": "t1_i7d85qd",
                    "score": 12,
                    "created_utc": 1651712392.0,
                    "replies": []
                },
                {
                    "body": "I would advise the following videos...\n\nhttps://youtu.be/bkflDahXsZ4\n\nhttps://youtu.be/02gLHzvOSAI\n\nhttps://youtu.be/N0kduSrtohM\n\nI am a BDSM Switch and have Dominants snd submissives of my own. VdSM is not all about rough sex. Kink is customizable child's play with adult sexual privledge and cool toys. \n\nIf you're interested in more, check out the Anerican Sex podcast.",
                    "author": "LadyMorgan2018",
                    "id": "i7df028",
                    "parent_id": "t1_i7d85qd",
                    "score": 4,
                    "created_utc": 1651714954.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What was your impetus for posting this? Just a download of info with no context is...odd.",
            "author": "mraspencer",
            "id": "i7ct1lf",
            "parent_id": "t3_uiiejn",
            "score": 6,
            "created_utc": 1651705131.0,
            "replies": [
                {
                    "body": "I thought it needed to be shared, since women are still sharing their stories of being assaulted on this form. Also, I thought this would be helpful for men. If men are unknowingly intimate with someone who is underage, or claims to be underage afterwards, then they were not able to give informed consent. I’ve heard of SBs trying to blackmail men by pulling that card.",
                    "author": "bubblerush",
                    "id": "i7cu1un",
                    "parent_id": "t1_i7ct1lf",
                    "score": 13,
                    "created_utc": 1651705577.0,
                    "replies": []
                },
                {
                    "body": "More useful than a fake erotica fanfic that we get delightfully treated to from time to time.",
                    "author": "xWaterlooSunset",
                    "id": "i7cyn2f",
                    "parent_id": "t1_i7ct1lf",
                    "score": 10,
                    "created_utc": 1651707667.0,
                    "replies": [
                        {
                            "body": "This is indeed an accurate point.",
                            "author": "Y_4Z44",
                            "id": "i7d09k6",
                            "parent_id": "t1_i7cyn2f",
                            "score": 4,
                            "created_utc": 1651708397.0,
                            "replies": [
                                {
                                    "body": "Each time, I’m like “ugh I DID NOT consent to this cringey story please, make it stop” 😅",
                                    "author": "xWaterlooSunset",
                                    "id": "i7d0il0",
                                    "parent_id": "t1_i7d09k6",
                                    "score": 11,
                                    "created_utc": 1651708511.0,
                                    "replies": [
                                        {
                                            "body": "Lmfaooooo",
                                            "author": "Y_4Z44",
                                            "id": "i7d0qtx",
                                            "parent_id": "t1_i7d0il0",
                                            "score": 3,
                                            "created_utc": 1651708612.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "i7de5zr",
            "parent_id": "t3_uiiejn",
            "score": 5,
            "created_utc": 1651714579.0,
            "replies": [
                {
                    "body": "Wanna check your grammar and try again?",
                    "author": "bubblerush",
                    "id": "i7demjk",
                    "parent_id": "t1_i7de5zr",
                    "score": -4,
                    "created_utc": 1651714786.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"They are under the influence of drugs and/or alcohol\"\n\nPeople fuck under the influence all of the time and it's consented (in any type of relationship, not just sugar). What matters is **how much** influence the person is under. Have they had 2 drinks or 20?",
            "author": "ethanwa79",
            "id": "i7cs4o9",
            "parent_id": "t3_uiiejn",
            "score": 5,
            "created_utc": 1651704721.0,
            "replies": [
                {
                    "body": "The idea that a woman (and let’s not be coy, this conversation is always about women drinking) isn’t able to consent just because she had a few drinks is extremely infantilizing. A woman that has chosen to drink and has chosen to give consent is VERY different from someone so drunk and trashed that cannot properly verbalize their stance on anything.   \n\n\nbut as soon as you try to say “use common sense” some asshole will fuck a girl while she is asleep and cry “but she didn’t say no!”",
                    "author": "Yourstruly0",
                    "id": "i7dbd7d",
                    "parent_id": "t1_i7cs4o9",
                    "score": 2,
                    "created_utc": 1651713319.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🍿🍿🍿",
            "author": null,
            "id": "i7cpuy9",
            "parent_id": "t3_uiiejn",
            "score": 4,
            "created_utc": 1651703736.0,
            "replies": []
        },
        {
            "body": "Oh YOU AGAIN , go home to THAT SUB ABOUT THAT \" INDUSTRY \" \n\nthis sub is about casual dating ( you won't understand )",
            "author": "shamloo77",
            "id": "i7cq00s",
            "parent_id": "t3_uiiejn",
            "score": 6,
            "created_utc": 1651703797.0,
            "replies": []
        },
        {
            "body": "Not this one again.",
            "author": "Y_4Z44",
            "id": "i7cpzc6",
            "parent_id": "t3_uiiejn",
            "score": 4,
            "created_utc": 1651703789.0,
            "replies": [
                {
                    "body": "Post history checks out",
                    "author": "timrid",
                    "id": "i7cq1xi",
                    "parent_id": "t1_i7cpzc6",
                    "score": 6,
                    "created_utc": 1651703821.0,
                    "replies": [
                        {
                            "body": "Yeah, there are people (the vast majority of people in SLF) who're here to help, and would have made this a worthwhile post. And then there are those whose singular purpose in life seems to be, well, let's just say, less than pleasant to everyone around them.",
                            "author": "Y_4Z44",
                            "id": "i7cqcs0",
                            "parent_id": "t1_i7cq1xi",
                            "score": 3,
                            "created_utc": 1651703951.0,
                            "replies": [
                                {
                                    "body": "There are a number of posts that followed that were collectively straying from the spirit of SLF  and have been removed........\n\ncivility is sensual      thanks",
                                    "author": "pinotandsugar",
                                    "id": "i7dp2pl",
                                    "parent_id": "t1_i7cqcs0",
                                    "score": -4,
                                    "created_utc": 1651719646.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "i7ct0n2",
                    "parent_id": "t1_i7cpzc6",
                    "score": 3,
                    "created_utc": 1651705119.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "i7cu30y",
                            "parent_id": "t1_i7ct0n2",
                            "score": 9,
                            "created_utc": 1651705593.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "i7cyx92",
                                    "parent_id": "t1_i7cu30y",
                                    "score": 2,
                                    "created_utc": 1651707793.0,
                                    "replies": []
                                },
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "i7d9sq6",
                                    "parent_id": "t1_i7cu30y",
                                    "score": -3,
                                    "created_utc": 1651712620.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "i7daqs1",
                                            "parent_id": "t1_i7d9sq6",
                                            "score": 3,
                                            "created_utc": 1651713040.0,
                                            "replies": [
                                                {
                                                    "body": "A little 🤣",
                                                    "author": "Pretty_Ant_3094",
                                                    "id": "i7dbym7",
                                                    "parent_id": "t1_i7daqs1",
                                                    "score": 0,
                                                    "created_utc": 1651713586.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "i7dnzzp",
                                            "parent_id": "t1_i7d9sq6",
                                            "score": 2,
                                            "created_utc": 1651719127.0,
                                            "replies": [
                                                {
                                                    "body": "> jargon \"you *paid* for the\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                                                    "author": "Paid-Not-Payed-Bot",
                                                    "id": "i7do191",
                                                    "parent_id": "t1_i7dnzzp",
                                                    "score": 2,
                                                    "created_utc": 1651719143.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "i7cv0vi",
                            "parent_id": "t1_i7ct0n2",
                            "score": 2,
                            "created_utc": 1651706018.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This one is way off this planet",
                    "author": "shamloo77",
                    "id": "i7cq60e",
                    "parent_id": "t1_i7cpzc6",
                    "score": 0,
                    "created_utc": 1651703870.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I didn't know SLF had an HR department.  Interesting.",
            "author": "rougeforces",
            "id": "i7cz38b",
            "parent_id": "t3_uiiejn",
            "score": 1,
            "created_utc": 1651707866.0,
            "replies": [
                {
                    "body": "The HR meeting is a pretty popular fantasy. Don't knock it till you've tried it. Lolol! 😎😂",
                    "author": "LadyMorgan2018",
                    "id": "i7dg2kr",
                    "parent_id": "t1_i7cz38b",
                    "score": 3,
                    "created_utc": 1651715433.0,
                    "replies": []
                },
                {
                    "body": "Catbert in charge of all of our SRs.",
                    "author": "BinghamtonSD",
                    "id": "i7ddajb",
                    "parent_id": "t1_i7cz38b",
                    "score": 1,
                    "created_utc": 1651714180.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "While you are certainly entitled to have your own opinions of consent, it’s important to understand that the definitions you have posted above are not universally accepted and many do not match legal definitions.  \n\nI’m not going to go through every one, but your very first one would make like half of all sexual encounters non-consensual (with both parties being the “victim” by the way) if interpreted literally as written.",
            "author": null,
            "id": "i7czia0",
            "parent_id": "t3_uiiejn",
            "score": 3,
            "created_utc": 1651708055.0,
            "replies": []
        },
        {
            "body": "What if the guy is drunk and the sb wants to have sex. Can the guy still consent to sex?",
            "author": null,
            "id": "i7cvf2v",
            "parent_id": "t3_uiiejn",
            "score": 2,
            "created_utc": 1651706196.0,
            "replies": [
                {
                    "body": "Not if he has whiskey dick.",
                    "author": "timrid",
                    "id": "i7d2p9p",
                    "parent_id": "t1_i7cvf2v",
                    "score": 6,
                    "created_utc": 1651709488.0,
                    "replies": []
                },
                {
                    "body": "I’d say it depends, it would for either gender. If your partner has two drinks and gives you enthusiastic consent that’s one thing, but if your partner is very very intoxicated they’re not able to consent. If my SD was drunk and out of it, I wouldn’t feel comfortable engaging in anything sexual.",
                    "author": "bubblerush",
                    "id": "i7cvn1x",
                    "parent_id": "t1_i7cvf2v",
                    "score": 7,
                    "created_utc": 1651706298.0,
                    "replies": []
                },
                {
                    "body": "Since the guy isn’t penetrated, In many jurisdictions he can’t claim to be a rape victim.    Since he’s not penetrated, his consent is irrelevant in many jurisdictions.    \n\nThere have been many notable media reports of drunken male athletes having sex with a drunken girl, all consenting.   She was penetrated and her consent wasn’t valid, so she’s a victim. They were not penetrated so they can’t claim to be a victim even though their consent is also invalid.\n\nMany jurisdictions say to be raped is to be penetrated without valid consent.  To rape is to penetrate without valid consent.  Therefore in drunken heterosexual sex, the male is by definition a rapist and the female a rape victim.\n\nAgain, you can find cases in the news where this was the case.\n\n(I’m not saying this is fair, I’m saying that’s often the law).",
                    "author": "63daddy",
                    "id": "i7cwhof",
                    "parent_id": "t1_i7cvf2v",
                    "score": 0,
                    "created_utc": 1651706700.0,
                    "replies": [
                        {
                            "body": "What if the guy is sodomized? That counts as penetration?",
                            "author": null,
                            "id": "i7cwnaq",
                            "parent_id": "t1_i7cwhof",
                            "score": 6,
                            "created_utc": 1651706771.0,
                            "replies": [
                                {
                                    "body": "Yes, if he’s sodomized.   I was speaking to hetero PIV sex.",
                                    "author": "63daddy",
                                    "id": "i7cz5q2",
                                    "parent_id": "t1_i7cwnaq",
                                    "score": 3,
                                    "created_utc": 1651707897.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Well, the law is garbage when it comes to rape/assault. Men can be victims of rape too, not just women, and my heart goes out to male victims. As a woman, I couldn’t imagine how hard it is for male victims of rape and sexual assault. Society is still very invalidating for male survivors. This post is a great example, I made a post about consent in general, and everyone felt it was one sided, it’s not. Having consent from your male partner is just as important.",
                            "author": "bubblerush",
                            "id": "i7d0b44",
                            "parent_id": "t1_i7cwhof",
                            "score": 2,
                            "created_utc": 1651708417.0,
                            "replies": [
                                {
                                    "body": "I agree it’s “garbage”, but garbage or not it’s what one is held accountable to.",
                                    "author": "63daddy",
                                    "id": "i7d4hkx",
                                    "parent_id": "t1_i7d0b44",
                                    "score": 1,
                                    "created_utc": 1651710275.0,
                                    "replies": [
                                        {
                                            "body": "Well unfortunately, offenders are rarely held accountable. Out of every 1000 sexual assaults, only approximately 25 perpetrators will be incarcerated, and that statistic is from the Bureau of Justice Statistics.",
                                            "author": "bubblerush",
                                            "id": "i7d5kmp",
                                            "parent_id": "t1_i7d4hkx",
                                            "score": 8,
                                            "created_utc": 1651710760.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "When you say “Consent looks like…” that is one way of doing consent. BDSM consent can be all encompassing, can certainly involve the degree of fine grained questioning that goes on during sex, is appropriate for all types of sexual encounters and typically involves a more lengthy consent process before sex starts, as well as a clear way to stop sex at any time ie “no means no”\n\nIf, for example, anal is expressed as a hard limit, then it must not happen.\n\nPeriodically saying “is this still ok” need not be done when both partners know eachother and body language suggests that it is in fact ok.",
            "author": "daddoms",
            "id": "i7d178x",
            "parent_id": "t3_uiiejn",
            "score": 2,
            "created_utc": 1651708813.0,
            "replies": [
                {
                    "body": "It sounds Ike you are speaking of inclusive negotiations. Those are much easier to negotiate than exclusive. The hard limits and soft limits are a must, but desires and needs are much more positive. \n\nSuffice to say that periodic check is are most helpful and ethical in the beginning. Staying within negotiated boundaries builds trust. Then the blanket consents and reading your partner can come in time.",
                    "author": "LadyMorgan2018",
                    "id": "i7dfs6i",
                    "parent_id": "t1_i7d178x",
                    "score": 3,
                    "created_utc": 1651715304.0,
                    "replies": [
                        {
                            "body": "I’m 💯 inclusive for sure. I may even ask whether verbal or physical check-ins are preferred. Many people get non-verbal when play is intense eg subspace and that can easily/does easily happen with orgasms alone. Tapping out may be necessary.",
                            "author": "daddoms",
                            "id": "i7dnv7t",
                            "parent_id": "t1_i7dfs6i",
                            "score": 2,
                            "created_utc": 1651719068.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "There is a very flexible list of what consent can look like. The list of what consent DOESNT look like is pretty concrete  unless you have an existing agreement.",
                    "author": "Yourstruly0",
                    "id": "i7dc7ba",
                    "parent_id": "t1_i7d178x",
                    "score": 2,
                    "created_utc": 1651713693.0,
                    "replies": [
                        {
                            "body": "“Unless you have an existing agreement” can you elaborate? Like a CNC kink?",
                            "author": "bubblerush",
                            "id": "i7dcnma",
                            "parent_id": "t1_i7dc7ba",
                            "score": 2,
                            "created_utc": 1651713896.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm looking forward to a super romantic evening.\n\nMay I kiss you? Sign here.\n\n(time passes)\n\nMay I remove your clothing? Sign here and initial here.\n\n(time passes)\n\nMay I touch your breasts? Sign here and also write out what is and is okay while fondling you. Also, read this disclaimer and and initial here.\n\n(time passes)\n\nMay I insert my penis into your vagina? Excellent. Sign here. And we need to have it notarized.",
            "author": "matthewjphillips",
            "id": "i7ct1l7",
            "parent_id": "t3_uiiejn",
            "score": 1,
            "created_utc": 1651705131.0,
            "replies": [
                {
                    "body": "LMFAO! Great call on asking for the document to be notarized!",
                    "author": "puckhead4",
                    "id": "i7cyzt4",
                    "parent_id": "t1_i7ct1l7",
                    "score": 5,
                    "created_utc": 1651707824.0,
                    "replies": [
                        {
                            "body": "Mobile notaries just got a raise.",
                            "author": "57hz",
                            "id": "i7doc88",
                            "parent_id": "t1_i7cyzt4",
                            "score": -2,
                            "created_utc": 1651719287.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You forgot about asking “is this still ok” periodically.  Like, who knows, maybe it was ok to kiss for the first couple of minutes but not anymore and somehow your partner has become mute.",
                    "author": null,
                    "id": "i7d2n45",
                    "parent_id": "t1_i7ct1l7",
                    "score": -3,
                    "created_utc": 1651709460.0,
                    "replies": [
                        {
                            "body": "Cat got their tongue?",
                            "author": "57hz",
                            "id": "i7dod9f",
                            "parent_id": "t1_i7d2n45",
                            "score": 0,
                            "created_utc": 1651719300.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I forgot where, but a few years ago, a college theater group put on a skit like this during freshman orientation about that college's various rules.",
                    "author": "BinghamtonSD",
                    "id": "i7dczjo",
                    "parent_id": "t1_i7ct1l7",
                    "score": -1,
                    "created_utc": 1651714043.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "i7czku2",
            "parent_id": "t3_uiiejn",
            "score": 1,
            "created_utc": 1651708087.0,
            "replies": [
                {
                    "body": "i've seen a lot of polls lately, must of missed that one.",
                    "author": "rougeforces",
                    "id": "i7d7a87",
                    "parent_id": "t1_i7czku2",
                    "score": 1,
                    "created_utc": 1651711522.0,
                    "replies": []
                },
                {
                    "body": "🙄",
                    "author": "NickPfromYuma",
                    "id": "i7d45hl",
                    "parent_id": "t1_i7czku2",
                    "score": -2,
                    "created_utc": 1651710128.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\\#1 is not true as a practical matter in most scenarios, even if it's legally true in some states now. Not in reality though. Me and my SB's have great times together, drinking very expensive bottles of aged wine and whiskeys. And we joke with each other about the drunk consent laws.\n\nThese 3 rules are also definitely false, and nothing I will ever be following:\n\n*- Asking permission before you change the type or degree of sexual activity with phrases like “Is this OK?”*\n\n*- Confirming that there is reciprocal interest before initiating any physical touch.*\n\n*- Periodically checking in with your partner, such as asking “Is this still okay?”*\n\nNone of that is true. Instinct and common sense around non-verbal cues, has worked perfectly since I was 15 years old, and will continue to work just fine.",
            "author": "Nomad_Bill",
            "id": "i7daf00",
            "parent_id": "t3_uiiejn",
            "score": -1,
            "created_utc": 1651712895.0,
            "replies": []
        },
        {
            "body": "That is neither the law nor helpful for relationships.\n\nThis is sjw nonsense.",
            "author": "Wunderkinds",
            "id": "i7d9tdv",
            "parent_id": "t3_uiiejn",
            "score": -3,
            "created_utc": 1651712627.0,
            "replies": []
        },
        {
            "body": "Specifically what defines sexual assault or rape varies depending on the jurisdiction in question.     \n\nWhat constitutes valid consent similarly varies.   In most college title ix cases for example,  it’s acknowledged consent was given, the issue is typically whether the consent was valid or not.  Drinking is a common reason, but more and more we are seeing instances where consent is deemed invalid because the woman didn’t feel she could say no.     \n\nAlso at issue is penetration.   Most states say rape is to be penetrated without valid consent, the penetrated person being the victim, the penetrator being the perpetrator.   Therefore in heterosexual sex, where consent is invalid due to drinking, the male is by definition the perp and the woman the victim even if both equally consent, equally drunk.   \n\nSome states such as Georgia still define rape as a crime committed by men against women.  By statute a man can’t be raped.   (Though he can be a victim of other sex crimes).  \n\nThe age of consent also varies from state to state and country to country.  \n\nThe bottom line is you should know what law or policy applies to your location or situation.",
            "author": "63daddy",
            "id": "i7cthfl",
            "parent_id": "t3_uiiejn",
            "score": 1,
            "created_utc": 1651705323.0,
            "replies": [
                {
                    "body": "Well, regardless of what the law in any given jurisdiction says, I’d think most everyone would like to have legitimate, enthusiastic consent for any sexual encounter.",
                    "author": "Y_4Z44",
                    "id": "i7cuh7h",
                    "parent_id": "t1_i7cthfl",
                    "score": 8,
                    "created_utc": 1651705772.0,
                    "replies": [
                        {
                            "body": "What constitutes legitimate can vary however.    Someone can enthusiastically say yes, and it can later be ruled to be invalid consent.",
                            "author": "63daddy",
                            "id": "i7cvolx",
                            "parent_id": "t1_i7cuh7h",
                            "score": -1,
                            "created_utc": 1651706318.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"Is it okay?\" is for pussies.",
            "author": "Observing_n_Laughing",
            "id": "i7d2o0q",
            "parent_id": "t3_uiiejn",
            "score": -6,
            "created_utc": 1651709472.0,
            "replies": [
                {
                    "body": "Comments like these are so harmful. You can ask for consent in different ways “does that feel good baby?” It doesn’t always need to be “is this okay?” but saying that consent is for “pussies” isn’t okay. If you want to discuss with your partner that saying certain things is a turn off for you, that’s fine, but you don’t need to share comments like this.",
                    "author": "bubblerush",
                    "id": "i7d37b8",
                    "parent_id": "t1_i7d2o0q",
                    "score": 8,
                    "created_utc": 1651709713.0,
                    "replies": [
                        {
                            "body": "No, promoting the idea that if a chick is too immature to say no then that is consent violation is harmful. How about, instead we promote that someone who is too fucking immature to open her mouth when fucking should stop fucking and go to therapy? Would save a whole lot more consent violations than your approach.",
                            "author": "Observing_n_Laughing",
                            "id": "i7d3r9m",
                            "parent_id": "t1_i7d37b8",
                            "score": -13,
                            "created_utc": 1651709958.0,
                            "replies": [
                                {
                                    "body": "“If a chick is too fucking immature to open her mouth when fucking should stop fucking and go to therapy.”\n\n\nThat’s quite an uncalled for and needlessly aggressive reply. Do *you* need therapy?",
                                    "author": "xWaterlooSunset",
                                    "id": "i7d4g52",
                                    "parent_id": "t1_i7d3r9m",
                                    "score": 14,
                                    "created_utc": 1651710257.0,
                                    "replies": [
                                        {
                                            "body": "I am quite an aggressive person.",
                                            "author": "Observing_n_Laughing",
                                            "id": "i7d4mki",
                                            "parent_id": "t1_i7d4g52",
                                            "score": -12,
                                            "created_utc": 1651710336.0,
                                            "replies": [
                                                {
                                                    "body": "Sorry to hear that. Maybe you can get help one day.",
                                                    "author": "xWaterlooSunset",
                                                    "id": "i7d515a",
                                                    "parent_id": "t1_i7d4mki",
                                                    "score": 13,
                                                    "created_utc": 1651710517.0,
                                                    "replies": [
                                                        {
                                                            "body": "No need. Life is awesome.",
                                                            "author": "Observing_n_Laughing",
                                                            "id": "i7d6r6n",
                                                            "parent_id": "t1_i7d515a",
                                                            "score": -3,
                                                            "created_utc": 1651711284.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "i7cpyfx",
            "parent_id": "t3_uiiejn",
            "score": -3,
            "created_utc": 1651703778.0,
            "replies": [
                {
                    "body": "You are supposed to run a med-level alcohol/drug test on the spot, valuate it, and engage in any sexual activity accordingly.",
                    "author": "EuropeanDaddyDom",
                    "id": "i7cqa48",
                    "parent_id": "t1_i7cpyfx",
                    "score": 4,
                    "created_utc": 1651703919.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My golf clubs agree with the OP, however I do not.",
            "author": "JustAGoodGuy1080",
            "id": "i7d8573",
            "parent_id": "t3_uiiejn",
            "score": -3,
            "created_utc": 1651711908.0,
            "replies": []
        },
        {
            "body": "That’s all the best porn categories",
            "author": "shallow_haily",
            "id": "i7dkwe9",
            "parent_id": "t3_uiiejn",
            "score": -7,
            "created_utc": 1651717663.0,
            "replies": []
        },
        {
            "body": "I’m so sorry, you didn’t deserve that. Whatever you consider it is completely valid, the abuse wasn’t okay. I’m really happy to hear that you’re out of that relationship, and I’m glad your sugar relationships are helping you heal. Sending hugs <3",
            "author": "bubblerush",
            "id": "i7d8neb",
            "parent_id": "t1_i7d7uc8",
            "score": 19,
            "created_utc": 1651712127.0,
            "replies": []
        },
        {
            "body": "Yes!! 👏🏼👏🏼",
            "author": "bubblerush",
            "id": "i7d5mbo",
            "parent_id": "t1_i7d55gu",
            "score": 5,
            "created_utc": 1651710781.0,
            "replies": []
        },
        {
            "body": "Some of this comes from the fact that OP is debatably an unreasonable and vitriolic poster but responses do demonstrate a weird defensiveness on the topic for sure.",
            "author": "JDMultralight",
            "id": "i7d5773",
            "parent_id": "t1_i7cww3p",
            "score": 4,
            "created_utc": 1651710593.0,
            "replies": [
                {
                    "body": "“Responses do demonstrate a weird defensiveness on this topic for sure”.\n\nGlad someone else can recognise this.",
                    "author": "xWaterlooSunset",
                    "id": "i7d5cnl",
                    "parent_id": "t1_i7d5773",
                    "score": 4,
                    "created_utc": 1651710661.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean its targeted at men.  I have never needed to read these rules to understand how to sex.\n\nWhat is there actually to engage with here?  The rapist are not going to come in here and argue.\n\nIs this like some kind of educational course?  Do you think men are going to look at this and be like, oh shit, I learned something new today?\n\nThis to me is a bunch of HR legal stuff that is there to defeat defenses that an actual rapist is going to try to do to get away with rape.\n\nCan you imagine actual sex going this way?  \"Periodically checking in with your partner?\"\n\n\"Do you want me to keep going\"  pump pump pump.  \"More?\"  pump pump pump.  \"Are you sure this is ok?\" pump pump pump.  \"we don't have to do this\"..\n\nI mean, come on..",
            "author": "rougeforces",
            "id": "i7d0agt",
            "parent_id": "t1_i7cww3p",
            "score": 0,
            "created_utc": 1651708409.0,
            "replies": [
                {
                    "body": "Please, tell me how this post targets men? If you read my comments, you’ll see that this post is for both men and women. Now, if you’re feeling targeted, that’s a you problem…",
                    "author": "bubblerush",
                    "id": "i7d2dew",
                    "parent_id": "t1_i7d0agt",
                    "score": 12,
                    "created_utc": 1651709335.0,
                    "replies": [
                        {
                            "body": "Are you clueless about how sex works?  Just for reference, the woman is the lock the man is the key.  Inert the key into the lock.  Turn, open.  \n\nPoint is, no one ever talks about consent in terms of the man giving consent.  so when consent is brought up, its implied that its consent of a woman to allow a man to penetrate her body. \n\nYou are being so obtuse in your arguments.  who actually trolls a community where consent is paramount with a consent thread and then takes it personal when someone give there view on it. \n\nI don't feel targeted as a man, and a man with money, I got a bullseye on my back every day.  I am targeted.  What I feel is that you are trying to stir shit up cause you got nothin else better to do.",
                            "author": "rougeforces",
                            "id": "i7d32tf",
                            "parent_id": "t1_i7d2dew",
                            "score": -11,
                            "created_utc": 1651709657.0,
                            "replies": [
                                {
                                    "body": "Again, read my comments. I’ve made multiple comments about how consent from the male partner is just as important.",
                                    "author": "bubblerush",
                                    "id": "i7d3dtd",
                                    "parent_id": "t1_i7d32tf",
                                    "score": 7,
                                    "created_utc": 1651709792.0,
                                    "replies": [
                                        {
                                            "body": "right, imagine both partners continuously evaluating consent, that is even worse than just targeting men.  I cannot imagine any woman including yourself laying on your back in the throws of passion asking yourself if he is still ok with what is happening every so often. \n\nIt's pretty damn obvious when a woman removes her consent.  Just like it's pretty damn obvious when she gives it.  I mock the rules because I am a man that understands how to treat a woman, not a boy that has never experienced sex before, nor a psychopath that is trying to rape someone.\n\nThat is all.",
                                            "author": "rougeforces",
                                            "id": "i7d5ivb",
                                            "parent_id": "t1_i7d3dtd",
                                            "score": -5,
                                            "created_utc": 1651710737.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "So when she says ‘yes, yes, yes’,  maybe it could work?\n\n/s",
                    "author": "timrid",
                    "id": "i7d2ex3",
                    "parent_id": "t1_i7d0agt",
                    "score": 4,
                    "created_utc": 1651709354.0,
                    "replies": []
                },
                {
                    "body": "I mean, that’s a fun form of tease and denial play …. “I’m not putting that cock back in unless you beg me…”",
                    "author": "57hz",
                    "id": "i7dokc9",
                    "parent_id": "t1_i7d0agt",
                    "score": 2,
                    "created_utc": 1651719396.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">touchy subject \n\n<Giggle!>",
            "author": "Chill_SD1974",
            "id": "i7dowo6",
            "parent_id": "t1_i7cww3p",
            "score": 2,
            "created_utc": 1651719565.0,
            "replies": []
        },
        {
            "body": "💯",
            "author": "usererror403",
            "id": "i7dloue",
            "parent_id": "t1_i7cv0b0",
            "score": 3,
            "created_utc": 1651718034.0,
            "replies": []
        },
        {
            "body": "This post isn’t just for SBs, it’s also for SDs. Consent isn’t just for women, consent goes both ways.",
            "author": "bubblerush",
            "id": "i7cv841",
            "parent_id": "t1_i7cv0b0",
            "score": 3,
            "created_utc": 1651706109.0,
            "replies": [
                {
                    "body": "Consider the point missed.",
                    "author": "timrid",
                    "id": "i7d29m2",
                    "parent_id": "t1_i7cv841",
                    "score": 5,
                    "created_utc": 1651709286.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think there's a distinction here. If there's precedent (e.g.  a kiss) and it's within the realm of what's expected you don't have to ask all the time. But if you're unexpectedly changing what's happening you should make sure it's ok. \n\nI think anal is a great example. If you're switching from vaginal to that, there should be at least a moment of \"is it ok if I...\" Since she may not be prepared/in the mood for that. V.S. changing positions while still in vaginal, which could reasonably be expected to be part of sex. \n\nIt's kind of just common sense. If there's any question or potential doubt, better to ask. But no one is going to arrest you for kissing your girlfriend unexpectedly 🤦",
            "author": "sinperviren",
            "id": "i7ctc87",
            "parent_id": "t1_i7cqmvl",
            "score": 41,
            "created_utc": 1651705259.0,
            "replies": [
                {
                    "body": "Anal is a hard limit I discuss before any clothes come off with a new partner. But if it were on the table then yes certainly ask.  But that's very different from \"can I kiss you?\" \"Can I touch your breasts?\" \"Can I touch your p***y?\" \"Can I go down on you?\" \"Can I be inside you now?\"  Asking if EVERY little thing is ok is ridiculous. If I'm there and participating,  unless I say no or do this instead,  he has consent. \n\nBefore anyone says I don't understand if I've never been assaulted...I have, on more than one occasion.  And I made it clear it wasn't ok and they did it anyway. The people who are going to take advantage of someone being drunk/ passed out or hold them down and do it anyway are still going to do those things.  Even if 90% of the men in the world asked for consent before every single thing. I can understand maybe asking once the first time you are together if she's sure this is something she wants.  But before every act is ridiculous. If we're talking BDSM or something away from the \"norm\" than yes conversations need to be had. But that's a different conversation than what the OP said.",
                    "author": "tamenwild",
                    "id": "i7cw9xs",
                    "parent_id": "t1_i7ctc87",
                    "score": 14,
                    "created_utc": 1651706600.0,
                    "replies": [
                        {
                            "body": "To the three ladies above me thank you so much for being reasonable about this I mean where does the OP go with her writing? I mean I’m trying to envision myself asking a woman hey Miss do you mind if I unbutton the top button of your blouse how about the second button how about the third where the hell does that shit end",
                            "author": "puckhead4",
                            "id": "i7cy9p1",
                            "parent_id": "t1_i7cw9xs",
                            "score": -1,
                            "created_utc": 1651707502.0,
                            "replies": [
                                {
                                    "body": "IDK I don't actually disagree with OP, I think it's just about not interpreting it too literally. \n\nI think the main point of stuff like this is \"don't assume consent\". Can consent be implied nonverbally? Totally! No one expects you to ask every time you kiss, especially when both parties are showing enthusiasm.\n\nNow if your partner has an unclear reaction to something you're doing e.g. freezing up a little, it's probably good to check in, which doesn't always mean \"is this ok\" but could be something along the lines of \"do you like that?\" It doesnt have to be \"may I penetrate you vaginally\" it can be \"tell me how badly you want me to fuck you\". Long story short if there's any doubt, you can still have fun while checking in. \n\nI think the misunderstanding of points like OP's is that all couples communicate differently and there's never going to be one perfect formula to discern consent. We tried \"no means no\" and you end up with cases of people getting raped while crying, then the rapist says \"well they never actually said no\". Interpreting that literally clearly doesn't work. So we get enthusiastic consent. And yes, ask if you're unsure is the safest bet, but no, there isn't some secret agenda to stop people from having sex without asking every few minutes. And this one shouldn't be taken 100% literally either.",
                                    "author": "sinperviren",
                                    "id": "i7d0mel",
                                    "parent_id": "t1_i7cy9p1",
                                    "score": 29,
                                    "created_utc": 1651708558.0,
                                    "replies": [
                                        {
                                            "body": "That’s where it gets complicated. What does it mean to be under the influence of drugs or alcohol?\n\nThey took an edible and a benzo before the date to “set the vibe”. Now they can’t give consent, and if they change their mind after the fact you never had consent to begin with. \n\nI mean reasonable people understand the difference between someone who is buzzing and having a good time and someone who is wasted. However people are not reasonable…\n\nI guess I get hung up on scenarios where people give consent, change their mind during the act, don’t clearly voice that they changed their mind (for whatever reason) and then retroactive withdrawal consent and the call it sexual assault.\n\nThat scenario is fundamentally different the a physically violent sexual assault where consent was never given and active physical resistance is used. \n\nWhat do I know… I am just a man who has never been manipulated into doing anything I didn’t want to do by the fairer sex. ;)",
                                            "author": null,
                                            "id": "i7df8rl",
                                            "parent_id": "t1_i7d0mel",
                                            "score": 0,
                                            "created_utc": 1651715064.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Idk someone doesn't like my opinion and is down voting 🤣🤣🤣",
                                    "author": "tamenwild",
                                    "id": "i7cymcf",
                                    "parent_id": "t1_i7cy9p1",
                                    "score": 0,
                                    "created_utc": 1651707657.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Thank you for being the voice of reason here!",
                    "author": "57hz",
                    "id": "i7dhqhx",
                    "parent_id": "t1_i7ctc87",
                    "score": -7,
                    "created_utc": 1651716190.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You can give implied consent. It doesn’t always have to be verbal.",
            "author": "xWaterlooSunset",
            "id": "i7cx6ke",
            "parent_id": "t1_i7cqmvl",
            "score": 23,
            "created_utc": 1651707010.0,
            "replies": [
                {
                    "body": "\"Consent looks like…\n\n•Asking permission before you change the type or degree of sexual activity with phrases like “Is this OK?”\n\n•Confirming that there is reciprocal interest before initiating any physical touch.\n\n•Letting your partner know that you can stop at any time.\n\n•Periodically checking in with your partner, such as asking “Is this still okay?” \"\n\nI agree there is/ can be implied consent but according to the OP you need to verbally ask \"is this ok?\" And \"is this still ok?\"",
                    "author": "tamenwild",
                    "id": "i7d16lp",
                    "parent_id": "t1_i7cx6ke",
                    "score": 6,
                    "created_utc": 1651708804.0,
                    "replies": [
                        {
                            "body": "“Confirming that there is reciprocal interest” doesn’t need to be verbal. You can pick up on your partners non-verbal cues, and it’s important to confirm (verbally or non-verbally) that they’re also enjoying themselves and comfortable with what’s happening.",
                            "author": "bubblerush",
                            "id": "i7d25zo",
                            "parent_id": "t1_i7d16lp",
                            "score": 18,
                            "created_utc": 1651709240.0,
                            "replies": []
                        },
                        {
                            "body": "To me the foundation of consent is empowering her to be expressive and responding.  To me it is fun to let her take the lead once started.\n\n I prefer to let her decide when it is time to change from cowgirl oral. \n\nTotally agree that anal ( not something for which I have any enthusiasm) should  require affirmation prior as the intent might not be apparent.",
                            "author": "pinotandsugar",
                            "id": "i7dofac",
                            "parent_id": "t1_i7d16lp",
                            "score": 4,
                            "created_utc": 1651719328.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "OP is not suggesting this is should be done. Does she say someone should ask if it's ok at every kiss?  \nUsually people can make it sexy too. Dirty talk, ask \"do you like that?\" and etc  \nI don't know why people assume it should be aseptic and boring.",
            "author": "Ok_Bid_1487",
            "id": "i7dkywo",
            "parent_id": "t1_i7cqmvl",
            "score": 15,
            "created_utc": 1651717696.0,
            "replies": [
                {
                    "body": "She clarified what she meant further down in the comments.  But that is not how I interpret the wording of the post.",
                    "author": "tamenwild",
                    "id": "i7dn99o",
                    "parent_id": "t1_i7dkywo",
                    "score": 1,
                    "created_utc": 1651718781.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> If I don't say no he has consent.\n\nI think if more people articulated this at the outset, it would go a long way toward eliminating a lot of the angst around the subject (especially in itinerant hookups and the like)",
            "author": "Y_4Z44",
            "id": "i7crb0o",
            "parent_id": "t1_i7cqmvl",
            "score": 5,
            "created_utc": 1651704361.0,
            "replies": []
        },
        {
            "body": "If you have a partner who is engaging enthusiastically that’s one thing, but if you have a partner who is disengaged, check in and ask if it’s okay.",
            "author": "bubblerush",
            "id": "i7cs7at",
            "parent_id": "t1_i7cqmvl",
            "score": 4,
            "created_utc": 1651704754.0,
            "replies": [
                {
                    "body": "But that's not what your post is saying at all.",
                    "author": "mraspencer",
                    "id": "i7ct4sj",
                    "parent_id": "t1_i7cs7at",
                    "score": 5,
                    "created_utc": 1651705170.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SMH. That train of thought is exactly what the issue is. So let’s say you pass out, and while ur asleep someone takes it upon himself to help himself (and a friend) to your vagina. “Well you didn’t say no!” Are saying that you won’t feel violated? Waking up wet?",
            "author": "Terry_romulus",
            "id": "i7ct7fi",
            "parent_id": "t1_i7cqmvl",
            "score": 2,
            "created_utc": 1651705203.0,
            "replies": [
                {
                    "body": "Seriously?  That's what you take from my comment? There is no question that if someone is passed out it's rape. My comment was in regard to asking permission for every little thing.",
                    "author": "tamenwild",
                    "id": "i7cx6w4",
                    "parent_id": "t1_i7ct7fi",
                    "score": 12,
                    "created_utc": 1651707014.0,
                    "replies": [
                        {
                            "body": "“Asking permission for every little thing.” Consent doesn’t always have to be verbal, if it’s something that’s in the realm of what you normally do with your partner (kissing, touching, vaginal intercourse) and they’re engaged and reciprocating that’s one thing, but when changing the “type or degree” of sexual activity there needs to be consent. If you were to initiate anal sex, bdsm, kink/fetish, or anything more than what you know is within your partner’s comfort zone, you need to ask if it’s okay.",
                            "author": "bubblerush",
                            "id": "i7cz6f6",
                            "parent_id": "t1_i7cx6w4",
                            "score": 4,
                            "created_utc": 1651707905.0,
                            "replies": [
                                {
                                    "body": "But that is not what you imply on your OP.",
                                    "author": "tamenwild",
                                    "id": "i7czie7",
                                    "parent_id": "t1_i7cz6f6",
                                    "score": 5,
                                    "created_utc": 1651708056.0,
                                    "replies": [
                                        {
                                            "body": "I don’t understand, I’m assuming you’re talking about one of these points, which one “implies” that your partner needs to “ask permission for every little thing”? \n\n•Asking permission before you change the type or degree of sexual activity with phrases like \"Is this OK?\"\n\nSo, asking if it’s okay before switching to anal sex. Asking if they’re comfortable before oral sex, some partners are not. Asking if it’s okay to up the degree, example, if you were to up the degree to BSDM. \n\n•Confirming that there is reciprocal interest\nbefore initiating any physical touch.\n\nSo, making sure that your partner is also into it, picking up on their non-verbal cues. Not just assuming that you have consent to pull their pants off. Making sure that they’re “reciprocating.”",
                                            "author": "bubblerush",
                                            "id": "i7d16kl",
                                            "parent_id": "t1_i7czie7",
                                            "score": 5,
                                            "created_utc": 1651708804.0,
                                            "replies": [
                                                {
                                                    "body": "You probably should have explained what you meant in the original because that is not the impression I get when reading it. For either bullet point.",
                                                    "author": "tamenwild",
                                                    "id": "i7d25ev",
                                                    "parent_id": "t1_i7d16kl",
                                                    "score": 5,
                                                    "created_utc": 1651709233.0,
                                                    "replies": [
                                                        {
                                                            "body": "Me neither.",
                                                            "author": "ShaArt5",
                                                            "id": "i7d6vlq",
                                                            "parent_id": "t1_i7d25ev",
                                                            "score": 2,
                                                            "created_utc": 1651711339.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Careful, recognizing a woman's responsibility in consent issues is absolutely not what the OP is aiming for with this post.",
            "author": "storm170",
            "id": "i7d3w0j",
            "parent_id": "t1_i7cqmvl",
            "score": -1,
            "created_utc": 1651710014.0,
            "replies": []
        },
        {
            "body": "thank you for speaking up as a women! This would absolutely kill the mood if we as men had to ask you before every single move we make. This OP has some kind of agenda, his/her posts are always controversial.",
            "author": "NickPfromYuma",
            "id": "i7csfgv",
            "parent_id": "t1_i7cqmvl",
            "score": -7,
            "created_utc": 1651704857.0,
            "replies": [
                {
                    "body": "How is consent controversial?",
                    "author": "bubblerush",
                    "id": "i7csmyt",
                    "parent_id": "t1_i7csfgv",
                    "score": 3,
                    "created_utc": 1651704949.0,
                    "replies": [
                        {
                            "body": "Consent is not controversial.  Your definition of consent is.",
                            "author": null,
                            "id": "i7d26i5",
                            "parent_id": "t1_i7csmyt",
                            "score": 13,
                            "created_utc": 1651709247.0,
                            "replies": []
                        },
                        {
                            "body": "Could I respectfully ask why you post here despite the earlier post that made it clear you’re against sugaring?",
                            "author": "JDMultralight",
                            "id": "i7d47wl",
                            "parent_id": "t1_i7csmyt",
                            "score": 0,
                            "created_utc": 1651710157.0,
                            "replies": [
                                {
                                    "body": "Never said I was against sugaring, I just think it needs to be safer, for men and women.",
                                    "author": "bubblerush",
                                    "id": "i7d4d4u",
                                    "parent_id": "t1_i7d47wl",
                                    "score": 6,
                                    "created_utc": 1651710221.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "i7csel6",
            "parent_id": "t1_i7cqmvl",
            "score": -7,
            "created_utc": 1651704846.0,
            "replies": [
                {
                    "body": "Oh I know the crazy anxiety of going in for that first kiss… don’t crash into her teeth… watch out for the nose… oh no braces 😬",
                    "author": null,
                    "id": "i7dfixy",
                    "parent_id": "t1_i7csel6",
                    "score": -2,
                    "created_utc": 1651715190.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If I said “is this ok?“ my SB would think I’m a simp and walk out.",
            "author": "UnearthlyDinosaur",
            "id": "i7ct71x",
            "parent_id": "t1_i7cqmvl",
            "score": -6,
            "created_utc": 1651705198.0,
            "replies": [
                {
                    "body": "If a guy used the word “simp”, I would be out.",
                    "author": "xWaterlooSunset",
                    "id": "i7cx9wj",
                    "parent_id": "t1_i7ct71x",
                    "score": 20,
                    "created_utc": 1651707052.0,
                    "replies": [
                        {
                            "body": "Simp. \n\nYou out?",
                            "author": "timrid",
                            "id": "i7d1e4m",
                            "parent_id": "t1_i7cx9wj",
                            "score": -5,
                            "created_utc": 1651708895.0,
                            "replies": [
                                {
                                    "body": "Was never in, hun",
                                    "author": "xWaterlooSunset",
                                    "id": "i7d45c0",
                                    "parent_id": "t1_i7d1e4m",
                                    "score": 13,
                                    "created_utc": 1651710126.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "i7dc0gi",
            "parent_id": "t1_i7d140x",
            "score": 4,
            "created_utc": 1651713609.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "i7dd5ks",
                    "parent_id": "t1_i7dc0gi",
                    "score": 2,
                    "created_utc": 1651714117.0,
                    "replies": [
                        {
                            "body": "Not right is not the same as “sexual misconduct”.",
                            "author": "57hz",
                            "id": "i7doa5j",
                            "parent_id": "t1_i7dd5ks",
                            "score": 2,
                            "created_utc": 1651719259.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeah, this is just North Carolina 18th century crap. Most states do not punish adultery in either criminal or civil arenas.",
                    "author": "57hz",
                    "id": "i7do80w",
                    "parent_id": "t1_i7dc0gi",
                    "score": 1,
                    "created_utc": 1651719231.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And women who lie about being on birth control.",
            "author": "BinghamtonSD",
            "id": "i7dd3u8",
            "parent_id": "t1_i7d140x",
            "score": 1,
            "created_utc": 1651714095.0,
            "replies": [
                {
                    "body": "Yes exactly, lying about contraception is never okay. Women lying about being on birth control, men lying about having a vasectomy, or either partner removing a condom without consent.",
                    "author": "bubblerush",
                    "id": "i7de8d4",
                    "parent_id": "t1_i7dd3u8",
                    "score": 6,
                    "created_utc": 1651714609.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As another victim of rape and other levels of abuse, as an estimated 1 in 3 women are, I’m not saying that this is a complete black and white list of what consent looks like. Obviously it varies from couple to couple, but since nearly 1 in 10 women are raped by an intimate partner in their lifetime, I thought it was important to share. Consent shouldn’t be assumed just because you’re in a relationship, and it’s important to know what consent DOESN’T look like, because as we both know not everyone does.",
            "author": "bubblerush",
            "id": "i7ddv3z",
            "parent_id": "t1_i7dcyia",
            "score": 8,
            "created_utc": 1651714441.0,
            "replies": [
                {
                    "body": "It is important, absolutely. But I think you may want to watch your wording in the future so as not to seem to be generalizing and keep in mind you probably lost a lot of SD’s here benefit of the doubt based on your previous posts about sugar dating. You make a lot of valid points but tend to come off condescending which can just lead to people not listening at all to your core, important message.",
                    "author": "usererror403",
                    "id": "i7dfuuh",
                    "parent_id": "t1_i7ddv3z",
                    "score": 2,
                    "created_utc": 1651715338.0,
                    "replies": [
                        {
                            "body": "The men here aren’t disagreeing because I’m the one that posted it and I lost their “benefit of the doubt.” The men that are offended by this post are offended for other reasons unfortunately. If 1 in 3 women are victims of sexual violence, where are the perpetrators? I’d assume at least a handful of the men getting upset here.",
                            "author": "bubblerush",
                            "id": "i7dgrv4",
                            "parent_id": "t1_i7dfuuh",
                            "score": 6,
                            "created_utc": 1651715757.0,
                            "replies": [
                                {
                                    "body": "I’m just saying as a woman and a victim I didn’t agree with how you worded either post, so I can just imagine how they read it. And generally yes there’s usually smoke where there’s fire, but it’s very disingenuous and damaging to assume whenever men are upset at your views/wording it’s because they’re a perpetrator.",
                                    "author": "usererror403",
                                    "id": "i7di09y",
                                    "parent_id": "t1_i7dgrv4",
                                    "score": 10,
                                    "created_utc": 1651716310.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Talking about ground rules for more intense sex, before diving into it, is super important! Everyone has different comfort levels. Personally, when I’m navigating sex that’s a little more extreme or different from what I normally do with my partner, we use red/yellow light safe words. Yellow, meaning slow down or be more gentle. Red, meaning hard stop.",
            "author": "bubblerush",
            "id": "i7d99ki",
            "parent_id": "t1_i7d85qd",
            "score": 12,
            "created_utc": 1651712392.0,
            "replies": []
        },
        {
            "body": "I would advise the following videos...\n\nhttps://youtu.be/bkflDahXsZ4\n\nhttps://youtu.be/02gLHzvOSAI\n\nhttps://youtu.be/N0kduSrtohM\n\nI am a BDSM Switch and have Dominants snd submissives of my own. VdSM is not all about rough sex. Kink is customizable child's play with adult sexual privledge and cool toys. \n\nIf you're interested in more, check out the Anerican Sex podcast.",
            "author": "LadyMorgan2018",
            "id": "i7df028",
            "parent_id": "t1_i7d85qd",
            "score": 4,
            "created_utc": 1651714954.0,
            "replies": []
        },
        {
            "body": "I thought it needed to be shared, since women are still sharing their stories of being assaulted on this form. Also, I thought this would be helpful for men. If men are unknowingly intimate with someone who is underage, or claims to be underage afterwards, then they were not able to give informed consent. I’ve heard of SBs trying to blackmail men by pulling that card.",
            "author": "bubblerush",
            "id": "i7cu1un",
            "parent_id": "t1_i7ct1lf",
            "score": 13,
            "created_utc": 1651705577.0,
            "replies": []
        },
        {
            "body": "More useful than a fake erotica fanfic that we get delightfully treated to from time to time.",
            "author": "xWaterlooSunset",
            "id": "i7cyn2f",
            "parent_id": "t1_i7ct1lf",
            "score": 10,
            "created_utc": 1651707667.0,
            "replies": [
                {
                    "body": "This is indeed an accurate point.",
                    "author": "Y_4Z44",
                    "id": "i7d09k6",
                    "parent_id": "t1_i7cyn2f",
                    "score": 4,
                    "created_utc": 1651708397.0,
                    "replies": [
                        {
                            "body": "Each time, I’m like “ugh I DID NOT consent to this cringey story please, make it stop” 😅",
                            "author": "xWaterlooSunset",
                            "id": "i7d0il0",
                            "parent_id": "t1_i7d09k6",
                            "score": 11,
                            "created_utc": 1651708511.0,
                            "replies": [
                                {
                                    "body": "Lmfaooooo",
                                    "author": "Y_4Z44",
                                    "id": "i7d0qtx",
                                    "parent_id": "t1_i7d0il0",
                                    "score": 3,
                                    "created_utc": 1651708612.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wanna check your grammar and try again?",
            "author": "bubblerush",
            "id": "i7demjk",
            "parent_id": "t1_i7de5zr",
            "score": -4,
            "created_utc": 1651714786.0,
            "replies": []
        },
        {
            "body": "The idea that a woman (and let’s not be coy, this conversation is always about women drinking) isn’t able to consent just because she had a few drinks is extremely infantilizing. A woman that has chosen to drink and has chosen to give consent is VERY different from someone so drunk and trashed that cannot properly verbalize their stance on anything.   \n\n\nbut as soon as you try to say “use common sense” some asshole will fuck a girl while she is asleep and cry “but she didn’t say no!”",
            "author": "Yourstruly0",
            "id": "i7dbd7d",
            "parent_id": "t1_i7cs4o9",
            "score": 2,
            "created_utc": 1651713319.0,
            "replies": []
        },
        {
            "body": "Post history checks out",
            "author": "timrid",
            "id": "i7cq1xi",
            "parent_id": "t1_i7cpzc6",
            "score": 6,
            "created_utc": 1651703821.0,
            "replies": [
                {
                    "body": "Yeah, there are people (the vast majority of people in SLF) who're here to help, and would have made this a worthwhile post. And then there are those whose singular purpose in life seems to be, well, let's just say, less than pleasant to everyone around them.",
                    "author": "Y_4Z44",
                    "id": "i7cqcs0",
                    "parent_id": "t1_i7cq1xi",
                    "score": 3,
                    "created_utc": 1651703951.0,
                    "replies": [
                        {
                            "body": "There are a number of posts that followed that were collectively straying from the spirit of SLF  and have been removed........\n\ncivility is sensual      thanks",
                            "author": "pinotandsugar",
                            "id": "i7dp2pl",
                            "parent_id": "t1_i7cqcs0",
                            "score": -4,
                            "created_utc": 1651719646.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "i7ct0n2",
            "parent_id": "t1_i7cpzc6",
            "score": 3,
            "created_utc": 1651705119.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "i7cu30y",
                    "parent_id": "t1_i7ct0n2",
                    "score": 9,
                    "created_utc": 1651705593.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "i7cyx92",
                            "parent_id": "t1_i7cu30y",
                            "score": 2,
                            "created_utc": 1651707793.0,
                            "replies": []
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "i7d9sq6",
                            "parent_id": "t1_i7cu30y",
                            "score": -3,
                            "created_utc": 1651712620.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "i7daqs1",
                                    "parent_id": "t1_i7d9sq6",
                                    "score": 3,
                                    "created_utc": 1651713040.0,
                                    "replies": [
                                        {
                                            "body": "A little 🤣",
                                            "author": "Pretty_Ant_3094",
                                            "id": "i7dbym7",
                                            "parent_id": "t1_i7daqs1",
                                            "score": 0,
                                            "created_utc": 1651713586.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "i7dnzzp",
                                    "parent_id": "t1_i7d9sq6",
                                    "score": 2,
                                    "created_utc": 1651719127.0,
                                    "replies": [
                                        {
                                            "body": "> jargon \"you *paid* for the\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                                            "author": "Paid-Not-Payed-Bot",
                                            "id": "i7do191",
                                            "parent_id": "t1_i7dnzzp",
                                            "score": 2,
                                            "created_utc": 1651719143.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "i7cv0vi",
                    "parent_id": "t1_i7ct0n2",
                    "score": 2,
                    "created_utc": 1651706018.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This one is way off this planet",
            "author": "shamloo77",
            "id": "i7cq60e",
            "parent_id": "t1_i7cpzc6",
            "score": 0,
            "created_utc": 1651703870.0,
            "replies": []
        },
        {
            "body": "The HR meeting is a pretty popular fantasy. Don't knock it till you've tried it. Lolol! 😎😂",
            "author": "LadyMorgan2018",
            "id": "i7dg2kr",
            "parent_id": "t1_i7cz38b",
            "score": 3,
            "created_utc": 1651715433.0,
            "replies": []
        },
        {
            "body": "Catbert in charge of all of our SRs.",
            "author": "BinghamtonSD",
            "id": "i7ddajb",
            "parent_id": "t1_i7cz38b",
            "score": 1,
            "created_utc": 1651714180.0,
            "replies": []
        },
        {
            "body": "Not if he has whiskey dick.",
            "author": "timrid",
            "id": "i7d2p9p",
            "parent_id": "t1_i7cvf2v",
            "score": 6,
            "created_utc": 1651709488.0,
            "replies": []
        },
        {
            "body": "I’d say it depends, it would for either gender. If your partner has two drinks and gives you enthusiastic consent that’s one thing, but if your partner is very very intoxicated they’re not able to consent. If my SD was drunk and out of it, I wouldn’t feel comfortable engaging in anything sexual.",
            "author": "bubblerush",
            "id": "i7cvn1x",
            "parent_id": "t1_i7cvf2v",
            "score": 7,
            "created_utc": 1651706298.0,
            "replies": []
        },
        {
            "body": "Since the guy isn’t penetrated, In many jurisdictions he can’t claim to be a rape victim.    Since he’s not penetrated, his consent is irrelevant in many jurisdictions.    \n\nThere have been many notable media reports of drunken male athletes having sex with a drunken girl, all consenting.   She was penetrated and her consent wasn’t valid, so she’s a victim. They were not penetrated so they can’t claim to be a victim even though their consent is also invalid.\n\nMany jurisdictions say to be raped is to be penetrated without valid consent.  To rape is to penetrate without valid consent.  Therefore in drunken heterosexual sex, the male is by definition a rapist and the female a rape victim.\n\nAgain, you can find cases in the news where this was the case.\n\n(I’m not saying this is fair, I’m saying that’s often the law).",
            "author": "63daddy",
            "id": "i7cwhof",
            "parent_id": "t1_i7cvf2v",
            "score": 0,
            "created_utc": 1651706700.0,
            "replies": [
                {
                    "body": "What if the guy is sodomized? That counts as penetration?",
                    "author": null,
                    "id": "i7cwnaq",
                    "parent_id": "t1_i7cwhof",
                    "score": 6,
                    "created_utc": 1651706771.0,
                    "replies": [
                        {
                            "body": "Yes, if he’s sodomized.   I was speaking to hetero PIV sex.",
                            "author": "63daddy",
                            "id": "i7cz5q2",
                            "parent_id": "t1_i7cwnaq",
                            "score": 3,
                            "created_utc": 1651707897.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Well, the law is garbage when it comes to rape/assault. Men can be victims of rape too, not just women, and my heart goes out to male victims. As a woman, I couldn’t imagine how hard it is for male victims of rape and sexual assault. Society is still very invalidating for male survivors. This post is a great example, I made a post about consent in general, and everyone felt it was one sided, it’s not. Having consent from your male partner is just as important.",
                    "author": "bubblerush",
                    "id": "i7d0b44",
                    "parent_id": "t1_i7cwhof",
                    "score": 2,
                    "created_utc": 1651708417.0,
                    "replies": [
                        {
                            "body": "I agree it’s “garbage”, but garbage or not it’s what one is held accountable to.",
                            "author": "63daddy",
                            "id": "i7d4hkx",
                            "parent_id": "t1_i7d0b44",
                            "score": 1,
                            "created_utc": 1651710275.0,
                            "replies": [
                                {
                                    "body": "Well unfortunately, offenders are rarely held accountable. Out of every 1000 sexual assaults, only approximately 25 perpetrators will be incarcerated, and that statistic is from the Bureau of Justice Statistics.",
                                    "author": "bubblerush",
                                    "id": "i7d5kmp",
                                    "parent_id": "t1_i7d4hkx",
                                    "score": 8,
                                    "created_utc": 1651710760.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It sounds Ike you are speaking of inclusive negotiations. Those are much easier to negotiate than exclusive. The hard limits and soft limits are a must, but desires and needs are much more positive. \n\nSuffice to say that periodic check is are most helpful and ethical in the beginning. Staying within negotiated boundaries builds trust. Then the blanket consents and reading your partner can come in time.",
            "author": "LadyMorgan2018",
            "id": "i7dfs6i",
            "parent_id": "t1_i7d178x",
            "score": 3,
            "created_utc": 1651715304.0,
            "replies": [
                {
                    "body": "I’m 💯 inclusive for sure. I may even ask whether verbal or physical check-ins are preferred. Many people get non-verbal when play is intense eg subspace and that can easily/does easily happen with orgasms alone. Tapping out may be necessary.",
                    "author": "daddoms",
                    "id": "i7dnv7t",
                    "parent_id": "t1_i7dfs6i",
                    "score": 2,
                    "created_utc": 1651719068.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There is a very flexible list of what consent can look like. The list of what consent DOESNT look like is pretty concrete  unless you have an existing agreement.",
            "author": "Yourstruly0",
            "id": "i7dc7ba",
            "parent_id": "t1_i7d178x",
            "score": 2,
            "created_utc": 1651713693.0,
            "replies": [
                {
                    "body": "“Unless you have an existing agreement” can you elaborate? Like a CNC kink?",
                    "author": "bubblerush",
                    "id": "i7dcnma",
                    "parent_id": "t1_i7dc7ba",
                    "score": 2,
                    "created_utc": 1651713896.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "LMFAO! Great call on asking for the document to be notarized!",
            "author": "puckhead4",
            "id": "i7cyzt4",
            "parent_id": "t1_i7ct1l7",
            "score": 5,
            "created_utc": 1651707824.0,
            "replies": [
                {
                    "body": "Mobile notaries just got a raise.",
                    "author": "57hz",
                    "id": "i7doc88",
                    "parent_id": "t1_i7cyzt4",
                    "score": -2,
                    "created_utc": 1651719287.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You forgot about asking “is this still ok” periodically.  Like, who knows, maybe it was ok to kiss for the first couple of minutes but not anymore and somehow your partner has become mute.",
            "author": null,
            "id": "i7d2n45",
            "parent_id": "t1_i7ct1l7",
            "score": -3,
            "created_utc": 1651709460.0,
            "replies": [
                {
                    "body": "Cat got their tongue?",
                    "author": "57hz",
                    "id": "i7dod9f",
                    "parent_id": "t1_i7d2n45",
                    "score": 0,
                    "created_utc": 1651719300.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I forgot where, but a few years ago, a college theater group put on a skit like this during freshman orientation about that college's various rules.",
            "author": "BinghamtonSD",
            "id": "i7dczjo",
            "parent_id": "t1_i7ct1l7",
            "score": -1,
            "created_utc": 1651714043.0,
            "replies": []
        },
        {
            "body": "i've seen a lot of polls lately, must of missed that one.",
            "author": "rougeforces",
            "id": "i7d7a87",
            "parent_id": "t1_i7czku2",
            "score": 1,
            "created_utc": 1651711522.0,
            "replies": []
        },
        {
            "body": "🙄",
            "author": "NickPfromYuma",
            "id": "i7d45hl",
            "parent_id": "t1_i7czku2",
            "score": -2,
            "created_utc": 1651710128.0,
            "replies": []
        },
        {
            "body": "Well, regardless of what the law in any given jurisdiction says, I’d think most everyone would like to have legitimate, enthusiastic consent for any sexual encounter.",
            "author": "Y_4Z44",
            "id": "i7cuh7h",
            "parent_id": "t1_i7cthfl",
            "score": 8,
            "created_utc": 1651705772.0,
            "replies": [
                {
                    "body": "What constitutes legitimate can vary however.    Someone can enthusiastically say yes, and it can later be ruled to be invalid consent.",
                    "author": "63daddy",
                    "id": "i7cvolx",
                    "parent_id": "t1_i7cuh7h",
                    "score": -1,
                    "created_utc": 1651706318.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Comments like these are so harmful. You can ask for consent in different ways “does that feel good baby?” It doesn’t always need to be “is this okay?” but saying that consent is for “pussies” isn’t okay. If you want to discuss with your partner that saying certain things is a turn off for you, that’s fine, but you don’t need to share comments like this.",
            "author": "bubblerush",
            "id": "i7d37b8",
            "parent_id": "t1_i7d2o0q",
            "score": 8,
            "created_utc": 1651709713.0,
            "replies": [
                {
                    "body": "No, promoting the idea that if a chick is too immature to say no then that is consent violation is harmful. How about, instead we promote that someone who is too fucking immature to open her mouth when fucking should stop fucking and go to therapy? Would save a whole lot more consent violations than your approach.",
                    "author": "Observing_n_Laughing",
                    "id": "i7d3r9m",
                    "parent_id": "t1_i7d37b8",
                    "score": -13,
                    "created_utc": 1651709958.0,
                    "replies": [
                        {
                            "body": "“If a chick is too fucking immature to open her mouth when fucking should stop fucking and go to therapy.”\n\n\nThat’s quite an uncalled for and needlessly aggressive reply. Do *you* need therapy?",
                            "author": "xWaterlooSunset",
                            "id": "i7d4g52",
                            "parent_id": "t1_i7d3r9m",
                            "score": 14,
                            "created_utc": 1651710257.0,
                            "replies": [
                                {
                                    "body": "I am quite an aggressive person.",
                                    "author": "Observing_n_Laughing",
                                    "id": "i7d4mki",
                                    "parent_id": "t1_i7d4g52",
                                    "score": -12,
                                    "created_utc": 1651710336.0,
                                    "replies": [
                                        {
                                            "body": "Sorry to hear that. Maybe you can get help one day.",
                                            "author": "xWaterlooSunset",
                                            "id": "i7d515a",
                                            "parent_id": "t1_i7d4mki",
                                            "score": 13,
                                            "created_utc": 1651710517.0,
                                            "replies": [
                                                {
                                                    "body": "No need. Life is awesome.",
                                                    "author": "Observing_n_Laughing",
                                                    "id": "i7d6r6n",
                                                    "parent_id": "t1_i7d515a",
                                                    "score": -3,
                                                    "created_utc": 1651711284.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are supposed to run a med-level alcohol/drug test on the spot, valuate it, and engage in any sexual activity accordingly.",
            "author": "EuropeanDaddyDom",
            "id": "i7cqa48",
            "parent_id": "t1_i7cpyfx",
            "score": 4,
            "created_utc": 1651703919.0,
            "replies": []
        },
        {
            "body": "“Responses do demonstrate a weird defensiveness on this topic for sure”.\n\nGlad someone else can recognise this.",
            "author": "xWaterlooSunset",
            "id": "i7d5cnl",
            "parent_id": "t1_i7d5773",
            "score": 4,
            "created_utc": 1651710661.0,
            "replies": []
        },
        {
            "body": "Please, tell me how this post targets men? If you read my comments, you’ll see that this post is for both men and women. Now, if you’re feeling targeted, that’s a you problem…",
            "author": "bubblerush",
            "id": "i7d2dew",
            "parent_id": "t1_i7d0agt",
            "score": 12,
            "created_utc": 1651709335.0,
            "replies": [
                {
                    "body": "Are you clueless about how sex works?  Just for reference, the woman is the lock the man is the key.  Inert the key into the lock.  Turn, open.  \n\nPoint is, no one ever talks about consent in terms of the man giving consent.  so when consent is brought up, its implied that its consent of a woman to allow a man to penetrate her body. \n\nYou are being so obtuse in your arguments.  who actually trolls a community where consent is paramount with a consent thread and then takes it personal when someone give there view on it. \n\nI don't feel targeted as a man, and a man with money, I got a bullseye on my back every day.  I am targeted.  What I feel is that you are trying to stir shit up cause you got nothin else better to do.",
                    "author": "rougeforces",
                    "id": "i7d32tf",
                    "parent_id": "t1_i7d2dew",
                    "score": -11,
                    "created_utc": 1651709657.0,
                    "replies": [
                        {
                            "body": "Again, read my comments. I’ve made multiple comments about how consent from the male partner is just as important.",
                            "author": "bubblerush",
                            "id": "i7d3dtd",
                            "parent_id": "t1_i7d32tf",
                            "score": 7,
                            "created_utc": 1651709792.0,
                            "replies": [
                                {
                                    "body": "right, imagine both partners continuously evaluating consent, that is even worse than just targeting men.  I cannot imagine any woman including yourself laying on your back in the throws of passion asking yourself if he is still ok with what is happening every so often. \n\nIt's pretty damn obvious when a woman removes her consent.  Just like it's pretty damn obvious when she gives it.  I mock the rules because I am a man that understands how to treat a woman, not a boy that has never experienced sex before, nor a psychopath that is trying to rape someone.\n\nThat is all.",
                                    "author": "rougeforces",
                                    "id": "i7d5ivb",
                                    "parent_id": "t1_i7d3dtd",
                                    "score": -5,
                                    "created_utc": 1651710737.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So when she says ‘yes, yes, yes’,  maybe it could work?\n\n/s",
            "author": "timrid",
            "id": "i7d2ex3",
            "parent_id": "t1_i7d0agt",
            "score": 4,
            "created_utc": 1651709354.0,
            "replies": []
        },
        {
            "body": "I mean, that’s a fun form of tease and denial play …. “I’m not putting that cock back in unless you beg me…”",
            "author": "57hz",
            "id": "i7dokc9",
            "parent_id": "t1_i7d0agt",
            "score": 2,
            "created_utc": 1651719396.0,
            "replies": []
        },
        {
            "body": "Consider the point missed.",
            "author": "timrid",
            "id": "i7d29m2",
            "parent_id": "t1_i7cv841",
            "score": 5,
            "created_utc": 1651709286.0,
            "replies": []
        },
        {
            "body": "Anal is a hard limit I discuss before any clothes come off with a new partner. But if it were on the table then yes certainly ask.  But that's very different from \"can I kiss you?\" \"Can I touch your breasts?\" \"Can I touch your p***y?\" \"Can I go down on you?\" \"Can I be inside you now?\"  Asking if EVERY little thing is ok is ridiculous. If I'm there and participating,  unless I say no or do this instead,  he has consent. \n\nBefore anyone says I don't understand if I've never been assaulted...I have, on more than one occasion.  And I made it clear it wasn't ok and they did it anyway. The people who are going to take advantage of someone being drunk/ passed out or hold them down and do it anyway are still going to do those things.  Even if 90% of the men in the world asked for consent before every single thing. I can understand maybe asking once the first time you are together if she's sure this is something she wants.  But before every act is ridiculous. If we're talking BDSM or something away from the \"norm\" than yes conversations need to be had. But that's a different conversation than what the OP said.",
            "author": "tamenwild",
            "id": "i7cw9xs",
            "parent_id": "t1_i7ctc87",
            "score": 14,
            "created_utc": 1651706600.0,
            "replies": [
                {
                    "body": "To the three ladies above me thank you so much for being reasonable about this I mean where does the OP go with her writing? I mean I’m trying to envision myself asking a woman hey Miss do you mind if I unbutton the top button of your blouse how about the second button how about the third where the hell does that shit end",
                    "author": "puckhead4",
                    "id": "i7cy9p1",
                    "parent_id": "t1_i7cw9xs",
                    "score": -1,
                    "created_utc": 1651707502.0,
                    "replies": [
                        {
                            "body": "IDK I don't actually disagree with OP, I think it's just about not interpreting it too literally. \n\nI think the main point of stuff like this is \"don't assume consent\". Can consent be implied nonverbally? Totally! No one expects you to ask every time you kiss, especially when both parties are showing enthusiasm.\n\nNow if your partner has an unclear reaction to something you're doing e.g. freezing up a little, it's probably good to check in, which doesn't always mean \"is this ok\" but could be something along the lines of \"do you like that?\" It doesnt have to be \"may I penetrate you vaginally\" it can be \"tell me how badly you want me to fuck you\". Long story short if there's any doubt, you can still have fun while checking in. \n\nI think the misunderstanding of points like OP's is that all couples communicate differently and there's never going to be one perfect formula to discern consent. We tried \"no means no\" and you end up with cases of people getting raped while crying, then the rapist says \"well they never actually said no\". Interpreting that literally clearly doesn't work. So we get enthusiastic consent. And yes, ask if you're unsure is the safest bet, but no, there isn't some secret agenda to stop people from having sex without asking every few minutes. And this one shouldn't be taken 100% literally either.",
                            "author": "sinperviren",
                            "id": "i7d0mel",
                            "parent_id": "t1_i7cy9p1",
                            "score": 29,
                            "created_utc": 1651708558.0,
                            "replies": [
                                {
                                    "body": "That’s where it gets complicated. What does it mean to be under the influence of drugs or alcohol?\n\nThey took an edible and a benzo before the date to “set the vibe”. Now they can’t give consent, and if they change their mind after the fact you never had consent to begin with. \n\nI mean reasonable people understand the difference between someone who is buzzing and having a good time and someone who is wasted. However people are not reasonable…\n\nI guess I get hung up on scenarios where people give consent, change their mind during the act, don’t clearly voice that they changed their mind (for whatever reason) and then retroactive withdrawal consent and the call it sexual assault.\n\nThat scenario is fundamentally different the a physically violent sexual assault where consent was never given and active physical resistance is used. \n\nWhat do I know… I am just a man who has never been manipulated into doing anything I didn’t want to do by the fairer sex. ;)",
                                    "author": null,
                                    "id": "i7df8rl",
                                    "parent_id": "t1_i7d0mel",
                                    "score": 0,
                                    "created_utc": 1651715064.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Idk someone doesn't like my opinion and is down voting 🤣🤣🤣",
                            "author": "tamenwild",
                            "id": "i7cymcf",
                            "parent_id": "t1_i7cy9p1",
                            "score": 0,
                            "created_utc": 1651707657.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for being the voice of reason here!",
            "author": "57hz",
            "id": "i7dhqhx",
            "parent_id": "t1_i7ctc87",
            "score": -7,
            "created_utc": 1651716190.0,
            "replies": []
        },
        {
            "body": "\"Consent looks like…\n\n•Asking permission before you change the type or degree of sexual activity with phrases like “Is this OK?”\n\n•Confirming that there is reciprocal interest before initiating any physical touch.\n\n•Letting your partner know that you can stop at any time.\n\n•Periodically checking in with your partner, such as asking “Is this still okay?” \"\n\nI agree there is/ can be implied consent but according to the OP you need to verbally ask \"is this ok?\" And \"is this still ok?\"",
            "author": "tamenwild",
            "id": "i7d16lp",
            "parent_id": "t1_i7cx6ke",
            "score": 6,
            "created_utc": 1651708804.0,
            "replies": [
                {
                    "body": "“Confirming that there is reciprocal interest” doesn’t need to be verbal. You can pick up on your partners non-verbal cues, and it’s important to confirm (verbally or non-verbally) that they’re also enjoying themselves and comfortable with what’s happening.",
                    "author": "bubblerush",
                    "id": "i7d25zo",
                    "parent_id": "t1_i7d16lp",
                    "score": 18,
                    "created_utc": 1651709240.0,
                    "replies": []
                },
                {
                    "body": "To me the foundation of consent is empowering her to be expressive and responding.  To me it is fun to let her take the lead once started.\n\n I prefer to let her decide when it is time to change from cowgirl oral. \n\nTotally agree that anal ( not something for which I have any enthusiasm) should  require affirmation prior as the intent might not be apparent.",
                    "author": "pinotandsugar",
                    "id": "i7dofac",
                    "parent_id": "t1_i7d16lp",
                    "score": 4,
                    "created_utc": 1651719328.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She clarified what she meant further down in the comments.  But that is not how I interpret the wording of the post.",
            "author": "tamenwild",
            "id": "i7dn99o",
            "parent_id": "t1_i7dkywo",
            "score": 1,
            "created_utc": 1651718781.0,
            "replies": []
        },
        {
            "body": "But that's not what your post is saying at all.",
            "author": "mraspencer",
            "id": "i7ct4sj",
            "parent_id": "t1_i7cs7at",
            "score": 5,
            "created_utc": 1651705170.0,
            "replies": []
        },
        {
            "body": "Seriously?  That's what you take from my comment? There is no question that if someone is passed out it's rape. My comment was in regard to asking permission for every little thing.",
            "author": "tamenwild",
            "id": "i7cx6w4",
            "parent_id": "t1_i7ct7fi",
            "score": 12,
            "created_utc": 1651707014.0,
            "replies": [
                {
                    "body": "“Asking permission for every little thing.” Consent doesn’t always have to be verbal, if it’s something that’s in the realm of what you normally do with your partner (kissing, touching, vaginal intercourse) and they’re engaged and reciprocating that’s one thing, but when changing the “type or degree” of sexual activity there needs to be consent. If you were to initiate anal sex, bdsm, kink/fetish, or anything more than what you know is within your partner’s comfort zone, you need to ask if it’s okay.",
                    "author": "bubblerush",
                    "id": "i7cz6f6",
                    "parent_id": "t1_i7cx6w4",
                    "score": 4,
                    "created_utc": 1651707905.0,
                    "replies": [
                        {
                            "body": "But that is not what you imply on your OP.",
                            "author": "tamenwild",
                            "id": "i7czie7",
                            "parent_id": "t1_i7cz6f6",
                            "score": 5,
                            "created_utc": 1651708056.0,
                            "replies": [
                                {
                                    "body": "I don’t understand, I’m assuming you’re talking about one of these points, which one “implies” that your partner needs to “ask permission for every little thing”? \n\n•Asking permission before you change the type or degree of sexual activity with phrases like \"Is this OK?\"\n\nSo, asking if it’s okay before switching to anal sex. Asking if they’re comfortable before oral sex, some partners are not. Asking if it’s okay to up the degree, example, if you were to up the degree to BSDM. \n\n•Confirming that there is reciprocal interest\nbefore initiating any physical touch.\n\nSo, making sure that your partner is also into it, picking up on their non-verbal cues. Not just assuming that you have consent to pull their pants off. Making sure that they’re “reciprocating.”",
                                    "author": "bubblerush",
                                    "id": "i7d16kl",
                                    "parent_id": "t1_i7czie7",
                                    "score": 5,
                                    "created_utc": 1651708804.0,
                                    "replies": [
                                        {
                                            "body": "You probably should have explained what you meant in the original because that is not the impression I get when reading it. For either bullet point.",
                                            "author": "tamenwild",
                                            "id": "i7d25ev",
                                            "parent_id": "t1_i7d16kl",
                                            "score": 5,
                                            "created_utc": 1651709233.0,
                                            "replies": [
                                                {
                                                    "body": "Me neither.",
                                                    "author": "ShaArt5",
                                                    "id": "i7d6vlq",
                                                    "parent_id": "t1_i7d25ev",
                                                    "score": 2,
                                                    "created_utc": 1651711339.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How is consent controversial?",
            "author": "bubblerush",
            "id": "i7csmyt",
            "parent_id": "t1_i7csfgv",
            "score": 3,
            "created_utc": 1651704949.0,
            "replies": [
                {
                    "body": "Consent is not controversial.  Your definition of consent is.",
                    "author": null,
                    "id": "i7d26i5",
                    "parent_id": "t1_i7csmyt",
                    "score": 13,
                    "created_utc": 1651709247.0,
                    "replies": []
                },
                {
                    "body": "Could I respectfully ask why you post here despite the earlier post that made it clear you’re against sugaring?",
                    "author": "JDMultralight",
                    "id": "i7d47wl",
                    "parent_id": "t1_i7csmyt",
                    "score": 0,
                    "created_utc": 1651710157.0,
                    "replies": [
                        {
                            "body": "Never said I was against sugaring, I just think it needs to be safer, for men and women.",
                            "author": "bubblerush",
                            "id": "i7d4d4u",
                            "parent_id": "t1_i7d47wl",
                            "score": 6,
                            "created_utc": 1651710221.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh I know the crazy anxiety of going in for that first kiss… don’t crash into her teeth… watch out for the nose… oh no braces 😬",
            "author": null,
            "id": "i7dfixy",
            "parent_id": "t1_i7csel6",
            "score": -2,
            "created_utc": 1651715190.0,
            "replies": []
        },
        {
            "body": "If a guy used the word “simp”, I would be out.",
            "author": "xWaterlooSunset",
            "id": "i7cx9wj",
            "parent_id": "t1_i7ct71x",
            "score": 20,
            "created_utc": 1651707052.0,
            "replies": [
                {
                    "body": "Simp. \n\nYou out?",
                    "author": "timrid",
                    "id": "i7d1e4m",
                    "parent_id": "t1_i7cx9wj",
                    "score": -5,
                    "created_utc": 1651708895.0,
                    "replies": [
                        {
                            "body": "Was never in, hun",
                            "author": "xWaterlooSunset",
                            "id": "i7d45c0",
                            "parent_id": "t1_i7d1e4m",
                            "score": 13,
                            "created_utc": 1651710126.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "i7dd5ks",
            "parent_id": "t1_i7dc0gi",
            "score": 2,
            "created_utc": 1651714117.0,
            "replies": [
                {
                    "body": "Not right is not the same as “sexual misconduct”.",
                    "author": "57hz",
                    "id": "i7doa5j",
                    "parent_id": "t1_i7dd5ks",
                    "score": 2,
                    "created_utc": 1651719259.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, this is just North Carolina 18th century crap. Most states do not punish adultery in either criminal or civil arenas.",
            "author": "57hz",
            "id": "i7do80w",
            "parent_id": "t1_i7dc0gi",
            "score": 1,
            "created_utc": 1651719231.0,
            "replies": []
        },
        {
            "body": "Yes exactly, lying about contraception is never okay. Women lying about being on birth control, men lying about having a vasectomy, or either partner removing a condom without consent.",
            "author": "bubblerush",
            "id": "i7de8d4",
            "parent_id": "t1_i7dd3u8",
            "score": 6,
            "created_utc": 1651714609.0,
            "replies": []
        },
        {
            "body": "It is important, absolutely. But I think you may want to watch your wording in the future so as not to seem to be generalizing and keep in mind you probably lost a lot of SD’s here benefit of the doubt based on your previous posts about sugar dating. You make a lot of valid points but tend to come off condescending which can just lead to people not listening at all to your core, important message.",
            "author": "usererror403",
            "id": "i7dfuuh",
            "parent_id": "t1_i7ddv3z",
            "score": 2,
            "created_utc": 1651715338.0,
            "replies": [
                {
                    "body": "The men here aren’t disagreeing because I’m the one that posted it and I lost their “benefit of the doubt.” The men that are offended by this post are offended for other reasons unfortunately. If 1 in 3 women are victims of sexual violence, where are the perpetrators? I’d assume at least a handful of the men getting upset here.",
                    "author": "bubblerush",
                    "id": "i7dgrv4",
                    "parent_id": "t1_i7dfuuh",
                    "score": 6,
                    "created_utc": 1651715757.0,
                    "replies": [
                        {
                            "body": "I’m just saying as a woman and a victim I didn’t agree with how you worded either post, so I can just imagine how they read it. And generally yes there’s usually smoke where there’s fire, but it’s very disingenuous and damaging to assume whenever men are upset at your views/wording it’s because they’re a perpetrator.",
                            "author": "usererror403",
                            "id": "i7di09y",
                            "parent_id": "t1_i7dgrv4",
                            "score": 10,
                            "created_utc": 1651716310.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is indeed an accurate point.",
            "author": "Y_4Z44",
            "id": "i7d09k6",
            "parent_id": "t1_i7cyn2f",
            "score": 4,
            "created_utc": 1651708397.0,
            "replies": [
                {
                    "body": "Each time, I’m like “ugh I DID NOT consent to this cringey story please, make it stop” 😅",
                    "author": "xWaterlooSunset",
                    "id": "i7d0il0",
                    "parent_id": "t1_i7d09k6",
                    "score": 11,
                    "created_utc": 1651708511.0,
                    "replies": [
                        {
                            "body": "Lmfaooooo",
                            "author": "Y_4Z44",
                            "id": "i7d0qtx",
                            "parent_id": "t1_i7d0il0",
                            "score": 3,
                            "created_utc": 1651708612.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, there are people (the vast majority of people in SLF) who're here to help, and would have made this a worthwhile post. And then there are those whose singular purpose in life seems to be, well, let's just say, less than pleasant to everyone around them.",
            "author": "Y_4Z44",
            "id": "i7cqcs0",
            "parent_id": "t1_i7cq1xi",
            "score": 3,
            "created_utc": 1651703951.0,
            "replies": [
                {
                    "body": "There are a number of posts that followed that were collectively straying from the spirit of SLF  and have been removed........\n\ncivility is sensual      thanks",
                    "author": "pinotandsugar",
                    "id": "i7dp2pl",
                    "parent_id": "t1_i7cqcs0",
                    "score": -4,
                    "created_utc": 1651719646.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "i7cu30y",
            "parent_id": "t1_i7ct0n2",
            "score": 9,
            "created_utc": 1651705593.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "i7cyx92",
                    "parent_id": "t1_i7cu30y",
                    "score": 2,
                    "created_utc": 1651707793.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "i7d9sq6",
                    "parent_id": "t1_i7cu30y",
                    "score": -3,
                    "created_utc": 1651712620.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "i7daqs1",
                            "parent_id": "t1_i7d9sq6",
                            "score": 3,
                            "created_utc": 1651713040.0,
                            "replies": [
                                {
                                    "body": "A little 🤣",
                                    "author": "Pretty_Ant_3094",
                                    "id": "i7dbym7",
                                    "parent_id": "t1_i7daqs1",
                                    "score": 0,
                                    "created_utc": 1651713586.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "i7dnzzp",
                            "parent_id": "t1_i7d9sq6",
                            "score": 2,
                            "created_utc": 1651719127.0,
                            "replies": [
                                {
                                    "body": "> jargon \"you *paid* for the\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                                    "author": "Paid-Not-Payed-Bot",
                                    "id": "i7do191",
                                    "parent_id": "t1_i7dnzzp",
                                    "score": 2,
                                    "created_utc": 1651719143.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "i7cv0vi",
            "parent_id": "t1_i7ct0n2",
            "score": 2,
            "created_utc": 1651706018.0,
            "replies": []
        },
        {
            "body": "What if the guy is sodomized? That counts as penetration?",
            "author": null,
            "id": "i7cwnaq",
            "parent_id": "t1_i7cwhof",
            "score": 6,
            "created_utc": 1651706771.0,
            "replies": [
                {
                    "body": "Yes, if he’s sodomized.   I was speaking to hetero PIV sex.",
                    "author": "63daddy",
                    "id": "i7cz5q2",
                    "parent_id": "t1_i7cwnaq",
                    "score": 3,
                    "created_utc": 1651707897.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, the law is garbage when it comes to rape/assault. Men can be victims of rape too, not just women, and my heart goes out to male victims. As a woman, I couldn’t imagine how hard it is for male victims of rape and sexual assault. Society is still very invalidating for male survivors. This post is a great example, I made a post about consent in general, and everyone felt it was one sided, it’s not. Having consent from your male partner is just as important.",
            "author": "bubblerush",
            "id": "i7d0b44",
            "parent_id": "t1_i7cwhof",
            "score": 2,
            "created_utc": 1651708417.0,
            "replies": [
                {
                    "body": "I agree it’s “garbage”, but garbage or not it’s what one is held accountable to.",
                    "author": "63daddy",
                    "id": "i7d4hkx",
                    "parent_id": "t1_i7d0b44",
                    "score": 1,
                    "created_utc": 1651710275.0,
                    "replies": [
                        {
                            "body": "Well unfortunately, offenders are rarely held accountable. Out of every 1000 sexual assaults, only approximately 25 perpetrators will be incarcerated, and that statistic is from the Bureau of Justice Statistics.",
                            "author": "bubblerush",
                            "id": "i7d5kmp",
                            "parent_id": "t1_i7d4hkx",
                            "score": 8,
                            "created_utc": 1651710760.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m 💯 inclusive for sure. I may even ask whether verbal or physical check-ins are preferred. Many people get non-verbal when play is intense eg subspace and that can easily/does easily happen with orgasms alone. Tapping out may be necessary.",
            "author": "daddoms",
            "id": "i7dnv7t",
            "parent_id": "t1_i7dfs6i",
            "score": 2,
            "created_utc": 1651719068.0,
            "replies": []
        },
        {
            "body": "“Unless you have an existing agreement” can you elaborate? Like a CNC kink?",
            "author": "bubblerush",
            "id": "i7dcnma",
            "parent_id": "t1_i7dc7ba",
            "score": 2,
            "created_utc": 1651713896.0,
            "replies": []
        },
        {
            "body": "Mobile notaries just got a raise.",
            "author": "57hz",
            "id": "i7doc88",
            "parent_id": "t1_i7cyzt4",
            "score": -2,
            "created_utc": 1651719287.0,
            "replies": []
        },
        {
            "body": "Cat got their tongue?",
            "author": "57hz",
            "id": "i7dod9f",
            "parent_id": "t1_i7d2n45",
            "score": 0,
            "created_utc": 1651719300.0,
            "replies": []
        },
        {
            "body": "What constitutes legitimate can vary however.    Someone can enthusiastically say yes, and it can later be ruled to be invalid consent.",
            "author": "63daddy",
            "id": "i7cvolx",
            "parent_id": "t1_i7cuh7h",
            "score": -1,
            "created_utc": 1651706318.0,
            "replies": []
        },
        {
            "body": "No, promoting the idea that if a chick is too immature to say no then that is consent violation is harmful. How about, instead we promote that someone who is too fucking immature to open her mouth when fucking should stop fucking and go to therapy? Would save a whole lot more consent violations than your approach.",
            "author": "Observing_n_Laughing",
            "id": "i7d3r9m",
            "parent_id": "t1_i7d37b8",
            "score": -13,
            "created_utc": 1651709958.0,
            "replies": [
                {
                    "body": "“If a chick is too fucking immature to open her mouth when fucking should stop fucking and go to therapy.”\n\n\nThat’s quite an uncalled for and needlessly aggressive reply. Do *you* need therapy?",
                    "author": "xWaterlooSunset",
                    "id": "i7d4g52",
                    "parent_id": "t1_i7d3r9m",
                    "score": 14,
                    "created_utc": 1651710257.0,
                    "replies": [
                        {
                            "body": "I am quite an aggressive person.",
                            "author": "Observing_n_Laughing",
                            "id": "i7d4mki",
                            "parent_id": "t1_i7d4g52",
                            "score": -12,
                            "created_utc": 1651710336.0,
                            "replies": [
                                {
                                    "body": "Sorry to hear that. Maybe you can get help one day.",
                                    "author": "xWaterlooSunset",
                                    "id": "i7d515a",
                                    "parent_id": "t1_i7d4mki",
                                    "score": 13,
                                    "created_utc": 1651710517.0,
                                    "replies": [
                                        {
                                            "body": "No need. Life is awesome.",
                                            "author": "Observing_n_Laughing",
                                            "id": "i7d6r6n",
                                            "parent_id": "t1_i7d515a",
                                            "score": -3,
                                            "created_utc": 1651711284.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Are you clueless about how sex works?  Just for reference, the woman is the lock the man is the key.  Inert the key into the lock.  Turn, open.  \n\nPoint is, no one ever talks about consent in terms of the man giving consent.  so when consent is brought up, its implied that its consent of a woman to allow a man to penetrate her body. \n\nYou are being so obtuse in your arguments.  who actually trolls a community where consent is paramount with a consent thread and then takes it personal when someone give there view on it. \n\nI don't feel targeted as a man, and a man with money, I got a bullseye on my back every day.  I am targeted.  What I feel is that you are trying to stir shit up cause you got nothin else better to do.",
            "author": "rougeforces",
            "id": "i7d32tf",
            "parent_id": "t1_i7d2dew",
            "score": -11,
            "created_utc": 1651709657.0,
            "replies": [
                {
                    "body": "Again, read my comments. I’ve made multiple comments about how consent from the male partner is just as important.",
                    "author": "bubblerush",
                    "id": "i7d3dtd",
                    "parent_id": "t1_i7d32tf",
                    "score": 7,
                    "created_utc": 1651709792.0,
                    "replies": [
                        {
                            "body": "right, imagine both partners continuously evaluating consent, that is even worse than just targeting men.  I cannot imagine any woman including yourself laying on your back in the throws of passion asking yourself if he is still ok with what is happening every so often. \n\nIt's pretty damn obvious when a woman removes her consent.  Just like it's pretty damn obvious when she gives it.  I mock the rules because I am a man that understands how to treat a woman, not a boy that has never experienced sex before, nor a psychopath that is trying to rape someone.\n\nThat is all.",
                            "author": "rougeforces",
                            "id": "i7d5ivb",
                            "parent_id": "t1_i7d3dtd",
                            "score": -5,
                            "created_utc": 1651710737.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "To the three ladies above me thank you so much for being reasonable about this I mean where does the OP go with her writing? I mean I’m trying to envision myself asking a woman hey Miss do you mind if I unbutton the top button of your blouse how about the second button how about the third where the hell does that shit end",
            "author": "puckhead4",
            "id": "i7cy9p1",
            "parent_id": "t1_i7cw9xs",
            "score": -1,
            "created_utc": 1651707502.0,
            "replies": [
                {
                    "body": "IDK I don't actually disagree with OP, I think it's just about not interpreting it too literally. \n\nI think the main point of stuff like this is \"don't assume consent\". Can consent be implied nonverbally? Totally! No one expects you to ask every time you kiss, especially when both parties are showing enthusiasm.\n\nNow if your partner has an unclear reaction to something you're doing e.g. freezing up a little, it's probably good to check in, which doesn't always mean \"is this ok\" but could be something along the lines of \"do you like that?\" It doesnt have to be \"may I penetrate you vaginally\" it can be \"tell me how badly you want me to fuck you\". Long story short if there's any doubt, you can still have fun while checking in. \n\nI think the misunderstanding of points like OP's is that all couples communicate differently and there's never going to be one perfect formula to discern consent. We tried \"no means no\" and you end up with cases of people getting raped while crying, then the rapist says \"well they never actually said no\". Interpreting that literally clearly doesn't work. So we get enthusiastic consent. And yes, ask if you're unsure is the safest bet, but no, there isn't some secret agenda to stop people from having sex without asking every few minutes. And this one shouldn't be taken 100% literally either.",
                    "author": "sinperviren",
                    "id": "i7d0mel",
                    "parent_id": "t1_i7cy9p1",
                    "score": 29,
                    "created_utc": 1651708558.0,
                    "replies": [
                        {
                            "body": "That’s where it gets complicated. What does it mean to be under the influence of drugs or alcohol?\n\nThey took an edible and a benzo before the date to “set the vibe”. Now they can’t give consent, and if they change their mind after the fact you never had consent to begin with. \n\nI mean reasonable people understand the difference between someone who is buzzing and having a good time and someone who is wasted. However people are not reasonable…\n\nI guess I get hung up on scenarios where people give consent, change their mind during the act, don’t clearly voice that they changed their mind (for whatever reason) and then retroactive withdrawal consent and the call it sexual assault.\n\nThat scenario is fundamentally different the a physically violent sexual assault where consent was never given and active physical resistance is used. \n\nWhat do I know… I am just a man who has never been manipulated into doing anything I didn’t want to do by the fairer sex. ;)",
                            "author": null,
                            "id": "i7df8rl",
                            "parent_id": "t1_i7d0mel",
                            "score": 0,
                            "created_utc": 1651715064.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Idk someone doesn't like my opinion and is down voting 🤣🤣🤣",
                    "author": "tamenwild",
                    "id": "i7cymcf",
                    "parent_id": "t1_i7cy9p1",
                    "score": 0,
                    "created_utc": 1651707657.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“Confirming that there is reciprocal interest” doesn’t need to be verbal. You can pick up on your partners non-verbal cues, and it’s important to confirm (verbally or non-verbally) that they’re also enjoying themselves and comfortable with what’s happening.",
            "author": "bubblerush",
            "id": "i7d25zo",
            "parent_id": "t1_i7d16lp",
            "score": 18,
            "created_utc": 1651709240.0,
            "replies": []
        },
        {
            "body": "To me the foundation of consent is empowering her to be expressive and responding.  To me it is fun to let her take the lead once started.\n\n I prefer to let her decide when it is time to change from cowgirl oral. \n\nTotally agree that anal ( not something for which I have any enthusiasm) should  require affirmation prior as the intent might not be apparent.",
            "author": "pinotandsugar",
            "id": "i7dofac",
            "parent_id": "t1_i7d16lp",
            "score": 4,
            "created_utc": 1651719328.0,
            "replies": []
        },
        {
            "body": "“Asking permission for every little thing.” Consent doesn’t always have to be verbal, if it’s something that’s in the realm of what you normally do with your partner (kissing, touching, vaginal intercourse) and they’re engaged and reciprocating that’s one thing, but when changing the “type or degree” of sexual activity there needs to be consent. If you were to initiate anal sex, bdsm, kink/fetish, or anything more than what you know is within your partner’s comfort zone, you need to ask if it’s okay.",
            "author": "bubblerush",
            "id": "i7cz6f6",
            "parent_id": "t1_i7cx6w4",
            "score": 4,
            "created_utc": 1651707905.0,
            "replies": [
                {
                    "body": "But that is not what you imply on your OP.",
                    "author": "tamenwild",
                    "id": "i7czie7",
                    "parent_id": "t1_i7cz6f6",
                    "score": 5,
                    "created_utc": 1651708056.0,
                    "replies": [
                        {
                            "body": "I don’t understand, I’m assuming you’re talking about one of these points, which one “implies” that your partner needs to “ask permission for every little thing”? \n\n•Asking permission before you change the type or degree of sexual activity with phrases like \"Is this OK?\"\n\nSo, asking if it’s okay before switching to anal sex. Asking if they’re comfortable before oral sex, some partners are not. Asking if it’s okay to up the degree, example, if you were to up the degree to BSDM. \n\n•Confirming that there is reciprocal interest\nbefore initiating any physical touch.\n\nSo, making sure that your partner is also into it, picking up on their non-verbal cues. Not just assuming that you have consent to pull their pants off. Making sure that they’re “reciprocating.”",
                            "author": "bubblerush",
                            "id": "i7d16kl",
                            "parent_id": "t1_i7czie7",
                            "score": 5,
                            "created_utc": 1651708804.0,
                            "replies": [
                                {
                                    "body": "You probably should have explained what you meant in the original because that is not the impression I get when reading it. For either bullet point.",
                                    "author": "tamenwild",
                                    "id": "i7d25ev",
                                    "parent_id": "t1_i7d16kl",
                                    "score": 5,
                                    "created_utc": 1651709233.0,
                                    "replies": [
                                        {
                                            "body": "Me neither.",
                                            "author": "ShaArt5",
                                            "id": "i7d6vlq",
                                            "parent_id": "t1_i7d25ev",
                                            "score": 2,
                                            "created_utc": 1651711339.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Consent is not controversial.  Your definition of consent is.",
            "author": null,
            "id": "i7d26i5",
            "parent_id": "t1_i7csmyt",
            "score": 13,
            "created_utc": 1651709247.0,
            "replies": []
        },
        {
            "body": "Could I respectfully ask why you post here despite the earlier post that made it clear you’re against sugaring?",
            "author": "JDMultralight",
            "id": "i7d47wl",
            "parent_id": "t1_i7csmyt",
            "score": 0,
            "created_utc": 1651710157.0,
            "replies": [
                {
                    "body": "Never said I was against sugaring, I just think it needs to be safer, for men and women.",
                    "author": "bubblerush",
                    "id": "i7d4d4u",
                    "parent_id": "t1_i7d47wl",
                    "score": 6,
                    "created_utc": 1651710221.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Simp. \n\nYou out?",
            "author": "timrid",
            "id": "i7d1e4m",
            "parent_id": "t1_i7cx9wj",
            "score": -5,
            "created_utc": 1651708895.0,
            "replies": [
                {
                    "body": "Was never in, hun",
                    "author": "xWaterlooSunset",
                    "id": "i7d45c0",
                    "parent_id": "t1_i7d1e4m",
                    "score": 13,
                    "created_utc": 1651710126.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not right is not the same as “sexual misconduct”.",
            "author": "57hz",
            "id": "i7doa5j",
            "parent_id": "t1_i7dd5ks",
            "score": 2,
            "created_utc": 1651719259.0,
            "replies": []
        },
        {
            "body": "The men here aren’t disagreeing because I’m the one that posted it and I lost their “benefit of the doubt.” The men that are offended by this post are offended for other reasons unfortunately. If 1 in 3 women are victims of sexual violence, where are the perpetrators? I’d assume at least a handful of the men getting upset here.",
            "author": "bubblerush",
            "id": "i7dgrv4",
            "parent_id": "t1_i7dfuuh",
            "score": 6,
            "created_utc": 1651715757.0,
            "replies": [
                {
                    "body": "I’m just saying as a woman and a victim I didn’t agree with how you worded either post, so I can just imagine how they read it. And generally yes there’s usually smoke where there’s fire, but it’s very disingenuous and damaging to assume whenever men are upset at your views/wording it’s because they’re a perpetrator.",
                    "author": "usererror403",
                    "id": "i7di09y",
                    "parent_id": "t1_i7dgrv4",
                    "score": 10,
                    "created_utc": 1651716310.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Each time, I’m like “ugh I DID NOT consent to this cringey story please, make it stop” 😅",
            "author": "xWaterlooSunset",
            "id": "i7d0il0",
            "parent_id": "t1_i7d09k6",
            "score": 11,
            "created_utc": 1651708511.0,
            "replies": [
                {
                    "body": "Lmfaooooo",
                    "author": "Y_4Z44",
                    "id": "i7d0qtx",
                    "parent_id": "t1_i7d0il0",
                    "score": 3,
                    "created_utc": 1651708612.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There are a number of posts that followed that were collectively straying from the spirit of SLF  and have been removed........\n\ncivility is sensual      thanks",
            "author": "pinotandsugar",
            "id": "i7dp2pl",
            "parent_id": "t1_i7cqcs0",
            "score": -4,
            "created_utc": 1651719646.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "i7cyx92",
            "parent_id": "t1_i7cu30y",
            "score": 2,
            "created_utc": 1651707793.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "i7d9sq6",
            "parent_id": "t1_i7cu30y",
            "score": -3,
            "created_utc": 1651712620.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "i7daqs1",
                    "parent_id": "t1_i7d9sq6",
                    "score": 3,
                    "created_utc": 1651713040.0,
                    "replies": [
                        {
                            "body": "A little 🤣",
                            "author": "Pretty_Ant_3094",
                            "id": "i7dbym7",
                            "parent_id": "t1_i7daqs1",
                            "score": 0,
                            "created_utc": 1651713586.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "i7dnzzp",
                    "parent_id": "t1_i7d9sq6",
                    "score": 2,
                    "created_utc": 1651719127.0,
                    "replies": [
                        {
                            "body": "> jargon \"you *paid* for the\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                            "author": "Paid-Not-Payed-Bot",
                            "id": "i7do191",
                            "parent_id": "t1_i7dnzzp",
                            "score": 2,
                            "created_utc": 1651719143.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, if he’s sodomized.   I was speaking to hetero PIV sex.",
            "author": "63daddy",
            "id": "i7cz5q2",
            "parent_id": "t1_i7cwnaq",
            "score": 3,
            "created_utc": 1651707897.0,
            "replies": []
        },
        {
            "body": "I agree it’s “garbage”, but garbage or not it’s what one is held accountable to.",
            "author": "63daddy",
            "id": "i7d4hkx",
            "parent_id": "t1_i7d0b44",
            "score": 1,
            "created_utc": 1651710275.0,
            "replies": [
                {
                    "body": "Well unfortunately, offenders are rarely held accountable. Out of every 1000 sexual assaults, only approximately 25 perpetrators will be incarcerated, and that statistic is from the Bureau of Justice Statistics.",
                    "author": "bubblerush",
                    "id": "i7d5kmp",
                    "parent_id": "t1_i7d4hkx",
                    "score": 8,
                    "created_utc": 1651710760.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“If a chick is too fucking immature to open her mouth when fucking should stop fucking and go to therapy.”\n\n\nThat’s quite an uncalled for and needlessly aggressive reply. Do *you* need therapy?",
            "author": "xWaterlooSunset",
            "id": "i7d4g52",
            "parent_id": "t1_i7d3r9m",
            "score": 14,
            "created_utc": 1651710257.0,
            "replies": [
                {
                    "body": "I am quite an aggressive person.",
                    "author": "Observing_n_Laughing",
                    "id": "i7d4mki",
                    "parent_id": "t1_i7d4g52",
                    "score": -12,
                    "created_utc": 1651710336.0,
                    "replies": [
                        {
                            "body": "Sorry to hear that. Maybe you can get help one day.",
                            "author": "xWaterlooSunset",
                            "id": "i7d515a",
                            "parent_id": "t1_i7d4mki",
                            "score": 13,
                            "created_utc": 1651710517.0,
                            "replies": [
                                {
                                    "body": "No need. Life is awesome.",
                                    "author": "Observing_n_Laughing",
                                    "id": "i7d6r6n",
                                    "parent_id": "t1_i7d515a",
                                    "score": -3,
                                    "created_utc": 1651711284.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Again, read my comments. I’ve made multiple comments about how consent from the male partner is just as important.",
            "author": "bubblerush",
            "id": "i7d3dtd",
            "parent_id": "t1_i7d32tf",
            "score": 7,
            "created_utc": 1651709792.0,
            "replies": [
                {
                    "body": "right, imagine both partners continuously evaluating consent, that is even worse than just targeting men.  I cannot imagine any woman including yourself laying on your back in the throws of passion asking yourself if he is still ok with what is happening every so often. \n\nIt's pretty damn obvious when a woman removes her consent.  Just like it's pretty damn obvious when she gives it.  I mock the rules because I am a man that understands how to treat a woman, not a boy that has never experienced sex before, nor a psychopath that is trying to rape someone.\n\nThat is all.",
                    "author": "rougeforces",
                    "id": "i7d5ivb",
                    "parent_id": "t1_i7d3dtd",
                    "score": -5,
                    "created_utc": 1651710737.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "IDK I don't actually disagree with OP, I think it's just about not interpreting it too literally. \n\nI think the main point of stuff like this is \"don't assume consent\". Can consent be implied nonverbally? Totally! No one expects you to ask every time you kiss, especially when both parties are showing enthusiasm.\n\nNow if your partner has an unclear reaction to something you're doing e.g. freezing up a little, it's probably good to check in, which doesn't always mean \"is this ok\" but could be something along the lines of \"do you like that?\" It doesnt have to be \"may I penetrate you vaginally\" it can be \"tell me how badly you want me to fuck you\". Long story short if there's any doubt, you can still have fun while checking in. \n\nI think the misunderstanding of points like OP's is that all couples communicate differently and there's never going to be one perfect formula to discern consent. We tried \"no means no\" and you end up with cases of people getting raped while crying, then the rapist says \"well they never actually said no\". Interpreting that literally clearly doesn't work. So we get enthusiastic consent. And yes, ask if you're unsure is the safest bet, but no, there isn't some secret agenda to stop people from having sex without asking every few minutes. And this one shouldn't be taken 100% literally either.",
            "author": "sinperviren",
            "id": "i7d0mel",
            "parent_id": "t1_i7cy9p1",
            "score": 29,
            "created_utc": 1651708558.0,
            "replies": [
                {
                    "body": "That’s where it gets complicated. What does it mean to be under the influence of drugs or alcohol?\n\nThey took an edible and a benzo before the date to “set the vibe”. Now they can’t give consent, and if they change their mind after the fact you never had consent to begin with. \n\nI mean reasonable people understand the difference between someone who is buzzing and having a good time and someone who is wasted. However people are not reasonable…\n\nI guess I get hung up on scenarios where people give consent, change their mind during the act, don’t clearly voice that they changed their mind (for whatever reason) and then retroactive withdrawal consent and the call it sexual assault.\n\nThat scenario is fundamentally different the a physically violent sexual assault where consent was never given and active physical resistance is used. \n\nWhat do I know… I am just a man who has never been manipulated into doing anything I didn’t want to do by the fairer sex. ;)",
                    "author": null,
                    "id": "i7df8rl",
                    "parent_id": "t1_i7d0mel",
                    "score": 0,
                    "created_utc": 1651715064.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Idk someone doesn't like my opinion and is down voting 🤣🤣🤣",
            "author": "tamenwild",
            "id": "i7cymcf",
            "parent_id": "t1_i7cy9p1",
            "score": 0,
            "created_utc": 1651707657.0,
            "replies": []
        },
        {
            "body": "But that is not what you imply on your OP.",
            "author": "tamenwild",
            "id": "i7czie7",
            "parent_id": "t1_i7cz6f6",
            "score": 5,
            "created_utc": 1651708056.0,
            "replies": [
                {
                    "body": "I don’t understand, I’m assuming you’re talking about one of these points, which one “implies” that your partner needs to “ask permission for every little thing”? \n\n•Asking permission before you change the type or degree of sexual activity with phrases like \"Is this OK?\"\n\nSo, asking if it’s okay before switching to anal sex. Asking if they’re comfortable before oral sex, some partners are not. Asking if it’s okay to up the degree, example, if you were to up the degree to BSDM. \n\n•Confirming that there is reciprocal interest\nbefore initiating any physical touch.\n\nSo, making sure that your partner is also into it, picking up on their non-verbal cues. Not just assuming that you have consent to pull their pants off. Making sure that they’re “reciprocating.”",
                    "author": "bubblerush",
                    "id": "i7d16kl",
                    "parent_id": "t1_i7czie7",
                    "score": 5,
                    "created_utc": 1651708804.0,
                    "replies": [
                        {
                            "body": "You probably should have explained what you meant in the original because that is not the impression I get when reading it. For either bullet point.",
                            "author": "tamenwild",
                            "id": "i7d25ev",
                            "parent_id": "t1_i7d16kl",
                            "score": 5,
                            "created_utc": 1651709233.0,
                            "replies": [
                                {
                                    "body": "Me neither.",
                                    "author": "ShaArt5",
                                    "id": "i7d6vlq",
                                    "parent_id": "t1_i7d25ev",
                                    "score": 2,
                                    "created_utc": 1651711339.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Never said I was against sugaring, I just think it needs to be safer, for men and women.",
            "author": "bubblerush",
            "id": "i7d4d4u",
            "parent_id": "t1_i7d47wl",
            "score": 6,
            "created_utc": 1651710221.0,
            "replies": []
        },
        {
            "body": "Was never in, hun",
            "author": "xWaterlooSunset",
            "id": "i7d45c0",
            "parent_id": "t1_i7d1e4m",
            "score": 13,
            "created_utc": 1651710126.0,
            "replies": []
        },
        {
            "body": "I’m just saying as a woman and a victim I didn’t agree with how you worded either post, so I can just imagine how they read it. And generally yes there’s usually smoke where there’s fire, but it’s very disingenuous and damaging to assume whenever men are upset at your views/wording it’s because they’re a perpetrator.",
            "author": "usererror403",
            "id": "i7di09y",
            "parent_id": "t1_i7dgrv4",
            "score": 10,
            "created_utc": 1651716310.0,
            "replies": []
        },
        {
            "body": "Lmfaooooo",
            "author": "Y_4Z44",
            "id": "i7d0qtx",
            "parent_id": "t1_i7d0il0",
            "score": 3,
            "created_utc": 1651708612.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "i7daqs1",
            "parent_id": "t1_i7d9sq6",
            "score": 3,
            "created_utc": 1651713040.0,
            "replies": [
                {
                    "body": "A little 🤣",
                    "author": "Pretty_Ant_3094",
                    "id": "i7dbym7",
                    "parent_id": "t1_i7daqs1",
                    "score": 0,
                    "created_utc": 1651713586.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "i7dnzzp",
            "parent_id": "t1_i7d9sq6",
            "score": 2,
            "created_utc": 1651719127.0,
            "replies": [
                {
                    "body": "> jargon \"you *paid* for the\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                    "author": "Paid-Not-Payed-Bot",
                    "id": "i7do191",
                    "parent_id": "t1_i7dnzzp",
                    "score": 2,
                    "created_utc": 1651719143.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well unfortunately, offenders are rarely held accountable. Out of every 1000 sexual assaults, only approximately 25 perpetrators will be incarcerated, and that statistic is from the Bureau of Justice Statistics.",
            "author": "bubblerush",
            "id": "i7d5kmp",
            "parent_id": "t1_i7d4hkx",
            "score": 8,
            "created_utc": 1651710760.0,
            "replies": []
        },
        {
            "body": "I am quite an aggressive person.",
            "author": "Observing_n_Laughing",
            "id": "i7d4mki",
            "parent_id": "t1_i7d4g52",
            "score": -12,
            "created_utc": 1651710336.0,
            "replies": [
                {
                    "body": "Sorry to hear that. Maybe you can get help one day.",
                    "author": "xWaterlooSunset",
                    "id": "i7d515a",
                    "parent_id": "t1_i7d4mki",
                    "score": 13,
                    "created_utc": 1651710517.0,
                    "replies": [
                        {
                            "body": "No need. Life is awesome.",
                            "author": "Observing_n_Laughing",
                            "id": "i7d6r6n",
                            "parent_id": "t1_i7d515a",
                            "score": -3,
                            "created_utc": 1651711284.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "right, imagine both partners continuously evaluating consent, that is even worse than just targeting men.  I cannot imagine any woman including yourself laying on your back in the throws of passion asking yourself if he is still ok with what is happening every so often. \n\nIt's pretty damn obvious when a woman removes her consent.  Just like it's pretty damn obvious when she gives it.  I mock the rules because I am a man that understands how to treat a woman, not a boy that has never experienced sex before, nor a psychopath that is trying to rape someone.\n\nThat is all.",
            "author": "rougeforces",
            "id": "i7d5ivb",
            "parent_id": "t1_i7d3dtd",
            "score": -5,
            "created_utc": 1651710737.0,
            "replies": []
        },
        {
            "body": "That’s where it gets complicated. What does it mean to be under the influence of drugs or alcohol?\n\nThey took an edible and a benzo before the date to “set the vibe”. Now they can’t give consent, and if they change their mind after the fact you never had consent to begin with. \n\nI mean reasonable people understand the difference between someone who is buzzing and having a good time and someone who is wasted. However people are not reasonable…\n\nI guess I get hung up on scenarios where people give consent, change their mind during the act, don’t clearly voice that they changed their mind (for whatever reason) and then retroactive withdrawal consent and the call it sexual assault.\n\nThat scenario is fundamentally different the a physically violent sexual assault where consent was never given and active physical resistance is used. \n\nWhat do I know… I am just a man who has never been manipulated into doing anything I didn’t want to do by the fairer sex. ;)",
            "author": null,
            "id": "i7df8rl",
            "parent_id": "t1_i7d0mel",
            "score": 0,
            "created_utc": 1651715064.0,
            "replies": []
        },
        {
            "body": "I don’t understand, I’m assuming you’re talking about one of these points, which one “implies” that your partner needs to “ask permission for every little thing”? \n\n•Asking permission before you change the type or degree of sexual activity with phrases like \"Is this OK?\"\n\nSo, asking if it’s okay before switching to anal sex. Asking if they’re comfortable before oral sex, some partners are not. Asking if it’s okay to up the degree, example, if you were to up the degree to BSDM. \n\n•Confirming that there is reciprocal interest\nbefore initiating any physical touch.\n\nSo, making sure that your partner is also into it, picking up on their non-verbal cues. Not just assuming that you have consent to pull their pants off. Making sure that they’re “reciprocating.”",
            "author": "bubblerush",
            "id": "i7d16kl",
            "parent_id": "t1_i7czie7",
            "score": 5,
            "created_utc": 1651708804.0,
            "replies": [
                {
                    "body": "You probably should have explained what you meant in the original because that is not the impression I get when reading it. For either bullet point.",
                    "author": "tamenwild",
                    "id": "i7d25ev",
                    "parent_id": "t1_i7d16kl",
                    "score": 5,
                    "created_utc": 1651709233.0,
                    "replies": [
                        {
                            "body": "Me neither.",
                            "author": "ShaArt5",
                            "id": "i7d6vlq",
                            "parent_id": "t1_i7d25ev",
                            "score": 2,
                            "created_utc": 1651711339.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "A little 🤣",
            "author": "Pretty_Ant_3094",
            "id": "i7dbym7",
            "parent_id": "t1_i7daqs1",
            "score": 0,
            "created_utc": 1651713586.0,
            "replies": []
        },
        {
            "body": "> jargon \"you *paid* for the\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
            "author": "Paid-Not-Payed-Bot",
            "id": "i7do191",
            "parent_id": "t1_i7dnzzp",
            "score": 2,
            "created_utc": 1651719143.0,
            "replies": []
        },
        {
            "body": "Sorry to hear that. Maybe you can get help one day.",
            "author": "xWaterlooSunset",
            "id": "i7d515a",
            "parent_id": "t1_i7d4mki",
            "score": 13,
            "created_utc": 1651710517.0,
            "replies": [
                {
                    "body": "No need. Life is awesome.",
                    "author": "Observing_n_Laughing",
                    "id": "i7d6r6n",
                    "parent_id": "t1_i7d515a",
                    "score": -3,
                    "created_utc": 1651711284.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You probably should have explained what you meant in the original because that is not the impression I get when reading it. For either bullet point.",
            "author": "tamenwild",
            "id": "i7d25ev",
            "parent_id": "t1_i7d16kl",
            "score": 5,
            "created_utc": 1651709233.0,
            "replies": [
                {
                    "body": "Me neither.",
                    "author": "ShaArt5",
                    "id": "i7d6vlq",
                    "parent_id": "t1_i7d25ev",
                    "score": 2,
                    "created_utc": 1651711339.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No need. Life is awesome.",
            "author": "Observing_n_Laughing",
            "id": "i7d6r6n",
            "parent_id": "t1_i7d515a",
            "score": -3,
            "created_utc": 1651711284.0,
            "replies": []
        },
        {
            "body": "Me neither.",
            "author": "ShaArt5",
            "id": "i7d6vlq",
            "parent_id": "t1_i7d25ev",
            "score": 2,
            "created_utc": 1651711339.0,
            "replies": []
        }
    ]
}