{
    "title": "Some things I've learned from being a SB on SA for 12 years",
    "post_id": "11dt68i",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/11dt68i/some_things_ive_learned_from_being_a_sb_on_sa_for/",
    "author": "HarvardLawSB",
    "body": "Editing to add a bit of a foreword: After commenting [on a recent post](https://www.reddit.com/r/sugarlifestyleforum/comments/11die3k/everything_i_learned_from_being_an_sd_on_sa_for_1/), I realized that most of the advice I would give to new SBs have to do with attitude and self-care. There is plenty of practical guidance already available here. And I think most SBs know the below already. But sometimes it's good to have a reminder.\n\n\\----\n\nIn the 12 years that I have been on SA, I have had huge loves, tremendous heartbreak, beautiful friendships, and an undying gratitude for those who came into my life for the better.\n\nHere are some things I've learned during that time.\n\n**First and foremost, only** ***you*** **can decide what will be right for** ***you***\n\nIt's great to get reality checks from the internet if something isn't sitting well with you, or bouncing ideas off friends to figure out if something is a good idea. But ultimately, your life is your own choose-your-adventure and we don't have to live with the consequences of your actions. You are the only person who will do that. Your opinion matters most.\n\n**Lead with generosity, kindness, and optimism**\n\nYou get out of the world what you put in. If you lead with cynicism and negativity, that's the energy you will attract. Kindness is not weakness. Optimism does not mean being naive. Assume the best possible intentions first instead of immediately jumping to the worst. Being generous does not mean letting people walk all over you and abuse your boundaries. Which leads me to...\n\n**When people show you who they are, believe them**\n\nYou deserve to be treated with respect and appreciation. Trust actions, not words. Do not accept verbal apologies when their behaviors do not change.\n\n**Be liberal with the block button**\n\nIt's easy to be dragged down by other people's negativity. It doesn't benefit you; you don't need it in your life. Don't engage with obvious scammers. Don't interact with people who are after something wholly different than you. Don't waste your time explaining why someone else is wrong. Just be okay knowing that what you want is what you want, and what they want is what they want. Don't let strangers live rent free in your mind.\n\n**Be honest with yourself and others**\n\nDon't force yourself into a situation that \"should\" be good on paper but that you're not into. It's not worth it. My personal advice would be to not do anything you wouldn't do for free, but I hesitate to put that in bold only because I know that to some this is not a realistic expectation. It's okay that not everyone is monetizing their older man fetish like me. It's okay if you find someone's personality attractive but not necessarily are super hot and bothered by their body. But it's not okay if you're going to feel bad about yourself afterward. You have to be okay with you. Your self-love is the most important love.\n\n**Take time for yourself and check in with yourself often**\n\nThis is basically the same as above, but really, seriously, if you only take one thing from this post, my fellow SBs... Make sure you are ok. Put on your own oxygen mask first. You can't be someone else's fantasy and also your own worst nightmare.\n\n**That's it. That's the post.** There is fantastic advice on specifics of finding a SD in the wiki and elsewhere, but these are the core foundations that have helped me over the years. Although they are relatively simple, I hope they help you as well.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/11dt68i/some_things_ive_learned_from_being_a_sb_on_sa_for/",
    "score": 108,
    "upvote_ratio": 0.93,
    "created_utc": 1677547931.0,
    "num_comments": 53,
    "links": [
        [
            "https://www.reddit.com/r/sugarlifestyleforum/comments/11die3k/everything_i_learned_from_being_an_sd_on_sa_for_1/"
        ]
    ],
    "comments": [
        {
            "body": "I appreciate your perspective. You made some good points on how to approach these sugar relationships and how to make decisions that lead to the least amount of regret. I’m only 10 months in and if it weren’t for the advice of some sugar friends I made I would be in a much worse spot. I’m very grateful for the people I’ve met and experiences I’ve had to date 🙂",
            "author": "amoonshotgirl",
            "id": "jaap1qx",
            "parent_id": "t3_11dt68i",
            "score": 13,
            "created_utc": 1677548894.0,
            "replies": [
                {
                    "body": "I love this so much! If everyone only looked back and experienced gratitude vs regret, just think of how wonderful life would be!",
                    "author": "HarvardLawSB",
                    "id": "jaapang",
                    "parent_id": "t1_jaap1qx",
                    "score": 8,
                    "created_utc": 1677549005.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is a wonderful read, even from the SD side. I've enjoyed reading many of your comments on other posts, and this is a wonderful synopsis. Thanks for sharing all your experience.",
            "author": "Hot_Selection3626",
            "id": "jaar7qp",
            "parent_id": "t3_11dt68i",
            "score": 8,
            "created_utc": 1677549846.0,
            "replies": [
                {
                    "body": "❤️thank you for taking the time to comment. I will never reject a compliment hahaha",
                    "author": "HarvardLawSB",
                    "id": "jaardv6",
                    "parent_id": "t1_jaar7qp",
                    "score": 6,
                    "created_utc": 1677549922.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are such a treasure and I feel honored to have known you. You have always been authentic and genuine, and I admire that about you a lot. And my goodness you can write. I still remember those days you helped me articulate what I was feeling but wasn’t coming out right. You are such a kind soul. I only want the best for you because you sure as hell deserve it.\n\nP.S. I agree with your sentiment wholeheartedly. I owe the best thing that happened to me in my life to the bowl. I don’t change anything. No regret.",
            "author": "BlissfulSB",
            "id": "jabg4zf",
            "parent_id": "t3_11dt68i",
            "score": 6,
            "created_utc": 1677562480.0,
            "replies": [
                {
                    "body": "🥰🥰🥰I love you!!!!!!!!!!!!!! Thank you thank you for being my biggest cheerleader",
                    "author": "HarvardLawSB",
                    "id": "jac9ob2",
                    "parent_id": "t1_jabg4zf",
                    "score": 6,
                    "created_utc": 1677585711.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow!  You have my admirations for lasting twelve years in the bowl.",
            "author": "Psychological-Ad5939",
            "id": "jaar4ll",
            "parent_id": "t3_11dt68i",
            "score": 6,
            "created_utc": 1677549807.0,
            "replies": [
                {
                    "body": "It goes quick when you have a couple SRs that were over 3 years :)",
                    "author": "HarvardLawSB",
                    "id": "jaaraz7",
                    "parent_id": "t1_jaar4ll",
                    "score": 10,
                    "created_utc": 1677549887.0,
                    "replies": [
                        {
                            "body": "You have my admirations for waiting longer than a month in the bowl to offer advice. \n\nIYKYK",
                            "author": "BinghamtonSD",
                            "id": "jabdu9w",
                            "parent_id": "t1_jaaraz7",
                            "score": 8,
                            "created_utc": 1677561045.0,
                            "replies": []
                        },
                        {
                            "body": "I second this!",
                            "author": "spoilyou255",
                            "id": "jaayldn",
                            "parent_id": "t1_jaaraz7",
                            "score": 2,
                            "created_utc": 1677553144.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Time Flees in a great sugar relationship",
                    "author": "pinotandsugar",
                    "id": "jab6rb5",
                    "parent_id": "t1_jaar4ll",
                    "score": 1,
                    "created_utc": 1677557111.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I appreciate that your guidance does not draw a boundary line between SDs and SBs and that it is relevant to all of us. Especially good for a future lawyer to not see things in adversarial terms.",
            "author": "LippoLippi1500",
            "id": "jaatuvu",
            "parent_id": "t3_11dt68i",
            "score": 4,
            "created_utc": 1677551014.0,
            "replies": [
                {
                    "body": "Hahaha well I’ll be going into UHNW estate planning, so definitely prefer to not be adversarial :P",
                    "author": "HarvardLawSB",
                    "id": "jac9h3k",
                    "parent_id": "t1_jaatuvu",
                    "score": 1,
                    "created_utc": 1677585576.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Generosity, Kindness and Optimism (and gratitude) - Words I try to live by every single day. Well said ❤️",
            "author": "Apprehensive-Cap-458",
            "id": "jablu7y",
            "parent_id": "t3_11dt68i",
            "score": 4,
            "created_utc": 1677566348.0,
            "replies": [
                {
                    "body": "Thank you so much! We can only try!",
                    "author": "HarvardLawSB",
                    "id": "jafs2pj",
                    "parent_id": "t1_jablu7y",
                    "score": 1,
                    "created_utc": 1677639171.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "^ this … and when people show you who they are **believe them**",
            "author": "daddoms",
            "id": "jab5k5z",
            "parent_id": "t3_11dt68i",
            "score": 3,
            "created_utc": 1677556498.0,
            "replies": []
        },
        {
            "body": "Awesome summary.  But of course that's what we expect from you\n\nSo many sad stories could be avoided by following your path and equally importantly there would be many more happy stories.  ............",
            "author": "pinotandsugar",
            "id": "jab6oag",
            "parent_id": "t3_11dt68i",
            "score": 3,
            "created_utc": 1677557069.0,
            "replies": [
                {
                    "body": "Awww I love that people expect good things from me!",
                    "author": "HarvardLawSB",
                    "id": "jafs1gf",
                    "parent_id": "t1_jab6oag",
                    "score": 2,
                    "created_utc": 1677639156.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "First of all, this is a great post and the upvote button isn't quite enough to make that clear.\n\nSecond of all, I think you have a lot of good specifics but none more so than this: \n\n>My personal advice would be to not do anything you wouldn't do for free\n\nI phrase this differently when talking with potential SBs, basically explaining that no amount of money is going to make it ok to do something that isn't ok. But the point I think we're both making is this: **No one is suggesting SBs should forgo an allowance. And further, no one is suggesting taking an allowance that doesn't provide you with some substantial benefit. But \"more allowance\" or the \"better allowance\" isn't an offset to a situation you wouldn't voluntarily enter into.** So do keep that in mind ladies. it's so true what u/HarvardLawSB says\n\n>You have to be okay with you. Your self-love is the most important love.",
            "author": "marker3000",
            "id": "jaepidl",
            "parent_id": "t3_11dt68i",
            "score": 3,
            "created_utc": 1677622202.0,
            "replies": [
                {
                    "body": "<3 thank you for those very kind words. I think it's so so so important to be true to who you are. Life is so much easier when you don't try to fit your round self in a square hole.",
                    "author": "HarvardLawSB",
                    "id": "jafsj0m",
                    "parent_id": "t1_jaepidl",
                    "score": 2,
                    "created_utc": 1677639375.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I whole heartedly agree on “lead w generosity and kindness” - my only qualifier would be go easy and let someone prove themselves before you go all out w generosity — on the SD side \n\nI do think very attractive women with pleasant, mature and reliable personalities are rarer than we seem to believe since we deal w so many that are just out to “get their bag”, ppl can become jaded easily \n\nSo when you land that special someone, hold on to them tight, you don’t really know the value of a spark like that until they are gone from your life. \n\nI learned this the hard way after I beginner lucked into someone like this 2y ago had a great six months, and then we just drifted apart for reasons that were partly my fault and I still scratch my head over as to why",
            "author": "OCbird22",
            "id": "jaath5w",
            "parent_id": "t3_11dt68i",
            "score": 4,
            "created_utc": 1677550846.0,
            "replies": [
                {
                    "body": "@OCbird22  @HavardLawSB \nAnother SD opinion on your “hold them tight”. I have had two SBs whe have played consistently important roles in my post-divorce life for at least a year or more. Funny enough, though both veered toward that GF-BF, this is a real relationship, end of the SR spectrum (and ofc not real like out in the open, meet the family), these two approached our SR like mirror opposites. The physical closeness and acceptance of one when the other chose to spend way more time together though not as “close”, for instance.  In neither case would it end because I just let the relationship drift away, since I value these women so highly. \n\nBut my main point is that as much as I would like to “hold them tight”, my interpretation of that phrase just doesn’t accord with what I see as the vast majority of SRs. These can end at any moment for reasons galore. A certain detachment, knowing there’s an expiration, can ironically lead to a strong connection, but a great SR is still, at best, a “temporary commitment”. I always read that the best way to extinguish the connection, particularly with a large age gap, is to be possessive, jealous, or “clingy”.   There are many ways to be “tight” I guess, and best to be mindful of which work and which risk not.",
                    "author": "jacknjilled",
                    "id": "jahxcyj",
                    "parent_id": "t1_jaath5w",
                    "score": 3,
                    "created_utc": 1677685782.0,
                    "replies": [
                        {
                            "body": "No argument from me - I didn’t mean hold them tight as in “be clingy” - just that be aware that grass is always greener until you see it up close. And if you have a great thing going don’t  lapse on keeping the fire alive - I know it’s not a vanilla relationship or marriage - but still you need to put in some energy into it to make the other person feel valued. Just because money is in the equation doesn’t mean you let things slide and take them for granted. \n\nI still stand by my assertion that elite SBs - not just beautiful but also w good personality, reliability and values that sync up w yours - are a special kind and have many more options than people with money seem to think",
                            "author": "OCbird22",
                            "id": "jahyi2k",
                            "parent_id": "t1_jahxcyj",
                            "score": 1,
                            "created_utc": 1677686221.0,
                            "replies": [
                                {
                                    "body": "100% agree with both your paragraphs. I am always so grateful to have these women in my life that I spend time trying to “keep it fresh”, and make sure they know I am not taking them for granted.  They are “out of my league” in certain ways, and are free to look “for better”, or whatever they want, which will change eventually. That’s the tension between commitment/tightness and detachment that I feel acutely, but manage.",
                                    "author": "jacknjilled",
                                    "id": "jai0cbo",
                                    "parent_id": "t1_jahyi2k",
                                    "score": 2,
                                    "created_utc": 1677686935.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah I definitely think generosity is more than financial. Generosity is generous with time, with benefit of the doubt, with energy, with compassion, etc etc etc. While generosity with money is what we most associate with SDs, it’s not the most valuable thing they can bring to the table :)",
                    "author": "HarvardLawSB",
                    "id": "jac9ejv",
                    "parent_id": "t1_jaath5w",
                    "score": 3,
                    "created_utc": 1677585527.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well when will you tell us some stories , it be interesting to read I am sure",
            "author": "shamloo77",
            "id": "jab0ark",
            "parent_id": "t3_11dt68i",
            "score": 2,
            "created_utc": 1677553925.0,
            "replies": [
                {
                    "body": "Hahahaha my love life reads like a bad biography: all the names are changed to protect the innocent :)",
                    "author": "HarvardLawSB",
                    "id": "jafs8pp",
                    "parent_id": "t1_jab0ark",
                    "score": 2,
                    "created_utc": 1677639245.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I enjoyed reading your perspectives. Something I’ve learned along the way: in the SR endeavor, there might very well come a time where one has to end a SD/SB relationship, verbally and/or in writing. I’ll share something with the bowl here…\n\nActress Dominique Dunne (nearly 23) was murdered by her abusive boyfriend in late 1982 shortly after their breakup. I was a young guy living in Southern California at the time and her tragic death received enormous media attention. Her poignant words, addressed in a letter to her ex, provide a powerful framework for composing a breakup narrative (tailored to one’s personal situation naturally), in particular her closing statements:\n\n“When we are good, we are great. But when we are bad, we are horrendous. The bad outweighs the good.”\n\nhttps://criminaldiscoursepodcast.com/dominique-dunne/",
            "author": "This_Relation2262",
            "id": "jab8yrs",
            "parent_id": "t3_11dt68i",
            "score": 2,
            "created_utc": 1677558269.0,
            "replies": []
        },
        {
            "body": "Leading with generosity, kindness, and optimism. Well said. I wish we were all more glass-half-full types in the bowl. I see the tendency to get caught up in the cynicism, always expecting the worst... and then getting it (of course). And no, it doesn't have to be this way. \n\nNot to say get walked on, but each new person is a new person. Rolling into your next interaction with the bad taste (and bad breath) from the last one will certainly tend to make things worse. But then, sometimes, you have an interaction with a sweetheart of a person and all that negativity melts away 🥹\n\nI want more moments like that. Even if it means taking risks to put myself out there 🫣",
            "author": "Worldly-wanderer",
            "id": "jabjwkj",
            "parent_id": "t3_11dt68i",
            "score": 2,
            "created_utc": 1677564977.0,
            "replies": [
                {
                    "body": "Absolutely! Can’t punish one person for the sins of another! :)",
                    "author": "HarvardLawSB",
                    "id": "jac9lin",
                    "parent_id": "t1_jabjwkj",
                    "score": 2,
                    "created_utc": 1677585658.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If someone could lead me in the right direction. I was approached by a SD on insta, and he seems legitimate. What's a way of confirming this 100%? I've never done this before, and need some guidance.",
            "author": "PerformanceQuirky436",
            "id": "jai1hke",
            "parent_id": "t3_11dt68i",
            "score": 2,
            "created_utc": 1677687377.0,
            "replies": [
                {
                    "body": "The 100% confirmation comes when he hands you cash. Until then, there's no way to 100% confirm things are legit. There are ways to 100% confirm it's a scam, have you read our SCAMS thread in the sidebar -->\n\nThe fact that you've never done this before and yet want to point out that he \"seems legit\" already makes me assume he's a scam, because their whole schtick is to open by telling you reasons you should trust them and insisting that they're legit. Also because SD approaches on insta are overwhelmingly fake.\n\nIf you want a SD, go on a sugar website and find a legit SD. Not sure why a random approach on instascam is better than that. But if you want to pursue, start with the SCAMS thread.",
                    "author": "NoLimitLexa",
                    "id": "jai46or",
                    "parent_id": "t1_jai1hke",
                    "score": 2,
                    "created_utc": 1677688422.0,
                    "replies": [
                        {
                            "body": "Hi! I read the scams thread and he doesn't seem to hit any of the flags listed. Grammar is great, pictures match things on his profile, tattoos match, etc. He's not asked for money. We've talked for the last 2 days and I'm just uncertain. I'm concerned about being scammed. Asked if I'd add him on telegram. I know it's a texting app.",
                            "author": "PerformanceQuirky436",
                            "id": "jaiqlpf",
                            "parent_id": "t1_jai46or",
                            "score": 1,
                            "created_utc": 1677696903.0,
                            "replies": [
                                {
                                    "body": "I'll probably just report the profile and be done with it.",
                                    "author": "PerformanceQuirky436",
                                    "id": "jais18h",
                                    "parent_id": "t1_jaiqlpf",
                                    "score": 1,
                                    "created_utc": 1677697443.0,
                                    "replies": []
                                },
                                {
                                    "body": "u/NoLimitLexa has told you the one and only answer: there's no magical pre-confirmation.  When you two meet and he hands you cash, that's the confirmation that he's legit.  In the meantime, all you can do is look for red flags to exclude him.  \n\nCold approaching you on instagram is already a red flag.  If he's  looking for something online rather than meeting in person (are you two even in the same city?) then double red flag.",
                                    "author": "Azurecole",
                                    "id": "jaiu84n",
                                    "parent_id": "t1_jaiqlpf",
                                    "score": 1,
                                    "created_utc": 1677698279.0,
                                    "replies": [
                                        {
                                            "body": "Thank you both for your insight. I blocked and reported the profile. Something just feels off and I don't feel comfortable letting conversation continue. I appreciate everything!",
                                            "author": "PerformanceQuirky436",
                                            "id": "jaivfub",
                                            "parent_id": "t1_jaiu84n",
                                            "score": 1,
                                            "created_utc": 1677698743.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Can we start a petition for this to be a pinned post in the Wiki? \n\nSeriously though, this is solid advice that most SBs, unfortunately, learn the hard way. Myself included. But the points you’ve made are so valid +  vital to surviving as a SB, whether one’s in the bowl for 12 weeks or 12 years. Thank you as always for sharing! 🦋✨",
            "author": "curly_spice",
            "id": "jaapf6w",
            "parent_id": "t3_11dt68i",
            "score": 4,
            "created_utc": 1677549062.0,
            "replies": [
                {
                    "body": "Love you girlie ❤️ sometimes the easiest lessons to remember are the ones that were the hardest to learn",
                    "author": "HarvardLawSB",
                    "id": "jaaplcu",
                    "parent_id": "t1_jaapf6w",
                    "score": 3,
                    "created_utc": 1677549137.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your thoughts, forged from experience, are always comforting in how realistic they are (or I want them to be).  You help me keep hope for amazing things ahead!",
            "author": "Beginning_Pear_2231",
            "id": "jaao0oo",
            "parent_id": "t3_11dt68i",
            "score": 0,
            "created_utc": 1677548440.0,
            "replies": [
                {
                    "body": "Always love reading your thoughts here. Grateful that you enjoy mine as well!",
                    "author": "HarvardLawSB",
                    "id": "jaaod74",
                    "parent_id": "t1_jaao0oo",
                    "score": 2,
                    "created_utc": 1677548591.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great advice, from one who has been there and knows, well done!!:)",
            "author": "SDInLeather",
            "id": "jab73gs",
            "parent_id": "t3_11dt68i",
            "score": 1,
            "created_utc": 1677557287.0,
            "replies": [
                {
                    "body": "Thanks Leather!",
                    "author": "HarvardLawSB",
                    "id": "jafs68z",
                    "parent_id": "t1_jab73gs",
                    "score": 2,
                    "created_utc": 1677639215.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Balanced, thoughtful, informed, and intuitive. Well said.",
            "author": "1_charming",
            "id": "jabc9jo",
            "parent_id": "t3_11dt68i",
            "score": 1,
            "created_utc": 1677560115.0,
            "replies": [
                {
                    "body": "Appreciate your kind comment!",
                    "author": "HarvardLawSB",
                    "id": "jafs9ez",
                    "parent_id": "t1_jabc9jo",
                    "score": 1,
                    "created_utc": 1677639254.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly. Don’t feel shame in blocking people. A lot of those people are pieces of shit anyway.",
            "author": "UnearthlyDinosaur",
            "id": "jabdecl",
            "parent_id": "t3_11dt68i",
            "score": 1,
            "created_utc": 1677560782.0,
            "replies": []
        },
        {
            "body": "You speak the truth! I'll suggest these ideals can and should apply to all human interactions. Thanks for sharing. \n          Tapping that Save icon.",
            "author": "CaptBrewster",
            "id": "jabfnl6",
            "parent_id": "t3_11dt68i",
            "score": 1,
            "created_utc": 1677562172.0,
            "replies": [
                {
                    "body": "Absolutely! It was intended for SBs but it can definitely apply to all people :)",
                    "author": "HarvardLawSB",
                    "id": "jafsb02",
                    "parent_id": "t1_jabfnl6",
                    "score": 1,
                    "created_utc": 1677639274.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "💗💗💗 👏👏👏\n\nThank you for sharing. I agree 💯 \n\nI haven’t been a Sugar Baby as long, but I have been the wife of a Sugar Daddy and student of the sugar bowl for several years. And I’ve come to the same conclusions and operate in a similar way.",
            "author": "P0sitiveViibes777",
            "id": "jacrdoa",
            "parent_id": "t3_11dt68i",
            "score": 1,
            "created_utc": 1677595054.0,
            "replies": [
                {
                    "body": "And that's why we get along so well!",
                    "author": "HarvardLawSB",
                    "id": "jafsc3i",
                    "parent_id": "t1_jacrdoa",
                    "score": 1,
                    "created_utc": 1677639288.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I appreciate the thoughtful summary, always love hearing your perspectives so thanks for condensing it into a useful post! I’d recommend this to be pinned—super useful for new SBs!",
            "author": "throwawaysugargirlx",
            "id": "jadqcsr",
            "parent_id": "t3_11dt68i",
            "score": 1,
            "created_utc": 1677608730.0,
            "replies": [
                {
                    "body": "Aww!!! Thank you! I love that. So sweet of you to say",
                    "author": "HarvardLawSB",
                    "id": "jafsdbl",
                    "parent_id": "t1_jadqcsr",
                    "score": 1,
                    "created_utc": 1677639304.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Two years in the bowl for me and these are things I’ve tried to convey before when other women ask my advice, but the way you’ve put it is just beautiful. Cheers to you!",
            "author": "vinoweknow",
            "id": "jbh6izk",
            "parent_id": "t3_11dt68i",
            "score": 1,
            "created_utc": 1678322037.0,
            "replies": []
        },
        {
            "body": "Good life advice in general! Wholesome and wise.",
            "author": "Euphoric-Appeal9422",
            "id": "jcvwfn4",
            "parent_id": "t3_11dt68i",
            "score": 1,
            "created_utc": 1679268898.0,
            "replies": []
        },
        {
            "body": "I love this so much! If everyone only looked back and experienced gratitude vs regret, just think of how wonderful life would be!",
            "author": "HarvardLawSB",
            "id": "jaapang",
            "parent_id": "t1_jaap1qx",
            "score": 8,
            "created_utc": 1677549005.0,
            "replies": []
        },
        {
            "body": "❤️thank you for taking the time to comment. I will never reject a compliment hahaha",
            "author": "HarvardLawSB",
            "id": "jaardv6",
            "parent_id": "t1_jaar7qp",
            "score": 6,
            "created_utc": 1677549922.0,
            "replies": []
        },
        {
            "body": "🥰🥰🥰I love you!!!!!!!!!!!!!! Thank you thank you for being my biggest cheerleader",
            "author": "HarvardLawSB",
            "id": "jac9ob2",
            "parent_id": "t1_jabg4zf",
            "score": 6,
            "created_utc": 1677585711.0,
            "replies": []
        },
        {
            "body": "It goes quick when you have a couple SRs that were over 3 years :)",
            "author": "HarvardLawSB",
            "id": "jaaraz7",
            "parent_id": "t1_jaar4ll",
            "score": 10,
            "created_utc": 1677549887.0,
            "replies": [
                {
                    "body": "You have my admirations for waiting longer than a month in the bowl to offer advice. \n\nIYKYK",
                    "author": "BinghamtonSD",
                    "id": "jabdu9w",
                    "parent_id": "t1_jaaraz7",
                    "score": 8,
                    "created_utc": 1677561045.0,
                    "replies": []
                },
                {
                    "body": "I second this!",
                    "author": "spoilyou255",
                    "id": "jaayldn",
                    "parent_id": "t1_jaaraz7",
                    "score": 2,
                    "created_utc": 1677553144.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Time Flees in a great sugar relationship",
            "author": "pinotandsugar",
            "id": "jab6rb5",
            "parent_id": "t1_jaar4ll",
            "score": 1,
            "created_utc": 1677557111.0,
            "replies": []
        },
        {
            "body": "Hahaha well I’ll be going into UHNW estate planning, so definitely prefer to not be adversarial :P",
            "author": "HarvardLawSB",
            "id": "jac9h3k",
            "parent_id": "t1_jaatuvu",
            "score": 1,
            "created_utc": 1677585576.0,
            "replies": []
        },
        {
            "body": "Thank you so much! We can only try!",
            "author": "HarvardLawSB",
            "id": "jafs2pj",
            "parent_id": "t1_jablu7y",
            "score": 1,
            "created_utc": 1677639171.0,
            "replies": []
        },
        {
            "body": "Awww I love that people expect good things from me!",
            "author": "HarvardLawSB",
            "id": "jafs1gf",
            "parent_id": "t1_jab6oag",
            "score": 2,
            "created_utc": 1677639156.0,
            "replies": []
        },
        {
            "body": "<3 thank you for those very kind words. I think it's so so so important to be true to who you are. Life is so much easier when you don't try to fit your round self in a square hole.",
            "author": "HarvardLawSB",
            "id": "jafsj0m",
            "parent_id": "t1_jaepidl",
            "score": 2,
            "created_utc": 1677639375.0,
            "replies": []
        },
        {
            "body": "@OCbird22  @HavardLawSB \nAnother SD opinion on your “hold them tight”. I have had two SBs whe have played consistently important roles in my post-divorce life for at least a year or more. Funny enough, though both veered toward that GF-BF, this is a real relationship, end of the SR spectrum (and ofc not real like out in the open, meet the family), these two approached our SR like mirror opposites. The physical closeness and acceptance of one when the other chose to spend way more time together though not as “close”, for instance.  In neither case would it end because I just let the relationship drift away, since I value these women so highly. \n\nBut my main point is that as much as I would like to “hold them tight”, my interpretation of that phrase just doesn’t accord with what I see as the vast majority of SRs. These can end at any moment for reasons galore. A certain detachment, knowing there’s an expiration, can ironically lead to a strong connection, but a great SR is still, at best, a “temporary commitment”. I always read that the best way to extinguish the connection, particularly with a large age gap, is to be possessive, jealous, or “clingy”.   There are many ways to be “tight” I guess, and best to be mindful of which work and which risk not.",
            "author": "jacknjilled",
            "id": "jahxcyj",
            "parent_id": "t1_jaath5w",
            "score": 3,
            "created_utc": 1677685782.0,
            "replies": [
                {
                    "body": "No argument from me - I didn’t mean hold them tight as in “be clingy” - just that be aware that grass is always greener until you see it up close. And if you have a great thing going don’t  lapse on keeping the fire alive - I know it’s not a vanilla relationship or marriage - but still you need to put in some energy into it to make the other person feel valued. Just because money is in the equation doesn’t mean you let things slide and take them for granted. \n\nI still stand by my assertion that elite SBs - not just beautiful but also w good personality, reliability and values that sync up w yours - are a special kind and have many more options than people with money seem to think",
                    "author": "OCbird22",
                    "id": "jahyi2k",
                    "parent_id": "t1_jahxcyj",
                    "score": 1,
                    "created_utc": 1677686221.0,
                    "replies": [
                        {
                            "body": "100% agree with both your paragraphs. I am always so grateful to have these women in my life that I spend time trying to “keep it fresh”, and make sure they know I am not taking them for granted.  They are “out of my league” in certain ways, and are free to look “for better”, or whatever they want, which will change eventually. That’s the tension between commitment/tightness and detachment that I feel acutely, but manage.",
                            "author": "jacknjilled",
                            "id": "jai0cbo",
                            "parent_id": "t1_jahyi2k",
                            "score": 2,
                            "created_utc": 1677686935.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah I definitely think generosity is more than financial. Generosity is generous with time, with benefit of the doubt, with energy, with compassion, etc etc etc. While generosity with money is what we most associate with SDs, it’s not the most valuable thing they can bring to the table :)",
            "author": "HarvardLawSB",
            "id": "jac9ejv",
            "parent_id": "t1_jaath5w",
            "score": 3,
            "created_utc": 1677585527.0,
            "replies": []
        },
        {
            "body": "Hahahaha my love life reads like a bad biography: all the names are changed to protect the innocent :)",
            "author": "HarvardLawSB",
            "id": "jafs8pp",
            "parent_id": "t1_jab0ark",
            "score": 2,
            "created_utc": 1677639245.0,
            "replies": []
        },
        {
            "body": "Absolutely! Can’t punish one person for the sins of another! :)",
            "author": "HarvardLawSB",
            "id": "jac9lin",
            "parent_id": "t1_jabjwkj",
            "score": 2,
            "created_utc": 1677585658.0,
            "replies": []
        },
        {
            "body": "The 100% confirmation comes when he hands you cash. Until then, there's no way to 100% confirm things are legit. There are ways to 100% confirm it's a scam, have you read our SCAMS thread in the sidebar -->\n\nThe fact that you've never done this before and yet want to point out that he \"seems legit\" already makes me assume he's a scam, because their whole schtick is to open by telling you reasons you should trust them and insisting that they're legit. Also because SD approaches on insta are overwhelmingly fake.\n\nIf you want a SD, go on a sugar website and find a legit SD. Not sure why a random approach on instascam is better than that. But if you want to pursue, start with the SCAMS thread.",
            "author": "NoLimitLexa",
            "id": "jai46or",
            "parent_id": "t1_jai1hke",
            "score": 2,
            "created_utc": 1677688422.0,
            "replies": [
                {
                    "body": "Hi! I read the scams thread and he doesn't seem to hit any of the flags listed. Grammar is great, pictures match things on his profile, tattoos match, etc. He's not asked for money. We've talked for the last 2 days and I'm just uncertain. I'm concerned about being scammed. Asked if I'd add him on telegram. I know it's a texting app.",
                    "author": "PerformanceQuirky436",
                    "id": "jaiqlpf",
                    "parent_id": "t1_jai46or",
                    "score": 1,
                    "created_utc": 1677696903.0,
                    "replies": [
                        {
                            "body": "I'll probably just report the profile and be done with it.",
                            "author": "PerformanceQuirky436",
                            "id": "jais18h",
                            "parent_id": "t1_jaiqlpf",
                            "score": 1,
                            "created_utc": 1677697443.0,
                            "replies": []
                        },
                        {
                            "body": "u/NoLimitLexa has told you the one and only answer: there's no magical pre-confirmation.  When you two meet and he hands you cash, that's the confirmation that he's legit.  In the meantime, all you can do is look for red flags to exclude him.  \n\nCold approaching you on instagram is already a red flag.  If he's  looking for something online rather than meeting in person (are you two even in the same city?) then double red flag.",
                            "author": "Azurecole",
                            "id": "jaiu84n",
                            "parent_id": "t1_jaiqlpf",
                            "score": 1,
                            "created_utc": 1677698279.0,
                            "replies": [
                                {
                                    "body": "Thank you both for your insight. I blocked and reported the profile. Something just feels off and I don't feel comfortable letting conversation continue. I appreciate everything!",
                                    "author": "PerformanceQuirky436",
                                    "id": "jaivfub",
                                    "parent_id": "t1_jaiu84n",
                                    "score": 1,
                                    "created_utc": 1677698743.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Love you girlie ❤️ sometimes the easiest lessons to remember are the ones that were the hardest to learn",
            "author": "HarvardLawSB",
            "id": "jaaplcu",
            "parent_id": "t1_jaapf6w",
            "score": 3,
            "created_utc": 1677549137.0,
            "replies": []
        },
        {
            "body": "Always love reading your thoughts here. Grateful that you enjoy mine as well!",
            "author": "HarvardLawSB",
            "id": "jaaod74",
            "parent_id": "t1_jaao0oo",
            "score": 2,
            "created_utc": 1677548591.0,
            "replies": []
        },
        {
            "body": "Thanks Leather!",
            "author": "HarvardLawSB",
            "id": "jafs68z",
            "parent_id": "t1_jab73gs",
            "score": 2,
            "created_utc": 1677639215.0,
            "replies": []
        },
        {
            "body": "Appreciate your kind comment!",
            "author": "HarvardLawSB",
            "id": "jafs9ez",
            "parent_id": "t1_jabc9jo",
            "score": 1,
            "created_utc": 1677639254.0,
            "replies": []
        },
        {
            "body": "Absolutely! It was intended for SBs but it can definitely apply to all people :)",
            "author": "HarvardLawSB",
            "id": "jafsb02",
            "parent_id": "t1_jabfnl6",
            "score": 1,
            "created_utc": 1677639274.0,
            "replies": []
        },
        {
            "body": "And that's why we get along so well!",
            "author": "HarvardLawSB",
            "id": "jafsc3i",
            "parent_id": "t1_jacrdoa",
            "score": 1,
            "created_utc": 1677639288.0,
            "replies": []
        },
        {
            "body": "Aww!!! Thank you! I love that. So sweet of you to say",
            "author": "HarvardLawSB",
            "id": "jafsdbl",
            "parent_id": "t1_jadqcsr",
            "score": 1,
            "created_utc": 1677639304.0,
            "replies": []
        },
        {
            "body": "You have my admirations for waiting longer than a month in the bowl to offer advice. \n\nIYKYK",
            "author": "BinghamtonSD",
            "id": "jabdu9w",
            "parent_id": "t1_jaaraz7",
            "score": 8,
            "created_utc": 1677561045.0,
            "replies": []
        },
        {
            "body": "I second this!",
            "author": "spoilyou255",
            "id": "jaayldn",
            "parent_id": "t1_jaaraz7",
            "score": 2,
            "created_utc": 1677553144.0,
            "replies": []
        },
        {
            "body": "No argument from me - I didn’t mean hold them tight as in “be clingy” - just that be aware that grass is always greener until you see it up close. And if you have a great thing going don’t  lapse on keeping the fire alive - I know it’s not a vanilla relationship or marriage - but still you need to put in some energy into it to make the other person feel valued. Just because money is in the equation doesn’t mean you let things slide and take them for granted. \n\nI still stand by my assertion that elite SBs - not just beautiful but also w good personality, reliability and values that sync up w yours - are a special kind and have many more options than people with money seem to think",
            "author": "OCbird22",
            "id": "jahyi2k",
            "parent_id": "t1_jahxcyj",
            "score": 1,
            "created_utc": 1677686221.0,
            "replies": [
                {
                    "body": "100% agree with both your paragraphs. I am always so grateful to have these women in my life that I spend time trying to “keep it fresh”, and make sure they know I am not taking them for granted.  They are “out of my league” in certain ways, and are free to look “for better”, or whatever they want, which will change eventually. That’s the tension between commitment/tightness and detachment that I feel acutely, but manage.",
                    "author": "jacknjilled",
                    "id": "jai0cbo",
                    "parent_id": "t1_jahyi2k",
                    "score": 2,
                    "created_utc": 1677686935.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hi! I read the scams thread and he doesn't seem to hit any of the flags listed. Grammar is great, pictures match things on his profile, tattoos match, etc. He's not asked for money. We've talked for the last 2 days and I'm just uncertain. I'm concerned about being scammed. Asked if I'd add him on telegram. I know it's a texting app.",
            "author": "PerformanceQuirky436",
            "id": "jaiqlpf",
            "parent_id": "t1_jai46or",
            "score": 1,
            "created_utc": 1677696903.0,
            "replies": [
                {
                    "body": "I'll probably just report the profile and be done with it.",
                    "author": "PerformanceQuirky436",
                    "id": "jais18h",
                    "parent_id": "t1_jaiqlpf",
                    "score": 1,
                    "created_utc": 1677697443.0,
                    "replies": []
                },
                {
                    "body": "u/NoLimitLexa has told you the one and only answer: there's no magical pre-confirmation.  When you two meet and he hands you cash, that's the confirmation that he's legit.  In the meantime, all you can do is look for red flags to exclude him.  \n\nCold approaching you on instagram is already a red flag.  If he's  looking for something online rather than meeting in person (are you two even in the same city?) then double red flag.",
                    "author": "Azurecole",
                    "id": "jaiu84n",
                    "parent_id": "t1_jaiqlpf",
                    "score": 1,
                    "created_utc": 1677698279.0,
                    "replies": [
                        {
                            "body": "Thank you both for your insight. I blocked and reported the profile. Something just feels off and I don't feel comfortable letting conversation continue. I appreciate everything!",
                            "author": "PerformanceQuirky436",
                            "id": "jaivfub",
                            "parent_id": "t1_jaiu84n",
                            "score": 1,
                            "created_utc": 1677698743.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "100% agree with both your paragraphs. I am always so grateful to have these women in my life that I spend time trying to “keep it fresh”, and make sure they know I am not taking them for granted.  They are “out of my league” in certain ways, and are free to look “for better”, or whatever they want, which will change eventually. That’s the tension between commitment/tightness and detachment that I feel acutely, but manage.",
            "author": "jacknjilled",
            "id": "jai0cbo",
            "parent_id": "t1_jahyi2k",
            "score": 2,
            "created_utc": 1677686935.0,
            "replies": []
        },
        {
            "body": "I'll probably just report the profile and be done with it.",
            "author": "PerformanceQuirky436",
            "id": "jais18h",
            "parent_id": "t1_jaiqlpf",
            "score": 1,
            "created_utc": 1677697443.0,
            "replies": []
        },
        {
            "body": "u/NoLimitLexa has told you the one and only answer: there's no magical pre-confirmation.  When you two meet and he hands you cash, that's the confirmation that he's legit.  In the meantime, all you can do is look for red flags to exclude him.  \n\nCold approaching you on instagram is already a red flag.  If he's  looking for something online rather than meeting in person (are you two even in the same city?) then double red flag.",
            "author": "Azurecole",
            "id": "jaiu84n",
            "parent_id": "t1_jaiqlpf",
            "score": 1,
            "created_utc": 1677698279.0,
            "replies": [
                {
                    "body": "Thank you both for your insight. I blocked and reported the profile. Something just feels off and I don't feel comfortable letting conversation continue. I appreciate everything!",
                    "author": "PerformanceQuirky436",
                    "id": "jaivfub",
                    "parent_id": "t1_jaiu84n",
                    "score": 1,
                    "created_utc": 1677698743.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you both for your insight. I blocked and reported the profile. Something just feels off and I don't feel comfortable letting conversation continue. I appreciate everything!",
            "author": "PerformanceQuirky436",
            "id": "jaivfub",
            "parent_id": "t1_jaiu84n",
            "score": 1,
            "created_utc": 1677698743.0,
            "replies": []
        }
    ]
}