{
    "title": "Something I posted a couple of years ago… not your typical SD/SB story",
    "post_id": "nuykda",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/nuykda/something_i_posted_a_couple_of_years_ago_not_your/",
    "author": "SD_throwaway222",
    "body": "Today’s sad post got me thinking I should repost this; it’s been long enough that many new members to this forum wouldn’t have seen it, and reflecting on it now, there’s plenty for everyone… SBs/SDs, of course, but perhaps as well for those looking in who aren’t quite sure about this lifestyle, and that maybe it all feels a little fake, shallow, contrived, unbalanced. Pick your adjective. Anyway… here it is, unedited… I’ve even left it the EDIT I added last time. \n\nA warm cup of tea and/or a stiff drink goes well with this…\n\nWell…. the brief history leading up to this story is that after my wife and I separated, I joined SA… and I went on what has been described around here as “kid in a candy store” journey for over a year. It was great fun, and I guess I got it out of my system; everything I had missed out on in my 20s, and then some. And then I decided that it may be more meaningful to find one long-term SB, because I had no intention of pursuing a “real” relationship… and went on SA with that mindset. And that also went really well.\n\nI always look for university students; they’re generally serious, intelligent and are on the site usually with the same idea, which meshes perfectly with me: make some money to pay off debts by finding one serious and stable and compatible SD, while working hard and studying.\n\nI had two long-term SBs that were in their last years of school, so inevitably, once it was over, off they went… both of them to distant graduate schools. Each of those arrangements lasted about a year. And once the second SB was on her way, I went back on SA and found…\n\n… let’s call her Angie. Angie was young, beautiful, intelligent and ambitious with a wicked sense of humour. We got along so well at that first coffee meet… I’ll never forget it. And instantly and quickly fell into what anyone on both sides would probably call the ideal SD/SB relationship. Monthly amount agreed upon, set to be paid automatically, done. And she was usually home studying/working when not in class, and she lived alone so we’d visit at her place. Sometimes a few times a week, sometimes not for three weeks. Whatever worked.\n\nThis was all perfect, but I’ll mention now that one of the reasons that she was on SA to begin with was somewhat health-related. Nothing serious, but tests were being run; fatigue and work-load prevented her from getting a job. It would’ve been too much, and this made sense.\n\nBut as it turns out, the illness was more serious than it appeared at first. The dreaded C-word, but, caught early and with treatment it should be ok. That was tough, but she was a tough cookie. That was about 8 months after we’d met.\n\nAt some point during that, in a teary conversation, it was simply agreed upon that due to her developing fraility, the physical stuff would have to be scaled down. It was no longer fun or enjoyable for her, which of course made it no fun for me. Whatever. We can cuddle, we can cook, we can watch Netflix, we can talk. We can do everything except the most intimate stuff, and by this point I enjoyed her company so much that it was almost irrelevant. She was worried I’d walk away, but that was the last thing on my mind.\n\nThat went on for a year, but unfortunately her health did not improve. On the contrary. It saddened me deeply to watch the slow deterioration of this beautiful body, but her mind and soul remained intact.\n\nI’ll point out that from the beginning, as is usual, privacy and discretion were very important for her. And for me. I think everyone understands that, but in a situation like this, it would’ve been nice to have been part of her inner circle, if for no other reason than I genuinely cared, and wanted to be there for her in whatever way I could… but that’s complicated when there’s immediate family around, taking care of her. Which they should, of course, but it prevented me from being part of it. They didn’t have a clue about my existence, and we had rules about preventing that overlap. I know she’d told a few of her closest friends about me; she even asked me at some point if she could share a picture. No problem, I said, though I never knew with who.\n\nNear the end, she was hospitalized and at one point, I took a calculated risk and visited her at what I felt was an opportune time. And it worked out well; we had 30 minutes to ourselves, with her next visitor showing up coincidentally as I was leaving. I’ll never forget the look on her face when I appeared in that hospital. It’s one of the last memories I have of her, but also one of the most powerful. The genuine happiness. Let me tell you something, SBs and SDs alike; some things can’t be faked.\n\nI walked out of that hospital telling her I couldn’t wait for her to get home so we could see each other again. We both bluffed our way through that bullshit, because saying a proper goodbye would’ve been far too difficult. And what was there to say. It was all understood.\n\nShe died a couple of weeks later, and they held a huge memorial service for her on campus where it felt like 1,000 people showed up. I sat at the back, not knowing anyone, but recognized her family from pictures I’d seen. An endless stream of people shared words about what an incredibly fantastic and awesome person Angie had been, how the world had been robbed of such a lovely soul at such an early age.\n\nAfterwards, I sat there, deep in thought while everyone streamed out past me. I watched her family walk right by me and wondered what I could have said.\n\nEventually, I stood up to go and when I did, I was approached by some young lady I’d never seen before. She came up to me, and hugged me. A long, meaningful hug that lasted a good 20 seconds. Made me cry, of course. She was sobbing too. She didn’t say anything, just walked away.\n\nI found her later on Angie’s long list of Facebook friends; a first name I’d heard before. A close friend.\n\nAnyway, what’s the point of this… it’s to shed some light on what I consider the vast difference that a lot of people don’t get. If you think SB/SD relationships are no different than clicking on some escort website and having some random girl show up, whose name you’ll never know and who couldn’t care less about you… well, see above.\n\nWhile I’m sure a lot of men are on sites like SA trolling around for an escort experience with a girl who isn’t a pro, there are a lot who are looking for a more meaningful connection. And while there are SBs who are out to make a quick buck and not care about anything, there are those who are indeed looking for something meaningful. Or maybe they’re not, but they find it.\n\nI’ve been on my side trying to swim through a lot of muck on SA to find what I consider worthwhile. I have my horror stories. We all do. From the potentials SBs I’ve met, they have their stories too, and I’ve met the spectrum, running from drug-addicted hookers to… well, Angie. That’s a big spectrum to navigate, and perhaps there’s no real way to do it except by diving in.\n\nI’m not sure I have a lesson to teach here; I’m just relaying my experience which I think is meaningful to people on both sides of the equation. Quality exists on both sides and while it may not be easy to find, rest-assured — it’s out there somewhere.\n\nAll of this happened last year. I’ve been on SA since then, but it’s been a hollow experience. I know I just need to heal and get past it, and one day it’ll stop hurting. Until then, I’m abundantly clear that I was a SD (a good one) and I found a SB (a great one) and that’s what this was. But you know what, call it what you like. It was the greatest relationship of my life.\n\n \n\nEDIT: Thank you… for the gilding, but especially… I’m tremendously grateful to all of you who’ve responded, whether publicly or by reaching out privately. As many of you alluded to, it was indeed cathartic to write this because I’ve never had a chance to let it out. I haven’t really talked to anyone about it. The extent of it, last year, when I was really down, was something like “Hey, you ok?” “Yeah.” “Girl trouble, right?” “Yeah.”\n\nTo be able to write about it freely — among people who might understand… was incredibly liberating. It was very difficult to get it all down. There was a lot I wrote — many paragraphs — that were left on the cutting-room floor. Just too personal to post, but writing it and seeing what I wrote… part of the process.\n\nAnyway, having you all read this brings back to life our story, which till recently existed only with me. I’m genuinely touched by the responses, many of them evoking the sort of emotion I continue to feel. I appreciate you all helping me through this journey of healing, whether you meant to or not. You’re all awesome people.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/nuykda/something_i_posted_a_couple_of_years_ago_not_your/",
    "score": 201,
    "upvote_ratio": 0.98,
    "created_utc": 1623135342.0,
    "num_comments": 28,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "This post resonated with me.  Ive had my fun on sa but there was one girl who I had a deep connection with.  Due to her health issues we had sex twice in 8 months.  It was like being thrown in the deep end.  She was lucky they got her cervical cancer early.  Her endemetirosis was bad and she prob couldn't have kids\n\nThen she had loads of stuff happen in her personal life like friends stealing money from her and family members having health issues.\n\nIn that sense I was her support both financial and emotional.\n\nOne big reason why I left sa was I cant find that kind of connection and random sex bores me after one or two meets.\n\nIts hard find a connection like the op had..",
            "author": "wb19081908",
            "id": "h10gg8w",
            "parent_id": "t3_nuykda",
            "score": 26,
            "created_utc": 1623144118.0,
            "replies": []
        },
        {
            "body": "Thank you for sharing this. It gladdens my heart to know that there does still exist wonderful men out there, truly looking for a real connections \n\nI’m sorry that you had to lose Angie in such a way.",
            "author": "SassySugar4u",
            "id": "h10aezk",
            "parent_id": "t3_nuykda",
            "score": 12,
            "created_utc": 1623138266.0,
            "replies": []
        },
        {
            "body": "Well I definitely cried. Life is such a fragile short thing. \n\nIt sounds like you made her happy, and that means everything in this world.\n\nI'm sorry for your loss.",
            "author": "SM_TA",
            "id": "h10jf0b",
            "parent_id": "t3_nuykda",
            "score": 11,
            "created_utc": 1623149826.0,
            "replies": []
        },
        {
            "body": "Thanks for resharing this powerful story. I missed it the first time, so I am glad you reposted. I’m sorry for your loss. I’m very happy that one of her friends acknowledged you and your importance in her life. I know you were hurting tremendously at that time, and that hug will stick with you for ever.",
            "author": "photo-guy",
            "id": "h10eju3",
            "parent_id": "t3_nuykda",
            "score": 9,
            "created_utc": 1623142256.0,
            "replies": []
        },
        {
            "body": "I’m crying on the damn toilet right now. I am absolutely so sorry! Have you tried seeking out therapy? After my boyfriend died, I sought it out and it helped me understand my feelings.",
            "author": "depressedbananaslug",
            "id": "h10enr8",
            "parent_id": "t3_nuykda",
            "score": 7,
            "created_utc": 1623142365.0,
            "replies": []
        },
        {
            "body": "I read everything,I'm really really glad that you didn't walk away from her because \"it wasn't your problem\". That type of connection is not what you always find on SA, there's so much mud to go through before you get to a real genuine person.",
            "author": "ThrOW_AwYfor_ReDDIt",
            "id": "h10jas0",
            "parent_id": "t3_nuykda",
            "score": 8,
            "created_utc": 1623149695.0,
            "replies": []
        },
        {
            "body": "I had a similar experience as a SB my SD of almost two years developed cancer. It was his second time getting it in his lifetime. This time is spread malignantly and quickly. It was so hard watching him fade away right before me eyes. It was probably one of the hardest loses that I’ve ever faced. It’s been over a year since his passing and I still cry over him. If you need any to talk to who understand how tough it is I am here",
            "author": "bubblysweet23",
            "id": "h10mj48",
            "parent_id": "t3_nuykda",
            "score": 8,
            "created_utc": 1623152232.0,
            "replies": []
        },
        {
            "body": "Thank you for resharing your story, she sounds like a beautiful soul and you two met each other for a reason.",
            "author": "mraspencer",
            "id": "h10caux",
            "parent_id": "t3_nuykda",
            "score": 7,
            "created_utc": 1623140054.0,
            "replies": []
        },
        {
            "body": "Beautiful and touching story. Thank you for sharing. Angie was blessed to have you in her life.",
            "author": "SBstruggle",
            "id": "h10b0vx",
            "parent_id": "t3_nuykda",
            "score": 4,
            "created_utc": 1623138837.0,
            "replies": []
        },
        {
            "body": "I remember reading your story a bit ago. Unless there was an identical one. Not going to lie it pulled at my heartstrings then, and still does now. \n\nYou have my sympathy / empathy and condolences! \n\nBe well!",
            "author": "BigBearSD",
            "id": "h10suhg",
            "parent_id": "t3_nuykda",
            "score": 2,
            "created_utc": 1623156116.0,
            "replies": []
        },
        {
            "body": "I am sorry, I can't even imagine how hard it was/is for you. Maybe with time you can find another great relatioship!",
            "author": "paodequeijodoce",
            "id": "h10u8vo",
            "parent_id": "t3_nuykda",
            "score": 2,
            "created_utc": 1623156886.0,
            "replies": []
        },
        {
            "body": "Sorry for you loss, bro.\n\nAnd thank you for sharing that story with us.\n\nYou’re a good person, dude.",
            "author": "gameface202020",
            "id": "h10yhhy",
            "parent_id": "t3_nuykda",
            "score": 2,
            "created_utc": 1623159095.0,
            "replies": []
        },
        {
            "body": "Thank you so much for sharing. *Huge hugs* as you continue to heal.",
            "author": "Layla_Fox2",
            "id": "h111s12",
            "parent_id": "t3_nuykda",
            "score": 2,
            "created_utc": 1623160613.0,
            "replies": []
        },
        {
            "body": "Thank you for reposting this.   Your eloquent post shows this community that the sugar bowl can be something much more than I think what most view it as.  I also know that documenting your story and sharing it was very helpful to your grieving process.  Thank you for being there for her.  You showed her what a genuine loving relationship should look like-something she likely never experienced with a partner in her relatively short life.  I'm glad you got to see her before she passed.  I know exactly what you mean when you say some things cant be faked.  We are all on this earth for a relatively brief amount of time.  We each have the chance to choose how we spend it.  Be proud of the person you are and what you meant to her.  You're one of the very good people here. Yes, SA is very hollow these days but continue to be yourself and I'm sure you'll find someone who will make you happy again.",
            "author": "Mister_BossMan",
            "id": "h118jaj",
            "parent_id": "t3_nuykda",
            "score": 2,
            "created_utc": 1623163545.0,
            "replies": []
        },
        {
            "body": "Thank you so much for sharing this, I shed a tear, said a silent prayer for Angie and reached out to my SD and told him how much he means to me and how incredibly lucky I am to have him in my life.  \nExperiences like yours always remind me to tell the people we love how much joy they bring to our lives everyday.   \nI'm so sorry for your loss. x",
            "author": "Dublinliberty",
            "id": "h10zipy",
            "parent_id": "t3_nuykda",
            "score": 1,
            "created_utc": 1623159602.0,
            "replies": []
        },
        {
            "body": "That's such an incredible story, of course very sad too and I'm sorry for your loss, but it does give people hope that there are meaningful SRs out there to be had",
            "author": "potentialcarcrash",
            "id": "h10sdn4",
            "parent_id": "t3_nuykda",
            "score": 1,
            "created_utc": 1623155851.0,
            "replies": []
        },
        {
            "body": "Wow, this is deep. Sorry for your loss and thank you for sharing this, it really puts insight into what is possible.",
            "author": "pintodinosaur",
            "id": "h114892",
            "parent_id": "t3_nuykda",
            "score": 1,
            "created_utc": 1623161694.0,
            "replies": []
        },
        {
            "body": "Thank you for sharing, such a tender reminder to love the people in your life and make sure they know it, tomorrow isn't a guarantee.",
            "author": "RoderickGrimblyshoot",
            "id": "h119hr6",
            "parent_id": "t3_nuykda",
            "score": 1,
            "created_utc": 1623163950.0,
            "replies": []
        },
        {
            "body": "Thank you so much for being open and vulnerable enough to share in the first place. I didn’t get to read when you originally posted so I’m appreciative of the repost now. Reading this gave me chills, watery eyes, and a good reminder of the fragility of human life and importance of human connection.  I’m so sorry for your loss. I’m also so glad you were able to find something so meaningful. For both of you during that time, it sounds like your relationship was a bright light.",
            "author": "AndiAngelWW",
            "id": "h11dgme",
            "parent_id": "t3_nuykda",
            "score": 1,
            "created_utc": 1623165689.0,
            "replies": []
        },
        {
            "body": "Thank you for sharing your experience. So very sorry for your loss.",
            "author": "c2kink",
            "id": "h11nhrk",
            "parent_id": "t3_nuykda",
            "score": 1,
            "created_utc": 1623169922.0,
            "replies": []
        },
        {
            "body": "I'm not crying, it's rain.",
            "author": "Sonechko_K",
            "id": "h11yet9",
            "parent_id": "t3_nuykda",
            "score": 1,
            "created_utc": 1623174446.0,
            "replies": []
        },
        {
            "body": "Damn, it's onions. I had to say goodbye to someone like that before, and the years made the memories all that more dear and sweet. Some people bring great blessings into our lives that lessen the pain. Eventually the sorrow fades and the great memories overwhelm it. You will always have that smile. That is a solace in itself. Big hugs to you, internet stranger.",
            "author": "AnSteall",
            "id": "h121sw6",
            "parent_id": "t3_nuykda",
            "score": 1,
            "created_utc": 1623175868.0,
            "replies": []
        },
        {
            "body": "I’m sorry I’m not totally in the loop, but what’s the “C word”?",
            "author": "Wargasm69",
            "id": "h12qq3f",
            "parent_id": "t3_nuykda",
            "score": 1,
            "created_utc": 1623186553.0,
            "replies": [
                {
                    "body": "Cancer",
                    "author": "Cornycorgichick",
                    "id": "h1327i2",
                    "parent_id": "t1_h12qq3f",
                    "score": 1,
                    "created_utc": 1623191869.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Beautiful and sad story, and very noble behavior on your part. Very, very sorry for your loss. Good that you found this community to share it.  May you find happiness again.",
            "author": null,
            "id": "h12qzfj",
            "parent_id": "t3_nuykda",
            "score": 1,
            "created_utc": 1623186672.0,
            "replies": []
        },
        {
            "body": "Thank you for sharing this touching story.  Very well written, thoughtful and reflective. It gave me pause and helped me reflect upon the SRs I've had.  Many were beautiful, memorable and amazing times.  Some were hurtful, painful and difficult.  This particular SR of yours shares such a powerful reminder, that, at the end of the day, SB / SDs are two human beings connecting in some form or fashion, and once in a rare while, that connection is deeper and more meaningful than anyone could imagine.",
            "author": "jeffzeke",
            "id": "h134xcu",
            "parent_id": "t3_nuykda",
            "score": 1,
            "created_utc": 1623193194.0,
            "replies": []
        },
        {
            "body": "That's a very sad, but beautiful experience you both shared. Thanks for sharing with us. I continue to be amazed at the close relationships that are formed in the sugar world. Such a deep relationship. If I was a movie producer, I will make a movie of this moving story - with your permission, of course.",
            "author": "Monte_Sailor",
            "id": "h14cvpi",
            "parent_id": "t3_nuykda",
            "score": 1,
            "created_utc": 1623217083.0,
            "replies": []
        },
        {
            "body": "Why this made me cry? C’mon early morning! I wish I can find this kind of dadi. This just made me so emotional. We women want a genuine person to just care, respect, deep connection, and to understand  us no matter what circumstances are. Good luck to you dadi. All the best for you. Sending warm hugs😘",
            "author": "Ava-ilable-Issue-128",
            "id": "h3vxxdo",
            "parent_id": "t3_nuykda",
            "score": 1,
            "created_utc": 1625285010.0,
            "replies": []
        },
        {
            "body": "Cancer",
            "author": "Cornycorgichick",
            "id": "h1327i2",
            "parent_id": "t1_h12qq3f",
            "score": 1,
            "created_utc": 1623191869.0,
            "replies": []
        }
    ]
}