{
    "title": "Thankful ❤",
    "post_id": "k1s7ag",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/k1s7ag/thankful/",
    "author": "newbaby31188",
    "body": "My wonderful SD just called me to wish me a happy Thanksgiving, and to tell me what he is most thankful for this year, is me. He tells me I'm the sunshine in his life and how lucky he is, but I am the lucky one! I am beyond thankful for this man and I tell him all the time. The sugar life is so sweet friends! Happy Thanksgiving everyone :)",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/k1s7ag/thankful/",
    "score": 104,
    "upvote_ratio": 0.95,
    "created_utc": 1606442466.0,
    "num_comments": 33,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Awe that’s so sweet!! I’m jealous haha \nGlad you had a great turkey day :))",
            "author": "sweetXsubmissiveSB",
            "id": "gdratmm",
            "parent_id": "t3_k1s7ag",
            "score": 3,
            "created_utc": 1606478197.0,
            "replies": []
        },
        {
            "body": "Oh my, this is sooooo sweet! I love to hear these stories :)",
            "author": "red_Mercedez",
            "id": "gdrzugs",
            "parent_id": "t3_k1s7ag",
            "score": 2,
            "created_utc": 1606495125.0,
            "replies": []
        },
        {
            "body": "That’s so sweet! I got some lovely calls from my SDs and it certainly became the highlight of an otherwise socially isolated day.",
            "author": "LVSugarBebe",
            "id": "gdtavam",
            "parent_id": "t3_k1s7ag",
            "score": 2,
            "created_utc": 1606519622.0,
            "replies": []
        },
        {
            "body": "I did the same to my SB. I received a \"Happy Thanksgiving to you\" reply. Nothing else. No expression of thanks, or appreciation. I guess she just with her parents for the holiday, and does not have time? No, she just does not give a damn, considers me a necessary evil, and barely tolerates me. But unfortunately, I'm pathetic, and she is the best I can get.",
            "author": "docrolling",
            "id": "gdqbryc",
            "parent_id": "t3_k1s7ag",
            "score": 1,
            "created_utc": 1606447559.0,
            "replies": [
                {
                    "body": "Damn that's kinda dark.  I thought these situationships were supposed to be mutually beneficial. Hopefully the situation will improve for you.",
                    "author": "j-blaze17",
                    "id": "gdqcdi0",
                    "parent_id": "t1_gdqbryc",
                    "score": 19,
                    "created_utc": 1606447963.0,
                    "replies": [
                        {
                            "body": ">Hopefully the situation will improve for you.\n\nIf you want to keep that hope going, avoid going through their post history.",
                            "author": "GDarn",
                            "id": "gdqd76e",
                            "parent_id": "t1_gdqcdi0",
                            "score": 9,
                            "created_utc": 1606448532.0,
                            "replies": []
                        },
                        {
                            "body": "It's still beneficial. She does not openly express these opinions. She smiles. She laughs. She claims to cum a few times. She always was ready to meet. She almost always agrees to continue our time together for a meal, and often requests it, when sometimes I'm and unavailable. It is just not how the purists define an SR. Being old, fat, bald, and paralyzed makes me an unattractive human by most standards of any relationship that involves sexual interaction. For me it is similar to looking at steps where the view is best at the top. I know what is at the top. I have been at the top before. I cannot get there now. Does that mean that I do not get out? Does that mean that I do not look at the obstructed view because it is less than that which is available at the top? No. I suck it up. I understand and accept my limitations. I enjoy the obstructed, lesser view, because I accept that it is the best that I can get.",
                            "author": "docrolling",
                            "id": "gdqfjux",
                            "parent_id": "t1_gdqcdi0",
                            "score": 4,
                            "created_utc": 1606450138.0,
                            "replies": [
                                {
                                    "body": "I hate to say it but it’s your world view that makes it that way.   Look up Sean Stephenson, probably way worse off by your measures yet gets laid waaay more than most men.",
                                    "author": "adrewishprince",
                                    "id": "gdqykeh",
                                    "parent_id": "t1_gdqfjux",
                                    "score": 8,
                                    "created_utc": 1606465346.0,
                                    "replies": [
                                        {
                                            "body": "Thank you. I did look him up. I was not able to find any references to his sex life. I have a very negative opinion of motivational speakers. I'm far too arrogant to think that they can help me, considering that as a physician, I am trained more extensively and know more in general than they. As the admission to medical school is so competitive, it tends to weed out the mentally weak, the unintelligent, and the poorly educated. I consider those that seek advise from motivational speakers as weak, uneducated, and too easily manipulated. I'm unfamiliar with Kona University and it's admission standards & competitiveness.\n I went to psychotherapy after breaking my neck for depression, and with my wife to try to salvage our sex life/marriage. I found the therapists unintelligent, uneducated, poorly trained, and manipulative. Their goal was less to treat & heal, but to extend the therapy of a paying client who showed up to his/their appointments. I grew up with a mother who was a physician, who's specialty was psychiatry. I was constantly being analysed and evaluated. I learned her techniques, and how to be manipulative myself.\nMr. Stephenson was likely better off than I have been for the last 16 years, but less well off than I was for my first 35 years. I have little sensation below my neck. I have no bowel, bladder or ejaculatory function. I cannot wipe my own butt. I cannot dress myself. Once in bed I'm stuck there until a woman gets me up.",
                                            "author": "docrolling",
                                            "id": "gdr2vp2",
                                            "parent_id": "t1_gdqykeh",
                                            "score": -5,
                                            "created_utc": 1606469663.0,
                                            "replies": [
                                                {
                                                    "body": "Again your willingness is keeping you down.  I’ve been in your situation (regarding attitude)  I felt the same way about therapists but ultimately it  was my unwillingness to be open to change that kept me down.  Not that motivational speakers are more educated that you, but there is something to be learned from everyone. Your cognitive mind is well developed, I agree with that, consider developing emotional intelligence and I guarantee your life will change for the better.  But I can’t make you, it’s up to you if you want to seek a better life.",
                                                    "author": "adrewishprince",
                                                    "id": "gdr34h6",
                                                    "parent_id": "t1_gdr2vp2",
                                                    "score": 4,
                                                    "created_utc": 1606469918.0,
                                                    "replies": [
                                                        {
                                                            "body": "I must apologize for myself not understanding your terms. Would you please elaborate on \"willingness is keeping me down?\" Willingness for what? What am I down from. How is my attitude not realistic. I'm completely open and honest to my therapists. As I feel superior to them, I fail to see how hiding a truth from them can benefit myself. If anything, I reveal everything to show their ineptness. I disagree that there is something to be learned from everyone. I have too high an opinion of myself. I do not understand what \"emotional intelligence\" is. How is having that going to evoke emotion from my SB? Considering that I'm a quadriplegic, I think that my life is pretty good. Why do you think that my life is poor, that I should change what I'm doing to make it better?",
                                                            "author": "docrolling",
                                                            "id": "gdr5rga",
                                                            "parent_id": "t1_gdr34h6",
                                                            "score": -1,
                                                            "created_utc": 1606472751.0,
                                                            "replies": [
                                                                {
                                                                    "body": "To be blunt- willingness to drop your ego.  You will find an endless supply of joy when you learn how to do that.  Emotional intelligence is learning how to feel, not how to think. Forget your SB for a second, maybe I’m wrong but I get the impression you’re not happy by the way you talk.",
                                                                    "author": "adrewishprince",
                                                                    "id": "gdr60ln",
                                                                    "parent_id": "t1_gdr5rga",
                                                                    "score": 5,
                                                                    "created_utc": 1606473033.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "You are correct. I'm not happy. However how will dropping my ego make me happy? This thread started by me thanking my SB, and not receiving any acknowledgement in return. And by still adoring her, and accepting any attention she deems worthy to provide me because I understand how despicably pathetic I am as a quadriplegic. And as a fat, old, bald, married quadriplegic, in order for me to have a SB who is as attractive, fit, educated, and accomplished as mine is, that in return I must accept someone who is not attracted to me, and only tolerates me due to her financial needs.",
                                                                            "author": "docrolling",
                                                                            "id": "gdr6m4x",
                                                                            "parent_id": "t1_gdr60ln",
                                                                            "score": 1,
                                                                            "created_utc": 1606473699.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "It’s not something easily explained. Because it comes from the felt sense, it’s not easily explained in words or logic.   When I was in your situation I would have asked the same question about dropping my ego- so i get it.  All I can say is opening your mind to new ideas, experiences and listening to your felt sense may open up new avenues to joy you never experienced or thought possible before.  I know that’s probably not the answer you’re looking for but it’s the best way I can describe it.",
                                                                                    "author": "adrewishprince",
                                                                                    "id": "gdr6wrj",
                                                                                    "parent_id": "t1_gdr6m4x",
                                                                                    "score": 3,
                                                                                    "created_utc": 1606474027.0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "body": "psychological fact, people who are depressed and have negative thoughts are also more likely to be more accurate in their perceptions. \"happy people\" achieve their state of bliss partially by shading truth in their own favor and deceiving themselves about their negatives.\n\nnot sure which is better, but we don't get a choice about it.",
                                                                                    "author": "_steady_hand_",
                                                                                    "id": "gdrxfpv",
                                                                                    "parent_id": "t1_gdr6m4x",
                                                                                    "score": 0,
                                                                                    "created_utc": 1606493859.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "I am truly sorry for what you have been through, but your pessimism along with your... well, I’ll call it an assuredness that you’re better and smarter than everyone else... is most likely the reason you feel the way you do. I promise you that most of what you said isn’t true, and your education and medical license don’t mean you know everything. They means you’re an expert in one field. Try to open your mind and your heart to the unknown and consider not calling others weak and unintelligent for seeking help in ways you prefer not to. I’m sure you have a lot to offer, but your attitude is holding you back.",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "gdtz9jq",
                                                    "parent_id": "t1_gdr2vp2",
                                                    "score": 3,
                                                    "created_utc": 1606534782.0,
                                                    "replies": [
                                                        {
                                                            "body": "one thing my education, whether grade school, college, med school, residency, fellowship, and working daily, is that there are many people more intelligent, more knowledgeable, harder working, and more successful than I am. I do not presume to be smarter than everyone else. I do realize that I do not know everything, nor have I claimed that I do. Even in my field, I am mediocre at best. But this is to me all irrelevant to my discussion. \nHow is my pessimism holding me back? From what is it holding me back?\nHow would I benefit from not calling others weak and unintelligent? And I'm calling them that here in this post, not to their faces. I usually, but not always, refrain from exposing my disdain, and feelings of superiority towards others, unless their knowledge of my opinion of them is irrelevant to my life.  All of these posts in this thread arise from my experience with my SB. We are honest and open with each other. I respect her intellect, academic accomplishments, job, athletic accomplishments, and who she is. As my comments about her not expressing appreciation of me initiated this thread, please explain how me changing in the ways that you have suggested would alter the outcome of my SB expressing appreciation of me?",
                                                            "author": "docrolling",
                                                            "id": "gdu0vma",
                                                            "parent_id": "t1_gdtz9jq",
                                                            "score": 1,
                                                            "created_utc": 1606535866.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Honestly? No. I don’t feel like explaining anything to you after reading all of your other comments. I feel like it would be completely futile. I wish you luck.",
                                                                    "author": "FoxyFreckles1989",
                                                                    "id": "gdut1oy",
                                                                    "parent_id": "t1_gdu0vma",
                                                                    "score": 2,
                                                                    "created_utc": 1606558913.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">she just does not give a damn, considers me a necessary evil, and barely tolerates me. But unfortunately, I'm pathetic, and she is the best I can get.\n\nAnd here, boys and girls, is exactly the opposite of how a real sugar relationship should feel.\n\nHappy Thanksgiving,  everyone.",
                    "author": "GDarn",
                    "id": "gdqchiu",
                    "parent_id": "t1_gdqbryc",
                    "score": 17,
                    "created_utc": 1606448037.0,
                    "replies": [
                        {
                            "body": "Also has a debbie downer mindset.",
                            "author": null,
                            "id": "gdr0w7q",
                            "parent_id": "t1_gdqchiu",
                            "score": 5,
                            "created_utc": 1606467631.0,
                            "replies": [
                                {
                                    "body": "Yeah, I just looked at his history...*sigh*",
                                    "author": "bsbdfw",
                                    "id": "ge06hnd",
                                    "parent_id": "t1_gdr0w7q",
                                    "score": 2,
                                    "created_utc": 1606641532.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "If you need a sugar baby just to talk to. I got you. That’s unfortunate and especially during theses times where this year has been both the most separate but also unifying. I don’t think you deserve that and she may not deserve you but the end of the day you know what you’re thankful of and I’m sure there are many more you’re thankful for that you may not even realize it yet. But thank you for sharing.",
                    "author": "Sugar_Baby_Bry",
                    "id": "gdqm0n6",
                    "parent_id": "t1_gdqbryc",
                    "score": 5,
                    "created_utc": 1606454806.0,
                    "replies": [
                        {
                            "body": "My SR experiences have mostly been positive. I would not still be here if not. My SR experiences are so much more rewarding than seeing escorts. I like my SB. She is fit, athletic, educated, articulate, attractive, sexy, sensual, and hard working; both in her life away from me, and with me. She does not articulate her repulsion to my physique and disabilities. She and I have both expanded our boundaries with each other. We have fun, and communicate well. But I know she would much rather be having sex with a large African American, muscular Baltimore Police officer than with me, even if intercourse with him, may only last 3 min. I know because we talk. Her FWB, interracial, sexual interactions are new to her since her separation 11 months ago, from at > 10 year monogamous relationship, and she finds them very exciting. She is never mean or condescending to me, just honest. I ask. She reveals.",
                            "author": "docrolling",
                            "id": "gdqu06q",
                            "parent_id": "t1_gdqm0n6",
                            "score": 1,
                            "created_utc": 1606461237.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Happy Thanksgiving Dear, always something to be thankful for!",
                    "author": "EmmaSkyee",
                    "id": "gdr2c27",
                    "parent_id": "t1_gdqbryc",
                    "score": 2,
                    "created_utc": 1606469089.0,
                    "replies": []
                },
                {
                    "body": ">she is the best I can get.\n\nSays who? Why are you tolerating abysmal appreciation??",
                    "author": "bsbdfw",
                    "id": "gdqm78u",
                    "parent_id": "t1_gdqbryc",
                    "score": 0,
                    "created_utc": 1606454947.0,
                    "replies": [
                        {
                            "body": "(He can't afford better)",
                            "author": "strawberryadvil",
                            "id": "gdqzs21",
                            "parent_id": "t1_gdqm78u",
                            "score": 7,
                            "created_utc": 1606466538.0,
                            "replies": [
                                {
                                    "body": " Also most likely wouldn't give a woman in his league like him the time of day either. So idk what the complaining is about besides being sexist obviously.",
                                    "author": null,
                                    "id": "gdr1376",
                                    "parent_id": "t1_gdqzs21",
                                    "score": 5,
                                    "created_utc": 1606467825.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Says me. I know my life situation. I know my experience on SA, Tinder, Sugar Daddy Meet, Secret Benefits, Hinge, Bumble, OK Cupid, Hilly, Eros Guide, and Private Delights, etc. I know my experience with M&Gs, other dates, intimate dates, meals, drinks, walks at the park. Women who I find attractive, are educated enough, or not, do not want do be with me. I have had at least 3 SB's dump me after 1-3 intimate dates. 2 I know are seeing another fat, older, ethnic SD, who is the definition of a John. But he's not paralyzed. They do not have to lift him into bed, undress, and dress him. I know my limitations, and take what I can get. Afterwards I say thank you, and truly appreciate whatever these women have chosen to give me.",
                            "author": "docrolling",
                            "id": "gdqt4qa",
                            "parent_id": "t1_gdqm78u",
                            "score": 2,
                            "created_utc": 1606460476.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gdrhs0i",
                    "parent_id": "t1_gdqbryc",
                    "score": 0,
                    "created_utc": 1606483963.0,
                    "replies": [
                        {
                            "body": "I completely agree with you. Thank you. Finally some one on here understands. I know my situation. I understand its implications, and accept them. I'm disappointed, but that is my emotion, not my intellect. The motivation of my post was to make the point that you articulated with, obviously now, greater clarity than I was able to imply.",
                            "author": "docrolling",
                            "id": "gdtzaoj",
                            "parent_id": "t1_gdrhs0i",
                            "score": 1,
                            "created_utc": 1606534802.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Oh I'm so sorry.. that sounds awful.",
                    "author": "newbaby31188",
                    "id": "gdqgrxz",
                    "parent_id": "t1_gdqbryc",
                    "score": 0,
                    "created_utc": 1606450997.0,
                    "replies": []
                },
                {
                    "body": "I doubt she's the best you can get. I'm sorry you're experiencing this though. She should feel lucky that someone is helping her.",
                    "author": "red_ridinghood92",
                    "id": "gdsvipq",
                    "parent_id": "t1_gdqbryc",
                    "score": 1,
                    "created_utc": 1606510982.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is very sweet! I’m happy for y’all!",
            "author": "FoxyFreckles1989",
            "id": "gdtyt9f",
            "parent_id": "t3_k1s7ag",
            "score": 1,
            "created_utc": 1606534478.0,
            "replies": []
        },
        {
            "body": "Hello",
            "author": "Robertcram13",
            "id": "gdwdcaj",
            "parent_id": "t3_k1s7ag",
            "score": 1,
            "created_utc": 1606586396.0,
            "replies": []
        },
        {
            "body": "Damn that's kinda dark.  I thought these situationships were supposed to be mutually beneficial. Hopefully the situation will improve for you.",
            "author": "j-blaze17",
            "id": "gdqcdi0",
            "parent_id": "t1_gdqbryc",
            "score": 19,
            "created_utc": 1606447963.0,
            "replies": [
                {
                    "body": ">Hopefully the situation will improve for you.\n\nIf you want to keep that hope going, avoid going through their post history.",
                    "author": "GDarn",
                    "id": "gdqd76e",
                    "parent_id": "t1_gdqcdi0",
                    "score": 9,
                    "created_utc": 1606448532.0,
                    "replies": []
                },
                {
                    "body": "It's still beneficial. She does not openly express these opinions. She smiles. She laughs. She claims to cum a few times. She always was ready to meet. She almost always agrees to continue our time together for a meal, and often requests it, when sometimes I'm and unavailable. It is just not how the purists define an SR. Being old, fat, bald, and paralyzed makes me an unattractive human by most standards of any relationship that involves sexual interaction. For me it is similar to looking at steps where the view is best at the top. I know what is at the top. I have been at the top before. I cannot get there now. Does that mean that I do not get out? Does that mean that I do not look at the obstructed view because it is less than that which is available at the top? No. I suck it up. I understand and accept my limitations. I enjoy the obstructed, lesser view, because I accept that it is the best that I can get.",
                    "author": "docrolling",
                    "id": "gdqfjux",
                    "parent_id": "t1_gdqcdi0",
                    "score": 4,
                    "created_utc": 1606450138.0,
                    "replies": [
                        {
                            "body": "I hate to say it but it’s your world view that makes it that way.   Look up Sean Stephenson, probably way worse off by your measures yet gets laid waaay more than most men.",
                            "author": "adrewishprince",
                            "id": "gdqykeh",
                            "parent_id": "t1_gdqfjux",
                            "score": 8,
                            "created_utc": 1606465346.0,
                            "replies": [
                                {
                                    "body": "Thank you. I did look him up. I was not able to find any references to his sex life. I have a very negative opinion of motivational speakers. I'm far too arrogant to think that they can help me, considering that as a physician, I am trained more extensively and know more in general than they. As the admission to medical school is so competitive, it tends to weed out the mentally weak, the unintelligent, and the poorly educated. I consider those that seek advise from motivational speakers as weak, uneducated, and too easily manipulated. I'm unfamiliar with Kona University and it's admission standards & competitiveness.\n I went to psychotherapy after breaking my neck for depression, and with my wife to try to salvage our sex life/marriage. I found the therapists unintelligent, uneducated, poorly trained, and manipulative. Their goal was less to treat & heal, but to extend the therapy of a paying client who showed up to his/their appointments. I grew up with a mother who was a physician, who's specialty was psychiatry. I was constantly being analysed and evaluated. I learned her techniques, and how to be manipulative myself.\nMr. Stephenson was likely better off than I have been for the last 16 years, but less well off than I was for my first 35 years. I have little sensation below my neck. I have no bowel, bladder or ejaculatory function. I cannot wipe my own butt. I cannot dress myself. Once in bed I'm stuck there until a woman gets me up.",
                                    "author": "docrolling",
                                    "id": "gdr2vp2",
                                    "parent_id": "t1_gdqykeh",
                                    "score": -5,
                                    "created_utc": 1606469663.0,
                                    "replies": [
                                        {
                                            "body": "Again your willingness is keeping you down.  I’ve been in your situation (regarding attitude)  I felt the same way about therapists but ultimately it  was my unwillingness to be open to change that kept me down.  Not that motivational speakers are more educated that you, but there is something to be learned from everyone. Your cognitive mind is well developed, I agree with that, consider developing emotional intelligence and I guarantee your life will change for the better.  But I can’t make you, it’s up to you if you want to seek a better life.",
                                            "author": "adrewishprince",
                                            "id": "gdr34h6",
                                            "parent_id": "t1_gdr2vp2",
                                            "score": 4,
                                            "created_utc": 1606469918.0,
                                            "replies": [
                                                {
                                                    "body": "I must apologize for myself not understanding your terms. Would you please elaborate on \"willingness is keeping me down?\" Willingness for what? What am I down from. How is my attitude not realistic. I'm completely open and honest to my therapists. As I feel superior to them, I fail to see how hiding a truth from them can benefit myself. If anything, I reveal everything to show their ineptness. I disagree that there is something to be learned from everyone. I have too high an opinion of myself. I do not understand what \"emotional intelligence\" is. How is having that going to evoke emotion from my SB? Considering that I'm a quadriplegic, I think that my life is pretty good. Why do you think that my life is poor, that I should change what I'm doing to make it better?",
                                                    "author": "docrolling",
                                                    "id": "gdr5rga",
                                                    "parent_id": "t1_gdr34h6",
                                                    "score": -1,
                                                    "created_utc": 1606472751.0,
                                                    "replies": [
                                                        {
                                                            "body": "To be blunt- willingness to drop your ego.  You will find an endless supply of joy when you learn how to do that.  Emotional intelligence is learning how to feel, not how to think. Forget your SB for a second, maybe I’m wrong but I get the impression you’re not happy by the way you talk.",
                                                            "author": "adrewishprince",
                                                            "id": "gdr60ln",
                                                            "parent_id": "t1_gdr5rga",
                                                            "score": 5,
                                                            "created_utc": 1606473033.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You are correct. I'm not happy. However how will dropping my ego make me happy? This thread started by me thanking my SB, and not receiving any acknowledgement in return. And by still adoring her, and accepting any attention she deems worthy to provide me because I understand how despicably pathetic I am as a quadriplegic. And as a fat, old, bald, married quadriplegic, in order for me to have a SB who is as attractive, fit, educated, and accomplished as mine is, that in return I must accept someone who is not attracted to me, and only tolerates me due to her financial needs.",
                                                                    "author": "docrolling",
                                                                    "id": "gdr6m4x",
                                                                    "parent_id": "t1_gdr60ln",
                                                                    "score": 1,
                                                                    "created_utc": 1606473699.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "It’s not something easily explained. Because it comes from the felt sense, it’s not easily explained in words or logic.   When I was in your situation I would have asked the same question about dropping my ego- so i get it.  All I can say is opening your mind to new ideas, experiences and listening to your felt sense may open up new avenues to joy you never experienced or thought possible before.  I know that’s probably not the answer you’re looking for but it’s the best way I can describe it.",
                                                                            "author": "adrewishprince",
                                                                            "id": "gdr6wrj",
                                                                            "parent_id": "t1_gdr6m4x",
                                                                            "score": 3,
                                                                            "created_utc": 1606474027.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "psychological fact, people who are depressed and have negative thoughts are also more likely to be more accurate in their perceptions. \"happy people\" achieve their state of bliss partially by shading truth in their own favor and deceiving themselves about their negatives.\n\nnot sure which is better, but we don't get a choice about it.",
                                                                            "author": "_steady_hand_",
                                                                            "id": "gdrxfpv",
                                                                            "parent_id": "t1_gdr6m4x",
                                                                            "score": 0,
                                                                            "created_utc": 1606493859.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I am truly sorry for what you have been through, but your pessimism along with your... well, I’ll call it an assuredness that you’re better and smarter than everyone else... is most likely the reason you feel the way you do. I promise you that most of what you said isn’t true, and your education and medical license don’t mean you know everything. They means you’re an expert in one field. Try to open your mind and your heart to the unknown and consider not calling others weak and unintelligent for seeking help in ways you prefer not to. I’m sure you have a lot to offer, but your attitude is holding you back.",
                                            "author": "FoxyFreckles1989",
                                            "id": "gdtz9jq",
                                            "parent_id": "t1_gdr2vp2",
                                            "score": 3,
                                            "created_utc": 1606534782.0,
                                            "replies": [
                                                {
                                                    "body": "one thing my education, whether grade school, college, med school, residency, fellowship, and working daily, is that there are many people more intelligent, more knowledgeable, harder working, and more successful than I am. I do not presume to be smarter than everyone else. I do realize that I do not know everything, nor have I claimed that I do. Even in my field, I am mediocre at best. But this is to me all irrelevant to my discussion. \nHow is my pessimism holding me back? From what is it holding me back?\nHow would I benefit from not calling others weak and unintelligent? And I'm calling them that here in this post, not to their faces. I usually, but not always, refrain from exposing my disdain, and feelings of superiority towards others, unless their knowledge of my opinion of them is irrelevant to my life.  All of these posts in this thread arise from my experience with my SB. We are honest and open with each other. I respect her intellect, academic accomplishments, job, athletic accomplishments, and who she is. As my comments about her not expressing appreciation of me initiated this thread, please explain how me changing in the ways that you have suggested would alter the outcome of my SB expressing appreciation of me?",
                                                    "author": "docrolling",
                                                    "id": "gdu0vma",
                                                    "parent_id": "t1_gdtz9jq",
                                                    "score": 1,
                                                    "created_utc": 1606535866.0,
                                                    "replies": [
                                                        {
                                                            "body": "Honestly? No. I don’t feel like explaining anything to you after reading all of your other comments. I feel like it would be completely futile. I wish you luck.",
                                                            "author": "FoxyFreckles1989",
                                                            "id": "gdut1oy",
                                                            "parent_id": "t1_gdu0vma",
                                                            "score": 2,
                                                            "created_utc": 1606558913.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">she just does not give a damn, considers me a necessary evil, and barely tolerates me. But unfortunately, I'm pathetic, and she is the best I can get.\n\nAnd here, boys and girls, is exactly the opposite of how a real sugar relationship should feel.\n\nHappy Thanksgiving,  everyone.",
            "author": "GDarn",
            "id": "gdqchiu",
            "parent_id": "t1_gdqbryc",
            "score": 17,
            "created_utc": 1606448037.0,
            "replies": [
                {
                    "body": "Also has a debbie downer mindset.",
                    "author": null,
                    "id": "gdr0w7q",
                    "parent_id": "t1_gdqchiu",
                    "score": 5,
                    "created_utc": 1606467631.0,
                    "replies": [
                        {
                            "body": "Yeah, I just looked at his history...*sigh*",
                            "author": "bsbdfw",
                            "id": "ge06hnd",
                            "parent_id": "t1_gdr0w7q",
                            "score": 2,
                            "created_utc": 1606641532.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you need a sugar baby just to talk to. I got you. That’s unfortunate and especially during theses times where this year has been both the most separate but also unifying. I don’t think you deserve that and she may not deserve you but the end of the day you know what you’re thankful of and I’m sure there are many more you’re thankful for that you may not even realize it yet. But thank you for sharing.",
            "author": "Sugar_Baby_Bry",
            "id": "gdqm0n6",
            "parent_id": "t1_gdqbryc",
            "score": 5,
            "created_utc": 1606454806.0,
            "replies": [
                {
                    "body": "My SR experiences have mostly been positive. I would not still be here if not. My SR experiences are so much more rewarding than seeing escorts. I like my SB. She is fit, athletic, educated, articulate, attractive, sexy, sensual, and hard working; both in her life away from me, and with me. She does not articulate her repulsion to my physique and disabilities. She and I have both expanded our boundaries with each other. We have fun, and communicate well. But I know she would much rather be having sex with a large African American, muscular Baltimore Police officer than with me, even if intercourse with him, may only last 3 min. I know because we talk. Her FWB, interracial, sexual interactions are new to her since her separation 11 months ago, from at > 10 year monogamous relationship, and she finds them very exciting. She is never mean or condescending to me, just honest. I ask. She reveals.",
                    "author": "docrolling",
                    "id": "gdqu06q",
                    "parent_id": "t1_gdqm0n6",
                    "score": 1,
                    "created_utc": 1606461237.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Happy Thanksgiving Dear, always something to be thankful for!",
            "author": "EmmaSkyee",
            "id": "gdr2c27",
            "parent_id": "t1_gdqbryc",
            "score": 2,
            "created_utc": 1606469089.0,
            "replies": []
        },
        {
            "body": ">she is the best I can get.\n\nSays who? Why are you tolerating abysmal appreciation??",
            "author": "bsbdfw",
            "id": "gdqm78u",
            "parent_id": "t1_gdqbryc",
            "score": 0,
            "created_utc": 1606454947.0,
            "replies": [
                {
                    "body": "(He can't afford better)",
                    "author": "strawberryadvil",
                    "id": "gdqzs21",
                    "parent_id": "t1_gdqm78u",
                    "score": 7,
                    "created_utc": 1606466538.0,
                    "replies": [
                        {
                            "body": " Also most likely wouldn't give a woman in his league like him the time of day either. So idk what the complaining is about besides being sexist obviously.",
                            "author": null,
                            "id": "gdr1376",
                            "parent_id": "t1_gdqzs21",
                            "score": 5,
                            "created_utc": 1606467825.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Says me. I know my life situation. I know my experience on SA, Tinder, Sugar Daddy Meet, Secret Benefits, Hinge, Bumble, OK Cupid, Hilly, Eros Guide, and Private Delights, etc. I know my experience with M&Gs, other dates, intimate dates, meals, drinks, walks at the park. Women who I find attractive, are educated enough, or not, do not want do be with me. I have had at least 3 SB's dump me after 1-3 intimate dates. 2 I know are seeing another fat, older, ethnic SD, who is the definition of a John. But he's not paralyzed. They do not have to lift him into bed, undress, and dress him. I know my limitations, and take what I can get. Afterwards I say thank you, and truly appreciate whatever these women have chosen to give me.",
                    "author": "docrolling",
                    "id": "gdqt4qa",
                    "parent_id": "t1_gdqm78u",
                    "score": 2,
                    "created_utc": 1606460476.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gdrhs0i",
            "parent_id": "t1_gdqbryc",
            "score": 0,
            "created_utc": 1606483963.0,
            "replies": [
                {
                    "body": "I completely agree with you. Thank you. Finally some one on here understands. I know my situation. I understand its implications, and accept them. I'm disappointed, but that is my emotion, not my intellect. The motivation of my post was to make the point that you articulated with, obviously now, greater clarity than I was able to imply.",
                    "author": "docrolling",
                    "id": "gdtzaoj",
                    "parent_id": "t1_gdrhs0i",
                    "score": 1,
                    "created_utc": 1606534802.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh I'm so sorry.. that sounds awful.",
            "author": "newbaby31188",
            "id": "gdqgrxz",
            "parent_id": "t1_gdqbryc",
            "score": 0,
            "created_utc": 1606450997.0,
            "replies": []
        },
        {
            "body": "I doubt she's the best you can get. I'm sorry you're experiencing this though. She should feel lucky that someone is helping her.",
            "author": "red_ridinghood92",
            "id": "gdsvipq",
            "parent_id": "t1_gdqbryc",
            "score": 1,
            "created_utc": 1606510982.0,
            "replies": []
        },
        {
            "body": ">Hopefully the situation will improve for you.\n\nIf you want to keep that hope going, avoid going through their post history.",
            "author": "GDarn",
            "id": "gdqd76e",
            "parent_id": "t1_gdqcdi0",
            "score": 9,
            "created_utc": 1606448532.0,
            "replies": []
        },
        {
            "body": "It's still beneficial. She does not openly express these opinions. She smiles. She laughs. She claims to cum a few times. She always was ready to meet. She almost always agrees to continue our time together for a meal, and often requests it, when sometimes I'm and unavailable. It is just not how the purists define an SR. Being old, fat, bald, and paralyzed makes me an unattractive human by most standards of any relationship that involves sexual interaction. For me it is similar to looking at steps where the view is best at the top. I know what is at the top. I have been at the top before. I cannot get there now. Does that mean that I do not get out? Does that mean that I do not look at the obstructed view because it is less than that which is available at the top? No. I suck it up. I understand and accept my limitations. I enjoy the obstructed, lesser view, because I accept that it is the best that I can get.",
            "author": "docrolling",
            "id": "gdqfjux",
            "parent_id": "t1_gdqcdi0",
            "score": 4,
            "created_utc": 1606450138.0,
            "replies": [
                {
                    "body": "I hate to say it but it’s your world view that makes it that way.   Look up Sean Stephenson, probably way worse off by your measures yet gets laid waaay more than most men.",
                    "author": "adrewishprince",
                    "id": "gdqykeh",
                    "parent_id": "t1_gdqfjux",
                    "score": 8,
                    "created_utc": 1606465346.0,
                    "replies": [
                        {
                            "body": "Thank you. I did look him up. I was not able to find any references to his sex life. I have a very negative opinion of motivational speakers. I'm far too arrogant to think that they can help me, considering that as a physician, I am trained more extensively and know more in general than they. As the admission to medical school is so competitive, it tends to weed out the mentally weak, the unintelligent, and the poorly educated. I consider those that seek advise from motivational speakers as weak, uneducated, and too easily manipulated. I'm unfamiliar with Kona University and it's admission standards & competitiveness.\n I went to psychotherapy after breaking my neck for depression, and with my wife to try to salvage our sex life/marriage. I found the therapists unintelligent, uneducated, poorly trained, and manipulative. Their goal was less to treat & heal, but to extend the therapy of a paying client who showed up to his/their appointments. I grew up with a mother who was a physician, who's specialty was psychiatry. I was constantly being analysed and evaluated. I learned her techniques, and how to be manipulative myself.\nMr. Stephenson was likely better off than I have been for the last 16 years, but less well off than I was for my first 35 years. I have little sensation below my neck. I have no bowel, bladder or ejaculatory function. I cannot wipe my own butt. I cannot dress myself. Once in bed I'm stuck there until a woman gets me up.",
                            "author": "docrolling",
                            "id": "gdr2vp2",
                            "parent_id": "t1_gdqykeh",
                            "score": -5,
                            "created_utc": 1606469663.0,
                            "replies": [
                                {
                                    "body": "Again your willingness is keeping you down.  I’ve been in your situation (regarding attitude)  I felt the same way about therapists but ultimately it  was my unwillingness to be open to change that kept me down.  Not that motivational speakers are more educated that you, but there is something to be learned from everyone. Your cognitive mind is well developed, I agree with that, consider developing emotional intelligence and I guarantee your life will change for the better.  But I can’t make you, it’s up to you if you want to seek a better life.",
                                    "author": "adrewishprince",
                                    "id": "gdr34h6",
                                    "parent_id": "t1_gdr2vp2",
                                    "score": 4,
                                    "created_utc": 1606469918.0,
                                    "replies": [
                                        {
                                            "body": "I must apologize for myself not understanding your terms. Would you please elaborate on \"willingness is keeping me down?\" Willingness for what? What am I down from. How is my attitude not realistic. I'm completely open and honest to my therapists. As I feel superior to them, I fail to see how hiding a truth from them can benefit myself. If anything, I reveal everything to show their ineptness. I disagree that there is something to be learned from everyone. I have too high an opinion of myself. I do not understand what \"emotional intelligence\" is. How is having that going to evoke emotion from my SB? Considering that I'm a quadriplegic, I think that my life is pretty good. Why do you think that my life is poor, that I should change what I'm doing to make it better?",
                                            "author": "docrolling",
                                            "id": "gdr5rga",
                                            "parent_id": "t1_gdr34h6",
                                            "score": -1,
                                            "created_utc": 1606472751.0,
                                            "replies": [
                                                {
                                                    "body": "To be blunt- willingness to drop your ego.  You will find an endless supply of joy when you learn how to do that.  Emotional intelligence is learning how to feel, not how to think. Forget your SB for a second, maybe I’m wrong but I get the impression you’re not happy by the way you talk.",
                                                    "author": "adrewishprince",
                                                    "id": "gdr60ln",
                                                    "parent_id": "t1_gdr5rga",
                                                    "score": 5,
                                                    "created_utc": 1606473033.0,
                                                    "replies": [
                                                        {
                                                            "body": "You are correct. I'm not happy. However how will dropping my ego make me happy? This thread started by me thanking my SB, and not receiving any acknowledgement in return. And by still adoring her, and accepting any attention she deems worthy to provide me because I understand how despicably pathetic I am as a quadriplegic. And as a fat, old, bald, married quadriplegic, in order for me to have a SB who is as attractive, fit, educated, and accomplished as mine is, that in return I must accept someone who is not attracted to me, and only tolerates me due to her financial needs.",
                                                            "author": "docrolling",
                                                            "id": "gdr6m4x",
                                                            "parent_id": "t1_gdr60ln",
                                                            "score": 1,
                                                            "created_utc": 1606473699.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It’s not something easily explained. Because it comes from the felt sense, it’s not easily explained in words or logic.   When I was in your situation I would have asked the same question about dropping my ego- so i get it.  All I can say is opening your mind to new ideas, experiences and listening to your felt sense may open up new avenues to joy you never experienced or thought possible before.  I know that’s probably not the answer you’re looking for but it’s the best way I can describe it.",
                                                                    "author": "adrewishprince",
                                                                    "id": "gdr6wrj",
                                                                    "parent_id": "t1_gdr6m4x",
                                                                    "score": 3,
                                                                    "created_utc": 1606474027.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "psychological fact, people who are depressed and have negative thoughts are also more likely to be more accurate in their perceptions. \"happy people\" achieve their state of bliss partially by shading truth in their own favor and deceiving themselves about their negatives.\n\nnot sure which is better, but we don't get a choice about it.",
                                                                    "author": "_steady_hand_",
                                                                    "id": "gdrxfpv",
                                                                    "parent_id": "t1_gdr6m4x",
                                                                    "score": 0,
                                                                    "created_utc": 1606493859.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I am truly sorry for what you have been through, but your pessimism along with your... well, I’ll call it an assuredness that you’re better and smarter than everyone else... is most likely the reason you feel the way you do. I promise you that most of what you said isn’t true, and your education and medical license don’t mean you know everything. They means you’re an expert in one field. Try to open your mind and your heart to the unknown and consider not calling others weak and unintelligent for seeking help in ways you prefer not to. I’m sure you have a lot to offer, but your attitude is holding you back.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gdtz9jq",
                                    "parent_id": "t1_gdr2vp2",
                                    "score": 3,
                                    "created_utc": 1606534782.0,
                                    "replies": [
                                        {
                                            "body": "one thing my education, whether grade school, college, med school, residency, fellowship, and working daily, is that there are many people more intelligent, more knowledgeable, harder working, and more successful than I am. I do not presume to be smarter than everyone else. I do realize that I do not know everything, nor have I claimed that I do. Even in my field, I am mediocre at best. But this is to me all irrelevant to my discussion. \nHow is my pessimism holding me back? From what is it holding me back?\nHow would I benefit from not calling others weak and unintelligent? And I'm calling them that here in this post, not to their faces. I usually, but not always, refrain from exposing my disdain, and feelings of superiority towards others, unless their knowledge of my opinion of them is irrelevant to my life.  All of these posts in this thread arise from my experience with my SB. We are honest and open with each other. I respect her intellect, academic accomplishments, job, athletic accomplishments, and who she is. As my comments about her not expressing appreciation of me initiated this thread, please explain how me changing in the ways that you have suggested would alter the outcome of my SB expressing appreciation of me?",
                                            "author": "docrolling",
                                            "id": "gdu0vma",
                                            "parent_id": "t1_gdtz9jq",
                                            "score": 1,
                                            "created_utc": 1606535866.0,
                                            "replies": [
                                                {
                                                    "body": "Honestly? No. I don’t feel like explaining anything to you after reading all of your other comments. I feel like it would be completely futile. I wish you luck.",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "gdut1oy",
                                                    "parent_id": "t1_gdu0vma",
                                                    "score": 2,
                                                    "created_utc": 1606558913.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Also has a debbie downer mindset.",
            "author": null,
            "id": "gdr0w7q",
            "parent_id": "t1_gdqchiu",
            "score": 5,
            "created_utc": 1606467631.0,
            "replies": [
                {
                    "body": "Yeah, I just looked at his history...*sigh*",
                    "author": "bsbdfw",
                    "id": "ge06hnd",
                    "parent_id": "t1_gdr0w7q",
                    "score": 2,
                    "created_utc": 1606641532.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My SR experiences have mostly been positive. I would not still be here if not. My SR experiences are so much more rewarding than seeing escorts. I like my SB. She is fit, athletic, educated, articulate, attractive, sexy, sensual, and hard working; both in her life away from me, and with me. She does not articulate her repulsion to my physique and disabilities. She and I have both expanded our boundaries with each other. We have fun, and communicate well. But I know she would much rather be having sex with a large African American, muscular Baltimore Police officer than with me, even if intercourse with him, may only last 3 min. I know because we talk. Her FWB, interracial, sexual interactions are new to her since her separation 11 months ago, from at > 10 year monogamous relationship, and she finds them very exciting. She is never mean or condescending to me, just honest. I ask. She reveals.",
            "author": "docrolling",
            "id": "gdqu06q",
            "parent_id": "t1_gdqm0n6",
            "score": 1,
            "created_utc": 1606461237.0,
            "replies": []
        },
        {
            "body": "(He can't afford better)",
            "author": "strawberryadvil",
            "id": "gdqzs21",
            "parent_id": "t1_gdqm78u",
            "score": 7,
            "created_utc": 1606466538.0,
            "replies": [
                {
                    "body": " Also most likely wouldn't give a woman in his league like him the time of day either. So idk what the complaining is about besides being sexist obviously.",
                    "author": null,
                    "id": "gdr1376",
                    "parent_id": "t1_gdqzs21",
                    "score": 5,
                    "created_utc": 1606467825.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Says me. I know my life situation. I know my experience on SA, Tinder, Sugar Daddy Meet, Secret Benefits, Hinge, Bumble, OK Cupid, Hilly, Eros Guide, and Private Delights, etc. I know my experience with M&Gs, other dates, intimate dates, meals, drinks, walks at the park. Women who I find attractive, are educated enough, or not, do not want do be with me. I have had at least 3 SB's dump me after 1-3 intimate dates. 2 I know are seeing another fat, older, ethnic SD, who is the definition of a John. But he's not paralyzed. They do not have to lift him into bed, undress, and dress him. I know my limitations, and take what I can get. Afterwards I say thank you, and truly appreciate whatever these women have chosen to give me.",
            "author": "docrolling",
            "id": "gdqt4qa",
            "parent_id": "t1_gdqm78u",
            "score": 2,
            "created_utc": 1606460476.0,
            "replies": []
        },
        {
            "body": "I completely agree with you. Thank you. Finally some one on here understands. I know my situation. I understand its implications, and accept them. I'm disappointed, but that is my emotion, not my intellect. The motivation of my post was to make the point that you articulated with, obviously now, greater clarity than I was able to imply.",
            "author": "docrolling",
            "id": "gdtzaoj",
            "parent_id": "t1_gdrhs0i",
            "score": 1,
            "created_utc": 1606534802.0,
            "replies": []
        },
        {
            "body": "I hate to say it but it’s your world view that makes it that way.   Look up Sean Stephenson, probably way worse off by your measures yet gets laid waaay more than most men.",
            "author": "adrewishprince",
            "id": "gdqykeh",
            "parent_id": "t1_gdqfjux",
            "score": 8,
            "created_utc": 1606465346.0,
            "replies": [
                {
                    "body": "Thank you. I did look him up. I was not able to find any references to his sex life. I have a very negative opinion of motivational speakers. I'm far too arrogant to think that they can help me, considering that as a physician, I am trained more extensively and know more in general than they. As the admission to medical school is so competitive, it tends to weed out the mentally weak, the unintelligent, and the poorly educated. I consider those that seek advise from motivational speakers as weak, uneducated, and too easily manipulated. I'm unfamiliar with Kona University and it's admission standards & competitiveness.\n I went to psychotherapy after breaking my neck for depression, and with my wife to try to salvage our sex life/marriage. I found the therapists unintelligent, uneducated, poorly trained, and manipulative. Their goal was less to treat & heal, but to extend the therapy of a paying client who showed up to his/their appointments. I grew up with a mother who was a physician, who's specialty was psychiatry. I was constantly being analysed and evaluated. I learned her techniques, and how to be manipulative myself.\nMr. Stephenson was likely better off than I have been for the last 16 years, but less well off than I was for my first 35 years. I have little sensation below my neck. I have no bowel, bladder or ejaculatory function. I cannot wipe my own butt. I cannot dress myself. Once in bed I'm stuck there until a woman gets me up.",
                    "author": "docrolling",
                    "id": "gdr2vp2",
                    "parent_id": "t1_gdqykeh",
                    "score": -5,
                    "created_utc": 1606469663.0,
                    "replies": [
                        {
                            "body": "Again your willingness is keeping you down.  I’ve been in your situation (regarding attitude)  I felt the same way about therapists but ultimately it  was my unwillingness to be open to change that kept me down.  Not that motivational speakers are more educated that you, but there is something to be learned from everyone. Your cognitive mind is well developed, I agree with that, consider developing emotional intelligence and I guarantee your life will change for the better.  But I can’t make you, it’s up to you if you want to seek a better life.",
                            "author": "adrewishprince",
                            "id": "gdr34h6",
                            "parent_id": "t1_gdr2vp2",
                            "score": 4,
                            "created_utc": 1606469918.0,
                            "replies": [
                                {
                                    "body": "I must apologize for myself not understanding your terms. Would you please elaborate on \"willingness is keeping me down?\" Willingness for what? What am I down from. How is my attitude not realistic. I'm completely open and honest to my therapists. As I feel superior to them, I fail to see how hiding a truth from them can benefit myself. If anything, I reveal everything to show their ineptness. I disagree that there is something to be learned from everyone. I have too high an opinion of myself. I do not understand what \"emotional intelligence\" is. How is having that going to evoke emotion from my SB? Considering that I'm a quadriplegic, I think that my life is pretty good. Why do you think that my life is poor, that I should change what I'm doing to make it better?",
                                    "author": "docrolling",
                                    "id": "gdr5rga",
                                    "parent_id": "t1_gdr34h6",
                                    "score": -1,
                                    "created_utc": 1606472751.0,
                                    "replies": [
                                        {
                                            "body": "To be blunt- willingness to drop your ego.  You will find an endless supply of joy when you learn how to do that.  Emotional intelligence is learning how to feel, not how to think. Forget your SB for a second, maybe I’m wrong but I get the impression you’re not happy by the way you talk.",
                                            "author": "adrewishprince",
                                            "id": "gdr60ln",
                                            "parent_id": "t1_gdr5rga",
                                            "score": 5,
                                            "created_utc": 1606473033.0,
                                            "replies": [
                                                {
                                                    "body": "You are correct. I'm not happy. However how will dropping my ego make me happy? This thread started by me thanking my SB, and not receiving any acknowledgement in return. And by still adoring her, and accepting any attention she deems worthy to provide me because I understand how despicably pathetic I am as a quadriplegic. And as a fat, old, bald, married quadriplegic, in order for me to have a SB who is as attractive, fit, educated, and accomplished as mine is, that in return I must accept someone who is not attracted to me, and only tolerates me due to her financial needs.",
                                                    "author": "docrolling",
                                                    "id": "gdr6m4x",
                                                    "parent_id": "t1_gdr60ln",
                                                    "score": 1,
                                                    "created_utc": 1606473699.0,
                                                    "replies": [
                                                        {
                                                            "body": "It’s not something easily explained. Because it comes from the felt sense, it’s not easily explained in words or logic.   When I was in your situation I would have asked the same question about dropping my ego- so i get it.  All I can say is opening your mind to new ideas, experiences and listening to your felt sense may open up new avenues to joy you never experienced or thought possible before.  I know that’s probably not the answer you’re looking for but it’s the best way I can describe it.",
                                                            "author": "adrewishprince",
                                                            "id": "gdr6wrj",
                                                            "parent_id": "t1_gdr6m4x",
                                                            "score": 3,
                                                            "created_utc": 1606474027.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "psychological fact, people who are depressed and have negative thoughts are also more likely to be more accurate in their perceptions. \"happy people\" achieve their state of bliss partially by shading truth in their own favor and deceiving themselves about their negatives.\n\nnot sure which is better, but we don't get a choice about it.",
                                                            "author": "_steady_hand_",
                                                            "id": "gdrxfpv",
                                                            "parent_id": "t1_gdr6m4x",
                                                            "score": 0,
                                                            "created_utc": 1606493859.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I am truly sorry for what you have been through, but your pessimism along with your... well, I’ll call it an assuredness that you’re better and smarter than everyone else... is most likely the reason you feel the way you do. I promise you that most of what you said isn’t true, and your education and medical license don’t mean you know everything. They means you’re an expert in one field. Try to open your mind and your heart to the unknown and consider not calling others weak and unintelligent for seeking help in ways you prefer not to. I’m sure you have a lot to offer, but your attitude is holding you back.",
                            "author": "FoxyFreckles1989",
                            "id": "gdtz9jq",
                            "parent_id": "t1_gdr2vp2",
                            "score": 3,
                            "created_utc": 1606534782.0,
                            "replies": [
                                {
                                    "body": "one thing my education, whether grade school, college, med school, residency, fellowship, and working daily, is that there are many people more intelligent, more knowledgeable, harder working, and more successful than I am. I do not presume to be smarter than everyone else. I do realize that I do not know everything, nor have I claimed that I do. Even in my field, I am mediocre at best. But this is to me all irrelevant to my discussion. \nHow is my pessimism holding me back? From what is it holding me back?\nHow would I benefit from not calling others weak and unintelligent? And I'm calling them that here in this post, not to their faces. I usually, but not always, refrain from exposing my disdain, and feelings of superiority towards others, unless their knowledge of my opinion of them is irrelevant to my life.  All of these posts in this thread arise from my experience with my SB. We are honest and open with each other. I respect her intellect, academic accomplishments, job, athletic accomplishments, and who she is. As my comments about her not expressing appreciation of me initiated this thread, please explain how me changing in the ways that you have suggested would alter the outcome of my SB expressing appreciation of me?",
                                    "author": "docrolling",
                                    "id": "gdu0vma",
                                    "parent_id": "t1_gdtz9jq",
                                    "score": 1,
                                    "created_utc": 1606535866.0,
                                    "replies": [
                                        {
                                            "body": "Honestly? No. I don’t feel like explaining anything to you after reading all of your other comments. I feel like it would be completely futile. I wish you luck.",
                                            "author": "FoxyFreckles1989",
                                            "id": "gdut1oy",
                                            "parent_id": "t1_gdu0vma",
                                            "score": 2,
                                            "created_utc": 1606558913.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, I just looked at his history...*sigh*",
            "author": "bsbdfw",
            "id": "ge06hnd",
            "parent_id": "t1_gdr0w7q",
            "score": 2,
            "created_utc": 1606641532.0,
            "replies": []
        },
        {
            "body": " Also most likely wouldn't give a woman in his league like him the time of day either. So idk what the complaining is about besides being sexist obviously.",
            "author": null,
            "id": "gdr1376",
            "parent_id": "t1_gdqzs21",
            "score": 5,
            "created_utc": 1606467825.0,
            "replies": []
        },
        {
            "body": "Thank you. I did look him up. I was not able to find any references to his sex life. I have a very negative opinion of motivational speakers. I'm far too arrogant to think that they can help me, considering that as a physician, I am trained more extensively and know more in general than they. As the admission to medical school is so competitive, it tends to weed out the mentally weak, the unintelligent, and the poorly educated. I consider those that seek advise from motivational speakers as weak, uneducated, and too easily manipulated. I'm unfamiliar with Kona University and it's admission standards & competitiveness.\n I went to psychotherapy after breaking my neck for depression, and with my wife to try to salvage our sex life/marriage. I found the therapists unintelligent, uneducated, poorly trained, and manipulative. Their goal was less to treat & heal, but to extend the therapy of a paying client who showed up to his/their appointments. I grew up with a mother who was a physician, who's specialty was psychiatry. I was constantly being analysed and evaluated. I learned her techniques, and how to be manipulative myself.\nMr. Stephenson was likely better off than I have been for the last 16 years, but less well off than I was for my first 35 years. I have little sensation below my neck. I have no bowel, bladder or ejaculatory function. I cannot wipe my own butt. I cannot dress myself. Once in bed I'm stuck there until a woman gets me up.",
            "author": "docrolling",
            "id": "gdr2vp2",
            "parent_id": "t1_gdqykeh",
            "score": -5,
            "created_utc": 1606469663.0,
            "replies": [
                {
                    "body": "Again your willingness is keeping you down.  I’ve been in your situation (regarding attitude)  I felt the same way about therapists but ultimately it  was my unwillingness to be open to change that kept me down.  Not that motivational speakers are more educated that you, but there is something to be learned from everyone. Your cognitive mind is well developed, I agree with that, consider developing emotional intelligence and I guarantee your life will change for the better.  But I can’t make you, it’s up to you if you want to seek a better life.",
                    "author": "adrewishprince",
                    "id": "gdr34h6",
                    "parent_id": "t1_gdr2vp2",
                    "score": 4,
                    "created_utc": 1606469918.0,
                    "replies": [
                        {
                            "body": "I must apologize for myself not understanding your terms. Would you please elaborate on \"willingness is keeping me down?\" Willingness for what? What am I down from. How is my attitude not realistic. I'm completely open and honest to my therapists. As I feel superior to them, I fail to see how hiding a truth from them can benefit myself. If anything, I reveal everything to show their ineptness. I disagree that there is something to be learned from everyone. I have too high an opinion of myself. I do not understand what \"emotional intelligence\" is. How is having that going to evoke emotion from my SB? Considering that I'm a quadriplegic, I think that my life is pretty good. Why do you think that my life is poor, that I should change what I'm doing to make it better?",
                            "author": "docrolling",
                            "id": "gdr5rga",
                            "parent_id": "t1_gdr34h6",
                            "score": -1,
                            "created_utc": 1606472751.0,
                            "replies": [
                                {
                                    "body": "To be blunt- willingness to drop your ego.  You will find an endless supply of joy when you learn how to do that.  Emotional intelligence is learning how to feel, not how to think. Forget your SB for a second, maybe I’m wrong but I get the impression you’re not happy by the way you talk.",
                                    "author": "adrewishprince",
                                    "id": "gdr60ln",
                                    "parent_id": "t1_gdr5rga",
                                    "score": 5,
                                    "created_utc": 1606473033.0,
                                    "replies": [
                                        {
                                            "body": "You are correct. I'm not happy. However how will dropping my ego make me happy? This thread started by me thanking my SB, and not receiving any acknowledgement in return. And by still adoring her, and accepting any attention she deems worthy to provide me because I understand how despicably pathetic I am as a quadriplegic. And as a fat, old, bald, married quadriplegic, in order for me to have a SB who is as attractive, fit, educated, and accomplished as mine is, that in return I must accept someone who is not attracted to me, and only tolerates me due to her financial needs.",
                                            "author": "docrolling",
                                            "id": "gdr6m4x",
                                            "parent_id": "t1_gdr60ln",
                                            "score": 1,
                                            "created_utc": 1606473699.0,
                                            "replies": [
                                                {
                                                    "body": "It’s not something easily explained. Because it comes from the felt sense, it’s not easily explained in words or logic.   When I was in your situation I would have asked the same question about dropping my ego- so i get it.  All I can say is opening your mind to new ideas, experiences and listening to your felt sense may open up new avenues to joy you never experienced or thought possible before.  I know that’s probably not the answer you’re looking for but it’s the best way I can describe it.",
                                                    "author": "adrewishprince",
                                                    "id": "gdr6wrj",
                                                    "parent_id": "t1_gdr6m4x",
                                                    "score": 3,
                                                    "created_utc": 1606474027.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "psychological fact, people who are depressed and have negative thoughts are also more likely to be more accurate in their perceptions. \"happy people\" achieve their state of bliss partially by shading truth in their own favor and deceiving themselves about their negatives.\n\nnot sure which is better, but we don't get a choice about it.",
                                                    "author": "_steady_hand_",
                                                    "id": "gdrxfpv",
                                                    "parent_id": "t1_gdr6m4x",
                                                    "score": 0,
                                                    "created_utc": 1606493859.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I am truly sorry for what you have been through, but your pessimism along with your... well, I’ll call it an assuredness that you’re better and smarter than everyone else... is most likely the reason you feel the way you do. I promise you that most of what you said isn’t true, and your education and medical license don’t mean you know everything. They means you’re an expert in one field. Try to open your mind and your heart to the unknown and consider not calling others weak and unintelligent for seeking help in ways you prefer not to. I’m sure you have a lot to offer, but your attitude is holding you back.",
                    "author": "FoxyFreckles1989",
                    "id": "gdtz9jq",
                    "parent_id": "t1_gdr2vp2",
                    "score": 3,
                    "created_utc": 1606534782.0,
                    "replies": [
                        {
                            "body": "one thing my education, whether grade school, college, med school, residency, fellowship, and working daily, is that there are many people more intelligent, more knowledgeable, harder working, and more successful than I am. I do not presume to be smarter than everyone else. I do realize that I do not know everything, nor have I claimed that I do. Even in my field, I am mediocre at best. But this is to me all irrelevant to my discussion. \nHow is my pessimism holding me back? From what is it holding me back?\nHow would I benefit from not calling others weak and unintelligent? And I'm calling them that here in this post, not to their faces. I usually, but not always, refrain from exposing my disdain, and feelings of superiority towards others, unless their knowledge of my opinion of them is irrelevant to my life.  All of these posts in this thread arise from my experience with my SB. We are honest and open with each other. I respect her intellect, academic accomplishments, job, athletic accomplishments, and who she is. As my comments about her not expressing appreciation of me initiated this thread, please explain how me changing in the ways that you have suggested would alter the outcome of my SB expressing appreciation of me?",
                            "author": "docrolling",
                            "id": "gdu0vma",
                            "parent_id": "t1_gdtz9jq",
                            "score": 1,
                            "created_utc": 1606535866.0,
                            "replies": [
                                {
                                    "body": "Honestly? No. I don’t feel like explaining anything to you after reading all of your other comments. I feel like it would be completely futile. I wish you luck.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gdut1oy",
                                    "parent_id": "t1_gdu0vma",
                                    "score": 2,
                                    "created_utc": 1606558913.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Again your willingness is keeping you down.  I’ve been in your situation (regarding attitude)  I felt the same way about therapists but ultimately it  was my unwillingness to be open to change that kept me down.  Not that motivational speakers are more educated that you, but there is something to be learned from everyone. Your cognitive mind is well developed, I agree with that, consider developing emotional intelligence and I guarantee your life will change for the better.  But I can’t make you, it’s up to you if you want to seek a better life.",
            "author": "adrewishprince",
            "id": "gdr34h6",
            "parent_id": "t1_gdr2vp2",
            "score": 4,
            "created_utc": 1606469918.0,
            "replies": [
                {
                    "body": "I must apologize for myself not understanding your terms. Would you please elaborate on \"willingness is keeping me down?\" Willingness for what? What am I down from. How is my attitude not realistic. I'm completely open and honest to my therapists. As I feel superior to them, I fail to see how hiding a truth from them can benefit myself. If anything, I reveal everything to show their ineptness. I disagree that there is something to be learned from everyone. I have too high an opinion of myself. I do not understand what \"emotional intelligence\" is. How is having that going to evoke emotion from my SB? Considering that I'm a quadriplegic, I think that my life is pretty good. Why do you think that my life is poor, that I should change what I'm doing to make it better?",
                    "author": "docrolling",
                    "id": "gdr5rga",
                    "parent_id": "t1_gdr34h6",
                    "score": -1,
                    "created_utc": 1606472751.0,
                    "replies": [
                        {
                            "body": "To be blunt- willingness to drop your ego.  You will find an endless supply of joy when you learn how to do that.  Emotional intelligence is learning how to feel, not how to think. Forget your SB for a second, maybe I’m wrong but I get the impression you’re not happy by the way you talk.",
                            "author": "adrewishprince",
                            "id": "gdr60ln",
                            "parent_id": "t1_gdr5rga",
                            "score": 5,
                            "created_utc": 1606473033.0,
                            "replies": [
                                {
                                    "body": "You are correct. I'm not happy. However how will dropping my ego make me happy? This thread started by me thanking my SB, and not receiving any acknowledgement in return. And by still adoring her, and accepting any attention she deems worthy to provide me because I understand how despicably pathetic I am as a quadriplegic. And as a fat, old, bald, married quadriplegic, in order for me to have a SB who is as attractive, fit, educated, and accomplished as mine is, that in return I must accept someone who is not attracted to me, and only tolerates me due to her financial needs.",
                                    "author": "docrolling",
                                    "id": "gdr6m4x",
                                    "parent_id": "t1_gdr60ln",
                                    "score": 1,
                                    "created_utc": 1606473699.0,
                                    "replies": [
                                        {
                                            "body": "It’s not something easily explained. Because it comes from the felt sense, it’s not easily explained in words or logic.   When I was in your situation I would have asked the same question about dropping my ego- so i get it.  All I can say is opening your mind to new ideas, experiences and listening to your felt sense may open up new avenues to joy you never experienced or thought possible before.  I know that’s probably not the answer you’re looking for but it’s the best way I can describe it.",
                                            "author": "adrewishprince",
                                            "id": "gdr6wrj",
                                            "parent_id": "t1_gdr6m4x",
                                            "score": 3,
                                            "created_utc": 1606474027.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "psychological fact, people who are depressed and have negative thoughts are also more likely to be more accurate in their perceptions. \"happy people\" achieve their state of bliss partially by shading truth in their own favor and deceiving themselves about their negatives.\n\nnot sure which is better, but we don't get a choice about it.",
                                            "author": "_steady_hand_",
                                            "id": "gdrxfpv",
                                            "parent_id": "t1_gdr6m4x",
                                            "score": 0,
                                            "created_utc": 1606493859.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am truly sorry for what you have been through, but your pessimism along with your... well, I’ll call it an assuredness that you’re better and smarter than everyone else... is most likely the reason you feel the way you do. I promise you that most of what you said isn’t true, and your education and medical license don’t mean you know everything. They means you’re an expert in one field. Try to open your mind and your heart to the unknown and consider not calling others weak and unintelligent for seeking help in ways you prefer not to. I’m sure you have a lot to offer, but your attitude is holding you back.",
            "author": "FoxyFreckles1989",
            "id": "gdtz9jq",
            "parent_id": "t1_gdr2vp2",
            "score": 3,
            "created_utc": 1606534782.0,
            "replies": [
                {
                    "body": "one thing my education, whether grade school, college, med school, residency, fellowship, and working daily, is that there are many people more intelligent, more knowledgeable, harder working, and more successful than I am. I do not presume to be smarter than everyone else. I do realize that I do not know everything, nor have I claimed that I do. Even in my field, I am mediocre at best. But this is to me all irrelevant to my discussion. \nHow is my pessimism holding me back? From what is it holding me back?\nHow would I benefit from not calling others weak and unintelligent? And I'm calling them that here in this post, not to their faces. I usually, but not always, refrain from exposing my disdain, and feelings of superiority towards others, unless their knowledge of my opinion of them is irrelevant to my life.  All of these posts in this thread arise from my experience with my SB. We are honest and open with each other. I respect her intellect, academic accomplishments, job, athletic accomplishments, and who she is. As my comments about her not expressing appreciation of me initiated this thread, please explain how me changing in the ways that you have suggested would alter the outcome of my SB expressing appreciation of me?",
                    "author": "docrolling",
                    "id": "gdu0vma",
                    "parent_id": "t1_gdtz9jq",
                    "score": 1,
                    "created_utc": 1606535866.0,
                    "replies": [
                        {
                            "body": "Honestly? No. I don’t feel like explaining anything to you after reading all of your other comments. I feel like it would be completely futile. I wish you luck.",
                            "author": "FoxyFreckles1989",
                            "id": "gdut1oy",
                            "parent_id": "t1_gdu0vma",
                            "score": 2,
                            "created_utc": 1606558913.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I must apologize for myself not understanding your terms. Would you please elaborate on \"willingness is keeping me down?\" Willingness for what? What am I down from. How is my attitude not realistic. I'm completely open and honest to my therapists. As I feel superior to them, I fail to see how hiding a truth from them can benefit myself. If anything, I reveal everything to show their ineptness. I disagree that there is something to be learned from everyone. I have too high an opinion of myself. I do not understand what \"emotional intelligence\" is. How is having that going to evoke emotion from my SB? Considering that I'm a quadriplegic, I think that my life is pretty good. Why do you think that my life is poor, that I should change what I'm doing to make it better?",
            "author": "docrolling",
            "id": "gdr5rga",
            "parent_id": "t1_gdr34h6",
            "score": -1,
            "created_utc": 1606472751.0,
            "replies": [
                {
                    "body": "To be blunt- willingness to drop your ego.  You will find an endless supply of joy when you learn how to do that.  Emotional intelligence is learning how to feel, not how to think. Forget your SB for a second, maybe I’m wrong but I get the impression you’re not happy by the way you talk.",
                    "author": "adrewishprince",
                    "id": "gdr60ln",
                    "parent_id": "t1_gdr5rga",
                    "score": 5,
                    "created_utc": 1606473033.0,
                    "replies": [
                        {
                            "body": "You are correct. I'm not happy. However how will dropping my ego make me happy? This thread started by me thanking my SB, and not receiving any acknowledgement in return. And by still adoring her, and accepting any attention she deems worthy to provide me because I understand how despicably pathetic I am as a quadriplegic. And as a fat, old, bald, married quadriplegic, in order for me to have a SB who is as attractive, fit, educated, and accomplished as mine is, that in return I must accept someone who is not attracted to me, and only tolerates me due to her financial needs.",
                            "author": "docrolling",
                            "id": "gdr6m4x",
                            "parent_id": "t1_gdr60ln",
                            "score": 1,
                            "created_utc": 1606473699.0,
                            "replies": [
                                {
                                    "body": "It’s not something easily explained. Because it comes from the felt sense, it’s not easily explained in words or logic.   When I was in your situation I would have asked the same question about dropping my ego- so i get it.  All I can say is opening your mind to new ideas, experiences and listening to your felt sense may open up new avenues to joy you never experienced or thought possible before.  I know that’s probably not the answer you’re looking for but it’s the best way I can describe it.",
                                    "author": "adrewishprince",
                                    "id": "gdr6wrj",
                                    "parent_id": "t1_gdr6m4x",
                                    "score": 3,
                                    "created_utc": 1606474027.0,
                                    "replies": []
                                },
                                {
                                    "body": "psychological fact, people who are depressed and have negative thoughts are also more likely to be more accurate in their perceptions. \"happy people\" achieve their state of bliss partially by shading truth in their own favor and deceiving themselves about their negatives.\n\nnot sure which is better, but we don't get a choice about it.",
                                    "author": "_steady_hand_",
                                    "id": "gdrxfpv",
                                    "parent_id": "t1_gdr6m4x",
                                    "score": 0,
                                    "created_utc": 1606493859.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "one thing my education, whether grade school, college, med school, residency, fellowship, and working daily, is that there are many people more intelligent, more knowledgeable, harder working, and more successful than I am. I do not presume to be smarter than everyone else. I do realize that I do not know everything, nor have I claimed that I do. Even in my field, I am mediocre at best. But this is to me all irrelevant to my discussion. \nHow is my pessimism holding me back? From what is it holding me back?\nHow would I benefit from not calling others weak and unintelligent? And I'm calling them that here in this post, not to their faces. I usually, but not always, refrain from exposing my disdain, and feelings of superiority towards others, unless their knowledge of my opinion of them is irrelevant to my life.  All of these posts in this thread arise from my experience with my SB. We are honest and open with each other. I respect her intellect, academic accomplishments, job, athletic accomplishments, and who she is. As my comments about her not expressing appreciation of me initiated this thread, please explain how me changing in the ways that you have suggested would alter the outcome of my SB expressing appreciation of me?",
            "author": "docrolling",
            "id": "gdu0vma",
            "parent_id": "t1_gdtz9jq",
            "score": 1,
            "created_utc": 1606535866.0,
            "replies": [
                {
                    "body": "Honestly? No. I don’t feel like explaining anything to you after reading all of your other comments. I feel like it would be completely futile. I wish you luck.",
                    "author": "FoxyFreckles1989",
                    "id": "gdut1oy",
                    "parent_id": "t1_gdu0vma",
                    "score": 2,
                    "created_utc": 1606558913.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "To be blunt- willingness to drop your ego.  You will find an endless supply of joy when you learn how to do that.  Emotional intelligence is learning how to feel, not how to think. Forget your SB for a second, maybe I’m wrong but I get the impression you’re not happy by the way you talk.",
            "author": "adrewishprince",
            "id": "gdr60ln",
            "parent_id": "t1_gdr5rga",
            "score": 5,
            "created_utc": 1606473033.0,
            "replies": [
                {
                    "body": "You are correct. I'm not happy. However how will dropping my ego make me happy? This thread started by me thanking my SB, and not receiving any acknowledgement in return. And by still adoring her, and accepting any attention she deems worthy to provide me because I understand how despicably pathetic I am as a quadriplegic. And as a fat, old, bald, married quadriplegic, in order for me to have a SB who is as attractive, fit, educated, and accomplished as mine is, that in return I must accept someone who is not attracted to me, and only tolerates me due to her financial needs.",
                    "author": "docrolling",
                    "id": "gdr6m4x",
                    "parent_id": "t1_gdr60ln",
                    "score": 1,
                    "created_utc": 1606473699.0,
                    "replies": [
                        {
                            "body": "It’s not something easily explained. Because it comes from the felt sense, it’s not easily explained in words or logic.   When I was in your situation I would have asked the same question about dropping my ego- so i get it.  All I can say is opening your mind to new ideas, experiences and listening to your felt sense may open up new avenues to joy you never experienced or thought possible before.  I know that’s probably not the answer you’re looking for but it’s the best way I can describe it.",
                            "author": "adrewishprince",
                            "id": "gdr6wrj",
                            "parent_id": "t1_gdr6m4x",
                            "score": 3,
                            "created_utc": 1606474027.0,
                            "replies": []
                        },
                        {
                            "body": "psychological fact, people who are depressed and have negative thoughts are also more likely to be more accurate in their perceptions. \"happy people\" achieve their state of bliss partially by shading truth in their own favor and deceiving themselves about their negatives.\n\nnot sure which is better, but we don't get a choice about it.",
                            "author": "_steady_hand_",
                            "id": "gdrxfpv",
                            "parent_id": "t1_gdr6m4x",
                            "score": 0,
                            "created_utc": 1606493859.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly? No. I don’t feel like explaining anything to you after reading all of your other comments. I feel like it would be completely futile. I wish you luck.",
            "author": "FoxyFreckles1989",
            "id": "gdut1oy",
            "parent_id": "t1_gdu0vma",
            "score": 2,
            "created_utc": 1606558913.0,
            "replies": []
        },
        {
            "body": "You are correct. I'm not happy. However how will dropping my ego make me happy? This thread started by me thanking my SB, and not receiving any acknowledgement in return. And by still adoring her, and accepting any attention she deems worthy to provide me because I understand how despicably pathetic I am as a quadriplegic. And as a fat, old, bald, married quadriplegic, in order for me to have a SB who is as attractive, fit, educated, and accomplished as mine is, that in return I must accept someone who is not attracted to me, and only tolerates me due to her financial needs.",
            "author": "docrolling",
            "id": "gdr6m4x",
            "parent_id": "t1_gdr60ln",
            "score": 1,
            "created_utc": 1606473699.0,
            "replies": [
                {
                    "body": "It’s not something easily explained. Because it comes from the felt sense, it’s not easily explained in words or logic.   When I was in your situation I would have asked the same question about dropping my ego- so i get it.  All I can say is opening your mind to new ideas, experiences and listening to your felt sense may open up new avenues to joy you never experienced or thought possible before.  I know that’s probably not the answer you’re looking for but it’s the best way I can describe it.",
                    "author": "adrewishprince",
                    "id": "gdr6wrj",
                    "parent_id": "t1_gdr6m4x",
                    "score": 3,
                    "created_utc": 1606474027.0,
                    "replies": []
                },
                {
                    "body": "psychological fact, people who are depressed and have negative thoughts are also more likely to be more accurate in their perceptions. \"happy people\" achieve their state of bliss partially by shading truth in their own favor and deceiving themselves about their negatives.\n\nnot sure which is better, but we don't get a choice about it.",
                    "author": "_steady_hand_",
                    "id": "gdrxfpv",
                    "parent_id": "t1_gdr6m4x",
                    "score": 0,
                    "created_utc": 1606493859.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s not something easily explained. Because it comes from the felt sense, it’s not easily explained in words or logic.   When I was in your situation I would have asked the same question about dropping my ego- so i get it.  All I can say is opening your mind to new ideas, experiences and listening to your felt sense may open up new avenues to joy you never experienced or thought possible before.  I know that’s probably not the answer you’re looking for but it’s the best way I can describe it.",
            "author": "adrewishprince",
            "id": "gdr6wrj",
            "parent_id": "t1_gdr6m4x",
            "score": 3,
            "created_utc": 1606474027.0,
            "replies": []
        },
        {
            "body": "psychological fact, people who are depressed and have negative thoughts are also more likely to be more accurate in their perceptions. \"happy people\" achieve their state of bliss partially by shading truth in their own favor and deceiving themselves about their negatives.\n\nnot sure which is better, but we don't get a choice about it.",
            "author": "_steady_hand_",
            "id": "gdrxfpv",
            "parent_id": "t1_gdr6m4x",
            "score": 0,
            "created_utc": 1606493859.0,
            "replies": []
        }
    ]
}