{
    "title": "“Can you host?” Instant block.",
    "post_id": "11qhkiq",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/11qhkiq/can_you_host_instant_block/",
    "author": "ronitabonita",
    "body": "What part of sugaring suggests that women are willingly going to give you their home address and allow you to come over?\n\nDo men realize when they ask this within the first few moments of the conversation, that they are suggesting they are only interested in defiling us and not in taking us out, getting to know us, or being seen in public?\n\nThe only woman who would agree with this is not aligned so much with having a sugar relationship - are they?  It reeks of behavior that does not honor the other attributes a woman can bring to the sugar dynamic.\n\nThe question alone incenses me too much to even continue the conversation with a POT SD.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/11qhkiq/can_you_host_instant_block/",
    "score": 209,
    "upvote_ratio": 0.9,
    "created_utc": 1678732534.0,
    "num_comments": 128,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "“Send nudes.” LOL",
            "author": "nysd1001",
            "id": "jc38w3s",
            "parent_id": "t3_11qhkiq",
            "score": 59,
            "created_utc": 1678733174.0,
            "replies": []
        },
        {
            "body": "Yeah, sort of a problem that money can solve. This indicates he is tight in money or not willing to spend. A pass on most counts.",
            "author": "Majesticpork",
            "id": "jc3itf0",
            "parent_id": "t3_11qhkiq",
            "score": 123,
            "created_utc": 1678736974.0,
            "replies": [
                {
                    "body": "100% This^^^",
                    "author": "JustAsk4Alice",
                    "id": "jc480ce",
                    "parent_id": "t1_jc3itf0",
                    "score": 13,
                    "created_utc": 1678746991.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unless we have discussed and planned, it is an instant turn-off for the first meet.",
            "author": "LadyAnastasia700",
            "id": "jc3997i",
            "parent_id": "t3_11qhkiq",
            "score": 37,
            "created_utc": 1678733313.0,
            "replies": [
                {
                    "body": "This is the right approach.\n\n  I'm also a VERY strong believer in a first meet  being a  brief 1-2 hour casual meet in a public place with a clear understanding that intimacy is not an option.\n\nExperienced SB's may waive this with caution.",
                    "author": "pinotandsugar",
                    "id": "jc4hjrd",
                    "parent_id": "t1_jc3997i",
                    "score": 27,
                    "created_utc": 1678751067.0,
                    "replies": [
                        {
                            "body": "I love starting with a coffee meet and greet. One of my favs was we met at the kimball Art Museum to get to know each other, and it was lovely ♡♡♡",
                            "author": "LadyAnastasia700",
                            "id": "jc4jgh8",
                            "parent_id": "t1_jc4hjrd",
                            "score": 7,
                            "created_utc": 1678751897.0,
                            "replies": [
                                {
                                    "body": "In the LA  area the Hammer museum in Westwood is great in the evening/\n\nFor the privacy seeking a first meet the Getty Villa just north of Santa Monica (not the big Getty)  is great as reservations (free)  are required , there are great spots to have a private discussion while walking through the gardens .  Daytime only ..\n\nIf there is real interest in  pursuing the arrangement the Rodin exhibit may facilitate a discussion of likes and limitations.\n\nhttps://www.google.com/search?newwindow=1&sxsrf=AJOqlzUrNVMG13r-tU4LPzO0wPHvk-45zg%3A1678753661977&lei=fb8PZIyiO9u30PEPj6mCmA0&q=getty%20villa%20gardens&ved=2ahUKEwjM1L_dlNr9AhXbGzQIHY-UANMQsKwBKAJ6BQinARAD&biw=1280&bih=629&dpr=1.5#lpg=cid:CgIgAQ%3D%3D,ik:CAoSLEFGMVFpcE8wcW1GQjJsdGNhclhxSFNzc21FNXpuQmtRNjd4ZmNlMFB0RVJL",
                                    "author": "pinotandsugar",
                                    "id": "jc4olsc",
                                    "parent_id": "t1_jc4jgh8",
                                    "score": 5,
                                    "created_utc": 1678754134.0,
                                    "replies": [
                                        {
                                            "body": "That sounds breathtaking ♡ thank you for sharing",
                                            "author": "LadyAnastasia700",
                                            "id": "jc4q876",
                                            "parent_id": "t1_jc4olsc",
                                            "score": 2,
                                            "created_utc": 1678754834.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"Can you host\" is the SD equivalent of \"Let's meet tonight hun.\"",
            "author": "-Horatio-",
            "id": "jc37f9k",
            "parent_id": "t3_11qhkiq",
            "score": 71,
            "created_utc": 1678732617.0,
            "replies": [
                {
                    "body": "”I need money for a sitter tho”\n\n”I need money for an uber tho”\n\n”I need money for gas tho”\n\n”do you want to buy some content?”",
                    "author": null,
                    "id": "jc8d4sm",
                    "parent_id": "t1_jc37f9k",
                    "score": 2,
                    "created_utc": 1678841793.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Omg, this one guy kept messaging me on and off and he'd be like \"oh I really like you but your high maintenance.\" A month later he'd come back and be like \"I can't stop thinking about you, can you give me a lower PPM.\" Then a few months later he'd come back and be like \"I'll give you what you want but you have to meet me half way and host.....\" 🤣🤣🤣",
            "author": "Pretend_Apartment927",
            "id": "jc4e661",
            "parent_id": "t3_11qhkiq",
            "score": 19,
            "created_utc": 1678749606.0,
            "replies": [
                {
                    "body": "Like haggling on the streets of Marrakech.",
                    "author": "minkncookies",
                    "id": "jc4ty02",
                    "parent_id": "t1_jc4e661",
                    "score": 15,
                    "created_utc": 1678756481.0,
                    "replies": [
                        {
                            "body": "At least in Marrakech it smells like fancy spices and stuff 😂",
                            "author": "Terrible-Fix-9798",
                            "id": "jf3z7i0",
                            "parent_id": "t1_jc4ty02",
                            "score": 2,
                            "created_utc": 1680732314.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've come to the realization that there are many different definitions to what an Arrangement is.     Those men are actually doing you a favor by asking that question right away.  They are looking for something different than what you are looking for.  By being upfront, they are not wasting your time.     You blocking them is a perfect reaction.   Don't waste any of your time on them and get to the guys that are looking for what you want.",
            "author": "15Warrior15",
            "id": "jc3g1fn",
            "parent_id": "t3_11qhkiq",
            "score": 34,
            "created_utc": 1678735904.0,
            "replies": []
        },
        {
            "body": "Exactly! Also, If you’re too cheap/broke to get a nice hotel room then you’re not the guy for me!",
            "author": "OpportunityMean7492",
            "id": "jc3njsu",
            "parent_id": "t3_11qhkiq",
            "score": 51,
            "created_utc": 1678738784.0,
            "replies": [
                {
                    "body": "And not just once… like, regularly.",
                    "author": "minkncookies",
                    "id": "jc3p6m1",
                    "parent_id": "t1_jc3njsu",
                    "score": 22,
                    "created_utc": 1678739411.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "At the start it is not normal... But I did have a longer term setup with the me staying over at the SB's place when I would be in town... But I was also directly covering the rent and it was a place that I picked...",
            "author": "Randomworddude2023",
            "id": "jc3mdtq",
            "parent_id": "t3_11qhkiq",
            "score": 28,
            "created_utc": 1678738338.0,
            "replies": [
                {
                    "body": "Exception to the rule.\n\nGet me a studio apartment and I can suddenly host.  Abra cadabra ✨✨✨",
                    "author": "ronitabonita",
                    "id": "jc3o8n1",
                    "parent_id": "t1_jc3mdtq",
                    "score": 42,
                    "created_utc": 1678739050.0,
                    "replies": [
                        {
                            "body": "Omg yes… but still, maybe no sometimes :)",
                            "author": "Honeyyhive",
                            "id": "jc3vdci",
                            "parent_id": "t1_jc3o8n1",
                            "score": 9,
                            "created_utc": 1678741823.0,
                            "replies": [
                                {
                                    "body": "Still no...MOST times haha.",
                                    "author": "ronitabonita",
                                    "id": "jc401rh",
                                    "parent_id": "t1_jc3vdci",
                                    "score": 5,
                                    "created_utc": 1678743685.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Me too! Anytime! 😁",
                    "author": "SassyBabe6939",
                    "id": "jc3somb",
                    "parent_id": "t1_jc3mdtq",
                    "score": 0,
                    "created_utc": 1678740767.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t expect to start the arrangement right away but if I do I always get a hotel",
            "author": "UnearthlyDinosaur",
            "id": "jc3jlko",
            "parent_id": "t3_11qhkiq",
            "score": 7,
            "created_utc": 1678737276.0,
            "replies": []
        },
        {
            "body": "I have had multiple SB's that offered occasionally for us to meet at their place, but in all cases it was when we had been together a long time, and I have never asked. \n\nI actually still preferred in that instance that I host because I live where it tends to be a drive for most and my life is very crowded and rigidly scheduled (not suggesting their life is not, many of the college SB's I have had in the past also had tight schedules), so it is easiest for me to secure a nice place nearby.\n\nI have also hosted at my own house, on occasion, when we reach a large level of trust, and that is mos def giving them a stick of dynamite with a lighter and saying \"here I trust you\". But I know their worth, and I treat them that way, and it has never been a problem.",
            "author": "SDInLeather",
            "id": "jc3xyky",
            "parent_id": "t3_11qhkiq",
            "score": 6,
            "created_utc": 1678742850.0,
            "replies": []
        },
        {
            "body": "Huge red if asked like that and in first messages and sounds very escortish, but my preferred in LT.\n\nI very much like to \"host\" my guy. Enough that I went and made him a copy of my keys so that he can get in if I'm busy in meetings etc. We could do his place, but I prefer being home and it's a lot easier for my logistics. Hotels we do when travelling, or just going to drink enough not to drive and not willing to fight to get uber/taxi (none of us lives in the city and it's sometimes next to impossible to get a cab they are too busy). But I'm not a huge fan of hotels in general, home is good and comfy.\n\nHe never asked for it though. I asked him to get in after getting to know him. My 'castle' is his castle and we are both happy this way.",
            "author": "EstrellaDulce",
            "id": "jc3b52b",
            "parent_id": "t3_11qhkiq",
            "score": 16,
            "created_utc": 1678734027.0,
            "replies": [
                {
                    "body": "I would venture to say a) this rarely happens at the beginning and b) this isn’t the case for women who have room mates or family members at home at any given time.\n\nIn my case, I had an abusive partner who still drove past my house years after we ended our relationship.  I will not host a potential abuser (all men are potential abusers) and I will not endanger a kind and well meaning man by having him in my home.  My sanctuary is *my* sanctuary - and unless the guy is paying the entirety of my rent and is single, he is not coming anywhere near my home.  \n\nBesides - if he is married and his OPSEC game is weak, you could be on the receiving end of a psycho wife if and when he gets himself caught.  \n\nNo thank you.",
                    "author": "ronitabonita",
                    "id": "jc3nm56",
                    "parent_id": "t1_jc3b52b",
                    "score": 2,
                    "created_utc": 1678738810.0,
                    "replies": [
                        {
                            "body": "Idky.....but after you mentioned OPSEC and possible cute but a psycho wifey;👀👀 the ravenous lioness, bad ass baddie within me, wanted to roar \"I wish a bitch would!!!!\"🤣🤣🤣🦁🦁💪🏼👊🏻💅",
                            "author": "JustAsk4Alice",
                            "id": "jc4a4du",
                            "parent_id": "t1_jc3nm56",
                            "score": 1,
                            "created_utc": 1678747887.0,
                            "replies": [
                                {
                                    "body": "Omg....I KNOW that this is a total ADHD moment, but try and stay with me, bc the visual is making lmao!!!\n\nBut can't you just see an Octogon and a wifey v. SB, ALL OUT BATTLE!!!🤣🤣🤣\n\nLET'S GET READDDDDY TO RUUUUUMBLE!!!!!!\n\n(Get's me kinda pumped just thinkin about it lol!🤗🤗🤗🫶👊🏻 But I love MMA and I'm also stronger than most chicks; so it would be a great workout, at the very least!)",
                                    "author": "JustAsk4Alice",
                                    "id": "jc4azi6",
                                    "parent_id": "t1_jc4a4du",
                                    "score": 1,
                                    "created_utc": 1678748248.0,
                                    "replies": []
                                },
                                {
                                    "body": "So dead. I needed that laugh!\n\nI’m a lover, not a fighter 💕.",
                                    "author": "ronitabonita",
                                    "id": "jc4d01p",
                                    "parent_id": "t1_jc4a4du",
                                    "score": 1,
                                    "created_utc": 1678749106.0,
                                    "replies": [
                                        {
                                            "body": "😈😈😈😈  Baby, oh baby....I'm BOTH!!!!! \n<insert GROWL!!!>\n\nAND DAAAAMN GOOD AT BOTH!!!!!🥰😍😘😘🫶💪🏼👊🏻💅🤗",
                                            "author": "JustAsk4Alice",
                                            "id": "jc4dkxy",
                                            "parent_id": "t1_jc4d01p",
                                            "score": 3,
                                            "created_utc": 1678749354.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I always next when they ask if I can host. I will never host a SD at my home. I’m also not offended if they never want to meet at their home either. Asking if I can host is the equivalent of saying he has no money and just wants to have sex with me without any sort of relationship. Next.",
            "author": "Notsobabysugarbaby",
            "id": "jc3k5q9",
            "parent_id": "t3_11qhkiq",
            "score": 19,
            "created_utc": 1678737489.0,
            "replies": []
        },
        {
            "body": "I don't see any issues with a sugar relationship's intimate part taking place at the woman's place, but I do see a major issue with it being one of the very first questions.",
            "author": "geeky-sd",
            "id": "jc3ss68",
            "parent_id": "t3_11qhkiq",
            "score": 9,
            "created_utc": 1678740806.0,
            "replies": [
                {
                    "body": "Right.",
                    "author": "Terrible-Fix-9798",
                    "id": "jf3zdh3",
                    "parent_id": "t1_jc3ss68",
                    "score": 1,
                    "created_utc": 1680732386.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“Defiling” 😂\n\nI never ask, but have had ton of SBs offer to start off with a Netflix and chill date at their place. \n\nSometimes just to chat, but most times it leads to more. Thinking about it 3 of my SRs started off this way and lasted several years.\n\nIt might be a generational thing (or just a preference) but many younger women don’t want the entire wine and dine experience.\n\nEither way safety is something that has to be considered.",
            "author": "techsd00",
            "id": "jc3uenv",
            "parent_id": "t3_11qhkiq",
            "score": 10,
            "created_utc": 1678741442.0,
            "replies": [
                {
                    "body": "I'll go with generational then, bc I'm 37, and I damn sure would rather, go out, have a great time together, and create memories, than to just be someone's overnight \"Netflix & Chill.\"\n\nI think this is what has actually turned the dating community into such a shit show.\n\nOh look, let's do the bare freakin minimum and expect to get laid by the end of the night.🤨🙄\nHence why vanilla dating is so REPUGNANT to MANY women nowadays.",
                    "author": "JustAsk4Alice",
                    "id": "jc491k3",
                    "parent_id": "t1_jc3uenv",
                    "score": 15,
                    "created_utc": 1678747430.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In my profile I state that I cannot host, so I’ve had POT SBs say they can, but after we meet at a public place to see if we vibe with each other. So it’s not a big deal to me. But I can understand someone being hesitant about it if that’s how the first conversation starts.",
            "author": "Hardtop_1958",
            "id": "jc4lqbr",
            "parent_id": "t3_11qhkiq",
            "score": 3,
            "created_utc": 1678752879.0,
            "replies": []
        },
        {
            "body": "biggest ick !!",
            "author": "Accomplished-Pen-399",
            "id": "jc54oji",
            "parent_id": "t3_11qhkiq",
            "score": 4,
            "created_utc": 1678761390.0,
            "replies": []
        },
        {
            "body": "> What part of sugaring suggests that women are willingly going to give you their home address and allow you to come over?\n\nThe fact that multiple women have wanted me to come over to their place, after a few dates, in the past, at least on occasion?  It does suggest there are women that are comfortable with;  despite with this sub would suggest.\n\nlook - level setting.  I'm a single guy.  I do *NOT* want a woman that wants to host.  That's more driving for me.  And my house is (most likely) going to be more comfortable, more spacious, well stocked, etc.  \n\nI agree it's tacky to bring this up in the third message.  But generally I just think it's a compatibility thing.  As always, realize that just because you aren't comfortable with something (hosting) doesn't mean others aren't.",
            "author": "SDstartingOut",
            "id": "jc3fmj1",
            "parent_id": "t3_11qhkiq",
            "score": 6,
            "created_utc": 1678735746.0,
            "replies": []
        },
        {
            "body": "thats why i tell them no , they are supposed to be SD’s . they can host , if they aren’t willing to host then they are probably in a relationship to me",
            "author": "RavynTheQueen",
            "id": "jc3u5fv",
            "parent_id": "t3_11qhkiq",
            "score": 4,
            "created_utc": 1678741340.0,
            "replies": []
        },
        {
            "body": "I’ve had more than a few SBs over the years say very early on that they are willing to host, so asking as a SD does not seem that far fetched.  I will agree that it is all about timing, I’d never ask early on, I’d wait until after the M&G or at least after a few days of getting to know one another.",
            "author": "blk-tye",
            "id": "jc39hnp",
            "parent_id": "t3_11qhkiq",
            "score": 6,
            "created_utc": 1678733404.0,
            "replies": [
                {
                    "body": "If there is any level of flexibility in that regard, I think most SBs would volunteer it.  Asking on the front end, as someone who professes to have the means to cover many expenses, is the part that can sour a person...",
                    "author": "ronitabonita",
                    "id": "jc3pmm0",
                    "parent_id": "t1_jc39hnp",
                    "score": 2,
                    "created_utc": 1678739584.0,
                    "replies": [
                        {
                            "body": "Agreed, asking about it too early is definitely a bad thing.  I still remember one of my SBs from years ago, we had a great M&G and for our next meeting, she suggested a place more convenient to her place and she phrased it exactly that way 😉",
                            "author": "blk-tye",
                            "id": "jc3q71z",
                            "parent_id": "t1_jc3pmm0",
                            "score": 2,
                            "created_utc": 1678739803.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Even a broke man can find xxx for a hotel.",
            "author": null,
            "id": "jc5p5bk",
            "parent_id": "t3_11qhkiq",
            "score": 2,
            "created_utc": 1678773258.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "jc5p5cp",
                    "parent_id": "t1_jc5p5bk",
                    "score": -1,
                    "created_utc": 1678773258.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🙌🏽🙌🏽🙌🏽",
            "author": "Tiddyk",
            "id": "jc5xsdy",
            "parent_id": "t3_11qhkiq",
            "score": 2,
            "created_utc": 1678780368.0,
            "replies": []
        },
        {
            "body": "*Do men realize when they ask this within the first few moments of the conversation, that they are suggesting they are only interested in defiling us and not in taking us out, getting to know us, or being seen in public?*\n\n**Yes**, because the men who ask that are likely johns and looking for an escort.",
            "author": "BinghamtonSD",
            "id": "jc3morg",
            "parent_id": "t3_11qhkiq",
            "score": 4,
            "created_utc": 1678738453.0,
            "replies": [
                {
                    "body": "Ding ding ding\nWinner winner, chicken dinner!!!🐔🍗\n\n\nYet look at all of the male nay sayers. 🙄 \n\nThank you, Mr. Demille, you've shown your honest opinion within this matter, and once again, you're articulating for the actual gentlemen within this forum.",
                    "author": "JustAsk4Alice",
                    "id": "jc4cced",
                    "parent_id": "t1_jc3morg",
                    "score": 2,
                    "created_utc": 1678748828.0,
                    "replies": [
                        {
                            "body": "How many whack answers and attacks did it take to get some semblance of understanding from a person with a penis?  Good lord!",
                            "author": "ronitabonita",
                            "id": "jc67zgu",
                            "parent_id": "t1_jc4cced",
                            "score": 2,
                            "created_utc": 1678789217.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Exactly lol they’re not looking to be a sugar daddy, theyre looking to hook up with you probably once at minimal cost to them",
                    "author": "Queen_Audrey",
                    "id": "jc4etkj",
                    "parent_id": "t1_jc3morg",
                    "score": 1,
                    "created_utc": 1678749886.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I ask this if you are a pot SB that is an hour or more away. I'm not asking you to host off-the-bat without getting to know you like I am some sort of weirdo. *That would not be safe for either of us*. I am asking so that I can determine the logistics of this SR. Will we go to your place? Will we go to mine? Are you worth the drive if you *can't* host?\n\n\nSure, I *could* get a hotel every time I see you. But I don't want to keep buying cheap hotels for sugar, that feels escort-y. I'd rather take that hotel money and spend it on our time together or an uber.",
            "author": "TheStoicbrother",
            "id": "jc4e2o5",
            "parent_id": "t3_11qhkiq",
            "score": 3,
            "created_utc": 1678749564.0,
            "replies": [
                {
                    "body": "The SDs I’ve had never got a cheap hotel, because if you have money to be in the bowl then you should be able to budget for a nice hotel. You’re supposed to be a sugar daddy not a John lol",
                    "author": "Queen_Audrey",
                    "id": "jc4fqdw",
                    "parent_id": "t1_jc4e2o5",
                    "score": 2,
                    "created_utc": 1678750279.0,
                    "replies": [
                        {
                            "body": "you can have lots of money and be willing to spend it and still be a John\n\nyou can have medium or low amount of money and still be a SD\n\nthe difference between the two isn't based on the amount of money, it's based on intent, attitude, and behavior",
                            "author": "joc13",
                            "id": "jc538vf",
                            "parent_id": "t1_jc4fqdw",
                            "score": 4,
                            "created_utc": 1678760720.0,
                            "replies": []
                        },
                        {
                            "body": "Good job not fully interpreting what I said.",
                            "author": "TheStoicbrother",
                            "id": "jc4gt6l",
                            "parent_id": "t1_jc4fqdw",
                            "score": 1,
                            "created_utc": 1678750746.0,
                            "replies": [
                                {
                                    "body": "You don’t want to keep getting cheap hotels  : so don’t get a cheap hotel\nYou’d rather spend that money on time together or an Uber : you should have more than enough money for all of it, and if you’re not generous you shouldn’t be in the bowl. \nAssuming I misunderstood just bc you don’t agree w my opinion is funny though lol",
                                    "author": "Queen_Audrey",
                                    "id": "jc4k61w",
                                    "parent_id": "t1_jc4gt6l",
                                    "score": 3,
                                    "created_utc": 1678752205.0,
                                    "replies": [
                                        {
                                            "body": "The ability to repeat what i said doesn't equal comprehension. It means you can read, congrats.\n\nThe price of the hotel isn't the issue here. SDs work hard to make money and they don't spend it *just to spend it*. Perhaps you believe that, hence why you've shuffled through \"many SDs\".  They spend it because what the experience/item/person they spend it on is *worth it*.\n\n I don't find spending money on hotels to be *worth it* if the primary purpose of the hotel is to get sugar from a distant SB.  Hence why, I would ask a distant POT SB \"Can you host?\"",
                                            "author": "TheStoicbrother",
                                            "id": "jc4xkai",
                                            "parent_id": "t1_jc4k61w",
                                            "score": 1,
                                            "created_utc": 1678758123.0,
                                            "replies": [
                                                {
                                                    "body": "Clearly you’re the one not understanding. Money IS the issue. And you not being willing to spend it and asking if someone can host is unattractive. It’s not spending just to spend it, it’s being generous. That’s the whole point of the bowl. I’m not misunderstanding. I completely understand what you’re saying, and I’ve had successful relationships. But needing someone to host before you even do a m&g is unattractive and shows you don’t value the SB the way that I, and clearly OP, expect to be valued",
                                                    "author": "Queen_Audrey",
                                                    "id": "jc4yemf",
                                                    "parent_id": "t1_jc4xkai",
                                                    "score": 2,
                                                    "created_utc": 1678758506.0,
                                                    "replies": [
                                                        {
                                                            "body": ">and I’ve had successful relationships.\n\nThat is an oxymoron, successful relationships would not end. If you break up with many partners then that means you are a *bad partner*.  Are you sure you want to double down on that one?\n\n\n\n\n\n>But needing someone to host before you even do a m&g is unattractive and shows you don’t value the SB the way that I, and clearly OP, expect to be valued\n\nIf you say so. There's no basis here, though. \n\n>it’s being generous\n\nI guess you'd rather have the hotel than gifts, allowance, or PPM. Interesting.",
                                                            "author": "TheStoicbrother",
                                                            "id": "jc4ztdk",
                                                            "parent_id": "t1_jc4yemf",
                                                            "score": 1,
                                                            "created_utc": 1678759142.0,
                                                            "replies": [
                                                                {
                                                                    "body": "> That is an oxymoron, successful relationships would not end.\n\nCompletely disagree.  That's one of the things I *love* about sugar relationships.\n\nIt's about the journey;  not the destination.  I've had plenty of successful SRs - that are all over now.  Them ending does not change them being successful.\n\n> If you break up with many partners then that means you are a bad partner\n\nOr it just means you are getting older.",
                                                                    "author": "SDstartingOut",
                                                                    "id": "jc6izc6",
                                                                    "parent_id": "t1_jc4ztdk",
                                                                    "score": 0,
                                                                    "created_utc": 1678796734.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "LOL. Successful relationships do end,  for one reason or another. And the point is that it is normal for an SD to provide a hotel AND gifts AND allowance, bc I don’t do PPM and this is about spoiling. Not about an “SD” who has a strict budget and can’t afford both. I find it unattractive, and  I won’t budge on that. If you’re insecure about your ability to provide that’s on you, but don’t project just bc SBs don’t settle for what you offer.",
                                                                    "author": "Queen_Audrey",
                                                                    "id": "jc50gwv",
                                                                    "parent_id": "t1_jc4ztdk",
                                                                    "score": -1,
                                                                    "created_utc": 1678759441.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Okay. You can have your standards and keep running through SDs like hot cakes.  You clearly only care about yourself, and arguing. Done here lol",
                                                                            "author": "TheStoicbrother",
                                                                            "id": "jc51p8b",
                                                                            "parent_id": "t1_jc50gwv",
                                                                            "score": 2,
                                                                            "created_utc": 1678760004.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "Imagine not having the critical thinking skills to understand that some relationships end for reasons outside of compatibility.\n\nYou absolutely captured the essence of what I was trying to say yet were insulted and called selfish and argumentative in the process. It’s no wonder we have to go through so many frogs to get to our prince.",
                                                                            "author": "ronitabonita",
                                                                            "id": "jc58fba",
                                                                            "parent_id": "t1_jc50gwv",
                                                                            "score": 1,
                                                                            "created_utc": 1678763173.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": ">  You’d rather spend that money on time together or an Uber : you should have more than enough money for all of it, and if you’re not generous you shouldn’t be in the bowl.\n\nDo you not realize how circular in logic this is?  Unless you are a literal whale, or are dying and spending all your money - you are going to have a budget.  \n\nMy sugar budget, between allowance, activities, gifts on special occasions, etc - is around 40k/year.  I don't use hotels.  If I had to use hotels - well, once I burned through all my accrued free nights - I would realistically have to change up my monthly allowance to fit within my budget.  \n\nDoes that really mean I don't have enough money to sugar?  You follow that logic, the bowl is a ghost town.",
                                            "author": "SDstartingOut",
                                            "id": "jc6iqgm",
                                            "parent_id": "t1_jc4k61w",
                                            "score": 1,
                                            "created_utc": 1678796595.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have asked that but not in the second or third sentence of our initial chat.  We start to talk allowance I bring it up because I would rater she gets that extra money than some hotel chain.  Its important to set the expectations but also important to not be creepy about it either.",
            "author": "Capable-Night3302",
            "id": "jc3mnw6",
            "parent_id": "t3_11qhkiq",
            "score": 4,
            "created_utc": 1678738444.0,
            "replies": []
        },
        {
            "body": "It's just weird \"Can I come round your house?\". It's just rude, you should be invited. I would **NEVER** say that to anyone whether it was a person I've met in a pub, on seeking or at a club. Why would anyone say that in a SR ??",
            "author": "C12H22O11-EU",
            "id": "jc3ydkz",
            "parent_id": "t3_11qhkiq",
            "score": 3,
            "created_utc": 1678743014.0,
            "replies": [
                {
                    "body": "Usually men who are cheating on their wives and can’t meet in public or have a hotel room on a credit card lol",
                    "author": "Queen_Audrey",
                    "id": "jc4ems0",
                    "parent_id": "t1_jc3ydkz",
                    "score": 1,
                    "created_utc": 1678749804.0,
                    "replies": [
                        {
                            "body": "I can only guess it's being to cheap. It's not impossible to go and open another bank account somewhere. Many hotels still take cash if there were absolutely NO other option.\n\nSometimes it feels like people act without a single shred of decency.",
                            "author": "C12H22O11-EU",
                            "id": "jc6pco0",
                            "parent_id": "t1_jc4ems0",
                            "score": 3,
                            "created_utc": 1678800042.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My home is my sanctuary and I’m not inviting just any energy in. Agree 🙌",
            "author": "12121throwaway12",
            "id": "jc4gwc0",
            "parent_id": "t3_11qhkiq",
            "score": 2,
            "created_utc": 1678750784.0,
            "replies": []
        },
        {
            "body": "Ranks up there with \"I know my worth\", and \"Don't waste my time\"",
            "author": "rodeopete3281",
            "id": "jc3c7wx",
            "parent_id": "t3_11qhkiq",
            "score": 4,
            "created_utc": 1678734440.0,
            "replies": [
                {
                    "body": "Yeah, I also hate it when women... *checks notes* ...value themselves and their time. \n\n/s",
                    "author": "peregrine_nation",
                    "id": "jc3s87c",
                    "parent_id": "t1_jc3c7wx",
                    "score": 3,
                    "created_utc": 1678740590.0,
                    "replies": [
                        {
                            "body": "Take it for what it's worth, but so far, the women who told me not to waste their time were quite comfortable wasting mine.",
                            "author": "geeky-sd",
                            "id": "jc6zlyu",
                            "parent_id": "t1_jc3s87c",
                            "score": 2,
                            "created_utc": 1678804616.0,
                            "replies": []
                        },
                        {
                            "body": "Lmao literally😂 like should we apologize?? I’m sorry that us women are vocal about collectively raising our standards and it’s harder for salt daddies and broke boys to get laid for cheap",
                            "author": "Queen_Audrey",
                            "id": "jc4f6dz",
                            "parent_id": "t1_jc3s87c",
                            "score": 2,
                            "created_utc": 1678750040.0,
                            "replies": [
                                {
                                    "body": "Lady - you are on fire 🔥🔥🔥.",
                                    "author": "ronitabonita",
                                    "id": "jc683ir",
                                    "parent_id": "t1_jc4f6dz",
                                    "score": 2,
                                    "created_utc": 1678789311.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "it’s perfectly fine to value yourself, but it shows no class to tell someone that exact thing. Can you imagine a queen or princess saying I know my worth? No you can’t because that would show no class. Women that actually know their worth show it with their actions not their words.",
                            "author": "NickPfromYuma",
                            "id": "jc4lkik",
                            "parent_id": "t1_jc3s87c",
                            "score": 1,
                            "created_utc": 1678752811.0,
                            "replies": [
                                {
                                    "body": "I can imagine them saying that, yeah. I don't think it's inherently wrong to say it directly. I *can* be trashy, depending on the context and delivery, but it's not automatically so.",
                                    "author": "peregrine_nation",
                                    "id": "jc4nm0n",
                                    "parent_id": "t1_jc4lkik",
                                    "score": -1,
                                    "created_utc": 1678753693.0,
                                    "replies": [
                                        {
                                            "body": "a truly classy women knows her worth, but would never be so entitled to express that in actual words. It would be beneath her, to lower herself to the level of someone beneath her, to actually say those words to them. Instead she would show by her actions she was above them and be on her way.\n\nI dont think most women from your generation truly understand what class is, or how it actually acts. I find most women that say there are classy, arent.",
                                            "author": "NickPfromYuma",
                                            "id": "jc6e333",
                                            "parent_id": "t1_jc4nm0n",
                                            "score": 0,
                                            "created_utc": 1678793747.0,
                                            "replies": [
                                                {
                                                    "body": "> I dont think most women from your generation\n\nYou don't know how old I am lol",
                                                    "author": "peregrine_nation",
                                                    "id": "jc71uao",
                                                    "parent_id": "t1_jc6e333",
                                                    "score": 1,
                                                    "created_utc": 1678805544.0,
                                                    "replies": [
                                                        {
                                                            "body": "Im sure you're younger then me (if you arent, would you be interested in a slightly used male SB?) , when I said your generation I meant Millennial or Generation Z.\n\nI've never heard a women from my generation say \"I know my worth\" and if she did, guys my age would all agree that she was without class.",
                                                            "author": "NickPfromYuma",
                                                            "id": "jcakfp2",
                                                            "parent_id": "t1_jc71uao",
                                                            "score": 1,
                                                            "created_utc": 1678888385.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I do too until they feel that they have to announce it.  That tells every SD that neither their worth nor time has any intrinsic value. \n\nSwans don't need to squawk to get attention.  Crows do.",
                            "author": "rodeopete3281",
                            "id": "jc44t38",
                            "parent_id": "t1_jc3s87c",
                            "score": -1,
                            "created_utc": 1678745646.0,
                            "replies": [
                                {
                                    "body": "Crows are awesome. And I don't think openly saying either of those things is instantly indicative of anything.",
                                    "author": "peregrine_nation",
                                    "id": "jc48z6y",
                                    "parent_id": "t1_jc44t38",
                                    "score": 2,
                                    "created_utc": 1678747401.0,
                                    "replies": [
                                        {
                                            "body": "Crows are much more intelligent than swans, I think maybe his valuation of living things is a bit off lol",
                                            "author": "Queen_Audrey",
                                            "id": "jc4fby4",
                                            "parent_id": "t1_jc48z6y",
                                            "score": 5,
                                            "created_utc": 1678750108.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "How precious.",
                                            "author": "rodeopete3281",
                                            "id": "jc49fht",
                                            "parent_id": "t1_jc48z6y",
                                            "score": 0,
                                            "created_utc": 1678747593.0,
                                            "replies": [
                                                {
                                                    "body": "🥺❤️❤️❤️",
                                                    "author": "peregrine_nation",
                                                    "id": "jc4e2ga",
                                                    "parent_id": "t1_jc49fht",
                                                    "score": -2,
                                                    "created_utc": 1678749561.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Pardon?",
                    "author": "ronitabonita",
                    "id": "jc3msae",
                    "parent_id": "t1_jc3c7wx",
                    "score": -2,
                    "created_utc": 1678738491.0,
                    "replies": [
                        {
                            "body": "It's basically the equivalent of saying a platonic M&G will be paid. Hell, might even ask to be paid to talk to them before hand",
                            "author": "CrankyPelicans",
                            "id": "jc3yk2y",
                            "parent_id": "t1_jc3msae",
                            "score": 0,
                            "created_utc": 1678743087.0,
                            "replies": [
                                {
                                    "body": "But it’s not.",
                                    "author": "ronitabonita",
                                    "id": "jc40vhs",
                                    "parent_id": "t1_jc3yk2y",
                                    "score": -1,
                                    "created_utc": 1678744019.0,
                                    "replies": [
                                        {
                                            "body": "But it is.",
                                            "author": "rodeopete3281",
                                            "id": "jc44vjx",
                                            "parent_id": "t1_jc40vhs",
                                            "score": 0,
                                            "created_utc": 1678745675.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If that's what the SD wants and you can't provide it, he can just block you as well. You can't be hypergamous and expect chivalry from men while you don't behave like a lady to begin with. \n\nThat's a woman child post, you can just tell him what you need him to provide for that to happen, or just say 'no I can't' or 'I don't want to'.\n\nStop making the bowl worse than it already is!",
            "author": "sugardad123",
            "id": "jc3wb23",
            "parent_id": "t3_11qhkiq",
            "score": 4,
            "created_utc": 1678742197.0,
            "replies": [
                {
                    "body": "Read: Stop having boundaries and standards.",
                    "author": "ronitabonita",
                    "id": "jc418fq",
                    "parent_id": "t1_jc3wb23",
                    "score": 8,
                    "created_utc": 1678744166.0,
                    "replies": []
                },
                {
                    "body": "Using the word \"defile\" says a hell of a lot about OP.",
                    "author": "CrankyPelicans",
                    "id": "jc3z115",
                    "parent_id": "t1_jc3wb23",
                    "score": 2,
                    "created_utc": 1678743277.0,
                    "replies": [
                        {
                            "body": "I’m glad you’re paying attention.\n\nYou know what I’m not here to do....??? One and done sex with a guy who is just working on his self-esteem and body count.  It’s bad enough these clowns lead with sex instead of pretending for a second they have any level of respect for us as a person.\n\nYou know who gets full access to my body, any way he wants it, and never hears the word “no?” The *gentleman* who is kind and shows he is listening, communicates effectively about things besides his pleasure, and loves having adult conversation that stimulates the mind.  \n\nSo, yes ... I said “defile.”",
                            "author": "ronitabonita",
                            "id": "jc41qlr",
                            "parent_id": "t1_jc3z115",
                            "score": 5,
                            "created_utc": 1678744371.0,
                            "replies": [
                                {
                                    "body": "The way you talk is demeaning to people who aren't like you. There are people out there looking for different arrangements than you are, and instead of viewing that with a \"live and let live\" mentality you are here bashing and attacking them in a roundabout way. So yes... your word choice says a lot about you.",
                                    "author": "CrankyPelicans",
                                    "id": "jc4c6bw",
                                    "parent_id": "t1_jc41qlr",
                                    "score": 3,
                                    "created_utc": 1678748756.0,
                                    "replies": [
                                        {
                                            "body": "And???",
                                            "author": "ronitabonita",
                                            "id": "jc4d93o",
                                            "parent_id": "t1_jc4c6bw",
                                            "score": -1,
                                            "created_utc": 1678749213.0,
                                            "replies": [
                                                {
                                                    "body": "He misses the point that sugar relationships are not the same as escorting…",
                                                    "author": "Queen_Audrey",
                                                    "id": "jc4exek",
                                                    "parent_id": "t1_jc4d93o",
                                                    "score": 1,
                                                    "created_utc": 1678749932.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "host.\n\nalways and forever blocked.",
            "author": "bookworm010101",
            "id": "jc3ggt5",
            "parent_id": "t3_11qhkiq",
            "score": 1,
            "created_utc": 1678736071.0,
            "replies": []
        },
        {
            "body": "OP is totally correct.  I also believe that zero percent of my sbs live in a place with a bar selection that would be acceptable to my delicate palate.  I am not willing to go on a date that is effectively \"camping.\"\n\n\"Oh, TSD, jUsT bRiNg YoUr OwN dRiNkS\"\n\nSpecialization of trade my brohombres.  This body was made for consuming beverages... not mixing them.",
            "author": "TastySpermDevice",
            "id": "jc39yoq",
            "parent_id": "t3_11qhkiq",
            "score": 1,
            "created_utc": 1678733584.0,
            "replies": [
                {
                    "body": "Smh TSD you would think with such an _expansive_ palette, you would know how to mix a Sex on the Beach.",
                    "author": "SugarBabyVet",
                    "id": "jc3c4fd",
                    "parent_id": "t1_jc39yoq",
                    "score": 1,
                    "created_utc": 1678734404.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’d never ask in this way, but I do try to figure out if a potential SB has roommates, lives at home, or has her own place and is open to me coming over eventually during a M&G and before an arrangement is ever put in place.\n\nIf you’re never open to me coming to your place, I’m not interested. Not about the money but it signals a willingness and openness for emotional intimacy. If all we’re doing is going out and going to a hotel after, I’m 100% going to become uninterested after a couple months. Why would I bother. \n\nIf you want a long term SR and all the things that come with it - bigger allowance, vacations, fancy gifts - you’ve got to be open to the idea of getting deeper with SDs IMO.",
            "author": "Economics_Troll",
            "id": "jc40s4v",
            "parent_id": "t3_11qhkiq",
            "score": 1,
            "created_utc": 1678743981.0,
            "replies": [
                {
                    "body": "Easy enough - if the SD is single.  A complete double standard if he isn’t.\n\nAnd the point is that the inquiry happens right off the bat... not that it happens.",
                    "author": "ronitabonita",
                    "id": "jc4127a",
                    "parent_id": "t1_jc40s4v",
                    "score": 3,
                    "created_utc": 1678744095.0,
                    "replies": [
                        {
                            "body": "But if you don't find that out up front and it is something you desire for any long term SR isn't it a waste of both parties time if they don't discuss that soon?  \n\nHow can one take issue with asking, are you eventually ok to host if things go well?  Certainly one wouldn't start with actually hosting, but knowing whether it is possible or entirely off the table is important to know before either party invests a lot of time.",
                            "author": "Mainlyharmless",
                            "id": "jctuhlh",
                            "parent_id": "t1_jc4127a",
                            "score": 1,
                            "created_utc": 1679237946.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Maybe I'm an outlier here, because I routinely ask this question (followed by \"if not nbd I can get a hotel\") and have never encountered any hostility. A few SBs have said yes, including my current one. The ones that said no, I got a hotel. If a girl is gonna insta-block over something like that, oh well. 🤷",
            "author": "Questiner",
            "id": "jc53oh4",
            "parent_id": "t3_11qhkiq",
            "score": 1,
            "created_utc": 1678760926.0,
            "replies": []
        },
        {
            "body": "I’ve put in my bio that it’s not an acceptable form of “dates”. If you’d like to meet, then we can go for coffee/dinner etc.",
            "author": "Bitchesbechirpin",
            "id": "jc3qw4g",
            "parent_id": "t3_11qhkiq",
            "score": 1,
            "created_utc": 1678740070.0,
            "replies": []
        },
        {
            "body": "Doesn’t want to spend, doesn’t want to get cheating",
            "author": "Critical-Midnight591",
            "id": "jc4krwh",
            "parent_id": "t3_11qhkiq",
            "score": 1,
            "created_utc": 1678752469.0,
            "replies": []
        },
        {
            "body": "I have hosted my current sugar daddy but I prefer hotels and going to their residence once trust is established. Definitely not right away!",
            "author": "mysticalheavensawait",
            "id": "jc4zotg",
            "parent_id": "t3_11qhkiq",
            "score": 1,
            "created_utc": 1678759083.0,
            "replies": []
        },
        {
            "body": "Genuinely very curious about this.  Previously when I had an SB it was in a city I consistently visited for work.  Made it very easy as a married man whose wife did not know.  We could go out for dates and then return to my hotel or luxury Airbnb.\n\nI've been retired from having an SB for four years now, but thinking about it again.  Except I don't travel consistently to any city so would need to find someone local.  My main problem is not having any electronic records of where I've been, like hotel stays in my city.  I would be uncomfortable having the first couple of initimate meets be in my house or her house, so I have to figure that out.  But it would be so much easier in the long run to do if eventually she could host.  And I would be more than willing to offer my normal PPM plus the cost of a nice hotel, and she could choose whether to go the hotel option and book it herself or to host.  Is this a non-starter for most SB's?",
            "author": "Adventurer2006",
            "id": "jc52cws",
            "parent_id": "t3_11qhkiq",
            "score": 1,
            "created_utc": 1678760315.0,
            "replies": [
                {
                    "body": "Personally, I would much rather an SD offer me cash to book the room. I have done that with my AP and it’s a complete non-issue.\n\nGuess who ended up offering to host. This girl.  Because I am also not an asshole all the time.",
                    "author": "ronitabonita",
                    "id": "jc53m9y",
                    "parent_id": "t1_jc52cws",
                    "score": 1,
                    "created_utc": 1678760898.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Any guy that can’t host has a wife or is a fraud!",
            "author": null,
            "id": "jc5bjud",
            "parent_id": "t3_11qhkiq",
            "score": 1,
            "created_utc": 1678764754.0,
            "replies": [
                {
                    "body": "Really? \n\nWhat if his wife died of cancer and he's a single dad with young kids at home.  And out of respect for his children he's not going to bring a young girl over the house. \n\nSo this makes him a fraud because he can't host at his place?",
                    "author": "andrew_david",
                    "id": "jc5rvxh",
                    "parent_id": "t1_jc5bjud",
                    "score": 2,
                    "created_utc": 1678775395.0,
                    "replies": [
                        {
                            "body": "he can host a hotel date still, right?",
                            "author": null,
                            "id": "jc6zdp6",
                            "parent_id": "t1_jc5rvxh",
                            "score": 1,
                            "created_utc": 1678804519.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "\nWhat part of sugaring suggests that men are willingly going to give you money and allow you to give nothing in return  ?\n\nDo women realize when they ask this within the first few moments of the conversation, that they are suggesting they are only interested in money and won't provide us penetration sex ?\n\nThe only man who would agree with this is not aligned so much with having a sugar relationship - are they? It reeks of behavior that does not honor the other attributes a man can bring to the sugar dynamic.\n\nThe question alone incenses me too much to even continue the conversation with a POT SB.",
            "author": null,
            "id": "jc3y6km",
            "parent_id": "t3_11qhkiq",
            "score": -1,
            "created_utc": 1678742939.0,
            "replies": [
                {
                    "body": "I know you’re not addressing me.  \n\nBecause I will snatch your soul on a first date *-at a hotel-* *-and after some courting and with a conversation about the design of the dynamic.-*\n\nTalk about missing the point entirely.",
                    "author": "ronitabonita",
                    "id": "jc40pnb",
                    "parent_id": "t1_jc3y6km",
                    "score": 2,
                    "created_utc": 1678743952.0,
                    "replies": [
                        {
                            "body": "Just making it a point that the door swings both ways.\n\nAn awful lot of SD/men bashing goes on here.",
                            "author": null,
                            "id": "jc416pm",
                            "parent_id": "t1_jc40pnb",
                            "score": 5,
                            "created_utc": 1678744145.0,
                            "replies": [
                                {
                                    "body": "People on here are speaking poorly of men who can’t afford to be in the bowl, and expect to treat women poorly because of it lol",
                                    "author": "Queen_Audrey",
                                    "id": "jc4fkeg",
                                    "parent_id": "t1_jc416pm",
                                    "score": 1,
                                    "created_utc": 1678750207.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Escort behavior",
            "author": "Beneficial-Dark-1766",
            "id": "jc4cokp",
            "parent_id": "t3_11qhkiq",
            "score": 0,
            "created_utc": 1678748971.0,
            "replies": []
        },
        {
            "body": "This is a tone deaf post and not applicable for your average sd/sb relationship",
            "author": "pfj409",
            "id": "jc49xpk",
            "parent_id": "t3_11qhkiq",
            "score": -2,
            "created_utc": 1678747808.0,
            "replies": [
                {
                    "body": "You are absolutely right. That’s because if you read more closely you would understand that this conversation is happening to some of us on the front end, first conversation. Before scheduling any type of meeting\n\nSo, no, it’s not applicable to most SRs.  Good to know there are some smart ones out here and not just guys who want to defend unacceptable behavior.",
                    "author": "ronitabonita",
                    "id": "jc4crxh",
                    "parent_id": "t1_jc49xpk",
                    "score": 0,
                    "created_utc": 1678749011.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "jc45pd5",
            "parent_id": "t3_11qhkiq",
            "score": -2,
            "created_utc": 1678746024.0,
            "replies": [
                {
                    "body": "You realize we have to weed through hundreds of disgusting jerks to get to our prized SD, right? \n\nYou’ll pardon us if we are a bit jaded at times.",
                    "author": "ronitabonita",
                    "id": "jc4cj2o",
                    "parent_id": "t1_jc45pd5",
                    "score": 0,
                    "created_utc": 1678748906.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have been in the bowl for over a decade. I have gotten to know SBs who are such great people but are in a serious financial hole often because an ex spouse/bf used them and abused them credit wise. I have offered to meet in their place adding the money I would have paid a hotel to their already established allowance. \n\nWe still chat and talk and I mentor when appropriate. It is never pushed just offered. Some have agreed some haven’t but nothing has changed with either decision.\n\nSBs does that affect your opinions or is this just a very bad idea?",
            "author": "BigJon517",
            "id": "jc4zh41",
            "parent_id": "t3_11qhkiq",
            "score": 0,
            "created_utc": 1678758986.0,
            "replies": []
        },
        {
            "body": "I've had both types. My longest was 5 years and we went out a lot and traveled to other countries. The last two (one is still ongoing), that's all they want; I show up at their place, we talk a little, have sex, then I leave. Oddly, they are both older than my first one and the current one is about 20 years younger than me (she's 40) but still keeps it very discreet. I understand the challenge of being seen with an older guy (I do stay in shape though) so I just accept it for what it is now. \n\nBut for younger SDs, I would hope part of the enjoyment is in fact getting to know someone, spending time doing other things, building memories, etc.",
            "author": "DeathSentryCoH",
            "id": "jc4fced",
            "parent_id": "t3_11qhkiq",
            "score": 1,
            "created_utc": 1678750113.0,
            "replies": []
        },
        {
            "body": "One SB hosted me, one I knew her address from picking her up for dates, lastly one I knew for shipping gifts. \n\nThe one that hosted was really out of her comfort, and by her request.  \n\nAsking an SB to host is tacky….  Make a plan, get a room.  There just isn’t a reasonable excuse to put an SB in that situation when you are just starting.  Even if you develop trust, SHE should be the only one to suggest her hosting.",
            "author": "geekinkc",
            "id": "jc6ijh2",
            "parent_id": "t3_11qhkiq",
            "score": 1,
            "created_utc": 1678796482.0,
            "replies": []
        },
        {
            "body": "Sort of the same thing if a pot SB asks to come to the guys place in first convo. First meet should always be in a public place.",
            "author": "KindAd6988",
            "id": "jc6mfjf",
            "parent_id": "t3_11qhkiq",
            "score": 1,
            "created_utc": 1678798581.0,
            "replies": [
                {
                    "body": "Except that a POT gym bro SD could easily overpower a 5’1” SB, dismember her and dispose of her body if he wanted to.  Things straight guys never have to think about.",
                    "author": "ronitabonita",
                    "id": "jc88dd3",
                    "parent_id": "t1_jc6mfjf",
                    "score": 1,
                    "created_utc": 1678839807.0,
                    "replies": [
                        {
                            "body": "Agreed, but some SBs can do the same to a guy as well. I have been to a meet and greet or two where the SB has a car full of guys behind her. Lets just say I made a quick exit. Also, most of the gym bro guys arent SDs, they are posers. Usually those types do not have the means.  One usually gets the means after you work a real job for awhile and are over 35 or 40... One should be able to filter the posers out.",
                            "author": "KindAd6988",
                            "id": "jcakmfy",
                            "parent_id": "t1_jc88dd3",
                            "score": 1,
                            "created_utc": 1678888463.0,
                            "replies": []
                        },
                        {
                            "body": "I have been on meets where a car full of guys is there with the woman. It goes both ways. But gym bro guys are not usually sugar guy material. Life doesnt work that way usually. Unless they came into a lot of money young, they dont have the means.  A guy that has the means will usually be over 40, and is not spending half the day at the gym.",
                            "author": "KindAd6988",
                            "id": "je0bp2b",
                            "parent_id": "t1_jc88dd3",
                            "score": 1,
                            "created_utc": 1680013898.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Many escorts and johns on the site. Sounds like you met a john. \n\nNo judgement about sex work, it is what it is, but I would say about half if not more of the women Ive talked to are actually escorts.",
            "author": null,
            "id": "jc8czk3",
            "parent_id": "t3_11qhkiq",
            "score": 1,
            "created_utc": 1678841736.0,
            "replies": []
        },
        {
            "body": "Well hotels is for meeting escorts… but I would gladly host and provide transportation :)\n\nGoing to her place can be cozy (also the sheets are her problem) but it has never been a deal breaker for me if she doesn’t host.\n\nI can see how it could result in a instant block, if it is a early question.",
            "author": "Additional-Hornet-81",
            "id": "jcb9hxy",
            "parent_id": "t3_11qhkiq",
            "score": 1,
            "created_utc": 1678898100.0,
            "replies": []
        },
        {
            "body": "I’ve never asked a SB to host. That said, more than half the women I’ve met have actually invited me to their place. But I’m also on team “no sex until the third date”, so that’s obviously a factor.",
            "author": "captcreamfiller",
            "id": "jcg5285",
            "parent_id": "t3_11qhkiq",
            "score": 1,
            "created_utc": 1678983594.0,
            "replies": [
                {
                    "body": "Kudos for reserving sex for at least 10 hours after you’ve known a person, ha ha.",
                    "author": "ronitabonita",
                    "id": "jcg8r0g",
                    "parent_id": "t1_jcg5285",
                    "score": 2,
                    "created_utc": 1678984989.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "100% This^^^",
            "author": "JustAsk4Alice",
            "id": "jc480ce",
            "parent_id": "t1_jc3itf0",
            "score": 13,
            "created_utc": 1678746991.0,
            "replies": []
        },
        {
            "body": "This is the right approach.\n\n  I'm also a VERY strong believer in a first meet  being a  brief 1-2 hour casual meet in a public place with a clear understanding that intimacy is not an option.\n\nExperienced SB's may waive this with caution.",
            "author": "pinotandsugar",
            "id": "jc4hjrd",
            "parent_id": "t1_jc3997i",
            "score": 27,
            "created_utc": 1678751067.0,
            "replies": [
                {
                    "body": "I love starting with a coffee meet and greet. One of my favs was we met at the kimball Art Museum to get to know each other, and it was lovely ♡♡♡",
                    "author": "LadyAnastasia700",
                    "id": "jc4jgh8",
                    "parent_id": "t1_jc4hjrd",
                    "score": 7,
                    "created_utc": 1678751897.0,
                    "replies": [
                        {
                            "body": "In the LA  area the Hammer museum in Westwood is great in the evening/\n\nFor the privacy seeking a first meet the Getty Villa just north of Santa Monica (not the big Getty)  is great as reservations (free)  are required , there are great spots to have a private discussion while walking through the gardens .  Daytime only ..\n\nIf there is real interest in  pursuing the arrangement the Rodin exhibit may facilitate a discussion of likes and limitations.\n\nhttps://www.google.com/search?newwindow=1&sxsrf=AJOqlzUrNVMG13r-tU4LPzO0wPHvk-45zg%3A1678753661977&lei=fb8PZIyiO9u30PEPj6mCmA0&q=getty%20villa%20gardens&ved=2ahUKEwjM1L_dlNr9AhXbGzQIHY-UANMQsKwBKAJ6BQinARAD&biw=1280&bih=629&dpr=1.5#lpg=cid:CgIgAQ%3D%3D,ik:CAoSLEFGMVFpcE8wcW1GQjJsdGNhclhxSFNzc21FNXpuQmtRNjd4ZmNlMFB0RVJL",
                            "author": "pinotandsugar",
                            "id": "jc4olsc",
                            "parent_id": "t1_jc4jgh8",
                            "score": 5,
                            "created_utc": 1678754134.0,
                            "replies": [
                                {
                                    "body": "That sounds breathtaking ♡ thank you for sharing",
                                    "author": "LadyAnastasia700",
                                    "id": "jc4q876",
                                    "parent_id": "t1_jc4olsc",
                                    "score": 2,
                                    "created_utc": 1678754834.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "”I need money for a sitter tho”\n\n”I need money for an uber tho”\n\n”I need money for gas tho”\n\n”do you want to buy some content?”",
            "author": null,
            "id": "jc8d4sm",
            "parent_id": "t1_jc37f9k",
            "score": 2,
            "created_utc": 1678841793.0,
            "replies": []
        },
        {
            "body": "Like haggling on the streets of Marrakech.",
            "author": "minkncookies",
            "id": "jc4ty02",
            "parent_id": "t1_jc4e661",
            "score": 15,
            "created_utc": 1678756481.0,
            "replies": [
                {
                    "body": "At least in Marrakech it smells like fancy spices and stuff 😂",
                    "author": "Terrible-Fix-9798",
                    "id": "jf3z7i0",
                    "parent_id": "t1_jc4ty02",
                    "score": 2,
                    "created_utc": 1680732314.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And not just once… like, regularly.",
            "author": "minkncookies",
            "id": "jc3p6m1",
            "parent_id": "t1_jc3njsu",
            "score": 22,
            "created_utc": 1678739411.0,
            "replies": []
        },
        {
            "body": "Exception to the rule.\n\nGet me a studio apartment and I can suddenly host.  Abra cadabra ✨✨✨",
            "author": "ronitabonita",
            "id": "jc3o8n1",
            "parent_id": "t1_jc3mdtq",
            "score": 42,
            "created_utc": 1678739050.0,
            "replies": [
                {
                    "body": "Omg yes… but still, maybe no sometimes :)",
                    "author": "Honeyyhive",
                    "id": "jc3vdci",
                    "parent_id": "t1_jc3o8n1",
                    "score": 9,
                    "created_utc": 1678741823.0,
                    "replies": [
                        {
                            "body": "Still no...MOST times haha.",
                            "author": "ronitabonita",
                            "id": "jc401rh",
                            "parent_id": "t1_jc3vdci",
                            "score": 5,
                            "created_utc": 1678743685.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Me too! Anytime! 😁",
            "author": "SassyBabe6939",
            "id": "jc3somb",
            "parent_id": "t1_jc3mdtq",
            "score": 0,
            "created_utc": 1678740767.0,
            "replies": []
        },
        {
            "body": "I would venture to say a) this rarely happens at the beginning and b) this isn’t the case for women who have room mates or family members at home at any given time.\n\nIn my case, I had an abusive partner who still drove past my house years after we ended our relationship.  I will not host a potential abuser (all men are potential abusers) and I will not endanger a kind and well meaning man by having him in my home.  My sanctuary is *my* sanctuary - and unless the guy is paying the entirety of my rent and is single, he is not coming anywhere near my home.  \n\nBesides - if he is married and his OPSEC game is weak, you could be on the receiving end of a psycho wife if and when he gets himself caught.  \n\nNo thank you.",
            "author": "ronitabonita",
            "id": "jc3nm56",
            "parent_id": "t1_jc3b52b",
            "score": 2,
            "created_utc": 1678738810.0,
            "replies": [
                {
                    "body": "Idky.....but after you mentioned OPSEC and possible cute but a psycho wifey;👀👀 the ravenous lioness, bad ass baddie within me, wanted to roar \"I wish a bitch would!!!!\"🤣🤣🤣🦁🦁💪🏼👊🏻💅",
                    "author": "JustAsk4Alice",
                    "id": "jc4a4du",
                    "parent_id": "t1_jc3nm56",
                    "score": 1,
                    "created_utc": 1678747887.0,
                    "replies": [
                        {
                            "body": "Omg....I KNOW that this is a total ADHD moment, but try and stay with me, bc the visual is making lmao!!!\n\nBut can't you just see an Octogon and a wifey v. SB, ALL OUT BATTLE!!!🤣🤣🤣\n\nLET'S GET READDDDDY TO RUUUUUMBLE!!!!!!\n\n(Get's me kinda pumped just thinkin about it lol!🤗🤗🤗🫶👊🏻 But I love MMA and I'm also stronger than most chicks; so it would be a great workout, at the very least!)",
                            "author": "JustAsk4Alice",
                            "id": "jc4azi6",
                            "parent_id": "t1_jc4a4du",
                            "score": 1,
                            "created_utc": 1678748248.0,
                            "replies": []
                        },
                        {
                            "body": "So dead. I needed that laugh!\n\nI’m a lover, not a fighter 💕.",
                            "author": "ronitabonita",
                            "id": "jc4d01p",
                            "parent_id": "t1_jc4a4du",
                            "score": 1,
                            "created_utc": 1678749106.0,
                            "replies": [
                                {
                                    "body": "😈😈😈😈  Baby, oh baby....I'm BOTH!!!!! \n<insert GROWL!!!>\n\nAND DAAAAMN GOOD AT BOTH!!!!!🥰😍😘😘🫶💪🏼👊🏻💅🤗",
                                    "author": "JustAsk4Alice",
                                    "id": "jc4dkxy",
                                    "parent_id": "t1_jc4d01p",
                                    "score": 3,
                                    "created_utc": 1678749354.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Right.",
            "author": "Terrible-Fix-9798",
            "id": "jf3zdh3",
            "parent_id": "t1_jc3ss68",
            "score": 1,
            "created_utc": 1680732386.0,
            "replies": []
        },
        {
            "body": "I'll go with generational then, bc I'm 37, and I damn sure would rather, go out, have a great time together, and create memories, than to just be someone's overnight \"Netflix & Chill.\"\n\nI think this is what has actually turned the dating community into such a shit show.\n\nOh look, let's do the bare freakin minimum and expect to get laid by the end of the night.🤨🙄\nHence why vanilla dating is so REPUGNANT to MANY women nowadays.",
            "author": "JustAsk4Alice",
            "id": "jc491k3",
            "parent_id": "t1_jc3uenv",
            "score": 15,
            "created_utc": 1678747430.0,
            "replies": []
        },
        {
            "body": "If there is any level of flexibility in that regard, I think most SBs would volunteer it.  Asking on the front end, as someone who professes to have the means to cover many expenses, is the part that can sour a person...",
            "author": "ronitabonita",
            "id": "jc3pmm0",
            "parent_id": "t1_jc39hnp",
            "score": 2,
            "created_utc": 1678739584.0,
            "replies": [
                {
                    "body": "Agreed, asking about it too early is definitely a bad thing.  I still remember one of my SBs from years ago, we had a great M&G and for our next meeting, she suggested a place more convenient to her place and she phrased it exactly that way 😉",
                    "author": "blk-tye",
                    "id": "jc3q71z",
                    "parent_id": "t1_jc3pmm0",
                    "score": 2,
                    "created_utc": 1678739803.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "jc5p5cp",
            "parent_id": "t1_jc5p5bk",
            "score": -1,
            "created_utc": 1678773258.0,
            "replies": []
        },
        {
            "body": "Ding ding ding\nWinner winner, chicken dinner!!!🐔🍗\n\n\nYet look at all of the male nay sayers. 🙄 \n\nThank you, Mr. Demille, you've shown your honest opinion within this matter, and once again, you're articulating for the actual gentlemen within this forum.",
            "author": "JustAsk4Alice",
            "id": "jc4cced",
            "parent_id": "t1_jc3morg",
            "score": 2,
            "created_utc": 1678748828.0,
            "replies": [
                {
                    "body": "How many whack answers and attacks did it take to get some semblance of understanding from a person with a penis?  Good lord!",
                    "author": "ronitabonita",
                    "id": "jc67zgu",
                    "parent_id": "t1_jc4cced",
                    "score": 2,
                    "created_utc": 1678789217.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly lol they’re not looking to be a sugar daddy, theyre looking to hook up with you probably once at minimal cost to them",
            "author": "Queen_Audrey",
            "id": "jc4etkj",
            "parent_id": "t1_jc3morg",
            "score": 1,
            "created_utc": 1678749886.0,
            "replies": []
        },
        {
            "body": "The SDs I’ve had never got a cheap hotel, because if you have money to be in the bowl then you should be able to budget for a nice hotel. You’re supposed to be a sugar daddy not a John lol",
            "author": "Queen_Audrey",
            "id": "jc4fqdw",
            "parent_id": "t1_jc4e2o5",
            "score": 2,
            "created_utc": 1678750279.0,
            "replies": [
                {
                    "body": "you can have lots of money and be willing to spend it and still be a John\n\nyou can have medium or low amount of money and still be a SD\n\nthe difference between the two isn't based on the amount of money, it's based on intent, attitude, and behavior",
                    "author": "joc13",
                    "id": "jc538vf",
                    "parent_id": "t1_jc4fqdw",
                    "score": 4,
                    "created_utc": 1678760720.0,
                    "replies": []
                },
                {
                    "body": "Good job not fully interpreting what I said.",
                    "author": "TheStoicbrother",
                    "id": "jc4gt6l",
                    "parent_id": "t1_jc4fqdw",
                    "score": 1,
                    "created_utc": 1678750746.0,
                    "replies": [
                        {
                            "body": "You don’t want to keep getting cheap hotels  : so don’t get a cheap hotel\nYou’d rather spend that money on time together or an Uber : you should have more than enough money for all of it, and if you’re not generous you shouldn’t be in the bowl. \nAssuming I misunderstood just bc you don’t agree w my opinion is funny though lol",
                            "author": "Queen_Audrey",
                            "id": "jc4k61w",
                            "parent_id": "t1_jc4gt6l",
                            "score": 3,
                            "created_utc": 1678752205.0,
                            "replies": [
                                {
                                    "body": "The ability to repeat what i said doesn't equal comprehension. It means you can read, congrats.\n\nThe price of the hotel isn't the issue here. SDs work hard to make money and they don't spend it *just to spend it*. Perhaps you believe that, hence why you've shuffled through \"many SDs\".  They spend it because what the experience/item/person they spend it on is *worth it*.\n\n I don't find spending money on hotels to be *worth it* if the primary purpose of the hotel is to get sugar from a distant SB.  Hence why, I would ask a distant POT SB \"Can you host?\"",
                                    "author": "TheStoicbrother",
                                    "id": "jc4xkai",
                                    "parent_id": "t1_jc4k61w",
                                    "score": 1,
                                    "created_utc": 1678758123.0,
                                    "replies": [
                                        {
                                            "body": "Clearly you’re the one not understanding. Money IS the issue. And you not being willing to spend it and asking if someone can host is unattractive. It’s not spending just to spend it, it’s being generous. That’s the whole point of the bowl. I’m not misunderstanding. I completely understand what you’re saying, and I’ve had successful relationships. But needing someone to host before you even do a m&g is unattractive and shows you don’t value the SB the way that I, and clearly OP, expect to be valued",
                                            "author": "Queen_Audrey",
                                            "id": "jc4yemf",
                                            "parent_id": "t1_jc4xkai",
                                            "score": 2,
                                            "created_utc": 1678758506.0,
                                            "replies": [
                                                {
                                                    "body": ">and I’ve had successful relationships.\n\nThat is an oxymoron, successful relationships would not end. If you break up with many partners then that means you are a *bad partner*.  Are you sure you want to double down on that one?\n\n\n\n\n\n>But needing someone to host before you even do a m&g is unattractive and shows you don’t value the SB the way that I, and clearly OP, expect to be valued\n\nIf you say so. There's no basis here, though. \n\n>it’s being generous\n\nI guess you'd rather have the hotel than gifts, allowance, or PPM. Interesting.",
                                                    "author": "TheStoicbrother",
                                                    "id": "jc4ztdk",
                                                    "parent_id": "t1_jc4yemf",
                                                    "score": 1,
                                                    "created_utc": 1678759142.0,
                                                    "replies": [
                                                        {
                                                            "body": "> That is an oxymoron, successful relationships would not end.\n\nCompletely disagree.  That's one of the things I *love* about sugar relationships.\n\nIt's about the journey;  not the destination.  I've had plenty of successful SRs - that are all over now.  Them ending does not change them being successful.\n\n> If you break up with many partners then that means you are a bad partner\n\nOr it just means you are getting older.",
                                                            "author": "SDstartingOut",
                                                            "id": "jc6izc6",
                                                            "parent_id": "t1_jc4ztdk",
                                                            "score": 0,
                                                            "created_utc": 1678796734.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "LOL. Successful relationships do end,  for one reason or another. And the point is that it is normal for an SD to provide a hotel AND gifts AND allowance, bc I don’t do PPM and this is about spoiling. Not about an “SD” who has a strict budget and can’t afford both. I find it unattractive, and  I won’t budge on that. If you’re insecure about your ability to provide that’s on you, but don’t project just bc SBs don’t settle for what you offer.",
                                                            "author": "Queen_Audrey",
                                                            "id": "jc50gwv",
                                                            "parent_id": "t1_jc4ztdk",
                                                            "score": -1,
                                                            "created_utc": 1678759441.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Okay. You can have your standards and keep running through SDs like hot cakes.  You clearly only care about yourself, and arguing. Done here lol",
                                                                    "author": "TheStoicbrother",
                                                                    "id": "jc51p8b",
                                                                    "parent_id": "t1_jc50gwv",
                                                                    "score": 2,
                                                                    "created_utc": 1678760004.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Imagine not having the critical thinking skills to understand that some relationships end for reasons outside of compatibility.\n\nYou absolutely captured the essence of what I was trying to say yet were insulted and called selfish and argumentative in the process. It’s no wonder we have to go through so many frogs to get to our prince.",
                                                                    "author": "ronitabonita",
                                                                    "id": "jc58fba",
                                                                    "parent_id": "t1_jc50gwv",
                                                                    "score": 1,
                                                                    "created_utc": 1678763173.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": ">  You’d rather spend that money on time together or an Uber : you should have more than enough money for all of it, and if you’re not generous you shouldn’t be in the bowl.\n\nDo you not realize how circular in logic this is?  Unless you are a literal whale, or are dying and spending all your money - you are going to have a budget.  \n\nMy sugar budget, between allowance, activities, gifts on special occasions, etc - is around 40k/year.  I don't use hotels.  If I had to use hotels - well, once I burned through all my accrued free nights - I would realistically have to change up my monthly allowance to fit within my budget.  \n\nDoes that really mean I don't have enough money to sugar?  You follow that logic, the bowl is a ghost town.",
                                    "author": "SDstartingOut",
                                    "id": "jc6iqgm",
                                    "parent_id": "t1_jc4k61w",
                                    "score": 1,
                                    "created_utc": 1678796595.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Usually men who are cheating on their wives and can’t meet in public or have a hotel room on a credit card lol",
            "author": "Queen_Audrey",
            "id": "jc4ems0",
            "parent_id": "t1_jc3ydkz",
            "score": 1,
            "created_utc": 1678749804.0,
            "replies": [
                {
                    "body": "I can only guess it's being to cheap. It's not impossible to go and open another bank account somewhere. Many hotels still take cash if there were absolutely NO other option.\n\nSometimes it feels like people act without a single shred of decency.",
                    "author": "C12H22O11-EU",
                    "id": "jc6pco0",
                    "parent_id": "t1_jc4ems0",
                    "score": 3,
                    "created_utc": 1678800042.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, I also hate it when women... *checks notes* ...value themselves and their time. \n\n/s",
            "author": "peregrine_nation",
            "id": "jc3s87c",
            "parent_id": "t1_jc3c7wx",
            "score": 3,
            "created_utc": 1678740590.0,
            "replies": [
                {
                    "body": "Take it for what it's worth, but so far, the women who told me not to waste their time were quite comfortable wasting mine.",
                    "author": "geeky-sd",
                    "id": "jc6zlyu",
                    "parent_id": "t1_jc3s87c",
                    "score": 2,
                    "created_utc": 1678804616.0,
                    "replies": []
                },
                {
                    "body": "Lmao literally😂 like should we apologize?? I’m sorry that us women are vocal about collectively raising our standards and it’s harder for salt daddies and broke boys to get laid for cheap",
                    "author": "Queen_Audrey",
                    "id": "jc4f6dz",
                    "parent_id": "t1_jc3s87c",
                    "score": 2,
                    "created_utc": 1678750040.0,
                    "replies": [
                        {
                            "body": "Lady - you are on fire 🔥🔥🔥.",
                            "author": "ronitabonita",
                            "id": "jc683ir",
                            "parent_id": "t1_jc4f6dz",
                            "score": 2,
                            "created_utc": 1678789311.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "it’s perfectly fine to value yourself, but it shows no class to tell someone that exact thing. Can you imagine a queen or princess saying I know my worth? No you can’t because that would show no class. Women that actually know their worth show it with their actions not their words.",
                    "author": "NickPfromYuma",
                    "id": "jc4lkik",
                    "parent_id": "t1_jc3s87c",
                    "score": 1,
                    "created_utc": 1678752811.0,
                    "replies": [
                        {
                            "body": "I can imagine them saying that, yeah. I don't think it's inherently wrong to say it directly. I *can* be trashy, depending on the context and delivery, but it's not automatically so.",
                            "author": "peregrine_nation",
                            "id": "jc4nm0n",
                            "parent_id": "t1_jc4lkik",
                            "score": -1,
                            "created_utc": 1678753693.0,
                            "replies": [
                                {
                                    "body": "a truly classy women knows her worth, but would never be so entitled to express that in actual words. It would be beneath her, to lower herself to the level of someone beneath her, to actually say those words to them. Instead she would show by her actions she was above them and be on her way.\n\nI dont think most women from your generation truly understand what class is, or how it actually acts. I find most women that say there are classy, arent.",
                                    "author": "NickPfromYuma",
                                    "id": "jc6e333",
                                    "parent_id": "t1_jc4nm0n",
                                    "score": 0,
                                    "created_utc": 1678793747.0,
                                    "replies": [
                                        {
                                            "body": "> I dont think most women from your generation\n\nYou don't know how old I am lol",
                                            "author": "peregrine_nation",
                                            "id": "jc71uao",
                                            "parent_id": "t1_jc6e333",
                                            "score": 1,
                                            "created_utc": 1678805544.0,
                                            "replies": [
                                                {
                                                    "body": "Im sure you're younger then me (if you arent, would you be interested in a slightly used male SB?) , when I said your generation I meant Millennial or Generation Z.\n\nI've never heard a women from my generation say \"I know my worth\" and if she did, guys my age would all agree that she was without class.",
                                                    "author": "NickPfromYuma",
                                                    "id": "jcakfp2",
                                                    "parent_id": "t1_jc71uao",
                                                    "score": 1,
                                                    "created_utc": 1678888385.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I do too until they feel that they have to announce it.  That tells every SD that neither their worth nor time has any intrinsic value. \n\nSwans don't need to squawk to get attention.  Crows do.",
                    "author": "rodeopete3281",
                    "id": "jc44t38",
                    "parent_id": "t1_jc3s87c",
                    "score": -1,
                    "created_utc": 1678745646.0,
                    "replies": [
                        {
                            "body": "Crows are awesome. And I don't think openly saying either of those things is instantly indicative of anything.",
                            "author": "peregrine_nation",
                            "id": "jc48z6y",
                            "parent_id": "t1_jc44t38",
                            "score": 2,
                            "created_utc": 1678747401.0,
                            "replies": [
                                {
                                    "body": "Crows are much more intelligent than swans, I think maybe his valuation of living things is a bit off lol",
                                    "author": "Queen_Audrey",
                                    "id": "jc4fby4",
                                    "parent_id": "t1_jc48z6y",
                                    "score": 5,
                                    "created_utc": 1678750108.0,
                                    "replies": []
                                },
                                {
                                    "body": "How precious.",
                                    "author": "rodeopete3281",
                                    "id": "jc49fht",
                                    "parent_id": "t1_jc48z6y",
                                    "score": 0,
                                    "created_utc": 1678747593.0,
                                    "replies": [
                                        {
                                            "body": "🥺❤️❤️❤️",
                                            "author": "peregrine_nation",
                                            "id": "jc4e2ga",
                                            "parent_id": "t1_jc49fht",
                                            "score": -2,
                                            "created_utc": 1678749561.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Pardon?",
            "author": "ronitabonita",
            "id": "jc3msae",
            "parent_id": "t1_jc3c7wx",
            "score": -2,
            "created_utc": 1678738491.0,
            "replies": [
                {
                    "body": "It's basically the equivalent of saying a platonic M&G will be paid. Hell, might even ask to be paid to talk to them before hand",
                    "author": "CrankyPelicans",
                    "id": "jc3yk2y",
                    "parent_id": "t1_jc3msae",
                    "score": 0,
                    "created_utc": 1678743087.0,
                    "replies": [
                        {
                            "body": "But it’s not.",
                            "author": "ronitabonita",
                            "id": "jc40vhs",
                            "parent_id": "t1_jc3yk2y",
                            "score": -1,
                            "created_utc": 1678744019.0,
                            "replies": [
                                {
                                    "body": "But it is.",
                                    "author": "rodeopete3281",
                                    "id": "jc44vjx",
                                    "parent_id": "t1_jc40vhs",
                                    "score": 0,
                                    "created_utc": 1678745675.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Read: Stop having boundaries and standards.",
            "author": "ronitabonita",
            "id": "jc418fq",
            "parent_id": "t1_jc3wb23",
            "score": 8,
            "created_utc": 1678744166.0,
            "replies": []
        },
        {
            "body": "Using the word \"defile\" says a hell of a lot about OP.",
            "author": "CrankyPelicans",
            "id": "jc3z115",
            "parent_id": "t1_jc3wb23",
            "score": 2,
            "created_utc": 1678743277.0,
            "replies": [
                {
                    "body": "I’m glad you’re paying attention.\n\nYou know what I’m not here to do....??? One and done sex with a guy who is just working on his self-esteem and body count.  It’s bad enough these clowns lead with sex instead of pretending for a second they have any level of respect for us as a person.\n\nYou know who gets full access to my body, any way he wants it, and never hears the word “no?” The *gentleman* who is kind and shows he is listening, communicates effectively about things besides his pleasure, and loves having adult conversation that stimulates the mind.  \n\nSo, yes ... I said “defile.”",
                    "author": "ronitabonita",
                    "id": "jc41qlr",
                    "parent_id": "t1_jc3z115",
                    "score": 5,
                    "created_utc": 1678744371.0,
                    "replies": [
                        {
                            "body": "The way you talk is demeaning to people who aren't like you. There are people out there looking for different arrangements than you are, and instead of viewing that with a \"live and let live\" mentality you are here bashing and attacking them in a roundabout way. So yes... your word choice says a lot about you.",
                            "author": "CrankyPelicans",
                            "id": "jc4c6bw",
                            "parent_id": "t1_jc41qlr",
                            "score": 3,
                            "created_utc": 1678748756.0,
                            "replies": [
                                {
                                    "body": "And???",
                                    "author": "ronitabonita",
                                    "id": "jc4d93o",
                                    "parent_id": "t1_jc4c6bw",
                                    "score": -1,
                                    "created_utc": 1678749213.0,
                                    "replies": [
                                        {
                                            "body": "He misses the point that sugar relationships are not the same as escorting…",
                                            "author": "Queen_Audrey",
                                            "id": "jc4exek",
                                            "parent_id": "t1_jc4d93o",
                                            "score": 1,
                                            "created_utc": 1678749932.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Smh TSD you would think with such an _expansive_ palette, you would know how to mix a Sex on the Beach.",
            "author": "SugarBabyVet",
            "id": "jc3c4fd",
            "parent_id": "t1_jc39yoq",
            "score": 1,
            "created_utc": 1678734404.0,
            "replies": []
        },
        {
            "body": "Easy enough - if the SD is single.  A complete double standard if he isn’t.\n\nAnd the point is that the inquiry happens right off the bat... not that it happens.",
            "author": "ronitabonita",
            "id": "jc4127a",
            "parent_id": "t1_jc40s4v",
            "score": 3,
            "created_utc": 1678744095.0,
            "replies": [
                {
                    "body": "But if you don't find that out up front and it is something you desire for any long term SR isn't it a waste of both parties time if they don't discuss that soon?  \n\nHow can one take issue with asking, are you eventually ok to host if things go well?  Certainly one wouldn't start with actually hosting, but knowing whether it is possible or entirely off the table is important to know before either party invests a lot of time.",
                    "author": "Mainlyharmless",
                    "id": "jctuhlh",
                    "parent_id": "t1_jc4127a",
                    "score": 1,
                    "created_utc": 1679237946.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Personally, I would much rather an SD offer me cash to book the room. I have done that with my AP and it’s a complete non-issue.\n\nGuess who ended up offering to host. This girl.  Because I am also not an asshole all the time.",
            "author": "ronitabonita",
            "id": "jc53m9y",
            "parent_id": "t1_jc52cws",
            "score": 1,
            "created_utc": 1678760898.0,
            "replies": []
        },
        {
            "body": "Really? \n\nWhat if his wife died of cancer and he's a single dad with young kids at home.  And out of respect for his children he's not going to bring a young girl over the house. \n\nSo this makes him a fraud because he can't host at his place?",
            "author": "andrew_david",
            "id": "jc5rvxh",
            "parent_id": "t1_jc5bjud",
            "score": 2,
            "created_utc": 1678775395.0,
            "replies": [
                {
                    "body": "he can host a hotel date still, right?",
                    "author": null,
                    "id": "jc6zdp6",
                    "parent_id": "t1_jc5rvxh",
                    "score": 1,
                    "created_utc": 1678804519.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know you’re not addressing me.  \n\nBecause I will snatch your soul on a first date *-at a hotel-* *-and after some courting and with a conversation about the design of the dynamic.-*\n\nTalk about missing the point entirely.",
            "author": "ronitabonita",
            "id": "jc40pnb",
            "parent_id": "t1_jc3y6km",
            "score": 2,
            "created_utc": 1678743952.0,
            "replies": [
                {
                    "body": "Just making it a point that the door swings both ways.\n\nAn awful lot of SD/men bashing goes on here.",
                    "author": null,
                    "id": "jc416pm",
                    "parent_id": "t1_jc40pnb",
                    "score": 5,
                    "created_utc": 1678744145.0,
                    "replies": [
                        {
                            "body": "People on here are speaking poorly of men who can’t afford to be in the bowl, and expect to treat women poorly because of it lol",
                            "author": "Queen_Audrey",
                            "id": "jc4fkeg",
                            "parent_id": "t1_jc416pm",
                            "score": 1,
                            "created_utc": 1678750207.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are absolutely right. That’s because if you read more closely you would understand that this conversation is happening to some of us on the front end, first conversation. Before scheduling any type of meeting\n\nSo, no, it’s not applicable to most SRs.  Good to know there are some smart ones out here and not just guys who want to defend unacceptable behavior.",
            "author": "ronitabonita",
            "id": "jc4crxh",
            "parent_id": "t1_jc49xpk",
            "score": 0,
            "created_utc": 1678749011.0,
            "replies": []
        },
        {
            "body": "You realize we have to weed through hundreds of disgusting jerks to get to our prized SD, right? \n\nYou’ll pardon us if we are a bit jaded at times.",
            "author": "ronitabonita",
            "id": "jc4cj2o",
            "parent_id": "t1_jc45pd5",
            "score": 0,
            "created_utc": 1678748906.0,
            "replies": []
        },
        {
            "body": "Except that a POT gym bro SD could easily overpower a 5’1” SB, dismember her and dispose of her body if he wanted to.  Things straight guys never have to think about.",
            "author": "ronitabonita",
            "id": "jc88dd3",
            "parent_id": "t1_jc6mfjf",
            "score": 1,
            "created_utc": 1678839807.0,
            "replies": [
                {
                    "body": "Agreed, but some SBs can do the same to a guy as well. I have been to a meet and greet or two where the SB has a car full of guys behind her. Lets just say I made a quick exit. Also, most of the gym bro guys arent SDs, they are posers. Usually those types do not have the means.  One usually gets the means after you work a real job for awhile and are over 35 or 40... One should be able to filter the posers out.",
                    "author": "KindAd6988",
                    "id": "jcakmfy",
                    "parent_id": "t1_jc88dd3",
                    "score": 1,
                    "created_utc": 1678888463.0,
                    "replies": []
                },
                {
                    "body": "I have been on meets where a car full of guys is there with the woman. It goes both ways. But gym bro guys are not usually sugar guy material. Life doesnt work that way usually. Unless they came into a lot of money young, they dont have the means.  A guy that has the means will usually be over 40, and is not spending half the day at the gym.",
                    "author": "KindAd6988",
                    "id": "je0bp2b",
                    "parent_id": "t1_jc88dd3",
                    "score": 1,
                    "created_utc": 1680013898.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Kudos for reserving sex for at least 10 hours after you’ve known a person, ha ha.",
            "author": "ronitabonita",
            "id": "jcg8r0g",
            "parent_id": "t1_jcg5285",
            "score": 2,
            "created_utc": 1678984989.0,
            "replies": []
        },
        {
            "body": "I love starting with a coffee meet and greet. One of my favs was we met at the kimball Art Museum to get to know each other, and it was lovely ♡♡♡",
            "author": "LadyAnastasia700",
            "id": "jc4jgh8",
            "parent_id": "t1_jc4hjrd",
            "score": 7,
            "created_utc": 1678751897.0,
            "replies": [
                {
                    "body": "In the LA  area the Hammer museum in Westwood is great in the evening/\n\nFor the privacy seeking a first meet the Getty Villa just north of Santa Monica (not the big Getty)  is great as reservations (free)  are required , there are great spots to have a private discussion while walking through the gardens .  Daytime only ..\n\nIf there is real interest in  pursuing the arrangement the Rodin exhibit may facilitate a discussion of likes and limitations.\n\nhttps://www.google.com/search?newwindow=1&sxsrf=AJOqlzUrNVMG13r-tU4LPzO0wPHvk-45zg%3A1678753661977&lei=fb8PZIyiO9u30PEPj6mCmA0&q=getty%20villa%20gardens&ved=2ahUKEwjM1L_dlNr9AhXbGzQIHY-UANMQsKwBKAJ6BQinARAD&biw=1280&bih=629&dpr=1.5#lpg=cid:CgIgAQ%3D%3D,ik:CAoSLEFGMVFpcE8wcW1GQjJsdGNhclhxSFNzc21FNXpuQmtRNjd4ZmNlMFB0RVJL",
                    "author": "pinotandsugar",
                    "id": "jc4olsc",
                    "parent_id": "t1_jc4jgh8",
                    "score": 5,
                    "created_utc": 1678754134.0,
                    "replies": [
                        {
                            "body": "That sounds breathtaking ♡ thank you for sharing",
                            "author": "LadyAnastasia700",
                            "id": "jc4q876",
                            "parent_id": "t1_jc4olsc",
                            "score": 2,
                            "created_utc": 1678754834.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "At least in Marrakech it smells like fancy spices and stuff 😂",
            "author": "Terrible-Fix-9798",
            "id": "jf3z7i0",
            "parent_id": "t1_jc4ty02",
            "score": 2,
            "created_utc": 1680732314.0,
            "replies": []
        },
        {
            "body": "Omg yes… but still, maybe no sometimes :)",
            "author": "Honeyyhive",
            "id": "jc3vdci",
            "parent_id": "t1_jc3o8n1",
            "score": 9,
            "created_utc": 1678741823.0,
            "replies": [
                {
                    "body": "Still no...MOST times haha.",
                    "author": "ronitabonita",
                    "id": "jc401rh",
                    "parent_id": "t1_jc3vdci",
                    "score": 5,
                    "created_utc": 1678743685.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Idky.....but after you mentioned OPSEC and possible cute but a psycho wifey;👀👀 the ravenous lioness, bad ass baddie within me, wanted to roar \"I wish a bitch would!!!!\"🤣🤣🤣🦁🦁💪🏼👊🏻💅",
            "author": "JustAsk4Alice",
            "id": "jc4a4du",
            "parent_id": "t1_jc3nm56",
            "score": 1,
            "created_utc": 1678747887.0,
            "replies": [
                {
                    "body": "Omg....I KNOW that this is a total ADHD moment, but try and stay with me, bc the visual is making lmao!!!\n\nBut can't you just see an Octogon and a wifey v. SB, ALL OUT BATTLE!!!🤣🤣🤣\n\nLET'S GET READDDDDY TO RUUUUUMBLE!!!!!!\n\n(Get's me kinda pumped just thinkin about it lol!🤗🤗🤗🫶👊🏻 But I love MMA and I'm also stronger than most chicks; so it would be a great workout, at the very least!)",
                    "author": "JustAsk4Alice",
                    "id": "jc4azi6",
                    "parent_id": "t1_jc4a4du",
                    "score": 1,
                    "created_utc": 1678748248.0,
                    "replies": []
                },
                {
                    "body": "So dead. I needed that laugh!\n\nI’m a lover, not a fighter 💕.",
                    "author": "ronitabonita",
                    "id": "jc4d01p",
                    "parent_id": "t1_jc4a4du",
                    "score": 1,
                    "created_utc": 1678749106.0,
                    "replies": [
                        {
                            "body": "😈😈😈😈  Baby, oh baby....I'm BOTH!!!!! \n<insert GROWL!!!>\n\nAND DAAAAMN GOOD AT BOTH!!!!!🥰😍😘😘🫶💪🏼👊🏻💅🤗",
                            "author": "JustAsk4Alice",
                            "id": "jc4dkxy",
                            "parent_id": "t1_jc4d01p",
                            "score": 3,
                            "created_utc": 1678749354.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed, asking about it too early is definitely a bad thing.  I still remember one of my SBs from years ago, we had a great M&G and for our next meeting, she suggested a place more convenient to her place and she phrased it exactly that way 😉",
            "author": "blk-tye",
            "id": "jc3q71z",
            "parent_id": "t1_jc3pmm0",
            "score": 2,
            "created_utc": 1678739803.0,
            "replies": []
        },
        {
            "body": "How many whack answers and attacks did it take to get some semblance of understanding from a person with a penis?  Good lord!",
            "author": "ronitabonita",
            "id": "jc67zgu",
            "parent_id": "t1_jc4cced",
            "score": 2,
            "created_utc": 1678789217.0,
            "replies": []
        },
        {
            "body": "you can have lots of money and be willing to spend it and still be a John\n\nyou can have medium or low amount of money and still be a SD\n\nthe difference between the two isn't based on the amount of money, it's based on intent, attitude, and behavior",
            "author": "joc13",
            "id": "jc538vf",
            "parent_id": "t1_jc4fqdw",
            "score": 4,
            "created_utc": 1678760720.0,
            "replies": []
        },
        {
            "body": "Good job not fully interpreting what I said.",
            "author": "TheStoicbrother",
            "id": "jc4gt6l",
            "parent_id": "t1_jc4fqdw",
            "score": 1,
            "created_utc": 1678750746.0,
            "replies": [
                {
                    "body": "You don’t want to keep getting cheap hotels  : so don’t get a cheap hotel\nYou’d rather spend that money on time together or an Uber : you should have more than enough money for all of it, and if you’re not generous you shouldn’t be in the bowl. \nAssuming I misunderstood just bc you don’t agree w my opinion is funny though lol",
                    "author": "Queen_Audrey",
                    "id": "jc4k61w",
                    "parent_id": "t1_jc4gt6l",
                    "score": 3,
                    "created_utc": 1678752205.0,
                    "replies": [
                        {
                            "body": "The ability to repeat what i said doesn't equal comprehension. It means you can read, congrats.\n\nThe price of the hotel isn't the issue here. SDs work hard to make money and they don't spend it *just to spend it*. Perhaps you believe that, hence why you've shuffled through \"many SDs\".  They spend it because what the experience/item/person they spend it on is *worth it*.\n\n I don't find spending money on hotels to be *worth it* if the primary purpose of the hotel is to get sugar from a distant SB.  Hence why, I would ask a distant POT SB \"Can you host?\"",
                            "author": "TheStoicbrother",
                            "id": "jc4xkai",
                            "parent_id": "t1_jc4k61w",
                            "score": 1,
                            "created_utc": 1678758123.0,
                            "replies": [
                                {
                                    "body": "Clearly you’re the one not understanding. Money IS the issue. And you not being willing to spend it and asking if someone can host is unattractive. It’s not spending just to spend it, it’s being generous. That’s the whole point of the bowl. I’m not misunderstanding. I completely understand what you’re saying, and I’ve had successful relationships. But needing someone to host before you even do a m&g is unattractive and shows you don’t value the SB the way that I, and clearly OP, expect to be valued",
                                    "author": "Queen_Audrey",
                                    "id": "jc4yemf",
                                    "parent_id": "t1_jc4xkai",
                                    "score": 2,
                                    "created_utc": 1678758506.0,
                                    "replies": [
                                        {
                                            "body": ">and I’ve had successful relationships.\n\nThat is an oxymoron, successful relationships would not end. If you break up with many partners then that means you are a *bad partner*.  Are you sure you want to double down on that one?\n\n\n\n\n\n>But needing someone to host before you even do a m&g is unattractive and shows you don’t value the SB the way that I, and clearly OP, expect to be valued\n\nIf you say so. There's no basis here, though. \n\n>it’s being generous\n\nI guess you'd rather have the hotel than gifts, allowance, or PPM. Interesting.",
                                            "author": "TheStoicbrother",
                                            "id": "jc4ztdk",
                                            "parent_id": "t1_jc4yemf",
                                            "score": 1,
                                            "created_utc": 1678759142.0,
                                            "replies": [
                                                {
                                                    "body": "> That is an oxymoron, successful relationships would not end.\n\nCompletely disagree.  That's one of the things I *love* about sugar relationships.\n\nIt's about the journey;  not the destination.  I've had plenty of successful SRs - that are all over now.  Them ending does not change them being successful.\n\n> If you break up with many partners then that means you are a bad partner\n\nOr it just means you are getting older.",
                                                    "author": "SDstartingOut",
                                                    "id": "jc6izc6",
                                                    "parent_id": "t1_jc4ztdk",
                                                    "score": 0,
                                                    "created_utc": 1678796734.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "LOL. Successful relationships do end,  for one reason or another. And the point is that it is normal for an SD to provide a hotel AND gifts AND allowance, bc I don’t do PPM and this is about spoiling. Not about an “SD” who has a strict budget and can’t afford both. I find it unattractive, and  I won’t budge on that. If you’re insecure about your ability to provide that’s on you, but don’t project just bc SBs don’t settle for what you offer.",
                                                    "author": "Queen_Audrey",
                                                    "id": "jc50gwv",
                                                    "parent_id": "t1_jc4ztdk",
                                                    "score": -1,
                                                    "created_utc": 1678759441.0,
                                                    "replies": [
                                                        {
                                                            "body": "Okay. You can have your standards and keep running through SDs like hot cakes.  You clearly only care about yourself, and arguing. Done here lol",
                                                            "author": "TheStoicbrother",
                                                            "id": "jc51p8b",
                                                            "parent_id": "t1_jc50gwv",
                                                            "score": 2,
                                                            "created_utc": 1678760004.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Imagine not having the critical thinking skills to understand that some relationships end for reasons outside of compatibility.\n\nYou absolutely captured the essence of what I was trying to say yet were insulted and called selfish and argumentative in the process. It’s no wonder we have to go through so many frogs to get to our prince.",
                                                            "author": "ronitabonita",
                                                            "id": "jc58fba",
                                                            "parent_id": "t1_jc50gwv",
                                                            "score": 1,
                                                            "created_utc": 1678763173.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">  You’d rather spend that money on time together or an Uber : you should have more than enough money for all of it, and if you’re not generous you shouldn’t be in the bowl.\n\nDo you not realize how circular in logic this is?  Unless you are a literal whale, or are dying and spending all your money - you are going to have a budget.  \n\nMy sugar budget, between allowance, activities, gifts on special occasions, etc - is around 40k/year.  I don't use hotels.  If I had to use hotels - well, once I burned through all my accrued free nights - I would realistically have to change up my monthly allowance to fit within my budget.  \n\nDoes that really mean I don't have enough money to sugar?  You follow that logic, the bowl is a ghost town.",
                            "author": "SDstartingOut",
                            "id": "jc6iqgm",
                            "parent_id": "t1_jc4k61w",
                            "score": 1,
                            "created_utc": 1678796595.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can only guess it's being to cheap. It's not impossible to go and open another bank account somewhere. Many hotels still take cash if there were absolutely NO other option.\n\nSometimes it feels like people act without a single shred of decency.",
            "author": "C12H22O11-EU",
            "id": "jc6pco0",
            "parent_id": "t1_jc4ems0",
            "score": 3,
            "created_utc": 1678800042.0,
            "replies": []
        },
        {
            "body": "Take it for what it's worth, but so far, the women who told me not to waste their time were quite comfortable wasting mine.",
            "author": "geeky-sd",
            "id": "jc6zlyu",
            "parent_id": "t1_jc3s87c",
            "score": 2,
            "created_utc": 1678804616.0,
            "replies": []
        },
        {
            "body": "Lmao literally😂 like should we apologize?? I’m sorry that us women are vocal about collectively raising our standards and it’s harder for salt daddies and broke boys to get laid for cheap",
            "author": "Queen_Audrey",
            "id": "jc4f6dz",
            "parent_id": "t1_jc3s87c",
            "score": 2,
            "created_utc": 1678750040.0,
            "replies": [
                {
                    "body": "Lady - you are on fire 🔥🔥🔥.",
                    "author": "ronitabonita",
                    "id": "jc683ir",
                    "parent_id": "t1_jc4f6dz",
                    "score": 2,
                    "created_utc": 1678789311.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "it’s perfectly fine to value yourself, but it shows no class to tell someone that exact thing. Can you imagine a queen or princess saying I know my worth? No you can’t because that would show no class. Women that actually know their worth show it with their actions not their words.",
            "author": "NickPfromYuma",
            "id": "jc4lkik",
            "parent_id": "t1_jc3s87c",
            "score": 1,
            "created_utc": 1678752811.0,
            "replies": [
                {
                    "body": "I can imagine them saying that, yeah. I don't think it's inherently wrong to say it directly. I *can* be trashy, depending on the context and delivery, but it's not automatically so.",
                    "author": "peregrine_nation",
                    "id": "jc4nm0n",
                    "parent_id": "t1_jc4lkik",
                    "score": -1,
                    "created_utc": 1678753693.0,
                    "replies": [
                        {
                            "body": "a truly classy women knows her worth, but would never be so entitled to express that in actual words. It would be beneath her, to lower herself to the level of someone beneath her, to actually say those words to them. Instead she would show by her actions she was above them and be on her way.\n\nI dont think most women from your generation truly understand what class is, or how it actually acts. I find most women that say there are classy, arent.",
                            "author": "NickPfromYuma",
                            "id": "jc6e333",
                            "parent_id": "t1_jc4nm0n",
                            "score": 0,
                            "created_utc": 1678793747.0,
                            "replies": [
                                {
                                    "body": "> I dont think most women from your generation\n\nYou don't know how old I am lol",
                                    "author": "peregrine_nation",
                                    "id": "jc71uao",
                                    "parent_id": "t1_jc6e333",
                                    "score": 1,
                                    "created_utc": 1678805544.0,
                                    "replies": [
                                        {
                                            "body": "Im sure you're younger then me (if you arent, would you be interested in a slightly used male SB?) , when I said your generation I meant Millennial or Generation Z.\n\nI've never heard a women from my generation say \"I know my worth\" and if she did, guys my age would all agree that she was without class.",
                                            "author": "NickPfromYuma",
                                            "id": "jcakfp2",
                                            "parent_id": "t1_jc71uao",
                                            "score": 1,
                                            "created_utc": 1678888385.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I do too until they feel that they have to announce it.  That tells every SD that neither their worth nor time has any intrinsic value. \n\nSwans don't need to squawk to get attention.  Crows do.",
            "author": "rodeopete3281",
            "id": "jc44t38",
            "parent_id": "t1_jc3s87c",
            "score": -1,
            "created_utc": 1678745646.0,
            "replies": [
                {
                    "body": "Crows are awesome. And I don't think openly saying either of those things is instantly indicative of anything.",
                    "author": "peregrine_nation",
                    "id": "jc48z6y",
                    "parent_id": "t1_jc44t38",
                    "score": 2,
                    "created_utc": 1678747401.0,
                    "replies": [
                        {
                            "body": "Crows are much more intelligent than swans, I think maybe his valuation of living things is a bit off lol",
                            "author": "Queen_Audrey",
                            "id": "jc4fby4",
                            "parent_id": "t1_jc48z6y",
                            "score": 5,
                            "created_utc": 1678750108.0,
                            "replies": []
                        },
                        {
                            "body": "How precious.",
                            "author": "rodeopete3281",
                            "id": "jc49fht",
                            "parent_id": "t1_jc48z6y",
                            "score": 0,
                            "created_utc": 1678747593.0,
                            "replies": [
                                {
                                    "body": "🥺❤️❤️❤️",
                                    "author": "peregrine_nation",
                                    "id": "jc4e2ga",
                                    "parent_id": "t1_jc49fht",
                                    "score": -2,
                                    "created_utc": 1678749561.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's basically the equivalent of saying a platonic M&G will be paid. Hell, might even ask to be paid to talk to them before hand",
            "author": "CrankyPelicans",
            "id": "jc3yk2y",
            "parent_id": "t1_jc3msae",
            "score": 0,
            "created_utc": 1678743087.0,
            "replies": [
                {
                    "body": "But it’s not.",
                    "author": "ronitabonita",
                    "id": "jc40vhs",
                    "parent_id": "t1_jc3yk2y",
                    "score": -1,
                    "created_utc": 1678744019.0,
                    "replies": [
                        {
                            "body": "But it is.",
                            "author": "rodeopete3281",
                            "id": "jc44vjx",
                            "parent_id": "t1_jc40vhs",
                            "score": 0,
                            "created_utc": 1678745675.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m glad you’re paying attention.\n\nYou know what I’m not here to do....??? One and done sex with a guy who is just working on his self-esteem and body count.  It’s bad enough these clowns lead with sex instead of pretending for a second they have any level of respect for us as a person.\n\nYou know who gets full access to my body, any way he wants it, and never hears the word “no?” The *gentleman* who is kind and shows he is listening, communicates effectively about things besides his pleasure, and loves having adult conversation that stimulates the mind.  \n\nSo, yes ... I said “defile.”",
            "author": "ronitabonita",
            "id": "jc41qlr",
            "parent_id": "t1_jc3z115",
            "score": 5,
            "created_utc": 1678744371.0,
            "replies": [
                {
                    "body": "The way you talk is demeaning to people who aren't like you. There are people out there looking for different arrangements than you are, and instead of viewing that with a \"live and let live\" mentality you are here bashing and attacking them in a roundabout way. So yes... your word choice says a lot about you.",
                    "author": "CrankyPelicans",
                    "id": "jc4c6bw",
                    "parent_id": "t1_jc41qlr",
                    "score": 3,
                    "created_utc": 1678748756.0,
                    "replies": [
                        {
                            "body": "And???",
                            "author": "ronitabonita",
                            "id": "jc4d93o",
                            "parent_id": "t1_jc4c6bw",
                            "score": -1,
                            "created_utc": 1678749213.0,
                            "replies": [
                                {
                                    "body": "He misses the point that sugar relationships are not the same as escorting…",
                                    "author": "Queen_Audrey",
                                    "id": "jc4exek",
                                    "parent_id": "t1_jc4d93o",
                                    "score": 1,
                                    "created_utc": 1678749932.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "But if you don't find that out up front and it is something you desire for any long term SR isn't it a waste of both parties time if they don't discuss that soon?  \n\nHow can one take issue with asking, are you eventually ok to host if things go well?  Certainly one wouldn't start with actually hosting, but knowing whether it is possible or entirely off the table is important to know before either party invests a lot of time.",
            "author": "Mainlyharmless",
            "id": "jctuhlh",
            "parent_id": "t1_jc4127a",
            "score": 1,
            "created_utc": 1679237946.0,
            "replies": []
        },
        {
            "body": "he can host a hotel date still, right?",
            "author": null,
            "id": "jc6zdp6",
            "parent_id": "t1_jc5rvxh",
            "score": 1,
            "created_utc": 1678804519.0,
            "replies": []
        },
        {
            "body": "Just making it a point that the door swings both ways.\n\nAn awful lot of SD/men bashing goes on here.",
            "author": null,
            "id": "jc416pm",
            "parent_id": "t1_jc40pnb",
            "score": 5,
            "created_utc": 1678744145.0,
            "replies": [
                {
                    "body": "People on here are speaking poorly of men who can’t afford to be in the bowl, and expect to treat women poorly because of it lol",
                    "author": "Queen_Audrey",
                    "id": "jc4fkeg",
                    "parent_id": "t1_jc416pm",
                    "score": 1,
                    "created_utc": 1678750207.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed, but some SBs can do the same to a guy as well. I have been to a meet and greet or two where the SB has a car full of guys behind her. Lets just say I made a quick exit. Also, most of the gym bro guys arent SDs, they are posers. Usually those types do not have the means.  One usually gets the means after you work a real job for awhile and are over 35 or 40... One should be able to filter the posers out.",
            "author": "KindAd6988",
            "id": "jcakmfy",
            "parent_id": "t1_jc88dd3",
            "score": 1,
            "created_utc": 1678888463.0,
            "replies": []
        },
        {
            "body": "I have been on meets where a car full of guys is there with the woman. It goes both ways. But gym bro guys are not usually sugar guy material. Life doesnt work that way usually. Unless they came into a lot of money young, they dont have the means.  A guy that has the means will usually be over 40, and is not spending half the day at the gym.",
            "author": "KindAd6988",
            "id": "je0bp2b",
            "parent_id": "t1_jc88dd3",
            "score": 1,
            "created_utc": 1680013898.0,
            "replies": []
        },
        {
            "body": "In the LA  area the Hammer museum in Westwood is great in the evening/\n\nFor the privacy seeking a first meet the Getty Villa just north of Santa Monica (not the big Getty)  is great as reservations (free)  are required , there are great spots to have a private discussion while walking through the gardens .  Daytime only ..\n\nIf there is real interest in  pursuing the arrangement the Rodin exhibit may facilitate a discussion of likes and limitations.\n\nhttps://www.google.com/search?newwindow=1&sxsrf=AJOqlzUrNVMG13r-tU4LPzO0wPHvk-45zg%3A1678753661977&lei=fb8PZIyiO9u30PEPj6mCmA0&q=getty%20villa%20gardens&ved=2ahUKEwjM1L_dlNr9AhXbGzQIHY-UANMQsKwBKAJ6BQinARAD&biw=1280&bih=629&dpr=1.5#lpg=cid:CgIgAQ%3D%3D,ik:CAoSLEFGMVFpcE8wcW1GQjJsdGNhclhxSFNzc21FNXpuQmtRNjd4ZmNlMFB0RVJL",
            "author": "pinotandsugar",
            "id": "jc4olsc",
            "parent_id": "t1_jc4jgh8",
            "score": 5,
            "created_utc": 1678754134.0,
            "replies": [
                {
                    "body": "That sounds breathtaking ♡ thank you for sharing",
                    "author": "LadyAnastasia700",
                    "id": "jc4q876",
                    "parent_id": "t1_jc4olsc",
                    "score": 2,
                    "created_utc": 1678754834.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Still no...MOST times haha.",
            "author": "ronitabonita",
            "id": "jc401rh",
            "parent_id": "t1_jc3vdci",
            "score": 5,
            "created_utc": 1678743685.0,
            "replies": []
        },
        {
            "body": "Omg....I KNOW that this is a total ADHD moment, but try and stay with me, bc the visual is making lmao!!!\n\nBut can't you just see an Octogon and a wifey v. SB, ALL OUT BATTLE!!!🤣🤣🤣\n\nLET'S GET READDDDDY TO RUUUUUMBLE!!!!!!\n\n(Get's me kinda pumped just thinkin about it lol!🤗🤗🤗🫶👊🏻 But I love MMA and I'm also stronger than most chicks; so it would be a great workout, at the very least!)",
            "author": "JustAsk4Alice",
            "id": "jc4azi6",
            "parent_id": "t1_jc4a4du",
            "score": 1,
            "created_utc": 1678748248.0,
            "replies": []
        },
        {
            "body": "So dead. I needed that laugh!\n\nI’m a lover, not a fighter 💕.",
            "author": "ronitabonita",
            "id": "jc4d01p",
            "parent_id": "t1_jc4a4du",
            "score": 1,
            "created_utc": 1678749106.0,
            "replies": [
                {
                    "body": "😈😈😈😈  Baby, oh baby....I'm BOTH!!!!! \n<insert GROWL!!!>\n\nAND DAAAAMN GOOD AT BOTH!!!!!🥰😍😘😘🫶💪🏼👊🏻💅🤗",
                    "author": "JustAsk4Alice",
                    "id": "jc4dkxy",
                    "parent_id": "t1_jc4d01p",
                    "score": 3,
                    "created_utc": 1678749354.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You don’t want to keep getting cheap hotels  : so don’t get a cheap hotel\nYou’d rather spend that money on time together or an Uber : you should have more than enough money for all of it, and if you’re not generous you shouldn’t be in the bowl. \nAssuming I misunderstood just bc you don’t agree w my opinion is funny though lol",
            "author": "Queen_Audrey",
            "id": "jc4k61w",
            "parent_id": "t1_jc4gt6l",
            "score": 3,
            "created_utc": 1678752205.0,
            "replies": [
                {
                    "body": "The ability to repeat what i said doesn't equal comprehension. It means you can read, congrats.\n\nThe price of the hotel isn't the issue here. SDs work hard to make money and they don't spend it *just to spend it*. Perhaps you believe that, hence why you've shuffled through \"many SDs\".  They spend it because what the experience/item/person they spend it on is *worth it*.\n\n I don't find spending money on hotels to be *worth it* if the primary purpose of the hotel is to get sugar from a distant SB.  Hence why, I would ask a distant POT SB \"Can you host?\"",
                    "author": "TheStoicbrother",
                    "id": "jc4xkai",
                    "parent_id": "t1_jc4k61w",
                    "score": 1,
                    "created_utc": 1678758123.0,
                    "replies": [
                        {
                            "body": "Clearly you’re the one not understanding. Money IS the issue. And you not being willing to spend it and asking if someone can host is unattractive. It’s not spending just to spend it, it’s being generous. That’s the whole point of the bowl. I’m not misunderstanding. I completely understand what you’re saying, and I’ve had successful relationships. But needing someone to host before you even do a m&g is unattractive and shows you don’t value the SB the way that I, and clearly OP, expect to be valued",
                            "author": "Queen_Audrey",
                            "id": "jc4yemf",
                            "parent_id": "t1_jc4xkai",
                            "score": 2,
                            "created_utc": 1678758506.0,
                            "replies": [
                                {
                                    "body": ">and I’ve had successful relationships.\n\nThat is an oxymoron, successful relationships would not end. If you break up with many partners then that means you are a *bad partner*.  Are you sure you want to double down on that one?\n\n\n\n\n\n>But needing someone to host before you even do a m&g is unattractive and shows you don’t value the SB the way that I, and clearly OP, expect to be valued\n\nIf you say so. There's no basis here, though. \n\n>it’s being generous\n\nI guess you'd rather have the hotel than gifts, allowance, or PPM. Interesting.",
                                    "author": "TheStoicbrother",
                                    "id": "jc4ztdk",
                                    "parent_id": "t1_jc4yemf",
                                    "score": 1,
                                    "created_utc": 1678759142.0,
                                    "replies": [
                                        {
                                            "body": "> That is an oxymoron, successful relationships would not end.\n\nCompletely disagree.  That's one of the things I *love* about sugar relationships.\n\nIt's about the journey;  not the destination.  I've had plenty of successful SRs - that are all over now.  Them ending does not change them being successful.\n\n> If you break up with many partners then that means you are a bad partner\n\nOr it just means you are getting older.",
                                            "author": "SDstartingOut",
                                            "id": "jc6izc6",
                                            "parent_id": "t1_jc4ztdk",
                                            "score": 0,
                                            "created_utc": 1678796734.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "LOL. Successful relationships do end,  for one reason or another. And the point is that it is normal for an SD to provide a hotel AND gifts AND allowance, bc I don’t do PPM and this is about spoiling. Not about an “SD” who has a strict budget and can’t afford both. I find it unattractive, and  I won’t budge on that. If you’re insecure about your ability to provide that’s on you, but don’t project just bc SBs don’t settle for what you offer.",
                                            "author": "Queen_Audrey",
                                            "id": "jc50gwv",
                                            "parent_id": "t1_jc4ztdk",
                                            "score": -1,
                                            "created_utc": 1678759441.0,
                                            "replies": [
                                                {
                                                    "body": "Okay. You can have your standards and keep running through SDs like hot cakes.  You clearly only care about yourself, and arguing. Done here lol",
                                                    "author": "TheStoicbrother",
                                                    "id": "jc51p8b",
                                                    "parent_id": "t1_jc50gwv",
                                                    "score": 2,
                                                    "created_utc": 1678760004.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Imagine not having the critical thinking skills to understand that some relationships end for reasons outside of compatibility.\n\nYou absolutely captured the essence of what I was trying to say yet were insulted and called selfish and argumentative in the process. It’s no wonder we have to go through so many frogs to get to our prince.",
                                                    "author": "ronitabonita",
                                                    "id": "jc58fba",
                                                    "parent_id": "t1_jc50gwv",
                                                    "score": 1,
                                                    "created_utc": 1678763173.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">  You’d rather spend that money on time together or an Uber : you should have more than enough money for all of it, and if you’re not generous you shouldn’t be in the bowl.\n\nDo you not realize how circular in logic this is?  Unless you are a literal whale, or are dying and spending all your money - you are going to have a budget.  \n\nMy sugar budget, between allowance, activities, gifts on special occasions, etc - is around 40k/year.  I don't use hotels.  If I had to use hotels - well, once I burned through all my accrued free nights - I would realistically have to change up my monthly allowance to fit within my budget.  \n\nDoes that really mean I don't have enough money to sugar?  You follow that logic, the bowl is a ghost town.",
                    "author": "SDstartingOut",
                    "id": "jc6iqgm",
                    "parent_id": "t1_jc4k61w",
                    "score": 1,
                    "created_utc": 1678796595.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lady - you are on fire 🔥🔥🔥.",
            "author": "ronitabonita",
            "id": "jc683ir",
            "parent_id": "t1_jc4f6dz",
            "score": 2,
            "created_utc": 1678789311.0,
            "replies": []
        },
        {
            "body": "I can imagine them saying that, yeah. I don't think it's inherently wrong to say it directly. I *can* be trashy, depending on the context and delivery, but it's not automatically so.",
            "author": "peregrine_nation",
            "id": "jc4nm0n",
            "parent_id": "t1_jc4lkik",
            "score": -1,
            "created_utc": 1678753693.0,
            "replies": [
                {
                    "body": "a truly classy women knows her worth, but would never be so entitled to express that in actual words. It would be beneath her, to lower herself to the level of someone beneath her, to actually say those words to them. Instead she would show by her actions she was above them and be on her way.\n\nI dont think most women from your generation truly understand what class is, or how it actually acts. I find most women that say there are classy, arent.",
                    "author": "NickPfromYuma",
                    "id": "jc6e333",
                    "parent_id": "t1_jc4nm0n",
                    "score": 0,
                    "created_utc": 1678793747.0,
                    "replies": [
                        {
                            "body": "> I dont think most women from your generation\n\nYou don't know how old I am lol",
                            "author": "peregrine_nation",
                            "id": "jc71uao",
                            "parent_id": "t1_jc6e333",
                            "score": 1,
                            "created_utc": 1678805544.0,
                            "replies": [
                                {
                                    "body": "Im sure you're younger then me (if you arent, would you be interested in a slightly used male SB?) , when I said your generation I meant Millennial or Generation Z.\n\nI've never heard a women from my generation say \"I know my worth\" and if she did, guys my age would all agree that she was without class.",
                                    "author": "NickPfromYuma",
                                    "id": "jcakfp2",
                                    "parent_id": "t1_jc71uao",
                                    "score": 1,
                                    "created_utc": 1678888385.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Crows are awesome. And I don't think openly saying either of those things is instantly indicative of anything.",
            "author": "peregrine_nation",
            "id": "jc48z6y",
            "parent_id": "t1_jc44t38",
            "score": 2,
            "created_utc": 1678747401.0,
            "replies": [
                {
                    "body": "Crows are much more intelligent than swans, I think maybe his valuation of living things is a bit off lol",
                    "author": "Queen_Audrey",
                    "id": "jc4fby4",
                    "parent_id": "t1_jc48z6y",
                    "score": 5,
                    "created_utc": 1678750108.0,
                    "replies": []
                },
                {
                    "body": "How precious.",
                    "author": "rodeopete3281",
                    "id": "jc49fht",
                    "parent_id": "t1_jc48z6y",
                    "score": 0,
                    "created_utc": 1678747593.0,
                    "replies": [
                        {
                            "body": "🥺❤️❤️❤️",
                            "author": "peregrine_nation",
                            "id": "jc4e2ga",
                            "parent_id": "t1_jc49fht",
                            "score": -2,
                            "created_utc": 1678749561.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "But it’s not.",
            "author": "ronitabonita",
            "id": "jc40vhs",
            "parent_id": "t1_jc3yk2y",
            "score": -1,
            "created_utc": 1678744019.0,
            "replies": [
                {
                    "body": "But it is.",
                    "author": "rodeopete3281",
                    "id": "jc44vjx",
                    "parent_id": "t1_jc40vhs",
                    "score": 0,
                    "created_utc": 1678745675.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The way you talk is demeaning to people who aren't like you. There are people out there looking for different arrangements than you are, and instead of viewing that with a \"live and let live\" mentality you are here bashing and attacking them in a roundabout way. So yes... your word choice says a lot about you.",
            "author": "CrankyPelicans",
            "id": "jc4c6bw",
            "parent_id": "t1_jc41qlr",
            "score": 3,
            "created_utc": 1678748756.0,
            "replies": [
                {
                    "body": "And???",
                    "author": "ronitabonita",
                    "id": "jc4d93o",
                    "parent_id": "t1_jc4c6bw",
                    "score": -1,
                    "created_utc": 1678749213.0,
                    "replies": [
                        {
                            "body": "He misses the point that sugar relationships are not the same as escorting…",
                            "author": "Queen_Audrey",
                            "id": "jc4exek",
                            "parent_id": "t1_jc4d93o",
                            "score": 1,
                            "created_utc": 1678749932.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "People on here are speaking poorly of men who can’t afford to be in the bowl, and expect to treat women poorly because of it lol",
            "author": "Queen_Audrey",
            "id": "jc4fkeg",
            "parent_id": "t1_jc416pm",
            "score": 1,
            "created_utc": 1678750207.0,
            "replies": []
        },
        {
            "body": "That sounds breathtaking ♡ thank you for sharing",
            "author": "LadyAnastasia700",
            "id": "jc4q876",
            "parent_id": "t1_jc4olsc",
            "score": 2,
            "created_utc": 1678754834.0,
            "replies": []
        },
        {
            "body": "😈😈😈😈  Baby, oh baby....I'm BOTH!!!!! \n<insert GROWL!!!>\n\nAND DAAAAMN GOOD AT BOTH!!!!!🥰😍😘😘🫶💪🏼👊🏻💅🤗",
            "author": "JustAsk4Alice",
            "id": "jc4dkxy",
            "parent_id": "t1_jc4d01p",
            "score": 3,
            "created_utc": 1678749354.0,
            "replies": []
        },
        {
            "body": "The ability to repeat what i said doesn't equal comprehension. It means you can read, congrats.\n\nThe price of the hotel isn't the issue here. SDs work hard to make money and they don't spend it *just to spend it*. Perhaps you believe that, hence why you've shuffled through \"many SDs\".  They spend it because what the experience/item/person they spend it on is *worth it*.\n\n I don't find spending money on hotels to be *worth it* if the primary purpose of the hotel is to get sugar from a distant SB.  Hence why, I would ask a distant POT SB \"Can you host?\"",
            "author": "TheStoicbrother",
            "id": "jc4xkai",
            "parent_id": "t1_jc4k61w",
            "score": 1,
            "created_utc": 1678758123.0,
            "replies": [
                {
                    "body": "Clearly you’re the one not understanding. Money IS the issue. And you not being willing to spend it and asking if someone can host is unattractive. It’s not spending just to spend it, it’s being generous. That’s the whole point of the bowl. I’m not misunderstanding. I completely understand what you’re saying, and I’ve had successful relationships. But needing someone to host before you even do a m&g is unattractive and shows you don’t value the SB the way that I, and clearly OP, expect to be valued",
                    "author": "Queen_Audrey",
                    "id": "jc4yemf",
                    "parent_id": "t1_jc4xkai",
                    "score": 2,
                    "created_utc": 1678758506.0,
                    "replies": [
                        {
                            "body": ">and I’ve had successful relationships.\n\nThat is an oxymoron, successful relationships would not end. If you break up with many partners then that means you are a *bad partner*.  Are you sure you want to double down on that one?\n\n\n\n\n\n>But needing someone to host before you even do a m&g is unattractive and shows you don’t value the SB the way that I, and clearly OP, expect to be valued\n\nIf you say so. There's no basis here, though. \n\n>it’s being generous\n\nI guess you'd rather have the hotel than gifts, allowance, or PPM. Interesting.",
                            "author": "TheStoicbrother",
                            "id": "jc4ztdk",
                            "parent_id": "t1_jc4yemf",
                            "score": 1,
                            "created_utc": 1678759142.0,
                            "replies": [
                                {
                                    "body": "> That is an oxymoron, successful relationships would not end.\n\nCompletely disagree.  That's one of the things I *love* about sugar relationships.\n\nIt's about the journey;  not the destination.  I've had plenty of successful SRs - that are all over now.  Them ending does not change them being successful.\n\n> If you break up with many partners then that means you are a bad partner\n\nOr it just means you are getting older.",
                                    "author": "SDstartingOut",
                                    "id": "jc6izc6",
                                    "parent_id": "t1_jc4ztdk",
                                    "score": 0,
                                    "created_utc": 1678796734.0,
                                    "replies": []
                                },
                                {
                                    "body": "LOL. Successful relationships do end,  for one reason or another. And the point is that it is normal for an SD to provide a hotel AND gifts AND allowance, bc I don’t do PPM and this is about spoiling. Not about an “SD” who has a strict budget and can’t afford both. I find it unattractive, and  I won’t budge on that. If you’re insecure about your ability to provide that’s on you, but don’t project just bc SBs don’t settle for what you offer.",
                                    "author": "Queen_Audrey",
                                    "id": "jc50gwv",
                                    "parent_id": "t1_jc4ztdk",
                                    "score": -1,
                                    "created_utc": 1678759441.0,
                                    "replies": [
                                        {
                                            "body": "Okay. You can have your standards and keep running through SDs like hot cakes.  You clearly only care about yourself, and arguing. Done here lol",
                                            "author": "TheStoicbrother",
                                            "id": "jc51p8b",
                                            "parent_id": "t1_jc50gwv",
                                            "score": 2,
                                            "created_utc": 1678760004.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Imagine not having the critical thinking skills to understand that some relationships end for reasons outside of compatibility.\n\nYou absolutely captured the essence of what I was trying to say yet were insulted and called selfish and argumentative in the process. It’s no wonder we have to go through so many frogs to get to our prince.",
                                            "author": "ronitabonita",
                                            "id": "jc58fba",
                                            "parent_id": "t1_jc50gwv",
                                            "score": 1,
                                            "created_utc": 1678763173.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">  You’d rather spend that money on time together or an Uber : you should have more than enough money for all of it, and if you’re not generous you shouldn’t be in the bowl.\n\nDo you not realize how circular in logic this is?  Unless you are a literal whale, or are dying and spending all your money - you are going to have a budget.  \n\nMy sugar budget, between allowance, activities, gifts on special occasions, etc - is around 40k/year.  I don't use hotels.  If I had to use hotels - well, once I burned through all my accrued free nights - I would realistically have to change up my monthly allowance to fit within my budget.  \n\nDoes that really mean I don't have enough money to sugar?  You follow that logic, the bowl is a ghost town.",
            "author": "SDstartingOut",
            "id": "jc6iqgm",
            "parent_id": "t1_jc4k61w",
            "score": 1,
            "created_utc": 1678796595.0,
            "replies": []
        },
        {
            "body": "a truly classy women knows her worth, but would never be so entitled to express that in actual words. It would be beneath her, to lower herself to the level of someone beneath her, to actually say those words to them. Instead she would show by her actions she was above them and be on her way.\n\nI dont think most women from your generation truly understand what class is, or how it actually acts. I find most women that say there are classy, arent.",
            "author": "NickPfromYuma",
            "id": "jc6e333",
            "parent_id": "t1_jc4nm0n",
            "score": 0,
            "created_utc": 1678793747.0,
            "replies": [
                {
                    "body": "> I dont think most women from your generation\n\nYou don't know how old I am lol",
                    "author": "peregrine_nation",
                    "id": "jc71uao",
                    "parent_id": "t1_jc6e333",
                    "score": 1,
                    "created_utc": 1678805544.0,
                    "replies": [
                        {
                            "body": "Im sure you're younger then me (if you arent, would you be interested in a slightly used male SB?) , when I said your generation I meant Millennial or Generation Z.\n\nI've never heard a women from my generation say \"I know my worth\" and if she did, guys my age would all agree that she was without class.",
                            "author": "NickPfromYuma",
                            "id": "jcakfp2",
                            "parent_id": "t1_jc71uao",
                            "score": 1,
                            "created_utc": 1678888385.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Crows are much more intelligent than swans, I think maybe his valuation of living things is a bit off lol",
            "author": "Queen_Audrey",
            "id": "jc4fby4",
            "parent_id": "t1_jc48z6y",
            "score": 5,
            "created_utc": 1678750108.0,
            "replies": []
        },
        {
            "body": "How precious.",
            "author": "rodeopete3281",
            "id": "jc49fht",
            "parent_id": "t1_jc48z6y",
            "score": 0,
            "created_utc": 1678747593.0,
            "replies": [
                {
                    "body": "🥺❤️❤️❤️",
                    "author": "peregrine_nation",
                    "id": "jc4e2ga",
                    "parent_id": "t1_jc49fht",
                    "score": -2,
                    "created_utc": 1678749561.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But it is.",
            "author": "rodeopete3281",
            "id": "jc44vjx",
            "parent_id": "t1_jc40vhs",
            "score": 0,
            "created_utc": 1678745675.0,
            "replies": []
        },
        {
            "body": "And???",
            "author": "ronitabonita",
            "id": "jc4d93o",
            "parent_id": "t1_jc4c6bw",
            "score": -1,
            "created_utc": 1678749213.0,
            "replies": [
                {
                    "body": "He misses the point that sugar relationships are not the same as escorting…",
                    "author": "Queen_Audrey",
                    "id": "jc4exek",
                    "parent_id": "t1_jc4d93o",
                    "score": 1,
                    "created_utc": 1678749932.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Clearly you’re the one not understanding. Money IS the issue. And you not being willing to spend it and asking if someone can host is unattractive. It’s not spending just to spend it, it’s being generous. That’s the whole point of the bowl. I’m not misunderstanding. I completely understand what you’re saying, and I’ve had successful relationships. But needing someone to host before you even do a m&g is unattractive and shows you don’t value the SB the way that I, and clearly OP, expect to be valued",
            "author": "Queen_Audrey",
            "id": "jc4yemf",
            "parent_id": "t1_jc4xkai",
            "score": 2,
            "created_utc": 1678758506.0,
            "replies": [
                {
                    "body": ">and I’ve had successful relationships.\n\nThat is an oxymoron, successful relationships would not end. If you break up with many partners then that means you are a *bad partner*.  Are you sure you want to double down on that one?\n\n\n\n\n\n>But needing someone to host before you even do a m&g is unattractive and shows you don’t value the SB the way that I, and clearly OP, expect to be valued\n\nIf you say so. There's no basis here, though. \n\n>it’s being generous\n\nI guess you'd rather have the hotel than gifts, allowance, or PPM. Interesting.",
                    "author": "TheStoicbrother",
                    "id": "jc4ztdk",
                    "parent_id": "t1_jc4yemf",
                    "score": 1,
                    "created_utc": 1678759142.0,
                    "replies": [
                        {
                            "body": "> That is an oxymoron, successful relationships would not end.\n\nCompletely disagree.  That's one of the things I *love* about sugar relationships.\n\nIt's about the journey;  not the destination.  I've had plenty of successful SRs - that are all over now.  Them ending does not change them being successful.\n\n> If you break up with many partners then that means you are a bad partner\n\nOr it just means you are getting older.",
                            "author": "SDstartingOut",
                            "id": "jc6izc6",
                            "parent_id": "t1_jc4ztdk",
                            "score": 0,
                            "created_utc": 1678796734.0,
                            "replies": []
                        },
                        {
                            "body": "LOL. Successful relationships do end,  for one reason or another. And the point is that it is normal for an SD to provide a hotel AND gifts AND allowance, bc I don’t do PPM and this is about spoiling. Not about an “SD” who has a strict budget and can’t afford both. I find it unattractive, and  I won’t budge on that. If you’re insecure about your ability to provide that’s on you, but don’t project just bc SBs don’t settle for what you offer.",
                            "author": "Queen_Audrey",
                            "id": "jc50gwv",
                            "parent_id": "t1_jc4ztdk",
                            "score": -1,
                            "created_utc": 1678759441.0,
                            "replies": [
                                {
                                    "body": "Okay. You can have your standards and keep running through SDs like hot cakes.  You clearly only care about yourself, and arguing. Done here lol",
                                    "author": "TheStoicbrother",
                                    "id": "jc51p8b",
                                    "parent_id": "t1_jc50gwv",
                                    "score": 2,
                                    "created_utc": 1678760004.0,
                                    "replies": []
                                },
                                {
                                    "body": "Imagine not having the critical thinking skills to understand that some relationships end for reasons outside of compatibility.\n\nYou absolutely captured the essence of what I was trying to say yet were insulted and called selfish and argumentative in the process. It’s no wonder we have to go through so many frogs to get to our prince.",
                                    "author": "ronitabonita",
                                    "id": "jc58fba",
                                    "parent_id": "t1_jc50gwv",
                                    "score": 1,
                                    "created_utc": 1678763173.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> I dont think most women from your generation\n\nYou don't know how old I am lol",
            "author": "peregrine_nation",
            "id": "jc71uao",
            "parent_id": "t1_jc6e333",
            "score": 1,
            "created_utc": 1678805544.0,
            "replies": [
                {
                    "body": "Im sure you're younger then me (if you arent, would you be interested in a slightly used male SB?) , when I said your generation I meant Millennial or Generation Z.\n\nI've never heard a women from my generation say \"I know my worth\" and if she did, guys my age would all agree that she was without class.",
                    "author": "NickPfromYuma",
                    "id": "jcakfp2",
                    "parent_id": "t1_jc71uao",
                    "score": 1,
                    "created_utc": 1678888385.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🥺❤️❤️❤️",
            "author": "peregrine_nation",
            "id": "jc4e2ga",
            "parent_id": "t1_jc49fht",
            "score": -2,
            "created_utc": 1678749561.0,
            "replies": []
        },
        {
            "body": "He misses the point that sugar relationships are not the same as escorting…",
            "author": "Queen_Audrey",
            "id": "jc4exek",
            "parent_id": "t1_jc4d93o",
            "score": 1,
            "created_utc": 1678749932.0,
            "replies": []
        },
        {
            "body": ">and I’ve had successful relationships.\n\nThat is an oxymoron, successful relationships would not end. If you break up with many partners then that means you are a *bad partner*.  Are you sure you want to double down on that one?\n\n\n\n\n\n>But needing someone to host before you even do a m&g is unattractive and shows you don’t value the SB the way that I, and clearly OP, expect to be valued\n\nIf you say so. There's no basis here, though. \n\n>it’s being generous\n\nI guess you'd rather have the hotel than gifts, allowance, or PPM. Interesting.",
            "author": "TheStoicbrother",
            "id": "jc4ztdk",
            "parent_id": "t1_jc4yemf",
            "score": 1,
            "created_utc": 1678759142.0,
            "replies": [
                {
                    "body": "> That is an oxymoron, successful relationships would not end.\n\nCompletely disagree.  That's one of the things I *love* about sugar relationships.\n\nIt's about the journey;  not the destination.  I've had plenty of successful SRs - that are all over now.  Them ending does not change them being successful.\n\n> If you break up with many partners then that means you are a bad partner\n\nOr it just means you are getting older.",
                    "author": "SDstartingOut",
                    "id": "jc6izc6",
                    "parent_id": "t1_jc4ztdk",
                    "score": 0,
                    "created_utc": 1678796734.0,
                    "replies": []
                },
                {
                    "body": "LOL. Successful relationships do end,  for one reason or another. And the point is that it is normal for an SD to provide a hotel AND gifts AND allowance, bc I don’t do PPM and this is about spoiling. Not about an “SD” who has a strict budget and can’t afford both. I find it unattractive, and  I won’t budge on that. If you’re insecure about your ability to provide that’s on you, but don’t project just bc SBs don’t settle for what you offer.",
                    "author": "Queen_Audrey",
                    "id": "jc50gwv",
                    "parent_id": "t1_jc4ztdk",
                    "score": -1,
                    "created_utc": 1678759441.0,
                    "replies": [
                        {
                            "body": "Okay. You can have your standards and keep running through SDs like hot cakes.  You clearly only care about yourself, and arguing. Done here lol",
                            "author": "TheStoicbrother",
                            "id": "jc51p8b",
                            "parent_id": "t1_jc50gwv",
                            "score": 2,
                            "created_utc": 1678760004.0,
                            "replies": []
                        },
                        {
                            "body": "Imagine not having the critical thinking skills to understand that some relationships end for reasons outside of compatibility.\n\nYou absolutely captured the essence of what I was trying to say yet were insulted and called selfish and argumentative in the process. It’s no wonder we have to go through so many frogs to get to our prince.",
                            "author": "ronitabonita",
                            "id": "jc58fba",
                            "parent_id": "t1_jc50gwv",
                            "score": 1,
                            "created_utc": 1678763173.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Im sure you're younger then me (if you arent, would you be interested in a slightly used male SB?) , when I said your generation I meant Millennial or Generation Z.\n\nI've never heard a women from my generation say \"I know my worth\" and if she did, guys my age would all agree that she was without class.",
            "author": "NickPfromYuma",
            "id": "jcakfp2",
            "parent_id": "t1_jc71uao",
            "score": 1,
            "created_utc": 1678888385.0,
            "replies": []
        },
        {
            "body": "> That is an oxymoron, successful relationships would not end.\n\nCompletely disagree.  That's one of the things I *love* about sugar relationships.\n\nIt's about the journey;  not the destination.  I've had plenty of successful SRs - that are all over now.  Them ending does not change them being successful.\n\n> If you break up with many partners then that means you are a bad partner\n\nOr it just means you are getting older.",
            "author": "SDstartingOut",
            "id": "jc6izc6",
            "parent_id": "t1_jc4ztdk",
            "score": 0,
            "created_utc": 1678796734.0,
            "replies": []
        },
        {
            "body": "LOL. Successful relationships do end,  for one reason or another. And the point is that it is normal for an SD to provide a hotel AND gifts AND allowance, bc I don’t do PPM and this is about spoiling. Not about an “SD” who has a strict budget and can’t afford both. I find it unattractive, and  I won’t budge on that. If you’re insecure about your ability to provide that’s on you, but don’t project just bc SBs don’t settle for what you offer.",
            "author": "Queen_Audrey",
            "id": "jc50gwv",
            "parent_id": "t1_jc4ztdk",
            "score": -1,
            "created_utc": 1678759441.0,
            "replies": [
                {
                    "body": "Okay. You can have your standards and keep running through SDs like hot cakes.  You clearly only care about yourself, and arguing. Done here lol",
                    "author": "TheStoicbrother",
                    "id": "jc51p8b",
                    "parent_id": "t1_jc50gwv",
                    "score": 2,
                    "created_utc": 1678760004.0,
                    "replies": []
                },
                {
                    "body": "Imagine not having the critical thinking skills to understand that some relationships end for reasons outside of compatibility.\n\nYou absolutely captured the essence of what I was trying to say yet were insulted and called selfish and argumentative in the process. It’s no wonder we have to go through so many frogs to get to our prince.",
                    "author": "ronitabonita",
                    "id": "jc58fba",
                    "parent_id": "t1_jc50gwv",
                    "score": 1,
                    "created_utc": 1678763173.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Okay. You can have your standards and keep running through SDs like hot cakes.  You clearly only care about yourself, and arguing. Done here lol",
            "author": "TheStoicbrother",
            "id": "jc51p8b",
            "parent_id": "t1_jc50gwv",
            "score": 2,
            "created_utc": 1678760004.0,
            "replies": []
        },
        {
            "body": "Imagine not having the critical thinking skills to understand that some relationships end for reasons outside of compatibility.\n\nYou absolutely captured the essence of what I was trying to say yet were insulted and called selfish and argumentative in the process. It’s no wonder we have to go through so many frogs to get to our prince.",
            "author": "ronitabonita",
            "id": "jc58fba",
            "parent_id": "t1_jc50gwv",
            "score": 1,
            "created_utc": 1678763173.0,
            "replies": []
        }
    ]
}