{
    "title": "Stingy SD",
    "post_id": "yl2hb7",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/yl2hb7/stingy_sd/",
    "author": "Different_Ad_8783",
    "body": "More of a rant, I’m just annoyed. \nI cut off my SD yesterday. We’ve been seeing one another since June and came to agreement that once we became intimate, I’d receive an allowance. Guess what didn’t happen?\n\nI’m frustrated because he has been paying my rent and I enjoy his company but getting him to spoil me is like pulling nails from wood. He says we’re not “intimate” because we’ve only had sex twice and not consistently. Which is his fault because he still lets the mother of his children come around and stay at his house when she is oblivious to our relationship. She stayed the entire month of October while we would sneak and do lunch dates maybe 3 times the entire month.\n\nHe wants me to be available whenever at the spur of the moment and I always am! I work full time and have taken lunch later or early as hell to accommodate, early morning breakfast dates, late night last minute dinners, etc. We text damn near everyday which again, I enjoyed doing but I don’t see how we’re not intimate when I’m sending him spicy videos and pictures every other day as well as FaceTiming so he can get his.\n\nWhat pisses me off the most? He keeps accusing me of sleeping with someone else which I should have been!\n\nI have the beg him at the end of each month to give me rent money that he agreed to in the beginning. And he doesn’t believe in Cashapp so if I don’t see him in person, I don’t get it. \n\nMy last straw was yesterday. I asked if he could buy me a fairly cheap bracelet and he told me he wasn’t “ready to give me any gifts” I would have preferred he just said no. He can go to hell.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/yl2hb7/stingy_sd/",
    "score": 104,
    "upvote_ratio": 0.91,
    "created_utc": 1667481071.0,
    "num_comments": 106,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "So he never gave you allowance? Or he gave you your rent money? Which one is it?",
            "author": null,
            "id": "iuw3n1h",
            "parent_id": "t3_yl2hb7",
            "score": 44,
            "created_utc": 1667481986.0,
            "replies": [
                {
                    "body": "Both. My rent is cheaper than the allowance. I wanted the full amount, never got it. But he was paying my rent.",
                    "author": "Different_Ad_8783",
                    "id": "iuw3usu",
                    "parent_id": "t1_iuw3n1h",
                    "score": 17,
                    "created_utc": 1667482085.0,
                    "replies": [
                        {
                            "body": "Ah OK but he's doing PPM basically instead of allowance that you get regardless of seeing him even though he agreed to allowance. Sounds like a typical broke guy.\n\nSpeaking of [typical broke guys... ](https://imgur.com/a/k3NdTux)don't let u/inside_andout get to you, he doesn't even know [how vaginas work...](https://imgur.com/X84eyNW)",
                            "author": null,
                            "id": "iuw53ef",
                            "parent_id": "t1_iuw3usu",
                            "score": 28,
                            "created_utc": 1667482653.0,
                            "replies": [
                                {
                                    "body": "LoosePussySD was not on my bingo card today but here we are.",
                                    "author": "GirlWithAFracture",
                                    "id": "iuw8p1v",
                                    "parent_id": "t1_iuw53ef",
                                    "score": 14,
                                    "created_utc": 1667484231.0,
                                    "replies": []
                                },
                                {
                                    "body": "No consistent PPM either 😭 he’s very wealthy which confused me. Just stingy and very insecure! The relationship was so much fun until last month. He let his child’s mother stay with him bc he “didn’t want to hurt her feelings” and started seeing me less but expected me to jump through hoops more. I tried to explain to him on two separate occasions that we were detouring from the initial arrangement but he refused to see where I was coming from. He then started accusing me of sleeping with someone else. Him saying yesterday he wasn’t ready to give me any gifts just sealed the deal. \n\nAnd Thanks! Some people are just internet trolls lol",
                                    "author": "Different_Ad_8783",
                                    "id": "iuw5yvx",
                                    "parent_id": "t1_iuw53ef",
                                    "score": 13,
                                    "created_utc": 1667483041.0,
                                    "replies": [
                                        {
                                            "body": "Wealth & generosity have nothing to do with each other. Most people become wealthy by being smart with their money & getting the most bang for their buck (couldn't resist the play on words, sorry!). \n\nThere are super generous SDs who only make 6 figures and there are cheapskate whales. Don't allow a person's wealth to determine anything for you. Their actions are all that matter.",
                                            "author": "SilkySweet2022",
                                            "id": "iuyqaza",
                                            "parent_id": "t1_iuw5yvx",
                                            "score": 14,
                                            "created_utc": 1667521232.0,
                                            "replies": [
                                                {
                                                    "body": "“Bang for your buck” is actually perfect! 🤣",
                                                    "author": "Different_Ad_8783",
                                                    "id": "iuyr9qz",
                                                    "parent_id": "t1_iuyqaza",
                                                    "score": 2,
                                                    "created_utc": 1667521635.0,
                                                    "replies": [
                                                        {
                                                            "body": "LOL...😘💜",
                                                            "author": "SilkySweet2022",
                                                            "id": "iuyrdnq",
                                                            "parent_id": "t1_iuyr9qz",
                                                            "score": 0,
                                                            "created_utc": 1667521682.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Why did you link to that 😭. My brain broke reading that \"man\"'s logic!",
                                    "author": "notnoteworthyatall",
                                    "id": "iuwc1qk",
                                    "parent_id": "t1_iuw53ef",
                                    "score": 9,
                                    "created_utc": 1667485645.0,
                                    "replies": []
                                },
                                {
                                    "body": "Lol wow. Maybe it’s just the teeny D",
                                    "author": "JSBelle",
                                    "id": "iuwbdx6",
                                    "parent_id": "t1_iuw53ef",
                                    "score": 3,
                                    "created_utc": 1667485368.0,
                                    "replies": []
                                },
                                {
                                    "body": "Hahaha!!! Guys who think this way probably don’t realize their pee pee is micro sized.",
                                    "author": "thehottubistoohawt",
                                    "id": "iuyg7bd",
                                    "parent_id": "t1_iuw53ef",
                                    "score": 3,
                                    "created_utc": 1667516926.0,
                                    "replies": []
                                },
                                {
                                    "body": "LOL at the last bit 🤣",
                                    "author": "sa1dbym3",
                                    "id": "iux5z5x",
                                    "parent_id": "t1_iuw53ef",
                                    "score": 1,
                                    "created_utc": 1667497320.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Semantics are important.\n\nHe \\*is\\* giving you an allowance and he's getting EXACTLY what he wants... a dating relationship with a sprinkling of sex.  And he's weaponizing the lack of sex as a justification for paying less.  Dump him.\n\nBUT... something tells me that it's not one-sided and maybe you're not making him feel comfortable enough to get there.  I apartmented an SB a decade ago who constantly begged for extras and would steal loose cash from my wallet and coat when she handled them.  And then she'd complain that I wanted sex all the time.  It got so bad, I dreaded going to see her and I was relieved when she bolted and left me with an unfulfilled lease.\n\nMaybe he picks the same kinds of toxic relationships and sees you as the next nag in the chain.  Maybe he hoped someone shiny and new would be different.\n\nI would reflect on whether/how you might be making him reluctant to commit to the agreed upon \"full allowance\".  But I stand by \"dump him\"... he needs to be better.",
                            "author": "S2USStudios",
                            "id": "iuw68s9",
                            "parent_id": "t1_iuw3usu",
                            "score": 2,
                            "created_utc": 1667483164.0,
                            "replies": [
                                {
                                    "body": "Don’t take this the wrong way, but I feel you’re projecting a tad due to your bad experience. I’m very patient with him. And I enjoy his company. Would never steal from him or anyone. He was actually my POT SD back in 2020 but I was going through a breakup and couldn’t commit how he wanted. I was honest with him then and honest now so we could both make the decision best for us. We met again by chance in June and it was fun until it wasn’t. He’s not holding up his end of the deal and I am. But I enjoy our  time together so I dealt with it. Now I’m deciding not to.",
                                    "author": "Different_Ad_8783",
                                    "id": "iuw6wb1",
                                    "parent_id": "t1_iuw68s9",
                                    "score": 14,
                                    "created_utc": 1667483452.0,
                                    "replies": [
                                        {
                                            "body": "You're welcome to your opinion.  I've been successfully sugaring for 20 years.\n\nMuch of your language describes herculean effort on your part and assigns all the blame on him... including \"trying to get him to \\*spoil\\* you\" and \"having to go see him to get your rent money\".  The former suggests a tireless pattern of behavior and the latter suggests that maybe going to see him was a burden.  I was offering that there's an opportunity to look at your own behavior and learn how you might have better relationships; sugar or otherwise.\n\nConsider the possibility that he feels he's the hero in his story and he's holding out because he has some gripe (it's probably not the sex thing; I'm confident that's just an excuse... maybe he over-promised and simply can't make good, so he's milking it?).  And if money is his real problem, then the behaviors you described probably come off as hustling or nagging.  \n\n\nEither way, I totally support dumping him.  He needs to be a better communicator if he's the \"good guy\" and coach you on whatever his problem is.  And he needs to do better by you, regardless.  He should be paying you in advance of the month; not making you come to him for scraps; that's just exploiting the power dynamic in a toxic way.  \nIf you want to hold yourself blameless, I have no horse in that race.",
                                            "author": "S2USStudios",
                                            "id": "iuw9nsi",
                                            "parent_id": "t1_iuw6wb1",
                                            "score": -4,
                                            "created_utc": 1667484644.0,
                                            "replies": [
                                                {
                                                    "body": "Successfully sugaring besides the time when you got a thief an apartment and dated her when she continued to steal from you.",
                                                    "author": null,
                                                    "id": "iuwlpk5",
                                                    "parent_id": "t1_iuw9nsi",
                                                    "score": 13,
                                                    "created_utc": 1667489533.0,
                                                    "replies": [
                                                        {
                                                            "body": "Infallibility must be such a great burden.",
                                                            "author": "S2USStudios",
                                                            "id": "iuwmlec",
                                                            "parent_id": "t1_iuwlpk5",
                                                            "score": -2,
                                                            "created_utc": 1667489882.0,
                                                            "replies": [
                                                                {
                                                                    "body": "The only thing I'm infallible at is pointing out hypocrisy. Toodles.",
                                                                    "author": null,
                                                                    "id": "iuz8efw",
                                                                    "parent_id": "t1_iuwmlec",
                                                                    "score": 1,
                                                                    "created_utc": 1667529040.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yes, but not correctly.  Look it up... I'll wait.",
                                                                            "author": "S2USStudios",
                                                                            "id": "iuz8w21",
                                                                            "parent_id": "t1_iuz8efw",
                                                                            "score": -2,
                                                                            "created_utc": 1667529262.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "I mean she probably duped him before he got her the place and felt trapped afterwards.",
                                                            "author": "triplebarrelxxx",
                                                            "id": "iuy4m99",
                                                            "parent_id": "t1_iuwlpk5",
                                                            "score": 0,
                                                            "created_utc": 1667510543.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Well I never said I was blameless but I am saying what you’re suggesting the problem is, isn’t. I didn’t purposely word the post to blame him it was simply framed around my frustrations with the relationship. I’ve commented multiple times how much I adore seeing him but when we are both working and he is playing house with a woman he told me no longer lives with him, it makes it harder to see him. And if I don’t see him, I don’t get my rent. Which of course I can pay it myself with my job and I have and he’s paid me back but that makes it feel like it’s not a priority for him. He’s not a burden at all. We have a lot of fun with one another. And his pockets definitely aren’t shallow so I don’t think money is the issue. I commented on another’s post earlier that I tried to talk with him twice about what the hold up was. He’s doesn’t communicate well. I truthfully think he doesn’t want to invest too much into me because he is insecure and thinks I’m sleeping with other men. I don’t know what I can do to change his mind about that. Even when I send him videos, he asks if he’s the only person to have seen it. He won’t admit to that (which I’m just assuming is the issue since the last time we were together he suggested he go through my phone).",
                                                    "author": "Different_Ad_8783",
                                                    "id": "iuwbef8",
                                                    "parent_id": "t1_iuw9nsi",
                                                    "score": 2,
                                                    "created_utc": 1667485373.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sounds like he \\*IS\\* a burden.  He lies to you, he holds your money hostage, he doesn't communicate, and he's jealous.  Oh, and creepy/insecure.  \n\n\nJust ONE of those would lead me to Next a person.  No idea how that person is adored.  \n\n\nYou're better off without him.",
                                                            "author": "S2USStudios",
                                                            "id": "iuwc5ru",
                                                            "parent_id": "t1_iuwbef8",
                                                            "score": 3,
                                                            "created_utc": 1667485692.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Well… when you word it like that 😂🙃",
                                                                    "author": "Different_Ad_8783",
                                                                    "id": "iuwckx1",
                                                                    "parent_id": "t1_iuwc5ru",
                                                                    "score": 3,
                                                                    "created_utc": 1667485863.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": ">but that makes it feel like it’s not a priority for him.\n\nI'm new to this sub and am trying to keep an open mind, but I feel like SB's should realize 99% the time ya, you're never going to be a priority for them, that slot is for their primary relationship whom they see remaining in their future.\n\nEven if the mother of his children are in fact separated from him, (doesn't sound like it, seems like something more complicated is going on) she is still the motehr of his children. His children will be part of the rest of his life, and in turn she will be, too.\n\nWhether if you continue this relationship with him or move on to someone else, you have to recognize you will not be a priority, and the dynamic would be mostly at his convenience, and plan accordingly.\n\nI recognize other formats exists where the connection/relationship takes a larger role (that's what I'm looking for) but never go in expecting one's ideal scenario. Clearly in this case your friction revolves around the transaction aspect and that's what he sees this relationship as.",
                                                            "author": "karmaextract",
                                                            "id": "iuwhe7l",
                                                            "parent_id": "t1_iuwbef8",
                                                            "score": 3,
                                                            "created_utc": 1667487801.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No you’re right. And I never tried to compete with that. But when you make a commitment with someone to do something for them, they shouldn’t have to ask multiple times. In this case, the commitment wasn’t time it was my rent. I was extremely flexible with his time. And very respectful of his relationship with her and his kids. I never even thought about suggesting  he blow them off for me. But he did commit himself to paying my rent and that needed to be a priority even if I didn’t see him. I.e. cashapp. I of course loved seeing him but times when I couldn’t because he had other priorities, cashapp would have solved a lot of issues.",
                                                                    "author": "Different_Ad_8783",
                                                                    "id": "iuwi3o0",
                                                                    "parent_id": "t1_iuwhe7l",
                                                                    "score": 2,
                                                                    "created_utc": 1667488086.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "To my dismay, most people who reach this level didn't get here by having integrity and be a beacon of justice and fairness. The higher up you go the more cutthroat they get. \n\nOf celebrity wealthy men, for all Mark Zuckerberg's faults, one thing you can't criticize him for is his personal relationships - he stuck by his (frankly not very attractive) college sweetheart wife. Warren Buffet, too (until she passed away). That's just exceedingly rare to see and require a lot of cicumstances (and luck on Zuckerberg's part) to happen.\n\nYou might still see honest men with integrity it the same proportion to the general population at the 200-300k income range, because that's what an engineer or middle manager at FAANG makes and the bar to get there isn't terribly high, but any higher income than that be prepared to be skewed towards much more cutthorat and dishonest people, percentage wise. Especially if he's cheating on his wife, don't expect him to be honest with his SB (not saying that's the case for your SD, but it certainly sounds complicated).",
                                                                            "author": "karmaextract",
                                                                            "id": "iuwslcr",
                                                                            "parent_id": "t1_iuwi3o0",
                                                                            "score": 5,
                                                                            "created_utc": 1667492222.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Fair.",
                                                                                    "author": "Different_Ad_8783",
                                                                                    "id": "iuwu29k",
                                                                                    "parent_id": "t1_iuwslcr",
                                                                                    "score": 2,
                                                                                    "created_utc": 1667492787.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Hey girl, we are offering advice when you asked for it. You’re not in an ideal relationship and these situations should be hard or stressful for you. Your daddy *should want* to spoil you, it’s honestly not spoiling IMO if you have to ask. I’ve never once had to ask my SD for anything, and if I had to put in “work” like it sounds like you are it would strain the relationship and not be something I would put myself or him through. His poor communication and inconsistency is a red flag, the fact that he makes you feel like it’s your job to ‘earn & collect’ money from him is icky. He may have money but is isn’t sharing it with you, he sounds like a burden to us. We aren’t trying to argue with you and your defensiveness about the situation is concerning because we can see that you are emotionally invested where you really shouldn’t be. Someday someone if going to care for you and spoil you, it should be this hard for either of you",
                                                            "author": "burstofgiggles",
                                                            "id": "iuwo6sj",
                                                            "parent_id": "t1_iuwbef8",
                                                            "score": 0,
                                                            "created_utc": 1667490511.0,
                                                            "replies": [
                                                                {
                                                                    "body": "My tone wasn’t meant to be defensive. I actually ended up agreeing with the other poster who broke down why he was a burden after this response. But no I agree he makes me jump through too many hoops and I am emotionally invested bc I enjoyed spending time with him. But it was good seeing other people’s perspective and it validated my reasoning for cutting him off.",
                                                                    "author": "Different_Ad_8783",
                                                                    "id": "iuwor09",
                                                                    "parent_id": "t1_iuwo6sj",
                                                                    "score": 3,
                                                                    "created_utc": 1667490729.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Glad you were able to sit with your thoughts and listen to others, I was getting worried about you from your comments. Don’t exhaust yourself defending a man that doesn’t deserve your time.",
                                                                            "author": "burstofgiggles",
                                                                            "id": "iux4sa4",
                                                                            "parent_id": "t1_iuwor09",
                                                                            "score": 2,
                                                                            "created_utc": 1667496869.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "You sugaring for 20 years has nothing to do with HER situationship with him.",
                                                    "author": "tiffie415",
                                                    "id": "iuyvjbk",
                                                    "parent_id": "t1_iuw9nsi",
                                                    "score": 1,
                                                    "created_utc": 1667523447.0,
                                                    "replies": [
                                                        {
                                                            "body": "Reading comprehension fail.  Do not pass Go!",
                                                            "author": "S2USStudios",
                                                            "id": "iuz8dcg",
                                                            "parent_id": "t1_iuyvjbk",
                                                            "score": 0,
                                                            "created_utc": 1667529027.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Haha right I thought rent came out of allowance.",
                    "author": "yanonotreally",
                    "id": "iuw4to7",
                    "parent_id": "t1_iuw3n1h",
                    "score": 14,
                    "created_utc": 1667482531.0,
                    "replies": [
                        {
                            "body": "I thought so too! And I have to ask multiple times for the rent, almost convincing him to give it to me and I feel bad asking for money. He knows that and uses it against me. The bracelet I asked for yesterday was the first time since June that I can remember asking for anything outside of what we agreed to. No bags, shoes or extras have been asked for from me.",
                            "author": "Different_Ad_8783",
                            "id": "iuw7n63",
                            "parent_id": "t1_iuw4to7",
                            "score": 16,
                            "created_utc": 1667483775.0,
                            "replies": [
                                {
                                    "body": "Next time, gifts and extras need to be discussed up front. Not all SDs give more than the agreed upon allowance so it's an important part of the financial discussion.",
                                    "author": "SilkySweet2022",
                                    "id": "iuypssz",
                                    "parent_id": "t1_iuw7n63",
                                    "score": 3,
                                    "created_utc": 1667521021.0,
                                    "replies": []
                                },
                                {
                                    "body": "I mean I never really request gifts, especially from someone whose already stingy with my allowance. Sounds like a case of not enough boundaries and not clear enough expectations tbh",
                                    "author": "triplebarrelxxx",
                                    "id": "iuy3sy3",
                                    "parent_id": "t1_iuw7n63",
                                    "score": 5,
                                    "created_utc": 1667510223.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That doesnt sound like an SD and he should be happy to give you money if you're the woman he wants.",
            "author": "UniqueSkinnyXFigure",
            "id": "iuw8a6y",
            "parent_id": "t3_yl2hb7",
            "score": 9,
            "created_utc": 1667484052.0,
            "replies": [
                {
                    "body": "He’s so much drama. So jealous. And he asks to go through my phone. But when it was good it was great! But I can no longer deal with him.",
                    "author": "Different_Ad_8783",
                    "id": "iuw8ig4",
                    "parent_id": "t1_iuw8a6y",
                    "score": 8,
                    "created_utc": 1667484153.0,
                    "replies": [
                        {
                            "body": "This sounds like a vanilla relationship not an SD/SB arrangement.\n\nReal SDs don't have time to be going through people's phones.\n\nI know it can be hard but as an SD I recommend keeping a professional distance. While I am very close with my SBs I also know it's an arrangement. If they stop being intimate I immediately shut it down. I'd expect the same if I stopped being generous.\n\nYou shouldn't even be giving him your time.",
                            "author": "notnoteworthyatall",
                            "id": "iuwbonm",
                            "parent_id": "t1_iuw8ig4",
                            "score": 14,
                            "created_utc": 1667485493.0,
                            "replies": [
                                {
                                    "body": "My best friend said the same thing. She told me we were more of a vanilla couple than anything. I didn’t really see it like that until now.",
                                    "author": "Different_Ad_8783",
                                    "id": "iuwc6e9",
                                    "parent_id": "t1_iuwbonm",
                                    "score": 2,
                                    "created_utc": 1667485699.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Wow, WTF??? Yeah, to hell with that joke of an “SD”. My husband wouldn’t do that to me!!",
                            "author": "Turpitudia79",
                            "id": "iuztyjx",
                            "parent_id": "t1_iuw8ig4",
                            "score": 1,
                            "created_utc": 1667541612.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iux55x1",
            "parent_id": "t3_yl2hb7",
            "score": 8,
            "created_utc": 1667497013.0,
            "replies": [
                {
                    "body": "😂😂😂 me included.",
                    "author": "Different_Ad_8783",
                    "id": "iux5cc4",
                    "parent_id": "t1_iux55x1",
                    "score": 2,
                    "created_utc": 1667497079.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So you’ve only had sex with him twice since June, and yet he’s paid your rent consistently since then? That sounds like a dream scenario for most SB’s. Your ppm is basically super high.",
            "author": "NewYorkSD",
            "id": "iuwb5vz",
            "parent_id": "t3_yl2hb7",
            "score": 21,
            "created_utc": 1667485275.0,
            "replies": [
                {
                    "body": "Well, When you frame it like that I feel ungrateful 😂 I would have loved to have sex with him more!!! But I also wanted him to keep up his end of the deal.",
                    "author": "Different_Ad_8783",
                    "id": "iuwbvx3",
                    "parent_id": "t1_iuwb5vz",
                    "score": 4,
                    "created_utc": 1667485577.0,
                    "replies": [
                        {
                            "body": "Yea I understand! I’m just teasing. Sounds like you two were looking for different things.",
                            "author": "NewYorkSD",
                            "id": "iuwc0zm",
                            "parent_id": "t1_iuwbvx3",
                            "score": 3,
                            "created_utc": 1667485636.0,
                            "replies": []
                        },
                        {
                            "body": "Ungrateful AF.",
                            "author": "garret6758",
                            "id": "iuxarnb",
                            "parent_id": "t1_iuwbvx3",
                            "score": -5,
                            "created_utc": 1667499144.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you depend on this guy to pay your rent, I think are shooting yourself in the foot.  Regardless of any right or wrong issue, when you effectively tell the person who is paying your rent to 'go to hell', sounds like you may be at risk for eviction.",
            "author": "HappyBear1952",
            "id": "iuwprg6",
            "parent_id": "t3_yl2hb7",
            "score": 5,
            "created_utc": 1667491124.0,
            "replies": [
                {
                    "body": "I have a good job ☺️ and I didn’t tell him to his face to go to hell lol but in my head I sure thought it!",
                    "author": "Different_Ad_8783",
                    "id": "iuwq2op",
                    "parent_id": "t1_iuwprg6",
                    "score": 3,
                    "created_utc": 1667491246.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I usually don’t comment but your situation is interesting. Meeting 3-4 times a week for 4 months. That is probably over 50 meetups and sex only 2 times. Why? Also did he say why he wasn’t ready to buy you a bracelet when he spends so much at the bar and probably other things? Sounds very much vanilla dating where someone is trying to figure out if they want to continue to date. You did the right thing by calling it off as you definitely had different expectations.",
            "author": "Apprehensive-Cap-458",
            "id": "iuwrgoh",
            "parent_id": "t3_yl2hb7",
            "score": 6,
            "created_utc": 1667491785.0,
            "replies": [
                {
                    "body": "His excuse when I ask for sex is that he doesn’t want our relationship to develop into love. His words exactly. He wants to be able to “control how he feels about me.” As far as the bracelet, I didn’t even ask. He’s so weird. He offers some things like my birthday is coming up in February and he told me to send him over the numbers for a trip. But then when I ask for things he already promised, he says he’s not “ready.” That’s always his excuse, not being ready. He tries to play mind games, however. We initially just agreed to oral bc he said he felt guilty being with another woman other than his child’s mother (although they were together off and on for 30years, only lived together for 2 and never married. He also had 5 children on her if that tells you anything). Well he bought condoms and would book hotels just to “cuddle” and never outright said he wanted sex. To this day, as sexual as we are, he dances around the subject. If I am overtly sexual, he accuses me of being with someone else. Im not sure if he wanted to call it off honestly. He seemed to not be able to get enough of me. We’ve started back hanging out full speed up until yesterday when I called it off.",
                    "author": "Different_Ad_8783",
                    "id": "iuwto7n",
                    "parent_id": "t1_iuwrgoh",
                    "score": 4,
                    "created_utc": 1667492639.0,
                    "replies": [
                        {
                            "body": "Maybe he would only cuddle cause he has Erectile dysfunction l. Also, he sounds mean and he definitely is still with the baby mama. He isnt a real SD. A real SD will carry out the arrangement without complaining. A real SD will not cry about expenses or spending because he will have plenty of it",
                            "author": "thedoctor321",
                            "id": "iv1sucw",
                            "parent_id": "t1_iuwto7n",
                            "score": 2,
                            "created_utc": 1667582046.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "1. Leave him\n\n2. Take a break from sugaring \n\n3. Find a guy to vanilla date\n\nSometimes loser vanillas might be a better option. At least you know he is a super deadbeat",
            "author": null,
            "id": "iuw6udl",
            "parent_id": "t3_yl2hb7",
            "score": 10,
            "created_utc": 1667483429.0,
            "replies": []
        },
        {
            "body": "Reading this made me want to claw my skin off, I feel like I’ve come across similar situations. So infuriating. \n\nHaving to beg for what y’all agreed on is an immediate bye-bye (that took me too long to learn). Good riddance",
            "author": "c0rnstarr",
            "id": "iuwae0c",
            "parent_id": "t3_yl2hb7",
            "score": 10,
            "created_utc": 1667484954.0,
            "replies": []
        },
        {
            "body": "Have your rent paid is a lot of money, whats the problem? Maybe he feels like hes doing enough. Things come naturally. Cant be too greedy, did you two agree on further financial stuff beyond rent? \n\nHow much is your rent?",
            "author": "Awkward_Pop_3996",
            "id": "iuwih6y",
            "parent_id": "t3_yl2hb7",
            "score": 6,
            "created_utc": 1667488239.0,
            "replies": [
                {
                    "body": "Can’t put a price or I’ll be banned but yes. We agreed to an allowance that was over 3x my rent. He didn’t have to pay the rent if I was getting my allowance of course I’d just take it out of that. But he was only paying the rent. I never asked for the other money bc I was having fun. I liked him. I still do. And I didn’t want to come off as greedy bc I didn’t care, I was having fun. Then it hit me that we agreed to something totally different than we were doing. We talked about it and we said we’ll get back to the plan. That was months ago.",
                    "author": "Different_Ad_8783",
                    "id": "iuwj2e4",
                    "parent_id": "t1_iuwih6y",
                    "score": 4,
                    "created_utc": 1667488474.0,
                    "replies": [
                        {
                            "body": "I would address and re evaluate your needs with him. Sounds like hes being pretty generous. Its not common people have rent paid for them.",
                            "author": "Awkward_Pop_3996",
                            "id": "iuwr4qg",
                            "parent_id": "t1_iuwj2e4",
                            "score": 0,
                            "created_utc": 1667491656.0,
                            "replies": []
                        },
                        {
                            "body": "Sadly when someone is given a series of gifts (your low allowance) the gift becomes an entitlement.",
                            "author": "pinotandsugar",
                            "id": "iuz8dxi",
                            "parent_id": "t1_iuwj2e4",
                            "score": 1,
                            "created_utc": 1667529034.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What am I missing here?  He paid your rent in exchange for texting and 2-3 lunch/dinner meetings.  You have been intimate twice.  I fail to see how he is a bad guy or you were slighted.  I am not sure what you agreed to but that doesn’t seem like an unreasonable exchange.  The average monthly allowance nationwide  is roughly equal to the rent of a nicer 1 bedroom apartment.  He doesn’t seem stingy unless he overpromised well above that.",
            "author": "LotBuilder",
            "id": "iuwdxm0",
            "parent_id": "t3_yl2hb7",
            "score": 2,
            "created_utc": 1667486414.0,
            "replies": [
                {
                    "body": "From June to October we were seeing each other 3-4 times a week. When the mother of his children did an extended stay with him over half the month of October is when we were “sneaking” around and only seeing each other maybe once a week with no notice. I was also FaceTiming and sending ten times more sexual videos and pictures. He promised a higher amount in allowance than my rent back in June but has only been paying my rent. 3.84 times higher if we’re doing the math. I didn’t ever ask for more, but I asked for a bracelet yesterday to which he replied he wasn’t ready to give me any gifts. The bracelet literally cost less than the shots of tequila he orders at the bar. No exaggeration. During the entire month of October he was also super possessive and would make up me sleeping with someone else and get mad. Asking to go through my phone etc.\n\nEdit: \n\nHe can very well afford the allowance which makes him stingy. As I mentioned, his bar tabs alone are half the monthly allowance he promised.",
                    "author": "Different_Ad_8783",
                    "id": "iuwf0am",
                    "parent_id": "t1_iuwdxm0",
                    "score": 3,
                    "created_utc": 1667486849.0,
                    "replies": [
                        {
                            "body": "Understood.  I am located in San Francisco so paying a SB’s rent is pretty significant.  \n\nSeeing someone multiple times a week is a large commitment.   The lack of respect seems like a bigger issue.",
                            "author": "LotBuilder",
                            "id": "iuwj2w4",
                            "parent_id": "t1_iuwf0am",
                            "score": 3,
                            "created_utc": 1667488480.0,
                            "replies": [
                                {
                                    "body": "From his end or mine? I’ve been so worried about coming off as greedy I feel I let him disrespect me and make promises he didn’t plan on keeping.",
                                    "author": "Different_Ad_8783",
                                    "id": "iuwjc6b",
                                    "parent_id": "t1_iuwj2w4",
                                    "score": 2,
                                    "created_utc": 1667488585.0,
                                    "replies": [
                                        {
                                            "body": "Initially I thought you were but as you clarified and provided some frame of reference I think he just doesn’t have the giving spirit required to be a good SD.  You can do better.  I personally enjoy giving gifts.  My allowance is very fair for the area, not high or low,  but I enjoy using gifts and providing extra funds as a way of over delivering.",
                                            "author": "LotBuilder",
                                            "id": "iuws5oc",
                                            "parent_id": "t1_iuwjc6b",
                                            "score": 2,
                                            "created_utc": 1667492053.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "iuyv2gp",
                                    "parent_id": "t1_iuwj2w4",
                                    "score": 1,
                                    "created_utc": 1667523249.0,
                                    "replies": [
                                        {
                                            "body": "Good for you I guess,  I do question the sanity of the guy.",
                                            "author": "LotBuilder",
                                            "id": "iuz9ycu",
                                            "parent_id": "t1_iuyv2gp",
                                            "score": 3,
                                            "created_utc": 1667529748.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "iuza5bd",
                                                    "parent_id": "t1_iuz9ycu",
                                                    "score": 1,
                                                    "created_utc": 1667529839.0,
                                                    "replies": [
                                                        {
                                                            "body": "You have no reason to.  It’s all upside for you.",
                                                            "author": "LotBuilder",
                                                            "id": "iuzaasr",
                                                            "parent_id": "t1_iuza5bd",
                                                            "score": 2,
                                                            "created_utc": 1667529909.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "The issue is that there was an agreement between them, and he wasn't keeping his side of it. Even if the new deal was objectively \"good\", it wasn't what she wanted.\n\nIf I offered to sell you something for a given price, but delivered something completely different,  I bet you wouldn't accept me saying that it was still a good deal.",
                    "author": "Frank9567",
                    "id": "iuystgr",
                    "parent_id": "t1_iuwdxm0",
                    "score": 1,
                    "created_utc": 1667522296.0,
                    "replies": [
                        {
                            "body": "Agreed.  Leave him and try to do better.  Maybe you will and maybe you won’t",
                            "author": "LotBuilder",
                            "id": "iuza2tt",
                            "parent_id": "t1_iuystgr",
                            "score": 2,
                            "created_utc": 1667529806.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">He keeps accusing me of sleeping with someone else\n\nThat's either a (ridiculous) excuse or that's exactly what he was doing at that time so he project it on you.\n\n>which I should have been!\n\nPeriod 🤣",
            "author": "Rosie_rose_rosie21",
            "id": "iuxi0o2",
            "parent_id": "t3_yl2hb7",
            "score": 2,
            "created_utc": 1667501911.0,
            "replies": [
                {
                    "body": "He had to have been sleeping with her! The insecurities came out of NO WHERE!",
                    "author": "Different_Ad_8783",
                    "id": "iuxilpx",
                    "parent_id": "t1_iuxi0o2",
                    "score": 4,
                    "created_utc": 1667502134.0,
                    "replies": [
                        {
                            "body": "Yes! Either did or got the desire too but it's same, accusing you when he is the one in wrong is wrong from him..",
                            "author": "Rosie_rose_rosie21",
                            "id": "iuxmzs9",
                            "parent_id": "t1_iuxilpx",
                            "score": 1,
                            "created_utc": 1667503834.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sounds like a disaster situation that should have ended long ago, I've learned it's not worth continuing or even pursuing a situation that doesn't make sense or that doesn't satisfy both's needs with minimal inconvenience or hardships. Hope you find a better situation!",
            "author": "dapperswaggered",
            "id": "iuxix8f",
            "parent_id": "t3_yl2hb7",
            "score": 2,
            "created_utc": 1667502257.0,
            "replies": []
        },
        {
            "body": "Not sure how old you are but every grown woman should live by, “if he wants to, he will”\n\nI’m sorry you went through that. No girl, let alone no SB, should have to deal with that. I always set the tone straight for any person I’m dealing with, whether SD or potential boyfriend lol.",
            "author": "tiffie415",
            "id": "iuyuj18",
            "parent_id": "t3_yl2hb7",
            "score": 2,
            "created_utc": 1667523023.0,
            "replies": [
                {
                    "body": "She doesn't \"have to.\"",
                    "author": "TigerSharkSLDF",
                    "id": "iuznlyo",
                    "parent_id": "t1_iuyuj18",
                    "score": 0,
                    "created_utc": 1667537102.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly, what’s to like about this guy? Why are you sticking around? The first time I would have to beg for something; id move on. He gaslights you, is insecure, and lies on top of that?\n\nEdit: it’s like I didn’t read the line that said “I cut off my SD”\n\nWell in that case, congratulations! Don’t ever look back, and if any one else gives you those vibes, run far way!",
            "author": "Important-Sherbert-1",
            "id": "iuyjp4k",
            "parent_id": "t3_yl2hb7",
            "score": 3,
            "created_utc": 1667518421.0,
            "replies": []
        },
        {
            "body": "just leave then\n\nleave\n\ndo not talk to him anymore or mention him",
            "author": "inside_andout",
            "id": "iuw2l5r",
            "parent_id": "t3_yl2hb7",
            "score": 1,
            "created_utc": 1667481504.0,
            "replies": [
                {
                    "body": "He’s blocked. This was me ranting. I don’t plan on seeing him again the first line literally says I cut him off 🙃",
                    "author": "Different_Ad_8783",
                    "id": "iuw2un2",
                    "parent_id": "t1_iuw2l5r",
                    "score": 7,
                    "created_utc": 1667481626.0,
                    "replies": [
                        {
                            "body": "you'll be back",
                            "author": "oskih",
                            "id": "iuw3u49",
                            "parent_id": "t1_iuw2un2",
                            "score": -3,
                            "created_utc": 1667482076.0,
                            "replies": []
                        },
                        {
                            "body": "well at this point he is living rent free in your head",
                            "author": "inside_andout",
                            "id": "iuw33yf",
                            "parent_id": "t1_iuw2un2",
                            "score": -6,
                            "created_utc": 1667481745.0,
                            "replies": [
                                {
                                    "body": "Lmfao you’re attempting to be a smartass and it’s kinda just showing you lack reading comprehension. This just happened yesterday, as said in post. I didn’t talk to anyone about it irl so I ranted online to get out my final frustrations. Say something useful or just read. It’s a rant, babes.",
                                    "author": "Different_Ad_8783",
                                    "id": "iuw3qlf",
                                    "parent_id": "t1_iuw33yf",
                                    "score": 7,
                                    "created_utc": 1667482031.0,
                                    "replies": [
                                        {
                                            "body": "People seem to fail to understand that a rant is actually part of the process of evicting someone from your headspace.  It feels good, it is therapeutic and once you get it all out, you stop thinking about it so much.",
                                            "author": "Mainlyharmless",
                                            "id": "iuw41y3",
                                            "parent_id": "t1_iuw3qlf",
                                            "score": 19,
                                            "created_utc": 1667482176.0,
                                            "replies": [
                                                {
                                                    "body": "EXACTLY!! Thank you 🤍",
                                                    "author": "Different_Ad_8783",
                                                    "id": "iuw4imk",
                                                    "parent_id": "t1_iuw41y3",
                                                    "score": 3,
                                                    "created_utc": 1667482391.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": ">Lmfao you’re attempting to be a smartass and it’s kinda just showing you lack reading comprehension. This just happened yesterday, as said in post. I didn’t talk to anyone about it irl so I ranted online to get out my final frustrations. Say something useless or just read. It’s a rant, babes.\n\nyou've just exposed yourself as a crazy girl\n\nthere's definitely more to this story than you're not telling, would love to hear his side\n\nthere's probably big reasons regarding your personality which is why he moved the way that he did",
                                            "author": "inside_andout",
                                            "id": "iuw45ys",
                                            "parent_id": "t1_iuw3qlf",
                                            "score": -14,
                                            "created_utc": 1667482228.0,
                                            "replies": [
                                                {
                                                    "body": "Lol. I’ll let you live with your imagination of me being insane for asking you to read. Have a great rest of your day 🤍",
                                                    "author": "Different_Ad_8783",
                                                    "id": "iuw4esr",
                                                    "parent_id": "t1_iuw45ys",
                                                    "score": 11,
                                                    "created_utc": 1667482342.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "lmao aren’t you the guy that doesn’t know how anatomy works? your opinion means jack shit here.",
                                                    "author": "HStaz",
                                                    "id": "iuw5psc",
                                                    "parent_id": "t1_iuw45ys",
                                                    "score": 18,
                                                    "created_utc": 1667482929.0,
                                                    "replies": [
                                                        {
                                                            "body": "nope\n\nwhoever posted that is an incel and i've already blocked them\n\nthat person is very strange",
                                                            "author": "inside_andout",
                                                            "id": "iuw5u4m",
                                                            "parent_id": "t1_iuw5psc",
                                                            "score": -10,
                                                            "created_utc": 1667482982.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No, it is [you](https://imgur.com/X84eyNW). i’d suggest closing your mouth now. not only are you a liar, you’re a dumbass too.",
                                                                    "author": "HStaz",
                                                                    "id": "iuw7uqx",
                                                                    "parent_id": "t1_iuw5u4m",
                                                                    "score": 17,
                                                                    "created_utc": 1667483867.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Out here doing the lords work. Thank you for this",
                                                                            "author": "Paradoxical_Platypus",
                                                                            "id": "iuwe287",
                                                                            "parent_id": "t1_iuw7uqx",
                                                                            "score": 4,
                                                                            "created_utc": 1667486465.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "you have serious problems and i suggest you get help",
                                                                            "author": "inside_andout",
                                                                            "id": "iuw8e1k",
                                                                            "parent_id": "t1_iuw7uqx",
                                                                            "score": -10,
                                                                            "created_utc": 1667484100.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "yea i’m the one with problems. go back to 6th grade health class.",
                                                                                    "author": "HStaz",
                                                                                    "id": "iuxltbg",
                                                                                    "parent_id": "t1_iuw8e1k",
                                                                                    "score": 6,
                                                                                    "created_utc": 1667503374.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Your SD is a pathetic loser if he’s been paying your rent since June and he only had sex with you twice. \n\nYou dumping him is the best thing that could have happened to him. ( There’s the possibility that he *wanted* you to dump him. Much of his behavior definitely points to that. )\n\nYou obviously had the ability to wring lots more money out of this dude if you had only thrown a little more sugar and affection his way. You need to be giving your man sex without it seeming like a chore. Show enthusiasm for him. It needs to seem to him like you *want* him. He’s desired. Pump up his ego. \n\nHe wanted to see your phone because he thought you were “cheating.” Make that seem like an impossibility to him. Be so into him that it wouldn’t occur to him to want to see your phone. \n\nHe doesn’t believe in cashapp because he knows he won’t see you if he cash apps you. You should be giving him the impression that that’s an impossibility because you desire him so much. \n\nYou misplayed this. Look inward. How can you be better?",
            "author": "Stickley1",
            "id": "iuwcoq2",
            "parent_id": "t3_yl2hb7",
            "score": 2,
            "created_utc": 1667485907.0,
            "replies": [
                {
                    "body": "Lmao dude, I was too into this man actually which is why I mistakenly let him not hold up his end of the deal. Sex with him was great, I wanted it all the time and let him know it. The hold up was him. I was extremely affectionate so the only thing you’re right about is maybe he just wanted to dump me. Which idk we talked everyday up until yesterday so it didn’t give that impression. We actually had a date yesterday prior to me ending it.",
                    "author": "Different_Ad_8783",
                    "id": "iuwhckg",
                    "parent_id": "t1_iuwcoq2",
                    "score": 7,
                    "created_utc": 1667487782.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly, i think you may have gone about it the wrong way. Dumping him might have felt right and great. It looks like from his perspective, asking for money cheapens his relationship with you. I think you should look for another SD, develop a new arrangement and not be \"as\" available as you have been. when he asks to meet. Let him know you are seeking what's missing in this relationship. He's likely to turn things around, after all he doesn't want to lose you either.",
            "author": "mitaliq",
            "id": "iuwyecl",
            "parent_id": "t3_yl2hb7",
            "score": 1,
            "created_utc": 1667494444.0,
            "replies": [
                {
                    "body": "I can see that. If he was willing to turn things around I would continue the relationship. I don’t like when SR feel transactional either and try my best to not make them seem that way from my end. SR or not, if I don’t like you, it doesn’t matter how much money you’re giving me I can’t fake it unfortunately. But yeah I think I’ll try again. Maybe he’ll want to give it another go and maybe I’ll meet someone else",
                    "author": "Different_Ad_8783",
                    "id": "iuwzxkm",
                    "parent_id": "t1_iuwyecl",
                    "score": 3,
                    "created_utc": 1667495022.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Some women would call him stingy.\n\nOther women would take his rent money and find another SD to buy her gifts.",
            "author": "southernslick",
            "id": "iuxuv14",
            "parent_id": "t3_yl2hb7",
            "score": 1,
            "created_utc": 1667506805.0,
            "replies": []
        },
        {
            "body": "Good for you. Next !",
            "author": "LaNouvelleSugar",
            "id": "iuwgijf",
            "parent_id": "t3_yl2hb7",
            "score": 1,
            "created_utc": 1667487448.0,
            "replies": []
        },
        {
            "body": "He’s been paying your rent for 5 months, you’ve only had sex twice, and you’re looking for more allowance on top of that?  There’s a lot of girls on this sub who’d kill to be in your position.",
            "author": "UseTheForceRey",
            "id": "iuxkwjs",
            "parent_id": "t3_yl2hb7",
            "score": 0,
            "created_utc": 1667503022.0,
            "replies": [
                {
                    "body": "Actually, I just wanted a three hundred $ bracelet and for him to stop falsely accusing me of having sex with other men. Him paying what he agreed to originally would’ve been the cherry on top.",
                    "author": "Different_Ad_8783",
                    "id": "iuxp3i4",
                    "parent_id": "t1_iuxkwjs",
                    "score": 1,
                    "created_utc": 1667504636.0,
                    "replies": [
                        {
                            "body": "Well, your first paragraph complains about allowance and the bracelet doesn’t come up until the last, so you can see my confusion.",
                            "author": "UseTheForceRey",
                            "id": "iuyg7sc",
                            "parent_id": "t1_iuxp3i4",
                            "score": 1,
                            "created_utc": 1667516931.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wait, so he's been paying your rent for 5 months, and you only had sex twice with him?? lol... And you are leaving him?\n\nIf your rent is x a month, that means he has paid over fivegrand and only has sex twice??\n\nI dont know which one of you all is off in the head more, you or him.\n\nI dont care how fine you are,  e5cort5, or even other SB's is going to be 9's and 10's with sex out the ass.\n\nI suggest you go crawling back begging for foregiveness.",
            "author": "_Duriel_1000_",
            "id": "iuy62c0",
            "parent_id": "t3_yl2hb7",
            "score": -1,
            "created_utc": 1667511112.0,
            "replies": [
                {
                    "body": "I'd suggest you read the comments if you haven't. It gives a better overall picture.",
                    "author": "SilkySweet2022",
                    "id": "iuysihb",
                    "parent_id": "t1_iuy62c0",
                    "score": 2,
                    "created_utc": 1667522167.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Little confused tbh, paying your rent is an allowance. That's cash in hand every month, no? It sounds like you expected more, but this arrangement may have gone better if you were to set more boundaries earlier on. All in all he sounds like a jealous dunce you're better off without, but just some food for thought to avoid this in the future",
            "author": "triplebarrelxxx",
            "id": "iuy3n3e",
            "parent_id": "t3_yl2hb7",
            "score": -1,
            "created_utc": 1667510159.0,
            "replies": []
        },
        {
            "body": "Pussy sucked ig",
            "author": "Affectionate-Buy644",
            "id": "iuzctjx",
            "parent_id": "t3_yl2hb7",
            "score": -2,
            "created_utc": 1667531121.0,
            "replies": [
                {
                    "body": "Ahh shucks, I guess so. *snaps finger*",
                    "author": "Different_Ad_8783",
                    "id": "iv1t2ut",
                    "parent_id": "t1_iuzctjx",
                    "score": 1,
                    "created_utc": 1667582137.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "iuy5quz",
            "parent_id": "t3_yl2hb7",
            "score": 1,
            "created_utc": 1667510986.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "iuy5qw5",
                    "parent_id": "t1_iuy5quz",
                    "score": 1,
                    "created_utc": 1667510986.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It seems manipulative (not sure if that’s the right word to use) that he promised/or agreed to give you an allowance in exchange for sex but failed to hold up his end of the deal.",
            "author": "DizzyAspect4572",
            "id": "iv00dtn",
            "parent_id": "t3_yl2hb7",
            "score": 1,
            "created_utc": 1667547098.0,
            "replies": []
        },
        {
            "body": "Walk away from that relationship!",
            "author": "ProcessExpensive8959",
            "id": "iv0jcge",
            "parent_id": "t3_yl2hb7",
            "score": 1,
            "created_utc": 1667562313.0,
            "replies": []
        },
        {
            "body": "Both. My rent is cheaper than the allowance. I wanted the full amount, never got it. But he was paying my rent.",
            "author": "Different_Ad_8783",
            "id": "iuw3usu",
            "parent_id": "t1_iuw3n1h",
            "score": 17,
            "created_utc": 1667482085.0,
            "replies": [
                {
                    "body": "Ah OK but he's doing PPM basically instead of allowance that you get regardless of seeing him even though he agreed to allowance. Sounds like a typical broke guy.\n\nSpeaking of [typical broke guys... ](https://imgur.com/a/k3NdTux)don't let u/inside_andout get to you, he doesn't even know [how vaginas work...](https://imgur.com/X84eyNW)",
                    "author": null,
                    "id": "iuw53ef",
                    "parent_id": "t1_iuw3usu",
                    "score": 28,
                    "created_utc": 1667482653.0,
                    "replies": [
                        {
                            "body": "LoosePussySD was not on my bingo card today but here we are.",
                            "author": "GirlWithAFracture",
                            "id": "iuw8p1v",
                            "parent_id": "t1_iuw53ef",
                            "score": 14,
                            "created_utc": 1667484231.0,
                            "replies": []
                        },
                        {
                            "body": "No consistent PPM either 😭 he’s very wealthy which confused me. Just stingy and very insecure! The relationship was so much fun until last month. He let his child’s mother stay with him bc he “didn’t want to hurt her feelings” and started seeing me less but expected me to jump through hoops more. I tried to explain to him on two separate occasions that we were detouring from the initial arrangement but he refused to see where I was coming from. He then started accusing me of sleeping with someone else. Him saying yesterday he wasn’t ready to give me any gifts just sealed the deal. \n\nAnd Thanks! Some people are just internet trolls lol",
                            "author": "Different_Ad_8783",
                            "id": "iuw5yvx",
                            "parent_id": "t1_iuw53ef",
                            "score": 13,
                            "created_utc": 1667483041.0,
                            "replies": [
                                {
                                    "body": "Wealth & generosity have nothing to do with each other. Most people become wealthy by being smart with their money & getting the most bang for their buck (couldn't resist the play on words, sorry!). \n\nThere are super generous SDs who only make 6 figures and there are cheapskate whales. Don't allow a person's wealth to determine anything for you. Their actions are all that matter.",
                                    "author": "SilkySweet2022",
                                    "id": "iuyqaza",
                                    "parent_id": "t1_iuw5yvx",
                                    "score": 14,
                                    "created_utc": 1667521232.0,
                                    "replies": [
                                        {
                                            "body": "“Bang for your buck” is actually perfect! 🤣",
                                            "author": "Different_Ad_8783",
                                            "id": "iuyr9qz",
                                            "parent_id": "t1_iuyqaza",
                                            "score": 2,
                                            "created_utc": 1667521635.0,
                                            "replies": [
                                                {
                                                    "body": "LOL...😘💜",
                                                    "author": "SilkySweet2022",
                                                    "id": "iuyrdnq",
                                                    "parent_id": "t1_iuyr9qz",
                                                    "score": 0,
                                                    "created_utc": 1667521682.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Why did you link to that 😭. My brain broke reading that \"man\"'s logic!",
                            "author": "notnoteworthyatall",
                            "id": "iuwc1qk",
                            "parent_id": "t1_iuw53ef",
                            "score": 9,
                            "created_utc": 1667485645.0,
                            "replies": []
                        },
                        {
                            "body": "Lol wow. Maybe it’s just the teeny D",
                            "author": "JSBelle",
                            "id": "iuwbdx6",
                            "parent_id": "t1_iuw53ef",
                            "score": 3,
                            "created_utc": 1667485368.0,
                            "replies": []
                        },
                        {
                            "body": "Hahaha!!! Guys who think this way probably don’t realize their pee pee is micro sized.",
                            "author": "thehottubistoohawt",
                            "id": "iuyg7bd",
                            "parent_id": "t1_iuw53ef",
                            "score": 3,
                            "created_utc": 1667516926.0,
                            "replies": []
                        },
                        {
                            "body": "LOL at the last bit 🤣",
                            "author": "sa1dbym3",
                            "id": "iux5z5x",
                            "parent_id": "t1_iuw53ef",
                            "score": 1,
                            "created_utc": 1667497320.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Semantics are important.\n\nHe \\*is\\* giving you an allowance and he's getting EXACTLY what he wants... a dating relationship with a sprinkling of sex.  And he's weaponizing the lack of sex as a justification for paying less.  Dump him.\n\nBUT... something tells me that it's not one-sided and maybe you're not making him feel comfortable enough to get there.  I apartmented an SB a decade ago who constantly begged for extras and would steal loose cash from my wallet and coat when she handled them.  And then she'd complain that I wanted sex all the time.  It got so bad, I dreaded going to see her and I was relieved when she bolted and left me with an unfulfilled lease.\n\nMaybe he picks the same kinds of toxic relationships and sees you as the next nag in the chain.  Maybe he hoped someone shiny and new would be different.\n\nI would reflect on whether/how you might be making him reluctant to commit to the agreed upon \"full allowance\".  But I stand by \"dump him\"... he needs to be better.",
                    "author": "S2USStudios",
                    "id": "iuw68s9",
                    "parent_id": "t1_iuw3usu",
                    "score": 2,
                    "created_utc": 1667483164.0,
                    "replies": [
                        {
                            "body": "Don’t take this the wrong way, but I feel you’re projecting a tad due to your bad experience. I’m very patient with him. And I enjoy his company. Would never steal from him or anyone. He was actually my POT SD back in 2020 but I was going through a breakup and couldn’t commit how he wanted. I was honest with him then and honest now so we could both make the decision best for us. We met again by chance in June and it was fun until it wasn’t. He’s not holding up his end of the deal and I am. But I enjoy our  time together so I dealt with it. Now I’m deciding not to.",
                            "author": "Different_Ad_8783",
                            "id": "iuw6wb1",
                            "parent_id": "t1_iuw68s9",
                            "score": 14,
                            "created_utc": 1667483452.0,
                            "replies": [
                                {
                                    "body": "You're welcome to your opinion.  I've been successfully sugaring for 20 years.\n\nMuch of your language describes herculean effort on your part and assigns all the blame on him... including \"trying to get him to \\*spoil\\* you\" and \"having to go see him to get your rent money\".  The former suggests a tireless pattern of behavior and the latter suggests that maybe going to see him was a burden.  I was offering that there's an opportunity to look at your own behavior and learn how you might have better relationships; sugar or otherwise.\n\nConsider the possibility that he feels he's the hero in his story and he's holding out because he has some gripe (it's probably not the sex thing; I'm confident that's just an excuse... maybe he over-promised and simply can't make good, so he's milking it?).  And if money is his real problem, then the behaviors you described probably come off as hustling or nagging.  \n\n\nEither way, I totally support dumping him.  He needs to be a better communicator if he's the \"good guy\" and coach you on whatever his problem is.  And he needs to do better by you, regardless.  He should be paying you in advance of the month; not making you come to him for scraps; that's just exploiting the power dynamic in a toxic way.  \nIf you want to hold yourself blameless, I have no horse in that race.",
                                    "author": "S2USStudios",
                                    "id": "iuw9nsi",
                                    "parent_id": "t1_iuw6wb1",
                                    "score": -4,
                                    "created_utc": 1667484644.0,
                                    "replies": [
                                        {
                                            "body": "Successfully sugaring besides the time when you got a thief an apartment and dated her when she continued to steal from you.",
                                            "author": null,
                                            "id": "iuwlpk5",
                                            "parent_id": "t1_iuw9nsi",
                                            "score": 13,
                                            "created_utc": 1667489533.0,
                                            "replies": [
                                                {
                                                    "body": "Infallibility must be such a great burden.",
                                                    "author": "S2USStudios",
                                                    "id": "iuwmlec",
                                                    "parent_id": "t1_iuwlpk5",
                                                    "score": -2,
                                                    "created_utc": 1667489882.0,
                                                    "replies": [
                                                        {
                                                            "body": "The only thing I'm infallible at is pointing out hypocrisy. Toodles.",
                                                            "author": null,
                                                            "id": "iuz8efw",
                                                            "parent_id": "t1_iuwmlec",
                                                            "score": 1,
                                                            "created_utc": 1667529040.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yes, but not correctly.  Look it up... I'll wait.",
                                                                    "author": "S2USStudios",
                                                                    "id": "iuz8w21",
                                                                    "parent_id": "t1_iuz8efw",
                                                                    "score": -2,
                                                                    "created_utc": 1667529262.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "I mean she probably duped him before he got her the place and felt trapped afterwards.",
                                                    "author": "triplebarrelxxx",
                                                    "id": "iuy4m99",
                                                    "parent_id": "t1_iuwlpk5",
                                                    "score": 0,
                                                    "created_utc": 1667510543.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Well I never said I was blameless but I am saying what you’re suggesting the problem is, isn’t. I didn’t purposely word the post to blame him it was simply framed around my frustrations with the relationship. I’ve commented multiple times how much I adore seeing him but when we are both working and he is playing house with a woman he told me no longer lives with him, it makes it harder to see him. And if I don’t see him, I don’t get my rent. Which of course I can pay it myself with my job and I have and he’s paid me back but that makes it feel like it’s not a priority for him. He’s not a burden at all. We have a lot of fun with one another. And his pockets definitely aren’t shallow so I don’t think money is the issue. I commented on another’s post earlier that I tried to talk with him twice about what the hold up was. He’s doesn’t communicate well. I truthfully think he doesn’t want to invest too much into me because he is insecure and thinks I’m sleeping with other men. I don’t know what I can do to change his mind about that. Even when I send him videos, he asks if he’s the only person to have seen it. He won’t admit to that (which I’m just assuming is the issue since the last time we were together he suggested he go through my phone).",
                                            "author": "Different_Ad_8783",
                                            "id": "iuwbef8",
                                            "parent_id": "t1_iuw9nsi",
                                            "score": 2,
                                            "created_utc": 1667485373.0,
                                            "replies": [
                                                {
                                                    "body": "Sounds like he \\*IS\\* a burden.  He lies to you, he holds your money hostage, he doesn't communicate, and he's jealous.  Oh, and creepy/insecure.  \n\n\nJust ONE of those would lead me to Next a person.  No idea how that person is adored.  \n\n\nYou're better off without him.",
                                                    "author": "S2USStudios",
                                                    "id": "iuwc5ru",
                                                    "parent_id": "t1_iuwbef8",
                                                    "score": 3,
                                                    "created_utc": 1667485692.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well… when you word it like that 😂🙃",
                                                            "author": "Different_Ad_8783",
                                                            "id": "iuwckx1",
                                                            "parent_id": "t1_iuwc5ru",
                                                            "score": 3,
                                                            "created_utc": 1667485863.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": ">but that makes it feel like it’s not a priority for him.\n\nI'm new to this sub and am trying to keep an open mind, but I feel like SB's should realize 99% the time ya, you're never going to be a priority for them, that slot is for their primary relationship whom they see remaining in their future.\n\nEven if the mother of his children are in fact separated from him, (doesn't sound like it, seems like something more complicated is going on) she is still the motehr of his children. His children will be part of the rest of his life, and in turn she will be, too.\n\nWhether if you continue this relationship with him or move on to someone else, you have to recognize you will not be a priority, and the dynamic would be mostly at his convenience, and plan accordingly.\n\nI recognize other formats exists where the connection/relationship takes a larger role (that's what I'm looking for) but never go in expecting one's ideal scenario. Clearly in this case your friction revolves around the transaction aspect and that's what he sees this relationship as.",
                                                    "author": "karmaextract",
                                                    "id": "iuwhe7l",
                                                    "parent_id": "t1_iuwbef8",
                                                    "score": 3,
                                                    "created_utc": 1667487801.0,
                                                    "replies": [
                                                        {
                                                            "body": "No you’re right. And I never tried to compete with that. But when you make a commitment with someone to do something for them, they shouldn’t have to ask multiple times. In this case, the commitment wasn’t time it was my rent. I was extremely flexible with his time. And very respectful of his relationship with her and his kids. I never even thought about suggesting  he blow them off for me. But he did commit himself to paying my rent and that needed to be a priority even if I didn’t see him. I.e. cashapp. I of course loved seeing him but times when I couldn’t because he had other priorities, cashapp would have solved a lot of issues.",
                                                            "author": "Different_Ad_8783",
                                                            "id": "iuwi3o0",
                                                            "parent_id": "t1_iuwhe7l",
                                                            "score": 2,
                                                            "created_utc": 1667488086.0,
                                                            "replies": [
                                                                {
                                                                    "body": "To my dismay, most people who reach this level didn't get here by having integrity and be a beacon of justice and fairness. The higher up you go the more cutthroat they get. \n\nOf celebrity wealthy men, for all Mark Zuckerberg's faults, one thing you can't criticize him for is his personal relationships - he stuck by his (frankly not very attractive) college sweetheart wife. Warren Buffet, too (until she passed away). That's just exceedingly rare to see and require a lot of cicumstances (and luck on Zuckerberg's part) to happen.\n\nYou might still see honest men with integrity it the same proportion to the general population at the 200-300k income range, because that's what an engineer or middle manager at FAANG makes and the bar to get there isn't terribly high, but any higher income than that be prepared to be skewed towards much more cutthorat and dishonest people, percentage wise. Especially if he's cheating on his wife, don't expect him to be honest with his SB (not saying that's the case for your SD, but it certainly sounds complicated).",
                                                                    "author": "karmaextract",
                                                                    "id": "iuwslcr",
                                                                    "parent_id": "t1_iuwi3o0",
                                                                    "score": 5,
                                                                    "created_utc": 1667492222.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Fair.",
                                                                            "author": "Different_Ad_8783",
                                                                            "id": "iuwu29k",
                                                                            "parent_id": "t1_iuwslcr",
                                                                            "score": 2,
                                                                            "created_utc": 1667492787.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Hey girl, we are offering advice when you asked for it. You’re not in an ideal relationship and these situations should be hard or stressful for you. Your daddy *should want* to spoil you, it’s honestly not spoiling IMO if you have to ask. I’ve never once had to ask my SD for anything, and if I had to put in “work” like it sounds like you are it would strain the relationship and not be something I would put myself or him through. His poor communication and inconsistency is a red flag, the fact that he makes you feel like it’s your job to ‘earn & collect’ money from him is icky. He may have money but is isn’t sharing it with you, he sounds like a burden to us. We aren’t trying to argue with you and your defensiveness about the situation is concerning because we can see that you are emotionally invested where you really shouldn’t be. Someday someone if going to care for you and spoil you, it should be this hard for either of you",
                                                    "author": "burstofgiggles",
                                                    "id": "iuwo6sj",
                                                    "parent_id": "t1_iuwbef8",
                                                    "score": 0,
                                                    "created_utc": 1667490511.0,
                                                    "replies": [
                                                        {
                                                            "body": "My tone wasn’t meant to be defensive. I actually ended up agreeing with the other poster who broke down why he was a burden after this response. But no I agree he makes me jump through too many hoops and I am emotionally invested bc I enjoyed spending time with him. But it was good seeing other people’s perspective and it validated my reasoning for cutting him off.",
                                                            "author": "Different_Ad_8783",
                                                            "id": "iuwor09",
                                                            "parent_id": "t1_iuwo6sj",
                                                            "score": 3,
                                                            "created_utc": 1667490729.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Glad you were able to sit with your thoughts and listen to others, I was getting worried about you from your comments. Don’t exhaust yourself defending a man that doesn’t deserve your time.",
                                                                    "author": "burstofgiggles",
                                                                    "id": "iux4sa4",
                                                                    "parent_id": "t1_iuwor09",
                                                                    "score": 2,
                                                                    "created_utc": 1667496869.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "You sugaring for 20 years has nothing to do with HER situationship with him.",
                                            "author": "tiffie415",
                                            "id": "iuyvjbk",
                                            "parent_id": "t1_iuw9nsi",
                                            "score": 1,
                                            "created_utc": 1667523447.0,
                                            "replies": [
                                                {
                                                    "body": "Reading comprehension fail.  Do not pass Go!",
                                                    "author": "S2USStudios",
                                                    "id": "iuz8dcg",
                                                    "parent_id": "t1_iuyvjbk",
                                                    "score": 0,
                                                    "created_utc": 1667529027.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Haha right I thought rent came out of allowance.",
            "author": "yanonotreally",
            "id": "iuw4to7",
            "parent_id": "t1_iuw3n1h",
            "score": 14,
            "created_utc": 1667482531.0,
            "replies": [
                {
                    "body": "I thought so too! And I have to ask multiple times for the rent, almost convincing him to give it to me and I feel bad asking for money. He knows that and uses it against me. The bracelet I asked for yesterday was the first time since June that I can remember asking for anything outside of what we agreed to. No bags, shoes or extras have been asked for from me.",
                    "author": "Different_Ad_8783",
                    "id": "iuw7n63",
                    "parent_id": "t1_iuw4to7",
                    "score": 16,
                    "created_utc": 1667483775.0,
                    "replies": [
                        {
                            "body": "Next time, gifts and extras need to be discussed up front. Not all SDs give more than the agreed upon allowance so it's an important part of the financial discussion.",
                            "author": "SilkySweet2022",
                            "id": "iuypssz",
                            "parent_id": "t1_iuw7n63",
                            "score": 3,
                            "created_utc": 1667521021.0,
                            "replies": []
                        },
                        {
                            "body": "I mean I never really request gifts, especially from someone whose already stingy with my allowance. Sounds like a case of not enough boundaries and not clear enough expectations tbh",
                            "author": "triplebarrelxxx",
                            "id": "iuy3sy3",
                            "parent_id": "t1_iuw7n63",
                            "score": 5,
                            "created_utc": 1667510223.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He’s so much drama. So jealous. And he asks to go through my phone. But when it was good it was great! But I can no longer deal with him.",
            "author": "Different_Ad_8783",
            "id": "iuw8ig4",
            "parent_id": "t1_iuw8a6y",
            "score": 8,
            "created_utc": 1667484153.0,
            "replies": [
                {
                    "body": "This sounds like a vanilla relationship not an SD/SB arrangement.\n\nReal SDs don't have time to be going through people's phones.\n\nI know it can be hard but as an SD I recommend keeping a professional distance. While I am very close with my SBs I also know it's an arrangement. If they stop being intimate I immediately shut it down. I'd expect the same if I stopped being generous.\n\nYou shouldn't even be giving him your time.",
                    "author": "notnoteworthyatall",
                    "id": "iuwbonm",
                    "parent_id": "t1_iuw8ig4",
                    "score": 14,
                    "created_utc": 1667485493.0,
                    "replies": [
                        {
                            "body": "My best friend said the same thing. She told me we were more of a vanilla couple than anything. I didn’t really see it like that until now.",
                            "author": "Different_Ad_8783",
                            "id": "iuwc6e9",
                            "parent_id": "t1_iuwbonm",
                            "score": 2,
                            "created_utc": 1667485699.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Wow, WTF??? Yeah, to hell with that joke of an “SD”. My husband wouldn’t do that to me!!",
                    "author": "Turpitudia79",
                    "id": "iuztyjx",
                    "parent_id": "t1_iuw8ig4",
                    "score": 1,
                    "created_utc": 1667541612.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😂😂😂 me included.",
            "author": "Different_Ad_8783",
            "id": "iux5cc4",
            "parent_id": "t1_iux55x1",
            "score": 2,
            "created_utc": 1667497079.0,
            "replies": []
        },
        {
            "body": "Well, When you frame it like that I feel ungrateful 😂 I would have loved to have sex with him more!!! But I also wanted him to keep up his end of the deal.",
            "author": "Different_Ad_8783",
            "id": "iuwbvx3",
            "parent_id": "t1_iuwb5vz",
            "score": 4,
            "created_utc": 1667485577.0,
            "replies": [
                {
                    "body": "Yea I understand! I’m just teasing. Sounds like you two were looking for different things.",
                    "author": "NewYorkSD",
                    "id": "iuwc0zm",
                    "parent_id": "t1_iuwbvx3",
                    "score": 3,
                    "created_utc": 1667485636.0,
                    "replies": []
                },
                {
                    "body": "Ungrateful AF.",
                    "author": "garret6758",
                    "id": "iuxarnb",
                    "parent_id": "t1_iuwbvx3",
                    "score": -5,
                    "created_utc": 1667499144.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have a good job ☺️ and I didn’t tell him to his face to go to hell lol but in my head I sure thought it!",
            "author": "Different_Ad_8783",
            "id": "iuwq2op",
            "parent_id": "t1_iuwprg6",
            "score": 3,
            "created_utc": 1667491246.0,
            "replies": []
        },
        {
            "body": "His excuse when I ask for sex is that he doesn’t want our relationship to develop into love. His words exactly. He wants to be able to “control how he feels about me.” As far as the bracelet, I didn’t even ask. He’s so weird. He offers some things like my birthday is coming up in February and he told me to send him over the numbers for a trip. But then when I ask for things he already promised, he says he’s not “ready.” That’s always his excuse, not being ready. He tries to play mind games, however. We initially just agreed to oral bc he said he felt guilty being with another woman other than his child’s mother (although they were together off and on for 30years, only lived together for 2 and never married. He also had 5 children on her if that tells you anything). Well he bought condoms and would book hotels just to “cuddle” and never outright said he wanted sex. To this day, as sexual as we are, he dances around the subject. If I am overtly sexual, he accuses me of being with someone else. Im not sure if he wanted to call it off honestly. He seemed to not be able to get enough of me. We’ve started back hanging out full speed up until yesterday when I called it off.",
            "author": "Different_Ad_8783",
            "id": "iuwto7n",
            "parent_id": "t1_iuwrgoh",
            "score": 4,
            "created_utc": 1667492639.0,
            "replies": [
                {
                    "body": "Maybe he would only cuddle cause he has Erectile dysfunction l. Also, he sounds mean and he definitely is still with the baby mama. He isnt a real SD. A real SD will carry out the arrangement without complaining. A real SD will not cry about expenses or spending because he will have plenty of it",
                    "author": "thedoctor321",
                    "id": "iv1sucw",
                    "parent_id": "t1_iuwto7n",
                    "score": 2,
                    "created_utc": 1667582046.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can’t put a price or I’ll be banned but yes. We agreed to an allowance that was over 3x my rent. He didn’t have to pay the rent if I was getting my allowance of course I’d just take it out of that. But he was only paying the rent. I never asked for the other money bc I was having fun. I liked him. I still do. And I didn’t want to come off as greedy bc I didn’t care, I was having fun. Then it hit me that we agreed to something totally different than we were doing. We talked about it and we said we’ll get back to the plan. That was months ago.",
            "author": "Different_Ad_8783",
            "id": "iuwj2e4",
            "parent_id": "t1_iuwih6y",
            "score": 4,
            "created_utc": 1667488474.0,
            "replies": [
                {
                    "body": "I would address and re evaluate your needs with him. Sounds like hes being pretty generous. Its not common people have rent paid for them.",
                    "author": "Awkward_Pop_3996",
                    "id": "iuwr4qg",
                    "parent_id": "t1_iuwj2e4",
                    "score": 0,
                    "created_utc": 1667491656.0,
                    "replies": []
                },
                {
                    "body": "Sadly when someone is given a series of gifts (your low allowance) the gift becomes an entitlement.",
                    "author": "pinotandsugar",
                    "id": "iuz8dxi",
                    "parent_id": "t1_iuwj2e4",
                    "score": 1,
                    "created_utc": 1667529034.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "From June to October we were seeing each other 3-4 times a week. When the mother of his children did an extended stay with him over half the month of October is when we were “sneaking” around and only seeing each other maybe once a week with no notice. I was also FaceTiming and sending ten times more sexual videos and pictures. He promised a higher amount in allowance than my rent back in June but has only been paying my rent. 3.84 times higher if we’re doing the math. I didn’t ever ask for more, but I asked for a bracelet yesterday to which he replied he wasn’t ready to give me any gifts. The bracelet literally cost less than the shots of tequila he orders at the bar. No exaggeration. During the entire month of October he was also super possessive and would make up me sleeping with someone else and get mad. Asking to go through my phone etc.\n\nEdit: \n\nHe can very well afford the allowance which makes him stingy. As I mentioned, his bar tabs alone are half the monthly allowance he promised.",
            "author": "Different_Ad_8783",
            "id": "iuwf0am",
            "parent_id": "t1_iuwdxm0",
            "score": 3,
            "created_utc": 1667486849.0,
            "replies": [
                {
                    "body": "Understood.  I am located in San Francisco so paying a SB’s rent is pretty significant.  \n\nSeeing someone multiple times a week is a large commitment.   The lack of respect seems like a bigger issue.",
                    "author": "LotBuilder",
                    "id": "iuwj2w4",
                    "parent_id": "t1_iuwf0am",
                    "score": 3,
                    "created_utc": 1667488480.0,
                    "replies": [
                        {
                            "body": "From his end or mine? I’ve been so worried about coming off as greedy I feel I let him disrespect me and make promises he didn’t plan on keeping.",
                            "author": "Different_Ad_8783",
                            "id": "iuwjc6b",
                            "parent_id": "t1_iuwj2w4",
                            "score": 2,
                            "created_utc": 1667488585.0,
                            "replies": [
                                {
                                    "body": "Initially I thought you were but as you clarified and provided some frame of reference I think he just doesn’t have the giving spirit required to be a good SD.  You can do better.  I personally enjoy giving gifts.  My allowance is very fair for the area, not high or low,  but I enjoy using gifts and providing extra funds as a way of over delivering.",
                                    "author": "LotBuilder",
                                    "id": "iuws5oc",
                                    "parent_id": "t1_iuwjc6b",
                                    "score": 2,
                                    "created_utc": 1667492053.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "iuyv2gp",
                            "parent_id": "t1_iuwj2w4",
                            "score": 1,
                            "created_utc": 1667523249.0,
                            "replies": [
                                {
                                    "body": "Good for you I guess,  I do question the sanity of the guy.",
                                    "author": "LotBuilder",
                                    "id": "iuz9ycu",
                                    "parent_id": "t1_iuyv2gp",
                                    "score": 3,
                                    "created_utc": 1667529748.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "iuza5bd",
                                            "parent_id": "t1_iuz9ycu",
                                            "score": 1,
                                            "created_utc": 1667529839.0,
                                            "replies": [
                                                {
                                                    "body": "You have no reason to.  It’s all upside for you.",
                                                    "author": "LotBuilder",
                                                    "id": "iuzaasr",
                                                    "parent_id": "t1_iuza5bd",
                                                    "score": 2,
                                                    "created_utc": 1667529909.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The issue is that there was an agreement between them, and he wasn't keeping his side of it. Even if the new deal was objectively \"good\", it wasn't what she wanted.\n\nIf I offered to sell you something for a given price, but delivered something completely different,  I bet you wouldn't accept me saying that it was still a good deal.",
            "author": "Frank9567",
            "id": "iuystgr",
            "parent_id": "t1_iuwdxm0",
            "score": 1,
            "created_utc": 1667522296.0,
            "replies": [
                {
                    "body": "Agreed.  Leave him and try to do better.  Maybe you will and maybe you won’t",
                    "author": "LotBuilder",
                    "id": "iuza2tt",
                    "parent_id": "t1_iuystgr",
                    "score": 2,
                    "created_utc": 1667529806.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He had to have been sleeping with her! The insecurities came out of NO WHERE!",
            "author": "Different_Ad_8783",
            "id": "iuxilpx",
            "parent_id": "t1_iuxi0o2",
            "score": 4,
            "created_utc": 1667502134.0,
            "replies": [
                {
                    "body": "Yes! Either did or got the desire too but it's same, accusing you when he is the one in wrong is wrong from him..",
                    "author": "Rosie_rose_rosie21",
                    "id": "iuxmzs9",
                    "parent_id": "t1_iuxilpx",
                    "score": 1,
                    "created_utc": 1667503834.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She doesn't \"have to.\"",
            "author": "TigerSharkSLDF",
            "id": "iuznlyo",
            "parent_id": "t1_iuyuj18",
            "score": 0,
            "created_utc": 1667537102.0,
            "replies": []
        },
        {
            "body": "He’s blocked. This was me ranting. I don’t plan on seeing him again the first line literally says I cut him off 🙃",
            "author": "Different_Ad_8783",
            "id": "iuw2un2",
            "parent_id": "t1_iuw2l5r",
            "score": 7,
            "created_utc": 1667481626.0,
            "replies": [
                {
                    "body": "you'll be back",
                    "author": "oskih",
                    "id": "iuw3u49",
                    "parent_id": "t1_iuw2un2",
                    "score": -3,
                    "created_utc": 1667482076.0,
                    "replies": []
                },
                {
                    "body": "well at this point he is living rent free in your head",
                    "author": "inside_andout",
                    "id": "iuw33yf",
                    "parent_id": "t1_iuw2un2",
                    "score": -6,
                    "created_utc": 1667481745.0,
                    "replies": [
                        {
                            "body": "Lmfao you’re attempting to be a smartass and it’s kinda just showing you lack reading comprehension. This just happened yesterday, as said in post. I didn’t talk to anyone about it irl so I ranted online to get out my final frustrations. Say something useful or just read. It’s a rant, babes.",
                            "author": "Different_Ad_8783",
                            "id": "iuw3qlf",
                            "parent_id": "t1_iuw33yf",
                            "score": 7,
                            "created_utc": 1667482031.0,
                            "replies": [
                                {
                                    "body": "People seem to fail to understand that a rant is actually part of the process of evicting someone from your headspace.  It feels good, it is therapeutic and once you get it all out, you stop thinking about it so much.",
                                    "author": "Mainlyharmless",
                                    "id": "iuw41y3",
                                    "parent_id": "t1_iuw3qlf",
                                    "score": 19,
                                    "created_utc": 1667482176.0,
                                    "replies": [
                                        {
                                            "body": "EXACTLY!! Thank you 🤍",
                                            "author": "Different_Ad_8783",
                                            "id": "iuw4imk",
                                            "parent_id": "t1_iuw41y3",
                                            "score": 3,
                                            "created_utc": 1667482391.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": ">Lmfao you’re attempting to be a smartass and it’s kinda just showing you lack reading comprehension. This just happened yesterday, as said in post. I didn’t talk to anyone about it irl so I ranted online to get out my final frustrations. Say something useless or just read. It’s a rant, babes.\n\nyou've just exposed yourself as a crazy girl\n\nthere's definitely more to this story than you're not telling, would love to hear his side\n\nthere's probably big reasons regarding your personality which is why he moved the way that he did",
                                    "author": "inside_andout",
                                    "id": "iuw45ys",
                                    "parent_id": "t1_iuw3qlf",
                                    "score": -14,
                                    "created_utc": 1667482228.0,
                                    "replies": [
                                        {
                                            "body": "Lol. I’ll let you live with your imagination of me being insane for asking you to read. Have a great rest of your day 🤍",
                                            "author": "Different_Ad_8783",
                                            "id": "iuw4esr",
                                            "parent_id": "t1_iuw45ys",
                                            "score": 11,
                                            "created_utc": 1667482342.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "lmao aren’t you the guy that doesn’t know how anatomy works? your opinion means jack shit here.",
                                            "author": "HStaz",
                                            "id": "iuw5psc",
                                            "parent_id": "t1_iuw45ys",
                                            "score": 18,
                                            "created_utc": 1667482929.0,
                                            "replies": [
                                                {
                                                    "body": "nope\n\nwhoever posted that is an incel and i've already blocked them\n\nthat person is very strange",
                                                    "author": "inside_andout",
                                                    "id": "iuw5u4m",
                                                    "parent_id": "t1_iuw5psc",
                                                    "score": -10,
                                                    "created_utc": 1667482982.0,
                                                    "replies": [
                                                        {
                                                            "body": "No, it is [you](https://imgur.com/X84eyNW). i’d suggest closing your mouth now. not only are you a liar, you’re a dumbass too.",
                                                            "author": "HStaz",
                                                            "id": "iuw7uqx",
                                                            "parent_id": "t1_iuw5u4m",
                                                            "score": 17,
                                                            "created_utc": 1667483867.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Out here doing the lords work. Thank you for this",
                                                                    "author": "Paradoxical_Platypus",
                                                                    "id": "iuwe287",
                                                                    "parent_id": "t1_iuw7uqx",
                                                                    "score": 4,
                                                                    "created_utc": 1667486465.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "you have serious problems and i suggest you get help",
                                                                    "author": "inside_andout",
                                                                    "id": "iuw8e1k",
                                                                    "parent_id": "t1_iuw7uqx",
                                                                    "score": -10,
                                                                    "created_utc": 1667484100.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "yea i’m the one with problems. go back to 6th grade health class.",
                                                                            "author": "HStaz",
                                                                            "id": "iuxltbg",
                                                                            "parent_id": "t1_iuw8e1k",
                                                                            "score": 6,
                                                                            "created_utc": 1667503374.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lmao dude, I was too into this man actually which is why I mistakenly let him not hold up his end of the deal. Sex with him was great, I wanted it all the time and let him know it. The hold up was him. I was extremely affectionate so the only thing you’re right about is maybe he just wanted to dump me. Which idk we talked everyday up until yesterday so it didn’t give that impression. We actually had a date yesterday prior to me ending it.",
            "author": "Different_Ad_8783",
            "id": "iuwhckg",
            "parent_id": "t1_iuwcoq2",
            "score": 7,
            "created_utc": 1667487782.0,
            "replies": []
        },
        {
            "body": "I can see that. If he was willing to turn things around I would continue the relationship. I don’t like when SR feel transactional either and try my best to not make them seem that way from my end. SR or not, if I don’t like you, it doesn’t matter how much money you’re giving me I can’t fake it unfortunately. But yeah I think I’ll try again. Maybe he’ll want to give it another go and maybe I’ll meet someone else",
            "author": "Different_Ad_8783",
            "id": "iuwzxkm",
            "parent_id": "t1_iuwyecl",
            "score": 3,
            "created_utc": 1667495022.0,
            "replies": []
        },
        {
            "body": "Actually, I just wanted a three hundred $ bracelet and for him to stop falsely accusing me of having sex with other men. Him paying what he agreed to originally would’ve been the cherry on top.",
            "author": "Different_Ad_8783",
            "id": "iuxp3i4",
            "parent_id": "t1_iuxkwjs",
            "score": 1,
            "created_utc": 1667504636.0,
            "replies": [
                {
                    "body": "Well, your first paragraph complains about allowance and the bracelet doesn’t come up until the last, so you can see my confusion.",
                    "author": "UseTheForceRey",
                    "id": "iuyg7sc",
                    "parent_id": "t1_iuxp3i4",
                    "score": 1,
                    "created_utc": 1667516931.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'd suggest you read the comments if you haven't. It gives a better overall picture.",
            "author": "SilkySweet2022",
            "id": "iuysihb",
            "parent_id": "t1_iuy62c0",
            "score": 2,
            "created_utc": 1667522167.0,
            "replies": []
        },
        {
            "body": "Ahh shucks, I guess so. *snaps finger*",
            "author": "Different_Ad_8783",
            "id": "iv1t2ut",
            "parent_id": "t1_iuzctjx",
            "score": 1,
            "created_utc": 1667582137.0,
            "replies": []
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "iuy5qw5",
            "parent_id": "t1_iuy5quz",
            "score": 1,
            "created_utc": 1667510986.0,
            "replies": []
        },
        {
            "body": "Ah OK but he's doing PPM basically instead of allowance that you get regardless of seeing him even though he agreed to allowance. Sounds like a typical broke guy.\n\nSpeaking of [typical broke guys... ](https://imgur.com/a/k3NdTux)don't let u/inside_andout get to you, he doesn't even know [how vaginas work...](https://imgur.com/X84eyNW)",
            "author": null,
            "id": "iuw53ef",
            "parent_id": "t1_iuw3usu",
            "score": 28,
            "created_utc": 1667482653.0,
            "replies": [
                {
                    "body": "LoosePussySD was not on my bingo card today but here we are.",
                    "author": "GirlWithAFracture",
                    "id": "iuw8p1v",
                    "parent_id": "t1_iuw53ef",
                    "score": 14,
                    "created_utc": 1667484231.0,
                    "replies": []
                },
                {
                    "body": "No consistent PPM either 😭 he’s very wealthy which confused me. Just stingy and very insecure! The relationship was so much fun until last month. He let his child’s mother stay with him bc he “didn’t want to hurt her feelings” and started seeing me less but expected me to jump through hoops more. I tried to explain to him on two separate occasions that we were detouring from the initial arrangement but he refused to see where I was coming from. He then started accusing me of sleeping with someone else. Him saying yesterday he wasn’t ready to give me any gifts just sealed the deal. \n\nAnd Thanks! Some people are just internet trolls lol",
                    "author": "Different_Ad_8783",
                    "id": "iuw5yvx",
                    "parent_id": "t1_iuw53ef",
                    "score": 13,
                    "created_utc": 1667483041.0,
                    "replies": [
                        {
                            "body": "Wealth & generosity have nothing to do with each other. Most people become wealthy by being smart with their money & getting the most bang for their buck (couldn't resist the play on words, sorry!). \n\nThere are super generous SDs who only make 6 figures and there are cheapskate whales. Don't allow a person's wealth to determine anything for you. Their actions are all that matter.",
                            "author": "SilkySweet2022",
                            "id": "iuyqaza",
                            "parent_id": "t1_iuw5yvx",
                            "score": 14,
                            "created_utc": 1667521232.0,
                            "replies": [
                                {
                                    "body": "“Bang for your buck” is actually perfect! 🤣",
                                    "author": "Different_Ad_8783",
                                    "id": "iuyr9qz",
                                    "parent_id": "t1_iuyqaza",
                                    "score": 2,
                                    "created_utc": 1667521635.0,
                                    "replies": [
                                        {
                                            "body": "LOL...😘💜",
                                            "author": "SilkySweet2022",
                                            "id": "iuyrdnq",
                                            "parent_id": "t1_iuyr9qz",
                                            "score": 0,
                                            "created_utc": 1667521682.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Why did you link to that 😭. My brain broke reading that \"man\"'s logic!",
                    "author": "notnoteworthyatall",
                    "id": "iuwc1qk",
                    "parent_id": "t1_iuw53ef",
                    "score": 9,
                    "created_utc": 1667485645.0,
                    "replies": []
                },
                {
                    "body": "Lol wow. Maybe it’s just the teeny D",
                    "author": "JSBelle",
                    "id": "iuwbdx6",
                    "parent_id": "t1_iuw53ef",
                    "score": 3,
                    "created_utc": 1667485368.0,
                    "replies": []
                },
                {
                    "body": "Hahaha!!! Guys who think this way probably don’t realize their pee pee is micro sized.",
                    "author": "thehottubistoohawt",
                    "id": "iuyg7bd",
                    "parent_id": "t1_iuw53ef",
                    "score": 3,
                    "created_utc": 1667516926.0,
                    "replies": []
                },
                {
                    "body": "LOL at the last bit 🤣",
                    "author": "sa1dbym3",
                    "id": "iux5z5x",
                    "parent_id": "t1_iuw53ef",
                    "score": 1,
                    "created_utc": 1667497320.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Semantics are important.\n\nHe \\*is\\* giving you an allowance and he's getting EXACTLY what he wants... a dating relationship with a sprinkling of sex.  And he's weaponizing the lack of sex as a justification for paying less.  Dump him.\n\nBUT... something tells me that it's not one-sided and maybe you're not making him feel comfortable enough to get there.  I apartmented an SB a decade ago who constantly begged for extras and would steal loose cash from my wallet and coat when she handled them.  And then she'd complain that I wanted sex all the time.  It got so bad, I dreaded going to see her and I was relieved when she bolted and left me with an unfulfilled lease.\n\nMaybe he picks the same kinds of toxic relationships and sees you as the next nag in the chain.  Maybe he hoped someone shiny and new would be different.\n\nI would reflect on whether/how you might be making him reluctant to commit to the agreed upon \"full allowance\".  But I stand by \"dump him\"... he needs to be better.",
            "author": "S2USStudios",
            "id": "iuw68s9",
            "parent_id": "t1_iuw3usu",
            "score": 2,
            "created_utc": 1667483164.0,
            "replies": [
                {
                    "body": "Don’t take this the wrong way, but I feel you’re projecting a tad due to your bad experience. I’m very patient with him. And I enjoy his company. Would never steal from him or anyone. He was actually my POT SD back in 2020 but I was going through a breakup and couldn’t commit how he wanted. I was honest with him then and honest now so we could both make the decision best for us. We met again by chance in June and it was fun until it wasn’t. He’s not holding up his end of the deal and I am. But I enjoy our  time together so I dealt with it. Now I’m deciding not to.",
                    "author": "Different_Ad_8783",
                    "id": "iuw6wb1",
                    "parent_id": "t1_iuw68s9",
                    "score": 14,
                    "created_utc": 1667483452.0,
                    "replies": [
                        {
                            "body": "You're welcome to your opinion.  I've been successfully sugaring for 20 years.\n\nMuch of your language describes herculean effort on your part and assigns all the blame on him... including \"trying to get him to \\*spoil\\* you\" and \"having to go see him to get your rent money\".  The former suggests a tireless pattern of behavior and the latter suggests that maybe going to see him was a burden.  I was offering that there's an opportunity to look at your own behavior and learn how you might have better relationships; sugar or otherwise.\n\nConsider the possibility that he feels he's the hero in his story and he's holding out because he has some gripe (it's probably not the sex thing; I'm confident that's just an excuse... maybe he over-promised and simply can't make good, so he's milking it?).  And if money is his real problem, then the behaviors you described probably come off as hustling or nagging.  \n\n\nEither way, I totally support dumping him.  He needs to be a better communicator if he's the \"good guy\" and coach you on whatever his problem is.  And he needs to do better by you, regardless.  He should be paying you in advance of the month; not making you come to him for scraps; that's just exploiting the power dynamic in a toxic way.  \nIf you want to hold yourself blameless, I have no horse in that race.",
                            "author": "S2USStudios",
                            "id": "iuw9nsi",
                            "parent_id": "t1_iuw6wb1",
                            "score": -4,
                            "created_utc": 1667484644.0,
                            "replies": [
                                {
                                    "body": "Successfully sugaring besides the time when you got a thief an apartment and dated her when she continued to steal from you.",
                                    "author": null,
                                    "id": "iuwlpk5",
                                    "parent_id": "t1_iuw9nsi",
                                    "score": 13,
                                    "created_utc": 1667489533.0,
                                    "replies": [
                                        {
                                            "body": "Infallibility must be such a great burden.",
                                            "author": "S2USStudios",
                                            "id": "iuwmlec",
                                            "parent_id": "t1_iuwlpk5",
                                            "score": -2,
                                            "created_utc": 1667489882.0,
                                            "replies": [
                                                {
                                                    "body": "The only thing I'm infallible at is pointing out hypocrisy. Toodles.",
                                                    "author": null,
                                                    "id": "iuz8efw",
                                                    "parent_id": "t1_iuwmlec",
                                                    "score": 1,
                                                    "created_utc": 1667529040.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes, but not correctly.  Look it up... I'll wait.",
                                                            "author": "S2USStudios",
                                                            "id": "iuz8w21",
                                                            "parent_id": "t1_iuz8efw",
                                                            "score": -2,
                                                            "created_utc": 1667529262.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I mean she probably duped him before he got her the place and felt trapped afterwards.",
                                            "author": "triplebarrelxxx",
                                            "id": "iuy4m99",
                                            "parent_id": "t1_iuwlpk5",
                                            "score": 0,
                                            "created_utc": 1667510543.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Well I never said I was blameless but I am saying what you’re suggesting the problem is, isn’t. I didn’t purposely word the post to blame him it was simply framed around my frustrations with the relationship. I’ve commented multiple times how much I adore seeing him but when we are both working and he is playing house with a woman he told me no longer lives with him, it makes it harder to see him. And if I don’t see him, I don’t get my rent. Which of course I can pay it myself with my job and I have and he’s paid me back but that makes it feel like it’s not a priority for him. He’s not a burden at all. We have a lot of fun with one another. And his pockets definitely aren’t shallow so I don’t think money is the issue. I commented on another’s post earlier that I tried to talk with him twice about what the hold up was. He’s doesn’t communicate well. I truthfully think he doesn’t want to invest too much into me because he is insecure and thinks I’m sleeping with other men. I don’t know what I can do to change his mind about that. Even when I send him videos, he asks if he’s the only person to have seen it. He won’t admit to that (which I’m just assuming is the issue since the last time we were together he suggested he go through my phone).",
                                    "author": "Different_Ad_8783",
                                    "id": "iuwbef8",
                                    "parent_id": "t1_iuw9nsi",
                                    "score": 2,
                                    "created_utc": 1667485373.0,
                                    "replies": [
                                        {
                                            "body": "Sounds like he \\*IS\\* a burden.  He lies to you, he holds your money hostage, he doesn't communicate, and he's jealous.  Oh, and creepy/insecure.  \n\n\nJust ONE of those would lead me to Next a person.  No idea how that person is adored.  \n\n\nYou're better off without him.",
                                            "author": "S2USStudios",
                                            "id": "iuwc5ru",
                                            "parent_id": "t1_iuwbef8",
                                            "score": 3,
                                            "created_utc": 1667485692.0,
                                            "replies": [
                                                {
                                                    "body": "Well… when you word it like that 😂🙃",
                                                    "author": "Different_Ad_8783",
                                                    "id": "iuwckx1",
                                                    "parent_id": "t1_iuwc5ru",
                                                    "score": 3,
                                                    "created_utc": 1667485863.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": ">but that makes it feel like it’s not a priority for him.\n\nI'm new to this sub and am trying to keep an open mind, but I feel like SB's should realize 99% the time ya, you're never going to be a priority for them, that slot is for their primary relationship whom they see remaining in their future.\n\nEven if the mother of his children are in fact separated from him, (doesn't sound like it, seems like something more complicated is going on) she is still the motehr of his children. His children will be part of the rest of his life, and in turn she will be, too.\n\nWhether if you continue this relationship with him or move on to someone else, you have to recognize you will not be a priority, and the dynamic would be mostly at his convenience, and plan accordingly.\n\nI recognize other formats exists where the connection/relationship takes a larger role (that's what I'm looking for) but never go in expecting one's ideal scenario. Clearly in this case your friction revolves around the transaction aspect and that's what he sees this relationship as.",
                                            "author": "karmaextract",
                                            "id": "iuwhe7l",
                                            "parent_id": "t1_iuwbef8",
                                            "score": 3,
                                            "created_utc": 1667487801.0,
                                            "replies": [
                                                {
                                                    "body": "No you’re right. And I never tried to compete with that. But when you make a commitment with someone to do something for them, they shouldn’t have to ask multiple times. In this case, the commitment wasn’t time it was my rent. I was extremely flexible with his time. And very respectful of his relationship with her and his kids. I never even thought about suggesting  he blow them off for me. But he did commit himself to paying my rent and that needed to be a priority even if I didn’t see him. I.e. cashapp. I of course loved seeing him but times when I couldn’t because he had other priorities, cashapp would have solved a lot of issues.",
                                                    "author": "Different_Ad_8783",
                                                    "id": "iuwi3o0",
                                                    "parent_id": "t1_iuwhe7l",
                                                    "score": 2,
                                                    "created_utc": 1667488086.0,
                                                    "replies": [
                                                        {
                                                            "body": "To my dismay, most people who reach this level didn't get here by having integrity and be a beacon of justice and fairness. The higher up you go the more cutthroat they get. \n\nOf celebrity wealthy men, for all Mark Zuckerberg's faults, one thing you can't criticize him for is his personal relationships - he stuck by his (frankly not very attractive) college sweetheart wife. Warren Buffet, too (until she passed away). That's just exceedingly rare to see and require a lot of cicumstances (and luck on Zuckerberg's part) to happen.\n\nYou might still see honest men with integrity it the same proportion to the general population at the 200-300k income range, because that's what an engineer or middle manager at FAANG makes and the bar to get there isn't terribly high, but any higher income than that be prepared to be skewed towards much more cutthorat and dishonest people, percentage wise. Especially if he's cheating on his wife, don't expect him to be honest with his SB (not saying that's the case for your SD, but it certainly sounds complicated).",
                                                            "author": "karmaextract",
                                                            "id": "iuwslcr",
                                                            "parent_id": "t1_iuwi3o0",
                                                            "score": 5,
                                                            "created_utc": 1667492222.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Fair.",
                                                                    "author": "Different_Ad_8783",
                                                                    "id": "iuwu29k",
                                                                    "parent_id": "t1_iuwslcr",
                                                                    "score": 2,
                                                                    "created_utc": 1667492787.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Hey girl, we are offering advice when you asked for it. You’re not in an ideal relationship and these situations should be hard or stressful for you. Your daddy *should want* to spoil you, it’s honestly not spoiling IMO if you have to ask. I’ve never once had to ask my SD for anything, and if I had to put in “work” like it sounds like you are it would strain the relationship and not be something I would put myself or him through. His poor communication and inconsistency is a red flag, the fact that he makes you feel like it’s your job to ‘earn & collect’ money from him is icky. He may have money but is isn’t sharing it with you, he sounds like a burden to us. We aren’t trying to argue with you and your defensiveness about the situation is concerning because we can see that you are emotionally invested where you really shouldn’t be. Someday someone if going to care for you and spoil you, it should be this hard for either of you",
                                            "author": "burstofgiggles",
                                            "id": "iuwo6sj",
                                            "parent_id": "t1_iuwbef8",
                                            "score": 0,
                                            "created_utc": 1667490511.0,
                                            "replies": [
                                                {
                                                    "body": "My tone wasn’t meant to be defensive. I actually ended up agreeing with the other poster who broke down why he was a burden after this response. But no I agree he makes me jump through too many hoops and I am emotionally invested bc I enjoyed spending time with him. But it was good seeing other people’s perspective and it validated my reasoning for cutting him off.",
                                                    "author": "Different_Ad_8783",
                                                    "id": "iuwor09",
                                                    "parent_id": "t1_iuwo6sj",
                                                    "score": 3,
                                                    "created_utc": 1667490729.0,
                                                    "replies": [
                                                        {
                                                            "body": "Glad you were able to sit with your thoughts and listen to others, I was getting worried about you from your comments. Don’t exhaust yourself defending a man that doesn’t deserve your time.",
                                                            "author": "burstofgiggles",
                                                            "id": "iux4sa4",
                                                            "parent_id": "t1_iuwor09",
                                                            "score": 2,
                                                            "created_utc": 1667496869.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You sugaring for 20 years has nothing to do with HER situationship with him.",
                                    "author": "tiffie415",
                                    "id": "iuyvjbk",
                                    "parent_id": "t1_iuw9nsi",
                                    "score": 1,
                                    "created_utc": 1667523447.0,
                                    "replies": [
                                        {
                                            "body": "Reading comprehension fail.  Do not pass Go!",
                                            "author": "S2USStudios",
                                            "id": "iuz8dcg",
                                            "parent_id": "t1_iuyvjbk",
                                            "score": 0,
                                            "created_utc": 1667529027.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I thought so too! And I have to ask multiple times for the rent, almost convincing him to give it to me and I feel bad asking for money. He knows that and uses it against me. The bracelet I asked for yesterday was the first time since June that I can remember asking for anything outside of what we agreed to. No bags, shoes or extras have been asked for from me.",
            "author": "Different_Ad_8783",
            "id": "iuw7n63",
            "parent_id": "t1_iuw4to7",
            "score": 16,
            "created_utc": 1667483775.0,
            "replies": [
                {
                    "body": "Next time, gifts and extras need to be discussed up front. Not all SDs give more than the agreed upon allowance so it's an important part of the financial discussion.",
                    "author": "SilkySweet2022",
                    "id": "iuypssz",
                    "parent_id": "t1_iuw7n63",
                    "score": 3,
                    "created_utc": 1667521021.0,
                    "replies": []
                },
                {
                    "body": "I mean I never really request gifts, especially from someone whose already stingy with my allowance. Sounds like a case of not enough boundaries and not clear enough expectations tbh",
                    "author": "triplebarrelxxx",
                    "id": "iuy3sy3",
                    "parent_id": "t1_iuw7n63",
                    "score": 5,
                    "created_utc": 1667510223.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This sounds like a vanilla relationship not an SD/SB arrangement.\n\nReal SDs don't have time to be going through people's phones.\n\nI know it can be hard but as an SD I recommend keeping a professional distance. While I am very close with my SBs I also know it's an arrangement. If they stop being intimate I immediately shut it down. I'd expect the same if I stopped being generous.\n\nYou shouldn't even be giving him your time.",
            "author": "notnoteworthyatall",
            "id": "iuwbonm",
            "parent_id": "t1_iuw8ig4",
            "score": 14,
            "created_utc": 1667485493.0,
            "replies": [
                {
                    "body": "My best friend said the same thing. She told me we were more of a vanilla couple than anything. I didn’t really see it like that until now.",
                    "author": "Different_Ad_8783",
                    "id": "iuwc6e9",
                    "parent_id": "t1_iuwbonm",
                    "score": 2,
                    "created_utc": 1667485699.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow, WTF??? Yeah, to hell with that joke of an “SD”. My husband wouldn’t do that to me!!",
            "author": "Turpitudia79",
            "id": "iuztyjx",
            "parent_id": "t1_iuw8ig4",
            "score": 1,
            "created_utc": 1667541612.0,
            "replies": []
        },
        {
            "body": "Yea I understand! I’m just teasing. Sounds like you two were looking for different things.",
            "author": "NewYorkSD",
            "id": "iuwc0zm",
            "parent_id": "t1_iuwbvx3",
            "score": 3,
            "created_utc": 1667485636.0,
            "replies": []
        },
        {
            "body": "Ungrateful AF.",
            "author": "garret6758",
            "id": "iuxarnb",
            "parent_id": "t1_iuwbvx3",
            "score": -5,
            "created_utc": 1667499144.0,
            "replies": []
        },
        {
            "body": "Maybe he would only cuddle cause he has Erectile dysfunction l. Also, he sounds mean and he definitely is still with the baby mama. He isnt a real SD. A real SD will carry out the arrangement without complaining. A real SD will not cry about expenses or spending because he will have plenty of it",
            "author": "thedoctor321",
            "id": "iv1sucw",
            "parent_id": "t1_iuwto7n",
            "score": 2,
            "created_utc": 1667582046.0,
            "replies": []
        },
        {
            "body": "I would address and re evaluate your needs with him. Sounds like hes being pretty generous. Its not common people have rent paid for them.",
            "author": "Awkward_Pop_3996",
            "id": "iuwr4qg",
            "parent_id": "t1_iuwj2e4",
            "score": 0,
            "created_utc": 1667491656.0,
            "replies": []
        },
        {
            "body": "Sadly when someone is given a series of gifts (your low allowance) the gift becomes an entitlement.",
            "author": "pinotandsugar",
            "id": "iuz8dxi",
            "parent_id": "t1_iuwj2e4",
            "score": 1,
            "created_utc": 1667529034.0,
            "replies": []
        },
        {
            "body": "Understood.  I am located in San Francisco so paying a SB’s rent is pretty significant.  \n\nSeeing someone multiple times a week is a large commitment.   The lack of respect seems like a bigger issue.",
            "author": "LotBuilder",
            "id": "iuwj2w4",
            "parent_id": "t1_iuwf0am",
            "score": 3,
            "created_utc": 1667488480.0,
            "replies": [
                {
                    "body": "From his end or mine? I’ve been so worried about coming off as greedy I feel I let him disrespect me and make promises he didn’t plan on keeping.",
                    "author": "Different_Ad_8783",
                    "id": "iuwjc6b",
                    "parent_id": "t1_iuwj2w4",
                    "score": 2,
                    "created_utc": 1667488585.0,
                    "replies": [
                        {
                            "body": "Initially I thought you were but as you clarified and provided some frame of reference I think he just doesn’t have the giving spirit required to be a good SD.  You can do better.  I personally enjoy giving gifts.  My allowance is very fair for the area, not high or low,  but I enjoy using gifts and providing extra funds as a way of over delivering.",
                            "author": "LotBuilder",
                            "id": "iuws5oc",
                            "parent_id": "t1_iuwjc6b",
                            "score": 2,
                            "created_utc": 1667492053.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iuyv2gp",
                    "parent_id": "t1_iuwj2w4",
                    "score": 1,
                    "created_utc": 1667523249.0,
                    "replies": [
                        {
                            "body": "Good for you I guess,  I do question the sanity of the guy.",
                            "author": "LotBuilder",
                            "id": "iuz9ycu",
                            "parent_id": "t1_iuyv2gp",
                            "score": 3,
                            "created_utc": 1667529748.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "iuza5bd",
                                    "parent_id": "t1_iuz9ycu",
                                    "score": 1,
                                    "created_utc": 1667529839.0,
                                    "replies": [
                                        {
                                            "body": "You have no reason to.  It’s all upside for you.",
                                            "author": "LotBuilder",
                                            "id": "iuzaasr",
                                            "parent_id": "t1_iuza5bd",
                                            "score": 2,
                                            "created_utc": 1667529909.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed.  Leave him and try to do better.  Maybe you will and maybe you won’t",
            "author": "LotBuilder",
            "id": "iuza2tt",
            "parent_id": "t1_iuystgr",
            "score": 2,
            "created_utc": 1667529806.0,
            "replies": []
        },
        {
            "body": "Yes! Either did or got the desire too but it's same, accusing you when he is the one in wrong is wrong from him..",
            "author": "Rosie_rose_rosie21",
            "id": "iuxmzs9",
            "parent_id": "t1_iuxilpx",
            "score": 1,
            "created_utc": 1667503834.0,
            "replies": []
        },
        {
            "body": "you'll be back",
            "author": "oskih",
            "id": "iuw3u49",
            "parent_id": "t1_iuw2un2",
            "score": -3,
            "created_utc": 1667482076.0,
            "replies": []
        },
        {
            "body": "well at this point he is living rent free in your head",
            "author": "inside_andout",
            "id": "iuw33yf",
            "parent_id": "t1_iuw2un2",
            "score": -6,
            "created_utc": 1667481745.0,
            "replies": [
                {
                    "body": "Lmfao you’re attempting to be a smartass and it’s kinda just showing you lack reading comprehension. This just happened yesterday, as said in post. I didn’t talk to anyone about it irl so I ranted online to get out my final frustrations. Say something useful or just read. It’s a rant, babes.",
                    "author": "Different_Ad_8783",
                    "id": "iuw3qlf",
                    "parent_id": "t1_iuw33yf",
                    "score": 7,
                    "created_utc": 1667482031.0,
                    "replies": [
                        {
                            "body": "People seem to fail to understand that a rant is actually part of the process of evicting someone from your headspace.  It feels good, it is therapeutic and once you get it all out, you stop thinking about it so much.",
                            "author": "Mainlyharmless",
                            "id": "iuw41y3",
                            "parent_id": "t1_iuw3qlf",
                            "score": 19,
                            "created_utc": 1667482176.0,
                            "replies": [
                                {
                                    "body": "EXACTLY!! Thank you 🤍",
                                    "author": "Different_Ad_8783",
                                    "id": "iuw4imk",
                                    "parent_id": "t1_iuw41y3",
                                    "score": 3,
                                    "created_utc": 1667482391.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">Lmfao you’re attempting to be a smartass and it’s kinda just showing you lack reading comprehension. This just happened yesterday, as said in post. I didn’t talk to anyone about it irl so I ranted online to get out my final frustrations. Say something useless or just read. It’s a rant, babes.\n\nyou've just exposed yourself as a crazy girl\n\nthere's definitely more to this story than you're not telling, would love to hear his side\n\nthere's probably big reasons regarding your personality which is why he moved the way that he did",
                            "author": "inside_andout",
                            "id": "iuw45ys",
                            "parent_id": "t1_iuw3qlf",
                            "score": -14,
                            "created_utc": 1667482228.0,
                            "replies": [
                                {
                                    "body": "Lol. I’ll let you live with your imagination of me being insane for asking you to read. Have a great rest of your day 🤍",
                                    "author": "Different_Ad_8783",
                                    "id": "iuw4esr",
                                    "parent_id": "t1_iuw45ys",
                                    "score": 11,
                                    "created_utc": 1667482342.0,
                                    "replies": []
                                },
                                {
                                    "body": "lmao aren’t you the guy that doesn’t know how anatomy works? your opinion means jack shit here.",
                                    "author": "HStaz",
                                    "id": "iuw5psc",
                                    "parent_id": "t1_iuw45ys",
                                    "score": 18,
                                    "created_utc": 1667482929.0,
                                    "replies": [
                                        {
                                            "body": "nope\n\nwhoever posted that is an incel and i've already blocked them\n\nthat person is very strange",
                                            "author": "inside_andout",
                                            "id": "iuw5u4m",
                                            "parent_id": "t1_iuw5psc",
                                            "score": -10,
                                            "created_utc": 1667482982.0,
                                            "replies": [
                                                {
                                                    "body": "No, it is [you](https://imgur.com/X84eyNW). i’d suggest closing your mouth now. not only are you a liar, you’re a dumbass too.",
                                                    "author": "HStaz",
                                                    "id": "iuw7uqx",
                                                    "parent_id": "t1_iuw5u4m",
                                                    "score": 17,
                                                    "created_utc": 1667483867.0,
                                                    "replies": [
                                                        {
                                                            "body": "Out here doing the lords work. Thank you for this",
                                                            "author": "Paradoxical_Platypus",
                                                            "id": "iuwe287",
                                                            "parent_id": "t1_iuw7uqx",
                                                            "score": 4,
                                                            "created_utc": 1667486465.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "you have serious problems and i suggest you get help",
                                                            "author": "inside_andout",
                                                            "id": "iuw8e1k",
                                                            "parent_id": "t1_iuw7uqx",
                                                            "score": -10,
                                                            "created_utc": 1667484100.0,
                                                            "replies": [
                                                                {
                                                                    "body": "yea i’m the one with problems. go back to 6th grade health class.",
                                                                    "author": "HStaz",
                                                                    "id": "iuxltbg",
                                                                    "parent_id": "t1_iuw8e1k",
                                                                    "score": 6,
                                                                    "created_utc": 1667503374.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well, your first paragraph complains about allowance and the bracelet doesn’t come up until the last, so you can see my confusion.",
            "author": "UseTheForceRey",
            "id": "iuyg7sc",
            "parent_id": "t1_iuxp3i4",
            "score": 1,
            "created_utc": 1667516931.0,
            "replies": []
        },
        {
            "body": "LoosePussySD was not on my bingo card today but here we are.",
            "author": "GirlWithAFracture",
            "id": "iuw8p1v",
            "parent_id": "t1_iuw53ef",
            "score": 14,
            "created_utc": 1667484231.0,
            "replies": []
        },
        {
            "body": "No consistent PPM either 😭 he’s very wealthy which confused me. Just stingy and very insecure! The relationship was so much fun until last month. He let his child’s mother stay with him bc he “didn’t want to hurt her feelings” and started seeing me less but expected me to jump through hoops more. I tried to explain to him on two separate occasions that we were detouring from the initial arrangement but he refused to see where I was coming from. He then started accusing me of sleeping with someone else. Him saying yesterday he wasn’t ready to give me any gifts just sealed the deal. \n\nAnd Thanks! Some people are just internet trolls lol",
            "author": "Different_Ad_8783",
            "id": "iuw5yvx",
            "parent_id": "t1_iuw53ef",
            "score": 13,
            "created_utc": 1667483041.0,
            "replies": [
                {
                    "body": "Wealth & generosity have nothing to do with each other. Most people become wealthy by being smart with their money & getting the most bang for their buck (couldn't resist the play on words, sorry!). \n\nThere are super generous SDs who only make 6 figures and there are cheapskate whales. Don't allow a person's wealth to determine anything for you. Their actions are all that matter.",
                    "author": "SilkySweet2022",
                    "id": "iuyqaza",
                    "parent_id": "t1_iuw5yvx",
                    "score": 14,
                    "created_utc": 1667521232.0,
                    "replies": [
                        {
                            "body": "“Bang for your buck” is actually perfect! 🤣",
                            "author": "Different_Ad_8783",
                            "id": "iuyr9qz",
                            "parent_id": "t1_iuyqaza",
                            "score": 2,
                            "created_utc": 1667521635.0,
                            "replies": [
                                {
                                    "body": "LOL...😘💜",
                                    "author": "SilkySweet2022",
                                    "id": "iuyrdnq",
                                    "parent_id": "t1_iuyr9qz",
                                    "score": 0,
                                    "created_utc": 1667521682.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why did you link to that 😭. My brain broke reading that \"man\"'s logic!",
            "author": "notnoteworthyatall",
            "id": "iuwc1qk",
            "parent_id": "t1_iuw53ef",
            "score": 9,
            "created_utc": 1667485645.0,
            "replies": []
        },
        {
            "body": "Lol wow. Maybe it’s just the teeny D",
            "author": "JSBelle",
            "id": "iuwbdx6",
            "parent_id": "t1_iuw53ef",
            "score": 3,
            "created_utc": 1667485368.0,
            "replies": []
        },
        {
            "body": "Hahaha!!! Guys who think this way probably don’t realize their pee pee is micro sized.",
            "author": "thehottubistoohawt",
            "id": "iuyg7bd",
            "parent_id": "t1_iuw53ef",
            "score": 3,
            "created_utc": 1667516926.0,
            "replies": []
        },
        {
            "body": "LOL at the last bit 🤣",
            "author": "sa1dbym3",
            "id": "iux5z5x",
            "parent_id": "t1_iuw53ef",
            "score": 1,
            "created_utc": 1667497320.0,
            "replies": []
        },
        {
            "body": "Don’t take this the wrong way, but I feel you’re projecting a tad due to your bad experience. I’m very patient with him. And I enjoy his company. Would never steal from him or anyone. He was actually my POT SD back in 2020 but I was going through a breakup and couldn’t commit how he wanted. I was honest with him then and honest now so we could both make the decision best for us. We met again by chance in June and it was fun until it wasn’t. He’s not holding up his end of the deal and I am. But I enjoy our  time together so I dealt with it. Now I’m deciding not to.",
            "author": "Different_Ad_8783",
            "id": "iuw6wb1",
            "parent_id": "t1_iuw68s9",
            "score": 14,
            "created_utc": 1667483452.0,
            "replies": [
                {
                    "body": "You're welcome to your opinion.  I've been successfully sugaring for 20 years.\n\nMuch of your language describes herculean effort on your part and assigns all the blame on him... including \"trying to get him to \\*spoil\\* you\" and \"having to go see him to get your rent money\".  The former suggests a tireless pattern of behavior and the latter suggests that maybe going to see him was a burden.  I was offering that there's an opportunity to look at your own behavior and learn how you might have better relationships; sugar or otherwise.\n\nConsider the possibility that he feels he's the hero in his story and he's holding out because he has some gripe (it's probably not the sex thing; I'm confident that's just an excuse... maybe he over-promised and simply can't make good, so he's milking it?).  And if money is his real problem, then the behaviors you described probably come off as hustling or nagging.  \n\n\nEither way, I totally support dumping him.  He needs to be a better communicator if he's the \"good guy\" and coach you on whatever his problem is.  And he needs to do better by you, regardless.  He should be paying you in advance of the month; not making you come to him for scraps; that's just exploiting the power dynamic in a toxic way.  \nIf you want to hold yourself blameless, I have no horse in that race.",
                    "author": "S2USStudios",
                    "id": "iuw9nsi",
                    "parent_id": "t1_iuw6wb1",
                    "score": -4,
                    "created_utc": 1667484644.0,
                    "replies": [
                        {
                            "body": "Successfully sugaring besides the time when you got a thief an apartment and dated her when she continued to steal from you.",
                            "author": null,
                            "id": "iuwlpk5",
                            "parent_id": "t1_iuw9nsi",
                            "score": 13,
                            "created_utc": 1667489533.0,
                            "replies": [
                                {
                                    "body": "Infallibility must be such a great burden.",
                                    "author": "S2USStudios",
                                    "id": "iuwmlec",
                                    "parent_id": "t1_iuwlpk5",
                                    "score": -2,
                                    "created_utc": 1667489882.0,
                                    "replies": [
                                        {
                                            "body": "The only thing I'm infallible at is pointing out hypocrisy. Toodles.",
                                            "author": null,
                                            "id": "iuz8efw",
                                            "parent_id": "t1_iuwmlec",
                                            "score": 1,
                                            "created_utc": 1667529040.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, but not correctly.  Look it up... I'll wait.",
                                                    "author": "S2USStudios",
                                                    "id": "iuz8w21",
                                                    "parent_id": "t1_iuz8efw",
                                                    "score": -2,
                                                    "created_utc": 1667529262.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I mean she probably duped him before he got her the place and felt trapped afterwards.",
                                    "author": "triplebarrelxxx",
                                    "id": "iuy4m99",
                                    "parent_id": "t1_iuwlpk5",
                                    "score": 0,
                                    "created_utc": 1667510543.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Well I never said I was blameless but I am saying what you’re suggesting the problem is, isn’t. I didn’t purposely word the post to blame him it was simply framed around my frustrations with the relationship. I’ve commented multiple times how much I adore seeing him but when we are both working and he is playing house with a woman he told me no longer lives with him, it makes it harder to see him. And if I don’t see him, I don’t get my rent. Which of course I can pay it myself with my job and I have and he’s paid me back but that makes it feel like it’s not a priority for him. He’s not a burden at all. We have a lot of fun with one another. And his pockets definitely aren’t shallow so I don’t think money is the issue. I commented on another’s post earlier that I tried to talk with him twice about what the hold up was. He’s doesn’t communicate well. I truthfully think he doesn’t want to invest too much into me because he is insecure and thinks I’m sleeping with other men. I don’t know what I can do to change his mind about that. Even when I send him videos, he asks if he’s the only person to have seen it. He won’t admit to that (which I’m just assuming is the issue since the last time we were together he suggested he go through my phone).",
                            "author": "Different_Ad_8783",
                            "id": "iuwbef8",
                            "parent_id": "t1_iuw9nsi",
                            "score": 2,
                            "created_utc": 1667485373.0,
                            "replies": [
                                {
                                    "body": "Sounds like he \\*IS\\* a burden.  He lies to you, he holds your money hostage, he doesn't communicate, and he's jealous.  Oh, and creepy/insecure.  \n\n\nJust ONE of those would lead me to Next a person.  No idea how that person is adored.  \n\n\nYou're better off without him.",
                                    "author": "S2USStudios",
                                    "id": "iuwc5ru",
                                    "parent_id": "t1_iuwbef8",
                                    "score": 3,
                                    "created_utc": 1667485692.0,
                                    "replies": [
                                        {
                                            "body": "Well… when you word it like that 😂🙃",
                                            "author": "Different_Ad_8783",
                                            "id": "iuwckx1",
                                            "parent_id": "t1_iuwc5ru",
                                            "score": 3,
                                            "created_utc": 1667485863.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": ">but that makes it feel like it’s not a priority for him.\n\nI'm new to this sub and am trying to keep an open mind, but I feel like SB's should realize 99% the time ya, you're never going to be a priority for them, that slot is for their primary relationship whom they see remaining in their future.\n\nEven if the mother of his children are in fact separated from him, (doesn't sound like it, seems like something more complicated is going on) she is still the motehr of his children. His children will be part of the rest of his life, and in turn she will be, too.\n\nWhether if you continue this relationship with him or move on to someone else, you have to recognize you will not be a priority, and the dynamic would be mostly at his convenience, and plan accordingly.\n\nI recognize other formats exists where the connection/relationship takes a larger role (that's what I'm looking for) but never go in expecting one's ideal scenario. Clearly in this case your friction revolves around the transaction aspect and that's what he sees this relationship as.",
                                    "author": "karmaextract",
                                    "id": "iuwhe7l",
                                    "parent_id": "t1_iuwbef8",
                                    "score": 3,
                                    "created_utc": 1667487801.0,
                                    "replies": [
                                        {
                                            "body": "No you’re right. And I never tried to compete with that. But when you make a commitment with someone to do something for them, they shouldn’t have to ask multiple times. In this case, the commitment wasn’t time it was my rent. I was extremely flexible with his time. And very respectful of his relationship with her and his kids. I never even thought about suggesting  he blow them off for me. But he did commit himself to paying my rent and that needed to be a priority even if I didn’t see him. I.e. cashapp. I of course loved seeing him but times when I couldn’t because he had other priorities, cashapp would have solved a lot of issues.",
                                            "author": "Different_Ad_8783",
                                            "id": "iuwi3o0",
                                            "parent_id": "t1_iuwhe7l",
                                            "score": 2,
                                            "created_utc": 1667488086.0,
                                            "replies": [
                                                {
                                                    "body": "To my dismay, most people who reach this level didn't get here by having integrity and be a beacon of justice and fairness. The higher up you go the more cutthroat they get. \n\nOf celebrity wealthy men, for all Mark Zuckerberg's faults, one thing you can't criticize him for is his personal relationships - he stuck by his (frankly not very attractive) college sweetheart wife. Warren Buffet, too (until she passed away). That's just exceedingly rare to see and require a lot of cicumstances (and luck on Zuckerberg's part) to happen.\n\nYou might still see honest men with integrity it the same proportion to the general population at the 200-300k income range, because that's what an engineer or middle manager at FAANG makes and the bar to get there isn't terribly high, but any higher income than that be prepared to be skewed towards much more cutthorat and dishonest people, percentage wise. Especially if he's cheating on his wife, don't expect him to be honest with his SB (not saying that's the case for your SD, but it certainly sounds complicated).",
                                                    "author": "karmaextract",
                                                    "id": "iuwslcr",
                                                    "parent_id": "t1_iuwi3o0",
                                                    "score": 5,
                                                    "created_utc": 1667492222.0,
                                                    "replies": [
                                                        {
                                                            "body": "Fair.",
                                                            "author": "Different_Ad_8783",
                                                            "id": "iuwu29k",
                                                            "parent_id": "t1_iuwslcr",
                                                            "score": 2,
                                                            "created_utc": 1667492787.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Hey girl, we are offering advice when you asked for it. You’re not in an ideal relationship and these situations should be hard or stressful for you. Your daddy *should want* to spoil you, it’s honestly not spoiling IMO if you have to ask. I’ve never once had to ask my SD for anything, and if I had to put in “work” like it sounds like you are it would strain the relationship and not be something I would put myself or him through. His poor communication and inconsistency is a red flag, the fact that he makes you feel like it’s your job to ‘earn & collect’ money from him is icky. He may have money but is isn’t sharing it with you, he sounds like a burden to us. We aren’t trying to argue with you and your defensiveness about the situation is concerning because we can see that you are emotionally invested where you really shouldn’t be. Someday someone if going to care for you and spoil you, it should be this hard for either of you",
                                    "author": "burstofgiggles",
                                    "id": "iuwo6sj",
                                    "parent_id": "t1_iuwbef8",
                                    "score": 0,
                                    "created_utc": 1667490511.0,
                                    "replies": [
                                        {
                                            "body": "My tone wasn’t meant to be defensive. I actually ended up agreeing with the other poster who broke down why he was a burden after this response. But no I agree he makes me jump through too many hoops and I am emotionally invested bc I enjoyed spending time with him. But it was good seeing other people’s perspective and it validated my reasoning for cutting him off.",
                                            "author": "Different_Ad_8783",
                                            "id": "iuwor09",
                                            "parent_id": "t1_iuwo6sj",
                                            "score": 3,
                                            "created_utc": 1667490729.0,
                                            "replies": [
                                                {
                                                    "body": "Glad you were able to sit with your thoughts and listen to others, I was getting worried about you from your comments. Don’t exhaust yourself defending a man that doesn’t deserve your time.",
                                                    "author": "burstofgiggles",
                                                    "id": "iux4sa4",
                                                    "parent_id": "t1_iuwor09",
                                                    "score": 2,
                                                    "created_utc": 1667496869.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You sugaring for 20 years has nothing to do with HER situationship with him.",
                            "author": "tiffie415",
                            "id": "iuyvjbk",
                            "parent_id": "t1_iuw9nsi",
                            "score": 1,
                            "created_utc": 1667523447.0,
                            "replies": [
                                {
                                    "body": "Reading comprehension fail.  Do not pass Go!",
                                    "author": "S2USStudios",
                                    "id": "iuz8dcg",
                                    "parent_id": "t1_iuyvjbk",
                                    "score": 0,
                                    "created_utc": 1667529027.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Next time, gifts and extras need to be discussed up front. Not all SDs give more than the agreed upon allowance so it's an important part of the financial discussion.",
            "author": "SilkySweet2022",
            "id": "iuypssz",
            "parent_id": "t1_iuw7n63",
            "score": 3,
            "created_utc": 1667521021.0,
            "replies": []
        },
        {
            "body": "I mean I never really request gifts, especially from someone whose already stingy with my allowance. Sounds like a case of not enough boundaries and not clear enough expectations tbh",
            "author": "triplebarrelxxx",
            "id": "iuy3sy3",
            "parent_id": "t1_iuw7n63",
            "score": 5,
            "created_utc": 1667510223.0,
            "replies": []
        },
        {
            "body": "My best friend said the same thing. She told me we were more of a vanilla couple than anything. I didn’t really see it like that until now.",
            "author": "Different_Ad_8783",
            "id": "iuwc6e9",
            "parent_id": "t1_iuwbonm",
            "score": 2,
            "created_utc": 1667485699.0,
            "replies": []
        },
        {
            "body": "From his end or mine? I’ve been so worried about coming off as greedy I feel I let him disrespect me and make promises he didn’t plan on keeping.",
            "author": "Different_Ad_8783",
            "id": "iuwjc6b",
            "parent_id": "t1_iuwj2w4",
            "score": 2,
            "created_utc": 1667488585.0,
            "replies": [
                {
                    "body": "Initially I thought you were but as you clarified and provided some frame of reference I think he just doesn’t have the giving spirit required to be a good SD.  You can do better.  I personally enjoy giving gifts.  My allowance is very fair for the area, not high or low,  but I enjoy using gifts and providing extra funds as a way of over delivering.",
                    "author": "LotBuilder",
                    "id": "iuws5oc",
                    "parent_id": "t1_iuwjc6b",
                    "score": 2,
                    "created_utc": 1667492053.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iuyv2gp",
            "parent_id": "t1_iuwj2w4",
            "score": 1,
            "created_utc": 1667523249.0,
            "replies": [
                {
                    "body": "Good for you I guess,  I do question the sanity of the guy.",
                    "author": "LotBuilder",
                    "id": "iuz9ycu",
                    "parent_id": "t1_iuyv2gp",
                    "score": 3,
                    "created_utc": 1667529748.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "iuza5bd",
                            "parent_id": "t1_iuz9ycu",
                            "score": 1,
                            "created_utc": 1667529839.0,
                            "replies": [
                                {
                                    "body": "You have no reason to.  It’s all upside for you.",
                                    "author": "LotBuilder",
                                    "id": "iuzaasr",
                                    "parent_id": "t1_iuza5bd",
                                    "score": 2,
                                    "created_utc": 1667529909.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lmfao you’re attempting to be a smartass and it’s kinda just showing you lack reading comprehension. This just happened yesterday, as said in post. I didn’t talk to anyone about it irl so I ranted online to get out my final frustrations. Say something useful or just read. It’s a rant, babes.",
            "author": "Different_Ad_8783",
            "id": "iuw3qlf",
            "parent_id": "t1_iuw33yf",
            "score": 7,
            "created_utc": 1667482031.0,
            "replies": [
                {
                    "body": "People seem to fail to understand that a rant is actually part of the process of evicting someone from your headspace.  It feels good, it is therapeutic and once you get it all out, you stop thinking about it so much.",
                    "author": "Mainlyharmless",
                    "id": "iuw41y3",
                    "parent_id": "t1_iuw3qlf",
                    "score": 19,
                    "created_utc": 1667482176.0,
                    "replies": [
                        {
                            "body": "EXACTLY!! Thank you 🤍",
                            "author": "Different_Ad_8783",
                            "id": "iuw4imk",
                            "parent_id": "t1_iuw41y3",
                            "score": 3,
                            "created_utc": 1667482391.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">Lmfao you’re attempting to be a smartass and it’s kinda just showing you lack reading comprehension. This just happened yesterday, as said in post. I didn’t talk to anyone about it irl so I ranted online to get out my final frustrations. Say something useless or just read. It’s a rant, babes.\n\nyou've just exposed yourself as a crazy girl\n\nthere's definitely more to this story than you're not telling, would love to hear his side\n\nthere's probably big reasons regarding your personality which is why he moved the way that he did",
                    "author": "inside_andout",
                    "id": "iuw45ys",
                    "parent_id": "t1_iuw3qlf",
                    "score": -14,
                    "created_utc": 1667482228.0,
                    "replies": [
                        {
                            "body": "Lol. I’ll let you live with your imagination of me being insane for asking you to read. Have a great rest of your day 🤍",
                            "author": "Different_Ad_8783",
                            "id": "iuw4esr",
                            "parent_id": "t1_iuw45ys",
                            "score": 11,
                            "created_utc": 1667482342.0,
                            "replies": []
                        },
                        {
                            "body": "lmao aren’t you the guy that doesn’t know how anatomy works? your opinion means jack shit here.",
                            "author": "HStaz",
                            "id": "iuw5psc",
                            "parent_id": "t1_iuw45ys",
                            "score": 18,
                            "created_utc": 1667482929.0,
                            "replies": [
                                {
                                    "body": "nope\n\nwhoever posted that is an incel and i've already blocked them\n\nthat person is very strange",
                                    "author": "inside_andout",
                                    "id": "iuw5u4m",
                                    "parent_id": "t1_iuw5psc",
                                    "score": -10,
                                    "created_utc": 1667482982.0,
                                    "replies": [
                                        {
                                            "body": "No, it is [you](https://imgur.com/X84eyNW). i’d suggest closing your mouth now. not only are you a liar, you’re a dumbass too.",
                                            "author": "HStaz",
                                            "id": "iuw7uqx",
                                            "parent_id": "t1_iuw5u4m",
                                            "score": 17,
                                            "created_utc": 1667483867.0,
                                            "replies": [
                                                {
                                                    "body": "Out here doing the lords work. Thank you for this",
                                                    "author": "Paradoxical_Platypus",
                                                    "id": "iuwe287",
                                                    "parent_id": "t1_iuw7uqx",
                                                    "score": 4,
                                                    "created_utc": 1667486465.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "you have serious problems and i suggest you get help",
                                                    "author": "inside_andout",
                                                    "id": "iuw8e1k",
                                                    "parent_id": "t1_iuw7uqx",
                                                    "score": -10,
                                                    "created_utc": 1667484100.0,
                                                    "replies": [
                                                        {
                                                            "body": "yea i’m the one with problems. go back to 6th grade health class.",
                                                            "author": "HStaz",
                                                            "id": "iuxltbg",
                                                            "parent_id": "t1_iuw8e1k",
                                                            "score": 6,
                                                            "created_utc": 1667503374.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wealth & generosity have nothing to do with each other. Most people become wealthy by being smart with their money & getting the most bang for their buck (couldn't resist the play on words, sorry!). \n\nThere are super generous SDs who only make 6 figures and there are cheapskate whales. Don't allow a person's wealth to determine anything for you. Their actions are all that matter.",
            "author": "SilkySweet2022",
            "id": "iuyqaza",
            "parent_id": "t1_iuw5yvx",
            "score": 14,
            "created_utc": 1667521232.0,
            "replies": [
                {
                    "body": "“Bang for your buck” is actually perfect! 🤣",
                    "author": "Different_Ad_8783",
                    "id": "iuyr9qz",
                    "parent_id": "t1_iuyqaza",
                    "score": 2,
                    "created_utc": 1667521635.0,
                    "replies": [
                        {
                            "body": "LOL...😘💜",
                            "author": "SilkySweet2022",
                            "id": "iuyrdnq",
                            "parent_id": "t1_iuyr9qz",
                            "score": 0,
                            "created_utc": 1667521682.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You're welcome to your opinion.  I've been successfully sugaring for 20 years.\n\nMuch of your language describes herculean effort on your part and assigns all the blame on him... including \"trying to get him to \\*spoil\\* you\" and \"having to go see him to get your rent money\".  The former suggests a tireless pattern of behavior and the latter suggests that maybe going to see him was a burden.  I was offering that there's an opportunity to look at your own behavior and learn how you might have better relationships; sugar or otherwise.\n\nConsider the possibility that he feels he's the hero in his story and he's holding out because he has some gripe (it's probably not the sex thing; I'm confident that's just an excuse... maybe he over-promised and simply can't make good, so he's milking it?).  And if money is his real problem, then the behaviors you described probably come off as hustling or nagging.  \n\n\nEither way, I totally support dumping him.  He needs to be a better communicator if he's the \"good guy\" and coach you on whatever his problem is.  And he needs to do better by you, regardless.  He should be paying you in advance of the month; not making you come to him for scraps; that's just exploiting the power dynamic in a toxic way.  \nIf you want to hold yourself blameless, I have no horse in that race.",
            "author": "S2USStudios",
            "id": "iuw9nsi",
            "parent_id": "t1_iuw6wb1",
            "score": -4,
            "created_utc": 1667484644.0,
            "replies": [
                {
                    "body": "Successfully sugaring besides the time when you got a thief an apartment and dated her when she continued to steal from you.",
                    "author": null,
                    "id": "iuwlpk5",
                    "parent_id": "t1_iuw9nsi",
                    "score": 13,
                    "created_utc": 1667489533.0,
                    "replies": [
                        {
                            "body": "Infallibility must be such a great burden.",
                            "author": "S2USStudios",
                            "id": "iuwmlec",
                            "parent_id": "t1_iuwlpk5",
                            "score": -2,
                            "created_utc": 1667489882.0,
                            "replies": [
                                {
                                    "body": "The only thing I'm infallible at is pointing out hypocrisy. Toodles.",
                                    "author": null,
                                    "id": "iuz8efw",
                                    "parent_id": "t1_iuwmlec",
                                    "score": 1,
                                    "created_utc": 1667529040.0,
                                    "replies": [
                                        {
                                            "body": "Yes, but not correctly.  Look it up... I'll wait.",
                                            "author": "S2USStudios",
                                            "id": "iuz8w21",
                                            "parent_id": "t1_iuz8efw",
                                            "score": -2,
                                            "created_utc": 1667529262.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I mean she probably duped him before he got her the place and felt trapped afterwards.",
                            "author": "triplebarrelxxx",
                            "id": "iuy4m99",
                            "parent_id": "t1_iuwlpk5",
                            "score": 0,
                            "created_utc": 1667510543.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Well I never said I was blameless but I am saying what you’re suggesting the problem is, isn’t. I didn’t purposely word the post to blame him it was simply framed around my frustrations with the relationship. I’ve commented multiple times how much I adore seeing him but when we are both working and he is playing house with a woman he told me no longer lives with him, it makes it harder to see him. And if I don’t see him, I don’t get my rent. Which of course I can pay it myself with my job and I have and he’s paid me back but that makes it feel like it’s not a priority for him. He’s not a burden at all. We have a lot of fun with one another. And his pockets definitely aren’t shallow so I don’t think money is the issue. I commented on another’s post earlier that I tried to talk with him twice about what the hold up was. He’s doesn’t communicate well. I truthfully think he doesn’t want to invest too much into me because he is insecure and thinks I’m sleeping with other men. I don’t know what I can do to change his mind about that. Even when I send him videos, he asks if he’s the only person to have seen it. He won’t admit to that (which I’m just assuming is the issue since the last time we were together he suggested he go through my phone).",
                    "author": "Different_Ad_8783",
                    "id": "iuwbef8",
                    "parent_id": "t1_iuw9nsi",
                    "score": 2,
                    "created_utc": 1667485373.0,
                    "replies": [
                        {
                            "body": "Sounds like he \\*IS\\* a burden.  He lies to you, he holds your money hostage, he doesn't communicate, and he's jealous.  Oh, and creepy/insecure.  \n\n\nJust ONE of those would lead me to Next a person.  No idea how that person is adored.  \n\n\nYou're better off without him.",
                            "author": "S2USStudios",
                            "id": "iuwc5ru",
                            "parent_id": "t1_iuwbef8",
                            "score": 3,
                            "created_utc": 1667485692.0,
                            "replies": [
                                {
                                    "body": "Well… when you word it like that 😂🙃",
                                    "author": "Different_Ad_8783",
                                    "id": "iuwckx1",
                                    "parent_id": "t1_iuwc5ru",
                                    "score": 3,
                                    "created_utc": 1667485863.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">but that makes it feel like it’s not a priority for him.\n\nI'm new to this sub and am trying to keep an open mind, but I feel like SB's should realize 99% the time ya, you're never going to be a priority for them, that slot is for their primary relationship whom they see remaining in their future.\n\nEven if the mother of his children are in fact separated from him, (doesn't sound like it, seems like something more complicated is going on) she is still the motehr of his children. His children will be part of the rest of his life, and in turn she will be, too.\n\nWhether if you continue this relationship with him or move on to someone else, you have to recognize you will not be a priority, and the dynamic would be mostly at his convenience, and plan accordingly.\n\nI recognize other formats exists where the connection/relationship takes a larger role (that's what I'm looking for) but never go in expecting one's ideal scenario. Clearly in this case your friction revolves around the transaction aspect and that's what he sees this relationship as.",
                            "author": "karmaextract",
                            "id": "iuwhe7l",
                            "parent_id": "t1_iuwbef8",
                            "score": 3,
                            "created_utc": 1667487801.0,
                            "replies": [
                                {
                                    "body": "No you’re right. And I never tried to compete with that. But when you make a commitment with someone to do something for them, they shouldn’t have to ask multiple times. In this case, the commitment wasn’t time it was my rent. I was extremely flexible with his time. And very respectful of his relationship with her and his kids. I never even thought about suggesting  he blow them off for me. But he did commit himself to paying my rent and that needed to be a priority even if I didn’t see him. I.e. cashapp. I of course loved seeing him but times when I couldn’t because he had other priorities, cashapp would have solved a lot of issues.",
                                    "author": "Different_Ad_8783",
                                    "id": "iuwi3o0",
                                    "parent_id": "t1_iuwhe7l",
                                    "score": 2,
                                    "created_utc": 1667488086.0,
                                    "replies": [
                                        {
                                            "body": "To my dismay, most people who reach this level didn't get here by having integrity and be a beacon of justice and fairness. The higher up you go the more cutthroat they get. \n\nOf celebrity wealthy men, for all Mark Zuckerberg's faults, one thing you can't criticize him for is his personal relationships - he stuck by his (frankly not very attractive) college sweetheart wife. Warren Buffet, too (until she passed away). That's just exceedingly rare to see and require a lot of cicumstances (and luck on Zuckerberg's part) to happen.\n\nYou might still see honest men with integrity it the same proportion to the general population at the 200-300k income range, because that's what an engineer or middle manager at FAANG makes and the bar to get there isn't terribly high, but any higher income than that be prepared to be skewed towards much more cutthorat and dishonest people, percentage wise. Especially if he's cheating on his wife, don't expect him to be honest with his SB (not saying that's the case for your SD, but it certainly sounds complicated).",
                                            "author": "karmaextract",
                                            "id": "iuwslcr",
                                            "parent_id": "t1_iuwi3o0",
                                            "score": 5,
                                            "created_utc": 1667492222.0,
                                            "replies": [
                                                {
                                                    "body": "Fair.",
                                                    "author": "Different_Ad_8783",
                                                    "id": "iuwu29k",
                                                    "parent_id": "t1_iuwslcr",
                                                    "score": 2,
                                                    "created_utc": 1667492787.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Hey girl, we are offering advice when you asked for it. You’re not in an ideal relationship and these situations should be hard or stressful for you. Your daddy *should want* to spoil you, it’s honestly not spoiling IMO if you have to ask. I’ve never once had to ask my SD for anything, and if I had to put in “work” like it sounds like you are it would strain the relationship and not be something I would put myself or him through. His poor communication and inconsistency is a red flag, the fact that he makes you feel like it’s your job to ‘earn & collect’ money from him is icky. He may have money but is isn’t sharing it with you, he sounds like a burden to us. We aren’t trying to argue with you and your defensiveness about the situation is concerning because we can see that you are emotionally invested where you really shouldn’t be. Someday someone if going to care for you and spoil you, it should be this hard for either of you",
                            "author": "burstofgiggles",
                            "id": "iuwo6sj",
                            "parent_id": "t1_iuwbef8",
                            "score": 0,
                            "created_utc": 1667490511.0,
                            "replies": [
                                {
                                    "body": "My tone wasn’t meant to be defensive. I actually ended up agreeing with the other poster who broke down why he was a burden after this response. But no I agree he makes me jump through too many hoops and I am emotionally invested bc I enjoyed spending time with him. But it was good seeing other people’s perspective and it validated my reasoning for cutting him off.",
                                    "author": "Different_Ad_8783",
                                    "id": "iuwor09",
                                    "parent_id": "t1_iuwo6sj",
                                    "score": 3,
                                    "created_utc": 1667490729.0,
                                    "replies": [
                                        {
                                            "body": "Glad you were able to sit with your thoughts and listen to others, I was getting worried about you from your comments. Don’t exhaust yourself defending a man that doesn’t deserve your time.",
                                            "author": "burstofgiggles",
                                            "id": "iux4sa4",
                                            "parent_id": "t1_iuwor09",
                                            "score": 2,
                                            "created_utc": 1667496869.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You sugaring for 20 years has nothing to do with HER situationship with him.",
                    "author": "tiffie415",
                    "id": "iuyvjbk",
                    "parent_id": "t1_iuw9nsi",
                    "score": 1,
                    "created_utc": 1667523447.0,
                    "replies": [
                        {
                            "body": "Reading comprehension fail.  Do not pass Go!",
                            "author": "S2USStudios",
                            "id": "iuz8dcg",
                            "parent_id": "t1_iuyvjbk",
                            "score": 0,
                            "created_utc": 1667529027.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Initially I thought you were but as you clarified and provided some frame of reference I think he just doesn’t have the giving spirit required to be a good SD.  You can do better.  I personally enjoy giving gifts.  My allowance is very fair for the area, not high or low,  but I enjoy using gifts and providing extra funds as a way of over delivering.",
            "author": "LotBuilder",
            "id": "iuws5oc",
            "parent_id": "t1_iuwjc6b",
            "score": 2,
            "created_utc": 1667492053.0,
            "replies": []
        },
        {
            "body": "Good for you I guess,  I do question the sanity of the guy.",
            "author": "LotBuilder",
            "id": "iuz9ycu",
            "parent_id": "t1_iuyv2gp",
            "score": 3,
            "created_utc": 1667529748.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iuza5bd",
                    "parent_id": "t1_iuz9ycu",
                    "score": 1,
                    "created_utc": 1667529839.0,
                    "replies": [
                        {
                            "body": "You have no reason to.  It’s all upside for you.",
                            "author": "LotBuilder",
                            "id": "iuzaasr",
                            "parent_id": "t1_iuza5bd",
                            "score": 2,
                            "created_utc": 1667529909.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "People seem to fail to understand that a rant is actually part of the process of evicting someone from your headspace.  It feels good, it is therapeutic and once you get it all out, you stop thinking about it so much.",
            "author": "Mainlyharmless",
            "id": "iuw41y3",
            "parent_id": "t1_iuw3qlf",
            "score": 19,
            "created_utc": 1667482176.0,
            "replies": [
                {
                    "body": "EXACTLY!! Thank you 🤍",
                    "author": "Different_Ad_8783",
                    "id": "iuw4imk",
                    "parent_id": "t1_iuw41y3",
                    "score": 3,
                    "created_utc": 1667482391.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Lmfao you’re attempting to be a smartass and it’s kinda just showing you lack reading comprehension. This just happened yesterday, as said in post. I didn’t talk to anyone about it irl so I ranted online to get out my final frustrations. Say something useless or just read. It’s a rant, babes.\n\nyou've just exposed yourself as a crazy girl\n\nthere's definitely more to this story than you're not telling, would love to hear his side\n\nthere's probably big reasons regarding your personality which is why he moved the way that he did",
            "author": "inside_andout",
            "id": "iuw45ys",
            "parent_id": "t1_iuw3qlf",
            "score": -14,
            "created_utc": 1667482228.0,
            "replies": [
                {
                    "body": "Lol. I’ll let you live with your imagination of me being insane for asking you to read. Have a great rest of your day 🤍",
                    "author": "Different_Ad_8783",
                    "id": "iuw4esr",
                    "parent_id": "t1_iuw45ys",
                    "score": 11,
                    "created_utc": 1667482342.0,
                    "replies": []
                },
                {
                    "body": "lmao aren’t you the guy that doesn’t know how anatomy works? your opinion means jack shit here.",
                    "author": "HStaz",
                    "id": "iuw5psc",
                    "parent_id": "t1_iuw45ys",
                    "score": 18,
                    "created_utc": 1667482929.0,
                    "replies": [
                        {
                            "body": "nope\n\nwhoever posted that is an incel and i've already blocked them\n\nthat person is very strange",
                            "author": "inside_andout",
                            "id": "iuw5u4m",
                            "parent_id": "t1_iuw5psc",
                            "score": -10,
                            "created_utc": 1667482982.0,
                            "replies": [
                                {
                                    "body": "No, it is [you](https://imgur.com/X84eyNW). i’d suggest closing your mouth now. not only are you a liar, you’re a dumbass too.",
                                    "author": "HStaz",
                                    "id": "iuw7uqx",
                                    "parent_id": "t1_iuw5u4m",
                                    "score": 17,
                                    "created_utc": 1667483867.0,
                                    "replies": [
                                        {
                                            "body": "Out here doing the lords work. Thank you for this",
                                            "author": "Paradoxical_Platypus",
                                            "id": "iuwe287",
                                            "parent_id": "t1_iuw7uqx",
                                            "score": 4,
                                            "created_utc": 1667486465.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "you have serious problems and i suggest you get help",
                                            "author": "inside_andout",
                                            "id": "iuw8e1k",
                                            "parent_id": "t1_iuw7uqx",
                                            "score": -10,
                                            "created_utc": 1667484100.0,
                                            "replies": [
                                                {
                                                    "body": "yea i’m the one with problems. go back to 6th grade health class.",
                                                    "author": "HStaz",
                                                    "id": "iuxltbg",
                                                    "parent_id": "t1_iuw8e1k",
                                                    "score": 6,
                                                    "created_utc": 1667503374.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "“Bang for your buck” is actually perfect! 🤣",
            "author": "Different_Ad_8783",
            "id": "iuyr9qz",
            "parent_id": "t1_iuyqaza",
            "score": 2,
            "created_utc": 1667521635.0,
            "replies": [
                {
                    "body": "LOL...😘💜",
                    "author": "SilkySweet2022",
                    "id": "iuyrdnq",
                    "parent_id": "t1_iuyr9qz",
                    "score": 0,
                    "created_utc": 1667521682.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Successfully sugaring besides the time when you got a thief an apartment and dated her when she continued to steal from you.",
            "author": null,
            "id": "iuwlpk5",
            "parent_id": "t1_iuw9nsi",
            "score": 13,
            "created_utc": 1667489533.0,
            "replies": [
                {
                    "body": "Infallibility must be such a great burden.",
                    "author": "S2USStudios",
                    "id": "iuwmlec",
                    "parent_id": "t1_iuwlpk5",
                    "score": -2,
                    "created_utc": 1667489882.0,
                    "replies": [
                        {
                            "body": "The only thing I'm infallible at is pointing out hypocrisy. Toodles.",
                            "author": null,
                            "id": "iuz8efw",
                            "parent_id": "t1_iuwmlec",
                            "score": 1,
                            "created_utc": 1667529040.0,
                            "replies": [
                                {
                                    "body": "Yes, but not correctly.  Look it up... I'll wait.",
                                    "author": "S2USStudios",
                                    "id": "iuz8w21",
                                    "parent_id": "t1_iuz8efw",
                                    "score": -2,
                                    "created_utc": 1667529262.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I mean she probably duped him before he got her the place and felt trapped afterwards.",
                    "author": "triplebarrelxxx",
                    "id": "iuy4m99",
                    "parent_id": "t1_iuwlpk5",
                    "score": 0,
                    "created_utc": 1667510543.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well I never said I was blameless but I am saying what you’re suggesting the problem is, isn’t. I didn’t purposely word the post to blame him it was simply framed around my frustrations with the relationship. I’ve commented multiple times how much I adore seeing him but when we are both working and he is playing house with a woman he told me no longer lives with him, it makes it harder to see him. And if I don’t see him, I don’t get my rent. Which of course I can pay it myself with my job and I have and he’s paid me back but that makes it feel like it’s not a priority for him. He’s not a burden at all. We have a lot of fun with one another. And his pockets definitely aren’t shallow so I don’t think money is the issue. I commented on another’s post earlier that I tried to talk with him twice about what the hold up was. He’s doesn’t communicate well. I truthfully think he doesn’t want to invest too much into me because he is insecure and thinks I’m sleeping with other men. I don’t know what I can do to change his mind about that. Even when I send him videos, he asks if he’s the only person to have seen it. He won’t admit to that (which I’m just assuming is the issue since the last time we were together he suggested he go through my phone).",
            "author": "Different_Ad_8783",
            "id": "iuwbef8",
            "parent_id": "t1_iuw9nsi",
            "score": 2,
            "created_utc": 1667485373.0,
            "replies": [
                {
                    "body": "Sounds like he \\*IS\\* a burden.  He lies to you, he holds your money hostage, he doesn't communicate, and he's jealous.  Oh, and creepy/insecure.  \n\n\nJust ONE of those would lead me to Next a person.  No idea how that person is adored.  \n\n\nYou're better off without him.",
                    "author": "S2USStudios",
                    "id": "iuwc5ru",
                    "parent_id": "t1_iuwbef8",
                    "score": 3,
                    "created_utc": 1667485692.0,
                    "replies": [
                        {
                            "body": "Well… when you word it like that 😂🙃",
                            "author": "Different_Ad_8783",
                            "id": "iuwckx1",
                            "parent_id": "t1_iuwc5ru",
                            "score": 3,
                            "created_utc": 1667485863.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">but that makes it feel like it’s not a priority for him.\n\nI'm new to this sub and am trying to keep an open mind, but I feel like SB's should realize 99% the time ya, you're never going to be a priority for them, that slot is for their primary relationship whom they see remaining in their future.\n\nEven if the mother of his children are in fact separated from him, (doesn't sound like it, seems like something more complicated is going on) she is still the motehr of his children. His children will be part of the rest of his life, and in turn she will be, too.\n\nWhether if you continue this relationship with him or move on to someone else, you have to recognize you will not be a priority, and the dynamic would be mostly at his convenience, and plan accordingly.\n\nI recognize other formats exists where the connection/relationship takes a larger role (that's what I'm looking for) but never go in expecting one's ideal scenario. Clearly in this case your friction revolves around the transaction aspect and that's what he sees this relationship as.",
                    "author": "karmaextract",
                    "id": "iuwhe7l",
                    "parent_id": "t1_iuwbef8",
                    "score": 3,
                    "created_utc": 1667487801.0,
                    "replies": [
                        {
                            "body": "No you’re right. And I never tried to compete with that. But when you make a commitment with someone to do something for them, they shouldn’t have to ask multiple times. In this case, the commitment wasn’t time it was my rent. I was extremely flexible with his time. And very respectful of his relationship with her and his kids. I never even thought about suggesting  he blow them off for me. But he did commit himself to paying my rent and that needed to be a priority even if I didn’t see him. I.e. cashapp. I of course loved seeing him but times when I couldn’t because he had other priorities, cashapp would have solved a lot of issues.",
                            "author": "Different_Ad_8783",
                            "id": "iuwi3o0",
                            "parent_id": "t1_iuwhe7l",
                            "score": 2,
                            "created_utc": 1667488086.0,
                            "replies": [
                                {
                                    "body": "To my dismay, most people who reach this level didn't get here by having integrity and be a beacon of justice and fairness. The higher up you go the more cutthroat they get. \n\nOf celebrity wealthy men, for all Mark Zuckerberg's faults, one thing you can't criticize him for is his personal relationships - he stuck by his (frankly not very attractive) college sweetheart wife. Warren Buffet, too (until she passed away). That's just exceedingly rare to see and require a lot of cicumstances (and luck on Zuckerberg's part) to happen.\n\nYou might still see honest men with integrity it the same proportion to the general population at the 200-300k income range, because that's what an engineer or middle manager at FAANG makes and the bar to get there isn't terribly high, but any higher income than that be prepared to be skewed towards much more cutthorat and dishonest people, percentage wise. Especially if he's cheating on his wife, don't expect him to be honest with his SB (not saying that's the case for your SD, but it certainly sounds complicated).",
                                    "author": "karmaextract",
                                    "id": "iuwslcr",
                                    "parent_id": "t1_iuwi3o0",
                                    "score": 5,
                                    "created_utc": 1667492222.0,
                                    "replies": [
                                        {
                                            "body": "Fair.",
                                            "author": "Different_Ad_8783",
                                            "id": "iuwu29k",
                                            "parent_id": "t1_iuwslcr",
                                            "score": 2,
                                            "created_utc": 1667492787.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Hey girl, we are offering advice when you asked for it. You’re not in an ideal relationship and these situations should be hard or stressful for you. Your daddy *should want* to spoil you, it’s honestly not spoiling IMO if you have to ask. I’ve never once had to ask my SD for anything, and if I had to put in “work” like it sounds like you are it would strain the relationship and not be something I would put myself or him through. His poor communication and inconsistency is a red flag, the fact that he makes you feel like it’s your job to ‘earn & collect’ money from him is icky. He may have money but is isn’t sharing it with you, he sounds like a burden to us. We aren’t trying to argue with you and your defensiveness about the situation is concerning because we can see that you are emotionally invested where you really shouldn’t be. Someday someone if going to care for you and spoil you, it should be this hard for either of you",
                    "author": "burstofgiggles",
                    "id": "iuwo6sj",
                    "parent_id": "t1_iuwbef8",
                    "score": 0,
                    "created_utc": 1667490511.0,
                    "replies": [
                        {
                            "body": "My tone wasn’t meant to be defensive. I actually ended up agreeing with the other poster who broke down why he was a burden after this response. But no I agree he makes me jump through too many hoops and I am emotionally invested bc I enjoyed spending time with him. But it was good seeing other people’s perspective and it validated my reasoning for cutting him off.",
                            "author": "Different_Ad_8783",
                            "id": "iuwor09",
                            "parent_id": "t1_iuwo6sj",
                            "score": 3,
                            "created_utc": 1667490729.0,
                            "replies": [
                                {
                                    "body": "Glad you were able to sit with your thoughts and listen to others, I was getting worried about you from your comments. Don’t exhaust yourself defending a man that doesn’t deserve your time.",
                                    "author": "burstofgiggles",
                                    "id": "iux4sa4",
                                    "parent_id": "t1_iuwor09",
                                    "score": 2,
                                    "created_utc": 1667496869.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You sugaring for 20 years has nothing to do with HER situationship with him.",
            "author": "tiffie415",
            "id": "iuyvjbk",
            "parent_id": "t1_iuw9nsi",
            "score": 1,
            "created_utc": 1667523447.0,
            "replies": [
                {
                    "body": "Reading comprehension fail.  Do not pass Go!",
                    "author": "S2USStudios",
                    "id": "iuz8dcg",
                    "parent_id": "t1_iuyvjbk",
                    "score": 0,
                    "created_utc": 1667529027.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iuza5bd",
            "parent_id": "t1_iuz9ycu",
            "score": 1,
            "created_utc": 1667529839.0,
            "replies": [
                {
                    "body": "You have no reason to.  It’s all upside for you.",
                    "author": "LotBuilder",
                    "id": "iuzaasr",
                    "parent_id": "t1_iuza5bd",
                    "score": 2,
                    "created_utc": 1667529909.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "EXACTLY!! Thank you 🤍",
            "author": "Different_Ad_8783",
            "id": "iuw4imk",
            "parent_id": "t1_iuw41y3",
            "score": 3,
            "created_utc": 1667482391.0,
            "replies": []
        },
        {
            "body": "Lol. I’ll let you live with your imagination of me being insane for asking you to read. Have a great rest of your day 🤍",
            "author": "Different_Ad_8783",
            "id": "iuw4esr",
            "parent_id": "t1_iuw45ys",
            "score": 11,
            "created_utc": 1667482342.0,
            "replies": []
        },
        {
            "body": "lmao aren’t you the guy that doesn’t know how anatomy works? your opinion means jack shit here.",
            "author": "HStaz",
            "id": "iuw5psc",
            "parent_id": "t1_iuw45ys",
            "score": 18,
            "created_utc": 1667482929.0,
            "replies": [
                {
                    "body": "nope\n\nwhoever posted that is an incel and i've already blocked them\n\nthat person is very strange",
                    "author": "inside_andout",
                    "id": "iuw5u4m",
                    "parent_id": "t1_iuw5psc",
                    "score": -10,
                    "created_utc": 1667482982.0,
                    "replies": [
                        {
                            "body": "No, it is [you](https://imgur.com/X84eyNW). i’d suggest closing your mouth now. not only are you a liar, you’re a dumbass too.",
                            "author": "HStaz",
                            "id": "iuw7uqx",
                            "parent_id": "t1_iuw5u4m",
                            "score": 17,
                            "created_utc": 1667483867.0,
                            "replies": [
                                {
                                    "body": "Out here doing the lords work. Thank you for this",
                                    "author": "Paradoxical_Platypus",
                                    "id": "iuwe287",
                                    "parent_id": "t1_iuw7uqx",
                                    "score": 4,
                                    "created_utc": 1667486465.0,
                                    "replies": []
                                },
                                {
                                    "body": "you have serious problems and i suggest you get help",
                                    "author": "inside_andout",
                                    "id": "iuw8e1k",
                                    "parent_id": "t1_iuw7uqx",
                                    "score": -10,
                                    "created_utc": 1667484100.0,
                                    "replies": [
                                        {
                                            "body": "yea i’m the one with problems. go back to 6th grade health class.",
                                            "author": "HStaz",
                                            "id": "iuxltbg",
                                            "parent_id": "t1_iuw8e1k",
                                            "score": 6,
                                            "created_utc": 1667503374.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "LOL...😘💜",
            "author": "SilkySweet2022",
            "id": "iuyrdnq",
            "parent_id": "t1_iuyr9qz",
            "score": 0,
            "created_utc": 1667521682.0,
            "replies": []
        },
        {
            "body": "Infallibility must be such a great burden.",
            "author": "S2USStudios",
            "id": "iuwmlec",
            "parent_id": "t1_iuwlpk5",
            "score": -2,
            "created_utc": 1667489882.0,
            "replies": [
                {
                    "body": "The only thing I'm infallible at is pointing out hypocrisy. Toodles.",
                    "author": null,
                    "id": "iuz8efw",
                    "parent_id": "t1_iuwmlec",
                    "score": 1,
                    "created_utc": 1667529040.0,
                    "replies": [
                        {
                            "body": "Yes, but not correctly.  Look it up... I'll wait.",
                            "author": "S2USStudios",
                            "id": "iuz8w21",
                            "parent_id": "t1_iuz8efw",
                            "score": -2,
                            "created_utc": 1667529262.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean she probably duped him before he got her the place and felt trapped afterwards.",
            "author": "triplebarrelxxx",
            "id": "iuy4m99",
            "parent_id": "t1_iuwlpk5",
            "score": 0,
            "created_utc": 1667510543.0,
            "replies": []
        },
        {
            "body": "Sounds like he \\*IS\\* a burden.  He lies to you, he holds your money hostage, he doesn't communicate, and he's jealous.  Oh, and creepy/insecure.  \n\n\nJust ONE of those would lead me to Next a person.  No idea how that person is adored.  \n\n\nYou're better off without him.",
            "author": "S2USStudios",
            "id": "iuwc5ru",
            "parent_id": "t1_iuwbef8",
            "score": 3,
            "created_utc": 1667485692.0,
            "replies": [
                {
                    "body": "Well… when you word it like that 😂🙃",
                    "author": "Different_Ad_8783",
                    "id": "iuwckx1",
                    "parent_id": "t1_iuwc5ru",
                    "score": 3,
                    "created_utc": 1667485863.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">but that makes it feel like it’s not a priority for him.\n\nI'm new to this sub and am trying to keep an open mind, but I feel like SB's should realize 99% the time ya, you're never going to be a priority for them, that slot is for their primary relationship whom they see remaining in their future.\n\nEven if the mother of his children are in fact separated from him, (doesn't sound like it, seems like something more complicated is going on) she is still the motehr of his children. His children will be part of the rest of his life, and in turn she will be, too.\n\nWhether if you continue this relationship with him or move on to someone else, you have to recognize you will not be a priority, and the dynamic would be mostly at his convenience, and plan accordingly.\n\nI recognize other formats exists where the connection/relationship takes a larger role (that's what I'm looking for) but never go in expecting one's ideal scenario. Clearly in this case your friction revolves around the transaction aspect and that's what he sees this relationship as.",
            "author": "karmaextract",
            "id": "iuwhe7l",
            "parent_id": "t1_iuwbef8",
            "score": 3,
            "created_utc": 1667487801.0,
            "replies": [
                {
                    "body": "No you’re right. And I never tried to compete with that. But when you make a commitment with someone to do something for them, they shouldn’t have to ask multiple times. In this case, the commitment wasn’t time it was my rent. I was extremely flexible with his time. And very respectful of his relationship with her and his kids. I never even thought about suggesting  he blow them off for me. But he did commit himself to paying my rent and that needed to be a priority even if I didn’t see him. I.e. cashapp. I of course loved seeing him but times when I couldn’t because he had other priorities, cashapp would have solved a lot of issues.",
                    "author": "Different_Ad_8783",
                    "id": "iuwi3o0",
                    "parent_id": "t1_iuwhe7l",
                    "score": 2,
                    "created_utc": 1667488086.0,
                    "replies": [
                        {
                            "body": "To my dismay, most people who reach this level didn't get here by having integrity and be a beacon of justice and fairness. The higher up you go the more cutthroat they get. \n\nOf celebrity wealthy men, for all Mark Zuckerberg's faults, one thing you can't criticize him for is his personal relationships - he stuck by his (frankly not very attractive) college sweetheart wife. Warren Buffet, too (until she passed away). That's just exceedingly rare to see and require a lot of cicumstances (and luck on Zuckerberg's part) to happen.\n\nYou might still see honest men with integrity it the same proportion to the general population at the 200-300k income range, because that's what an engineer or middle manager at FAANG makes and the bar to get there isn't terribly high, but any higher income than that be prepared to be skewed towards much more cutthorat and dishonest people, percentage wise. Especially if he's cheating on his wife, don't expect him to be honest with his SB (not saying that's the case for your SD, but it certainly sounds complicated).",
                            "author": "karmaextract",
                            "id": "iuwslcr",
                            "parent_id": "t1_iuwi3o0",
                            "score": 5,
                            "created_utc": 1667492222.0,
                            "replies": [
                                {
                                    "body": "Fair.",
                                    "author": "Different_Ad_8783",
                                    "id": "iuwu29k",
                                    "parent_id": "t1_iuwslcr",
                                    "score": 2,
                                    "created_utc": 1667492787.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hey girl, we are offering advice when you asked for it. You’re not in an ideal relationship and these situations should be hard or stressful for you. Your daddy *should want* to spoil you, it’s honestly not spoiling IMO if you have to ask. I’ve never once had to ask my SD for anything, and if I had to put in “work” like it sounds like you are it would strain the relationship and not be something I would put myself or him through. His poor communication and inconsistency is a red flag, the fact that he makes you feel like it’s your job to ‘earn & collect’ money from him is icky. He may have money but is isn’t sharing it with you, he sounds like a burden to us. We aren’t trying to argue with you and your defensiveness about the situation is concerning because we can see that you are emotionally invested where you really shouldn’t be. Someday someone if going to care for you and spoil you, it should be this hard for either of you",
            "author": "burstofgiggles",
            "id": "iuwo6sj",
            "parent_id": "t1_iuwbef8",
            "score": 0,
            "created_utc": 1667490511.0,
            "replies": [
                {
                    "body": "My tone wasn’t meant to be defensive. I actually ended up agreeing with the other poster who broke down why he was a burden after this response. But no I agree he makes me jump through too many hoops and I am emotionally invested bc I enjoyed spending time with him. But it was good seeing other people’s perspective and it validated my reasoning for cutting him off.",
                    "author": "Different_Ad_8783",
                    "id": "iuwor09",
                    "parent_id": "t1_iuwo6sj",
                    "score": 3,
                    "created_utc": 1667490729.0,
                    "replies": [
                        {
                            "body": "Glad you were able to sit with your thoughts and listen to others, I was getting worried about you from your comments. Don’t exhaust yourself defending a man that doesn’t deserve your time.",
                            "author": "burstofgiggles",
                            "id": "iux4sa4",
                            "parent_id": "t1_iuwor09",
                            "score": 2,
                            "created_utc": 1667496869.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Reading comprehension fail.  Do not pass Go!",
            "author": "S2USStudios",
            "id": "iuz8dcg",
            "parent_id": "t1_iuyvjbk",
            "score": 0,
            "created_utc": 1667529027.0,
            "replies": []
        },
        {
            "body": "You have no reason to.  It’s all upside for you.",
            "author": "LotBuilder",
            "id": "iuzaasr",
            "parent_id": "t1_iuza5bd",
            "score": 2,
            "created_utc": 1667529909.0,
            "replies": []
        },
        {
            "body": "nope\n\nwhoever posted that is an incel and i've already blocked them\n\nthat person is very strange",
            "author": "inside_andout",
            "id": "iuw5u4m",
            "parent_id": "t1_iuw5psc",
            "score": -10,
            "created_utc": 1667482982.0,
            "replies": [
                {
                    "body": "No, it is [you](https://imgur.com/X84eyNW). i’d suggest closing your mouth now. not only are you a liar, you’re a dumbass too.",
                    "author": "HStaz",
                    "id": "iuw7uqx",
                    "parent_id": "t1_iuw5u4m",
                    "score": 17,
                    "created_utc": 1667483867.0,
                    "replies": [
                        {
                            "body": "Out here doing the lords work. Thank you for this",
                            "author": "Paradoxical_Platypus",
                            "id": "iuwe287",
                            "parent_id": "t1_iuw7uqx",
                            "score": 4,
                            "created_utc": 1667486465.0,
                            "replies": []
                        },
                        {
                            "body": "you have serious problems and i suggest you get help",
                            "author": "inside_andout",
                            "id": "iuw8e1k",
                            "parent_id": "t1_iuw7uqx",
                            "score": -10,
                            "created_utc": 1667484100.0,
                            "replies": [
                                {
                                    "body": "yea i’m the one with problems. go back to 6th grade health class.",
                                    "author": "HStaz",
                                    "id": "iuxltbg",
                                    "parent_id": "t1_iuw8e1k",
                                    "score": 6,
                                    "created_utc": 1667503374.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The only thing I'm infallible at is pointing out hypocrisy. Toodles.",
            "author": null,
            "id": "iuz8efw",
            "parent_id": "t1_iuwmlec",
            "score": 1,
            "created_utc": 1667529040.0,
            "replies": [
                {
                    "body": "Yes, but not correctly.  Look it up... I'll wait.",
                    "author": "S2USStudios",
                    "id": "iuz8w21",
                    "parent_id": "t1_iuz8efw",
                    "score": -2,
                    "created_utc": 1667529262.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well… when you word it like that 😂🙃",
            "author": "Different_Ad_8783",
            "id": "iuwckx1",
            "parent_id": "t1_iuwc5ru",
            "score": 3,
            "created_utc": 1667485863.0,
            "replies": []
        },
        {
            "body": "No you’re right. And I never tried to compete with that. But when you make a commitment with someone to do something for them, they shouldn’t have to ask multiple times. In this case, the commitment wasn’t time it was my rent. I was extremely flexible with his time. And very respectful of his relationship with her and his kids. I never even thought about suggesting  he blow them off for me. But he did commit himself to paying my rent and that needed to be a priority even if I didn’t see him. I.e. cashapp. I of course loved seeing him but times when I couldn’t because he had other priorities, cashapp would have solved a lot of issues.",
            "author": "Different_Ad_8783",
            "id": "iuwi3o0",
            "parent_id": "t1_iuwhe7l",
            "score": 2,
            "created_utc": 1667488086.0,
            "replies": [
                {
                    "body": "To my dismay, most people who reach this level didn't get here by having integrity and be a beacon of justice and fairness. The higher up you go the more cutthroat they get. \n\nOf celebrity wealthy men, for all Mark Zuckerberg's faults, one thing you can't criticize him for is his personal relationships - he stuck by his (frankly not very attractive) college sweetheart wife. Warren Buffet, too (until she passed away). That's just exceedingly rare to see and require a lot of cicumstances (and luck on Zuckerberg's part) to happen.\n\nYou might still see honest men with integrity it the same proportion to the general population at the 200-300k income range, because that's what an engineer or middle manager at FAANG makes and the bar to get there isn't terribly high, but any higher income than that be prepared to be skewed towards much more cutthorat and dishonest people, percentage wise. Especially if he's cheating on his wife, don't expect him to be honest with his SB (not saying that's the case for your SD, but it certainly sounds complicated).",
                    "author": "karmaextract",
                    "id": "iuwslcr",
                    "parent_id": "t1_iuwi3o0",
                    "score": 5,
                    "created_utc": 1667492222.0,
                    "replies": [
                        {
                            "body": "Fair.",
                            "author": "Different_Ad_8783",
                            "id": "iuwu29k",
                            "parent_id": "t1_iuwslcr",
                            "score": 2,
                            "created_utc": 1667492787.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My tone wasn’t meant to be defensive. I actually ended up agreeing with the other poster who broke down why he was a burden after this response. But no I agree he makes me jump through too many hoops and I am emotionally invested bc I enjoyed spending time with him. But it was good seeing other people’s perspective and it validated my reasoning for cutting him off.",
            "author": "Different_Ad_8783",
            "id": "iuwor09",
            "parent_id": "t1_iuwo6sj",
            "score": 3,
            "created_utc": 1667490729.0,
            "replies": [
                {
                    "body": "Glad you were able to sit with your thoughts and listen to others, I was getting worried about you from your comments. Don’t exhaust yourself defending a man that doesn’t deserve your time.",
                    "author": "burstofgiggles",
                    "id": "iux4sa4",
                    "parent_id": "t1_iuwor09",
                    "score": 2,
                    "created_utc": 1667496869.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No, it is [you](https://imgur.com/X84eyNW). i’d suggest closing your mouth now. not only are you a liar, you’re a dumbass too.",
            "author": "HStaz",
            "id": "iuw7uqx",
            "parent_id": "t1_iuw5u4m",
            "score": 17,
            "created_utc": 1667483867.0,
            "replies": [
                {
                    "body": "Out here doing the lords work. Thank you for this",
                    "author": "Paradoxical_Platypus",
                    "id": "iuwe287",
                    "parent_id": "t1_iuw7uqx",
                    "score": 4,
                    "created_utc": 1667486465.0,
                    "replies": []
                },
                {
                    "body": "you have serious problems and i suggest you get help",
                    "author": "inside_andout",
                    "id": "iuw8e1k",
                    "parent_id": "t1_iuw7uqx",
                    "score": -10,
                    "created_utc": 1667484100.0,
                    "replies": [
                        {
                            "body": "yea i’m the one with problems. go back to 6th grade health class.",
                            "author": "HStaz",
                            "id": "iuxltbg",
                            "parent_id": "t1_iuw8e1k",
                            "score": 6,
                            "created_utc": 1667503374.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, but not correctly.  Look it up... I'll wait.",
            "author": "S2USStudios",
            "id": "iuz8w21",
            "parent_id": "t1_iuz8efw",
            "score": -2,
            "created_utc": 1667529262.0,
            "replies": []
        },
        {
            "body": "To my dismay, most people who reach this level didn't get here by having integrity and be a beacon of justice and fairness. The higher up you go the more cutthroat they get. \n\nOf celebrity wealthy men, for all Mark Zuckerberg's faults, one thing you can't criticize him for is his personal relationships - he stuck by his (frankly not very attractive) college sweetheart wife. Warren Buffet, too (until she passed away). That's just exceedingly rare to see and require a lot of cicumstances (and luck on Zuckerberg's part) to happen.\n\nYou might still see honest men with integrity it the same proportion to the general population at the 200-300k income range, because that's what an engineer or middle manager at FAANG makes and the bar to get there isn't terribly high, but any higher income than that be prepared to be skewed towards much more cutthorat and dishonest people, percentage wise. Especially if he's cheating on his wife, don't expect him to be honest with his SB (not saying that's the case for your SD, but it certainly sounds complicated).",
            "author": "karmaextract",
            "id": "iuwslcr",
            "parent_id": "t1_iuwi3o0",
            "score": 5,
            "created_utc": 1667492222.0,
            "replies": [
                {
                    "body": "Fair.",
                    "author": "Different_Ad_8783",
                    "id": "iuwu29k",
                    "parent_id": "t1_iuwslcr",
                    "score": 2,
                    "created_utc": 1667492787.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Glad you were able to sit with your thoughts and listen to others, I was getting worried about you from your comments. Don’t exhaust yourself defending a man that doesn’t deserve your time.",
            "author": "burstofgiggles",
            "id": "iux4sa4",
            "parent_id": "t1_iuwor09",
            "score": 2,
            "created_utc": 1667496869.0,
            "replies": []
        },
        {
            "body": "Out here doing the lords work. Thank you for this",
            "author": "Paradoxical_Platypus",
            "id": "iuwe287",
            "parent_id": "t1_iuw7uqx",
            "score": 4,
            "created_utc": 1667486465.0,
            "replies": []
        },
        {
            "body": "you have serious problems and i suggest you get help",
            "author": "inside_andout",
            "id": "iuw8e1k",
            "parent_id": "t1_iuw7uqx",
            "score": -10,
            "created_utc": 1667484100.0,
            "replies": [
                {
                    "body": "yea i’m the one with problems. go back to 6th grade health class.",
                    "author": "HStaz",
                    "id": "iuxltbg",
                    "parent_id": "t1_iuw8e1k",
                    "score": 6,
                    "created_utc": 1667503374.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fair.",
            "author": "Different_Ad_8783",
            "id": "iuwu29k",
            "parent_id": "t1_iuwslcr",
            "score": 2,
            "created_utc": 1667492787.0,
            "replies": []
        },
        {
            "body": "yea i’m the one with problems. go back to 6th grade health class.",
            "author": "HStaz",
            "id": "iuxltbg",
            "parent_id": "t1_iuw8e1k",
            "score": 6,
            "created_utc": 1667503374.0,
            "replies": []
        }
    ]
}