{
    "title": "2011 vs 2022",
    "post_id": "ya934o",
    "post_url": "https://www.reddit.com/r/runningman/comments/ya934o/2011_vs_2022/",
    "author": "ducmanx04",
    "body": "",
    "url": "https://i.redd.it/q6dty77v29v91.jpg",
    "score": 381,
    "upvote_ratio": 0.99,
    "created_utc": 1666397864.0,
    "num_comments": 78,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I feel like RM has always been great, but what made it great differed a lot and that plays a huge part in what people enjoy the most.\n\nEarlier RM was more exciting and slapstick and moved towards awesome teamwork.\n\nMid-RM felt like it was RM vs everyone else, superstar guests, and the Kwang Soo show.\n\nCurrent RM is the era of them hanging out and trolling each other, savage PDs, and constant experimentation in format, style, and game mechanics.\n\nI personally feel like it's constantly changed, but I love all the different eras for different reasons. \n\nBeyond the cast change, you also have to remember the main PD plays a huge role, and they're on their fifth now I think?",
            "author": "PickmanSF",
            "id": "itavjcu",
            "parent_id": "t3_ya934o",
            "score": 93,
            "created_utc": 1666418530.0,
            "replies": [
                {
                    "body": "agree",
                    "author": "song_haru",
                    "id": "itb27gx",
                    "parent_id": "t1_itavjcu",
                    "score": 3,
                    "created_utc": 1666423856.0,
                    "replies": []
                },
                {
                    "body": "You... good with word! 👏👏👏🧟‍♂️",
                    "author": "ducmanx04",
                    "id": "itea67l",
                    "parent_id": "t1_itavjcu",
                    "score": 1,
                    "created_utc": 1666483222.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Currently rewatching RM Classics (at ep. 83) until more recent episodes comes out. After watching the old episodes for a while and than switching a recent one smetimes i forget how much they changed in 12 years.![img](emote|t5_2u830|5013)![img](emote|t5_2u830|5017)![img](emote|t5_2u830|5018)",
            "author": "ducmanx04",
            "id": "it9vcn2",
            "parent_id": "t3_ya934o",
            "score": 39,
            "created_utc": 1666398080.0,
            "replies": [
                {
                    "body": "I have been watching running man this year every day one episode and now i have reached ep 618 and i am a bit sad that i dont have that many episodes anymore but i found new good variety show called Knowing Bros its good funny but still didnt reach Runningman level \n\n\nAnyway i wanted to ask you is it different experience rewatching runningman from the beginning again ?\nI one rewatch shows that i think i will get whole different veiw of it in the second time and i think that will happen with RM but i dont plan to rewatch it now i think i will rewatch it after i finsh Knowing Bros and Infinite challenge",
                    "author": "Preziine88",
                    "id": "iu0abyk",
                    "parent_id": "t1_it9vcn2",
                    "score": 3,
                    "created_utc": 1666888499.0,
                    "replies": [
                        {
                            "body": "Yeah I didnt plan on rewatching RM from the beginning as well but since you know how the cast turns out, I feel like I appreciate the cast more. Its really interesting how they acted before and their journey to becoming their current characters. Mad hilarious. Plus i found alot of things i missed watching it the first time esp since there is so much going on. You get reminded of things you totally didnt even noticed in the beginning. IDK thats my 2 cents. \n\nWhat other shows do you watch besides RM and Knowing Bros?",
                            "author": "ducmanx04",
                            "id": "iu0v1z1",
                            "parent_id": "t1_iu0abyk",
                            "score": 2,
                            "created_utc": 1666896477.0,
                            "replies": [
                                {
                                    "body": "Cool then i will rewatch Rm after 2 years maybe it will be better if i forgot a lot of stuff and the early episodes are really exciting and there's a lot of stuff going on and i remember unfortunately i skipped some episodes just because of ratings in the first 200 episodes so i have new ones as well ;) \n\nRM and KB are the only varieties i have seen",
                                    "author": "Preziine88",
                                    "id": "iu2fwu7",
                                    "parent_id": "t1_iu0v1z1",
                                    "score": 1,
                                    "created_utc": 1666920694.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've no idea how in tune to overall Korean fashion trends their stylists were over the years, but the fashion trends they went through were absolutely wild. I know shit about fashion sense but you can definitely see how all the members went through different fashion trends on the show from the longish kpop hair that KJK and LKS had in the 2011 pic to the awful popped collars the guys always had on to the more modern sensibilities nowadays... and then whatever HH and JSJ's stylists would try to dress them in.",
            "author": "ScorpiusDX",
            "id": "ita8xxp",
            "parent_id": "t3_ya934o",
            "score": 24,
            "created_utc": 1666404666.0,
            "replies": [
                {
                    "body": "Im was saying the same thing the other day but about cell phones. If you watch the crowd when they play games in public, you can see the trends shifting from the flip phones in 2010  to PDAs in 2011 and then the emergence of smart phones randomly.",
                    "author": "ducmanx04",
                    "id": "itebleu",
                    "parent_id": "t1_ita8xxp",
                    "score": 3,
                    "created_utc": 1666483897.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So weird how Ji Suk Jin doesn’t look like he aged compared to everyone else. Then again he’s always the oldest and he was old even then so maybe that’s it lol.",
            "author": "Juliofromny1977",
            "id": "itbx5n8",
            "parent_id": "t3_ya934o",
            "score": 13,
            "created_utc": 1666446399.0,
            "replies": [
                {
                    "body": "he's 10 years older than jongkook isn't he? so 2011 sukjin is younger than 2022 jongkook? lol",
                    "author": "botolsusu",
                    "id": "itc2evo",
                    "parent_id": "t1_itbx5n8",
                    "score": 6,
                    "created_utc": 1666448910.0,
                    "replies": [
                        {
                            "body": "There’s that. But I was comparing everyone with their younger selves, looks wise. Out of everyone, Suk Jin’s face seems the least changed. I guess aging from 40 to 50 isn’t as drastic as 30 to 40. Cuz everyone is now in their 40s except Suk Jin who is in his 50s.",
                            "author": "Juliofromny1977",
                            "id": "itc2s3l",
                            "parent_id": "t1_itc2evo",
                            "score": 6,
                            "created_utc": 1666449074.0,
                            "replies": [
                                {
                                    "body": "JaeSuk is in his 50s too. \n\nAnd I agree about JSJ. Out of everyone, he has consistently looked good. Not just because he looks younger than his age, which he really does - but he actually is handsome and cares about how he looks. If only his stylist lets him off easy a few times 😂 I'm still not over the onesies with the cowboy hat look. \n\nKJK has changed the most, and he strangely looks much better now. 😁 Age becomes him. That Justin Bieber hairstyle also wasn't working for him. LKS is the other one who looks better, but I guess that is to be expected wasn't he like barely 25? \n\nAlso, Haha has so much swag so I always find him attractive. Before and now. Now more so.\n\nI kinda think they're all good looking, even YSC. He cleans up pretty well and he's manly so I find him attractive. JSM is a total goddess to me, like top 2 most beautiful Korean women (#1 is Kim Minji from Dreamcatcher https://i.imgur.com/5gO8EJQ_d.webp?maxwidth=640&shape=thumb&fidelity=medium ) \n\nEdit for link",
                                    "author": null,
                                    "id": "item5lh",
                                    "parent_id": "t1_itc2s3l",
                                    "score": 7,
                                    "created_utc": 1666488972.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "For me personally, i think JSJ got so much funnier later on.",
                    "author": "ducmanx04",
                    "id": "itecizl",
                    "parent_id": "t1_itbx5n8",
                    "score": 2,
                    "created_utc": 1666484338.0,
                    "replies": [
                        {
                            "body": "hmmm.. I find him usually annoying more often than not. When he is funny it's only accidentally or because he was set up perfectly by YJS, KJK or some other cast member. \n\nOR when he's the butt of the joke and it's at his expense. \n\n&#x200B;\n\nAnd I say annoying because he's just so fake. They're always talking about how fake he is. He doesn't do anything unless it's for his benefit. Like he isn't \"energetic\" or a\" team player\" until the cameras are on. \n\n&#x200B;\n\nEven in the early years, he always coveted being the main draw of the show but he just isn't. If elimination is the name of the game, he's usually the first one out. He's the most out of shape (which is why he targets women, b/c he thinks he'll have the edge), the laziest, the one that gripes the most, the one that tries to get the producers to edit him so he comes out in a good light, etc. \n\n&#x200B;\n\nEven when KJK invited YJS over to his YT channel and he was just a guest (at YJS behest) he still was trying to get as much camera time as possible (oh yeah and he stole/copied an idea that KJK and YJS said they wanted to do on YT in the future). \n\n&#x200B;\n\nI just get annoyed by his opportunistic, selfish, egotistical ways and it baffles me that YJS sees him as such a good friend. Maybe there's a reason for that off camera. But everything that I've seen on RM, YT, and How do you play just keeps cementing in my mind how self-centered and selfish he is and I wouldn't be  sad if he left the show or got replaced. But that's just me lol.",
                            "author": "Juliofromny1977",
                            "id": "itedzsi",
                            "parent_id": "t1_itecizl",
                            "score": -3,
                            "created_utc": 1666485026.0,
                            "replies": [
                                {
                                    "body": "KJK and LKS also target women all the time as well. And they're very visibly stronger than the weakest member, so they don't even have to. I find that much more annoying than JSJ doing it. If you're weak, it makes sense to go after someone equally as weak or a little weaker. That's the only option that makes sense. But if you're KJK, you can pretty much have your pick out of 3-4 others, so why does he feel the need to target the easy members? \n\nAbout the rest of your issues with him, I think that is genuinely his variety character. Him joking about editing and screentime and closeup is for show, and we don't know the real person behind this character.",
                                    "author": null,
                                    "id": "itenp5u",
                                    "parent_id": "t1_itedzsi",
                                    "score": 6,
                                    "created_utc": 1666489719.0,
                                    "replies": [
                                        {
                                            "body": "I hope so. It’s just that’s consistently him in every bit of media I’ve seen him in, not solely RM. Even KJK shows a different side of himself in My Little Old boy.\n\nAs for going after the weakest. They do not do it all the time. Yeah at times they will. It is a competition after all. My point is JSJ does it 10 out of 10 times. It’s predictable. He’s been doing it for 10 years straight. And when Jeon So Min joined the cast she’s been his number 1 target. \n\nSong Jihyo has bested SJS a few times. (I think even in a mud flats episode where you had to throw the other opponent to the ground), so he doesn’t go after her. But Jeon SoMin he goes for her with a Cheshire grin.",
                                            "author": "Juliofromny1977",
                                            "id": "iteojf5",
                                            "parent_id": "t1_itenp5u",
                                            "score": -1,
                                            "created_utc": 1666490133.0,
                                            "replies": [
                                                {
                                                    "body": "I haven't seen him much outside of RM except a few episodes of idol picnic (lmao I swear I only watched for a favorite group) and his radio show and he seems like a very normal middle-aged man. From what I've seen of other members about him, they only have nice things to say too. So I won't judge. I'm fine with character on the show too. \n\nAlso, when I used the word \"all the time\" I didn't mean it literally every single time. But many times, it has happened that KJK or LKS go after women or JSJ when they really don't needed to. This means they got eliminated early and didn't get screentime during those games. Actually one reason I'm glad the nametag game isn't around anymore! I really didn't like how unfair it was because it was pretty much impossible to win against LKS, YJS and KJK. It just wasn't fun when you knew exactly who was going to last the shortest amount time and who was gonna probably win. \n\nI don't mind him going after JSM either. I appreciate their father daughter dynamic as it's wholesome and cute. He also avoids SJH probably because of her fanatic fans, as he has actually said so during the show! So that just leaves JSM, and I'm all for it seeing them go at it. It's usually very hilarious too.\n\nEdit: but he's my third favorite member, so I'm probably biased. I can almost never find fault with my ultimate trio of JSM-YJS-JSJ. 😁 (And LKS when he was around)",
                                                    "author": null,
                                                    "id": "itepn54",
                                                    "parent_id": "t1_iteojf5",
                                                    "score": 3,
                                                    "created_utc": 1666490679.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "everyone got cuter esp haha",
            "author": "BigWordsAreScary",
            "id": "itautay",
            "parent_id": "t3_ya934o",
            "score": 13,
            "created_utc": 1666417973.0,
            "replies": [
                {
                    "body": "Esp Jihyo. Seeeeesh. She not only gorgeous amd smart but funny af when she wants to be",
                    "author": "ducmanx04",
                    "id": "itebun5",
                    "parent_id": "t1_itautay",
                    "score": -1,
                    "created_utc": 1666484020.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I hope they gather all the running man (incl  gary, Joong-ki, kwang soo) for a special episode",
            "author": "gbhari96",
            "id": "itbidue",
            "parent_id": "t3_ya934o",
            "score": 7,
            "created_utc": 1666437650.0,
            "replies": [
                {
                    "body": "How dare you call Mr. Randomly capable that! I demand a duel! Lol jp hey, to each their own.",
                    "author": "ducmanx04",
                    "id": "itecxj0",
                    "parent_id": "t1_itbidue",
                    "score": 3,
                    "created_utc": 1666484531.0,
                    "replies": [
                        {
                            "body": "I think they meant \"including\" not incel 😁",
                            "author": null,
                            "id": "itens6a",
                            "parent_id": "t1_itecxj0",
                            "score": 3,
                            "created_utc": 1666489760.0,
                            "replies": [
                                {
                                    "body": "@Gbhari96 Lmaoooooooooo im dead 🤣😂💀☠️💀☠️. Im sorry, my bad.",
                                    "author": "ducmanx04",
                                    "id": "iteqsko",
                                    "parent_id": "t1_itens6a",
                                    "score": 1,
                                    "created_utc": 1666491255.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "its including 🤣🤣 damn dude!!!",
                            "author": "gbhari96",
                            "id": "iuilh6v",
                            "parent_id": "t1_itecxj0",
                            "score": 2,
                            "created_utc": 1667234277.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I miss Gary in RM a lot.",
            "author": "aussie_asian",
            "id": "itapl14",
            "parent_id": "t3_ya934o",
            "score": 29,
            "created_utc": 1666414218.0,
            "replies": [
                {
                    "body": "Bro, Gary was the mfing man. He was so weird, goofy, gullible, outgoing and confident self. He was never afraid to be himself whomever the celebrity guest was. I think thats why alot of the female guest loved him. His genuine reactions were the funniest.",
                    "author": "ducmanx04",
                    "id": "itatlxc",
                    "parent_id": "t1_itapl14",
                    "score": 18,
                    "created_utc": 1666417066.0,
                    "replies": [
                        {
                            "body": "his early nicknames like peaceful gary, go-straight gary were so hilarious honestly",
                            "author": "justahalfling",
                            "id": "itb4a38",
                            "parent_id": "t1_itatlxc",
                            "score": 14,
                            "created_utc": 1666425592.0,
                            "replies": [
                                {
                                    "body": "I always loved the STRESS era",
                                    "author": "ducmanx04",
                                    "id": "ited47w",
                                    "parent_id": "t1_itb4a38",
                                    "score": 7,
                                    "created_utc": 1666484617.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "He was my favorite member. And then when I moved on to LKS, eventually he left too :(",
                    "author": "magablossom",
                    "id": "iu27l77",
                    "parent_id": "t1_itapl14",
                    "score": 3,
                    "created_utc": 1666916898.0,
                    "replies": []
                },
                {
                    "body": "For someone who didn't have any experience in variety shows, he was still hilarious and one of my favorite members of all time.",
                    "author": "OnAndOffBackAndForth",
                    "id": "iuzs74j",
                    "parent_id": "t1_itapl14",
                    "score": 2,
                    "created_utc": 1667540267.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So much good memories were had. Can't thank them enough for all the entertainment they brought.",
            "author": "mfirdhaus",
            "id": "itb8ixb",
            "parent_id": "t3_ya934o",
            "score": 3,
            "created_utc": 1666429348.0,
            "replies": []
        },
        {
            "body": "I was one of those people that believed running man should ended peacefully around the KJK SJH scandal, i used to believed the show should end with happy atmosphere instead of sad ones.\nI'm so glad to be proven wrong. To this day they managed to be fun to watch every week.",
            "author": "ImBothSoftAndHard",
            "id": "itbzpwr",
            "parent_id": "t3_ya934o",
            "score": 3,
            "created_utc": 1666447647.0,
            "replies": []
        },
        {
            "body": "Is this even a competitive... Their is a reason they had so many fans when they did in the earlier days, but the new stuff is still good enough tho.",
            "author": "kenkion00",
            "id": "it9ve7f",
            "parent_id": "t3_ya934o",
            "score": 9,
            "created_utc": 1666398100.0,
            "replies": [
                {
                    "body": "Nah its not. Like i said, im rewatching the old episodes again while waiting for the new episodes to be released. I find it funny that when i binge watch the old stuff and then switch to the new episodes, i always forget how much they aged. Lol",
                    "author": "ducmanx04",
                    "id": "ita737s",
                    "parent_id": "t1_it9ve7f",
                    "score": 9,
                    "created_utc": 1666403754.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am a weird one: I became a fan in 2022, tried watching the earlier episodes but with the exception of a few episodes (I only watched most favorites and most iconic ones, pretty much only liked 2 from the 10-12 that I watched. 213 is my favorite) I couldn't get into it. \n\nFavorite intervals of episodes for me were 360-415 (2017-18) and then 440-480. (2018-19) \n\nAfter those, the other stretches of episodes I've enjoyed very much were 560-600 (2021-22) and then just a couple of episodes after 600 like 603, 610, 615, 620 (opening only), and 622. \n\nI mean nobody asked but still😁😁😁 \n\nJust wanted to say there are odd ones out there who like the newer RM better.",
            "author": null,
            "id": "ita6fcx",
            "parent_id": "t3_ya934o",
            "score": 9,
            "created_utc": 1666403441.0,
            "replies": [
                {
                    "body": "Hey to each their own man. One of the biggest reasons why im rewatching from the beginning is to catalog my favorite moments from each episodes. The small incidents, gossip and banter that was missed when i watched it the first time are freakin hilarious. Knowing how they turned out, their old selves are so funny. I find myself appreciate the cast even more. Esp. Kwangsoo. Lmaoo his evolution from the nervous quiet youngster to him starting to tease Jong Kook, and fighting back then eventually become how he is now is crazy funny. He had the balls to even do it back then 🤣😂🤣😂🤣😂",
                    "author": "ducmanx04",
                    "id": "ita817y",
                    "parent_id": "t1_ita6fcx",
                    "score": 14,
                    "created_utc": 1666404207.0,
                    "replies": [
                        {
                            "body": "There used to be a tumblr who did something similar for the first 100 or so episodes so they'd have the tropes and ships and games and rewards. Might be down data to check out!",
                            "author": "Shephrah",
                            "id": "itamewq",
                            "parent_id": "t1_ita817y",
                            "score": 5,
                            "created_utc": 1666412152.0,
                            "replies": [
                                {
                                    "body": "Lol yeah, tumblr is a great place for RM famboy/fangirl pics and gifs. Thanks for the heads up!",
                                    "author": "ducmanx04",
                                    "id": "itaurwu",
                                    "parent_id": "t1_itamewq",
                                    "score": 2,
                                    "created_utc": 1666417943.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "In terms of physical games and missions, early RM was peak. You just couldn't top some of the missions they went through like the Han river boat or the other international episodes or the superpower ones. Although the style now gives a lot more room for top notch banter between the members.",
                    "author": "ScorpiusDX",
                    "id": "ita9asx",
                    "parent_id": "t1_ita6fcx",
                    "score": 8,
                    "created_utc": 1666404848.0,
                    "replies": [
                        {
                            "body": "🤣😂🤣😂🤣😂 the freakin cardboard boats lmao. Imagine having to row across that bitch with makeshift materials, I would have died half way. \n\nMy absolute favorites moments where whenever they did water/mud games and matches. You also had to give it up to the earlier PDs and writers. They had some absolute genius plot twist and events lined up. KJK dunking Jea-Suks head over and over in the mud pit. Absolute gold.",
                            "author": "ducmanx04",
                            "id": "itavpxb",
                            "parent_id": "t1_ita9asx",
                            "score": 2,
                            "created_utc": 1666418676.0,
                            "replies": [
                                {
                                    "body": "And then using Ji Suk Jin as a pencil.",
                                    "author": "OnAndOffBackAndForth",
                                    "id": "iuzslcz",
                                    "parent_id": "t1_itavpxb",
                                    "score": 1,
                                    "created_utc": 1667540563.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "That's the thing: I much prefer seeing them hangout and talk and be around each other than crazy hard activities that has them solely focused on the game/activity. I feel like the game show era meant they didn't focus on the relationship and bond of the cast, it only came out through actions. It might be because I'm generally a passive person, I'm a woman, I don't like sports at all and I'd rather watch any movie other than action or sports films. LoL \n\nI think the great thing about this show is how it has evolved and has gained new fans over the years and also managed to maintain its old fans.",
                            "author": null,
                            "id": "itbjfqi",
                            "parent_id": "t1_ita9asx",
                            "score": 3,
                            "created_utc": 1666438430.0,
                            "replies": []
                        },
                        {
                            "body": "Totally agreed especially since the production not just need to think of safety like the han river one/the one they went for the alligator at Australia but to think what kind of mission & adventure for the members.\n\nThinking back,some of the mission can be deemed dangerous especially the alligator one. Imagine something goes wrong,who going to answer towards the members family. My favourite mission was when they went to Hong Kong,the one with Miss A Fei(who can speak Mandarin?) so she is not allowed to speak & CNblue Yonghwa had a fan telling the taxi driver the instruction. \n\nThe newer style is what we like especially the trio(Sukjin-Jaesuk-Jongkook). You just know the Trio can basically talk about anything from life stories to exercise to no ramen. This help to reduce Jihyo to be more open as she is usually very reserved. This format won't force her to speak,but she will butt in when it is related to her. Also these help Sechan & Somin who are talkative.\n\nThere are pros & cons for the current concept. Safety is minimal priority nowadays & so the games/topic need to be harder.",
                            "author": null,
                            "id": "iteau8w",
                            "parent_id": "t1_ita9asx",
                            "score": 1,
                            "created_utc": 1666483537.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Not weird. I think for newer fans  it works for us . I've been a fab since 2014 is not the same. I still watch it and it's entertaining  but it's not gonna top the classics .",
                    "author": "Adespairfactor",
                    "id": "itao3ys",
                    "parent_id": "t1_ita6fcx",
                    "score": 6,
                    "created_utc": 1666413250.0,
                    "replies": [
                        {
                            "body": "Although I agree with you on the classic, episode 513, the cornstarch basketball match could easily easily be reminiscent of the earlier RM spirit. Man I almost died laughing so much.",
                            "author": "ducmanx04",
                            "id": "itawcx9",
                            "parent_id": "t1_itao3ys",
                            "score": 3,
                            "created_utc": 1666419163.0,
                            "replies": [
                                {
                                    "body": "I don't think I have watched  that one. I will now. \nIm not saying there s no good episodes now. Like the last episode that air was enjoyable. Was it old running man ? No . But the cast makes it fun and watchable",
                                    "author": "Adespairfactor",
                                    "id": "itc0heo",
                                    "parent_id": "t1_itawcx9",
                                    "score": 2,
                                    "created_utc": 1666448009.0,
                                    "replies": [
                                        {
                                            "body": "Let me know what you think after. Lol",
                                            "author": "ducmanx04",
                                            "id": "itedsnf",
                                            "parent_id": "t1_itc0heo",
                                            "score": 2,
                                            "created_utc": 1666484932.0,
                                            "replies": [
                                                {
                                                    "body": "OK I will.",
                                                    "author": "Adespairfactor",
                                                    "id": "itejxb2",
                                                    "parent_id": "t1_itedsnf",
                                                    "score": 1,
                                                    "created_utc": 1666487869.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "I watched it when it aired , i remember it deflty had a similiar vibe to the old one . it was funny regardless",
                                                    "author": "Adespairfactor",
                                                    "id": "itjs0hd",
                                                    "parent_id": "t1_itedsnf",
                                                    "score": 1,
                                                    "created_utc": 1666583703.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "have you watched the bells hide and seek races (i think from ep 6/7 to around ep 25)? absolutely thrilling with so many hilarious moments too",
                    "author": "justahalfling",
                    "id": "itb4dyn",
                    "parent_id": "t1_ita6fcx",
                    "score": 2,
                    "created_utc": 1666425688.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "7 members but different members..",
            "author": "Citara02",
            "id": "itas2s4",
            "parent_id": "t3_ya934o",
            "score": 2,
            "created_utc": 1666415956.0,
            "replies": [
                {
                    "body": "I agree for sure! But would you mind elaborating more on your comment?",
                    "author": "ducmanx04",
                    "id": "itatxv5",
                    "parent_id": "t1_itas2s4",
                    "score": 3,
                    "created_utc": 1666417315.0,
                    "replies": [
                        {
                            "body": "First era we got kwangsoo and gary while the second era we dont have gary and kwangsoo anymore, however we got sechan and somin...\n\nThese two eras have the same amount of members yet the have their own charms..",
                            "author": "Citara02",
                            "id": "itauoaw",
                            "parent_id": "t1_itatxv5",
                            "score": 5,
                            "created_utc": 1666417867.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I started watching RM back in 2017 when on one episode Super Junior were guests to promote their album. I watched that episode for SJ but after watching that I started watching the show on regular basis and became a fan.\n\nIt was then when I waited for newer episodes, i started watching episodes from yester years and then to the very beginning. That was the era man. From the 1st episode to the 2015 episodes the show is crazy funny, and the cast members look young, feel young. They were crazy funny back then.\nIt perfectly justified the image of urban action variety genre of the show. First episode has become a memory now. Whenever I want, i go to the first episode and watch it.\n\nThe first five years are really great. They are too much comic, the action variety content is great, role-play, slapstick comedy is fun to watch, and it carries the essence of Korea. And last to mention but importantly the guest line were terrific. I got so much familiar with the celebrities of Korea. The guest line was great too. \n\nRecent episodes are really bad in my opinion. I don't like them that much and don't even watch much now. Only sometimes.",
            "author": "neptuneclone",
            "id": "ita96wz",
            "parent_id": "t3_ya934o",
            "score": 8,
            "created_utc": 1666404794.0,
            "replies": [
                {
                    "body": "Lol i think how you stumbled onto RM and ultimately became a fan resembles alot of their fanbase out there. This show was so fun because the cast was so random but ultimately became a family no matter how much they betrayed each other. \n\nWhere the older episodes the golden age of RM? Absolutely. \n\nAre the current episodes not as good compared to the oldies? Thats up to each persons perspective. For me there are alot of recent episodes that left me mfing crying, asthma acting up, rewinding the scenes over and over.\n\nAnd you have to remember the cast is obviously much older and have gained some serious injuries over the past decade. So idk thats just my opinion lol 😆",
                    "author": "ducmanx04",
                    "id": "itary6s",
                    "parent_id": "t1_ita96wz",
                    "score": 9,
                    "created_utc": 1666415861.0,
                    "replies": [
                        {
                            "body": "I think I must be the only fan who stumbled into k-variety first \\*then\\* getting hooked into kpop through variety. my introduction to RM was when we had a rainy day and we couldn't have PE so my PE teacher showed us the super power baseball segment (think it may have been an 110-140 episode, somewhere there) in class and I was hooked for life. been a fan for a decade+ now, watched other kvariety shows, started listening to kpop, even learnt Korean because of this show lol (okay very unrelated tangent but I was suddenly reminded of this)",
                            "author": "justahalfling",
                            "id": "itb44ar",
                            "parent_id": "t1_itary6s",
                            "score": 3,
                            "created_utc": 1666425453.0,
                            "replies": [
                                {
                                    "body": "Same for me! My uni house mate showed me RM in 2014 and I started to watch it from the beginning to catch up. When I reached the episode with BigBang I started listening to their music and fell into the world of kpop as well!",
                                    "author": "xiaominger",
                                    "id": "itbb3a2",
                                    "parent_id": "t1_itb44ar",
                                    "score": 1,
                                    "created_utc": 1666431602.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Also I find it so interesting the korean entertainment scene from 2009-2019. I mean nobody could touch them in terms of hilarious and outrageous reality based variety shows and humor. \n\nEven though RM used alot of the formulas of Xman/family outting/Star Golden Bell/ Hello Baby/ Strong Heart etc. It was so refreshing and different for the Gen X audience. No wonder their shows are often imitated, never duplicate around the world.",
                    "author": "ducmanx04",
                    "id": "itaszja",
                    "parent_id": "t1_ita96wz",
                    "score": 2,
                    "created_utc": 1666416610.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I missed having Gary!",
            "author": "Yellow0en",
            "id": "itbjrtr",
            "parent_id": "t3_ya934o",
            "score": 3,
            "created_utc": 1666438676.0,
            "replies": []
        },
        {
            "body": "Miss Gary ! 💕💕",
            "author": "Mooon1234",
            "id": "itbrx1h",
            "parent_id": "t3_ya934o",
            "score": 2,
            "created_utc": 1666443690.0,
            "replies": []
        },
        {
            "body": "I miss Gary",
            "author": "steely1774",
            "id": "itbtc64",
            "parent_id": "t3_ya934o",
            "score": 2,
            "created_utc": 1666444448.0,
            "replies": []
        },
        {
            "body": "Song ji hyo is a vampire",
            "author": "goblinph",
            "id": "itcq5o1",
            "parent_id": "t3_ya934o",
            "score": 0,
            "created_utc": 1666459073.0,
            "replies": []
        },
        {
            "body": "I started watching back in 2012 and I truly miss the PD’s from back then. I understand they are older but it’s so chill now. The creativity and humor from back then can’t be touched. What I miss most of all is Kwang Soo. My two favorites are JiHyo and KwangSoo. It just feels empty when I watch without him. I’m happy for him though. RM will always hold a special place in my heart. 💛",
            "author": "ChunkiiBrewster",
            "id": "itbmeb0",
            "parent_id": "t3_ya934o",
            "score": 0,
            "created_utc": 1666440466.0,
            "replies": []
        },
        {
            "body": "#Bring back LKS",
            "author": "Aiirene",
            "id": "itbmfdm",
            "parent_id": "t3_ya934o",
            "score": -1,
            "created_utc": 1666440485.0,
            "replies": []
        },
        {
            "body": "IT WILL NEVER BE THE SAME WITHOUT LEE KWANG SOOO !!!\n\n#PETITION_TO_BRING_HIM_BACK PLEASE !!!",
            "author": "aygupt1822",
            "id": "itbr16a",
            "parent_id": "t3_ya934o",
            "score": -2,
            "created_utc": 1666443198.0,
            "replies": [
                {
                    "body": "does he even want to come back?",
                    "author": "botolsusu",
                    "id": "itbrivh",
                    "parent_id": "t1_itbr16a",
                    "score": 8,
                    "created_utc": 1666443477.0,
                    "replies": [
                        {
                            "body": "People are saying bring him back as if he was fired lol. He chose to leave he can choose when to come back",
                            "author": "creezle",
                            "id": "itby1zk",
                            "parent_id": "t1_itbrivh",
                            "score": 8,
                            "created_utc": 1666446837.0,
                            "replies": []
                        },
                        {
                            "body": "Im also thinking about it.He does a lot of variety shows now.Maybe he wants something new?",
                            "author": "Witty_Inspection_310",
                            "id": "ite886h",
                            "parent_id": "t1_itbrivh",
                            "score": 2,
                            "created_utc": 1666482307.0,
                            "replies": [
                                {
                                    "body": "We need to understand that he is an actor. I am sure he understand that whenever people see him on tv,people can't take him seriously because you had think whatever he did will be funny even if he is acting as a serious character.\n\nI mean you just look at him,you are sure to laugh even if he did nothing.\n\n\nLeaving RM will be his past image because i am sure he want his fans to see the new him as an actor being taken seriously.",
                                    "author": null,
                                    "id": "itebig8",
                                    "parent_id": "t1_ite886h",
                                    "score": 2,
                                    "created_utc": 1666483857.0,
                                    "replies": [
                                        {
                                            "body": "Fully understand that hes an actor,a good actor.But its just my way of thinking  that he does a lot variety shows(now with Na PD).Im thinking maybe he wants to be like CTH or LSG that are both good at entertainment and as an actor.",
                                            "author": "Witty_Inspection_310",
                                            "id": "itedota",
                                            "parent_id": "t1_itebig8",
                                            "score": 1,
                                            "created_utc": 1666484882.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Plus, I believe that injury he got from the car crash also made it harder for him to continue as well plus that was the same one that caused him to be gone for a couple of episodes.",
                                            "author": "OnAndOffBackAndForth",
                                            "id": "iuzsvm7",
                                            "parent_id": "t1_itebig8",
                                            "score": 1,
                                            "created_utc": 1667540776.0,
                                            "replies": [
                                                {
                                                    "body": "Agreed. Maybe partly of that car injury that he has to quit RM. I think he is playing it safe not to force himself considering RM took a toll on him.\n\nI think it was also a good decision by Kwangsoo.He can always come back later on kinda like Cha Tae Hyun/Yoo Hae Jin appearing on variety show,now hosting program although not a big one. \n\nIt a new challenge for him to prove that he is not just playing a funny guy,but can take on serious role however i think he still need to do better on his expression. I think it how we often visualised him as 'no matter what role he act,it still funny' even if his character is an evil murderer.\n\n\nI would definitely want to see him 10/15 years later in a variety show in a talk show(kinda like what Hyori bed & breakfast) except no guest. The cast would be YJS(hopefully he is still around)/Jongkook with Kwangsoo. Guest may occasionally be invited by them personally.",
                                                    "author": null,
                                                    "id": "iuzwak2",
                                                    "parent_id": "t1_iuzsvm7",
                                                    "score": 1,
                                                    "created_utc": 1667543508.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "i still remember my first ep, it's 63, because it has SNSD on it",
            "author": "soggyketchup",
            "id": "itbtj73",
            "parent_id": "t3_ya934o",
            "score": 1,
            "created_utc": 1666444550.0,
            "replies": []
        },
        {
            "body": "Omg, Start watching during my 1st year university 1st episode after Family Outing show. Now i am father with 3 kids.",
            "author": "mondaypc",
            "id": "itc0pnl",
            "parent_id": "t3_ya934o",
            "score": 1,
            "created_utc": 1666448118.0,
            "replies": []
        },
        {
            "body": "I started watching RM in 2014 and first episodes that i watched is SNSD (when tiffany still a member) episode 63-64 maybe?? And i get into it until today. Once paused after gary left and members day over and return at JSM and YSC join. Tbh RM changed so much as a show but their cast just get better and better. Even tho LKS left and left huge hole in RM (no sudden betrayal, no watchable punishment except YJS, YSC and JSM taking it) and recent episodes i realised since covid they rarely interact with public as they are before mid of 2020 and I missing it so much.\n\nHope RM with Hung In as 1st female PD leading RM, RM can get much better even when the cast isnt as young as the time before. So far I liked her interaction with RM members since RM member always try to bargain with her so much and seeing her also get tired togerther with member remind me of early RM crew.",
            "author": "shimafeiyan",
            "id": "itdkxna",
            "parent_id": "t3_ya934o",
            "score": 1,
            "created_utc": 1666471808.0,
            "replies": []
        },
        {
            "body": "The editing was too funny in 2011",
            "author": "KeyTechnician5438",
            "id": "j95viz9",
            "parent_id": "t3_ya934o",
            "score": 1,
            "created_utc": 1676816143.0,
            "replies": []
        },
        {
            "body": "agree",
            "author": "song_haru",
            "id": "itb27gx",
            "parent_id": "t1_itavjcu",
            "score": 3,
            "created_utc": 1666423856.0,
            "replies": []
        },
        {
            "body": "You... good with word! 👏👏👏🧟‍♂️",
            "author": "ducmanx04",
            "id": "itea67l",
            "parent_id": "t1_itavjcu",
            "score": 1,
            "created_utc": 1666483222.0,
            "replies": []
        },
        {
            "body": "I have been watching running man this year every day one episode and now i have reached ep 618 and i am a bit sad that i dont have that many episodes anymore but i found new good variety show called Knowing Bros its good funny but still didnt reach Runningman level \n\n\nAnyway i wanted to ask you is it different experience rewatching runningman from the beginning again ?\nI one rewatch shows that i think i will get whole different veiw of it in the second time and i think that will happen with RM but i dont plan to rewatch it now i think i will rewatch it after i finsh Knowing Bros and Infinite challenge",
            "author": "Preziine88",
            "id": "iu0abyk",
            "parent_id": "t1_it9vcn2",
            "score": 3,
            "created_utc": 1666888499.0,
            "replies": [
                {
                    "body": "Yeah I didnt plan on rewatching RM from the beginning as well but since you know how the cast turns out, I feel like I appreciate the cast more. Its really interesting how they acted before and their journey to becoming their current characters. Mad hilarious. Plus i found alot of things i missed watching it the first time esp since there is so much going on. You get reminded of things you totally didnt even noticed in the beginning. IDK thats my 2 cents. \n\nWhat other shows do you watch besides RM and Knowing Bros?",
                    "author": "ducmanx04",
                    "id": "iu0v1z1",
                    "parent_id": "t1_iu0abyk",
                    "score": 2,
                    "created_utc": 1666896477.0,
                    "replies": [
                        {
                            "body": "Cool then i will rewatch Rm after 2 years maybe it will be better if i forgot a lot of stuff and the early episodes are really exciting and there's a lot of stuff going on and i remember unfortunately i skipped some episodes just because of ratings in the first 200 episodes so i have new ones as well ;) \n\nRM and KB are the only varieties i have seen",
                            "author": "Preziine88",
                            "id": "iu2fwu7",
                            "parent_id": "t1_iu0v1z1",
                            "score": 1,
                            "created_utc": 1666920694.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Im was saying the same thing the other day but about cell phones. If you watch the crowd when they play games in public, you can see the trends shifting from the flip phones in 2010  to PDAs in 2011 and then the emergence of smart phones randomly.",
            "author": "ducmanx04",
            "id": "itebleu",
            "parent_id": "t1_ita8xxp",
            "score": 3,
            "created_utc": 1666483897.0,
            "replies": []
        },
        {
            "body": "he's 10 years older than jongkook isn't he? so 2011 sukjin is younger than 2022 jongkook? lol",
            "author": "botolsusu",
            "id": "itc2evo",
            "parent_id": "t1_itbx5n8",
            "score": 6,
            "created_utc": 1666448910.0,
            "replies": [
                {
                    "body": "There’s that. But I was comparing everyone with their younger selves, looks wise. Out of everyone, Suk Jin’s face seems the least changed. I guess aging from 40 to 50 isn’t as drastic as 30 to 40. Cuz everyone is now in their 40s except Suk Jin who is in his 50s.",
                    "author": "Juliofromny1977",
                    "id": "itc2s3l",
                    "parent_id": "t1_itc2evo",
                    "score": 6,
                    "created_utc": 1666449074.0,
                    "replies": [
                        {
                            "body": "JaeSuk is in his 50s too. \n\nAnd I agree about JSJ. Out of everyone, he has consistently looked good. Not just because he looks younger than his age, which he really does - but he actually is handsome and cares about how he looks. If only his stylist lets him off easy a few times 😂 I'm still not over the onesies with the cowboy hat look. \n\nKJK has changed the most, and he strangely looks much better now. 😁 Age becomes him. That Justin Bieber hairstyle also wasn't working for him. LKS is the other one who looks better, but I guess that is to be expected wasn't he like barely 25? \n\nAlso, Haha has so much swag so I always find him attractive. Before and now. Now more so.\n\nI kinda think they're all good looking, even YSC. He cleans up pretty well and he's manly so I find him attractive. JSM is a total goddess to me, like top 2 most beautiful Korean women (#1 is Kim Minji from Dreamcatcher https://i.imgur.com/5gO8EJQ_d.webp?maxwidth=640&shape=thumb&fidelity=medium ) \n\nEdit for link",
                            "author": null,
                            "id": "item5lh",
                            "parent_id": "t1_itc2s3l",
                            "score": 7,
                            "created_utc": 1666488972.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "For me personally, i think JSJ got so much funnier later on.",
            "author": "ducmanx04",
            "id": "itecizl",
            "parent_id": "t1_itbx5n8",
            "score": 2,
            "created_utc": 1666484338.0,
            "replies": [
                {
                    "body": "hmmm.. I find him usually annoying more often than not. When he is funny it's only accidentally or because he was set up perfectly by YJS, KJK or some other cast member. \n\nOR when he's the butt of the joke and it's at his expense. \n\n&#x200B;\n\nAnd I say annoying because he's just so fake. They're always talking about how fake he is. He doesn't do anything unless it's for his benefit. Like he isn't \"energetic\" or a\" team player\" until the cameras are on. \n\n&#x200B;\n\nEven in the early years, he always coveted being the main draw of the show but he just isn't. If elimination is the name of the game, he's usually the first one out. He's the most out of shape (which is why he targets women, b/c he thinks he'll have the edge), the laziest, the one that gripes the most, the one that tries to get the producers to edit him so he comes out in a good light, etc. \n\n&#x200B;\n\nEven when KJK invited YJS over to his YT channel and he was just a guest (at YJS behest) he still was trying to get as much camera time as possible (oh yeah and he stole/copied an idea that KJK and YJS said they wanted to do on YT in the future). \n\n&#x200B;\n\nI just get annoyed by his opportunistic, selfish, egotistical ways and it baffles me that YJS sees him as such a good friend. Maybe there's a reason for that off camera. But everything that I've seen on RM, YT, and How do you play just keeps cementing in my mind how self-centered and selfish he is and I wouldn't be  sad if he left the show or got replaced. But that's just me lol.",
                    "author": "Juliofromny1977",
                    "id": "itedzsi",
                    "parent_id": "t1_itecizl",
                    "score": -3,
                    "created_utc": 1666485026.0,
                    "replies": [
                        {
                            "body": "KJK and LKS also target women all the time as well. And they're very visibly stronger than the weakest member, so they don't even have to. I find that much more annoying than JSJ doing it. If you're weak, it makes sense to go after someone equally as weak or a little weaker. That's the only option that makes sense. But if you're KJK, you can pretty much have your pick out of 3-4 others, so why does he feel the need to target the easy members? \n\nAbout the rest of your issues with him, I think that is genuinely his variety character. Him joking about editing and screentime and closeup is for show, and we don't know the real person behind this character.",
                            "author": null,
                            "id": "itenp5u",
                            "parent_id": "t1_itedzsi",
                            "score": 6,
                            "created_utc": 1666489719.0,
                            "replies": [
                                {
                                    "body": "I hope so. It’s just that’s consistently him in every bit of media I’ve seen him in, not solely RM. Even KJK shows a different side of himself in My Little Old boy.\n\nAs for going after the weakest. They do not do it all the time. Yeah at times they will. It is a competition after all. My point is JSJ does it 10 out of 10 times. It’s predictable. He’s been doing it for 10 years straight. And when Jeon So Min joined the cast she’s been his number 1 target. \n\nSong Jihyo has bested SJS a few times. (I think even in a mud flats episode where you had to throw the other opponent to the ground), so he doesn’t go after her. But Jeon SoMin he goes for her with a Cheshire grin.",
                                    "author": "Juliofromny1977",
                                    "id": "iteojf5",
                                    "parent_id": "t1_itenp5u",
                                    "score": -1,
                                    "created_utc": 1666490133.0,
                                    "replies": [
                                        {
                                            "body": "I haven't seen him much outside of RM except a few episodes of idol picnic (lmao I swear I only watched for a favorite group) and his radio show and he seems like a very normal middle-aged man. From what I've seen of other members about him, they only have nice things to say too. So I won't judge. I'm fine with character on the show too. \n\nAlso, when I used the word \"all the time\" I didn't mean it literally every single time. But many times, it has happened that KJK or LKS go after women or JSJ when they really don't needed to. This means they got eliminated early and didn't get screentime during those games. Actually one reason I'm glad the nametag game isn't around anymore! I really didn't like how unfair it was because it was pretty much impossible to win against LKS, YJS and KJK. It just wasn't fun when you knew exactly who was going to last the shortest amount time and who was gonna probably win. \n\nI don't mind him going after JSM either. I appreciate their father daughter dynamic as it's wholesome and cute. He also avoids SJH probably because of her fanatic fans, as he has actually said so during the show! So that just leaves JSM, and I'm all for it seeing them go at it. It's usually very hilarious too.\n\nEdit: but he's my third favorite member, so I'm probably biased. I can almost never find fault with my ultimate trio of JSM-YJS-JSJ. 😁 (And LKS when he was around)",
                                            "author": null,
                                            "id": "itepn54",
                                            "parent_id": "t1_iteojf5",
                                            "score": 3,
                                            "created_utc": 1666490679.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Esp Jihyo. Seeeeesh. She not only gorgeous amd smart but funny af when she wants to be",
            "author": "ducmanx04",
            "id": "itebun5",
            "parent_id": "t1_itautay",
            "score": -1,
            "created_utc": 1666484020.0,
            "replies": []
        },
        {
            "body": "How dare you call Mr. Randomly capable that! I demand a duel! Lol jp hey, to each their own.",
            "author": "ducmanx04",
            "id": "itecxj0",
            "parent_id": "t1_itbidue",
            "score": 3,
            "created_utc": 1666484531.0,
            "replies": [
                {
                    "body": "I think they meant \"including\" not incel 😁",
                    "author": null,
                    "id": "itens6a",
                    "parent_id": "t1_itecxj0",
                    "score": 3,
                    "created_utc": 1666489760.0,
                    "replies": [
                        {
                            "body": "@Gbhari96 Lmaoooooooooo im dead 🤣😂💀☠️💀☠️. Im sorry, my bad.",
                            "author": "ducmanx04",
                            "id": "iteqsko",
                            "parent_id": "t1_itens6a",
                            "score": 1,
                            "created_utc": 1666491255.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "its including 🤣🤣 damn dude!!!",
                    "author": "gbhari96",
                    "id": "iuilh6v",
                    "parent_id": "t1_itecxj0",
                    "score": 2,
                    "created_utc": 1667234277.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bro, Gary was the mfing man. He was so weird, goofy, gullible, outgoing and confident self. He was never afraid to be himself whomever the celebrity guest was. I think thats why alot of the female guest loved him. His genuine reactions were the funniest.",
            "author": "ducmanx04",
            "id": "itatlxc",
            "parent_id": "t1_itapl14",
            "score": 18,
            "created_utc": 1666417066.0,
            "replies": [
                {
                    "body": "his early nicknames like peaceful gary, go-straight gary were so hilarious honestly",
                    "author": "justahalfling",
                    "id": "itb4a38",
                    "parent_id": "t1_itatlxc",
                    "score": 14,
                    "created_utc": 1666425592.0,
                    "replies": [
                        {
                            "body": "I always loved the STRESS era",
                            "author": "ducmanx04",
                            "id": "ited47w",
                            "parent_id": "t1_itb4a38",
                            "score": 7,
                            "created_utc": 1666484617.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He was my favorite member. And then when I moved on to LKS, eventually he left too :(",
            "author": "magablossom",
            "id": "iu27l77",
            "parent_id": "t1_itapl14",
            "score": 3,
            "created_utc": 1666916898.0,
            "replies": []
        },
        {
            "body": "For someone who didn't have any experience in variety shows, he was still hilarious and one of my favorite members of all time.",
            "author": "OnAndOffBackAndForth",
            "id": "iuzs74j",
            "parent_id": "t1_itapl14",
            "score": 2,
            "created_utc": 1667540267.0,
            "replies": []
        },
        {
            "body": "Nah its not. Like i said, im rewatching the old episodes again while waiting for the new episodes to be released. I find it funny that when i binge watch the old stuff and then switch to the new episodes, i always forget how much they aged. Lol",
            "author": "ducmanx04",
            "id": "ita737s",
            "parent_id": "t1_it9ve7f",
            "score": 9,
            "created_utc": 1666403754.0,
            "replies": []
        },
        {
            "body": "Hey to each their own man. One of the biggest reasons why im rewatching from the beginning is to catalog my favorite moments from each episodes. The small incidents, gossip and banter that was missed when i watched it the first time are freakin hilarious. Knowing how they turned out, their old selves are so funny. I find myself appreciate the cast even more. Esp. Kwangsoo. Lmaoo his evolution from the nervous quiet youngster to him starting to tease Jong Kook, and fighting back then eventually become how he is now is crazy funny. He had the balls to even do it back then 🤣😂🤣😂🤣😂",
            "author": "ducmanx04",
            "id": "ita817y",
            "parent_id": "t1_ita6fcx",
            "score": 14,
            "created_utc": 1666404207.0,
            "replies": [
                {
                    "body": "There used to be a tumblr who did something similar for the first 100 or so episodes so they'd have the tropes and ships and games and rewards. Might be down data to check out!",
                    "author": "Shephrah",
                    "id": "itamewq",
                    "parent_id": "t1_ita817y",
                    "score": 5,
                    "created_utc": 1666412152.0,
                    "replies": [
                        {
                            "body": "Lol yeah, tumblr is a great place for RM famboy/fangirl pics and gifs. Thanks for the heads up!",
                            "author": "ducmanx04",
                            "id": "itaurwu",
                            "parent_id": "t1_itamewq",
                            "score": 2,
                            "created_utc": 1666417943.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "In terms of physical games and missions, early RM was peak. You just couldn't top some of the missions they went through like the Han river boat or the other international episodes or the superpower ones. Although the style now gives a lot more room for top notch banter between the members.",
            "author": "ScorpiusDX",
            "id": "ita9asx",
            "parent_id": "t1_ita6fcx",
            "score": 8,
            "created_utc": 1666404848.0,
            "replies": [
                {
                    "body": "🤣😂🤣😂🤣😂 the freakin cardboard boats lmao. Imagine having to row across that bitch with makeshift materials, I would have died half way. \n\nMy absolute favorites moments where whenever they did water/mud games and matches. You also had to give it up to the earlier PDs and writers. They had some absolute genius plot twist and events lined up. KJK dunking Jea-Suks head over and over in the mud pit. Absolute gold.",
                    "author": "ducmanx04",
                    "id": "itavpxb",
                    "parent_id": "t1_ita9asx",
                    "score": 2,
                    "created_utc": 1666418676.0,
                    "replies": [
                        {
                            "body": "And then using Ji Suk Jin as a pencil.",
                            "author": "OnAndOffBackAndForth",
                            "id": "iuzslcz",
                            "parent_id": "t1_itavpxb",
                            "score": 1,
                            "created_utc": 1667540563.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That's the thing: I much prefer seeing them hangout and talk and be around each other than crazy hard activities that has them solely focused on the game/activity. I feel like the game show era meant they didn't focus on the relationship and bond of the cast, it only came out through actions. It might be because I'm generally a passive person, I'm a woman, I don't like sports at all and I'd rather watch any movie other than action or sports films. LoL \n\nI think the great thing about this show is how it has evolved and has gained new fans over the years and also managed to maintain its old fans.",
                    "author": null,
                    "id": "itbjfqi",
                    "parent_id": "t1_ita9asx",
                    "score": 3,
                    "created_utc": 1666438430.0,
                    "replies": []
                },
                {
                    "body": "Totally agreed especially since the production not just need to think of safety like the han river one/the one they went for the alligator at Australia but to think what kind of mission & adventure for the members.\n\nThinking back,some of the mission can be deemed dangerous especially the alligator one. Imagine something goes wrong,who going to answer towards the members family. My favourite mission was when they went to Hong Kong,the one with Miss A Fei(who can speak Mandarin?) so she is not allowed to speak & CNblue Yonghwa had a fan telling the taxi driver the instruction. \n\nThe newer style is what we like especially the trio(Sukjin-Jaesuk-Jongkook). You just know the Trio can basically talk about anything from life stories to exercise to no ramen. This help to reduce Jihyo to be more open as she is usually very reserved. This format won't force her to speak,but she will butt in when it is related to her. Also these help Sechan & Somin who are talkative.\n\nThere are pros & cons for the current concept. Safety is minimal priority nowadays & so the games/topic need to be harder.",
                    "author": null,
                    "id": "iteau8w",
                    "parent_id": "t1_ita9asx",
                    "score": 1,
                    "created_utc": 1666483537.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not weird. I think for newer fans  it works for us . I've been a fab since 2014 is not the same. I still watch it and it's entertaining  but it's not gonna top the classics .",
            "author": "Adespairfactor",
            "id": "itao3ys",
            "parent_id": "t1_ita6fcx",
            "score": 6,
            "created_utc": 1666413250.0,
            "replies": [
                {
                    "body": "Although I agree with you on the classic, episode 513, the cornstarch basketball match could easily easily be reminiscent of the earlier RM spirit. Man I almost died laughing so much.",
                    "author": "ducmanx04",
                    "id": "itawcx9",
                    "parent_id": "t1_itao3ys",
                    "score": 3,
                    "created_utc": 1666419163.0,
                    "replies": [
                        {
                            "body": "I don't think I have watched  that one. I will now. \nIm not saying there s no good episodes now. Like the last episode that air was enjoyable. Was it old running man ? No . But the cast makes it fun and watchable",
                            "author": "Adespairfactor",
                            "id": "itc0heo",
                            "parent_id": "t1_itawcx9",
                            "score": 2,
                            "created_utc": 1666448009.0,
                            "replies": [
                                {
                                    "body": "Let me know what you think after. Lol",
                                    "author": "ducmanx04",
                                    "id": "itedsnf",
                                    "parent_id": "t1_itc0heo",
                                    "score": 2,
                                    "created_utc": 1666484932.0,
                                    "replies": [
                                        {
                                            "body": "OK I will.",
                                            "author": "Adespairfactor",
                                            "id": "itejxb2",
                                            "parent_id": "t1_itedsnf",
                                            "score": 1,
                                            "created_utc": 1666487869.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I watched it when it aired , i remember it deflty had a similiar vibe to the old one . it was funny regardless",
                                            "author": "Adespairfactor",
                                            "id": "itjs0hd",
                                            "parent_id": "t1_itedsnf",
                                            "score": 1,
                                            "created_utc": 1666583703.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "have you watched the bells hide and seek races (i think from ep 6/7 to around ep 25)? absolutely thrilling with so many hilarious moments too",
            "author": "justahalfling",
            "id": "itb4dyn",
            "parent_id": "t1_ita6fcx",
            "score": 2,
            "created_utc": 1666425688.0,
            "replies": []
        },
        {
            "body": "I agree for sure! But would you mind elaborating more on your comment?",
            "author": "ducmanx04",
            "id": "itatxv5",
            "parent_id": "t1_itas2s4",
            "score": 3,
            "created_utc": 1666417315.0,
            "replies": [
                {
                    "body": "First era we got kwangsoo and gary while the second era we dont have gary and kwangsoo anymore, however we got sechan and somin...\n\nThese two eras have the same amount of members yet the have their own charms..",
                    "author": "Citara02",
                    "id": "itauoaw",
                    "parent_id": "t1_itatxv5",
                    "score": 5,
                    "created_utc": 1666417867.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol i think how you stumbled onto RM and ultimately became a fan resembles alot of their fanbase out there. This show was so fun because the cast was so random but ultimately became a family no matter how much they betrayed each other. \n\nWhere the older episodes the golden age of RM? Absolutely. \n\nAre the current episodes not as good compared to the oldies? Thats up to each persons perspective. For me there are alot of recent episodes that left me mfing crying, asthma acting up, rewinding the scenes over and over.\n\nAnd you have to remember the cast is obviously much older and have gained some serious injuries over the past decade. So idk thats just my opinion lol 😆",
            "author": "ducmanx04",
            "id": "itary6s",
            "parent_id": "t1_ita96wz",
            "score": 9,
            "created_utc": 1666415861.0,
            "replies": [
                {
                    "body": "I think I must be the only fan who stumbled into k-variety first \\*then\\* getting hooked into kpop through variety. my introduction to RM was when we had a rainy day and we couldn't have PE so my PE teacher showed us the super power baseball segment (think it may have been an 110-140 episode, somewhere there) in class and I was hooked for life. been a fan for a decade+ now, watched other kvariety shows, started listening to kpop, even learnt Korean because of this show lol (okay very unrelated tangent but I was suddenly reminded of this)",
                    "author": "justahalfling",
                    "id": "itb44ar",
                    "parent_id": "t1_itary6s",
                    "score": 3,
                    "created_utc": 1666425453.0,
                    "replies": [
                        {
                            "body": "Same for me! My uni house mate showed me RM in 2014 and I started to watch it from the beginning to catch up. When I reached the episode with BigBang I started listening to their music and fell into the world of kpop as well!",
                            "author": "xiaominger",
                            "id": "itbb3a2",
                            "parent_id": "t1_itb44ar",
                            "score": 1,
                            "created_utc": 1666431602.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Also I find it so interesting the korean entertainment scene from 2009-2019. I mean nobody could touch them in terms of hilarious and outrageous reality based variety shows and humor. \n\nEven though RM used alot of the formulas of Xman/family outting/Star Golden Bell/ Hello Baby/ Strong Heart etc. It was so refreshing and different for the Gen X audience. No wonder their shows are often imitated, never duplicate around the world.",
            "author": "ducmanx04",
            "id": "itaszja",
            "parent_id": "t1_ita96wz",
            "score": 2,
            "created_utc": 1666416610.0,
            "replies": []
        },
        {
            "body": "does he even want to come back?",
            "author": "botolsusu",
            "id": "itbrivh",
            "parent_id": "t1_itbr16a",
            "score": 8,
            "created_utc": 1666443477.0,
            "replies": [
                {
                    "body": "People are saying bring him back as if he was fired lol. He chose to leave he can choose when to come back",
                    "author": "creezle",
                    "id": "itby1zk",
                    "parent_id": "t1_itbrivh",
                    "score": 8,
                    "created_utc": 1666446837.0,
                    "replies": []
                },
                {
                    "body": "Im also thinking about it.He does a lot of variety shows now.Maybe he wants something new?",
                    "author": "Witty_Inspection_310",
                    "id": "ite886h",
                    "parent_id": "t1_itbrivh",
                    "score": 2,
                    "created_utc": 1666482307.0,
                    "replies": [
                        {
                            "body": "We need to understand that he is an actor. I am sure he understand that whenever people see him on tv,people can't take him seriously because you had think whatever he did will be funny even if he is acting as a serious character.\n\nI mean you just look at him,you are sure to laugh even if he did nothing.\n\n\nLeaving RM will be his past image because i am sure he want his fans to see the new him as an actor being taken seriously.",
                            "author": null,
                            "id": "itebig8",
                            "parent_id": "t1_ite886h",
                            "score": 2,
                            "created_utc": 1666483857.0,
                            "replies": [
                                {
                                    "body": "Fully understand that hes an actor,a good actor.But its just my way of thinking  that he does a lot variety shows(now with Na PD).Im thinking maybe he wants to be like CTH or LSG that are both good at entertainment and as an actor.",
                                    "author": "Witty_Inspection_310",
                                    "id": "itedota",
                                    "parent_id": "t1_itebig8",
                                    "score": 1,
                                    "created_utc": 1666484882.0,
                                    "replies": []
                                },
                                {
                                    "body": "Plus, I believe that injury he got from the car crash also made it harder for him to continue as well plus that was the same one that caused him to be gone for a couple of episodes.",
                                    "author": "OnAndOffBackAndForth",
                                    "id": "iuzsvm7",
                                    "parent_id": "t1_itebig8",
                                    "score": 1,
                                    "created_utc": 1667540776.0,
                                    "replies": [
                                        {
                                            "body": "Agreed. Maybe partly of that car injury that he has to quit RM. I think he is playing it safe not to force himself considering RM took a toll on him.\n\nI think it was also a good decision by Kwangsoo.He can always come back later on kinda like Cha Tae Hyun/Yoo Hae Jin appearing on variety show,now hosting program although not a big one. \n\nIt a new challenge for him to prove that he is not just playing a funny guy,but can take on serious role however i think he still need to do better on his expression. I think it how we often visualised him as 'no matter what role he act,it still funny' even if his character is an evil murderer.\n\n\nI would definitely want to see him 10/15 years later in a variety show in a talk show(kinda like what Hyori bed & breakfast) except no guest. The cast would be YJS(hopefully he is still around)/Jongkook with Kwangsoo. Guest may occasionally be invited by them personally.",
                                            "author": null,
                                            "id": "iuzwak2",
                                            "parent_id": "t1_iuzsvm7",
                                            "score": 1,
                                            "created_utc": 1667543508.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah I didnt plan on rewatching RM from the beginning as well but since you know how the cast turns out, I feel like I appreciate the cast more. Its really interesting how they acted before and their journey to becoming their current characters. Mad hilarious. Plus i found alot of things i missed watching it the first time esp since there is so much going on. You get reminded of things you totally didnt even noticed in the beginning. IDK thats my 2 cents. \n\nWhat other shows do you watch besides RM and Knowing Bros?",
            "author": "ducmanx04",
            "id": "iu0v1z1",
            "parent_id": "t1_iu0abyk",
            "score": 2,
            "created_utc": 1666896477.0,
            "replies": [
                {
                    "body": "Cool then i will rewatch Rm after 2 years maybe it will be better if i forgot a lot of stuff and the early episodes are really exciting and there's a lot of stuff going on and i remember unfortunately i skipped some episodes just because of ratings in the first 200 episodes so i have new ones as well ;) \n\nRM and KB are the only varieties i have seen",
                    "author": "Preziine88",
                    "id": "iu2fwu7",
                    "parent_id": "t1_iu0v1z1",
                    "score": 1,
                    "created_utc": 1666920694.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There’s that. But I was comparing everyone with their younger selves, looks wise. Out of everyone, Suk Jin’s face seems the least changed. I guess aging from 40 to 50 isn’t as drastic as 30 to 40. Cuz everyone is now in their 40s except Suk Jin who is in his 50s.",
            "author": "Juliofromny1977",
            "id": "itc2s3l",
            "parent_id": "t1_itc2evo",
            "score": 6,
            "created_utc": 1666449074.0,
            "replies": [
                {
                    "body": "JaeSuk is in his 50s too. \n\nAnd I agree about JSJ. Out of everyone, he has consistently looked good. Not just because he looks younger than his age, which he really does - but he actually is handsome and cares about how he looks. If only his stylist lets him off easy a few times 😂 I'm still not over the onesies with the cowboy hat look. \n\nKJK has changed the most, and he strangely looks much better now. 😁 Age becomes him. That Justin Bieber hairstyle also wasn't working for him. LKS is the other one who looks better, but I guess that is to be expected wasn't he like barely 25? \n\nAlso, Haha has so much swag so I always find him attractive. Before and now. Now more so.\n\nI kinda think they're all good looking, even YSC. He cleans up pretty well and he's manly so I find him attractive. JSM is a total goddess to me, like top 2 most beautiful Korean women (#1 is Kim Minji from Dreamcatcher https://i.imgur.com/5gO8EJQ_d.webp?maxwidth=640&shape=thumb&fidelity=medium ) \n\nEdit for link",
                    "author": null,
                    "id": "item5lh",
                    "parent_id": "t1_itc2s3l",
                    "score": 7,
                    "created_utc": 1666488972.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "hmmm.. I find him usually annoying more often than not. When he is funny it's only accidentally or because he was set up perfectly by YJS, KJK or some other cast member. \n\nOR when he's the butt of the joke and it's at his expense. \n\n&#x200B;\n\nAnd I say annoying because he's just so fake. They're always talking about how fake he is. He doesn't do anything unless it's for his benefit. Like he isn't \"energetic\" or a\" team player\" until the cameras are on. \n\n&#x200B;\n\nEven in the early years, he always coveted being the main draw of the show but he just isn't. If elimination is the name of the game, he's usually the first one out. He's the most out of shape (which is why he targets women, b/c he thinks he'll have the edge), the laziest, the one that gripes the most, the one that tries to get the producers to edit him so he comes out in a good light, etc. \n\n&#x200B;\n\nEven when KJK invited YJS over to his YT channel and he was just a guest (at YJS behest) he still was trying to get as much camera time as possible (oh yeah and he stole/copied an idea that KJK and YJS said they wanted to do on YT in the future). \n\n&#x200B;\n\nI just get annoyed by his opportunistic, selfish, egotistical ways and it baffles me that YJS sees him as such a good friend. Maybe there's a reason for that off camera. But everything that I've seen on RM, YT, and How do you play just keeps cementing in my mind how self-centered and selfish he is and I wouldn't be  sad if he left the show or got replaced. But that's just me lol.",
            "author": "Juliofromny1977",
            "id": "itedzsi",
            "parent_id": "t1_itecizl",
            "score": -3,
            "created_utc": 1666485026.0,
            "replies": [
                {
                    "body": "KJK and LKS also target women all the time as well. And they're very visibly stronger than the weakest member, so they don't even have to. I find that much more annoying than JSJ doing it. If you're weak, it makes sense to go after someone equally as weak or a little weaker. That's the only option that makes sense. But if you're KJK, you can pretty much have your pick out of 3-4 others, so why does he feel the need to target the easy members? \n\nAbout the rest of your issues with him, I think that is genuinely his variety character. Him joking about editing and screentime and closeup is for show, and we don't know the real person behind this character.",
                    "author": null,
                    "id": "itenp5u",
                    "parent_id": "t1_itedzsi",
                    "score": 6,
                    "created_utc": 1666489719.0,
                    "replies": [
                        {
                            "body": "I hope so. It’s just that’s consistently him in every bit of media I’ve seen him in, not solely RM. Even KJK shows a different side of himself in My Little Old boy.\n\nAs for going after the weakest. They do not do it all the time. Yeah at times they will. It is a competition after all. My point is JSJ does it 10 out of 10 times. It’s predictable. He’s been doing it for 10 years straight. And when Jeon So Min joined the cast she’s been his number 1 target. \n\nSong Jihyo has bested SJS a few times. (I think even in a mud flats episode where you had to throw the other opponent to the ground), so he doesn’t go after her. But Jeon SoMin he goes for her with a Cheshire grin.",
                            "author": "Juliofromny1977",
                            "id": "iteojf5",
                            "parent_id": "t1_itenp5u",
                            "score": -1,
                            "created_utc": 1666490133.0,
                            "replies": [
                                {
                                    "body": "I haven't seen him much outside of RM except a few episodes of idol picnic (lmao I swear I only watched for a favorite group) and his radio show and he seems like a very normal middle-aged man. From what I've seen of other members about him, they only have nice things to say too. So I won't judge. I'm fine with character on the show too. \n\nAlso, when I used the word \"all the time\" I didn't mean it literally every single time. But many times, it has happened that KJK or LKS go after women or JSJ when they really don't needed to. This means they got eliminated early and didn't get screentime during those games. Actually one reason I'm glad the nametag game isn't around anymore! I really didn't like how unfair it was because it was pretty much impossible to win against LKS, YJS and KJK. It just wasn't fun when you knew exactly who was going to last the shortest amount time and who was gonna probably win. \n\nI don't mind him going after JSM either. I appreciate their father daughter dynamic as it's wholesome and cute. He also avoids SJH probably because of her fanatic fans, as he has actually said so during the show! So that just leaves JSM, and I'm all for it seeing them go at it. It's usually very hilarious too.\n\nEdit: but he's my third favorite member, so I'm probably biased. I can almost never find fault with my ultimate trio of JSM-YJS-JSJ. 😁 (And LKS when he was around)",
                                    "author": null,
                                    "id": "itepn54",
                                    "parent_id": "t1_iteojf5",
                                    "score": 3,
                                    "created_utc": 1666490679.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think they meant \"including\" not incel 😁",
            "author": null,
            "id": "itens6a",
            "parent_id": "t1_itecxj0",
            "score": 3,
            "created_utc": 1666489760.0,
            "replies": [
                {
                    "body": "@Gbhari96 Lmaoooooooooo im dead 🤣😂💀☠️💀☠️. Im sorry, my bad.",
                    "author": "ducmanx04",
                    "id": "iteqsko",
                    "parent_id": "t1_itens6a",
                    "score": 1,
                    "created_utc": 1666491255.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "its including 🤣🤣 damn dude!!!",
            "author": "gbhari96",
            "id": "iuilh6v",
            "parent_id": "t1_itecxj0",
            "score": 2,
            "created_utc": 1667234277.0,
            "replies": []
        },
        {
            "body": "his early nicknames like peaceful gary, go-straight gary were so hilarious honestly",
            "author": "justahalfling",
            "id": "itb4a38",
            "parent_id": "t1_itatlxc",
            "score": 14,
            "created_utc": 1666425592.0,
            "replies": [
                {
                    "body": "I always loved the STRESS era",
                    "author": "ducmanx04",
                    "id": "ited47w",
                    "parent_id": "t1_itb4a38",
                    "score": 7,
                    "created_utc": 1666484617.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There used to be a tumblr who did something similar for the first 100 or so episodes so they'd have the tropes and ships and games and rewards. Might be down data to check out!",
            "author": "Shephrah",
            "id": "itamewq",
            "parent_id": "t1_ita817y",
            "score": 5,
            "created_utc": 1666412152.0,
            "replies": [
                {
                    "body": "Lol yeah, tumblr is a great place for RM famboy/fangirl pics and gifs. Thanks for the heads up!",
                    "author": "ducmanx04",
                    "id": "itaurwu",
                    "parent_id": "t1_itamewq",
                    "score": 2,
                    "created_utc": 1666417943.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🤣😂🤣😂🤣😂 the freakin cardboard boats lmao. Imagine having to row across that bitch with makeshift materials, I would have died half way. \n\nMy absolute favorites moments where whenever they did water/mud games and matches. You also had to give it up to the earlier PDs and writers. They had some absolute genius plot twist and events lined up. KJK dunking Jea-Suks head over and over in the mud pit. Absolute gold.",
            "author": "ducmanx04",
            "id": "itavpxb",
            "parent_id": "t1_ita9asx",
            "score": 2,
            "created_utc": 1666418676.0,
            "replies": [
                {
                    "body": "And then using Ji Suk Jin as a pencil.",
                    "author": "OnAndOffBackAndForth",
                    "id": "iuzslcz",
                    "parent_id": "t1_itavpxb",
                    "score": 1,
                    "created_utc": 1667540563.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's the thing: I much prefer seeing them hangout and talk and be around each other than crazy hard activities that has them solely focused on the game/activity. I feel like the game show era meant they didn't focus on the relationship and bond of the cast, it only came out through actions. It might be because I'm generally a passive person, I'm a woman, I don't like sports at all and I'd rather watch any movie other than action or sports films. LoL \n\nI think the great thing about this show is how it has evolved and has gained new fans over the years and also managed to maintain its old fans.",
            "author": null,
            "id": "itbjfqi",
            "parent_id": "t1_ita9asx",
            "score": 3,
            "created_utc": 1666438430.0,
            "replies": []
        },
        {
            "body": "Totally agreed especially since the production not just need to think of safety like the han river one/the one they went for the alligator at Australia but to think what kind of mission & adventure for the members.\n\nThinking back,some of the mission can be deemed dangerous especially the alligator one. Imagine something goes wrong,who going to answer towards the members family. My favourite mission was when they went to Hong Kong,the one with Miss A Fei(who can speak Mandarin?) so she is not allowed to speak & CNblue Yonghwa had a fan telling the taxi driver the instruction. \n\nThe newer style is what we like especially the trio(Sukjin-Jaesuk-Jongkook). You just know the Trio can basically talk about anything from life stories to exercise to no ramen. This help to reduce Jihyo to be more open as she is usually very reserved. This format won't force her to speak,but she will butt in when it is related to her. Also these help Sechan & Somin who are talkative.\n\nThere are pros & cons for the current concept. Safety is minimal priority nowadays & so the games/topic need to be harder.",
            "author": null,
            "id": "iteau8w",
            "parent_id": "t1_ita9asx",
            "score": 1,
            "created_utc": 1666483537.0,
            "replies": []
        },
        {
            "body": "Although I agree with you on the classic, episode 513, the cornstarch basketball match could easily easily be reminiscent of the earlier RM spirit. Man I almost died laughing so much.",
            "author": "ducmanx04",
            "id": "itawcx9",
            "parent_id": "t1_itao3ys",
            "score": 3,
            "created_utc": 1666419163.0,
            "replies": [
                {
                    "body": "I don't think I have watched  that one. I will now. \nIm not saying there s no good episodes now. Like the last episode that air was enjoyable. Was it old running man ? No . But the cast makes it fun and watchable",
                    "author": "Adespairfactor",
                    "id": "itc0heo",
                    "parent_id": "t1_itawcx9",
                    "score": 2,
                    "created_utc": 1666448009.0,
                    "replies": [
                        {
                            "body": "Let me know what you think after. Lol",
                            "author": "ducmanx04",
                            "id": "itedsnf",
                            "parent_id": "t1_itc0heo",
                            "score": 2,
                            "created_utc": 1666484932.0,
                            "replies": [
                                {
                                    "body": "OK I will.",
                                    "author": "Adespairfactor",
                                    "id": "itejxb2",
                                    "parent_id": "t1_itedsnf",
                                    "score": 1,
                                    "created_utc": 1666487869.0,
                                    "replies": []
                                },
                                {
                                    "body": "I watched it when it aired , i remember it deflty had a similiar vibe to the old one . it was funny regardless",
                                    "author": "Adespairfactor",
                                    "id": "itjs0hd",
                                    "parent_id": "t1_itedsnf",
                                    "score": 1,
                                    "created_utc": 1666583703.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "First era we got kwangsoo and gary while the second era we dont have gary and kwangsoo anymore, however we got sechan and somin...\n\nThese two eras have the same amount of members yet the have their own charms..",
            "author": "Citara02",
            "id": "itauoaw",
            "parent_id": "t1_itatxv5",
            "score": 5,
            "created_utc": 1666417867.0,
            "replies": []
        },
        {
            "body": "I think I must be the only fan who stumbled into k-variety first \\*then\\* getting hooked into kpop through variety. my introduction to RM was when we had a rainy day and we couldn't have PE so my PE teacher showed us the super power baseball segment (think it may have been an 110-140 episode, somewhere there) in class and I was hooked for life. been a fan for a decade+ now, watched other kvariety shows, started listening to kpop, even learnt Korean because of this show lol (okay very unrelated tangent but I was suddenly reminded of this)",
            "author": "justahalfling",
            "id": "itb44ar",
            "parent_id": "t1_itary6s",
            "score": 3,
            "created_utc": 1666425453.0,
            "replies": [
                {
                    "body": "Same for me! My uni house mate showed me RM in 2014 and I started to watch it from the beginning to catch up. When I reached the episode with BigBang I started listening to their music and fell into the world of kpop as well!",
                    "author": "xiaominger",
                    "id": "itbb3a2",
                    "parent_id": "t1_itb44ar",
                    "score": 1,
                    "created_utc": 1666431602.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "People are saying bring him back as if he was fired lol. He chose to leave he can choose when to come back",
            "author": "creezle",
            "id": "itby1zk",
            "parent_id": "t1_itbrivh",
            "score": 8,
            "created_utc": 1666446837.0,
            "replies": []
        },
        {
            "body": "Im also thinking about it.He does a lot of variety shows now.Maybe he wants something new?",
            "author": "Witty_Inspection_310",
            "id": "ite886h",
            "parent_id": "t1_itbrivh",
            "score": 2,
            "created_utc": 1666482307.0,
            "replies": [
                {
                    "body": "We need to understand that he is an actor. I am sure he understand that whenever people see him on tv,people can't take him seriously because you had think whatever he did will be funny even if he is acting as a serious character.\n\nI mean you just look at him,you are sure to laugh even if he did nothing.\n\n\nLeaving RM will be his past image because i am sure he want his fans to see the new him as an actor being taken seriously.",
                    "author": null,
                    "id": "itebig8",
                    "parent_id": "t1_ite886h",
                    "score": 2,
                    "created_utc": 1666483857.0,
                    "replies": [
                        {
                            "body": "Fully understand that hes an actor,a good actor.But its just my way of thinking  that he does a lot variety shows(now with Na PD).Im thinking maybe he wants to be like CTH or LSG that are both good at entertainment and as an actor.",
                            "author": "Witty_Inspection_310",
                            "id": "itedota",
                            "parent_id": "t1_itebig8",
                            "score": 1,
                            "created_utc": 1666484882.0,
                            "replies": []
                        },
                        {
                            "body": "Plus, I believe that injury he got from the car crash also made it harder for him to continue as well plus that was the same one that caused him to be gone for a couple of episodes.",
                            "author": "OnAndOffBackAndForth",
                            "id": "iuzsvm7",
                            "parent_id": "t1_itebig8",
                            "score": 1,
                            "created_utc": 1667540776.0,
                            "replies": [
                                {
                                    "body": "Agreed. Maybe partly of that car injury that he has to quit RM. I think he is playing it safe not to force himself considering RM took a toll on him.\n\nI think it was also a good decision by Kwangsoo.He can always come back later on kinda like Cha Tae Hyun/Yoo Hae Jin appearing on variety show,now hosting program although not a big one. \n\nIt a new challenge for him to prove that he is not just playing a funny guy,but can take on serious role however i think he still need to do better on his expression. I think it how we often visualised him as 'no matter what role he act,it still funny' even if his character is an evil murderer.\n\n\nI would definitely want to see him 10/15 years later in a variety show in a talk show(kinda like what Hyori bed & breakfast) except no guest. The cast would be YJS(hopefully he is still around)/Jongkook with Kwangsoo. Guest may occasionally be invited by them personally.",
                                    "author": null,
                                    "id": "iuzwak2",
                                    "parent_id": "t1_iuzsvm7",
                                    "score": 1,
                                    "created_utc": 1667543508.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Cool then i will rewatch Rm after 2 years maybe it will be better if i forgot a lot of stuff and the early episodes are really exciting and there's a lot of stuff going on and i remember unfortunately i skipped some episodes just because of ratings in the first 200 episodes so i have new ones as well ;) \n\nRM and KB are the only varieties i have seen",
            "author": "Preziine88",
            "id": "iu2fwu7",
            "parent_id": "t1_iu0v1z1",
            "score": 1,
            "created_utc": 1666920694.0,
            "replies": []
        },
        {
            "body": "JaeSuk is in his 50s too. \n\nAnd I agree about JSJ. Out of everyone, he has consistently looked good. Not just because he looks younger than his age, which he really does - but he actually is handsome and cares about how he looks. If only his stylist lets him off easy a few times 😂 I'm still not over the onesies with the cowboy hat look. \n\nKJK has changed the most, and he strangely looks much better now. 😁 Age becomes him. That Justin Bieber hairstyle also wasn't working for him. LKS is the other one who looks better, but I guess that is to be expected wasn't he like barely 25? \n\nAlso, Haha has so much swag so I always find him attractive. Before and now. Now more so.\n\nI kinda think they're all good looking, even YSC. He cleans up pretty well and he's manly so I find him attractive. JSM is a total goddess to me, like top 2 most beautiful Korean women (#1 is Kim Minji from Dreamcatcher https://i.imgur.com/5gO8EJQ_d.webp?maxwidth=640&shape=thumb&fidelity=medium ) \n\nEdit for link",
            "author": null,
            "id": "item5lh",
            "parent_id": "t1_itc2s3l",
            "score": 7,
            "created_utc": 1666488972.0,
            "replies": []
        },
        {
            "body": "KJK and LKS also target women all the time as well. And they're very visibly stronger than the weakest member, so they don't even have to. I find that much more annoying than JSJ doing it. If you're weak, it makes sense to go after someone equally as weak or a little weaker. That's the only option that makes sense. But if you're KJK, you can pretty much have your pick out of 3-4 others, so why does he feel the need to target the easy members? \n\nAbout the rest of your issues with him, I think that is genuinely his variety character. Him joking about editing and screentime and closeup is for show, and we don't know the real person behind this character.",
            "author": null,
            "id": "itenp5u",
            "parent_id": "t1_itedzsi",
            "score": 6,
            "created_utc": 1666489719.0,
            "replies": [
                {
                    "body": "I hope so. It’s just that’s consistently him in every bit of media I’ve seen him in, not solely RM. Even KJK shows a different side of himself in My Little Old boy.\n\nAs for going after the weakest. They do not do it all the time. Yeah at times they will. It is a competition after all. My point is JSJ does it 10 out of 10 times. It’s predictable. He’s been doing it for 10 years straight. And when Jeon So Min joined the cast she’s been his number 1 target. \n\nSong Jihyo has bested SJS a few times. (I think even in a mud flats episode where you had to throw the other opponent to the ground), so he doesn’t go after her. But Jeon SoMin he goes for her with a Cheshire grin.",
                    "author": "Juliofromny1977",
                    "id": "iteojf5",
                    "parent_id": "t1_itenp5u",
                    "score": -1,
                    "created_utc": 1666490133.0,
                    "replies": [
                        {
                            "body": "I haven't seen him much outside of RM except a few episodes of idol picnic (lmao I swear I only watched for a favorite group) and his radio show and he seems like a very normal middle-aged man. From what I've seen of other members about him, they only have nice things to say too. So I won't judge. I'm fine with character on the show too. \n\nAlso, when I used the word \"all the time\" I didn't mean it literally every single time. But many times, it has happened that KJK or LKS go after women or JSJ when they really don't needed to. This means they got eliminated early and didn't get screentime during those games. Actually one reason I'm glad the nametag game isn't around anymore! I really didn't like how unfair it was because it was pretty much impossible to win against LKS, YJS and KJK. It just wasn't fun when you knew exactly who was going to last the shortest amount time and who was gonna probably win. \n\nI don't mind him going after JSM either. I appreciate their father daughter dynamic as it's wholesome and cute. He also avoids SJH probably because of her fanatic fans, as he has actually said so during the show! So that just leaves JSM, and I'm all for it seeing them go at it. It's usually very hilarious too.\n\nEdit: but he's my third favorite member, so I'm probably biased. I can almost never find fault with my ultimate trio of JSM-YJS-JSJ. 😁 (And LKS when he was around)",
                            "author": null,
                            "id": "itepn54",
                            "parent_id": "t1_iteojf5",
                            "score": 3,
                            "created_utc": 1666490679.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "@Gbhari96 Lmaoooooooooo im dead 🤣😂💀☠️💀☠️. Im sorry, my bad.",
            "author": "ducmanx04",
            "id": "iteqsko",
            "parent_id": "t1_itens6a",
            "score": 1,
            "created_utc": 1666491255.0,
            "replies": []
        },
        {
            "body": "I always loved the STRESS era",
            "author": "ducmanx04",
            "id": "ited47w",
            "parent_id": "t1_itb4a38",
            "score": 7,
            "created_utc": 1666484617.0,
            "replies": []
        },
        {
            "body": "Lol yeah, tumblr is a great place for RM famboy/fangirl pics and gifs. Thanks for the heads up!",
            "author": "ducmanx04",
            "id": "itaurwu",
            "parent_id": "t1_itamewq",
            "score": 2,
            "created_utc": 1666417943.0,
            "replies": []
        },
        {
            "body": "And then using Ji Suk Jin as a pencil.",
            "author": "OnAndOffBackAndForth",
            "id": "iuzslcz",
            "parent_id": "t1_itavpxb",
            "score": 1,
            "created_utc": 1667540563.0,
            "replies": []
        },
        {
            "body": "I don't think I have watched  that one. I will now. \nIm not saying there s no good episodes now. Like the last episode that air was enjoyable. Was it old running man ? No . But the cast makes it fun and watchable",
            "author": "Adespairfactor",
            "id": "itc0heo",
            "parent_id": "t1_itawcx9",
            "score": 2,
            "created_utc": 1666448009.0,
            "replies": [
                {
                    "body": "Let me know what you think after. Lol",
                    "author": "ducmanx04",
                    "id": "itedsnf",
                    "parent_id": "t1_itc0heo",
                    "score": 2,
                    "created_utc": 1666484932.0,
                    "replies": [
                        {
                            "body": "OK I will.",
                            "author": "Adespairfactor",
                            "id": "itejxb2",
                            "parent_id": "t1_itedsnf",
                            "score": 1,
                            "created_utc": 1666487869.0,
                            "replies": []
                        },
                        {
                            "body": "I watched it when it aired , i remember it deflty had a similiar vibe to the old one . it was funny regardless",
                            "author": "Adespairfactor",
                            "id": "itjs0hd",
                            "parent_id": "t1_itedsnf",
                            "score": 1,
                            "created_utc": 1666583703.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Same for me! My uni house mate showed me RM in 2014 and I started to watch it from the beginning to catch up. When I reached the episode with BigBang I started listening to their music and fell into the world of kpop as well!",
            "author": "xiaominger",
            "id": "itbb3a2",
            "parent_id": "t1_itb44ar",
            "score": 1,
            "created_utc": 1666431602.0,
            "replies": []
        },
        {
            "body": "We need to understand that he is an actor. I am sure he understand that whenever people see him on tv,people can't take him seriously because you had think whatever he did will be funny even if he is acting as a serious character.\n\nI mean you just look at him,you are sure to laugh even if he did nothing.\n\n\nLeaving RM will be his past image because i am sure he want his fans to see the new him as an actor being taken seriously.",
            "author": null,
            "id": "itebig8",
            "parent_id": "t1_ite886h",
            "score": 2,
            "created_utc": 1666483857.0,
            "replies": [
                {
                    "body": "Fully understand that hes an actor,a good actor.But its just my way of thinking  that he does a lot variety shows(now with Na PD).Im thinking maybe he wants to be like CTH or LSG that are both good at entertainment and as an actor.",
                    "author": "Witty_Inspection_310",
                    "id": "itedota",
                    "parent_id": "t1_itebig8",
                    "score": 1,
                    "created_utc": 1666484882.0,
                    "replies": []
                },
                {
                    "body": "Plus, I believe that injury he got from the car crash also made it harder for him to continue as well plus that was the same one that caused him to be gone for a couple of episodes.",
                    "author": "OnAndOffBackAndForth",
                    "id": "iuzsvm7",
                    "parent_id": "t1_itebig8",
                    "score": 1,
                    "created_utc": 1667540776.0,
                    "replies": [
                        {
                            "body": "Agreed. Maybe partly of that car injury that he has to quit RM. I think he is playing it safe not to force himself considering RM took a toll on him.\n\nI think it was also a good decision by Kwangsoo.He can always come back later on kinda like Cha Tae Hyun/Yoo Hae Jin appearing on variety show,now hosting program although not a big one. \n\nIt a new challenge for him to prove that he is not just playing a funny guy,but can take on serious role however i think he still need to do better on his expression. I think it how we often visualised him as 'no matter what role he act,it still funny' even if his character is an evil murderer.\n\n\nI would definitely want to see him 10/15 years later in a variety show in a talk show(kinda like what Hyori bed & breakfast) except no guest. The cast would be YJS(hopefully he is still around)/Jongkook with Kwangsoo. Guest may occasionally be invited by them personally.",
                            "author": null,
                            "id": "iuzwak2",
                            "parent_id": "t1_iuzsvm7",
                            "score": 1,
                            "created_utc": 1667543508.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I hope so. It’s just that’s consistently him in every bit of media I’ve seen him in, not solely RM. Even KJK shows a different side of himself in My Little Old boy.\n\nAs for going after the weakest. They do not do it all the time. Yeah at times they will. It is a competition after all. My point is JSJ does it 10 out of 10 times. It’s predictable. He’s been doing it for 10 years straight. And when Jeon So Min joined the cast she’s been his number 1 target. \n\nSong Jihyo has bested SJS a few times. (I think even in a mud flats episode where you had to throw the other opponent to the ground), so he doesn’t go after her. But Jeon SoMin he goes for her with a Cheshire grin.",
            "author": "Juliofromny1977",
            "id": "iteojf5",
            "parent_id": "t1_itenp5u",
            "score": -1,
            "created_utc": 1666490133.0,
            "replies": [
                {
                    "body": "I haven't seen him much outside of RM except a few episodes of idol picnic (lmao I swear I only watched for a favorite group) and his radio show and he seems like a very normal middle-aged man. From what I've seen of other members about him, they only have nice things to say too. So I won't judge. I'm fine with character on the show too. \n\nAlso, when I used the word \"all the time\" I didn't mean it literally every single time. But many times, it has happened that KJK or LKS go after women or JSJ when they really don't needed to. This means they got eliminated early and didn't get screentime during those games. Actually one reason I'm glad the nametag game isn't around anymore! I really didn't like how unfair it was because it was pretty much impossible to win against LKS, YJS and KJK. It just wasn't fun when you knew exactly who was going to last the shortest amount time and who was gonna probably win. \n\nI don't mind him going after JSM either. I appreciate their father daughter dynamic as it's wholesome and cute. He also avoids SJH probably because of her fanatic fans, as he has actually said so during the show! So that just leaves JSM, and I'm all for it seeing them go at it. It's usually very hilarious too.\n\nEdit: but he's my third favorite member, so I'm probably biased. I can almost never find fault with my ultimate trio of JSM-YJS-JSJ. 😁 (And LKS when he was around)",
                    "author": null,
                    "id": "itepn54",
                    "parent_id": "t1_iteojf5",
                    "score": 3,
                    "created_utc": 1666490679.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Let me know what you think after. Lol",
            "author": "ducmanx04",
            "id": "itedsnf",
            "parent_id": "t1_itc0heo",
            "score": 2,
            "created_utc": 1666484932.0,
            "replies": [
                {
                    "body": "OK I will.",
                    "author": "Adespairfactor",
                    "id": "itejxb2",
                    "parent_id": "t1_itedsnf",
                    "score": 1,
                    "created_utc": 1666487869.0,
                    "replies": []
                },
                {
                    "body": "I watched it when it aired , i remember it deflty had a similiar vibe to the old one . it was funny regardless",
                    "author": "Adespairfactor",
                    "id": "itjs0hd",
                    "parent_id": "t1_itedsnf",
                    "score": 1,
                    "created_utc": 1666583703.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fully understand that hes an actor,a good actor.But its just my way of thinking  that he does a lot variety shows(now with Na PD).Im thinking maybe he wants to be like CTH or LSG that are both good at entertainment and as an actor.",
            "author": "Witty_Inspection_310",
            "id": "itedota",
            "parent_id": "t1_itebig8",
            "score": 1,
            "created_utc": 1666484882.0,
            "replies": []
        },
        {
            "body": "Plus, I believe that injury he got from the car crash also made it harder for him to continue as well plus that was the same one that caused him to be gone for a couple of episodes.",
            "author": "OnAndOffBackAndForth",
            "id": "iuzsvm7",
            "parent_id": "t1_itebig8",
            "score": 1,
            "created_utc": 1667540776.0,
            "replies": [
                {
                    "body": "Agreed. Maybe partly of that car injury that he has to quit RM. I think he is playing it safe not to force himself considering RM took a toll on him.\n\nI think it was also a good decision by Kwangsoo.He can always come back later on kinda like Cha Tae Hyun/Yoo Hae Jin appearing on variety show,now hosting program although not a big one. \n\nIt a new challenge for him to prove that he is not just playing a funny guy,but can take on serious role however i think he still need to do better on his expression. I think it how we often visualised him as 'no matter what role he act,it still funny' even if his character is an evil murderer.\n\n\nI would definitely want to see him 10/15 years later in a variety show in a talk show(kinda like what Hyori bed & breakfast) except no guest. The cast would be YJS(hopefully he is still around)/Jongkook with Kwangsoo. Guest may occasionally be invited by them personally.",
                    "author": null,
                    "id": "iuzwak2",
                    "parent_id": "t1_iuzsvm7",
                    "score": 1,
                    "created_utc": 1667543508.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I haven't seen him much outside of RM except a few episodes of idol picnic (lmao I swear I only watched for a favorite group) and his radio show and he seems like a very normal middle-aged man. From what I've seen of other members about him, they only have nice things to say too. So I won't judge. I'm fine with character on the show too. \n\nAlso, when I used the word \"all the time\" I didn't mean it literally every single time. But many times, it has happened that KJK or LKS go after women or JSJ when they really don't needed to. This means they got eliminated early and didn't get screentime during those games. Actually one reason I'm glad the nametag game isn't around anymore! I really didn't like how unfair it was because it was pretty much impossible to win against LKS, YJS and KJK. It just wasn't fun when you knew exactly who was going to last the shortest amount time and who was gonna probably win. \n\nI don't mind him going after JSM either. I appreciate their father daughter dynamic as it's wholesome and cute. He also avoids SJH probably because of her fanatic fans, as he has actually said so during the show! So that just leaves JSM, and I'm all for it seeing them go at it. It's usually very hilarious too.\n\nEdit: but he's my third favorite member, so I'm probably biased. I can almost never find fault with my ultimate trio of JSM-YJS-JSJ. 😁 (And LKS when he was around)",
            "author": null,
            "id": "itepn54",
            "parent_id": "t1_iteojf5",
            "score": 3,
            "created_utc": 1666490679.0,
            "replies": []
        },
        {
            "body": "OK I will.",
            "author": "Adespairfactor",
            "id": "itejxb2",
            "parent_id": "t1_itedsnf",
            "score": 1,
            "created_utc": 1666487869.0,
            "replies": []
        },
        {
            "body": "I watched it when it aired , i remember it deflty had a similiar vibe to the old one . it was funny regardless",
            "author": "Adespairfactor",
            "id": "itjs0hd",
            "parent_id": "t1_itedsnf",
            "score": 1,
            "created_utc": 1666583703.0,
            "replies": []
        },
        {
            "body": "Agreed. Maybe partly of that car injury that he has to quit RM. I think he is playing it safe not to force himself considering RM took a toll on him.\n\nI think it was also a good decision by Kwangsoo.He can always come back later on kinda like Cha Tae Hyun/Yoo Hae Jin appearing on variety show,now hosting program although not a big one. \n\nIt a new challenge for him to prove that he is not just playing a funny guy,but can take on serious role however i think he still need to do better on his expression. I think it how we often visualised him as 'no matter what role he act,it still funny' even if his character is an evil murderer.\n\n\nI would definitely want to see him 10/15 years later in a variety show in a talk show(kinda like what Hyori bed & breakfast) except no guest. The cast would be YJS(hopefully he is still around)/Jongkook with Kwangsoo. Guest may occasionally be invited by them personally.",
            "author": null,
            "id": "iuzwak2",
            "parent_id": "t1_iuzsvm7",
            "score": 1,
            "created_utc": 1667543508.0,
            "replies": []
        }
    ]
}