{
    "title": "SBs: SAFETY SAFETY SAFETY",
    "post_id": "k2q5cz",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/k2q5cz/sbs_safety_safety_safety/",
    "author": "ExExpectations",
    "body": "I've been in and out of this lifestyle for several years. I'm not extremely experienced but I'm definitely not new either. But this is a first for me (and the first time I really thought the scenario through).\n\nMost of us are aware that 1) we don't always know or get to know the man's identity the first time we have intimacy with him). 2) we can usually (not always) figure out his identity by the address he lives at if he asks us to come over\n\nThanks to one particular POT who's words raised the hairs on my arms, I am now made aware that some men rent Airbnb instead of a hotel for their trysts.\n\nThis is what I want to share with all the SBs and newbies: **please please do not go meet a guy at an Airbnb until you know who he is / until trust is established.** At a hotel, there are security cameras and footages, there are ID checks, there is frontdesk staff available and on-call. That is NOT the case at Airbnb and oftentimes Airbnb does not even have the IDs of their customers.\n\nI met him for M&G, and because of this and other reasons, I did not proceed to subsequent dates with him. If he doesn't share his identity, I'd at least want to feel safer at a hotel. An Airbnb is much less safe compared to a hotel.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/k2q5cz/sbs_safety_safety_safety/",
    "score": 138,
    "upvote_ratio": 0.95,
    "created_utc": 1606579554.0,
    "num_comments": 54,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "gdvygxt",
            "parent_id": "t3_k2q5cz",
            "score": 31,
            "created_utc": 1606580788.0,
            "replies": [
                {
                    "body": "Aside from insisting he wanted anonymity until we both gain trust (which is COMPLETELY normal and understandable), he also insisted on renting Airbnb for trysts because it's \"more homely\" and \"less stiff\" than a hotel. There weren't really any other yellow or red flags.   \n\n\nI just had a gut feeling that Airbnb isn't the best place. I've only rented Airbnb with family. The lack of security cameras/footage/ID checks and all that other safety measures didn't really register in my mind until I did a gut check.\n\n&#x200B;\n\nAnd you're 100% right, I mean, no place is safe if there are other things going on. I don't know if there were yellow flags here, but yes.\n\n[https://www.news4jax.com/news/local/2020/10/30/columbia-county-woman-found-dead-in-riviera-beach-hotel-room-suspect-in-custody/](https://www.news4jax.com/news/local/2020/10/30/columbia-county-woman-found-dead-in-riviera-beach-hotel-room-suspect-in-custody/)",
                    "author": "ExExpectations",
                    "id": "gdvzxxp",
                    "parent_id": "t1_gdvygxt",
                    "score": 10,
                    "created_utc": 1606581334.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can I just add that AirBnB also has shifty customer service? Another reason not to use one with a total stranger/POT until they’ve earned your trust.",
            "author": "curly_spice",
            "id": "gdvw3g0",
            "parent_id": "t3_k2q5cz",
            "score": 42,
            "created_utc": 1606579925.0,
            "replies": [
                {
                    "body": "Yea it's just all around eery to me. Why oppose renting a hotel?! Such a strange veto.",
                    "author": "ExExpectations",
                    "id": "gdw050a",
                    "parent_id": "t1_gdvw3g0",
                    "score": 20,
                    "created_utc": 1606581413.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, I personally don’t even go in private spaces (hotel, car, home, etc.) until I have someone’s full name confirmed and I’ve sent it to my safe person. \n\nI’d presume searching the address beforehand should help someone determine if it’s their home or an airBNB.\n\nEscorts generally require to see a John’s ID so if a guy doesn’t trust you enough yet, then go on a few more public dates. His ‘reputation’ is not more valuable than your safety and you should want an SD who encourages SBs to take precautions.",
            "author": "LVSugarBebe",
            "id": "gdya1wn",
            "parent_id": "t3_k2q5cz",
            "score": 14,
            "created_utc": 1606609889.0,
            "replies": [
                {
                    "body": ">until I have someone’s full name confirmed and I’ve sent it to my safe person. \n\nAs an SD, I've been called a creep countless times for doing just that, sharing my dates info with a safe friend.\n\nI hate this double standard because I think any safety measure that's good for an SB is algo good for and SD.",
                    "author": "AdAlternative6041",
                    "id": "gdyhj0s",
                    "parent_id": "t1_gdya1wn",
                    "score": 5,
                    "created_utc": 1606612592.0,
                    "replies": [
                        {
                            "body": "I certainly understand both sides because there are some men who get blackmailed, but I’ve never personally heard of any getting physically assaulted. \n\nPlease consider why this would make many women uncomfortable to do early on. There is already a substantial power differential to begin with and as a woman, that can be a very vulnerable position to be in. A man has more strength, resources, and connections to do us harm and get away with it. So having his info but him not having all of hers gives some women a sense of an ‘even playing field’.\n\nIt’s not that you’re a bad guy, but there are a lot of bad men out there who want to hurt us or stalk us. Many of the women on SA have been in abusive relationships where giving our their info too early made them really vulnerable. Many also have minor children at home and protecting them is non-negotiable.\n\nIf I may ask, what information do you request and how early in the arrangement are you generally requesting it?",
                            "author": "LVSugarBebe",
                            "id": "ge1nohl",
                            "parent_id": "t1_gdyhj0s",
                            "score": 6,
                            "created_utc": 1606664855.0,
                            "replies": [
                                {
                                    "body": ">but I’ve never personally heard of any getting physically assaulted\n\nThe bigger risk is being robbed or even kidnapped after being slipped drugs into drinks. You should watch the movie \"Hustlers\", they explain this type of crime.\n\n>Please consider consider why this would make many women uncomfortable to do early on. \n\nOk but I think my safety is more important than other person feeling uncomfortable. Isn't that the same thing most women advocate for? Our personal safety  trumps other people's feelings.\n\n>what information do you request and how early in the arrangement are you generally requesting it?\n\nI don't request much as most young women have big online presence and don't really care about opsec.\n\nLately, i don't even tell them I share their picture and phone number with a safe friend.",
                                    "author": "AdAlternative6041",
                                    "id": "ge1oum2",
                                    "parent_id": "t1_ge1nohl",
                                    "score": 2,
                                    "created_utc": 1606665257.0,
                                    "replies": [
                                        {
                                            "body": "Yes, thank you for pointing it out. That is certainly a possible risk, though I presume the statistical likelihood of the monetary loss is far lower than that of the physical risks for a woman of being assaulted. But again, just giving perspective. I’d presume that as a woman gets to know more about you, she will feel safer sharing. If she doesn’t feel safe yet or accuses you of a double standard, it’s possible you haven’t built up enough trust yet.\n\nWhen you say ‘not much’, can you elaborate? As in you send the name and number and picture she provided or you require to see her ID?\nI also assume you inform your safe person of your location and share your phone tracker just in case?",
                                            "author": "LVSugarBebe",
                                            "id": "ge1r7hn",
                                            "parent_id": "t1_ge1oum2",
                                            "score": 2,
                                            "created_utc": 1606666089.0,
                                            "replies": [
                                                {
                                                    "body": ">I presume the statistical likelihood of the monetary loss is far lower than that of the physical risks for a woman of being assaulted.\n\nI don't understand how is that relevant at all, i know  the risk is higher for women but how does that affect the very real risks I also face?\n\n>If she doesn’t feel safe yet or accuses you of a double standard, it’s possible you haven’t built up enough trust yet.\n\nHonestly, I haven't met yet a single woman in either vanilla or sugar dating that think it's ok for a guy to share her info with a safe friend.\n\nApparently, their feelings ARE more important than a guy's safety /s\n\n>or you require to see her ID?\n\nNot really, most times i get more than enough info from social media. For example, you'll be surprised at how many young women use the same handle for SA and their personal IG.\n\n>I also assume you inform your safe person of your location and share your phone tracker just in case?\n\nYup.",
                                                    "author": "AdAlternative6041",
                                                    "id": "ge1ssz1",
                                                    "parent_id": "t1_ge1r7hn",
                                                    "score": 1,
                                                    "created_utc": 1606666664.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "> more strength, resources, and connections to do us harm \n\nThis turns me on. It's why I get into this lifestyle, honestly. It's such a thrill seeing the intimate side of a formidable CEO. It's like getting to pet the lion's mane.\n\nBut yeah, sometimes you can get bitten :(",
                                    "author": "77hr0waway",
                                    "id": "hym36z3",
                                    "parent_id": "t1_ge1nohl",
                                    "score": 2,
                                    "created_utc": 1645942044.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Fully agreed.\n\nWhile one needs a certain level of trust to meet someone in a hotel, that level of trust is much higher when meeting in much less safe/regulated places, like AirBNB/VRBO rentals. \n\nI would consider those riskier than going to one's house... since when going to one's house, you have an idea of who they are.\n\nGoing to an AirBNB with a stranger is as risky as it gets.",
            "author": "GDarn",
            "id": "gdwh54q",
            "parent_id": "t3_k2q5cz",
            "score": 11,
            "created_utc": 1606587675.0,
            "replies": []
        },
        {
            "body": "I'll agree with this. Same points from the SD side really. Not sure why all the controversy about this advice.",
            "author": "wraithfive",
            "id": "gdyuh16",
            "parent_id": "t3_k2q5cz",
            "score": 4,
            "created_utc": 1606617852.0,
            "replies": [
                {
                    "body": "Right?!! Hotels are just a much wiser and safer choice all around. \nBut 99% of the time SD/SM is the one booking a place.\n\nAnd in this case, I got eery feelings after he told me that’s what he does and that’s where we’d go, instead of to a hotel.",
                    "author": "ExExpectations",
                    "id": "gdyzmta",
                    "parent_id": "t1_gdyuh16",
                    "score": 3,
                    "created_utc": 1606620446.0,
                    "replies": [
                        {
                            "body": "This is why I wish Love Hotels were a thing outside of Asia. My experience is only with Japanese ones, but they are awesome. Safe areas, lots of security cameras and staff onsite, rooms that are well appointed for just about any eventuality, and no need to ever share your identity with the hotel staff directly. They even generally control the elevators and things to such an extent that the likelihood of you meeting another patron in a hallway is almost 0%.",
                            "author": "wraithfive",
                            "id": "gdz0tdx",
                            "parent_id": "t1_gdyzmta",
                            "score": 2,
                            "created_utc": 1606621011.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oof, thank you for posting this. I just realized I made this mistake as a newbie. I'm lucky it was a good experience, but you're right. Hotels are much safer than an Airbnb.",
            "author": "byeoljali",
            "id": "ge1swc9",
            "parent_id": "t3_k2q5cz",
            "score": 2,
            "created_utc": 1606666701.0,
            "replies": []
        },
        {
            "body": "Air bnb do have the ID of the person renting.  But nothing is safe on that first meeting.  Bad things happen in hotels, too.  Never let your guard down on a first meet - make sure it's in public first and trust your instincts if there's anything amiss.\n\nI won't reveal my real name on a first date.  In fact, it might be the third before I do... Because there are plenty of SBs who are not entirely kosher and many SDs are married, have careers that would be destroyed by such activity etc etc.  \n\nThat said, I've never had a bad regular arrangement with an SB.  There are serious dangers that need to be avoided before it's time to share your personal details.  SBs are often far too naive - giving out their mobile number that are linked to their facebook and instagram.  \n\nRemember every new SD could be a psychopath and every new SB could be a blackmailer.  And then go in with all the optimism you can muster and hope that you're both lovely people.",
            "author": "anonymoustruth_99",
            "id": "gdw8397",
            "parent_id": "t3_k2q5cz",
            "score": 1,
            "created_utc": 1606584398.0,
            "replies": [
                {
                    "body": "Untrue. I signed up for Airbnb and it did not need ID verifying. Just an email or social media account - both of which are not govt IDs - and I can make bookings.\n\nPsychopaths are A LOT MORE dangerous than blackmail. As stated in another comment just today by a guy - blackmail is illegal and the “worst” is the wife or gf finding out. \n\nI do not wish to engage in this “debate” about which is worse - it’s been done a million times over - and it’s obvious which is physically more severe.",
                    "author": "ExExpectations",
                    "id": "gdwa0vx",
                    "parent_id": "t1_gdw8397",
                    "score": 13,
                    "created_utc": 1606585141.0,
                    "replies": [
                        {
                            "body": "I had to give my passport when I signed up to air bnb, so that was my experience.  But... \n\nIt really isn't a pissing contest as to which side poses the most risks.  Neither side wants the negative experience (however bad), so let's just say that both sides need to stay safe, ok?",
                            "author": "anonymoustruth_99",
                            "id": "gdwb0e9",
                            "parent_id": "t1_gdwa0vx",
                            "score": -1,
                            "created_utc": 1606585540.0,
                            "replies": [
                                {
                                    "body": "🙄🙄🙄\n\nOkay whatever Bob. Psychopath vs blackmail and you think they’re equal in severity. \n\nAnd no. Maybe Airbnb has changed their ID requirements for newer signups. It’s a company that started here, and a lot of locals have older grandfathered accounts that did not need ID verification in the earlier days. \n\nhttps://www.quora.com/How-does-Airbnb-verify-an-ID/answer/Kristen-Hall-8?ch=10&share=1f14da59&srid=QY0C0",
                                    "author": "ExExpectations",
                                    "id": "gdwcblz",
                                    "parent_id": "t1_gdwb0e9",
                                    "score": 8,
                                    "created_utc": 1606586025.0,
                                    "replies": [
                                        {
                                            "body": "Ok, you're being deliberately provocative - and stupid. Don't tell me I said that blackmail and psychopaths are equal, because I didn't.  That was your misinterpretation..  You sound like you have a serious chip on your shoulder and need to vent.\n\nMy response was to stay safe WHATEVER the venue and not let your guard down.  But you seem to want to make it into a male vs female argument.",
                                            "author": "anonymoustruth_99",
                                            "id": "gdwdpnr",
                                            "parent_id": "t1_gdwcblz",
                                            "score": -1,
                                            "created_utc": 1606586522.0,
                                            "replies": [
                                                {
                                                    "body": "I AM THE OP.",
                                                    "author": "ExExpectations",
                                                    "id": "gdwdtvu",
                                                    "parent_id": "t1_gdwdpnr",
                                                    "score": 2,
                                                    "created_utc": 1606586560.0,
                                                    "replies": [
                                                        {
                                                            "body": "yes, I just noticed that.  Seems you didn't get the gist that I was sympathetic to your question and suggested that whatever the venue, your safety is important.",
                                                            "author": "anonymoustruth_99",
                                                            "id": "gdwe6z6",
                                                            "parent_id": "t1_gdwdtvu",
                                                            "score": 5,
                                                            "created_utc": 1606586679.0,
                                                            "replies": [
                                                                {
                                                                    "body": "First you argue that Airbnb has ID on file. \n\nThen you ignored the fact that hotels have security cameras and staff whereas Airbnb does not. \n\nThen you go and say welllllll Ms., actually the guy have to protect themselves as well blah blah blah. NOWHERE did I say I must know his identity the first time we have intimacy. Or third. Or tenth. \n\nI am POINTING IT OUT TO SBs - that Airbnb is not a safe choice for SBs *when* they don’t know the guys identity yet. There is nothing wrong with going to a hotel and she should insist on that compared to going to an Airbnb.",
                                                                    "author": "ExExpectations",
                                                                    "id": "gdwhrid",
                                                                    "parent_id": "t1_gdwe6z6",
                                                                    "score": 11,
                                                                    "created_utc": 1606587875.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "And - I have no questions. I did not post a **question.**\n\nI posted a SAFETY precaution that SBs should look out for.\n\nIt’s not something I personally thought through previously, and certainly some other SBs have not either.",
                                                                    "author": "ExExpectations",
                                                                    "id": "gdwia29",
                                                                    "parent_id": "t1_gdwe6z6",
                                                                    "score": 8,
                                                                    "created_utc": 1606588043.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Mods. \n\nu/LaSirene23 u/azurecole \n\nI believe this constitutes as name calling.",
                                                    "author": "ExExpectations",
                                                    "id": "gdwiisu",
                                                    "parent_id": "t1_gdwdpnr",
                                                    "score": 0,
                                                    "created_utc": 1606588121.0,
                                                    "replies": [
                                                        {
                                                            "body": "Mod here.  \n\nI don’t see where a name was called. But it seems like the discussion has gotten personal so I’ll just recommend that you both take a step back and remember we’re all human beings. \n\nGo eat some leftover turkey or something. 🙂",
                                                            "author": null,
                                                            "id": "gdwmue0",
                                                            "parent_id": "t1_gdwiisu",
                                                            "score": 5,
                                                            "created_utc": 1606589531.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "gdwlmc1",
                                                            "parent_id": "t1_gdwiisu",
                                                            "score": -2,
                                                            "created_utc": 1606589129.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Name calling on here is not allowed. That’s my understanding.",
                                                                    "author": "ExExpectations",
                                                                    "id": "gdwlrpl",
                                                                    "parent_id": "t1_gdwlmc1",
                                                                    "score": 1,
                                                                    "created_utc": 1606589176.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I'll lock this particular subthread -- it's a little buried but I did see the name.  u/anonymoustruth_99, you'll need to respond without the namecalling.  The rest of the thread got a little heated but it looks like \"mutual combat\"",
                                                                            "author": "Azurecole",
                                                                            "id": "gdwnzdt",
                                                                            "parent_id": "t1_gdwlrpl",
                                                                            "score": 3,
                                                                            "created_utc": 1606589913.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Actually, there was no name calling.\n\nThe spirit of my original post was totally misinterpreted by the OP who seemed to over react and fly off on a tangent.  \n\nThe original post was well intentioned and was encouraging all parties to take their first steps cautiously.",
                                                                                    "author": "anonymoustruth_99",
                                                                                    "id": "gdws1aq",
                                                                                    "parent_id": "t1_gdwnzdt",
                                                                                    "score": -1,
                                                                                    "created_utc": 1606591540.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I think it was \"you're being...stupid\".   I do agree this could be just missed communication.",
                                                                                            "author": "Azurecole",
                                                                                            "id": "gdwswvm",
                                                                                            "parent_id": "t1_gdws1aq",
                                                                                            "score": 5,
                                                                                            "created_utc": 1606591846.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Precisely that part.",
                                                                                                    "author": "ExExpectations",
                                                                                                    "id": "gdwtn4t",
                                                                                                    "parent_id": "t1_gdwswvm",
                                                                                                    "score": 0,
                                                                                                    "created_utc": 1606592094.0,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "body": "Yes, I figured it was that.  But \"you're being stupid\" is not the same as \"you are stupid\".  And even then we're misquoting what I actually said.",
                                                                                                    "author": "anonymoustruth_99",
                                                                                                    "id": "gdwuvat",
                                                                                                    "parent_id": "t1_gdwswvm",
                                                                                                    "score": -1,
                                                                                                    "created_utc": 1606592489.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "Saying someone is being stupid is not the same as calling them stupid 😉\n\nIn addition put your big girl pants on and just report a post you don’t agree with rather call the mods to your rescue",
                                                                            "author": null,
                                                                            "id": "gdxuo31",
                                                                            "parent_id": "t1_gdwlrpl",
                                                                            "score": -4,
                                                                            "created_utc": 1606604502.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "You seem to be totally obsessed with what I am writing or saying on the internet. \n\nI’m so flattered. \n\n🙄🙄",
                                                                                    "author": "ExExpectations",
                                                                                    "id": "gdxvpb4",
                                                                                    "parent_id": "t1_gdxuo31",
                                                                                    "score": 0,
                                                                                    "created_utc": 1606604862.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gdwvcs4",
                                            "parent_id": "t1_gdwcblz",
                                            "score": -8,
                                            "created_utc": 1606592650.0,
                                            "replies": [
                                                {
                                                    "body": "What the hell is wrong with you? Are you really that short sighted and unaware? Blackmail could lead to you being raped or murdered or mutilated in unimaginable ways? Have you really thought this through? If you're an SD I really wonder what any woman is even doing being with you!",
                                                    "author": "blackmagickwoe_man",
                                                    "id": "gdz787p",
                                                    "parent_id": "t1_gdwvcs4",
                                                    "score": 4,
                                                    "created_utc": 1606624710.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "They have my Government ID, I don't recall being able to book prior to all the verification I did. Maybe it's changed, but to say \"UNTRUE\" just isn't the case. \n\nThat said, I DO agree that an AirBnb off the bat isn't a great idea. But after a meet or two they are much more enjoyable for both.",
                            "author": "mraspencer",
                            "id": "gdwu7wu",
                            "parent_id": "t1_gdwa0vx",
                            "score": 0,
                            "created_utc": 1606592277.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Interesting, I've never signed up for Airbnb, and I'm not even sure I've ever been in one.  But ironically, I was thinking about shifting to Airbnb for my next SB for two reasons:\n\n1. Everyone says how much more homey and less escorty than a hotel can feel.  I've seen many SBs here remark about that.\n2. Hotels regularly show up as one of the most high-risk places you can go, covid-wise.  Right behind indoor bars & restaurants, family gatherings, the airport during a holiday -- hotels are the very next, very high risk thing mentioned.  I've been navigating this by picking hotels with lots of vacancies, low-contact check-in methods, spend no time in the common areas.\n\nThat said, if it really is as you say, that Airbnb doesn't really even have the identity of the renter, it's certainly the riskiest of all.  I'm just surprised the don't have a \"know your customer\" requirement for themselves.",
            "author": "Azurecole",
            "id": "gdwoqo4",
            "parent_id": "t3_k2q5cz",
            "score": -1,
            "created_utc": 1606590159.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gdyf9qa",
                    "parent_id": "t1_gdwoqo4",
                    "score": 4,
                    "created_utc": 1606611766.0,
                    "replies": [
                        {
                            "body": "I am theoretically with you ... the sugar dates I've had, there's usually no one in the lobby, very little contact with the front desk, the rooms are (presumably) sanitized.  I'd guess very little risk, especially since I wear an n95 mask inside.  But if you google \"places with highest coronavirus risk\", hotels always show up in the top 4 or 5.  \n\nHere's one story  [https://www.washingtonpost.com/health/2020/11/10/coronavirus-restaurants-gyms-hotels-risk/](https://www.washingtonpost.com/health/2020/11/10/coronavirus-restaurants-gyms-hotels-risk/)   But there's a zillion more hits, so if you don't like that news source or that particular study, find another, there's plenty of other studies and news sources.\n\nThat said, it doesn't seem like the study in that story, or even most studies, can definitively say \"these people caught covid in the hotel\".   Maybe it's because people who are at a hotel are more likely to go to a restaurant or bar, or be socializing with their co-travelers, and that's where they got it?  But hotel always does float up to the top, foro whatever reason",
                            "author": "Azurecole",
                            "id": "gdykwn0",
                            "parent_id": "t1_gdyf9qa",
                            "score": 1,
                            "created_utc": 1606613948.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I'm a frequent Airbnb customer though admittedly never for this. In the general case Airbnb absolutely has your identity. From this thread, it sounds like there may be loopholes, but if you're not actively trying to hide from them, you can expect them to know who you are.\n\nYou're right that it's homier and more pandemic-safe than a hotel. It'll be just you, no staff, no guests, no common areas. \n\nMy thought is it could be a great option, and you should just think through how you can make the situation safer & more trustworthy for her. Have her arrive first with her own transportation, text her a photo of your drivers license that proves you are who you say you are, etc. And once you do have trust with her, I think Airbnbs won't be problematic at all.",
                    "author": "bizownersd",
                    "id": "gdwzx4z",
                    "parent_id": "t1_gdwoqo4",
                    "score": -1,
                    "created_utc": 1606594155.0,
                    "replies": [
                        {
                            "body": "Or, maybe, NOT use it the first few times with someone new?!! Until you’ve actually established and gained trust??",
                            "author": "ExExpectations",
                            "id": "gdxlvig",
                            "parent_id": "t1_gdwzx4z",
                            "score": 5,
                            "created_utc": 1606601562.0,
                            "replies": []
                        },
                        {
                            "body": ">but if you're not actively trying to hide from them, you can expect them to know who you are.\n\nThis is what I expected.  In fact I'd go further and say, if Airbnb doesn't even know who its customers are, I think any home/apartment/etc owner would be insane to put their place up for rent.   They have no idea who their customer is, and those people are going into my home???\n\nu/ExExpectations said she signed up for Airbnb with no ID or anything else needed.  Could there be an extra verification step if you actually try to use the service to book a place?  I mean, I signed up for  Coinbase with nothing but a fake email and password.  It wasn't until I tried to do a transaction that I needed to send in all manner of ID.  Same with cashapp, more verification as I tried to do more things on the app.  Layered ID requirements make sense -- make it super easy for the customer to sign up for the app, get them invested, and don't drop the verification requirements on them until they get excited to use the service",
                            "author": "Azurecole",
                            "id": "gdx13pb",
                            "parent_id": "t1_gdwzx4z",
                            "score": 2,
                            "created_utc": 1606594564.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gdxxkmt",
                                    "parent_id": "t1_gdx13pb",
                                    "score": 6,
                                    "created_utc": 1606605520.0,
                                    "replies": [
                                        {
                                            "body": "Yes. I cannot upvote this enough times!!!!!!!! \n\nI connected my PayPal to my Airbnb account. PayPal *also* grandfathered in many accounts and it doesn’t have my full identity/ID or anything connected to it.\n\nPayments can also be made using prepaid credit cards.",
                                            "author": "ExExpectations",
                                            "id": "gdyvoiv",
                                            "parent_id": "t1_gdxxkmt",
                                            "score": 4,
                                            "created_utc": 1606618496.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "It's been years since I signed up so I don't remember the sequence. As of now, though, they have my driver's license. My understanding is when I request to book, they represent to the host that I'm legit, and upon confirmed booking, they give my info to the host.\n\nIn the service of looking attractive to potential hosts, I've also connected my Facebook account and selected a couple photos, written a short bio, and added an emergency contact. And the account page is making it clear they'd really love to have my passport too. ;)\n\nThat being said, everything after the driver's license was probably optional, and not being a psychopath myself, I haven't tried to fool them. No idea if you could get away with a fake ID or something.",
                                    "author": "bizownersd",
                                    "id": "gdx2hrh",
                                    "parent_id": "t1_gdx13pb",
                                    "score": 0,
                                    "created_utc": 1606595043.0,
                                    "replies": [
                                        {
                                            "body": "So I wonder, u/ExExpectations ... have you tried to book a place yet?  Because having the driver's license is what I expected at minimum!  I'm guessing they'll hit you with this requirement as you go through your first booking process.  Not perfect, of course",
                                            "author": "Azurecole",
                                            "id": "gdx53c4",
                                            "parent_id": "t1_gdx2hrh",
                                            "score": 1,
                                            "created_utc": 1606595909.0,
                                            "replies": [
                                                {
                                                    "body": "I’ve not traveled using Airbnb myself in a long time. I did not upload any IDs to my profile and have booked years prior. \n\nThe point of my post was, compared to a hotel: there is NO security cameras in place, NO staff on call, literally no one around except the two people. At a hotel, there are usually other customers too. \n\nAll those are much more important to the SB compared to the ID issue yet somehow y’all get stuck on that part. \n\nLastly, I’ve dealt with Airbnb CS before -\nas another commenter said - not the most awesome CS experiences. It’s also a private entity (IN A PRIVATE HOME) compared to many hotel chains where more visibility are present.\n\nIf a guy insists he always and would rather use Airbnb rather than hotel (even as the first / few times), it’s NOT OKAY. \n\nMy post is to warn other SBs to watch out for this as a red flag.  I was feeling uneasy. But couldn’t pinpoint exactly why. I wouldn’t have thought as thoroughly had it not for another redditor who questioned it as well.",
                                                    "author": "ExExpectations",
                                                    "id": "gdx9io1",
                                                    "parent_id": "t1_gdx53c4",
                                                    "score": 8,
                                                    "created_utc": 1606597397.0,
                                                    "replies": [
                                                        {
                                                            "body": "Frankly, I don't know why an SD would ever argue with whatever his brand new SB is most comfortable with.  With the exception of thinking through the covid sitch, it'd be a no brainer for me to do just pick whichever an SB preferred.\n\nIt's a good point about no staff on call,  no cameras, etc.  But for SBs who go to their SD's house -- which is obviously not the recommended way for the first few meetings -- it's the same situation.  To the extent there's any saving grace about the house, it's that since you know where his house is, you can figure out his identity.  That's what we're debating for Airbnb also... can you figure out his identity?  This isn't an arguing with your initial point, but now we want to figure out the answer.",
                                                            "author": "Azurecole",
                                                            "id": "gdxaeqk",
                                                            "parent_id": "t1_gdx9io1",
                                                            "score": 2,
                                                            "created_utc": 1606597692.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Residential and property records and taxes etc are public info. Reverse address reveals who lives there / who gets mail there / who owns the place.\n\nI’m pretty sure Airbnb will not release the identity of the person who rented the place to anyone except LE. \n\nCompletely not the same comparison. Still risky but def not on the same level of risk.",
                                                                    "author": "ExExpectations",
                                                                    "id": "gdxkfzo",
                                                                    "parent_id": "t1_gdxaeqk",
                                                                    "score": 6,
                                                                    "created_utc": 1606601093.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "I should clarify, he insists that he rents Airbnb for trysts. He didn’t ask for my preferences. He just said - that’s what I do and that’s where we’d go. \n\nI didn’t say I’d rather a hotel. \n\nBecause after he said that - at that point I already paused and decided not to move ahead with him - regardless of hotel or not. \n\nMaking that kind of comments without discussion (coupled with the fact that he insists I would never know his real last name because he’s “had stalkers” in the past) shows a huge lack of thought for me and my safety.",
                                                                    "author": "ExExpectations",
                                                                    "id": "gdxlf4c",
                                                                    "parent_id": "t1_gdxaeqk",
                                                                    "score": 5,
                                                                    "created_utc": 1606601410.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Airbnb is fine once you've established a relationship. Do hotel at first.",
                    "author": "Old-Perspective-7521",
                    "id": "ge29ggn",
                    "parent_id": "t1_gdwoqo4",
                    "score": 1,
                    "created_utc": 1606674245.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wouldn't someone renting an Airbnb have to leave some trace of their real identity through the signup/rental process? I definitely wouldn't Airbnb my place unless I was positive I knew something about the person staying there.",
            "author": "flo_flourish",
            "id": "gdyuna1",
            "parent_id": "t3_k2q5cz",
            "score": 0,
            "created_utc": 1606617946.0,
            "replies": [
                {
                    "body": "Even so, how likely do you think that the **SB** would have access for that info ahead of time, or ever?? \n\nThere’s no camera footage. No on one staff. \n\nAirbnb is NOT a safe choice as a first/few dates meeting place compared to a hotel.",
                    "author": "ExExpectations",
                    "id": "gdyz3kx",
                    "parent_id": "t1_gdyuna1",
                    "score": 6,
                    "created_utc": 1606620189.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I still say the bottom line if you are going to be paranoid you probably shouldn't be trying to be an SB in the first place.",
            "author": "Old-Perspective-7521",
            "id": "ge29lvj",
            "parent_id": "t3_k2q5cz",
            "score": 0,
            "created_utc": 1606674318.0,
            "replies": [
                {
                    "body": "“Trying to be an SB”??  My various sugar experiences says otherwise. But I digress. \n\nYou are probably speaking in general, not about me specifically. And no, this isn’t paranoia. Being cautious and taking safety seriously IS NOT paranoia. \n\n🙄🙄🙄",
                    "author": "ExExpectations",
                    "id": "ge2a95p",
                    "parent_id": "t1_ge29lvj",
                    "score": 3,
                    "created_utc": 1606674626.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Aside from insisting he wanted anonymity until we both gain trust (which is COMPLETELY normal and understandable), he also insisted on renting Airbnb for trysts because it's \"more homely\" and \"less stiff\" than a hotel. There weren't really any other yellow or red flags.   \n\n\nI just had a gut feeling that Airbnb isn't the best place. I've only rented Airbnb with family. The lack of security cameras/footage/ID checks and all that other safety measures didn't really register in my mind until I did a gut check.\n\n&#x200B;\n\nAnd you're 100% right, I mean, no place is safe if there are other things going on. I don't know if there were yellow flags here, but yes.\n\n[https://www.news4jax.com/news/local/2020/10/30/columbia-county-woman-found-dead-in-riviera-beach-hotel-room-suspect-in-custody/](https://www.news4jax.com/news/local/2020/10/30/columbia-county-woman-found-dead-in-riviera-beach-hotel-room-suspect-in-custody/)",
            "author": "ExExpectations",
            "id": "gdvzxxp",
            "parent_id": "t1_gdvygxt",
            "score": 10,
            "created_utc": 1606581334.0,
            "replies": []
        },
        {
            "body": "Yea it's just all around eery to me. Why oppose renting a hotel?! Such a strange veto.",
            "author": "ExExpectations",
            "id": "gdw050a",
            "parent_id": "t1_gdvw3g0",
            "score": 20,
            "created_utc": 1606581413.0,
            "replies": []
        },
        {
            "body": ">until I have someone’s full name confirmed and I’ve sent it to my safe person. \n\nAs an SD, I've been called a creep countless times for doing just that, sharing my dates info with a safe friend.\n\nI hate this double standard because I think any safety measure that's good for an SB is algo good for and SD.",
            "author": "AdAlternative6041",
            "id": "gdyhj0s",
            "parent_id": "t1_gdya1wn",
            "score": 5,
            "created_utc": 1606612592.0,
            "replies": [
                {
                    "body": "I certainly understand both sides because there are some men who get blackmailed, but I’ve never personally heard of any getting physically assaulted. \n\nPlease consider why this would make many women uncomfortable to do early on. There is already a substantial power differential to begin with and as a woman, that can be a very vulnerable position to be in. A man has more strength, resources, and connections to do us harm and get away with it. So having his info but him not having all of hers gives some women a sense of an ‘even playing field’.\n\nIt’s not that you’re a bad guy, but there are a lot of bad men out there who want to hurt us or stalk us. Many of the women on SA have been in abusive relationships where giving our their info too early made them really vulnerable. Many also have minor children at home and protecting them is non-negotiable.\n\nIf I may ask, what information do you request and how early in the arrangement are you generally requesting it?",
                    "author": "LVSugarBebe",
                    "id": "ge1nohl",
                    "parent_id": "t1_gdyhj0s",
                    "score": 6,
                    "created_utc": 1606664855.0,
                    "replies": [
                        {
                            "body": ">but I’ve never personally heard of any getting physically assaulted\n\nThe bigger risk is being robbed or even kidnapped after being slipped drugs into drinks. You should watch the movie \"Hustlers\", they explain this type of crime.\n\n>Please consider consider why this would make many women uncomfortable to do early on. \n\nOk but I think my safety is more important than other person feeling uncomfortable. Isn't that the same thing most women advocate for? Our personal safety  trumps other people's feelings.\n\n>what information do you request and how early in the arrangement are you generally requesting it?\n\nI don't request much as most young women have big online presence and don't really care about opsec.\n\nLately, i don't even tell them I share their picture and phone number with a safe friend.",
                            "author": "AdAlternative6041",
                            "id": "ge1oum2",
                            "parent_id": "t1_ge1nohl",
                            "score": 2,
                            "created_utc": 1606665257.0,
                            "replies": [
                                {
                                    "body": "Yes, thank you for pointing it out. That is certainly a possible risk, though I presume the statistical likelihood of the monetary loss is far lower than that of the physical risks for a woman of being assaulted. But again, just giving perspective. I’d presume that as a woman gets to know more about you, she will feel safer sharing. If she doesn’t feel safe yet or accuses you of a double standard, it’s possible you haven’t built up enough trust yet.\n\nWhen you say ‘not much’, can you elaborate? As in you send the name and number and picture she provided or you require to see her ID?\nI also assume you inform your safe person of your location and share your phone tracker just in case?",
                                    "author": "LVSugarBebe",
                                    "id": "ge1r7hn",
                                    "parent_id": "t1_ge1oum2",
                                    "score": 2,
                                    "created_utc": 1606666089.0,
                                    "replies": [
                                        {
                                            "body": ">I presume the statistical likelihood of the monetary loss is far lower than that of the physical risks for a woman of being assaulted.\n\nI don't understand how is that relevant at all, i know  the risk is higher for women but how does that affect the very real risks I also face?\n\n>If she doesn’t feel safe yet or accuses you of a double standard, it’s possible you haven’t built up enough trust yet.\n\nHonestly, I haven't met yet a single woman in either vanilla or sugar dating that think it's ok for a guy to share her info with a safe friend.\n\nApparently, their feelings ARE more important than a guy's safety /s\n\n>or you require to see her ID?\n\nNot really, most times i get more than enough info from social media. For example, you'll be surprised at how many young women use the same handle for SA and their personal IG.\n\n>I also assume you inform your safe person of your location and share your phone tracker just in case?\n\nYup.",
                                            "author": "AdAlternative6041",
                                            "id": "ge1ssz1",
                                            "parent_id": "t1_ge1r7hn",
                                            "score": 1,
                                            "created_utc": 1606666664.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "> more strength, resources, and connections to do us harm \n\nThis turns me on. It's why I get into this lifestyle, honestly. It's such a thrill seeing the intimate side of a formidable CEO. It's like getting to pet the lion's mane.\n\nBut yeah, sometimes you can get bitten :(",
                            "author": "77hr0waway",
                            "id": "hym36z3",
                            "parent_id": "t1_ge1nohl",
                            "score": 2,
                            "created_utc": 1645942044.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Right?!! Hotels are just a much wiser and safer choice all around. \nBut 99% of the time SD/SM is the one booking a place.\n\nAnd in this case, I got eery feelings after he told me that’s what he does and that’s where we’d go, instead of to a hotel.",
            "author": "ExExpectations",
            "id": "gdyzmta",
            "parent_id": "t1_gdyuh16",
            "score": 3,
            "created_utc": 1606620446.0,
            "replies": [
                {
                    "body": "This is why I wish Love Hotels were a thing outside of Asia. My experience is only with Japanese ones, but they are awesome. Safe areas, lots of security cameras and staff onsite, rooms that are well appointed for just about any eventuality, and no need to ever share your identity with the hotel staff directly. They even generally control the elevators and things to such an extent that the likelihood of you meeting another patron in a hallway is almost 0%.",
                    "author": "wraithfive",
                    "id": "gdz0tdx",
                    "parent_id": "t1_gdyzmta",
                    "score": 2,
                    "created_utc": 1606621011.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Untrue. I signed up for Airbnb and it did not need ID verifying. Just an email or social media account - both of which are not govt IDs - and I can make bookings.\n\nPsychopaths are A LOT MORE dangerous than blackmail. As stated in another comment just today by a guy - blackmail is illegal and the “worst” is the wife or gf finding out. \n\nI do not wish to engage in this “debate” about which is worse - it’s been done a million times over - and it’s obvious which is physically more severe.",
            "author": "ExExpectations",
            "id": "gdwa0vx",
            "parent_id": "t1_gdw8397",
            "score": 13,
            "created_utc": 1606585141.0,
            "replies": [
                {
                    "body": "I had to give my passport when I signed up to air bnb, so that was my experience.  But... \n\nIt really isn't a pissing contest as to which side poses the most risks.  Neither side wants the negative experience (however bad), so let's just say that both sides need to stay safe, ok?",
                    "author": "anonymoustruth_99",
                    "id": "gdwb0e9",
                    "parent_id": "t1_gdwa0vx",
                    "score": -1,
                    "created_utc": 1606585540.0,
                    "replies": [
                        {
                            "body": "🙄🙄🙄\n\nOkay whatever Bob. Psychopath vs blackmail and you think they’re equal in severity. \n\nAnd no. Maybe Airbnb has changed their ID requirements for newer signups. It’s a company that started here, and a lot of locals have older grandfathered accounts that did not need ID verification in the earlier days. \n\nhttps://www.quora.com/How-does-Airbnb-verify-an-ID/answer/Kristen-Hall-8?ch=10&share=1f14da59&srid=QY0C0",
                            "author": "ExExpectations",
                            "id": "gdwcblz",
                            "parent_id": "t1_gdwb0e9",
                            "score": 8,
                            "created_utc": 1606586025.0,
                            "replies": [
                                {
                                    "body": "Ok, you're being deliberately provocative - and stupid. Don't tell me I said that blackmail and psychopaths are equal, because I didn't.  That was your misinterpretation..  You sound like you have a serious chip on your shoulder and need to vent.\n\nMy response was to stay safe WHATEVER the venue and not let your guard down.  But you seem to want to make it into a male vs female argument.",
                                    "author": "anonymoustruth_99",
                                    "id": "gdwdpnr",
                                    "parent_id": "t1_gdwcblz",
                                    "score": -1,
                                    "created_utc": 1606586522.0,
                                    "replies": [
                                        {
                                            "body": "I AM THE OP.",
                                            "author": "ExExpectations",
                                            "id": "gdwdtvu",
                                            "parent_id": "t1_gdwdpnr",
                                            "score": 2,
                                            "created_utc": 1606586560.0,
                                            "replies": [
                                                {
                                                    "body": "yes, I just noticed that.  Seems you didn't get the gist that I was sympathetic to your question and suggested that whatever the venue, your safety is important.",
                                                    "author": "anonymoustruth_99",
                                                    "id": "gdwe6z6",
                                                    "parent_id": "t1_gdwdtvu",
                                                    "score": 5,
                                                    "created_utc": 1606586679.0,
                                                    "replies": [
                                                        {
                                                            "body": "First you argue that Airbnb has ID on file. \n\nThen you ignored the fact that hotels have security cameras and staff whereas Airbnb does not. \n\nThen you go and say welllllll Ms., actually the guy have to protect themselves as well blah blah blah. NOWHERE did I say I must know his identity the first time we have intimacy. Or third. Or tenth. \n\nI am POINTING IT OUT TO SBs - that Airbnb is not a safe choice for SBs *when* they don’t know the guys identity yet. There is nothing wrong with going to a hotel and she should insist on that compared to going to an Airbnb.",
                                                            "author": "ExExpectations",
                                                            "id": "gdwhrid",
                                                            "parent_id": "t1_gdwe6z6",
                                                            "score": 11,
                                                            "created_utc": 1606587875.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "And - I have no questions. I did not post a **question.**\n\nI posted a SAFETY precaution that SBs should look out for.\n\nIt’s not something I personally thought through previously, and certainly some other SBs have not either.",
                                                            "author": "ExExpectations",
                                                            "id": "gdwia29",
                                                            "parent_id": "t1_gdwe6z6",
                                                            "score": 8,
                                                            "created_utc": 1606588043.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Mods. \n\nu/LaSirene23 u/azurecole \n\nI believe this constitutes as name calling.",
                                            "author": "ExExpectations",
                                            "id": "gdwiisu",
                                            "parent_id": "t1_gdwdpnr",
                                            "score": 0,
                                            "created_utc": 1606588121.0,
                                            "replies": [
                                                {
                                                    "body": "Mod here.  \n\nI don’t see where a name was called. But it seems like the discussion has gotten personal so I’ll just recommend that you both take a step back and remember we’re all human beings. \n\nGo eat some leftover turkey or something. 🙂",
                                                    "author": null,
                                                    "id": "gdwmue0",
                                                    "parent_id": "t1_gdwiisu",
                                                    "score": 5,
                                                    "created_utc": 1606589531.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gdwlmc1",
                                                    "parent_id": "t1_gdwiisu",
                                                    "score": -2,
                                                    "created_utc": 1606589129.0,
                                                    "replies": [
                                                        {
                                                            "body": "Name calling on here is not allowed. That’s my understanding.",
                                                            "author": "ExExpectations",
                                                            "id": "gdwlrpl",
                                                            "parent_id": "t1_gdwlmc1",
                                                            "score": 1,
                                                            "created_utc": 1606589176.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I'll lock this particular subthread -- it's a little buried but I did see the name.  u/anonymoustruth_99, you'll need to respond without the namecalling.  The rest of the thread got a little heated but it looks like \"mutual combat\"",
                                                                    "author": "Azurecole",
                                                                    "id": "gdwnzdt",
                                                                    "parent_id": "t1_gdwlrpl",
                                                                    "score": 3,
                                                                    "created_utc": 1606589913.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Actually, there was no name calling.\n\nThe spirit of my original post was totally misinterpreted by the OP who seemed to over react and fly off on a tangent.  \n\nThe original post was well intentioned and was encouraging all parties to take their first steps cautiously.",
                                                                            "author": "anonymoustruth_99",
                                                                            "id": "gdws1aq",
                                                                            "parent_id": "t1_gdwnzdt",
                                                                            "score": -1,
                                                                            "created_utc": 1606591540.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I think it was \"you're being...stupid\".   I do agree this could be just missed communication.",
                                                                                    "author": "Azurecole",
                                                                                    "id": "gdwswvm",
                                                                                    "parent_id": "t1_gdws1aq",
                                                                                    "score": 5,
                                                                                    "created_utc": 1606591846.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Precisely that part.",
                                                                                            "author": "ExExpectations",
                                                                                            "id": "gdwtn4t",
                                                                                            "parent_id": "t1_gdwswvm",
                                                                                            "score": 0,
                                                                                            "created_utc": 1606592094.0,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "body": "Yes, I figured it was that.  But \"you're being stupid\" is not the same as \"you are stupid\".  And even then we're misquoting what I actually said.",
                                                                                            "author": "anonymoustruth_99",
                                                                                            "id": "gdwuvat",
                                                                                            "parent_id": "t1_gdwswvm",
                                                                                            "score": -1,
                                                                                            "created_utc": 1606592489.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Saying someone is being stupid is not the same as calling them stupid 😉\n\nIn addition put your big girl pants on and just report a post you don’t agree with rather call the mods to your rescue",
                                                                    "author": null,
                                                                    "id": "gdxuo31",
                                                                    "parent_id": "t1_gdwlrpl",
                                                                    "score": -4,
                                                                    "created_utc": 1606604502.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "You seem to be totally obsessed with what I am writing or saying on the internet. \n\nI’m so flattered. \n\n🙄🙄",
                                                                            "author": "ExExpectations",
                                                                            "id": "gdxvpb4",
                                                                            "parent_id": "t1_gdxuo31",
                                                                            "score": 0,
                                                                            "created_utc": 1606604862.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gdwvcs4",
                                    "parent_id": "t1_gdwcblz",
                                    "score": -8,
                                    "created_utc": 1606592650.0,
                                    "replies": [
                                        {
                                            "body": "What the hell is wrong with you? Are you really that short sighted and unaware? Blackmail could lead to you being raped or murdered or mutilated in unimaginable ways? Have you really thought this through? If you're an SD I really wonder what any woman is even doing being with you!",
                                            "author": "blackmagickwoe_man",
                                            "id": "gdz787p",
                                            "parent_id": "t1_gdwvcs4",
                                            "score": 4,
                                            "created_utc": 1606624710.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "They have my Government ID, I don't recall being able to book prior to all the verification I did. Maybe it's changed, but to say \"UNTRUE\" just isn't the case. \n\nThat said, I DO agree that an AirBnb off the bat isn't a great idea. But after a meet or two they are much more enjoyable for both.",
                    "author": "mraspencer",
                    "id": "gdwu7wu",
                    "parent_id": "t1_gdwa0vx",
                    "score": 0,
                    "created_utc": 1606592277.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gdyf9qa",
            "parent_id": "t1_gdwoqo4",
            "score": 4,
            "created_utc": 1606611766.0,
            "replies": [
                {
                    "body": "I am theoretically with you ... the sugar dates I've had, there's usually no one in the lobby, very little contact with the front desk, the rooms are (presumably) sanitized.  I'd guess very little risk, especially since I wear an n95 mask inside.  But if you google \"places with highest coronavirus risk\", hotels always show up in the top 4 or 5.  \n\nHere's one story  [https://www.washingtonpost.com/health/2020/11/10/coronavirus-restaurants-gyms-hotels-risk/](https://www.washingtonpost.com/health/2020/11/10/coronavirus-restaurants-gyms-hotels-risk/)   But there's a zillion more hits, so if you don't like that news source or that particular study, find another, there's plenty of other studies and news sources.\n\nThat said, it doesn't seem like the study in that story, or even most studies, can definitively say \"these people caught covid in the hotel\".   Maybe it's because people who are at a hotel are more likely to go to a restaurant or bar, or be socializing with their co-travelers, and that's where they got it?  But hotel always does float up to the top, foro whatever reason",
                    "author": "Azurecole",
                    "id": "gdykwn0",
                    "parent_id": "t1_gdyf9qa",
                    "score": 1,
                    "created_utc": 1606613948.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm a frequent Airbnb customer though admittedly never for this. In the general case Airbnb absolutely has your identity. From this thread, it sounds like there may be loopholes, but if you're not actively trying to hide from them, you can expect them to know who you are.\n\nYou're right that it's homier and more pandemic-safe than a hotel. It'll be just you, no staff, no guests, no common areas. \n\nMy thought is it could be a great option, and you should just think through how you can make the situation safer & more trustworthy for her. Have her arrive first with her own transportation, text her a photo of your drivers license that proves you are who you say you are, etc. And once you do have trust with her, I think Airbnbs won't be problematic at all.",
            "author": "bizownersd",
            "id": "gdwzx4z",
            "parent_id": "t1_gdwoqo4",
            "score": -1,
            "created_utc": 1606594155.0,
            "replies": [
                {
                    "body": "Or, maybe, NOT use it the first few times with someone new?!! Until you’ve actually established and gained trust??",
                    "author": "ExExpectations",
                    "id": "gdxlvig",
                    "parent_id": "t1_gdwzx4z",
                    "score": 5,
                    "created_utc": 1606601562.0,
                    "replies": []
                },
                {
                    "body": ">but if you're not actively trying to hide from them, you can expect them to know who you are.\n\nThis is what I expected.  In fact I'd go further and say, if Airbnb doesn't even know who its customers are, I think any home/apartment/etc owner would be insane to put their place up for rent.   They have no idea who their customer is, and those people are going into my home???\n\nu/ExExpectations said she signed up for Airbnb with no ID or anything else needed.  Could there be an extra verification step if you actually try to use the service to book a place?  I mean, I signed up for  Coinbase with nothing but a fake email and password.  It wasn't until I tried to do a transaction that I needed to send in all manner of ID.  Same with cashapp, more verification as I tried to do more things on the app.  Layered ID requirements make sense -- make it super easy for the customer to sign up for the app, get them invested, and don't drop the verification requirements on them until they get excited to use the service",
                    "author": "Azurecole",
                    "id": "gdx13pb",
                    "parent_id": "t1_gdwzx4z",
                    "score": 2,
                    "created_utc": 1606594564.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gdxxkmt",
                            "parent_id": "t1_gdx13pb",
                            "score": 6,
                            "created_utc": 1606605520.0,
                            "replies": [
                                {
                                    "body": "Yes. I cannot upvote this enough times!!!!!!!! \n\nI connected my PayPal to my Airbnb account. PayPal *also* grandfathered in many accounts and it doesn’t have my full identity/ID or anything connected to it.\n\nPayments can also be made using prepaid credit cards.",
                                    "author": "ExExpectations",
                                    "id": "gdyvoiv",
                                    "parent_id": "t1_gdxxkmt",
                                    "score": 4,
                                    "created_utc": 1606618496.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It's been years since I signed up so I don't remember the sequence. As of now, though, they have my driver's license. My understanding is when I request to book, they represent to the host that I'm legit, and upon confirmed booking, they give my info to the host.\n\nIn the service of looking attractive to potential hosts, I've also connected my Facebook account and selected a couple photos, written a short bio, and added an emergency contact. And the account page is making it clear they'd really love to have my passport too. ;)\n\nThat being said, everything after the driver's license was probably optional, and not being a psychopath myself, I haven't tried to fool them. No idea if you could get away with a fake ID or something.",
                            "author": "bizownersd",
                            "id": "gdx2hrh",
                            "parent_id": "t1_gdx13pb",
                            "score": 0,
                            "created_utc": 1606595043.0,
                            "replies": [
                                {
                                    "body": "So I wonder, u/ExExpectations ... have you tried to book a place yet?  Because having the driver's license is what I expected at minimum!  I'm guessing they'll hit you with this requirement as you go through your first booking process.  Not perfect, of course",
                                    "author": "Azurecole",
                                    "id": "gdx53c4",
                                    "parent_id": "t1_gdx2hrh",
                                    "score": 1,
                                    "created_utc": 1606595909.0,
                                    "replies": [
                                        {
                                            "body": "I’ve not traveled using Airbnb myself in a long time. I did not upload any IDs to my profile and have booked years prior. \n\nThe point of my post was, compared to a hotel: there is NO security cameras in place, NO staff on call, literally no one around except the two people. At a hotel, there are usually other customers too. \n\nAll those are much more important to the SB compared to the ID issue yet somehow y’all get stuck on that part. \n\nLastly, I’ve dealt with Airbnb CS before -\nas another commenter said - not the most awesome CS experiences. It’s also a private entity (IN A PRIVATE HOME) compared to many hotel chains where more visibility are present.\n\nIf a guy insists he always and would rather use Airbnb rather than hotel (even as the first / few times), it’s NOT OKAY. \n\nMy post is to warn other SBs to watch out for this as a red flag.  I was feeling uneasy. But couldn’t pinpoint exactly why. I wouldn’t have thought as thoroughly had it not for another redditor who questioned it as well.",
                                            "author": "ExExpectations",
                                            "id": "gdx9io1",
                                            "parent_id": "t1_gdx53c4",
                                            "score": 8,
                                            "created_utc": 1606597397.0,
                                            "replies": [
                                                {
                                                    "body": "Frankly, I don't know why an SD would ever argue with whatever his brand new SB is most comfortable with.  With the exception of thinking through the covid sitch, it'd be a no brainer for me to do just pick whichever an SB preferred.\n\nIt's a good point about no staff on call,  no cameras, etc.  But for SBs who go to their SD's house -- which is obviously not the recommended way for the first few meetings -- it's the same situation.  To the extent there's any saving grace about the house, it's that since you know where his house is, you can figure out his identity.  That's what we're debating for Airbnb also... can you figure out his identity?  This isn't an arguing with your initial point, but now we want to figure out the answer.",
                                                    "author": "Azurecole",
                                                    "id": "gdxaeqk",
                                                    "parent_id": "t1_gdx9io1",
                                                    "score": 2,
                                                    "created_utc": 1606597692.0,
                                                    "replies": [
                                                        {
                                                            "body": "Residential and property records and taxes etc are public info. Reverse address reveals who lives there / who gets mail there / who owns the place.\n\nI’m pretty sure Airbnb will not release the identity of the person who rented the place to anyone except LE. \n\nCompletely not the same comparison. Still risky but def not on the same level of risk.",
                                                            "author": "ExExpectations",
                                                            "id": "gdxkfzo",
                                                            "parent_id": "t1_gdxaeqk",
                                                            "score": 6,
                                                            "created_utc": 1606601093.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "I should clarify, he insists that he rents Airbnb for trysts. He didn’t ask for my preferences. He just said - that’s what I do and that’s where we’d go. \n\nI didn’t say I’d rather a hotel. \n\nBecause after he said that - at that point I already paused and decided not to move ahead with him - regardless of hotel or not. \n\nMaking that kind of comments without discussion (coupled with the fact that he insists I would never know his real last name because he’s “had stalkers” in the past) shows a huge lack of thought for me and my safety.",
                                                            "author": "ExExpectations",
                                                            "id": "gdxlf4c",
                                                            "parent_id": "t1_gdxaeqk",
                                                            "score": 5,
                                                            "created_utc": 1606601410.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Airbnb is fine once you've established a relationship. Do hotel at first.",
            "author": "Old-Perspective-7521",
            "id": "ge29ggn",
            "parent_id": "t1_gdwoqo4",
            "score": 1,
            "created_utc": 1606674245.0,
            "replies": []
        },
        {
            "body": "Even so, how likely do you think that the **SB** would have access for that info ahead of time, or ever?? \n\nThere’s no camera footage. No on one staff. \n\nAirbnb is NOT a safe choice as a first/few dates meeting place compared to a hotel.",
            "author": "ExExpectations",
            "id": "gdyz3kx",
            "parent_id": "t1_gdyuna1",
            "score": 6,
            "created_utc": 1606620189.0,
            "replies": []
        },
        {
            "body": "“Trying to be an SB”??  My various sugar experiences says otherwise. But I digress. \n\nYou are probably speaking in general, not about me specifically. And no, this isn’t paranoia. Being cautious and taking safety seriously IS NOT paranoia. \n\n🙄🙄🙄",
            "author": "ExExpectations",
            "id": "ge2a95p",
            "parent_id": "t1_ge29lvj",
            "score": 3,
            "created_utc": 1606674626.0,
            "replies": []
        },
        {
            "body": "I certainly understand both sides because there are some men who get blackmailed, but I’ve never personally heard of any getting physically assaulted. \n\nPlease consider why this would make many women uncomfortable to do early on. There is already a substantial power differential to begin with and as a woman, that can be a very vulnerable position to be in. A man has more strength, resources, and connections to do us harm and get away with it. So having his info but him not having all of hers gives some women a sense of an ‘even playing field’.\n\nIt’s not that you’re a bad guy, but there are a lot of bad men out there who want to hurt us or stalk us. Many of the women on SA have been in abusive relationships where giving our their info too early made them really vulnerable. Many also have minor children at home and protecting them is non-negotiable.\n\nIf I may ask, what information do you request and how early in the arrangement are you generally requesting it?",
            "author": "LVSugarBebe",
            "id": "ge1nohl",
            "parent_id": "t1_gdyhj0s",
            "score": 6,
            "created_utc": 1606664855.0,
            "replies": [
                {
                    "body": ">but I’ve never personally heard of any getting physically assaulted\n\nThe bigger risk is being robbed or even kidnapped after being slipped drugs into drinks. You should watch the movie \"Hustlers\", they explain this type of crime.\n\n>Please consider consider why this would make many women uncomfortable to do early on. \n\nOk but I think my safety is more important than other person feeling uncomfortable. Isn't that the same thing most women advocate for? Our personal safety  trumps other people's feelings.\n\n>what information do you request and how early in the arrangement are you generally requesting it?\n\nI don't request much as most young women have big online presence and don't really care about opsec.\n\nLately, i don't even tell them I share their picture and phone number with a safe friend.",
                    "author": "AdAlternative6041",
                    "id": "ge1oum2",
                    "parent_id": "t1_ge1nohl",
                    "score": 2,
                    "created_utc": 1606665257.0,
                    "replies": [
                        {
                            "body": "Yes, thank you for pointing it out. That is certainly a possible risk, though I presume the statistical likelihood of the monetary loss is far lower than that of the physical risks for a woman of being assaulted. But again, just giving perspective. I’d presume that as a woman gets to know more about you, she will feel safer sharing. If she doesn’t feel safe yet or accuses you of a double standard, it’s possible you haven’t built up enough trust yet.\n\nWhen you say ‘not much’, can you elaborate? As in you send the name and number and picture she provided or you require to see her ID?\nI also assume you inform your safe person of your location and share your phone tracker just in case?",
                            "author": "LVSugarBebe",
                            "id": "ge1r7hn",
                            "parent_id": "t1_ge1oum2",
                            "score": 2,
                            "created_utc": 1606666089.0,
                            "replies": [
                                {
                                    "body": ">I presume the statistical likelihood of the monetary loss is far lower than that of the physical risks for a woman of being assaulted.\n\nI don't understand how is that relevant at all, i know  the risk is higher for women but how does that affect the very real risks I also face?\n\n>If she doesn’t feel safe yet or accuses you of a double standard, it’s possible you haven’t built up enough trust yet.\n\nHonestly, I haven't met yet a single woman in either vanilla or sugar dating that think it's ok for a guy to share her info with a safe friend.\n\nApparently, their feelings ARE more important than a guy's safety /s\n\n>or you require to see her ID?\n\nNot really, most times i get more than enough info from social media. For example, you'll be surprised at how many young women use the same handle for SA and their personal IG.\n\n>I also assume you inform your safe person of your location and share your phone tracker just in case?\n\nYup.",
                                    "author": "AdAlternative6041",
                                    "id": "ge1ssz1",
                                    "parent_id": "t1_ge1r7hn",
                                    "score": 1,
                                    "created_utc": 1606666664.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> more strength, resources, and connections to do us harm \n\nThis turns me on. It's why I get into this lifestyle, honestly. It's such a thrill seeing the intimate side of a formidable CEO. It's like getting to pet the lion's mane.\n\nBut yeah, sometimes you can get bitten :(",
                    "author": "77hr0waway",
                    "id": "hym36z3",
                    "parent_id": "t1_ge1nohl",
                    "score": 2,
                    "created_utc": 1645942044.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is why I wish Love Hotels were a thing outside of Asia. My experience is only with Japanese ones, but they are awesome. Safe areas, lots of security cameras and staff onsite, rooms that are well appointed for just about any eventuality, and no need to ever share your identity with the hotel staff directly. They even generally control the elevators and things to such an extent that the likelihood of you meeting another patron in a hallway is almost 0%.",
            "author": "wraithfive",
            "id": "gdz0tdx",
            "parent_id": "t1_gdyzmta",
            "score": 2,
            "created_utc": 1606621011.0,
            "replies": []
        },
        {
            "body": "I had to give my passport when I signed up to air bnb, so that was my experience.  But... \n\nIt really isn't a pissing contest as to which side poses the most risks.  Neither side wants the negative experience (however bad), so let's just say that both sides need to stay safe, ok?",
            "author": "anonymoustruth_99",
            "id": "gdwb0e9",
            "parent_id": "t1_gdwa0vx",
            "score": -1,
            "created_utc": 1606585540.0,
            "replies": [
                {
                    "body": "🙄🙄🙄\n\nOkay whatever Bob. Psychopath vs blackmail and you think they’re equal in severity. \n\nAnd no. Maybe Airbnb has changed their ID requirements for newer signups. It’s a company that started here, and a lot of locals have older grandfathered accounts that did not need ID verification in the earlier days. \n\nhttps://www.quora.com/How-does-Airbnb-verify-an-ID/answer/Kristen-Hall-8?ch=10&share=1f14da59&srid=QY0C0",
                    "author": "ExExpectations",
                    "id": "gdwcblz",
                    "parent_id": "t1_gdwb0e9",
                    "score": 8,
                    "created_utc": 1606586025.0,
                    "replies": [
                        {
                            "body": "Ok, you're being deliberately provocative - and stupid. Don't tell me I said that blackmail and psychopaths are equal, because I didn't.  That was your misinterpretation..  You sound like you have a serious chip on your shoulder and need to vent.\n\nMy response was to stay safe WHATEVER the venue and not let your guard down.  But you seem to want to make it into a male vs female argument.",
                            "author": "anonymoustruth_99",
                            "id": "gdwdpnr",
                            "parent_id": "t1_gdwcblz",
                            "score": -1,
                            "created_utc": 1606586522.0,
                            "replies": [
                                {
                                    "body": "I AM THE OP.",
                                    "author": "ExExpectations",
                                    "id": "gdwdtvu",
                                    "parent_id": "t1_gdwdpnr",
                                    "score": 2,
                                    "created_utc": 1606586560.0,
                                    "replies": [
                                        {
                                            "body": "yes, I just noticed that.  Seems you didn't get the gist that I was sympathetic to your question and suggested that whatever the venue, your safety is important.",
                                            "author": "anonymoustruth_99",
                                            "id": "gdwe6z6",
                                            "parent_id": "t1_gdwdtvu",
                                            "score": 5,
                                            "created_utc": 1606586679.0,
                                            "replies": [
                                                {
                                                    "body": "First you argue that Airbnb has ID on file. \n\nThen you ignored the fact that hotels have security cameras and staff whereas Airbnb does not. \n\nThen you go and say welllllll Ms., actually the guy have to protect themselves as well blah blah blah. NOWHERE did I say I must know his identity the first time we have intimacy. Or third. Or tenth. \n\nI am POINTING IT OUT TO SBs - that Airbnb is not a safe choice for SBs *when* they don’t know the guys identity yet. There is nothing wrong with going to a hotel and she should insist on that compared to going to an Airbnb.",
                                                    "author": "ExExpectations",
                                                    "id": "gdwhrid",
                                                    "parent_id": "t1_gdwe6z6",
                                                    "score": 11,
                                                    "created_utc": 1606587875.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "And - I have no questions. I did not post a **question.**\n\nI posted a SAFETY precaution that SBs should look out for.\n\nIt’s not something I personally thought through previously, and certainly some other SBs have not either.",
                                                    "author": "ExExpectations",
                                                    "id": "gdwia29",
                                                    "parent_id": "t1_gdwe6z6",
                                                    "score": 8,
                                                    "created_utc": 1606588043.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Mods. \n\nu/LaSirene23 u/azurecole \n\nI believe this constitutes as name calling.",
                                    "author": "ExExpectations",
                                    "id": "gdwiisu",
                                    "parent_id": "t1_gdwdpnr",
                                    "score": 0,
                                    "created_utc": 1606588121.0,
                                    "replies": [
                                        {
                                            "body": "Mod here.  \n\nI don’t see where a name was called. But it seems like the discussion has gotten personal so I’ll just recommend that you both take a step back and remember we’re all human beings. \n\nGo eat some leftover turkey or something. 🙂",
                                            "author": null,
                                            "id": "gdwmue0",
                                            "parent_id": "t1_gdwiisu",
                                            "score": 5,
                                            "created_utc": 1606589531.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gdwlmc1",
                                            "parent_id": "t1_gdwiisu",
                                            "score": -2,
                                            "created_utc": 1606589129.0,
                                            "replies": [
                                                {
                                                    "body": "Name calling on here is not allowed. That’s my understanding.",
                                                    "author": "ExExpectations",
                                                    "id": "gdwlrpl",
                                                    "parent_id": "t1_gdwlmc1",
                                                    "score": 1,
                                                    "created_utc": 1606589176.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'll lock this particular subthread -- it's a little buried but I did see the name.  u/anonymoustruth_99, you'll need to respond without the namecalling.  The rest of the thread got a little heated but it looks like \"mutual combat\"",
                                                            "author": "Azurecole",
                                                            "id": "gdwnzdt",
                                                            "parent_id": "t1_gdwlrpl",
                                                            "score": 3,
                                                            "created_utc": 1606589913.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Actually, there was no name calling.\n\nThe spirit of my original post was totally misinterpreted by the OP who seemed to over react and fly off on a tangent.  \n\nThe original post was well intentioned and was encouraging all parties to take their first steps cautiously.",
                                                                    "author": "anonymoustruth_99",
                                                                    "id": "gdws1aq",
                                                                    "parent_id": "t1_gdwnzdt",
                                                                    "score": -1,
                                                                    "created_utc": 1606591540.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I think it was \"you're being...stupid\".   I do agree this could be just missed communication.",
                                                                            "author": "Azurecole",
                                                                            "id": "gdwswvm",
                                                                            "parent_id": "t1_gdws1aq",
                                                                            "score": 5,
                                                                            "created_utc": 1606591846.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Precisely that part.",
                                                                                    "author": "ExExpectations",
                                                                                    "id": "gdwtn4t",
                                                                                    "parent_id": "t1_gdwswvm",
                                                                                    "score": 0,
                                                                                    "created_utc": 1606592094.0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "body": "Yes, I figured it was that.  But \"you're being stupid\" is not the same as \"you are stupid\".  And even then we're misquoting what I actually said.",
                                                                                    "author": "anonymoustruth_99",
                                                                                    "id": "gdwuvat",
                                                                                    "parent_id": "t1_gdwswvm",
                                                                                    "score": -1,
                                                                                    "created_utc": 1606592489.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Saying someone is being stupid is not the same as calling them stupid 😉\n\nIn addition put your big girl pants on and just report a post you don’t agree with rather call the mods to your rescue",
                                                            "author": null,
                                                            "id": "gdxuo31",
                                                            "parent_id": "t1_gdwlrpl",
                                                            "score": -4,
                                                            "created_utc": 1606604502.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You seem to be totally obsessed with what I am writing or saying on the internet. \n\nI’m so flattered. \n\n🙄🙄",
                                                                    "author": "ExExpectations",
                                                                    "id": "gdxvpb4",
                                                                    "parent_id": "t1_gdxuo31",
                                                                    "score": 0,
                                                                    "created_utc": 1606604862.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gdwvcs4",
                            "parent_id": "t1_gdwcblz",
                            "score": -8,
                            "created_utc": 1606592650.0,
                            "replies": [
                                {
                                    "body": "What the hell is wrong with you? Are you really that short sighted and unaware? Blackmail could lead to you being raped or murdered or mutilated in unimaginable ways? Have you really thought this through? If you're an SD I really wonder what any woman is even doing being with you!",
                                    "author": "blackmagickwoe_man",
                                    "id": "gdz787p",
                                    "parent_id": "t1_gdwvcs4",
                                    "score": 4,
                                    "created_utc": 1606624710.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "They have my Government ID, I don't recall being able to book prior to all the verification I did. Maybe it's changed, but to say \"UNTRUE\" just isn't the case. \n\nThat said, I DO agree that an AirBnb off the bat isn't a great idea. But after a meet or two they are much more enjoyable for both.",
            "author": "mraspencer",
            "id": "gdwu7wu",
            "parent_id": "t1_gdwa0vx",
            "score": 0,
            "created_utc": 1606592277.0,
            "replies": []
        },
        {
            "body": "I am theoretically with you ... the sugar dates I've had, there's usually no one in the lobby, very little contact with the front desk, the rooms are (presumably) sanitized.  I'd guess very little risk, especially since I wear an n95 mask inside.  But if you google \"places with highest coronavirus risk\", hotels always show up in the top 4 or 5.  \n\nHere's one story  [https://www.washingtonpost.com/health/2020/11/10/coronavirus-restaurants-gyms-hotels-risk/](https://www.washingtonpost.com/health/2020/11/10/coronavirus-restaurants-gyms-hotels-risk/)   But there's a zillion more hits, so if you don't like that news source or that particular study, find another, there's plenty of other studies and news sources.\n\nThat said, it doesn't seem like the study in that story, or even most studies, can definitively say \"these people caught covid in the hotel\".   Maybe it's because people who are at a hotel are more likely to go to a restaurant or bar, or be socializing with their co-travelers, and that's where they got it?  But hotel always does float up to the top, foro whatever reason",
            "author": "Azurecole",
            "id": "gdykwn0",
            "parent_id": "t1_gdyf9qa",
            "score": 1,
            "created_utc": 1606613948.0,
            "replies": []
        },
        {
            "body": "Or, maybe, NOT use it the first few times with someone new?!! Until you’ve actually established and gained trust??",
            "author": "ExExpectations",
            "id": "gdxlvig",
            "parent_id": "t1_gdwzx4z",
            "score": 5,
            "created_utc": 1606601562.0,
            "replies": []
        },
        {
            "body": ">but if you're not actively trying to hide from them, you can expect them to know who you are.\n\nThis is what I expected.  In fact I'd go further and say, if Airbnb doesn't even know who its customers are, I think any home/apartment/etc owner would be insane to put their place up for rent.   They have no idea who their customer is, and those people are going into my home???\n\nu/ExExpectations said she signed up for Airbnb with no ID or anything else needed.  Could there be an extra verification step if you actually try to use the service to book a place?  I mean, I signed up for  Coinbase with nothing but a fake email and password.  It wasn't until I tried to do a transaction that I needed to send in all manner of ID.  Same with cashapp, more verification as I tried to do more things on the app.  Layered ID requirements make sense -- make it super easy for the customer to sign up for the app, get them invested, and don't drop the verification requirements on them until they get excited to use the service",
            "author": "Azurecole",
            "id": "gdx13pb",
            "parent_id": "t1_gdwzx4z",
            "score": 2,
            "created_utc": 1606594564.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gdxxkmt",
                    "parent_id": "t1_gdx13pb",
                    "score": 6,
                    "created_utc": 1606605520.0,
                    "replies": [
                        {
                            "body": "Yes. I cannot upvote this enough times!!!!!!!! \n\nI connected my PayPal to my Airbnb account. PayPal *also* grandfathered in many accounts and it doesn’t have my full identity/ID or anything connected to it.\n\nPayments can also be made using prepaid credit cards.",
                            "author": "ExExpectations",
                            "id": "gdyvoiv",
                            "parent_id": "t1_gdxxkmt",
                            "score": 4,
                            "created_utc": 1606618496.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It's been years since I signed up so I don't remember the sequence. As of now, though, they have my driver's license. My understanding is when I request to book, they represent to the host that I'm legit, and upon confirmed booking, they give my info to the host.\n\nIn the service of looking attractive to potential hosts, I've also connected my Facebook account and selected a couple photos, written a short bio, and added an emergency contact. And the account page is making it clear they'd really love to have my passport too. ;)\n\nThat being said, everything after the driver's license was probably optional, and not being a psychopath myself, I haven't tried to fool them. No idea if you could get away with a fake ID or something.",
                    "author": "bizownersd",
                    "id": "gdx2hrh",
                    "parent_id": "t1_gdx13pb",
                    "score": 0,
                    "created_utc": 1606595043.0,
                    "replies": [
                        {
                            "body": "So I wonder, u/ExExpectations ... have you tried to book a place yet?  Because having the driver's license is what I expected at minimum!  I'm guessing they'll hit you with this requirement as you go through your first booking process.  Not perfect, of course",
                            "author": "Azurecole",
                            "id": "gdx53c4",
                            "parent_id": "t1_gdx2hrh",
                            "score": 1,
                            "created_utc": 1606595909.0,
                            "replies": [
                                {
                                    "body": "I’ve not traveled using Airbnb myself in a long time. I did not upload any IDs to my profile and have booked years prior. \n\nThe point of my post was, compared to a hotel: there is NO security cameras in place, NO staff on call, literally no one around except the two people. At a hotel, there are usually other customers too. \n\nAll those are much more important to the SB compared to the ID issue yet somehow y’all get stuck on that part. \n\nLastly, I’ve dealt with Airbnb CS before -\nas another commenter said - not the most awesome CS experiences. It’s also a private entity (IN A PRIVATE HOME) compared to many hotel chains where more visibility are present.\n\nIf a guy insists he always and would rather use Airbnb rather than hotel (even as the first / few times), it’s NOT OKAY. \n\nMy post is to warn other SBs to watch out for this as a red flag.  I was feeling uneasy. But couldn’t pinpoint exactly why. I wouldn’t have thought as thoroughly had it not for another redditor who questioned it as well.",
                                    "author": "ExExpectations",
                                    "id": "gdx9io1",
                                    "parent_id": "t1_gdx53c4",
                                    "score": 8,
                                    "created_utc": 1606597397.0,
                                    "replies": [
                                        {
                                            "body": "Frankly, I don't know why an SD would ever argue with whatever his brand new SB is most comfortable with.  With the exception of thinking through the covid sitch, it'd be a no brainer for me to do just pick whichever an SB preferred.\n\nIt's a good point about no staff on call,  no cameras, etc.  But for SBs who go to their SD's house -- which is obviously not the recommended way for the first few meetings -- it's the same situation.  To the extent there's any saving grace about the house, it's that since you know where his house is, you can figure out his identity.  That's what we're debating for Airbnb also... can you figure out his identity?  This isn't an arguing with your initial point, but now we want to figure out the answer.",
                                            "author": "Azurecole",
                                            "id": "gdxaeqk",
                                            "parent_id": "t1_gdx9io1",
                                            "score": 2,
                                            "created_utc": 1606597692.0,
                                            "replies": [
                                                {
                                                    "body": "Residential and property records and taxes etc are public info. Reverse address reveals who lives there / who gets mail there / who owns the place.\n\nI’m pretty sure Airbnb will not release the identity of the person who rented the place to anyone except LE. \n\nCompletely not the same comparison. Still risky but def not on the same level of risk.",
                                                    "author": "ExExpectations",
                                                    "id": "gdxkfzo",
                                                    "parent_id": "t1_gdxaeqk",
                                                    "score": 6,
                                                    "created_utc": 1606601093.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "I should clarify, he insists that he rents Airbnb for trysts. He didn’t ask for my preferences. He just said - that’s what I do and that’s where we’d go. \n\nI didn’t say I’d rather a hotel. \n\nBecause after he said that - at that point I already paused and decided not to move ahead with him - regardless of hotel or not. \n\nMaking that kind of comments without discussion (coupled with the fact that he insists I would never know his real last name because he’s “had stalkers” in the past) shows a huge lack of thought for me and my safety.",
                                                    "author": "ExExpectations",
                                                    "id": "gdxlf4c",
                                                    "parent_id": "t1_gdxaeqk",
                                                    "score": 5,
                                                    "created_utc": 1606601410.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">but I’ve never personally heard of any getting physically assaulted\n\nThe bigger risk is being robbed or even kidnapped after being slipped drugs into drinks. You should watch the movie \"Hustlers\", they explain this type of crime.\n\n>Please consider consider why this would make many women uncomfortable to do early on. \n\nOk but I think my safety is more important than other person feeling uncomfortable. Isn't that the same thing most women advocate for? Our personal safety  trumps other people's feelings.\n\n>what information do you request and how early in the arrangement are you generally requesting it?\n\nI don't request much as most young women have big online presence and don't really care about opsec.\n\nLately, i don't even tell them I share their picture and phone number with a safe friend.",
            "author": "AdAlternative6041",
            "id": "ge1oum2",
            "parent_id": "t1_ge1nohl",
            "score": 2,
            "created_utc": 1606665257.0,
            "replies": [
                {
                    "body": "Yes, thank you for pointing it out. That is certainly a possible risk, though I presume the statistical likelihood of the monetary loss is far lower than that of the physical risks for a woman of being assaulted. But again, just giving perspective. I’d presume that as a woman gets to know more about you, she will feel safer sharing. If she doesn’t feel safe yet or accuses you of a double standard, it’s possible you haven’t built up enough trust yet.\n\nWhen you say ‘not much’, can you elaborate? As in you send the name and number and picture she provided or you require to see her ID?\nI also assume you inform your safe person of your location and share your phone tracker just in case?",
                    "author": "LVSugarBebe",
                    "id": "ge1r7hn",
                    "parent_id": "t1_ge1oum2",
                    "score": 2,
                    "created_utc": 1606666089.0,
                    "replies": [
                        {
                            "body": ">I presume the statistical likelihood of the monetary loss is far lower than that of the physical risks for a woman of being assaulted.\n\nI don't understand how is that relevant at all, i know  the risk is higher for women but how does that affect the very real risks I also face?\n\n>If she doesn’t feel safe yet or accuses you of a double standard, it’s possible you haven’t built up enough trust yet.\n\nHonestly, I haven't met yet a single woman in either vanilla or sugar dating that think it's ok for a guy to share her info with a safe friend.\n\nApparently, their feelings ARE more important than a guy's safety /s\n\n>or you require to see her ID?\n\nNot really, most times i get more than enough info from social media. For example, you'll be surprised at how many young women use the same handle for SA and their personal IG.\n\n>I also assume you inform your safe person of your location and share your phone tracker just in case?\n\nYup.",
                            "author": "AdAlternative6041",
                            "id": "ge1ssz1",
                            "parent_id": "t1_ge1r7hn",
                            "score": 1,
                            "created_utc": 1606666664.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> more strength, resources, and connections to do us harm \n\nThis turns me on. It's why I get into this lifestyle, honestly. It's such a thrill seeing the intimate side of a formidable CEO. It's like getting to pet the lion's mane.\n\nBut yeah, sometimes you can get bitten :(",
            "author": "77hr0waway",
            "id": "hym36z3",
            "parent_id": "t1_ge1nohl",
            "score": 2,
            "created_utc": 1645942044.0,
            "replies": []
        },
        {
            "body": "🙄🙄🙄\n\nOkay whatever Bob. Psychopath vs blackmail and you think they’re equal in severity. \n\nAnd no. Maybe Airbnb has changed their ID requirements for newer signups. It’s a company that started here, and a lot of locals have older grandfathered accounts that did not need ID verification in the earlier days. \n\nhttps://www.quora.com/How-does-Airbnb-verify-an-ID/answer/Kristen-Hall-8?ch=10&share=1f14da59&srid=QY0C0",
            "author": "ExExpectations",
            "id": "gdwcblz",
            "parent_id": "t1_gdwb0e9",
            "score": 8,
            "created_utc": 1606586025.0,
            "replies": [
                {
                    "body": "Ok, you're being deliberately provocative - and stupid. Don't tell me I said that blackmail and psychopaths are equal, because I didn't.  That was your misinterpretation..  You sound like you have a serious chip on your shoulder and need to vent.\n\nMy response was to stay safe WHATEVER the venue and not let your guard down.  But you seem to want to make it into a male vs female argument.",
                    "author": "anonymoustruth_99",
                    "id": "gdwdpnr",
                    "parent_id": "t1_gdwcblz",
                    "score": -1,
                    "created_utc": 1606586522.0,
                    "replies": [
                        {
                            "body": "I AM THE OP.",
                            "author": "ExExpectations",
                            "id": "gdwdtvu",
                            "parent_id": "t1_gdwdpnr",
                            "score": 2,
                            "created_utc": 1606586560.0,
                            "replies": [
                                {
                                    "body": "yes, I just noticed that.  Seems you didn't get the gist that I was sympathetic to your question and suggested that whatever the venue, your safety is important.",
                                    "author": "anonymoustruth_99",
                                    "id": "gdwe6z6",
                                    "parent_id": "t1_gdwdtvu",
                                    "score": 5,
                                    "created_utc": 1606586679.0,
                                    "replies": [
                                        {
                                            "body": "First you argue that Airbnb has ID on file. \n\nThen you ignored the fact that hotels have security cameras and staff whereas Airbnb does not. \n\nThen you go and say welllllll Ms., actually the guy have to protect themselves as well blah blah blah. NOWHERE did I say I must know his identity the first time we have intimacy. Or third. Or tenth. \n\nI am POINTING IT OUT TO SBs - that Airbnb is not a safe choice for SBs *when* they don’t know the guys identity yet. There is nothing wrong with going to a hotel and she should insist on that compared to going to an Airbnb.",
                                            "author": "ExExpectations",
                                            "id": "gdwhrid",
                                            "parent_id": "t1_gdwe6z6",
                                            "score": 11,
                                            "created_utc": 1606587875.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "And - I have no questions. I did not post a **question.**\n\nI posted a SAFETY precaution that SBs should look out for.\n\nIt’s not something I personally thought through previously, and certainly some other SBs have not either.",
                                            "author": "ExExpectations",
                                            "id": "gdwia29",
                                            "parent_id": "t1_gdwe6z6",
                                            "score": 8,
                                            "created_utc": 1606588043.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Mods. \n\nu/LaSirene23 u/azurecole \n\nI believe this constitutes as name calling.",
                            "author": "ExExpectations",
                            "id": "gdwiisu",
                            "parent_id": "t1_gdwdpnr",
                            "score": 0,
                            "created_utc": 1606588121.0,
                            "replies": [
                                {
                                    "body": "Mod here.  \n\nI don’t see where a name was called. But it seems like the discussion has gotten personal so I’ll just recommend that you both take a step back and remember we’re all human beings. \n\nGo eat some leftover turkey or something. 🙂",
                                    "author": null,
                                    "id": "gdwmue0",
                                    "parent_id": "t1_gdwiisu",
                                    "score": 5,
                                    "created_utc": 1606589531.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gdwlmc1",
                                    "parent_id": "t1_gdwiisu",
                                    "score": -2,
                                    "created_utc": 1606589129.0,
                                    "replies": [
                                        {
                                            "body": "Name calling on here is not allowed. That’s my understanding.",
                                            "author": "ExExpectations",
                                            "id": "gdwlrpl",
                                            "parent_id": "t1_gdwlmc1",
                                            "score": 1,
                                            "created_utc": 1606589176.0,
                                            "replies": [
                                                {
                                                    "body": "I'll lock this particular subthread -- it's a little buried but I did see the name.  u/anonymoustruth_99, you'll need to respond without the namecalling.  The rest of the thread got a little heated but it looks like \"mutual combat\"",
                                                    "author": "Azurecole",
                                                    "id": "gdwnzdt",
                                                    "parent_id": "t1_gdwlrpl",
                                                    "score": 3,
                                                    "created_utc": 1606589913.0,
                                                    "replies": [
                                                        {
                                                            "body": "Actually, there was no name calling.\n\nThe spirit of my original post was totally misinterpreted by the OP who seemed to over react and fly off on a tangent.  \n\nThe original post was well intentioned and was encouraging all parties to take their first steps cautiously.",
                                                            "author": "anonymoustruth_99",
                                                            "id": "gdws1aq",
                                                            "parent_id": "t1_gdwnzdt",
                                                            "score": -1,
                                                            "created_utc": 1606591540.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I think it was \"you're being...stupid\".   I do agree this could be just missed communication.",
                                                                    "author": "Azurecole",
                                                                    "id": "gdwswvm",
                                                                    "parent_id": "t1_gdws1aq",
                                                                    "score": 5,
                                                                    "created_utc": 1606591846.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Precisely that part.",
                                                                            "author": "ExExpectations",
                                                                            "id": "gdwtn4t",
                                                                            "parent_id": "t1_gdwswvm",
                                                                            "score": 0,
                                                                            "created_utc": 1606592094.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "Yes, I figured it was that.  But \"you're being stupid\" is not the same as \"you are stupid\".  And even then we're misquoting what I actually said.",
                                                                            "author": "anonymoustruth_99",
                                                                            "id": "gdwuvat",
                                                                            "parent_id": "t1_gdwswvm",
                                                                            "score": -1,
                                                                            "created_utc": 1606592489.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Saying someone is being stupid is not the same as calling them stupid 😉\n\nIn addition put your big girl pants on and just report a post you don’t agree with rather call the mods to your rescue",
                                                    "author": null,
                                                    "id": "gdxuo31",
                                                    "parent_id": "t1_gdwlrpl",
                                                    "score": -4,
                                                    "created_utc": 1606604502.0,
                                                    "replies": [
                                                        {
                                                            "body": "You seem to be totally obsessed with what I am writing or saying on the internet. \n\nI’m so flattered. \n\n🙄🙄",
                                                            "author": "ExExpectations",
                                                            "id": "gdxvpb4",
                                                            "parent_id": "t1_gdxuo31",
                                                            "score": 0,
                                                            "created_utc": 1606604862.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gdwvcs4",
                    "parent_id": "t1_gdwcblz",
                    "score": -8,
                    "created_utc": 1606592650.0,
                    "replies": [
                        {
                            "body": "What the hell is wrong with you? Are you really that short sighted and unaware? Blackmail could lead to you being raped or murdered or mutilated in unimaginable ways? Have you really thought this through? If you're an SD I really wonder what any woman is even doing being with you!",
                            "author": "blackmagickwoe_man",
                            "id": "gdz787p",
                            "parent_id": "t1_gdwvcs4",
                            "score": 4,
                            "created_utc": 1606624710.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gdxxkmt",
            "parent_id": "t1_gdx13pb",
            "score": 6,
            "created_utc": 1606605520.0,
            "replies": [
                {
                    "body": "Yes. I cannot upvote this enough times!!!!!!!! \n\nI connected my PayPal to my Airbnb account. PayPal *also* grandfathered in many accounts and it doesn’t have my full identity/ID or anything connected to it.\n\nPayments can also be made using prepaid credit cards.",
                    "author": "ExExpectations",
                    "id": "gdyvoiv",
                    "parent_id": "t1_gdxxkmt",
                    "score": 4,
                    "created_utc": 1606618496.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's been years since I signed up so I don't remember the sequence. As of now, though, they have my driver's license. My understanding is when I request to book, they represent to the host that I'm legit, and upon confirmed booking, they give my info to the host.\n\nIn the service of looking attractive to potential hosts, I've also connected my Facebook account and selected a couple photos, written a short bio, and added an emergency contact. And the account page is making it clear they'd really love to have my passport too. ;)\n\nThat being said, everything after the driver's license was probably optional, and not being a psychopath myself, I haven't tried to fool them. No idea if you could get away with a fake ID or something.",
            "author": "bizownersd",
            "id": "gdx2hrh",
            "parent_id": "t1_gdx13pb",
            "score": 0,
            "created_utc": 1606595043.0,
            "replies": [
                {
                    "body": "So I wonder, u/ExExpectations ... have you tried to book a place yet?  Because having the driver's license is what I expected at minimum!  I'm guessing they'll hit you with this requirement as you go through your first booking process.  Not perfect, of course",
                    "author": "Azurecole",
                    "id": "gdx53c4",
                    "parent_id": "t1_gdx2hrh",
                    "score": 1,
                    "created_utc": 1606595909.0,
                    "replies": [
                        {
                            "body": "I’ve not traveled using Airbnb myself in a long time. I did not upload any IDs to my profile and have booked years prior. \n\nThe point of my post was, compared to a hotel: there is NO security cameras in place, NO staff on call, literally no one around except the two people. At a hotel, there are usually other customers too. \n\nAll those are much more important to the SB compared to the ID issue yet somehow y’all get stuck on that part. \n\nLastly, I’ve dealt with Airbnb CS before -\nas another commenter said - not the most awesome CS experiences. It’s also a private entity (IN A PRIVATE HOME) compared to many hotel chains where more visibility are present.\n\nIf a guy insists he always and would rather use Airbnb rather than hotel (even as the first / few times), it’s NOT OKAY. \n\nMy post is to warn other SBs to watch out for this as a red flag.  I was feeling uneasy. But couldn’t pinpoint exactly why. I wouldn’t have thought as thoroughly had it not for another redditor who questioned it as well.",
                            "author": "ExExpectations",
                            "id": "gdx9io1",
                            "parent_id": "t1_gdx53c4",
                            "score": 8,
                            "created_utc": 1606597397.0,
                            "replies": [
                                {
                                    "body": "Frankly, I don't know why an SD would ever argue with whatever his brand new SB is most comfortable with.  With the exception of thinking through the covid sitch, it'd be a no brainer for me to do just pick whichever an SB preferred.\n\nIt's a good point about no staff on call,  no cameras, etc.  But for SBs who go to their SD's house -- which is obviously not the recommended way for the first few meetings -- it's the same situation.  To the extent there's any saving grace about the house, it's that since you know where his house is, you can figure out his identity.  That's what we're debating for Airbnb also... can you figure out his identity?  This isn't an arguing with your initial point, but now we want to figure out the answer.",
                                    "author": "Azurecole",
                                    "id": "gdxaeqk",
                                    "parent_id": "t1_gdx9io1",
                                    "score": 2,
                                    "created_utc": 1606597692.0,
                                    "replies": [
                                        {
                                            "body": "Residential and property records and taxes etc are public info. Reverse address reveals who lives there / who gets mail there / who owns the place.\n\nI’m pretty sure Airbnb will not release the identity of the person who rented the place to anyone except LE. \n\nCompletely not the same comparison. Still risky but def not on the same level of risk.",
                                            "author": "ExExpectations",
                                            "id": "gdxkfzo",
                                            "parent_id": "t1_gdxaeqk",
                                            "score": 6,
                                            "created_utc": 1606601093.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I should clarify, he insists that he rents Airbnb for trysts. He didn’t ask for my preferences. He just said - that’s what I do and that’s where we’d go. \n\nI didn’t say I’d rather a hotel. \n\nBecause after he said that - at that point I already paused and decided not to move ahead with him - regardless of hotel or not. \n\nMaking that kind of comments without discussion (coupled with the fact that he insists I would never know his real last name because he’s “had stalkers” in the past) shows a huge lack of thought for me and my safety.",
                                            "author": "ExExpectations",
                                            "id": "gdxlf4c",
                                            "parent_id": "t1_gdxaeqk",
                                            "score": 5,
                                            "created_utc": 1606601410.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, thank you for pointing it out. That is certainly a possible risk, though I presume the statistical likelihood of the monetary loss is far lower than that of the physical risks for a woman of being assaulted. But again, just giving perspective. I’d presume that as a woman gets to know more about you, she will feel safer sharing. If she doesn’t feel safe yet or accuses you of a double standard, it’s possible you haven’t built up enough trust yet.\n\nWhen you say ‘not much’, can you elaborate? As in you send the name and number and picture she provided or you require to see her ID?\nI also assume you inform your safe person of your location and share your phone tracker just in case?",
            "author": "LVSugarBebe",
            "id": "ge1r7hn",
            "parent_id": "t1_ge1oum2",
            "score": 2,
            "created_utc": 1606666089.0,
            "replies": [
                {
                    "body": ">I presume the statistical likelihood of the monetary loss is far lower than that of the physical risks for a woman of being assaulted.\n\nI don't understand how is that relevant at all, i know  the risk is higher for women but how does that affect the very real risks I also face?\n\n>If she doesn’t feel safe yet or accuses you of a double standard, it’s possible you haven’t built up enough trust yet.\n\nHonestly, I haven't met yet a single woman in either vanilla or sugar dating that think it's ok for a guy to share her info with a safe friend.\n\nApparently, their feelings ARE more important than a guy's safety /s\n\n>or you require to see her ID?\n\nNot really, most times i get more than enough info from social media. For example, you'll be surprised at how many young women use the same handle for SA and their personal IG.\n\n>I also assume you inform your safe person of your location and share your phone tracker just in case?\n\nYup.",
                    "author": "AdAlternative6041",
                    "id": "ge1ssz1",
                    "parent_id": "t1_ge1r7hn",
                    "score": 1,
                    "created_utc": 1606666664.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ok, you're being deliberately provocative - and stupid. Don't tell me I said that blackmail and psychopaths are equal, because I didn't.  That was your misinterpretation..  You sound like you have a serious chip on your shoulder and need to vent.\n\nMy response was to stay safe WHATEVER the venue and not let your guard down.  But you seem to want to make it into a male vs female argument.",
            "author": "anonymoustruth_99",
            "id": "gdwdpnr",
            "parent_id": "t1_gdwcblz",
            "score": -1,
            "created_utc": 1606586522.0,
            "replies": [
                {
                    "body": "I AM THE OP.",
                    "author": "ExExpectations",
                    "id": "gdwdtvu",
                    "parent_id": "t1_gdwdpnr",
                    "score": 2,
                    "created_utc": 1606586560.0,
                    "replies": [
                        {
                            "body": "yes, I just noticed that.  Seems you didn't get the gist that I was sympathetic to your question and suggested that whatever the venue, your safety is important.",
                            "author": "anonymoustruth_99",
                            "id": "gdwe6z6",
                            "parent_id": "t1_gdwdtvu",
                            "score": 5,
                            "created_utc": 1606586679.0,
                            "replies": [
                                {
                                    "body": "First you argue that Airbnb has ID on file. \n\nThen you ignored the fact that hotels have security cameras and staff whereas Airbnb does not. \n\nThen you go and say welllllll Ms., actually the guy have to protect themselves as well blah blah blah. NOWHERE did I say I must know his identity the first time we have intimacy. Or third. Or tenth. \n\nI am POINTING IT OUT TO SBs - that Airbnb is not a safe choice for SBs *when* they don’t know the guys identity yet. There is nothing wrong with going to a hotel and she should insist on that compared to going to an Airbnb.",
                                    "author": "ExExpectations",
                                    "id": "gdwhrid",
                                    "parent_id": "t1_gdwe6z6",
                                    "score": 11,
                                    "created_utc": 1606587875.0,
                                    "replies": []
                                },
                                {
                                    "body": "And - I have no questions. I did not post a **question.**\n\nI posted a SAFETY precaution that SBs should look out for.\n\nIt’s not something I personally thought through previously, and certainly some other SBs have not either.",
                                    "author": "ExExpectations",
                                    "id": "gdwia29",
                                    "parent_id": "t1_gdwe6z6",
                                    "score": 8,
                                    "created_utc": 1606588043.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Mods. \n\nu/LaSirene23 u/azurecole \n\nI believe this constitutes as name calling.",
                    "author": "ExExpectations",
                    "id": "gdwiisu",
                    "parent_id": "t1_gdwdpnr",
                    "score": 0,
                    "created_utc": 1606588121.0,
                    "replies": [
                        {
                            "body": "Mod here.  \n\nI don’t see where a name was called. But it seems like the discussion has gotten personal so I’ll just recommend that you both take a step back and remember we’re all human beings. \n\nGo eat some leftover turkey or something. 🙂",
                            "author": null,
                            "id": "gdwmue0",
                            "parent_id": "t1_gdwiisu",
                            "score": 5,
                            "created_utc": 1606589531.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gdwlmc1",
                            "parent_id": "t1_gdwiisu",
                            "score": -2,
                            "created_utc": 1606589129.0,
                            "replies": [
                                {
                                    "body": "Name calling on here is not allowed. That’s my understanding.",
                                    "author": "ExExpectations",
                                    "id": "gdwlrpl",
                                    "parent_id": "t1_gdwlmc1",
                                    "score": 1,
                                    "created_utc": 1606589176.0,
                                    "replies": [
                                        {
                                            "body": "I'll lock this particular subthread -- it's a little buried but I did see the name.  u/anonymoustruth_99, you'll need to respond without the namecalling.  The rest of the thread got a little heated but it looks like \"mutual combat\"",
                                            "author": "Azurecole",
                                            "id": "gdwnzdt",
                                            "parent_id": "t1_gdwlrpl",
                                            "score": 3,
                                            "created_utc": 1606589913.0,
                                            "replies": [
                                                {
                                                    "body": "Actually, there was no name calling.\n\nThe spirit of my original post was totally misinterpreted by the OP who seemed to over react and fly off on a tangent.  \n\nThe original post was well intentioned and was encouraging all parties to take their first steps cautiously.",
                                                    "author": "anonymoustruth_99",
                                                    "id": "gdws1aq",
                                                    "parent_id": "t1_gdwnzdt",
                                                    "score": -1,
                                                    "created_utc": 1606591540.0,
                                                    "replies": [
                                                        {
                                                            "body": "I think it was \"you're being...stupid\".   I do agree this could be just missed communication.",
                                                            "author": "Azurecole",
                                                            "id": "gdwswvm",
                                                            "parent_id": "t1_gdws1aq",
                                                            "score": 5,
                                                            "created_utc": 1606591846.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Precisely that part.",
                                                                    "author": "ExExpectations",
                                                                    "id": "gdwtn4t",
                                                                    "parent_id": "t1_gdwswvm",
                                                                    "score": 0,
                                                                    "created_utc": 1606592094.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Yes, I figured it was that.  But \"you're being stupid\" is not the same as \"you are stupid\".  And even then we're misquoting what I actually said.",
                                                                    "author": "anonymoustruth_99",
                                                                    "id": "gdwuvat",
                                                                    "parent_id": "t1_gdwswvm",
                                                                    "score": -1,
                                                                    "created_utc": 1606592489.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Saying someone is being stupid is not the same as calling them stupid 😉\n\nIn addition put your big girl pants on and just report a post you don’t agree with rather call the mods to your rescue",
                                            "author": null,
                                            "id": "gdxuo31",
                                            "parent_id": "t1_gdwlrpl",
                                            "score": -4,
                                            "created_utc": 1606604502.0,
                                            "replies": [
                                                {
                                                    "body": "You seem to be totally obsessed with what I am writing or saying on the internet. \n\nI’m so flattered. \n\n🙄🙄",
                                                    "author": "ExExpectations",
                                                    "id": "gdxvpb4",
                                                    "parent_id": "t1_gdxuo31",
                                                    "score": 0,
                                                    "created_utc": 1606604862.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gdwvcs4",
            "parent_id": "t1_gdwcblz",
            "score": -8,
            "created_utc": 1606592650.0,
            "replies": [
                {
                    "body": "What the hell is wrong with you? Are you really that short sighted and unaware? Blackmail could lead to you being raped or murdered or mutilated in unimaginable ways? Have you really thought this through? If you're an SD I really wonder what any woman is even doing being with you!",
                    "author": "blackmagickwoe_man",
                    "id": "gdz787p",
                    "parent_id": "t1_gdwvcs4",
                    "score": 4,
                    "created_utc": 1606624710.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes. I cannot upvote this enough times!!!!!!!! \n\nI connected my PayPal to my Airbnb account. PayPal *also* grandfathered in many accounts and it doesn’t have my full identity/ID or anything connected to it.\n\nPayments can also be made using prepaid credit cards.",
            "author": "ExExpectations",
            "id": "gdyvoiv",
            "parent_id": "t1_gdxxkmt",
            "score": 4,
            "created_utc": 1606618496.0,
            "replies": []
        },
        {
            "body": "So I wonder, u/ExExpectations ... have you tried to book a place yet?  Because having the driver's license is what I expected at minimum!  I'm guessing they'll hit you with this requirement as you go through your first booking process.  Not perfect, of course",
            "author": "Azurecole",
            "id": "gdx53c4",
            "parent_id": "t1_gdx2hrh",
            "score": 1,
            "created_utc": 1606595909.0,
            "replies": [
                {
                    "body": "I’ve not traveled using Airbnb myself in a long time. I did not upload any IDs to my profile and have booked years prior. \n\nThe point of my post was, compared to a hotel: there is NO security cameras in place, NO staff on call, literally no one around except the two people. At a hotel, there are usually other customers too. \n\nAll those are much more important to the SB compared to the ID issue yet somehow y’all get stuck on that part. \n\nLastly, I’ve dealt with Airbnb CS before -\nas another commenter said - not the most awesome CS experiences. It’s also a private entity (IN A PRIVATE HOME) compared to many hotel chains where more visibility are present.\n\nIf a guy insists he always and would rather use Airbnb rather than hotel (even as the first / few times), it’s NOT OKAY. \n\nMy post is to warn other SBs to watch out for this as a red flag.  I was feeling uneasy. But couldn’t pinpoint exactly why. I wouldn’t have thought as thoroughly had it not for another redditor who questioned it as well.",
                    "author": "ExExpectations",
                    "id": "gdx9io1",
                    "parent_id": "t1_gdx53c4",
                    "score": 8,
                    "created_utc": 1606597397.0,
                    "replies": [
                        {
                            "body": "Frankly, I don't know why an SD would ever argue with whatever his brand new SB is most comfortable with.  With the exception of thinking through the covid sitch, it'd be a no brainer for me to do just pick whichever an SB preferred.\n\nIt's a good point about no staff on call,  no cameras, etc.  But for SBs who go to their SD's house -- which is obviously not the recommended way for the first few meetings -- it's the same situation.  To the extent there's any saving grace about the house, it's that since you know where his house is, you can figure out his identity.  That's what we're debating for Airbnb also... can you figure out his identity?  This isn't an arguing with your initial point, but now we want to figure out the answer.",
                            "author": "Azurecole",
                            "id": "gdxaeqk",
                            "parent_id": "t1_gdx9io1",
                            "score": 2,
                            "created_utc": 1606597692.0,
                            "replies": [
                                {
                                    "body": "Residential and property records and taxes etc are public info. Reverse address reveals who lives there / who gets mail there / who owns the place.\n\nI’m pretty sure Airbnb will not release the identity of the person who rented the place to anyone except LE. \n\nCompletely not the same comparison. Still risky but def not on the same level of risk.",
                                    "author": "ExExpectations",
                                    "id": "gdxkfzo",
                                    "parent_id": "t1_gdxaeqk",
                                    "score": 6,
                                    "created_utc": 1606601093.0,
                                    "replies": []
                                },
                                {
                                    "body": "I should clarify, he insists that he rents Airbnb for trysts. He didn’t ask for my preferences. He just said - that’s what I do and that’s where we’d go. \n\nI didn’t say I’d rather a hotel. \n\nBecause after he said that - at that point I already paused and decided not to move ahead with him - regardless of hotel or not. \n\nMaking that kind of comments without discussion (coupled with the fact that he insists I would never know his real last name because he’s “had stalkers” in the past) shows a huge lack of thought for me and my safety.",
                                    "author": "ExExpectations",
                                    "id": "gdxlf4c",
                                    "parent_id": "t1_gdxaeqk",
                                    "score": 5,
                                    "created_utc": 1606601410.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I presume the statistical likelihood of the monetary loss is far lower than that of the physical risks for a woman of being assaulted.\n\nI don't understand how is that relevant at all, i know  the risk is higher for women but how does that affect the very real risks I also face?\n\n>If she doesn’t feel safe yet or accuses you of a double standard, it’s possible you haven’t built up enough trust yet.\n\nHonestly, I haven't met yet a single woman in either vanilla or sugar dating that think it's ok for a guy to share her info with a safe friend.\n\nApparently, their feelings ARE more important than a guy's safety /s\n\n>or you require to see her ID?\n\nNot really, most times i get more than enough info from social media. For example, you'll be surprised at how many young women use the same handle for SA and their personal IG.\n\n>I also assume you inform your safe person of your location and share your phone tracker just in case?\n\nYup.",
            "author": "AdAlternative6041",
            "id": "ge1ssz1",
            "parent_id": "t1_ge1r7hn",
            "score": 1,
            "created_utc": 1606666664.0,
            "replies": []
        },
        {
            "body": "I AM THE OP.",
            "author": "ExExpectations",
            "id": "gdwdtvu",
            "parent_id": "t1_gdwdpnr",
            "score": 2,
            "created_utc": 1606586560.0,
            "replies": [
                {
                    "body": "yes, I just noticed that.  Seems you didn't get the gist that I was sympathetic to your question and suggested that whatever the venue, your safety is important.",
                    "author": "anonymoustruth_99",
                    "id": "gdwe6z6",
                    "parent_id": "t1_gdwdtvu",
                    "score": 5,
                    "created_utc": 1606586679.0,
                    "replies": [
                        {
                            "body": "First you argue that Airbnb has ID on file. \n\nThen you ignored the fact that hotels have security cameras and staff whereas Airbnb does not. \n\nThen you go and say welllllll Ms., actually the guy have to protect themselves as well blah blah blah. NOWHERE did I say I must know his identity the first time we have intimacy. Or third. Or tenth. \n\nI am POINTING IT OUT TO SBs - that Airbnb is not a safe choice for SBs *when* they don’t know the guys identity yet. There is nothing wrong with going to a hotel and she should insist on that compared to going to an Airbnb.",
                            "author": "ExExpectations",
                            "id": "gdwhrid",
                            "parent_id": "t1_gdwe6z6",
                            "score": 11,
                            "created_utc": 1606587875.0,
                            "replies": []
                        },
                        {
                            "body": "And - I have no questions. I did not post a **question.**\n\nI posted a SAFETY precaution that SBs should look out for.\n\nIt’s not something I personally thought through previously, and certainly some other SBs have not either.",
                            "author": "ExExpectations",
                            "id": "gdwia29",
                            "parent_id": "t1_gdwe6z6",
                            "score": 8,
                            "created_utc": 1606588043.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Mods. \n\nu/LaSirene23 u/azurecole \n\nI believe this constitutes as name calling.",
            "author": "ExExpectations",
            "id": "gdwiisu",
            "parent_id": "t1_gdwdpnr",
            "score": 0,
            "created_utc": 1606588121.0,
            "replies": [
                {
                    "body": "Mod here.  \n\nI don’t see where a name was called. But it seems like the discussion has gotten personal so I’ll just recommend that you both take a step back and remember we’re all human beings. \n\nGo eat some leftover turkey or something. 🙂",
                    "author": null,
                    "id": "gdwmue0",
                    "parent_id": "t1_gdwiisu",
                    "score": 5,
                    "created_utc": 1606589531.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gdwlmc1",
                    "parent_id": "t1_gdwiisu",
                    "score": -2,
                    "created_utc": 1606589129.0,
                    "replies": [
                        {
                            "body": "Name calling on here is not allowed. That’s my understanding.",
                            "author": "ExExpectations",
                            "id": "gdwlrpl",
                            "parent_id": "t1_gdwlmc1",
                            "score": 1,
                            "created_utc": 1606589176.0,
                            "replies": [
                                {
                                    "body": "I'll lock this particular subthread -- it's a little buried but I did see the name.  u/anonymoustruth_99, you'll need to respond without the namecalling.  The rest of the thread got a little heated but it looks like \"mutual combat\"",
                                    "author": "Azurecole",
                                    "id": "gdwnzdt",
                                    "parent_id": "t1_gdwlrpl",
                                    "score": 3,
                                    "created_utc": 1606589913.0,
                                    "replies": [
                                        {
                                            "body": "Actually, there was no name calling.\n\nThe spirit of my original post was totally misinterpreted by the OP who seemed to over react and fly off on a tangent.  \n\nThe original post was well intentioned and was encouraging all parties to take their first steps cautiously.",
                                            "author": "anonymoustruth_99",
                                            "id": "gdws1aq",
                                            "parent_id": "t1_gdwnzdt",
                                            "score": -1,
                                            "created_utc": 1606591540.0,
                                            "replies": [
                                                {
                                                    "body": "I think it was \"you're being...stupid\".   I do agree this could be just missed communication.",
                                                    "author": "Azurecole",
                                                    "id": "gdwswvm",
                                                    "parent_id": "t1_gdws1aq",
                                                    "score": 5,
                                                    "created_utc": 1606591846.0,
                                                    "replies": [
                                                        {
                                                            "body": "Precisely that part.",
                                                            "author": "ExExpectations",
                                                            "id": "gdwtn4t",
                                                            "parent_id": "t1_gdwswvm",
                                                            "score": 0,
                                                            "created_utc": 1606592094.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Yes, I figured it was that.  But \"you're being stupid\" is not the same as \"you are stupid\".  And even then we're misquoting what I actually said.",
                                                            "author": "anonymoustruth_99",
                                                            "id": "gdwuvat",
                                                            "parent_id": "t1_gdwswvm",
                                                            "score": -1,
                                                            "created_utc": 1606592489.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Saying someone is being stupid is not the same as calling them stupid 😉\n\nIn addition put your big girl pants on and just report a post you don’t agree with rather call the mods to your rescue",
                                    "author": null,
                                    "id": "gdxuo31",
                                    "parent_id": "t1_gdwlrpl",
                                    "score": -4,
                                    "created_utc": 1606604502.0,
                                    "replies": [
                                        {
                                            "body": "You seem to be totally obsessed with what I am writing or saying on the internet. \n\nI’m so flattered. \n\n🙄🙄",
                                            "author": "ExExpectations",
                                            "id": "gdxvpb4",
                                            "parent_id": "t1_gdxuo31",
                                            "score": 0,
                                            "created_utc": 1606604862.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What the hell is wrong with you? Are you really that short sighted and unaware? Blackmail could lead to you being raped or murdered or mutilated in unimaginable ways? Have you really thought this through? If you're an SD I really wonder what any woman is even doing being with you!",
            "author": "blackmagickwoe_man",
            "id": "gdz787p",
            "parent_id": "t1_gdwvcs4",
            "score": 4,
            "created_utc": 1606624710.0,
            "replies": []
        },
        {
            "body": "I’ve not traveled using Airbnb myself in a long time. I did not upload any IDs to my profile and have booked years prior. \n\nThe point of my post was, compared to a hotel: there is NO security cameras in place, NO staff on call, literally no one around except the two people. At a hotel, there are usually other customers too. \n\nAll those are much more important to the SB compared to the ID issue yet somehow y’all get stuck on that part. \n\nLastly, I’ve dealt with Airbnb CS before -\nas another commenter said - not the most awesome CS experiences. It’s also a private entity (IN A PRIVATE HOME) compared to many hotel chains where more visibility are present.\n\nIf a guy insists he always and would rather use Airbnb rather than hotel (even as the first / few times), it’s NOT OKAY. \n\nMy post is to warn other SBs to watch out for this as a red flag.  I was feeling uneasy. But couldn’t pinpoint exactly why. I wouldn’t have thought as thoroughly had it not for another redditor who questioned it as well.",
            "author": "ExExpectations",
            "id": "gdx9io1",
            "parent_id": "t1_gdx53c4",
            "score": 8,
            "created_utc": 1606597397.0,
            "replies": [
                {
                    "body": "Frankly, I don't know why an SD would ever argue with whatever his brand new SB is most comfortable with.  With the exception of thinking through the covid sitch, it'd be a no brainer for me to do just pick whichever an SB preferred.\n\nIt's a good point about no staff on call,  no cameras, etc.  But for SBs who go to their SD's house -- which is obviously not the recommended way for the first few meetings -- it's the same situation.  To the extent there's any saving grace about the house, it's that since you know where his house is, you can figure out his identity.  That's what we're debating for Airbnb also... can you figure out his identity?  This isn't an arguing with your initial point, but now we want to figure out the answer.",
                    "author": "Azurecole",
                    "id": "gdxaeqk",
                    "parent_id": "t1_gdx9io1",
                    "score": 2,
                    "created_utc": 1606597692.0,
                    "replies": [
                        {
                            "body": "Residential and property records and taxes etc are public info. Reverse address reveals who lives there / who gets mail there / who owns the place.\n\nI’m pretty sure Airbnb will not release the identity of the person who rented the place to anyone except LE. \n\nCompletely not the same comparison. Still risky but def not on the same level of risk.",
                            "author": "ExExpectations",
                            "id": "gdxkfzo",
                            "parent_id": "t1_gdxaeqk",
                            "score": 6,
                            "created_utc": 1606601093.0,
                            "replies": []
                        },
                        {
                            "body": "I should clarify, he insists that he rents Airbnb for trysts. He didn’t ask for my preferences. He just said - that’s what I do and that’s where we’d go. \n\nI didn’t say I’d rather a hotel. \n\nBecause after he said that - at that point I already paused and decided not to move ahead with him - regardless of hotel or not. \n\nMaking that kind of comments without discussion (coupled with the fact that he insists I would never know his real last name because he’s “had stalkers” in the past) shows a huge lack of thought for me and my safety.",
                            "author": "ExExpectations",
                            "id": "gdxlf4c",
                            "parent_id": "t1_gdxaeqk",
                            "score": 5,
                            "created_utc": 1606601410.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "yes, I just noticed that.  Seems you didn't get the gist that I was sympathetic to your question and suggested that whatever the venue, your safety is important.",
            "author": "anonymoustruth_99",
            "id": "gdwe6z6",
            "parent_id": "t1_gdwdtvu",
            "score": 5,
            "created_utc": 1606586679.0,
            "replies": [
                {
                    "body": "First you argue that Airbnb has ID on file. \n\nThen you ignored the fact that hotels have security cameras and staff whereas Airbnb does not. \n\nThen you go and say welllllll Ms., actually the guy have to protect themselves as well blah blah blah. NOWHERE did I say I must know his identity the first time we have intimacy. Or third. Or tenth. \n\nI am POINTING IT OUT TO SBs - that Airbnb is not a safe choice for SBs *when* they don’t know the guys identity yet. There is nothing wrong with going to a hotel and she should insist on that compared to going to an Airbnb.",
                    "author": "ExExpectations",
                    "id": "gdwhrid",
                    "parent_id": "t1_gdwe6z6",
                    "score": 11,
                    "created_utc": 1606587875.0,
                    "replies": []
                },
                {
                    "body": "And - I have no questions. I did not post a **question.**\n\nI posted a SAFETY precaution that SBs should look out for.\n\nIt’s not something I personally thought through previously, and certainly some other SBs have not either.",
                    "author": "ExExpectations",
                    "id": "gdwia29",
                    "parent_id": "t1_gdwe6z6",
                    "score": 8,
                    "created_utc": 1606588043.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Mod here.  \n\nI don’t see where a name was called. But it seems like the discussion has gotten personal so I’ll just recommend that you both take a step back and remember we’re all human beings. \n\nGo eat some leftover turkey or something. 🙂",
            "author": null,
            "id": "gdwmue0",
            "parent_id": "t1_gdwiisu",
            "score": 5,
            "created_utc": 1606589531.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gdwlmc1",
            "parent_id": "t1_gdwiisu",
            "score": -2,
            "created_utc": 1606589129.0,
            "replies": [
                {
                    "body": "Name calling on here is not allowed. That’s my understanding.",
                    "author": "ExExpectations",
                    "id": "gdwlrpl",
                    "parent_id": "t1_gdwlmc1",
                    "score": 1,
                    "created_utc": 1606589176.0,
                    "replies": [
                        {
                            "body": "I'll lock this particular subthread -- it's a little buried but I did see the name.  u/anonymoustruth_99, you'll need to respond without the namecalling.  The rest of the thread got a little heated but it looks like \"mutual combat\"",
                            "author": "Azurecole",
                            "id": "gdwnzdt",
                            "parent_id": "t1_gdwlrpl",
                            "score": 3,
                            "created_utc": 1606589913.0,
                            "replies": [
                                {
                                    "body": "Actually, there was no name calling.\n\nThe spirit of my original post was totally misinterpreted by the OP who seemed to over react and fly off on a tangent.  \n\nThe original post was well intentioned and was encouraging all parties to take their first steps cautiously.",
                                    "author": "anonymoustruth_99",
                                    "id": "gdws1aq",
                                    "parent_id": "t1_gdwnzdt",
                                    "score": -1,
                                    "created_utc": 1606591540.0,
                                    "replies": [
                                        {
                                            "body": "I think it was \"you're being...stupid\".   I do agree this could be just missed communication.",
                                            "author": "Azurecole",
                                            "id": "gdwswvm",
                                            "parent_id": "t1_gdws1aq",
                                            "score": 5,
                                            "created_utc": 1606591846.0,
                                            "replies": [
                                                {
                                                    "body": "Precisely that part.",
                                                    "author": "ExExpectations",
                                                    "id": "gdwtn4t",
                                                    "parent_id": "t1_gdwswvm",
                                                    "score": 0,
                                                    "created_utc": 1606592094.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Yes, I figured it was that.  But \"you're being stupid\" is not the same as \"you are stupid\".  And even then we're misquoting what I actually said.",
                                                    "author": "anonymoustruth_99",
                                                    "id": "gdwuvat",
                                                    "parent_id": "t1_gdwswvm",
                                                    "score": -1,
                                                    "created_utc": 1606592489.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Saying someone is being stupid is not the same as calling them stupid 😉\n\nIn addition put your big girl pants on and just report a post you don’t agree with rather call the mods to your rescue",
                            "author": null,
                            "id": "gdxuo31",
                            "parent_id": "t1_gdwlrpl",
                            "score": -4,
                            "created_utc": 1606604502.0,
                            "replies": [
                                {
                                    "body": "You seem to be totally obsessed with what I am writing or saying on the internet. \n\nI’m so flattered. \n\n🙄🙄",
                                    "author": "ExExpectations",
                                    "id": "gdxvpb4",
                                    "parent_id": "t1_gdxuo31",
                                    "score": 0,
                                    "created_utc": 1606604862.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Frankly, I don't know why an SD would ever argue with whatever his brand new SB is most comfortable with.  With the exception of thinking through the covid sitch, it'd be a no brainer for me to do just pick whichever an SB preferred.\n\nIt's a good point about no staff on call,  no cameras, etc.  But for SBs who go to their SD's house -- which is obviously not the recommended way for the first few meetings -- it's the same situation.  To the extent there's any saving grace about the house, it's that since you know where his house is, you can figure out his identity.  That's what we're debating for Airbnb also... can you figure out his identity?  This isn't an arguing with your initial point, but now we want to figure out the answer.",
            "author": "Azurecole",
            "id": "gdxaeqk",
            "parent_id": "t1_gdx9io1",
            "score": 2,
            "created_utc": 1606597692.0,
            "replies": [
                {
                    "body": "Residential and property records and taxes etc are public info. Reverse address reveals who lives there / who gets mail there / who owns the place.\n\nI’m pretty sure Airbnb will not release the identity of the person who rented the place to anyone except LE. \n\nCompletely not the same comparison. Still risky but def not on the same level of risk.",
                    "author": "ExExpectations",
                    "id": "gdxkfzo",
                    "parent_id": "t1_gdxaeqk",
                    "score": 6,
                    "created_utc": 1606601093.0,
                    "replies": []
                },
                {
                    "body": "I should clarify, he insists that he rents Airbnb for trysts. He didn’t ask for my preferences. He just said - that’s what I do and that’s where we’d go. \n\nI didn’t say I’d rather a hotel. \n\nBecause after he said that - at that point I already paused and decided not to move ahead with him - regardless of hotel or not. \n\nMaking that kind of comments without discussion (coupled with the fact that he insists I would never know his real last name because he’s “had stalkers” in the past) shows a huge lack of thought for me and my safety.",
                    "author": "ExExpectations",
                    "id": "gdxlf4c",
                    "parent_id": "t1_gdxaeqk",
                    "score": 5,
                    "created_utc": 1606601410.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "First you argue that Airbnb has ID on file. \n\nThen you ignored the fact that hotels have security cameras and staff whereas Airbnb does not. \n\nThen you go and say welllllll Ms., actually the guy have to protect themselves as well blah blah blah. NOWHERE did I say I must know his identity the first time we have intimacy. Or third. Or tenth. \n\nI am POINTING IT OUT TO SBs - that Airbnb is not a safe choice for SBs *when* they don’t know the guys identity yet. There is nothing wrong with going to a hotel and she should insist on that compared to going to an Airbnb.",
            "author": "ExExpectations",
            "id": "gdwhrid",
            "parent_id": "t1_gdwe6z6",
            "score": 11,
            "created_utc": 1606587875.0,
            "replies": []
        },
        {
            "body": "And - I have no questions. I did not post a **question.**\n\nI posted a SAFETY precaution that SBs should look out for.\n\nIt’s not something I personally thought through previously, and certainly some other SBs have not either.",
            "author": "ExExpectations",
            "id": "gdwia29",
            "parent_id": "t1_gdwe6z6",
            "score": 8,
            "created_utc": 1606588043.0,
            "replies": []
        },
        {
            "body": "Name calling on here is not allowed. That’s my understanding.",
            "author": "ExExpectations",
            "id": "gdwlrpl",
            "parent_id": "t1_gdwlmc1",
            "score": 1,
            "created_utc": 1606589176.0,
            "replies": [
                {
                    "body": "I'll lock this particular subthread -- it's a little buried but I did see the name.  u/anonymoustruth_99, you'll need to respond without the namecalling.  The rest of the thread got a little heated but it looks like \"mutual combat\"",
                    "author": "Azurecole",
                    "id": "gdwnzdt",
                    "parent_id": "t1_gdwlrpl",
                    "score": 3,
                    "created_utc": 1606589913.0,
                    "replies": [
                        {
                            "body": "Actually, there was no name calling.\n\nThe spirit of my original post was totally misinterpreted by the OP who seemed to over react and fly off on a tangent.  \n\nThe original post was well intentioned and was encouraging all parties to take their first steps cautiously.",
                            "author": "anonymoustruth_99",
                            "id": "gdws1aq",
                            "parent_id": "t1_gdwnzdt",
                            "score": -1,
                            "created_utc": 1606591540.0,
                            "replies": [
                                {
                                    "body": "I think it was \"you're being...stupid\".   I do agree this could be just missed communication.",
                                    "author": "Azurecole",
                                    "id": "gdwswvm",
                                    "parent_id": "t1_gdws1aq",
                                    "score": 5,
                                    "created_utc": 1606591846.0,
                                    "replies": [
                                        {
                                            "body": "Precisely that part.",
                                            "author": "ExExpectations",
                                            "id": "gdwtn4t",
                                            "parent_id": "t1_gdwswvm",
                                            "score": 0,
                                            "created_utc": 1606592094.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Yes, I figured it was that.  But \"you're being stupid\" is not the same as \"you are stupid\".  And even then we're misquoting what I actually said.",
                                            "author": "anonymoustruth_99",
                                            "id": "gdwuvat",
                                            "parent_id": "t1_gdwswvm",
                                            "score": -1,
                                            "created_utc": 1606592489.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Saying someone is being stupid is not the same as calling them stupid 😉\n\nIn addition put your big girl pants on and just report a post you don’t agree with rather call the mods to your rescue",
                    "author": null,
                    "id": "gdxuo31",
                    "parent_id": "t1_gdwlrpl",
                    "score": -4,
                    "created_utc": 1606604502.0,
                    "replies": [
                        {
                            "body": "You seem to be totally obsessed with what I am writing or saying on the internet. \n\nI’m so flattered. \n\n🙄🙄",
                            "author": "ExExpectations",
                            "id": "gdxvpb4",
                            "parent_id": "t1_gdxuo31",
                            "score": 0,
                            "created_utc": 1606604862.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Residential and property records and taxes etc are public info. Reverse address reveals who lives there / who gets mail there / who owns the place.\n\nI’m pretty sure Airbnb will not release the identity of the person who rented the place to anyone except LE. \n\nCompletely not the same comparison. Still risky but def not on the same level of risk.",
            "author": "ExExpectations",
            "id": "gdxkfzo",
            "parent_id": "t1_gdxaeqk",
            "score": 6,
            "created_utc": 1606601093.0,
            "replies": []
        },
        {
            "body": "I should clarify, he insists that he rents Airbnb for trysts. He didn’t ask for my preferences. He just said - that’s what I do and that’s where we’d go. \n\nI didn’t say I’d rather a hotel. \n\nBecause after he said that - at that point I already paused and decided not to move ahead with him - regardless of hotel or not. \n\nMaking that kind of comments without discussion (coupled with the fact that he insists I would never know his real last name because he’s “had stalkers” in the past) shows a huge lack of thought for me and my safety.",
            "author": "ExExpectations",
            "id": "gdxlf4c",
            "parent_id": "t1_gdxaeqk",
            "score": 5,
            "created_utc": 1606601410.0,
            "replies": []
        },
        {
            "body": "I'll lock this particular subthread -- it's a little buried but I did see the name.  u/anonymoustruth_99, you'll need to respond without the namecalling.  The rest of the thread got a little heated but it looks like \"mutual combat\"",
            "author": "Azurecole",
            "id": "gdwnzdt",
            "parent_id": "t1_gdwlrpl",
            "score": 3,
            "created_utc": 1606589913.0,
            "replies": [
                {
                    "body": "Actually, there was no name calling.\n\nThe spirit of my original post was totally misinterpreted by the OP who seemed to over react and fly off on a tangent.  \n\nThe original post was well intentioned and was encouraging all parties to take their first steps cautiously.",
                    "author": "anonymoustruth_99",
                    "id": "gdws1aq",
                    "parent_id": "t1_gdwnzdt",
                    "score": -1,
                    "created_utc": 1606591540.0,
                    "replies": [
                        {
                            "body": "I think it was \"you're being...stupid\".   I do agree this could be just missed communication.",
                            "author": "Azurecole",
                            "id": "gdwswvm",
                            "parent_id": "t1_gdws1aq",
                            "score": 5,
                            "created_utc": 1606591846.0,
                            "replies": [
                                {
                                    "body": "Precisely that part.",
                                    "author": "ExExpectations",
                                    "id": "gdwtn4t",
                                    "parent_id": "t1_gdwswvm",
                                    "score": 0,
                                    "created_utc": 1606592094.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yes, I figured it was that.  But \"you're being stupid\" is not the same as \"you are stupid\".  And even then we're misquoting what I actually said.",
                                    "author": "anonymoustruth_99",
                                    "id": "gdwuvat",
                                    "parent_id": "t1_gdwswvm",
                                    "score": -1,
                                    "created_utc": 1606592489.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Saying someone is being stupid is not the same as calling them stupid 😉\n\nIn addition put your big girl pants on and just report a post you don’t agree with rather call the mods to your rescue",
            "author": null,
            "id": "gdxuo31",
            "parent_id": "t1_gdwlrpl",
            "score": -4,
            "created_utc": 1606604502.0,
            "replies": [
                {
                    "body": "You seem to be totally obsessed with what I am writing or saying on the internet. \n\nI’m so flattered. \n\n🙄🙄",
                    "author": "ExExpectations",
                    "id": "gdxvpb4",
                    "parent_id": "t1_gdxuo31",
                    "score": 0,
                    "created_utc": 1606604862.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Actually, there was no name calling.\n\nThe spirit of my original post was totally misinterpreted by the OP who seemed to over react and fly off on a tangent.  \n\nThe original post was well intentioned and was encouraging all parties to take their first steps cautiously.",
            "author": "anonymoustruth_99",
            "id": "gdws1aq",
            "parent_id": "t1_gdwnzdt",
            "score": -1,
            "created_utc": 1606591540.0,
            "replies": [
                {
                    "body": "I think it was \"you're being...stupid\".   I do agree this could be just missed communication.",
                    "author": "Azurecole",
                    "id": "gdwswvm",
                    "parent_id": "t1_gdws1aq",
                    "score": 5,
                    "created_utc": 1606591846.0,
                    "replies": [
                        {
                            "body": "Precisely that part.",
                            "author": "ExExpectations",
                            "id": "gdwtn4t",
                            "parent_id": "t1_gdwswvm",
                            "score": 0,
                            "created_utc": 1606592094.0,
                            "replies": []
                        },
                        {
                            "body": "Yes, I figured it was that.  But \"you're being stupid\" is not the same as \"you are stupid\".  And even then we're misquoting what I actually said.",
                            "author": "anonymoustruth_99",
                            "id": "gdwuvat",
                            "parent_id": "t1_gdwswvm",
                            "score": -1,
                            "created_utc": 1606592489.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You seem to be totally obsessed with what I am writing or saying on the internet. \n\nI’m so flattered. \n\n🙄🙄",
            "author": "ExExpectations",
            "id": "gdxvpb4",
            "parent_id": "t1_gdxuo31",
            "score": 0,
            "created_utc": 1606604862.0,
            "replies": []
        },
        {
            "body": "I think it was \"you're being...stupid\".   I do agree this could be just missed communication.",
            "author": "Azurecole",
            "id": "gdwswvm",
            "parent_id": "t1_gdws1aq",
            "score": 5,
            "created_utc": 1606591846.0,
            "replies": [
                {
                    "body": "Precisely that part.",
                    "author": "ExExpectations",
                    "id": "gdwtn4t",
                    "parent_id": "t1_gdwswvm",
                    "score": 0,
                    "created_utc": 1606592094.0,
                    "replies": []
                },
                {
                    "body": "Yes, I figured it was that.  But \"you're being stupid\" is not the same as \"you are stupid\".  And even then we're misquoting what I actually said.",
                    "author": "anonymoustruth_99",
                    "id": "gdwuvat",
                    "parent_id": "t1_gdwswvm",
                    "score": -1,
                    "created_utc": 1606592489.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Precisely that part.",
            "author": "ExExpectations",
            "id": "gdwtn4t",
            "parent_id": "t1_gdwswvm",
            "score": 0,
            "created_utc": 1606592094.0,
            "replies": []
        },
        {
            "body": "Yes, I figured it was that.  But \"you're being stupid\" is not the same as \"you are stupid\".  And even then we're misquoting what I actually said.",
            "author": "anonymoustruth_99",
            "id": "gdwuvat",
            "parent_id": "t1_gdwswvm",
            "score": -1,
            "created_utc": 1606592489.0,
            "replies": []
        }
    ]
}