{
    "title": "Rinsing vs Rejection",
    "post_id": "lqp33b",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lqp33b/rinsing_vs_rejection/",
    "author": "SwimmingInSugar",
    "body": "There's been a lot of heated discussion in this forum the last couple days. Overall this feels healthy bcs it helps us surface some of the core issues within the sugar construct. Specifically it has me thinking about the difference between getting rinsed and getting rejected.\n\nLet's try to define terms:\n\n1. Rinser: Specific intent to mislead in order to secure $$$ w/o intimacy\n2. Rejection: (pot)SB starts the date with an open mind, but at some point decides she is not interested in intimacy. and (pot)SB actualizes her preference (no sex) by avoiding intimacy  \n\nI definitely understand how an SD would be upset about getting rinsed - you're getting lied to! And that sucks!\n\nAnd I also understand how an SD would be upset about getting rejected. bcs... it hurts emotionally to have someone say they're not interested in you sexually. Maybe doubly so in this context where there's often a latent sense that $$$ = intimacy. \n\nSo it's fine to be upset in both cases. But there's also a big difference imo:\n\n\\- When you get rinsed, it's perfectly fine to be upset \\_with the SB\\_!\n\n\\- When you get rejected, it's fine to be upset, but not at the SB. The SB just exercised her freedom of choice. and chose not to be intimate with you.\n\nBoth situations offer an opportunity for self-reflection. What might I have done that opened the door to getting taking advantage of by a rinser? And with rejection we might ask, What choices did I make / what behaviors of mine may have encouraged her to say No?\n\nAnd we use those moments as an opportunity to learn about ourselves. about women. about sugar. about life.\n\nIn terms of the money: If you don't have the financial means to take a few Losses here and there, then you're probably not in the right place. \n\nIn terms of consent: SD's, let's get to the heart of this - do you really want to be intimate with an SB who is going against her own desire/intuition? who is forcing herself to be intimate with you? Whether it's bcs of social pressure, financial pressure, people-pleasing, ... whatever. \n\n\\_SDs\\_ should be promoting full + free consent. And setting up the whole relationship to support that. The financial incentives should support that. Communication should support that. Everything about our interactions with (pot)SB should support that.\n\nGranted, we won't do it perfectly. But that can should be our goal (imo). \n\nOtherwise, and be honest, you just want an escort/sex-slave.\n\n\\----\n\nThis is already long, but let's remind ourselves why we're here. What sugar is about. and how it's different than escort-life (bcs this isn't ELF...) \n\nI think there's a core agreement within SLF that sugar **≠** escort. That's a bright line. \n\nAnd what exactly separates the two? \n\n\\- Escort: Exchange of money for sexual activity\n\n\\- Sugar: Exchange of value ($, gifts, TBD) for time/attention. And, as defined by the participants, an \\_opportunity\\_ for sexual activity\n\nWith an escort, sex is essentially guaranteed\n\nWith sugar, there's an \\*opportunity\\* for sex. but the position on the consent spectrum (for the SB) is very different than an escort. \n\nThis can be beneficial for both parties: \n\nSBs are more closely aligned with their broader, true preferences\n\nSDs get a different experience bcs it's a more honest consensual relationship. and that opens the door to a much richer world of interactions. If you're sugaring, presumably that's what you want! A richer relationship than we can get via escort-life. but not vanilla either.\n\nIs sugar perfect? Probably not for everyone. Probably not for people who never want to encounter rejection. \n\nSo if you're one of those SDs who always wants to hear yes, then be honest with yourself: Sugar may not be the right thing for me! and stop blaming the SBs...",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lqp33b/rinsing_vs_rejection/",
    "score": 101,
    "upvote_ratio": 0.92,
    "created_utc": 1614104334.0,
    "num_comments": 96,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "A good way to avoid being rinsed seems to be sticking to a lowkey m&g. I always make it clear a casual coffee date with a time constraint is fine for both our comfort in case we don't click, some guys really want to go have a fancy dinner instead. In this case, SDs just have to accept if the arrangement doesn't go ahead not to get mad because \"I paid for this dinner\" that I didn't even ask for lol.",
            "author": "DesertShae",
            "id": "gohnlgm",
            "parent_id": "t3_lqp33b",
            "score": 30,
            "created_utc": 1614105140.0,
            "replies": [
                {
                    "body": "I dont think any sd would worry about paying for dinner and getting rejected.",
                    "author": "wb19081908",
                    "id": "gojp2gs",
                    "parent_id": "t1_gohnlgm",
                    "score": 9,
                    "created_utc": 1614139539.0,
                    "replies": [
                        {
                            "body": "Bingo",
                            "author": null,
                            "id": "gokzy7n",
                            "parent_id": "t1_gojp2gs",
                            "score": 2,
                            "created_utc": 1614175666.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I had a POT SB who was brand new to the bowl. Never done this before. First M&G went well then we agreed the next date would be an intimate date. On the intimate date she came over and we kissed, touched etc. but she just couldn’t get into it. After a few drinks she said she had to go and we never had sex. She didn’t want a PPM since we didn’t have sex. \n\nI thought the whole thing was weird because she had been very sex forward with me beforehand: sending me nude pics unprompted, sexting, naughty talk etc. \nShe did mention during the M&G that she had issues around intimacy because of something that happened in her past. So I just figured it was due to those issues that she didn’t feel comfortable having sex with me. \n\nWe kept in touch occasionally and she actually just reached out to me yesterday and said she was sorry, she thought she could put herself out there for money but she just couldn’t do it. I told her not to worry about it I understand, it can be tough especially when you’re brand new to this. She then suggested we have drinks this week and catch up. She doesn’t want to do the sugar thing anymore lol. \n\nLong story short, I was fine with her rejecting sex. I never put any pressure on her. And we remained friends and now we will meet for drinks lol.",
            "author": "Fun_Focus8159",
            "id": "gohpwrv",
            "parent_id": "t3_lqp33b",
            "score": 40,
            "created_utc": 1614106123.0,
            "replies": [
                {
                    "body": "Funny, I had the opposite story: I paid the full PPM and didn't want sex. the girl completely freaked out, I think it was her first rejection.",
                    "author": "JeaneyBowl",
                    "id": "gohu6lp",
                    "parent_id": "t1_gohpwrv",
                    "score": 15,
                    "created_utc": 1614107975.0,
                    "replies": [
                        {
                            "body": "Lol just curious, why didn’t you want sex.",
                            "author": "Fun_Focus8159",
                            "id": "gohubq4",
                            "parent_id": "t1_gohu6lp",
                            "score": 5,
                            "created_utc": 1614108036.0,
                            "replies": [
                                {
                                    "body": "I was too drunk to perform, i.e. had a single glass of wine.",
                                    "author": "JeaneyBowl",
                                    "id": "gohx5kl",
                                    "parent_id": "t1_gohubq4",
                                    "score": 11,
                                    "created_utc": 1614109275.0,
                                    "replies": [
                                        {
                                            "body": "I hear you man. I usually prefer having sex before drinking because I perform better also. I tell all my sexual partners this. However, of course they all want to have a few drinks before getting intimate. If we’ve been drinking all night then I’ll just want to go to bed, and no sex lol. It’s the SB’s that usually want to have sex haha. \n\nSame thing happened to me recently with one of my SB’s. She came over and I made her dinner. Had lots of wine. She started to get frisky and wanted to have sex but I wasn’t in the mood after a big dinner and lots of wine. She seemed a little offended and later told me she felt like I didn’t want her anymore. I said no I was just super full and drunk lol!",
                                            "author": "Fun_Focus8159",
                                            "id": "gohyhvs",
                                            "parent_id": "t1_gohx5kl",
                                            "score": 10,
                                            "created_utc": 1614109859.0,
                                            "replies": [
                                                {
                                                    "body": "I dont drink (but used to). Honestly a large meal and a bunch of alcohol does nothing but diminish my libido.",
                                                    "author": null,
                                                    "id": "goi0ftb",
                                                    "parent_id": "t1_gohyhvs",
                                                    "score": 8,
                                                    "created_utc": 1614110711.0,
                                                    "replies": [
                                                        {
                                                            "body": "Amen brother same here. Who wants to have sex with a full stomach! Feels weird.",
                                                            "author": "Fun_Focus8159",
                                                            "id": "goi0uaj",
                                                            "parent_id": "t1_goi0ftb",
                                                            "score": 8,
                                                            "created_utc": 1614110886.0,
                                                            "replies": [
                                                                {
                                                                    "body": "c'mon all the sloshing noises and ear belching is sexy!",
                                                                    "author": "idk_letstry",
                                                                    "id": "golzag2",
                                                                    "parent_id": "t1_goi0uaj",
                                                                    "score": 1,
                                                                    "created_utc": 1614190963.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Surely if you truly wanted to reiterate to her that the sex was not the sole purpose of the meeting, you could've given her the PPM irrespective and explained that sugaring isn't about selling sex?",
                    "author": "AvenueLane96",
                    "id": "goj5ly9",
                    "parent_id": "t1_gohpwrv",
                    "score": 3,
                    "created_utc": 1614129444.0,
                    "replies": [
                        {
                            "body": "She didn’t want the PPM. She said she didn’t feel right since she didn’t feel comfortable having sex.",
                            "author": "Fun_Focus8159",
                            "id": "goj64pb",
                            "parent_id": "t1_goj5ly9",
                            "score": 1,
                            "created_utc": 1614129716.0,
                            "replies": [
                                {
                                    "body": "Ahh i see. Sounds like she didn't know what she was going into.",
                                    "author": "AvenueLane96",
                                    "id": "goj6tln",
                                    "parent_id": "t1_goj64pb",
                                    "score": 2,
                                    "created_utc": 1614130078.0,
                                    "replies": [
                                        {
                                            "body": "Yea for sure. It was her first time doing anything like that before. She was one of those that works full time and doesn’t need/want the money. For her it was more about having fun and sexual experiences with an older man.",
                                            "author": "Fun_Focus8159",
                                            "id": "goj7rp1",
                                            "parent_id": "t1_goj6tln",
                                            "score": 1,
                                            "created_utc": 1614130565.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Dude.... I could tell EXACTLY the same story. All of this happened to me also, down to the idioms she used to explain herself.. she talked about \"just couldn't do it\" and about not doing the sugar thing, and she also wants to be friends and go for drinks. She was also very forward with sending sexy pics, sexting, etc. It's eerie to read this, as I could have written the exact same story.\n\nIs she by any chance Welsh?",
                    "author": "RockyLeal",
                    "id": "gojczsd",
                    "parent_id": "t1_gohpwrv",
                    "score": 2,
                    "created_utc": 1614133266.0,
                    "replies": [
                        {
                            "body": "Lol no. I’m in Texas and she’s from the US. \n\nI imagine this happens quite a bit with women new to the bowel who think they can be intimate for a PPM, but when it comes down to actually doing it, they get scared off.",
                            "author": "Fun_Focus8159",
                            "id": "gojdiqt",
                            "parent_id": "t1_gojczsd",
                            "score": 1,
                            "created_utc": 1614133531.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Many times I've paid the ppm and she then gets cold feet or during sex feels uncomfortable and wants to leave.\n\nI still let them keep the allownance and move on",
                    "author": "wb19081908",
                    "id": "gojp8o3",
                    "parent_id": "t1_gohpwrv",
                    "score": 2,
                    "created_utc": 1614139638.0,
                    "replies": [
                        {
                            "body": "I always pay PPM after intimacy is over and right before she leaves.",
                            "author": "Fun_Focus8159",
                            "id": "gojq0c7",
                            "parent_id": "t1_gojp8o3",
                            "score": 1,
                            "created_utc": 1614140087.0,
                            "replies": [
                                {
                                    "body": "Im willing to risk her not having sex to make them feel.comfortable.\n\nIts a test if they do it i just never see them.again",
                                    "author": "wb19081908",
                                    "id": "gojt7zh",
                                    "parent_id": "t1_gojq0c7",
                                    "score": 6,
                                    "created_utc": 1614141994.0,
                                    "replies": [
                                        {
                                            "body": "> Im willing to risk her not having sex to make them feel.comfortable.\n> \n> Its a test if they do it i just never see them.again\n\nI've done this and feel the exact same way. I've had them get cold feet (total of twice) and walk before. Whatever. Their loss. \n\nTells me all I needed to know about them when they kept the money :-) \n\nInterestingly enough I had both want to \"try again\" and I told them both not interested. \n\nFool me once, shame on you. Fool me twice? Shame on me.",
                                            "author": "SDRippington",
                                            "id": "gorxs8b",
                                            "parent_id": "t1_gojt7zh",
                                            "score": 2,
                                            "created_utc": 1614300593.0,
                                            "replies": [
                                                {
                                                    "body": "Yeh sometimes they message next week desperate foe money and I just gjost them.  I let anyone tip me off just once.",
                                                    "author": "wb19081908",
                                                    "id": "gos3wb6",
                                                    "parent_id": "t1_gorxs8b",
                                                    "score": 1,
                                                    "created_utc": 1614303652.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I’ve never seen an uncomfortable SB, and all of mine have always received it  at the end of the date, and most of them initiated intimacy",
                                            "author": null,
                                            "id": "gol2odi",
                                            "parent_id": "t1_gojt7zh",
                                            "score": 0,
                                            "created_utc": 1614177078.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gohqjap",
            "parent_id": "t3_lqp33b",
            "score": 19,
            "created_utc": 1614106391.0,
            "replies": [
                {
                    "body": ">I don't think \\*sugaring\\* means what you think it means anymore...it means much, much less\n\nYes. And it's tragic and unfortunate.",
                    "author": "ExExpectations",
                    "id": "gohucfk",
                    "parent_id": "t1_gohqjap",
                    "score": 12,
                    "created_utc": 1614108045.0,
                    "replies": []
                },
                {
                    "body": "Capitalism, baby! ::finger guns::\n\nBut yeah, pretty much what you said. Good, bad, or indifferent, the word itself means something else now.",
                    "author": "Intrepid_Egg_7722",
                    "id": "goj74hq",
                    "parent_id": "t1_gohqjap",
                    "score": 2,
                    "created_utc": 1614130234.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I just had a meet last night and I just wasn't feeling a good vibe from him. He kept making comments that made me feel as though he was really looking for an escort and that he doesn't understand the different, ironically exactly what you posted. Ultimately I politely declined and walked. Time wasted but for me there is no one that is going to make me disrespect myself or undervalue my self worth because they don't really respect or understand the lifestyle.",
            "author": "Affectionate_Water00",
            "id": "goi7gcm",
            "parent_id": "t3_lqp33b",
            "score": 16,
            "created_utc": 1614113420.0,
            "replies": [
                {
                    "body": "> Time wasted but for me there is no one that is going to make me disrespect myself or undervalue my self worth because they don't really respect or understand the lifestyle.\n\nWell said.",
                    "author": "SDRippington",
                    "id": "gorxykj",
                    "parent_id": "t1_goi7gcm",
                    "score": 2,
                    "created_utc": 1614300679.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I really hate the term rinsing... it’s like those vanilla daters who feel like a girl “used him for dinner” if she doesn’t put out after a few dates, ... when you are dating, sex is always a possibility but never a guarantee ... but guess what ? you still have to pay for the date ...  but that’s why guys these days opt for bs coffee dates or walks in the park 🤣",
            "author": "PsychologicalMud9673",
            "id": "gojtyni",
            "parent_id": "t3_lqp33b",
            "score": 6,
            "created_utc": 1614142450.0,
            "replies": [
                {
                    "body": "> I really hate the term rinsing...\n\nIf a woman is up front and honest about being indecisive about having sex with you, and ultimately decides not to - well, that's on you if you wanted to keep on trying. That's your own damn fault for not following the \"It's either Fuck Yes or It's No\" dating advice. \n\nIf however a woman is leading you on with the promise of sex, but has literally no intention of following through? It's **Rinsing**. You want us to just call it fraud? Is that better? \n\n> but that’s why guys these days opt for bs coffee dates or walks in the park 🤣\n\nHate the game, baby, not the player. They did it to themselves. \n\nAfter the number of times I've been catfished? I will always leave time open for a longer date in a better venue after the M&G, but otherwise it's the landscape now. \n\nFeel free to hold out for better, that's always totally your choice - but don't throw shade on someone doing things differently and still being wildly successful :-)",
                    "author": "SDRippington",
                    "id": "goryffv",
                    "parent_id": "t1_gojtyni",
                    "score": 3,
                    "created_utc": 1614300904.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gohtoki",
            "parent_id": "t3_lqp33b",
            "score": 19,
            "created_utc": 1614107755.0,
            "replies": [
                {
                    "body": "Did you first write fish in a barrel and then thought better of it and changed it to a pond?",
                    "author": "Diditall4thecookie",
                    "id": "goj2m0e",
                    "parent_id": "t1_gohtoki",
                    "score": 1,
                    "created_utc": 1614127883.0,
                    "replies": [
                        {
                            "body": "Who fishes in a barrel and not a pond",
                            "author": "oneangstybiscuit",
                            "id": "gojw500",
                            "parent_id": "t1_goj2m0e",
                            "score": 1,
                            "created_utc": 1614143834.0,
                            "replies": [
                                {
                                    "body": "You’re right. Yiu shoot the fish in the barrel and fish the ones in the pond.",
                                    "author": "Diditall4thecookie",
                                    "id": "goknntf",
                                    "parent_id": "t1_gojw500",
                                    "score": 1,
                                    "created_utc": 1614167752.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "THANK YOU FOR THIS.",
            "author": "longrunfun",
            "id": "goi93b4",
            "parent_id": "t3_lqp33b",
            "score": 4,
            "created_utc": 1614114050.0,
            "replies": []
        },
        {
            "body": "The problem is for guys that there is no way to differentiate the two, which goes back to the whole “ppm /allowance starts with intimacy” thing.",
            "author": "throwawaysugar1980",
            "id": "gohu46z",
            "parent_id": "t3_lqp33b",
            "score": 5,
            "created_utc": 1614107946.0,
            "replies": []
        },
        {
            "body": "They will gladly take your money even if they aren’t interested. An actual honest SB will reject your money if she’s rejecting you.",
            "author": "UnearthlyDinosaur",
            "id": "gohocnp",
            "parent_id": "t3_lqp33b",
            "score": 11,
            "created_utc": 1614105459.0,
            "replies": []
        },
        {
            "body": "SB should actualize her preference by not dating you further, or at least not taking a ppm while she figures it out.",
            "author": "ChapterRelative",
            "id": "gohn9a6",
            "parent_id": "t3_lqp33b",
            "score": 8,
            "created_utc": 1614104995.0,
            "replies": [
                {
                    "body": "Aren't we all figuring out our preferences as we go? \n\nNone of us know the future. We're not making ironclad promises about every aspect of our future performance... bcs we can act in good faith and be uncertain about what we'll want to do in the moment. \n\nThat's just being a human.\n\n\\---\n\nIf your policy is that you refuse to pay unless there's intimacy, that's your choice. If I were an SB that would be an absolute next. \n\nEveryone gets to choose what's right for them, but I'd have no interest.\n\n\\---\n\nMy feeling: I'm paying for her time. and the opportunity to have great things happen. It takes time to text with a POT SD, it takes time to do a M&G, it takes time to get ready - to shave, do hair+makeup, drive, etc..., it takes mental energy for her to show up and be engaging and pay attention to YOU. \n\nBut you only want to hand over money if there's sex... \n\nYou do you. But amongst financially successful people who value their time, I don't understand why so many SDs are so vehemently resistant to paying for non-intimate dates. \n\nC'mon... A lot of us charge by the hour. or 15min increments even. And we charge \\*a lot\\*. And then we're refusing to compensate SBs bcs ... we didn't get absolutely everything we had hoped for.\n\nCry me a river. \n\nMy preference: Be a gentlemen. Be generous.",
                    "author": "SwimmingInSugar",
                    "id": "goi5li9",
                    "parent_id": "t1_gohn9a6",
                    "score": 21,
                    "created_utc": 1614112713.0,
                    "replies": [
                        {
                            "body": "Yes. This. All of it.",
                            "author": "FoxyFreckles1989",
                            "id": "goid59o",
                            "parent_id": "t1_goi5li9",
                            "score": 11,
                            "created_utc": 1614115643.0,
                            "replies": []
                        },
                        {
                            "body": "This!  If guys want a sexual guarantee so long as they aren't diseased or dangerous there is a whole population of professional workers they can hire.\n\nIf they want the chance of authenticity, mutual attractive, mutual feelings then you invest, reward vs risk.",
                            "author": "sugarsenior2",
                            "id": "goigp25",
                            "parent_id": "t1_goi5li9",
                            "score": 8,
                            "created_utc": 1614117237.0,
                            "replies": [
                                {
                                    "body": "Unfortunately most -SDs- don’t see it that way 💔",
                                    "author": "Beachbabe1024",
                                    "id": "gom01w8",
                                    "parent_id": "t1_goigp25",
                                    "score": 3,
                                    "created_utc": 1614191243.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Thank you 🙏🏼",
                            "author": "Beachbabe1024",
                            "id": "golzhtb",
                            "parent_id": "t1_goi5li9",
                            "score": 3,
                            "created_utc": 1614191039.0,
                            "replies": []
                        },
                        {
                            "body": "“I don't understand why so many SDs are so vehemently resistant to paying for non-intimate dates.”\n\nExactly!!! Time = money but these guys are not *real* sugar daddies, can’t afford to be and most likely not even old enough ... and I guess it caters to their ego to say they have a sugarbaby instead of a prostitute, even though a prostitute is what they want...  \n\nI really hate the term Rinser ... It’s like those vanilla dater‘s who feel like a girl “used them for dinner” if she doesn’t put out after a few dates... when you are dating, sex is always a possibility but never a guarantee  \n\nThe thing about older men, who have been successful in life, who are maybe lonely or have a lot of time on their hands because they are retired ... these men are super generous and just happy to be around a young beautiful girl... money frees up her time, time that can be spent with him, and it takes some of the burden off her shoulder as most young ppl are broke \n\nI mean, don’t you guys have grandparents? You never had your grandpa give you hundred bucks for something small like taking out the trash ? This why I personally think no one under 55 can be a SD ...",
                            "author": "PsychologicalMud9673",
                            "id": "gojsg60",
                            "parent_id": "t1_goi5li9",
                            "score": 3,
                            "created_utc": 1614141527.0,
                            "replies": [
                                {
                                    "body": ">I mean, don’t you guys have grandparents? You never had your grandpa give you hundred bucks for something small like taking out the trash ? Th\n\nLol if I had a grandpa who would hand me a hundred bucks for taking out the trash, I probably would have never considered being a SB.",
                                    "author": "stubbed_m_toe",
                                    "id": "goke3if",
                                    "parent_id": "t1_gojsg60",
                                    "score": 2,
                                    "created_utc": 1614158905.0,
                                    "replies": []
                                },
                                {
                                    "body": "This!! So true... I have guys younger than me trying to be my “SD” lol that is not what I am looking for",
                                    "author": "Beachbabe1024",
                                    "id": "gom0h86",
                                    "parent_id": "t1_gojsg60",
                                    "score": 2,
                                    "created_utc": 1614191400.0,
                                    "replies": [
                                        {
                                            "body": "Young men are typically not in the position to freely give money... that’s why they are so bitter and resentful when they do",
                                            "author": "PsychologicalMud9673",
                                            "id": "gom1uh2",
                                            "parent_id": "t1_gom0h86",
                                            "score": 2,
                                            "created_utc": 1614191901.0,
                                            "replies": [
                                                {
                                                    "body": "Absolutely... I even added a note on my profile about me looking for an older and experienced SD Only, but it hasn’t really helped",
                                                    "author": "Beachbabe1024",
                                                    "id": "gom7ngn",
                                                    "parent_id": "t1_gom1uh2",
                                                    "score": 2,
                                                    "created_utc": 1614194095.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Marketing expense. If SB isn’t willing to invest 15 minutes to meet in person I assume she’s rinsing. You have to spend (time or money) to market the product. SD is paying customer doesn’t need to market himself but obviously must be attractive enough arrangement for SB to accept.",
                            "author": "sanfran4fun",
                            "id": "goipfnj",
                            "parent_id": "t1_goi5li9",
                            "score": -1,
                            "created_utc": 1614121373.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I’m sorry, I agree with your first point, but absolutely disagree with your second one. Everybody spends time in the beginning of a relationship figuring out whether or not they want that relationship to turn into something that lasts. Proposing that the SB not accept any money until she’s sure she wants the SR to last is ridiculous, especially considering the fact that SDs vanishing without a word is a common occurrence. If I’m spending my time with and being intimate with a SD in *any* way, regardless of whether or not I’m yet sure I’ll still want to do so in a month, I expect the PPM/allowance in full.",
                    "author": "FoxyFreckles1989",
                    "id": "goicytk",
                    "parent_id": "t1_gohn9a6",
                    "score": 11,
                    "created_utc": 1614115567.0,
                    "replies": []
                },
                {
                    "body": "Or by answering no if you ask if she's is willing to be an intimate arrangment you.",
                    "author": "midwesternguru",
                    "id": "gohqauc",
                    "parent_id": "t1_gohn9a6",
                    "score": 4,
                    "created_utc": 1614106290.0,
                    "replies": [
                        {
                            "body": "if you're communicating well\n\nand you get to a date where you've both talked about what you want to happen. \n\nand you've agreed that you both want intimacy. \n\nand then they just take the money and don't hold up their side of the agreement. \n\nand don't offer a decent reason why\\*\n\nthen the experience fits into the rinser category. They lied / took advantage of you.\n\n\\*Shouldn't we allow for the honest possibility that they start the date intending one thing and then change their mind for a legit reason? \n\nHaven't you ever started with one intention - out of legit good faith - and then changed your mind? Shouldn't an SB be allowed to do the same?",
                            "author": "SwimmingInSugar",
                            "id": "goi4br3",
                            "parent_id": "t1_gohqauc",
                            "score": 12,
                            "created_utc": 1614112221.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks for writing that and reading all the comments here, it was very helpful.",
            "author": null,
            "id": "goirop7",
            "parent_id": "t3_lqp33b",
            "score": 2,
            "created_utc": 1614122489.0,
            "replies": []
        },
        {
            "body": ">I definitely understand how an SD would be upset about getting rinsed - you're getting lied to! And that sucks!  \n>  \n>And  I also understand how an SD would be upset about getting rejected.  bcs... it hurts emotionally to have someone say they're not interested  in you sexually\n\nI think there's a  mismatch here between your theory and the actual bowl.  In actuality, you have no way of knowing whether you are getting rinsed or rejected -- if the 2nd case actually happens at all, it looks just like the first case.  This is similar to an SB getting rejected after the first intimate date -- not easy for her to tell if it was a pump & dump, or some genuine incompatibility, because in both cases, the SD might do similar things (e.g., ghost, and/or tell her they're not compatible), and the ultimate outcome is identical.\n\nIn any case, with sooo many rinsers, and with tiktokers actively promoting and coaching it, this is the more likely scenario.\n\n>In terms of the money: If you don't have the financial means to take a  few Losses here and there, then you're probably not in the right place.\n\nI agree, but not everyone is content acting like --  and getting treated like -- a buffoon who deserves to be treated like a sucker, and is willing to have that happen to them over and over just because they can afford it.  And someone who willfully lets himself or herself get taken advantage of over and over, attracts even more scammers to the bowl, and makes the bowl worse for everyone.  So to the extent your argument seems to be: just throw money around and hope it works out, and if you get taken advantage of, just ignore it ... your presence in the bowl makes the bowl worse for everyone.\n\nI realize that not every SB who would like up-front platonic dates w/ PPM is a rinser; some are fine SBs for whom this is what feels right to them.  My own approach is that I'd be open to up-front platonic dates, I'd never agree to PPM in advance (which filters out the rinsers, which is what this is all about), but I'd absolutely give them a gift anyway (which is what *my* notion of being an SD is about, taking care of an *actual* SB).\n\nThat, of course, is theoretical -- it's pretty rare SBs ask for up-front platonic dates, and they always recuse themselves if I agree but sans PPM.",
            "author": "Azurecole",
            "id": "gohsyi6",
            "parent_id": "t3_lqp33b",
            "score": 7,
            "created_utc": 1614107437.0,
            "replies": [
                {
                    "body": "lol\n\nstraw man much?\n\n\\---\n\nDo the work to screen / filter.\n\nDo the work to communicate.\n\nAnd 98% of the time that'll be enough. \n\nFor the 2% where you get lied to, take the L. Learn from it and move on. \n\n\\-\n\nNot too complicated. Doesn't pollute the bowl / reward bad actors.\n\nBut there are some people who won't let themselves change their mind. \n\nI def don't have time to convince people who are intellectually inflexible. \n\nI do hope that general sugar culture steadily migrates to a place where standard practice/incentives support full consent and respect for everyone's time (SBs getting compensated for platonic dates becoming the norm)\n\nTons of people won't like this. \n\nTons of people wanted slavery to continue too.\n\nSometimes people are wrong. Sometimes you're one of those people. \n\nOr, could be me. I could be wrong. \n\nBut, in my SRs at least, I try to structure things in the way that I've stated bcs it works for me :)",
                    "author": "SwimmingInSugar",
                    "id": "goi771i",
                    "parent_id": "t1_gohsyi6",
                    "score": 5,
                    "created_utc": 1614113322.0,
                    "replies": [
                        {
                            "body": "That wasn't a strawman, just responding to what you wrote.\n\n>Do the work to screen / filter.  \n>  \n>Do the work to communicate.  \n>  \n>And 98% of the time that'll be enough.\n\nScreening, filtering, and communicating are important, I definitely agree.  But your 98% number is made up from whole cloth.  There's not a whole lot of effective screening against a convincing rinser to be done in advance, it's not a difficult skill to be convincing,and all you have to do is be awake to see it's not uncommon and more guys than not have been stung; hell, that's WHY they stopped agreeing to M&G fees in advance.\n\nWhile screening and filtering is important, IME there's exactly one way to get to that 98% number: don't agree to that up-front M&G fee or initial-platonic-dates fee.  Absolute best tool we have.  But that doesn't mean you shouldn't live up to being whatever your vision of a good SD is ... once the rinsers have weeded themselves out because you won't agree to their M&G fee, give the SB who shows up a gift anyway.   \"Don't make goofy choices that are known to have a high probability of leading to getting scammed\" and \"be a good SD\" can be easily made to work together.  The idea that these things are incompatible -- you're a generous SD \\*\\*or\\*\\* you don't agree to M&G fees up front -- is false.",
                            "author": "Azurecole",
                            "id": "goi9av5",
                            "parent_id": "t1_goi771i",
                            "score": 3,
                            "created_utc": 1614114127.0,
                            "replies": [
                                {
                                    "body": "Exactly this. I mean, if any SB have a better idea on how to protect ourselves from rinsers, I am all ear. But so far I have not found any. Taking the lost is not an option. That would be like saying to SB to not protect themselves from PnD and just take the lost.",
                                    "author": "NewbieDaddy",
                                    "id": "goiemp6",
                                    "parent_id": "t1_goi9av5",
                                    "score": -1,
                                    "created_utc": 1614116299.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> is willing to have that happen to them over and over\n\nThat's not what OP said. There's a difference between accepting that it's a risk and accepting that it's a norm.  \n\nWe should take reasonable precautions (on both sides of the bowl), but we also need to be going into each M&G with open eyes and the understanding that, as the man says,  \"It is possible to commit no mistakes and still lose\". Chances are if you're in this long enough,  you'll eventually miss the signs, or run up against someone who doesn't give off any signs; and get rinsed/ pump and dumped. \n\nAs far as finances, I think what OP is saying is,  if your finances are such that one \"undeserved\" PPM makes a notable impact, they're going to be equally impacted each week by a successful SR. \n\nThis is the confusing thing to me about the whole discussion.  The loss to a bad or bad-faith date isn't the money. My sugar money is budgeted for the (week/ month/year depending on how you want to look at it) and was spent either way. It's the loss of time- that's one more week before I find my next actual SB. One more week of chatting and vetting and setting up M&Gs and all that  grunt work.  And there's an emotional cost too, whether it's a rejection or a premeditated rinsing, I'm going to _feel_ rejected to some degree. I thought  she was interested in me, but it turns out she wasn't.",
                    "author": "Undertow83",
                    "id": "goi02uy",
                    "parent_id": "t1_gohsyi6",
                    "score": 5,
                    "created_utc": 1614110549.0,
                    "replies": [
                        {
                            "body": ">That's not what OP said. There's a difference between accepting that it's a risk and accepting that it's a norm.\n\nThat may not be what he said, but based on a zillion stories here, following his advice exactly leads to taking a lot of unnecessary risk , and he's trying to find a way to dismiss it and/or shame those who care about that.\n\nIt is quite easy, IMO, to both take simple precautions against getting scammed, and fulfill the spirit of being a great SD: 1. don't agree to payments up front for the M&G and/or initial platonic dates, which gets the rinsers dropping out, and then 2. give her a gift anyway.    It is incredibly simple, and works amazingly well.  No need to try to use grade-school level shaming (oh ho!  You can't afford it, then!).  There is absolutely no reason to bring up whether one can \"afford\" to lose a PPM otherwise;  anyone who has read slf for even a day knows full well that isn't why SDs won't promise payment up-front for M&Gs, so this point is disingenuous... and that same reader also knows SDs here promote the idea of giving her a gift anyway (provided she looks like her pics yadda yadda)",
                            "author": "Azurecole",
                            "id": "goi1uir",
                            "parent_id": "t1_goi02uy",
                            "score": 2,
                            "created_utc": 1614111270.0,
                            "replies": [
                                {
                                    "body": ">and he's trying to find a way to dismiss it and/or shame those who care about that.\n\nnope\n\n\\---\n\nFirst, I don't think we're that far apart in our approach / philosophy. Even though the rhetoric is a bit heated. \n\nSecond, it really depends on what you mean by \"a lot of unnecessary risk\" - if I've reviewed an SBs profile, texted with them a while, spoken on the phone with them and had a M&G with them. And they go through all of that to rinse me for a platonic PPM, that doesn't seem like a lot of risk to me. That feels pretty low risk. \n\nThis word \"buffoon\" - it's a fabulous word, it's just fun to say / read - but I don't think it's the right word to describe a person following the game plan I outline above - which primarily involves taking time to get to know someone.. and that process will cause a lot of the scammers to drop off. and then, if after all of that they still seem like a strong candidate (relative to other women that I'm going through the same process with), then it feels like a low risk.\n\nIt feels to me like there's a group of SDs who are pissed that they can't get it down to ZERO risk. \n\nLast thing, I think your strategy re M&G is fine. Maybe even optimal. But let's also get clear on this: Your position that giving a surprise gift on good faith M&G's is not the norm. \n\nI'm saying this: I think it should be the norm. Maybe be careful about telegraphing your intention in certain circumstances (or in certain markets/areas). But, for me, giving a gift for a M&G that was good, but doesn't lead to an SR feels like the right thing to do.",
                                    "author": "SwimmingInSugar",
                                    "id": "gojerml",
                                    "parent_id": "t1_goi1uir",
                                    "score": 2,
                                    "created_utc": 1614134169.0,
                                    "replies": [
                                        {
                                            "body": ">First, I don't think we're that far apart in our approach / philosophy\n\nI think that's probably true.  In the end, we have similar views on how an SD treats an SB -- which isn't necessarily anything any other SD has to buy into, but we're not far apart.   But I think it's a pretty critical tool -- more for the M&G, but also for platonic up-front dates -- to have her show up without a guaranteed payoff.  It's not one I'm willing to give up.\n\n>Second, it really depends on what you mean by \"a lot of unnecessary  risk\" - if I've reviewed an SBs profile, texted with them a while,  spoken on the phone with them and had a M&G with them. And they go  through all of that to rinse me for a platonic PPM, that doesn't seem  like a lot of risk to me. That feels pretty low risk.\n\nI don't think it's ever one PPM, do you?  The girls who do this go for as many PPM dates as possible, and based on many SD stories it seems like they're extremely adept at making it feel like \"Just a couple more, I'm getting super comfortable\".  They ghost when the SD finally puts his foot down.  I think you might be underestimating them -- most of the stories I've read, the girls went to the M&Gs, texted in between, etc., their whole deal is to get him excited and invested, then sunken-cost him until he wises up.\n\nI just don't see a need for any of this aggravation, when I think I can put nearly all of this to bed by just doing it my way... and still go home at night happy that I treated her well.\n\n>Last thing, I think your strategy re M&G is fine. Maybe even  optimal. But let's also get clear on this: Your position that giving a  surprise gift on good faith M&G's is not the norm.\n\nYou think so?  I think it's the norm **on slf.**   Nearly every SD does this, or claims they do, no?\n\nAlso, agree \"buffoon\" is a fantastic word.",
                                            "author": "Azurecole",
                                            "id": "gojgqk9",
                                            "parent_id": "t1_gojerml",
                                            "score": 2,
                                            "created_utc": 1614135143.0,
                                            "replies": [
                                                {
                                                    "body": "I would love to see some data on all this. bcs it's super speculative right now. I'm sampling from (1) my experience and (2) the specific posts/comments that I've chanced to read on SLF and (3) conversations with a few friends that have some experience here.\n\nThat's a fairly small and skewed sample. \n\nWhich is to say: I don't \\_really\\_ know what the norm is. In the real world. Or on SLF. \n\nI have a feeling. \n\nAnd it's influenced by the highly charged posts from the last couple days. Where it felt like a number of SDs were losing their minds over the issue of paying and not getting sex.\n\nTheir comments + behavior felt (feel) wrong to me.\n\n\\---\n\nI probably am underestimating the scammers. In large part bcs I haven't had a traumatic experience like the one you describe, being played for multiple dates. \n\nI shake my head and say, \"That wouldn't happen to me.\"\n\nWhich another part of me know is exactly the kind of attitude that opens to the door to getting taken.\n\nBut without knowing how often this stuff happens. and some of the underlying fact pattern / details. it's really hard to know what level of risk there is for an SD that takes reasonable precautions. \n\nMy sense is that a good number of the guys who got scammed let their dick do too much of the thinking. and ignored a lot of red flags. \n\nbut I also admit that there are high quality scam artists out there. In every domain. And it's not just about $$$. They enjoy the art of the steal. If your adversary is an experienced pro, almost everyone is probably going to get taken down...\n\nok, I think I've run out of useful things to say (probably happened a few hundred (thousand?) words ago)\n\nI take my leave.",
                                                    "author": "SwimmingInSugar",
                                                    "id": "gojizdz",
                                                    "parent_id": "t1_gojgqk9",
                                                    "score": 3,
                                                    "created_utc": 1614136240.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Alright that's fair. I think you're maybe a little harsh on OP, but your argument isn't without merit.",
                                    "author": "Undertow83",
                                    "id": "goi2y4h",
                                    "parent_id": "t1_goi1uir",
                                    "score": 0,
                                    "created_utc": 1614111693.0,
                                    "replies": [
                                        {
                                            "body": "I might be being less than generous on my interpretation :)  I do admit the \"if you can't afford to lose PPM you shouldn't be an SD\", I always find to be incredibly manipulative and disingenuous.  Don't get me wrong, it's also true.  But it's not a good reason to be a buffoon, which is always what the sentences following propose.",
                                            "author": "Azurecole",
                                            "id": "goi5ltd",
                                            "parent_id": "t1_goi2y4h",
                                            "score": 1,
                                            "created_utc": 1614112716.0,
                                            "replies": [
                                                {
                                                    "body": ">it's also true\n\nlol\n\nyup\n\n\\---\n\nnot intended to be manipulative. \n\nintention: Wake up SDs. Shit doesn't always go right. Whether it's in business or in the bowl. \n\nSometimes you go out to dinner and the deal doesn't come together. You flew into town. Stayed at a hotel. You paid for the meal. \n\nAre you a buffoon now? \n\nNot necessarily.  \n\nIt's a cost of doing business. Deal with it.\n\nDef not suggesting that people just turn into money-burning buffoons.\n\nI am suggesting that SDs are likely to have some screening expenses. \n\nBe realistic. Budget for it. Emotionally and financially. \n\nThat's it. Not complicated.",
                                                    "author": "SwimmingInSugar",
                                                    "id": "gojfr3f",
                                                    "parent_id": "t1_goi5ltd",
                                                    "score": 3,
                                                    "created_utc": 1614134661.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Otherwise, and be honest, you just want an escort/sex-slave.\n\nYikes. Is your insinuation here that escorts are equivalent to sex slaves and have no right/agency to consent??",
            "author": "Cledaddy23",
            "id": "gohs0vq",
            "parent_id": "t3_lqp33b",
            "score": 8,
            "created_utc": 1614107031.0,
            "replies": [
                {
                    "body": "I don't think so. The point was to compare SRs (where there's full consent) to domains that I views as generally having less consent than SRs: (1) Escorts. (2) Sex-slaves. \n\nIt's not that the world of escorts and sex-slaves are identical. but (imo) they share this: they typically live in a different place on the continuum of consent than SRs.",
                    "author": "SwimmingInSugar",
                    "id": "goi3jpl",
                    "parent_id": "t1_gohs0vq",
                    "score": 8,
                    "created_utc": 1614111925.0,
                    "replies": [
                        {
                            "body": "Unpopular Opinion: GFE Escorts and SRs are actually almost identical. In fact SA started because he wanted to choose how he paid for GFE.",
                            "author": null,
                            "id": "goihfrj",
                            "parent_id": "t1_goi3jpl",
                            "score": 12,
                            "created_utc": 1614117571.0,
                            "replies": [
                                {
                                    "body": "I don't know GFE-Escort (GFEE), but it's easy to believe that GFEE could have a lot of overlap with SR. And in some cases be identical. \n\nStill, GFEE is just a part of Escort-land. And other parts of the escort-world may have less overlap with SRs.",
                                    "author": "SwimmingInSugar",
                                    "id": "gojcio0",
                                    "parent_id": "t1_goihfrj",
                                    "score": 3,
                                    "created_utc": 1614133024.0,
                                    "replies": []
                                },
                                {
                                    "body": "Agree.",
                                    "author": "sanfran4fun",
                                    "id": "goiozgv",
                                    "parent_id": "t1_goihfrj",
                                    "score": 1,
                                    "created_utc": 1614121159.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lots of blah blah over nothing. The simple idea is win-win when SBs receive $ and SDs receive intimacy. Things go wrong when SDs P&D without giving or when an SB accepts sugar without giving. End of story. With my SB, we had a zero cost zero intimacy walk in a park M&G for 1.5 hours. Our next meet was PPM and I communicated that I was happy to keep my boxers on the whole time and that intimacy would involve sexual pleasure for her only, when she initiated. And she did, and that's what exactly what happened. Our subsequent dates involved intercourse which happened very naturally because we built a degree of trust. She wanted to see me the next day and she did.\n\nSDs need to just put on their big boy pants and get over feelings of rejection from someone who is a stranger. Just next, and try with someone else. Don't do more than one PPM date with no intimacy, just say: \"This is not working, I want someone who appreciates my support in the form of intimacy. I'm not willing to continue PPM until you maybe feel comfortable with me. I will move on and try again with someone else.\" And move on, get over it. I think what happens is that a lot of SDs go crazy because maybe for the first time in their life a 10/10 is talking with them or seen in public with them. It feels good, blows their mind, and they don't know how to act. In the bowl, there is always another 10 out there.\n\nI don't agree with it but I can't blame the SBs who continue to accept support for no intimacy in return. Almost anyone would do it if they could. When that happens, it's the SDs fault.",
            "author": "whatever-tata",
            "id": "gohqz7f",
            "parent_id": "t3_lqp33b",
            "score": 6,
            "created_utc": 1614106581.0,
            "replies": [
                {
                    "body": "> Our next meet was PPM and I communicated that I was happy to keep my boxers on the whole time and that intimacy would involve sexual pleasure for her only\n\nThis always seems to work for me!\n\nI'm way more into \"Ladies First\" anyway and look to totally blowing their mind out of the water for intimate date #1 with me grinning like a Silver Fox and them stumbling and giggling while they can barely walk away... Then, when they usually come at me like an insatiable unleashed lioness afterwards? WOOT! Win/Win!!!",
                    "author": "SDRippington",
                    "id": "gos04ap",
                    "parent_id": "t1_gohqz7f",
                    "score": 1,
                    "created_utc": 1614301754.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">In terms of the money: If you don't have the financial means to take a few Losses here and there, then you're probably not in the right place. \n\n\n\nYesss to this!!! You want to make the right impression on the right girl. And if it ends up being the wrong girl, it shouldn't upset you financially or else let's be honest you cant afford this. The few losses make up for the right one",
            "author": null,
            "id": "gojkyyc",
            "parent_id": "t3_lqp33b",
            "score": 3,
            "created_utc": 1614137272.0,
            "replies": []
        },
        {
            "body": "OMG I love you. I LOVE YOU.\n\nThere, I've professed my undying love for everything you've written in this post, and literally every comment you've ever made. Can we get a room now? I consent 100%.",
            "author": "ExExpectations",
            "id": "goht23w",
            "parent_id": "t3_lqp33b",
            "score": 3,
            "created_utc": 1614107481.0,
            "replies": [
                {
                    "body": "Aww, thanks :)\n\nI love your posts too. \n\nLet's skip right past the room and head down the aisle. \n\nJust let me know what size ring and how many carats",
                    "author": "SwimmingInSugar",
                    "id": "gojgpma",
                    "parent_id": "t1_goht23w",
                    "score": 3,
                    "created_utc": 1614135130.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gohtebn",
            "parent_id": "t3_lqp33b",
            "score": 2,
            "created_utc": 1614107630.0,
            "replies": [
                {
                    "body": "I've encountered plenty that flaked or ghosted after the M&G. My assumption was that they weren't interested or found a better fit. \n\nBut I've also turned down a lot of SBs after the M&G. If something doesn't seem like an amazing fit, why keep going?",
                    "author": "emptyoverflow",
                    "id": "goi1udr",
                    "parent_id": "t1_gohtebn",
                    "score": 5,
                    "created_utc": 1614111269.0,
                    "replies": []
                },
                {
                    "body": "I’ve turned down maybe 50%? Either we just didn’t click conversationally and it was all awkward silences, or we didn’t align on safe sex practices, or they just acted like a horny eighth grader the whole time.",
                    "author": null,
                    "id": "goin415",
                    "parent_id": "t1_gohtebn",
                    "score": 4,
                    "created_utc": 1614120261.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gohu1nw",
                    "parent_id": "t1_gohtebn",
                    "score": 5,
                    "created_utc": 1614107915.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "goitqqd",
                            "parent_id": "t1_gohu1nw",
                            "score": 2,
                            "created_utc": 1614123491.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "goiuhwy",
                                    "parent_id": "t1_goitqqd",
                                    "score": 1,
                                    "created_utc": 1614123860.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gojb6sq",
                                            "parent_id": "t1_goiuhwy",
                                            "score": 2,
                                            "created_utc": 1614132346.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Real ones, probably not. \n\nThe problem is we can’t really tell the difference between a rinser and someone rejecting you...it looks the same.",
                    "author": "throwawaysugar1980",
                    "id": "gohueqf",
                    "parent_id": "t1_gohtebn",
                    "score": 1,
                    "created_utc": 1614108072.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for this post",
            "author": "nuitbelle",
            "id": "goiiey4",
            "parent_id": "t3_lqp33b",
            "score": 2,
            "created_utc": 1614118027.0,
            "replies": []
        },
        {
            "body": "Let’s not kids ourselves - most SD are in the bowl for sex and most SB are in the bowl for $$$. Yes it is not as simple as a one-off prostitution transaction and both parties can back out at any time. And yes neither party feels good about rejection. But the OP seems to undersell the transactional nature of the arrangement. And yes, if SB rejects POT for whatever reason SD should feel free to reject payment for the M&G. \nHurt feelings are inevitable everywhere on Reddit.",
            "author": "sanfran4fun",
            "id": "goiouk2",
            "parent_id": "t3_lqp33b",
            "score": 2,
            "created_utc": 1614121094.0,
            "replies": []
        },
        {
            "body": "I disagree. You are free to look for and define the parameters of what you're looking for, including intimacy and financial support. You can't ask me to agree to one part of the arrangement and then force me to leave other parts for a later decision. I guess you can ask but I'm going to say no. \n\nYou are also welcome to take as long as you want and invest what you want or don't want to see if the terms are ultimately acceptable to both parties.",
            "author": "midwesternguru",
            "id": "gohr6h8",
            "parent_id": "t3_lqp33b",
            "score": 3,
            "created_utc": 1614106668.0,
            "replies": []
        },
        {
            "body": " I disagree with most of what Op wrote when started a relationship.\nGreat way to be treated as a sucker.\n\nTotally different situation once established.\n\nI’ve posted before but I get intimate about half the times we catch up and fine with that. On allowance and see each other a lot.\n\nPPM for someone you just met for platonic ha not that stupid or naive.\nSome pretty dodgy women on SA, just because a loss won’t break me doesn’t mean I’m a sucker",
            "author": "sydsyd3",
            "id": "goka64n",
            "parent_id": "t3_lqp33b",
            "score": 1,
            "created_utc": 1614155164.0,
            "replies": []
        },
        {
            "body": "Unpopular opinion but I believe the difference between an escort and a SB is in the volume. A lot of the GFE escorts pick and choose their clients and sometimes they don't have sex at all. The lines become a little blurry when you add in dinners, dates, gifts and long term clients. However, the core of the escort is business. It's a business.\n\nOnce a SB start having 3-6 SD at the same time and juggling them as like a business then I think she is no different than an escort. There would be so little investment in the relationship that it's almost a business.\n\nFor rinsers vs rejections I think it boils down to #1 prior consent and #2 whether he gave her the $$ with the expectation of getting it.\n\nThere are guys who actually ignore \"platonic only\" in a SB profile and push for sex. They would even agree to a payment hoping for sex after the M&G. The line is fuzzy at that point because some SB have been known to fall for it and agree. So I don't think any sane guy would blame the SB if she rejected him. The guy might get angry afterwards but it's just like asking a girl out for dinner and she chooses not to date him afterwards.",
            "author": "Majesticpork",
            "id": "goip2nl",
            "parent_id": "t3_lqp33b",
            "score": 1,
            "created_utc": 1614121201.0,
            "replies": []
        },
        {
            "body": "When I first entered the bowl 5 years ago I assumed women would strongly protect against having sex until they were certain of a long term arrangement, it was the old puritanical upbringing in me. \n\nI was stunned by how sexually open virtually everyone I met was. Many m&g’s turned into overnights. Some without talking about dollars at all. Some were ok with once a month. \n\nNow, I expect sex positive women to be in the bowl. The last thing I want is to have to cajole someone. If that’s their personality that’s fine and it’s not for me. That person will not be equipped to have the kind of depth of intimacy that I look for.",
            "author": "Diditall4thecookie",
            "id": "gojajx7",
            "parent_id": "t3_lqp33b",
            "score": 1,
            "created_utc": 1614132019.0,
            "replies": [
                {
                    "body": "this resonates with me. \n\nI am definitely bringing some puritanical baggage with me. and have been surprised at how open women have been. \n\nit's been a real education and I'm hugely grateful to them for helping me unlearn some of these hangups.",
                    "author": "SwimmingInSugar",
                    "id": "gojgi9w",
                    "parent_id": "t1_gojajx7",
                    "score": 2,
                    "created_utc": 1614135033.0,
                    "replies": []
                },
                {
                    "body": "True. Only on SLF do they become virtuous virgins waiting for a promise ring to go to second base.",
                    "author": "OldschoolSD",
                    "id": "gom1hp7",
                    "parent_id": "t1_gojajx7",
                    "score": 0,
                    "created_utc": 1614191774.0,
                    "replies": []
                },
                {
                    "body": "So you ditched your upbringing..",
                    "author": null,
                    "id": "gpagmk8",
                    "parent_id": "t1_gojajx7",
                    "score": 1,
                    "created_utc": 1614599331.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I the case of rejection, it's simple: she just needs to break things off. No harms, no foul. Unless what you mean is that sometimes she does not feel like it. In that case, sure just say so. But if no intimacy has happened, we have no way of truly knowing if you are rinsing us or not, hence why we do not want to pay for platonic. If you already had intimate relationships, then sure, no problems in that case we can just reschedule. Unless it becomes a pattern, in which case as you mention nobody wants to be in a relationship where intimacy is forced, so it's better to break things off. Also, this is why in that vetting period I only do PPM for non platonic dates. It weeds out the ones that tries to minimize sexual encounters. Now let's say all that has been validated, then it means you are on an allowance. If you don't feel like it no issue, we can have a platonic date instead.\nAlso, I completely reject your definition of a SR. I do not pay for time and or attention per say. I pay for an healthy sex positive adult relationship. I can have a relationship where I get attention and time without sex with a wife. Or for a fraction of the cost of a real SR.",
            "author": "NewbieDaddy",
            "id": "gohsn3b",
            "parent_id": "t3_lqp33b",
            "score": 0,
            "created_utc": 1614107300.0,
            "replies": []
        },
        {
            "body": "It is all what the market and parties involved will bear. Ideally a simple M&G at no cost where time  spent is the cost of due diligence and the cost of business, just like marketing. Next a PPM trial to see if thing continue to work at the next level. Sometimes the marketing is so good that I buy what I don’t want or need. Fortunately, in this instance there are no long term contracts that I get trapped into other than by my own psychology. Finally an ongoing arrangement with either party free to terminate at any time. No one should be obligated to do anything and just like with cars sometimes one gets a lemon and that is just life and time to trade it in. This goes for both sides in any arrangement.",
            "author": "BenBonne",
            "id": "gohq9io",
            "parent_id": "t3_lqp33b",
            "score": 0,
            "created_utc": 1614106274.0,
            "replies": []
        },
        {
            "body": "They either want a mutually beneficial relationship or not.   They are honest and up front or not.  If you need a guy and are not interested then don’t request or accept significant money beyond a typical meet and greet gift.   If you lead a guy on with no intention to fulfill your part of the arrangement then you are a con artist.",
            "author": "LotBuilder",
            "id": "goicaa1",
            "parent_id": "t3_lqp33b",
            "score": 0,
            "created_utc": 1614115300.0,
            "replies": []
        },
        {
            "body": "Exactly. But an analogous situation is a perceived pump and dump. Plenty of times after the first intimate date I haven't wanted to proceed, so it could easily be seen that I've I was just looking for a once off.   \n\nThe other one is when some SBs claim you were just using them for a free date at the M&G. Ug, no. If I could magically go straight from SA to an arrangement I would, but in reality its a necessity. \n\nSimply, my intentions are to look for an ongoing arrangement but there is no certification that allows POTs to see my intentions versus PnD, or free dates (if this latter option really exists).",
            "author": "schmeeSD",
            "id": "gojgm80",
            "parent_id": "t3_lqp33b",
            "score": 0,
            "created_utc": 1614135086.0,
            "replies": []
        },
        {
            "body": "Its not about the money, its about principle. I dont want bad actors to come out with a win because it incentivizes them to do it more.\n\nAgree with everything else tho. Ive rejected more women than have rejected me, and if I get rejected it doesnt bother me because I always have plently of good options.",
            "author": "YoMamas_azz",
            "id": "goj9o94",
            "parent_id": "t3_lqp33b",
            "score": -1,
            "created_utc": 1614131565.0,
            "replies": []
        },
        {
            "body": "bogus argument",
            "author": "heyduhman",
            "id": "gohmgte",
            "parent_id": "t3_lqp33b",
            "score": -8,
            "created_utc": 1614104657.0,
            "replies": []
        },
        {
            "body": "I'm confused...  you write a giant screed, yet can't be bothered to spell out \"because\"?  Literally, the only word you abbreviate..  lol",
            "author": "Acrobatic_Half_6631",
            "id": "gohv4mj",
            "parent_id": "t3_lqp33b",
            "score": -3,
            "created_utc": 1614108387.0,
            "replies": [
                {
                    "body": "screed. \n\nlove that word. \n\nmade me curious about the etymology: \"early 14c., \"fragment,\" also \"strip of cloth,\" from northern England dialectal variant of Old English *screade* (see [**shred**](https://www.etymonline.com/word/shred?ref=etymonline_crossreference#etymonline_v_23444) (n.)). Meaning \"lengthy speech\" is first recorded 1789, from notion of reading from a long list.\"\n\nA little odd in terms of an origin story. Also, not a very old word.",
                    "author": "SwimmingInSugar",
                    "id": "gojh3wf",
                    "parent_id": "t1_gohv4mj",
                    "score": 3,
                    "created_utc": 1614135319.0,
                    "replies": [
                        {
                            "body": "Thanks for the history lesson :)  I mean that seriously, not in the sarcastic way.\n\nGiven all the downvotes i got, i'm surprised... i just found it funny that you would always abbreviate that one word and nothing else..  i guess others are not a fan",
                            "author": "Acrobatic_Half_6631",
                            "id": "gol6ie8",
                            "parent_id": "t1_gojh3wf",
                            "score": 1,
                            "created_utc": 1614178960.0,
                            "replies": [
                                {
                                    "body": "abbreviation is not one of my strengths\n\nand when I do abbreviate, it's often stylistically questionable\n\nI honestly need to work on tidying up my prose, being more concise. \n\n\\---\n\nI love etymology, sometimes you'll dig up something really interesting about the history of a word. I mostly use this site: [https://www.etymonline.com](https://www.etymonline.com)",
                                    "author": "SwimmingInSugar",
                                    "id": "goo9bya",
                                    "parent_id": "t1_gol6ie8",
                                    "score": 2,
                                    "created_utc": 1614229704.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "goikm9q",
            "parent_id": "t3_lqp33b",
            "score": 1,
            "created_utc": 1614119068.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "goikmbh",
                    "parent_id": "t1_goikm9q",
                    "score": 1,
                    "created_utc": 1614119069.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I dont think any sd would worry about paying for dinner and getting rejected.",
            "author": "wb19081908",
            "id": "gojp2gs",
            "parent_id": "t1_gohnlgm",
            "score": 9,
            "created_utc": 1614139539.0,
            "replies": [
                {
                    "body": "Bingo",
                    "author": null,
                    "id": "gokzy7n",
                    "parent_id": "t1_gojp2gs",
                    "score": 2,
                    "created_utc": 1614175666.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Funny, I had the opposite story: I paid the full PPM and didn't want sex. the girl completely freaked out, I think it was her first rejection.",
            "author": "JeaneyBowl",
            "id": "gohu6lp",
            "parent_id": "t1_gohpwrv",
            "score": 15,
            "created_utc": 1614107975.0,
            "replies": [
                {
                    "body": "Lol just curious, why didn’t you want sex.",
                    "author": "Fun_Focus8159",
                    "id": "gohubq4",
                    "parent_id": "t1_gohu6lp",
                    "score": 5,
                    "created_utc": 1614108036.0,
                    "replies": [
                        {
                            "body": "I was too drunk to perform, i.e. had a single glass of wine.",
                            "author": "JeaneyBowl",
                            "id": "gohx5kl",
                            "parent_id": "t1_gohubq4",
                            "score": 11,
                            "created_utc": 1614109275.0,
                            "replies": [
                                {
                                    "body": "I hear you man. I usually prefer having sex before drinking because I perform better also. I tell all my sexual partners this. However, of course they all want to have a few drinks before getting intimate. If we’ve been drinking all night then I’ll just want to go to bed, and no sex lol. It’s the SB’s that usually want to have sex haha. \n\nSame thing happened to me recently with one of my SB’s. She came over and I made her dinner. Had lots of wine. She started to get frisky and wanted to have sex but I wasn’t in the mood after a big dinner and lots of wine. She seemed a little offended and later told me she felt like I didn’t want her anymore. I said no I was just super full and drunk lol!",
                                    "author": "Fun_Focus8159",
                                    "id": "gohyhvs",
                                    "parent_id": "t1_gohx5kl",
                                    "score": 10,
                                    "created_utc": 1614109859.0,
                                    "replies": [
                                        {
                                            "body": "I dont drink (but used to). Honestly a large meal and a bunch of alcohol does nothing but diminish my libido.",
                                            "author": null,
                                            "id": "goi0ftb",
                                            "parent_id": "t1_gohyhvs",
                                            "score": 8,
                                            "created_utc": 1614110711.0,
                                            "replies": [
                                                {
                                                    "body": "Amen brother same here. Who wants to have sex with a full stomach! Feels weird.",
                                                    "author": "Fun_Focus8159",
                                                    "id": "goi0uaj",
                                                    "parent_id": "t1_goi0ftb",
                                                    "score": 8,
                                                    "created_utc": 1614110886.0,
                                                    "replies": [
                                                        {
                                                            "body": "c'mon all the sloshing noises and ear belching is sexy!",
                                                            "author": "idk_letstry",
                                                            "id": "golzag2",
                                                            "parent_id": "t1_goi0uaj",
                                                            "score": 1,
                                                            "created_utc": 1614190963.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Surely if you truly wanted to reiterate to her that the sex was not the sole purpose of the meeting, you could've given her the PPM irrespective and explained that sugaring isn't about selling sex?",
            "author": "AvenueLane96",
            "id": "goj5ly9",
            "parent_id": "t1_gohpwrv",
            "score": 3,
            "created_utc": 1614129444.0,
            "replies": [
                {
                    "body": "She didn’t want the PPM. She said she didn’t feel right since she didn’t feel comfortable having sex.",
                    "author": "Fun_Focus8159",
                    "id": "goj64pb",
                    "parent_id": "t1_goj5ly9",
                    "score": 1,
                    "created_utc": 1614129716.0,
                    "replies": [
                        {
                            "body": "Ahh i see. Sounds like she didn't know what she was going into.",
                            "author": "AvenueLane96",
                            "id": "goj6tln",
                            "parent_id": "t1_goj64pb",
                            "score": 2,
                            "created_utc": 1614130078.0,
                            "replies": [
                                {
                                    "body": "Yea for sure. It was her first time doing anything like that before. She was one of those that works full time and doesn’t need/want the money. For her it was more about having fun and sexual experiences with an older man.",
                                    "author": "Fun_Focus8159",
                                    "id": "goj7rp1",
                                    "parent_id": "t1_goj6tln",
                                    "score": 1,
                                    "created_utc": 1614130565.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dude.... I could tell EXACTLY the same story. All of this happened to me also, down to the idioms she used to explain herself.. she talked about \"just couldn't do it\" and about not doing the sugar thing, and she also wants to be friends and go for drinks. She was also very forward with sending sexy pics, sexting, etc. It's eerie to read this, as I could have written the exact same story.\n\nIs she by any chance Welsh?",
            "author": "RockyLeal",
            "id": "gojczsd",
            "parent_id": "t1_gohpwrv",
            "score": 2,
            "created_utc": 1614133266.0,
            "replies": [
                {
                    "body": "Lol no. I’m in Texas and she’s from the US. \n\nI imagine this happens quite a bit with women new to the bowel who think they can be intimate for a PPM, but when it comes down to actually doing it, they get scared off.",
                    "author": "Fun_Focus8159",
                    "id": "gojdiqt",
                    "parent_id": "t1_gojczsd",
                    "score": 1,
                    "created_utc": 1614133531.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Many times I've paid the ppm and she then gets cold feet or during sex feels uncomfortable and wants to leave.\n\nI still let them keep the allownance and move on",
            "author": "wb19081908",
            "id": "gojp8o3",
            "parent_id": "t1_gohpwrv",
            "score": 2,
            "created_utc": 1614139638.0,
            "replies": [
                {
                    "body": "I always pay PPM after intimacy is over and right before she leaves.",
                    "author": "Fun_Focus8159",
                    "id": "gojq0c7",
                    "parent_id": "t1_gojp8o3",
                    "score": 1,
                    "created_utc": 1614140087.0,
                    "replies": [
                        {
                            "body": "Im willing to risk her not having sex to make them feel.comfortable.\n\nIts a test if they do it i just never see them.again",
                            "author": "wb19081908",
                            "id": "gojt7zh",
                            "parent_id": "t1_gojq0c7",
                            "score": 6,
                            "created_utc": 1614141994.0,
                            "replies": [
                                {
                                    "body": "> Im willing to risk her not having sex to make them feel.comfortable.\n> \n> Its a test if they do it i just never see them.again\n\nI've done this and feel the exact same way. I've had them get cold feet (total of twice) and walk before. Whatever. Their loss. \n\nTells me all I needed to know about them when they kept the money :-) \n\nInterestingly enough I had both want to \"try again\" and I told them both not interested. \n\nFool me once, shame on you. Fool me twice? Shame on me.",
                                    "author": "SDRippington",
                                    "id": "gorxs8b",
                                    "parent_id": "t1_gojt7zh",
                                    "score": 2,
                                    "created_utc": 1614300593.0,
                                    "replies": [
                                        {
                                            "body": "Yeh sometimes they message next week desperate foe money and I just gjost them.  I let anyone tip me off just once.",
                                            "author": "wb19081908",
                                            "id": "gos3wb6",
                                            "parent_id": "t1_gorxs8b",
                                            "score": 1,
                                            "created_utc": 1614303652.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I’ve never seen an uncomfortable SB, and all of mine have always received it  at the end of the date, and most of them initiated intimacy",
                                    "author": null,
                                    "id": "gol2odi",
                                    "parent_id": "t1_gojt7zh",
                                    "score": 0,
                                    "created_utc": 1614177078.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I don't think \\*sugaring\\* means what you think it means anymore...it means much, much less\n\nYes. And it's tragic and unfortunate.",
            "author": "ExExpectations",
            "id": "gohucfk",
            "parent_id": "t1_gohqjap",
            "score": 12,
            "created_utc": 1614108045.0,
            "replies": []
        },
        {
            "body": "Capitalism, baby! ::finger guns::\n\nBut yeah, pretty much what you said. Good, bad, or indifferent, the word itself means something else now.",
            "author": "Intrepid_Egg_7722",
            "id": "goj74hq",
            "parent_id": "t1_gohqjap",
            "score": 2,
            "created_utc": 1614130234.0,
            "replies": []
        },
        {
            "body": "> Time wasted but for me there is no one that is going to make me disrespect myself or undervalue my self worth because they don't really respect or understand the lifestyle.\n\nWell said.",
            "author": "SDRippington",
            "id": "gorxykj",
            "parent_id": "t1_goi7gcm",
            "score": 2,
            "created_utc": 1614300679.0,
            "replies": []
        },
        {
            "body": "> I really hate the term rinsing...\n\nIf a woman is up front and honest about being indecisive about having sex with you, and ultimately decides not to - well, that's on you if you wanted to keep on trying. That's your own damn fault for not following the \"It's either Fuck Yes or It's No\" dating advice. \n\nIf however a woman is leading you on with the promise of sex, but has literally no intention of following through? It's **Rinsing**. You want us to just call it fraud? Is that better? \n\n> but that’s why guys these days opt for bs coffee dates or walks in the park 🤣\n\nHate the game, baby, not the player. They did it to themselves. \n\nAfter the number of times I've been catfished? I will always leave time open for a longer date in a better venue after the M&G, but otherwise it's the landscape now. \n\nFeel free to hold out for better, that's always totally your choice - but don't throw shade on someone doing things differently and still being wildly successful :-)",
            "author": "SDRippington",
            "id": "goryffv",
            "parent_id": "t1_gojtyni",
            "score": 3,
            "created_utc": 1614300904.0,
            "replies": []
        },
        {
            "body": "Did you first write fish in a barrel and then thought better of it and changed it to a pond?",
            "author": "Diditall4thecookie",
            "id": "goj2m0e",
            "parent_id": "t1_gohtoki",
            "score": 1,
            "created_utc": 1614127883.0,
            "replies": [
                {
                    "body": "Who fishes in a barrel and not a pond",
                    "author": "oneangstybiscuit",
                    "id": "gojw500",
                    "parent_id": "t1_goj2m0e",
                    "score": 1,
                    "created_utc": 1614143834.0,
                    "replies": [
                        {
                            "body": "You’re right. Yiu shoot the fish in the barrel and fish the ones in the pond.",
                            "author": "Diditall4thecookie",
                            "id": "goknntf",
                            "parent_id": "t1_gojw500",
                            "score": 1,
                            "created_utc": 1614167752.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Aren't we all figuring out our preferences as we go? \n\nNone of us know the future. We're not making ironclad promises about every aspect of our future performance... bcs we can act in good faith and be uncertain about what we'll want to do in the moment. \n\nThat's just being a human.\n\n\\---\n\nIf your policy is that you refuse to pay unless there's intimacy, that's your choice. If I were an SB that would be an absolute next. \n\nEveryone gets to choose what's right for them, but I'd have no interest.\n\n\\---\n\nMy feeling: I'm paying for her time. and the opportunity to have great things happen. It takes time to text with a POT SD, it takes time to do a M&G, it takes time to get ready - to shave, do hair+makeup, drive, etc..., it takes mental energy for her to show up and be engaging and pay attention to YOU. \n\nBut you only want to hand over money if there's sex... \n\nYou do you. But amongst financially successful people who value their time, I don't understand why so many SDs are so vehemently resistant to paying for non-intimate dates. \n\nC'mon... A lot of us charge by the hour. or 15min increments even. And we charge \\*a lot\\*. And then we're refusing to compensate SBs bcs ... we didn't get absolutely everything we had hoped for.\n\nCry me a river. \n\nMy preference: Be a gentlemen. Be generous.",
            "author": "SwimmingInSugar",
            "id": "goi5li9",
            "parent_id": "t1_gohn9a6",
            "score": 21,
            "created_utc": 1614112713.0,
            "replies": [
                {
                    "body": "Yes. This. All of it.",
                    "author": "FoxyFreckles1989",
                    "id": "goid59o",
                    "parent_id": "t1_goi5li9",
                    "score": 11,
                    "created_utc": 1614115643.0,
                    "replies": []
                },
                {
                    "body": "This!  If guys want a sexual guarantee so long as they aren't diseased or dangerous there is a whole population of professional workers they can hire.\n\nIf they want the chance of authenticity, mutual attractive, mutual feelings then you invest, reward vs risk.",
                    "author": "sugarsenior2",
                    "id": "goigp25",
                    "parent_id": "t1_goi5li9",
                    "score": 8,
                    "created_utc": 1614117237.0,
                    "replies": [
                        {
                            "body": "Unfortunately most -SDs- don’t see it that way 💔",
                            "author": "Beachbabe1024",
                            "id": "gom01w8",
                            "parent_id": "t1_goigp25",
                            "score": 3,
                            "created_utc": 1614191243.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Thank you 🙏🏼",
                    "author": "Beachbabe1024",
                    "id": "golzhtb",
                    "parent_id": "t1_goi5li9",
                    "score": 3,
                    "created_utc": 1614191039.0,
                    "replies": []
                },
                {
                    "body": "“I don't understand why so many SDs are so vehemently resistant to paying for non-intimate dates.”\n\nExactly!!! Time = money but these guys are not *real* sugar daddies, can’t afford to be and most likely not even old enough ... and I guess it caters to their ego to say they have a sugarbaby instead of a prostitute, even though a prostitute is what they want...  \n\nI really hate the term Rinser ... It’s like those vanilla dater‘s who feel like a girl “used them for dinner” if she doesn’t put out after a few dates... when you are dating, sex is always a possibility but never a guarantee  \n\nThe thing about older men, who have been successful in life, who are maybe lonely or have a lot of time on their hands because they are retired ... these men are super generous and just happy to be around a young beautiful girl... money frees up her time, time that can be spent with him, and it takes some of the burden off her shoulder as most young ppl are broke \n\nI mean, don’t you guys have grandparents? You never had your grandpa give you hundred bucks for something small like taking out the trash ? This why I personally think no one under 55 can be a SD ...",
                    "author": "PsychologicalMud9673",
                    "id": "gojsg60",
                    "parent_id": "t1_goi5li9",
                    "score": 3,
                    "created_utc": 1614141527.0,
                    "replies": [
                        {
                            "body": ">I mean, don’t you guys have grandparents? You never had your grandpa give you hundred bucks for something small like taking out the trash ? Th\n\nLol if I had a grandpa who would hand me a hundred bucks for taking out the trash, I probably would have never considered being a SB.",
                            "author": "stubbed_m_toe",
                            "id": "goke3if",
                            "parent_id": "t1_gojsg60",
                            "score": 2,
                            "created_utc": 1614158905.0,
                            "replies": []
                        },
                        {
                            "body": "This!! So true... I have guys younger than me trying to be my “SD” lol that is not what I am looking for",
                            "author": "Beachbabe1024",
                            "id": "gom0h86",
                            "parent_id": "t1_gojsg60",
                            "score": 2,
                            "created_utc": 1614191400.0,
                            "replies": [
                                {
                                    "body": "Young men are typically not in the position to freely give money... that’s why they are so bitter and resentful when they do",
                                    "author": "PsychologicalMud9673",
                                    "id": "gom1uh2",
                                    "parent_id": "t1_gom0h86",
                                    "score": 2,
                                    "created_utc": 1614191901.0,
                                    "replies": [
                                        {
                                            "body": "Absolutely... I even added a note on my profile about me looking for an older and experienced SD Only, but it hasn’t really helped",
                                            "author": "Beachbabe1024",
                                            "id": "gom7ngn",
                                            "parent_id": "t1_gom1uh2",
                                            "score": 2,
                                            "created_utc": 1614194095.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Marketing expense. If SB isn’t willing to invest 15 minutes to meet in person I assume she’s rinsing. You have to spend (time or money) to market the product. SD is paying customer doesn’t need to market himself but obviously must be attractive enough arrangement for SB to accept.",
                    "author": "sanfran4fun",
                    "id": "goipfnj",
                    "parent_id": "t1_goi5li9",
                    "score": -1,
                    "created_utc": 1614121373.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m sorry, I agree with your first point, but absolutely disagree with your second one. Everybody spends time in the beginning of a relationship figuring out whether or not they want that relationship to turn into something that lasts. Proposing that the SB not accept any money until she’s sure she wants the SR to last is ridiculous, especially considering the fact that SDs vanishing without a word is a common occurrence. If I’m spending my time with and being intimate with a SD in *any* way, regardless of whether or not I’m yet sure I’ll still want to do so in a month, I expect the PPM/allowance in full.",
            "author": "FoxyFreckles1989",
            "id": "goicytk",
            "parent_id": "t1_gohn9a6",
            "score": 11,
            "created_utc": 1614115567.0,
            "replies": []
        },
        {
            "body": "Or by answering no if you ask if she's is willing to be an intimate arrangment you.",
            "author": "midwesternguru",
            "id": "gohqauc",
            "parent_id": "t1_gohn9a6",
            "score": 4,
            "created_utc": 1614106290.0,
            "replies": [
                {
                    "body": "if you're communicating well\n\nand you get to a date where you've both talked about what you want to happen. \n\nand you've agreed that you both want intimacy. \n\nand then they just take the money and don't hold up their side of the agreement. \n\nand don't offer a decent reason why\\*\n\nthen the experience fits into the rinser category. They lied / took advantage of you.\n\n\\*Shouldn't we allow for the honest possibility that they start the date intending one thing and then change their mind for a legit reason? \n\nHaven't you ever started with one intention - out of legit good faith - and then changed your mind? Shouldn't an SB be allowed to do the same?",
                    "author": "SwimmingInSugar",
                    "id": "goi4br3",
                    "parent_id": "t1_gohqauc",
                    "score": 12,
                    "created_utc": 1614112221.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "lol\n\nstraw man much?\n\n\\---\n\nDo the work to screen / filter.\n\nDo the work to communicate.\n\nAnd 98% of the time that'll be enough. \n\nFor the 2% where you get lied to, take the L. Learn from it and move on. \n\n\\-\n\nNot too complicated. Doesn't pollute the bowl / reward bad actors.\n\nBut there are some people who won't let themselves change their mind. \n\nI def don't have time to convince people who are intellectually inflexible. \n\nI do hope that general sugar culture steadily migrates to a place where standard practice/incentives support full consent and respect for everyone's time (SBs getting compensated for platonic dates becoming the norm)\n\nTons of people won't like this. \n\nTons of people wanted slavery to continue too.\n\nSometimes people are wrong. Sometimes you're one of those people. \n\nOr, could be me. I could be wrong. \n\nBut, in my SRs at least, I try to structure things in the way that I've stated bcs it works for me :)",
            "author": "SwimmingInSugar",
            "id": "goi771i",
            "parent_id": "t1_gohsyi6",
            "score": 5,
            "created_utc": 1614113322.0,
            "replies": [
                {
                    "body": "That wasn't a strawman, just responding to what you wrote.\n\n>Do the work to screen / filter.  \n>  \n>Do the work to communicate.  \n>  \n>And 98% of the time that'll be enough.\n\nScreening, filtering, and communicating are important, I definitely agree.  But your 98% number is made up from whole cloth.  There's not a whole lot of effective screening against a convincing rinser to be done in advance, it's not a difficult skill to be convincing,and all you have to do is be awake to see it's not uncommon and more guys than not have been stung; hell, that's WHY they stopped agreeing to M&G fees in advance.\n\nWhile screening and filtering is important, IME there's exactly one way to get to that 98% number: don't agree to that up-front M&G fee or initial-platonic-dates fee.  Absolute best tool we have.  But that doesn't mean you shouldn't live up to being whatever your vision of a good SD is ... once the rinsers have weeded themselves out because you won't agree to their M&G fee, give the SB who shows up a gift anyway.   \"Don't make goofy choices that are known to have a high probability of leading to getting scammed\" and \"be a good SD\" can be easily made to work together.  The idea that these things are incompatible -- you're a generous SD \\*\\*or\\*\\* you don't agree to M&G fees up front -- is false.",
                    "author": "Azurecole",
                    "id": "goi9av5",
                    "parent_id": "t1_goi771i",
                    "score": 3,
                    "created_utc": 1614114127.0,
                    "replies": [
                        {
                            "body": "Exactly this. I mean, if any SB have a better idea on how to protect ourselves from rinsers, I am all ear. But so far I have not found any. Taking the lost is not an option. That would be like saying to SB to not protect themselves from PnD and just take the lost.",
                            "author": "NewbieDaddy",
                            "id": "goiemp6",
                            "parent_id": "t1_goi9av5",
                            "score": -1,
                            "created_utc": 1614116299.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> is willing to have that happen to them over and over\n\nThat's not what OP said. There's a difference between accepting that it's a risk and accepting that it's a norm.  \n\nWe should take reasonable precautions (on both sides of the bowl), but we also need to be going into each M&G with open eyes and the understanding that, as the man says,  \"It is possible to commit no mistakes and still lose\". Chances are if you're in this long enough,  you'll eventually miss the signs, or run up against someone who doesn't give off any signs; and get rinsed/ pump and dumped. \n\nAs far as finances, I think what OP is saying is,  if your finances are such that one \"undeserved\" PPM makes a notable impact, they're going to be equally impacted each week by a successful SR. \n\nThis is the confusing thing to me about the whole discussion.  The loss to a bad or bad-faith date isn't the money. My sugar money is budgeted for the (week/ month/year depending on how you want to look at it) and was spent either way. It's the loss of time- that's one more week before I find my next actual SB. One more week of chatting and vetting and setting up M&Gs and all that  grunt work.  And there's an emotional cost too, whether it's a rejection or a premeditated rinsing, I'm going to _feel_ rejected to some degree. I thought  she was interested in me, but it turns out she wasn't.",
            "author": "Undertow83",
            "id": "goi02uy",
            "parent_id": "t1_gohsyi6",
            "score": 5,
            "created_utc": 1614110549.0,
            "replies": [
                {
                    "body": ">That's not what OP said. There's a difference between accepting that it's a risk and accepting that it's a norm.\n\nThat may not be what he said, but based on a zillion stories here, following his advice exactly leads to taking a lot of unnecessary risk , and he's trying to find a way to dismiss it and/or shame those who care about that.\n\nIt is quite easy, IMO, to both take simple precautions against getting scammed, and fulfill the spirit of being a great SD: 1. don't agree to payments up front for the M&G and/or initial platonic dates, which gets the rinsers dropping out, and then 2. give her a gift anyway.    It is incredibly simple, and works amazingly well.  No need to try to use grade-school level shaming (oh ho!  You can't afford it, then!).  There is absolutely no reason to bring up whether one can \"afford\" to lose a PPM otherwise;  anyone who has read slf for even a day knows full well that isn't why SDs won't promise payment up-front for M&Gs, so this point is disingenuous... and that same reader also knows SDs here promote the idea of giving her a gift anyway (provided she looks like her pics yadda yadda)",
                    "author": "Azurecole",
                    "id": "goi1uir",
                    "parent_id": "t1_goi02uy",
                    "score": 2,
                    "created_utc": 1614111270.0,
                    "replies": [
                        {
                            "body": ">and he's trying to find a way to dismiss it and/or shame those who care about that.\n\nnope\n\n\\---\n\nFirst, I don't think we're that far apart in our approach / philosophy. Even though the rhetoric is a bit heated. \n\nSecond, it really depends on what you mean by \"a lot of unnecessary risk\" - if I've reviewed an SBs profile, texted with them a while, spoken on the phone with them and had a M&G with them. And they go through all of that to rinse me for a platonic PPM, that doesn't seem like a lot of risk to me. That feels pretty low risk. \n\nThis word \"buffoon\" - it's a fabulous word, it's just fun to say / read - but I don't think it's the right word to describe a person following the game plan I outline above - which primarily involves taking time to get to know someone.. and that process will cause a lot of the scammers to drop off. and then, if after all of that they still seem like a strong candidate (relative to other women that I'm going through the same process with), then it feels like a low risk.\n\nIt feels to me like there's a group of SDs who are pissed that they can't get it down to ZERO risk. \n\nLast thing, I think your strategy re M&G is fine. Maybe even optimal. But let's also get clear on this: Your position that giving a surprise gift on good faith M&G's is not the norm. \n\nI'm saying this: I think it should be the norm. Maybe be careful about telegraphing your intention in certain circumstances (or in certain markets/areas). But, for me, giving a gift for a M&G that was good, but doesn't lead to an SR feels like the right thing to do.",
                            "author": "SwimmingInSugar",
                            "id": "gojerml",
                            "parent_id": "t1_goi1uir",
                            "score": 2,
                            "created_utc": 1614134169.0,
                            "replies": [
                                {
                                    "body": ">First, I don't think we're that far apart in our approach / philosophy\n\nI think that's probably true.  In the end, we have similar views on how an SD treats an SB -- which isn't necessarily anything any other SD has to buy into, but we're not far apart.   But I think it's a pretty critical tool -- more for the M&G, but also for platonic up-front dates -- to have her show up without a guaranteed payoff.  It's not one I'm willing to give up.\n\n>Second, it really depends on what you mean by \"a lot of unnecessary  risk\" - if I've reviewed an SBs profile, texted with them a while,  spoken on the phone with them and had a M&G with them. And they go  through all of that to rinse me for a platonic PPM, that doesn't seem  like a lot of risk to me. That feels pretty low risk.\n\nI don't think it's ever one PPM, do you?  The girls who do this go for as many PPM dates as possible, and based on many SD stories it seems like they're extremely adept at making it feel like \"Just a couple more, I'm getting super comfortable\".  They ghost when the SD finally puts his foot down.  I think you might be underestimating them -- most of the stories I've read, the girls went to the M&Gs, texted in between, etc., their whole deal is to get him excited and invested, then sunken-cost him until he wises up.\n\nI just don't see a need for any of this aggravation, when I think I can put nearly all of this to bed by just doing it my way... and still go home at night happy that I treated her well.\n\n>Last thing, I think your strategy re M&G is fine. Maybe even  optimal. But let's also get clear on this: Your position that giving a  surprise gift on good faith M&G's is not the norm.\n\nYou think so?  I think it's the norm **on slf.**   Nearly every SD does this, or claims they do, no?\n\nAlso, agree \"buffoon\" is a fantastic word.",
                                    "author": "Azurecole",
                                    "id": "gojgqk9",
                                    "parent_id": "t1_gojerml",
                                    "score": 2,
                                    "created_utc": 1614135143.0,
                                    "replies": [
                                        {
                                            "body": "I would love to see some data on all this. bcs it's super speculative right now. I'm sampling from (1) my experience and (2) the specific posts/comments that I've chanced to read on SLF and (3) conversations with a few friends that have some experience here.\n\nThat's a fairly small and skewed sample. \n\nWhich is to say: I don't \\_really\\_ know what the norm is. In the real world. Or on SLF. \n\nI have a feeling. \n\nAnd it's influenced by the highly charged posts from the last couple days. Where it felt like a number of SDs were losing their minds over the issue of paying and not getting sex.\n\nTheir comments + behavior felt (feel) wrong to me.\n\n\\---\n\nI probably am underestimating the scammers. In large part bcs I haven't had a traumatic experience like the one you describe, being played for multiple dates. \n\nI shake my head and say, \"That wouldn't happen to me.\"\n\nWhich another part of me know is exactly the kind of attitude that opens to the door to getting taken.\n\nBut without knowing how often this stuff happens. and some of the underlying fact pattern / details. it's really hard to know what level of risk there is for an SD that takes reasonable precautions. \n\nMy sense is that a good number of the guys who got scammed let their dick do too much of the thinking. and ignored a lot of red flags. \n\nbut I also admit that there are high quality scam artists out there. In every domain. And it's not just about $$$. They enjoy the art of the steal. If your adversary is an experienced pro, almost everyone is probably going to get taken down...\n\nok, I think I've run out of useful things to say (probably happened a few hundred (thousand?) words ago)\n\nI take my leave.",
                                            "author": "SwimmingInSugar",
                                            "id": "gojizdz",
                                            "parent_id": "t1_gojgqk9",
                                            "score": 3,
                                            "created_utc": 1614136240.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Alright that's fair. I think you're maybe a little harsh on OP, but your argument isn't without merit.",
                            "author": "Undertow83",
                            "id": "goi2y4h",
                            "parent_id": "t1_goi1uir",
                            "score": 0,
                            "created_utc": 1614111693.0,
                            "replies": [
                                {
                                    "body": "I might be being less than generous on my interpretation :)  I do admit the \"if you can't afford to lose PPM you shouldn't be an SD\", I always find to be incredibly manipulative and disingenuous.  Don't get me wrong, it's also true.  But it's not a good reason to be a buffoon, which is always what the sentences following propose.",
                                    "author": "Azurecole",
                                    "id": "goi5ltd",
                                    "parent_id": "t1_goi2y4h",
                                    "score": 1,
                                    "created_utc": 1614112716.0,
                                    "replies": [
                                        {
                                            "body": ">it's also true\n\nlol\n\nyup\n\n\\---\n\nnot intended to be manipulative. \n\nintention: Wake up SDs. Shit doesn't always go right. Whether it's in business or in the bowl. \n\nSometimes you go out to dinner and the deal doesn't come together. You flew into town. Stayed at a hotel. You paid for the meal. \n\nAre you a buffoon now? \n\nNot necessarily.  \n\nIt's a cost of doing business. Deal with it.\n\nDef not suggesting that people just turn into money-burning buffoons.\n\nI am suggesting that SDs are likely to have some screening expenses. \n\nBe realistic. Budget for it. Emotionally and financially. \n\nThat's it. Not complicated.",
                                            "author": "SwimmingInSugar",
                                            "id": "gojfr3f",
                                            "parent_id": "t1_goi5ltd",
                                            "score": 3,
                                            "created_utc": 1614134661.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't think so. The point was to compare SRs (where there's full consent) to domains that I views as generally having less consent than SRs: (1) Escorts. (2) Sex-slaves. \n\nIt's not that the world of escorts and sex-slaves are identical. but (imo) they share this: they typically live in a different place on the continuum of consent than SRs.",
            "author": "SwimmingInSugar",
            "id": "goi3jpl",
            "parent_id": "t1_gohs0vq",
            "score": 8,
            "created_utc": 1614111925.0,
            "replies": [
                {
                    "body": "Unpopular Opinion: GFE Escorts and SRs are actually almost identical. In fact SA started because he wanted to choose how he paid for GFE.",
                    "author": null,
                    "id": "goihfrj",
                    "parent_id": "t1_goi3jpl",
                    "score": 12,
                    "created_utc": 1614117571.0,
                    "replies": [
                        {
                            "body": "I don't know GFE-Escort (GFEE), but it's easy to believe that GFEE could have a lot of overlap with SR. And in some cases be identical. \n\nStill, GFEE is just a part of Escort-land. And other parts of the escort-world may have less overlap with SRs.",
                            "author": "SwimmingInSugar",
                            "id": "gojcio0",
                            "parent_id": "t1_goihfrj",
                            "score": 3,
                            "created_utc": 1614133024.0,
                            "replies": []
                        },
                        {
                            "body": "Agree.",
                            "author": "sanfran4fun",
                            "id": "goiozgv",
                            "parent_id": "t1_goihfrj",
                            "score": 1,
                            "created_utc": 1614121159.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> Our next meet was PPM and I communicated that I was happy to keep my boxers on the whole time and that intimacy would involve sexual pleasure for her only\n\nThis always seems to work for me!\n\nI'm way more into \"Ladies First\" anyway and look to totally blowing their mind out of the water for intimate date #1 with me grinning like a Silver Fox and them stumbling and giggling while they can barely walk away... Then, when they usually come at me like an insatiable unleashed lioness afterwards? WOOT! Win/Win!!!",
            "author": "SDRippington",
            "id": "gos04ap",
            "parent_id": "t1_gohqz7f",
            "score": 1,
            "created_utc": 1614301754.0,
            "replies": []
        },
        {
            "body": "Aww, thanks :)\n\nI love your posts too. \n\nLet's skip right past the room and head down the aisle. \n\nJust let me know what size ring and how many carats",
            "author": "SwimmingInSugar",
            "id": "gojgpma",
            "parent_id": "t1_goht23w",
            "score": 3,
            "created_utc": 1614135130.0,
            "replies": []
        },
        {
            "body": "I've encountered plenty that flaked or ghosted after the M&G. My assumption was that they weren't interested or found a better fit. \n\nBut I've also turned down a lot of SBs after the M&G. If something doesn't seem like an amazing fit, why keep going?",
            "author": "emptyoverflow",
            "id": "goi1udr",
            "parent_id": "t1_gohtebn",
            "score": 5,
            "created_utc": 1614111269.0,
            "replies": []
        },
        {
            "body": "I’ve turned down maybe 50%? Either we just didn’t click conversationally and it was all awkward silences, or we didn’t align on safe sex practices, or they just acted like a horny eighth grader the whole time.",
            "author": null,
            "id": "goin415",
            "parent_id": "t1_gohtebn",
            "score": 4,
            "created_utc": 1614120261.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gohu1nw",
            "parent_id": "t1_gohtebn",
            "score": 5,
            "created_utc": 1614107915.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "goitqqd",
                    "parent_id": "t1_gohu1nw",
                    "score": 2,
                    "created_utc": 1614123491.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "goiuhwy",
                            "parent_id": "t1_goitqqd",
                            "score": 1,
                            "created_utc": 1614123860.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gojb6sq",
                                    "parent_id": "t1_goiuhwy",
                                    "score": 2,
                                    "created_utc": 1614132346.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Real ones, probably not. \n\nThe problem is we can’t really tell the difference between a rinser and someone rejecting you...it looks the same.",
            "author": "throwawaysugar1980",
            "id": "gohueqf",
            "parent_id": "t1_gohtebn",
            "score": 1,
            "created_utc": 1614108072.0,
            "replies": []
        },
        {
            "body": "this resonates with me. \n\nI am definitely bringing some puritanical baggage with me. and have been surprised at how open women have been. \n\nit's been a real education and I'm hugely grateful to them for helping me unlearn some of these hangups.",
            "author": "SwimmingInSugar",
            "id": "gojgi9w",
            "parent_id": "t1_gojajx7",
            "score": 2,
            "created_utc": 1614135033.0,
            "replies": []
        },
        {
            "body": "True. Only on SLF do they become virtuous virgins waiting for a promise ring to go to second base.",
            "author": "OldschoolSD",
            "id": "gom1hp7",
            "parent_id": "t1_gojajx7",
            "score": 0,
            "created_utc": 1614191774.0,
            "replies": []
        },
        {
            "body": "So you ditched your upbringing..",
            "author": null,
            "id": "gpagmk8",
            "parent_id": "t1_gojajx7",
            "score": 1,
            "created_utc": 1614599331.0,
            "replies": []
        },
        {
            "body": "screed. \n\nlove that word. \n\nmade me curious about the etymology: \"early 14c., \"fragment,\" also \"strip of cloth,\" from northern England dialectal variant of Old English *screade* (see [**shred**](https://www.etymonline.com/word/shred?ref=etymonline_crossreference#etymonline_v_23444) (n.)). Meaning \"lengthy speech\" is first recorded 1789, from notion of reading from a long list.\"\n\nA little odd in terms of an origin story. Also, not a very old word.",
            "author": "SwimmingInSugar",
            "id": "gojh3wf",
            "parent_id": "t1_gohv4mj",
            "score": 3,
            "created_utc": 1614135319.0,
            "replies": [
                {
                    "body": "Thanks for the history lesson :)  I mean that seriously, not in the sarcastic way.\n\nGiven all the downvotes i got, i'm surprised... i just found it funny that you would always abbreviate that one word and nothing else..  i guess others are not a fan",
                    "author": "Acrobatic_Half_6631",
                    "id": "gol6ie8",
                    "parent_id": "t1_gojh3wf",
                    "score": 1,
                    "created_utc": 1614178960.0,
                    "replies": [
                        {
                            "body": "abbreviation is not one of my strengths\n\nand when I do abbreviate, it's often stylistically questionable\n\nI honestly need to work on tidying up my prose, being more concise. \n\n\\---\n\nI love etymology, sometimes you'll dig up something really interesting about the history of a word. I mostly use this site: [https://www.etymonline.com](https://www.etymonline.com)",
                            "author": "SwimmingInSugar",
                            "id": "goo9bya",
                            "parent_id": "t1_gol6ie8",
                            "score": 2,
                            "created_utc": 1614229704.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "goikmbh",
            "parent_id": "t1_goikm9q",
            "score": 1,
            "created_utc": 1614119069.0,
            "replies": []
        },
        {
            "body": "Bingo",
            "author": null,
            "id": "gokzy7n",
            "parent_id": "t1_gojp2gs",
            "score": 2,
            "created_utc": 1614175666.0,
            "replies": []
        },
        {
            "body": "Lol just curious, why didn’t you want sex.",
            "author": "Fun_Focus8159",
            "id": "gohubq4",
            "parent_id": "t1_gohu6lp",
            "score": 5,
            "created_utc": 1614108036.0,
            "replies": [
                {
                    "body": "I was too drunk to perform, i.e. had a single glass of wine.",
                    "author": "JeaneyBowl",
                    "id": "gohx5kl",
                    "parent_id": "t1_gohubq4",
                    "score": 11,
                    "created_utc": 1614109275.0,
                    "replies": [
                        {
                            "body": "I hear you man. I usually prefer having sex before drinking because I perform better also. I tell all my sexual partners this. However, of course they all want to have a few drinks before getting intimate. If we’ve been drinking all night then I’ll just want to go to bed, and no sex lol. It’s the SB’s that usually want to have sex haha. \n\nSame thing happened to me recently with one of my SB’s. She came over and I made her dinner. Had lots of wine. She started to get frisky and wanted to have sex but I wasn’t in the mood after a big dinner and lots of wine. She seemed a little offended and later told me she felt like I didn’t want her anymore. I said no I was just super full and drunk lol!",
                            "author": "Fun_Focus8159",
                            "id": "gohyhvs",
                            "parent_id": "t1_gohx5kl",
                            "score": 10,
                            "created_utc": 1614109859.0,
                            "replies": [
                                {
                                    "body": "I dont drink (but used to). Honestly a large meal and a bunch of alcohol does nothing but diminish my libido.",
                                    "author": null,
                                    "id": "goi0ftb",
                                    "parent_id": "t1_gohyhvs",
                                    "score": 8,
                                    "created_utc": 1614110711.0,
                                    "replies": [
                                        {
                                            "body": "Amen brother same here. Who wants to have sex with a full stomach! Feels weird.",
                                            "author": "Fun_Focus8159",
                                            "id": "goi0uaj",
                                            "parent_id": "t1_goi0ftb",
                                            "score": 8,
                                            "created_utc": 1614110886.0,
                                            "replies": [
                                                {
                                                    "body": "c'mon all the sloshing noises and ear belching is sexy!",
                                                    "author": "idk_letstry",
                                                    "id": "golzag2",
                                                    "parent_id": "t1_goi0uaj",
                                                    "score": 1,
                                                    "created_utc": 1614190963.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "She didn’t want the PPM. She said she didn’t feel right since she didn’t feel comfortable having sex.",
            "author": "Fun_Focus8159",
            "id": "goj64pb",
            "parent_id": "t1_goj5ly9",
            "score": 1,
            "created_utc": 1614129716.0,
            "replies": [
                {
                    "body": "Ahh i see. Sounds like she didn't know what she was going into.",
                    "author": "AvenueLane96",
                    "id": "goj6tln",
                    "parent_id": "t1_goj64pb",
                    "score": 2,
                    "created_utc": 1614130078.0,
                    "replies": [
                        {
                            "body": "Yea for sure. It was her first time doing anything like that before. She was one of those that works full time and doesn’t need/want the money. For her it was more about having fun and sexual experiences with an older man.",
                            "author": "Fun_Focus8159",
                            "id": "goj7rp1",
                            "parent_id": "t1_goj6tln",
                            "score": 1,
                            "created_utc": 1614130565.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol no. I’m in Texas and she’s from the US. \n\nI imagine this happens quite a bit with women new to the bowel who think they can be intimate for a PPM, but when it comes down to actually doing it, they get scared off.",
            "author": "Fun_Focus8159",
            "id": "gojdiqt",
            "parent_id": "t1_gojczsd",
            "score": 1,
            "created_utc": 1614133531.0,
            "replies": []
        },
        {
            "body": "I always pay PPM after intimacy is over and right before she leaves.",
            "author": "Fun_Focus8159",
            "id": "gojq0c7",
            "parent_id": "t1_gojp8o3",
            "score": 1,
            "created_utc": 1614140087.0,
            "replies": [
                {
                    "body": "Im willing to risk her not having sex to make them feel.comfortable.\n\nIts a test if they do it i just never see them.again",
                    "author": "wb19081908",
                    "id": "gojt7zh",
                    "parent_id": "t1_gojq0c7",
                    "score": 6,
                    "created_utc": 1614141994.0,
                    "replies": [
                        {
                            "body": "> Im willing to risk her not having sex to make them feel.comfortable.\n> \n> Its a test if they do it i just never see them.again\n\nI've done this and feel the exact same way. I've had them get cold feet (total of twice) and walk before. Whatever. Their loss. \n\nTells me all I needed to know about them when they kept the money :-) \n\nInterestingly enough I had both want to \"try again\" and I told them both not interested. \n\nFool me once, shame on you. Fool me twice? Shame on me.",
                            "author": "SDRippington",
                            "id": "gorxs8b",
                            "parent_id": "t1_gojt7zh",
                            "score": 2,
                            "created_utc": 1614300593.0,
                            "replies": [
                                {
                                    "body": "Yeh sometimes they message next week desperate foe money and I just gjost them.  I let anyone tip me off just once.",
                                    "author": "wb19081908",
                                    "id": "gos3wb6",
                                    "parent_id": "t1_gorxs8b",
                                    "score": 1,
                                    "created_utc": 1614303652.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I’ve never seen an uncomfortable SB, and all of mine have always received it  at the end of the date, and most of them initiated intimacy",
                            "author": null,
                            "id": "gol2odi",
                            "parent_id": "t1_gojt7zh",
                            "score": 0,
                            "created_utc": 1614177078.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Who fishes in a barrel and not a pond",
            "author": "oneangstybiscuit",
            "id": "gojw500",
            "parent_id": "t1_goj2m0e",
            "score": 1,
            "created_utc": 1614143834.0,
            "replies": [
                {
                    "body": "You’re right. Yiu shoot the fish in the barrel and fish the ones in the pond.",
                    "author": "Diditall4thecookie",
                    "id": "goknntf",
                    "parent_id": "t1_gojw500",
                    "score": 1,
                    "created_utc": 1614167752.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes. This. All of it.",
            "author": "FoxyFreckles1989",
            "id": "goid59o",
            "parent_id": "t1_goi5li9",
            "score": 11,
            "created_utc": 1614115643.0,
            "replies": []
        },
        {
            "body": "This!  If guys want a sexual guarantee so long as they aren't diseased or dangerous there is a whole population of professional workers they can hire.\n\nIf they want the chance of authenticity, mutual attractive, mutual feelings then you invest, reward vs risk.",
            "author": "sugarsenior2",
            "id": "goigp25",
            "parent_id": "t1_goi5li9",
            "score": 8,
            "created_utc": 1614117237.0,
            "replies": [
                {
                    "body": "Unfortunately most -SDs- don’t see it that way 💔",
                    "author": "Beachbabe1024",
                    "id": "gom01w8",
                    "parent_id": "t1_goigp25",
                    "score": 3,
                    "created_utc": 1614191243.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you 🙏🏼",
            "author": "Beachbabe1024",
            "id": "golzhtb",
            "parent_id": "t1_goi5li9",
            "score": 3,
            "created_utc": 1614191039.0,
            "replies": []
        },
        {
            "body": "“I don't understand why so many SDs are so vehemently resistant to paying for non-intimate dates.”\n\nExactly!!! Time = money but these guys are not *real* sugar daddies, can’t afford to be and most likely not even old enough ... and I guess it caters to their ego to say they have a sugarbaby instead of a prostitute, even though a prostitute is what they want...  \n\nI really hate the term Rinser ... It’s like those vanilla dater‘s who feel like a girl “used them for dinner” if she doesn’t put out after a few dates... when you are dating, sex is always a possibility but never a guarantee  \n\nThe thing about older men, who have been successful in life, who are maybe lonely or have a lot of time on their hands because they are retired ... these men are super generous and just happy to be around a young beautiful girl... money frees up her time, time that can be spent with him, and it takes some of the burden off her shoulder as most young ppl are broke \n\nI mean, don’t you guys have grandparents? You never had your grandpa give you hundred bucks for something small like taking out the trash ? This why I personally think no one under 55 can be a SD ...",
            "author": "PsychologicalMud9673",
            "id": "gojsg60",
            "parent_id": "t1_goi5li9",
            "score": 3,
            "created_utc": 1614141527.0,
            "replies": [
                {
                    "body": ">I mean, don’t you guys have grandparents? You never had your grandpa give you hundred bucks for something small like taking out the trash ? Th\n\nLol if I had a grandpa who would hand me a hundred bucks for taking out the trash, I probably would have never considered being a SB.",
                    "author": "stubbed_m_toe",
                    "id": "goke3if",
                    "parent_id": "t1_gojsg60",
                    "score": 2,
                    "created_utc": 1614158905.0,
                    "replies": []
                },
                {
                    "body": "This!! So true... I have guys younger than me trying to be my “SD” lol that is not what I am looking for",
                    "author": "Beachbabe1024",
                    "id": "gom0h86",
                    "parent_id": "t1_gojsg60",
                    "score": 2,
                    "created_utc": 1614191400.0,
                    "replies": [
                        {
                            "body": "Young men are typically not in the position to freely give money... that’s why they are so bitter and resentful when they do",
                            "author": "PsychologicalMud9673",
                            "id": "gom1uh2",
                            "parent_id": "t1_gom0h86",
                            "score": 2,
                            "created_utc": 1614191901.0,
                            "replies": [
                                {
                                    "body": "Absolutely... I even added a note on my profile about me looking for an older and experienced SD Only, but it hasn’t really helped",
                                    "author": "Beachbabe1024",
                                    "id": "gom7ngn",
                                    "parent_id": "t1_gom1uh2",
                                    "score": 2,
                                    "created_utc": 1614194095.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Marketing expense. If SB isn’t willing to invest 15 minutes to meet in person I assume she’s rinsing. You have to spend (time or money) to market the product. SD is paying customer doesn’t need to market himself but obviously must be attractive enough arrangement for SB to accept.",
            "author": "sanfran4fun",
            "id": "goipfnj",
            "parent_id": "t1_goi5li9",
            "score": -1,
            "created_utc": 1614121373.0,
            "replies": []
        },
        {
            "body": "if you're communicating well\n\nand you get to a date where you've both talked about what you want to happen. \n\nand you've agreed that you both want intimacy. \n\nand then they just take the money and don't hold up their side of the agreement. \n\nand don't offer a decent reason why\\*\n\nthen the experience fits into the rinser category. They lied / took advantage of you.\n\n\\*Shouldn't we allow for the honest possibility that they start the date intending one thing and then change their mind for a legit reason? \n\nHaven't you ever started with one intention - out of legit good faith - and then changed your mind? Shouldn't an SB be allowed to do the same?",
            "author": "SwimmingInSugar",
            "id": "goi4br3",
            "parent_id": "t1_gohqauc",
            "score": 12,
            "created_utc": 1614112221.0,
            "replies": []
        },
        {
            "body": "That wasn't a strawman, just responding to what you wrote.\n\n>Do the work to screen / filter.  \n>  \n>Do the work to communicate.  \n>  \n>And 98% of the time that'll be enough.\n\nScreening, filtering, and communicating are important, I definitely agree.  But your 98% number is made up from whole cloth.  There's not a whole lot of effective screening against a convincing rinser to be done in advance, it's not a difficult skill to be convincing,and all you have to do is be awake to see it's not uncommon and more guys than not have been stung; hell, that's WHY they stopped agreeing to M&G fees in advance.\n\nWhile screening and filtering is important, IME there's exactly one way to get to that 98% number: don't agree to that up-front M&G fee or initial-platonic-dates fee.  Absolute best tool we have.  But that doesn't mean you shouldn't live up to being whatever your vision of a good SD is ... once the rinsers have weeded themselves out because you won't agree to their M&G fee, give the SB who shows up a gift anyway.   \"Don't make goofy choices that are known to have a high probability of leading to getting scammed\" and \"be a good SD\" can be easily made to work together.  The idea that these things are incompatible -- you're a generous SD \\*\\*or\\*\\* you don't agree to M&G fees up front -- is false.",
            "author": "Azurecole",
            "id": "goi9av5",
            "parent_id": "t1_goi771i",
            "score": 3,
            "created_utc": 1614114127.0,
            "replies": [
                {
                    "body": "Exactly this. I mean, if any SB have a better idea on how to protect ourselves from rinsers, I am all ear. But so far I have not found any. Taking the lost is not an option. That would be like saying to SB to not protect themselves from PnD and just take the lost.",
                    "author": "NewbieDaddy",
                    "id": "goiemp6",
                    "parent_id": "t1_goi9av5",
                    "score": -1,
                    "created_utc": 1614116299.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">That's not what OP said. There's a difference between accepting that it's a risk and accepting that it's a norm.\n\nThat may not be what he said, but based on a zillion stories here, following his advice exactly leads to taking a lot of unnecessary risk , and he's trying to find a way to dismiss it and/or shame those who care about that.\n\nIt is quite easy, IMO, to both take simple precautions against getting scammed, and fulfill the spirit of being a great SD: 1. don't agree to payments up front for the M&G and/or initial platonic dates, which gets the rinsers dropping out, and then 2. give her a gift anyway.    It is incredibly simple, and works amazingly well.  No need to try to use grade-school level shaming (oh ho!  You can't afford it, then!).  There is absolutely no reason to bring up whether one can \"afford\" to lose a PPM otherwise;  anyone who has read slf for even a day knows full well that isn't why SDs won't promise payment up-front for M&Gs, so this point is disingenuous... and that same reader also knows SDs here promote the idea of giving her a gift anyway (provided she looks like her pics yadda yadda)",
            "author": "Azurecole",
            "id": "goi1uir",
            "parent_id": "t1_goi02uy",
            "score": 2,
            "created_utc": 1614111270.0,
            "replies": [
                {
                    "body": ">and he's trying to find a way to dismiss it and/or shame those who care about that.\n\nnope\n\n\\---\n\nFirst, I don't think we're that far apart in our approach / philosophy. Even though the rhetoric is a bit heated. \n\nSecond, it really depends on what you mean by \"a lot of unnecessary risk\" - if I've reviewed an SBs profile, texted with them a while, spoken on the phone with them and had a M&G with them. And they go through all of that to rinse me for a platonic PPM, that doesn't seem like a lot of risk to me. That feels pretty low risk. \n\nThis word \"buffoon\" - it's a fabulous word, it's just fun to say / read - but I don't think it's the right word to describe a person following the game plan I outline above - which primarily involves taking time to get to know someone.. and that process will cause a lot of the scammers to drop off. and then, if after all of that they still seem like a strong candidate (relative to other women that I'm going through the same process with), then it feels like a low risk.\n\nIt feels to me like there's a group of SDs who are pissed that they can't get it down to ZERO risk. \n\nLast thing, I think your strategy re M&G is fine. Maybe even optimal. But let's also get clear on this: Your position that giving a surprise gift on good faith M&G's is not the norm. \n\nI'm saying this: I think it should be the norm. Maybe be careful about telegraphing your intention in certain circumstances (or in certain markets/areas). But, for me, giving a gift for a M&G that was good, but doesn't lead to an SR feels like the right thing to do.",
                    "author": "SwimmingInSugar",
                    "id": "gojerml",
                    "parent_id": "t1_goi1uir",
                    "score": 2,
                    "created_utc": 1614134169.0,
                    "replies": [
                        {
                            "body": ">First, I don't think we're that far apart in our approach / philosophy\n\nI think that's probably true.  In the end, we have similar views on how an SD treats an SB -- which isn't necessarily anything any other SD has to buy into, but we're not far apart.   But I think it's a pretty critical tool -- more for the M&G, but also for platonic up-front dates -- to have her show up without a guaranteed payoff.  It's not one I'm willing to give up.\n\n>Second, it really depends on what you mean by \"a lot of unnecessary  risk\" - if I've reviewed an SBs profile, texted with them a while,  spoken on the phone with them and had a M&G with them. And they go  through all of that to rinse me for a platonic PPM, that doesn't seem  like a lot of risk to me. That feels pretty low risk.\n\nI don't think it's ever one PPM, do you?  The girls who do this go for as many PPM dates as possible, and based on many SD stories it seems like they're extremely adept at making it feel like \"Just a couple more, I'm getting super comfortable\".  They ghost when the SD finally puts his foot down.  I think you might be underestimating them -- most of the stories I've read, the girls went to the M&Gs, texted in between, etc., their whole deal is to get him excited and invested, then sunken-cost him until he wises up.\n\nI just don't see a need for any of this aggravation, when I think I can put nearly all of this to bed by just doing it my way... and still go home at night happy that I treated her well.\n\n>Last thing, I think your strategy re M&G is fine. Maybe even  optimal. But let's also get clear on this: Your position that giving a  surprise gift on good faith M&G's is not the norm.\n\nYou think so?  I think it's the norm **on slf.**   Nearly every SD does this, or claims they do, no?\n\nAlso, agree \"buffoon\" is a fantastic word.",
                            "author": "Azurecole",
                            "id": "gojgqk9",
                            "parent_id": "t1_gojerml",
                            "score": 2,
                            "created_utc": 1614135143.0,
                            "replies": [
                                {
                                    "body": "I would love to see some data on all this. bcs it's super speculative right now. I'm sampling from (1) my experience and (2) the specific posts/comments that I've chanced to read on SLF and (3) conversations with a few friends that have some experience here.\n\nThat's a fairly small and skewed sample. \n\nWhich is to say: I don't \\_really\\_ know what the norm is. In the real world. Or on SLF. \n\nI have a feeling. \n\nAnd it's influenced by the highly charged posts from the last couple days. Where it felt like a number of SDs were losing their minds over the issue of paying and not getting sex.\n\nTheir comments + behavior felt (feel) wrong to me.\n\n\\---\n\nI probably am underestimating the scammers. In large part bcs I haven't had a traumatic experience like the one you describe, being played for multiple dates. \n\nI shake my head and say, \"That wouldn't happen to me.\"\n\nWhich another part of me know is exactly the kind of attitude that opens to the door to getting taken.\n\nBut without knowing how often this stuff happens. and some of the underlying fact pattern / details. it's really hard to know what level of risk there is for an SD that takes reasonable precautions. \n\nMy sense is that a good number of the guys who got scammed let their dick do too much of the thinking. and ignored a lot of red flags. \n\nbut I also admit that there are high quality scam artists out there. In every domain. And it's not just about $$$. They enjoy the art of the steal. If your adversary is an experienced pro, almost everyone is probably going to get taken down...\n\nok, I think I've run out of useful things to say (probably happened a few hundred (thousand?) words ago)\n\nI take my leave.",
                                    "author": "SwimmingInSugar",
                                    "id": "gojizdz",
                                    "parent_id": "t1_gojgqk9",
                                    "score": 3,
                                    "created_utc": 1614136240.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Alright that's fair. I think you're maybe a little harsh on OP, but your argument isn't without merit.",
                    "author": "Undertow83",
                    "id": "goi2y4h",
                    "parent_id": "t1_goi1uir",
                    "score": 0,
                    "created_utc": 1614111693.0,
                    "replies": [
                        {
                            "body": "I might be being less than generous on my interpretation :)  I do admit the \"if you can't afford to lose PPM you shouldn't be an SD\", I always find to be incredibly manipulative and disingenuous.  Don't get me wrong, it's also true.  But it's not a good reason to be a buffoon, which is always what the sentences following propose.",
                            "author": "Azurecole",
                            "id": "goi5ltd",
                            "parent_id": "t1_goi2y4h",
                            "score": 1,
                            "created_utc": 1614112716.0,
                            "replies": [
                                {
                                    "body": ">it's also true\n\nlol\n\nyup\n\n\\---\n\nnot intended to be manipulative. \n\nintention: Wake up SDs. Shit doesn't always go right. Whether it's in business or in the bowl. \n\nSometimes you go out to dinner and the deal doesn't come together. You flew into town. Stayed at a hotel. You paid for the meal. \n\nAre you a buffoon now? \n\nNot necessarily.  \n\nIt's a cost of doing business. Deal with it.\n\nDef not suggesting that people just turn into money-burning buffoons.\n\nI am suggesting that SDs are likely to have some screening expenses. \n\nBe realistic. Budget for it. Emotionally and financially. \n\nThat's it. Not complicated.",
                                    "author": "SwimmingInSugar",
                                    "id": "gojfr3f",
                                    "parent_id": "t1_goi5ltd",
                                    "score": 3,
                                    "created_utc": 1614134661.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Unpopular Opinion: GFE Escorts and SRs are actually almost identical. In fact SA started because he wanted to choose how he paid for GFE.",
            "author": null,
            "id": "goihfrj",
            "parent_id": "t1_goi3jpl",
            "score": 12,
            "created_utc": 1614117571.0,
            "replies": [
                {
                    "body": "I don't know GFE-Escort (GFEE), but it's easy to believe that GFEE could have a lot of overlap with SR. And in some cases be identical. \n\nStill, GFEE is just a part of Escort-land. And other parts of the escort-world may have less overlap with SRs.",
                    "author": "SwimmingInSugar",
                    "id": "gojcio0",
                    "parent_id": "t1_goihfrj",
                    "score": 3,
                    "created_utc": 1614133024.0,
                    "replies": []
                },
                {
                    "body": "Agree.",
                    "author": "sanfran4fun",
                    "id": "goiozgv",
                    "parent_id": "t1_goihfrj",
                    "score": 1,
                    "created_utc": 1614121159.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "goitqqd",
            "parent_id": "t1_gohu1nw",
            "score": 2,
            "created_utc": 1614123491.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "goiuhwy",
                    "parent_id": "t1_goitqqd",
                    "score": 1,
                    "created_utc": 1614123860.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gojb6sq",
                            "parent_id": "t1_goiuhwy",
                            "score": 2,
                            "created_utc": 1614132346.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks for the history lesson :)  I mean that seriously, not in the sarcastic way.\n\nGiven all the downvotes i got, i'm surprised... i just found it funny that you would always abbreviate that one word and nothing else..  i guess others are not a fan",
            "author": "Acrobatic_Half_6631",
            "id": "gol6ie8",
            "parent_id": "t1_gojh3wf",
            "score": 1,
            "created_utc": 1614178960.0,
            "replies": [
                {
                    "body": "abbreviation is not one of my strengths\n\nand when I do abbreviate, it's often stylistically questionable\n\nI honestly need to work on tidying up my prose, being more concise. \n\n\\---\n\nI love etymology, sometimes you'll dig up something really interesting about the history of a word. I mostly use this site: [https://www.etymonline.com](https://www.etymonline.com)",
                    "author": "SwimmingInSugar",
                    "id": "goo9bya",
                    "parent_id": "t1_gol6ie8",
                    "score": 2,
                    "created_utc": 1614229704.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was too drunk to perform, i.e. had a single glass of wine.",
            "author": "JeaneyBowl",
            "id": "gohx5kl",
            "parent_id": "t1_gohubq4",
            "score": 11,
            "created_utc": 1614109275.0,
            "replies": [
                {
                    "body": "I hear you man. I usually prefer having sex before drinking because I perform better also. I tell all my sexual partners this. However, of course they all want to have a few drinks before getting intimate. If we’ve been drinking all night then I’ll just want to go to bed, and no sex lol. It’s the SB’s that usually want to have sex haha. \n\nSame thing happened to me recently with one of my SB’s. She came over and I made her dinner. Had lots of wine. She started to get frisky and wanted to have sex but I wasn’t in the mood after a big dinner and lots of wine. She seemed a little offended and later told me she felt like I didn’t want her anymore. I said no I was just super full and drunk lol!",
                    "author": "Fun_Focus8159",
                    "id": "gohyhvs",
                    "parent_id": "t1_gohx5kl",
                    "score": 10,
                    "created_utc": 1614109859.0,
                    "replies": [
                        {
                            "body": "I dont drink (but used to). Honestly a large meal and a bunch of alcohol does nothing but diminish my libido.",
                            "author": null,
                            "id": "goi0ftb",
                            "parent_id": "t1_gohyhvs",
                            "score": 8,
                            "created_utc": 1614110711.0,
                            "replies": [
                                {
                                    "body": "Amen brother same here. Who wants to have sex with a full stomach! Feels weird.",
                                    "author": "Fun_Focus8159",
                                    "id": "goi0uaj",
                                    "parent_id": "t1_goi0ftb",
                                    "score": 8,
                                    "created_utc": 1614110886.0,
                                    "replies": [
                                        {
                                            "body": "c'mon all the sloshing noises and ear belching is sexy!",
                                            "author": "idk_letstry",
                                            "id": "golzag2",
                                            "parent_id": "t1_goi0uaj",
                                            "score": 1,
                                            "created_utc": 1614190963.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ahh i see. Sounds like she didn't know what she was going into.",
            "author": "AvenueLane96",
            "id": "goj6tln",
            "parent_id": "t1_goj64pb",
            "score": 2,
            "created_utc": 1614130078.0,
            "replies": [
                {
                    "body": "Yea for sure. It was her first time doing anything like that before. She was one of those that works full time and doesn’t need/want the money. For her it was more about having fun and sexual experiences with an older man.",
                    "author": "Fun_Focus8159",
                    "id": "goj7rp1",
                    "parent_id": "t1_goj6tln",
                    "score": 1,
                    "created_utc": 1614130565.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Im willing to risk her not having sex to make them feel.comfortable.\n\nIts a test if they do it i just never see them.again",
            "author": "wb19081908",
            "id": "gojt7zh",
            "parent_id": "t1_gojq0c7",
            "score": 6,
            "created_utc": 1614141994.0,
            "replies": [
                {
                    "body": "> Im willing to risk her not having sex to make them feel.comfortable.\n> \n> Its a test if they do it i just never see them.again\n\nI've done this and feel the exact same way. I've had them get cold feet (total of twice) and walk before. Whatever. Their loss. \n\nTells me all I needed to know about them when they kept the money :-) \n\nInterestingly enough I had both want to \"try again\" and I told them both not interested. \n\nFool me once, shame on you. Fool me twice? Shame on me.",
                    "author": "SDRippington",
                    "id": "gorxs8b",
                    "parent_id": "t1_gojt7zh",
                    "score": 2,
                    "created_utc": 1614300593.0,
                    "replies": [
                        {
                            "body": "Yeh sometimes they message next week desperate foe money and I just gjost them.  I let anyone tip me off just once.",
                            "author": "wb19081908",
                            "id": "gos3wb6",
                            "parent_id": "t1_gorxs8b",
                            "score": 1,
                            "created_utc": 1614303652.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I’ve never seen an uncomfortable SB, and all of mine have always received it  at the end of the date, and most of them initiated intimacy",
                    "author": null,
                    "id": "gol2odi",
                    "parent_id": "t1_gojt7zh",
                    "score": 0,
                    "created_utc": 1614177078.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You’re right. Yiu shoot the fish in the barrel and fish the ones in the pond.",
            "author": "Diditall4thecookie",
            "id": "goknntf",
            "parent_id": "t1_gojw500",
            "score": 1,
            "created_utc": 1614167752.0,
            "replies": []
        },
        {
            "body": "Unfortunately most -SDs- don’t see it that way 💔",
            "author": "Beachbabe1024",
            "id": "gom01w8",
            "parent_id": "t1_goigp25",
            "score": 3,
            "created_utc": 1614191243.0,
            "replies": []
        },
        {
            "body": ">I mean, don’t you guys have grandparents? You never had your grandpa give you hundred bucks for something small like taking out the trash ? Th\n\nLol if I had a grandpa who would hand me a hundred bucks for taking out the trash, I probably would have never considered being a SB.",
            "author": "stubbed_m_toe",
            "id": "goke3if",
            "parent_id": "t1_gojsg60",
            "score": 2,
            "created_utc": 1614158905.0,
            "replies": []
        },
        {
            "body": "This!! So true... I have guys younger than me trying to be my “SD” lol that is not what I am looking for",
            "author": "Beachbabe1024",
            "id": "gom0h86",
            "parent_id": "t1_gojsg60",
            "score": 2,
            "created_utc": 1614191400.0,
            "replies": [
                {
                    "body": "Young men are typically not in the position to freely give money... that’s why they are so bitter and resentful when they do",
                    "author": "PsychologicalMud9673",
                    "id": "gom1uh2",
                    "parent_id": "t1_gom0h86",
                    "score": 2,
                    "created_utc": 1614191901.0,
                    "replies": [
                        {
                            "body": "Absolutely... I even added a note on my profile about me looking for an older and experienced SD Only, but it hasn’t really helped",
                            "author": "Beachbabe1024",
                            "id": "gom7ngn",
                            "parent_id": "t1_gom1uh2",
                            "score": 2,
                            "created_utc": 1614194095.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly this. I mean, if any SB have a better idea on how to protect ourselves from rinsers, I am all ear. But so far I have not found any. Taking the lost is not an option. That would be like saying to SB to not protect themselves from PnD and just take the lost.",
            "author": "NewbieDaddy",
            "id": "goiemp6",
            "parent_id": "t1_goi9av5",
            "score": -1,
            "created_utc": 1614116299.0,
            "replies": []
        },
        {
            "body": ">and he's trying to find a way to dismiss it and/or shame those who care about that.\n\nnope\n\n\\---\n\nFirst, I don't think we're that far apart in our approach / philosophy. Even though the rhetoric is a bit heated. \n\nSecond, it really depends on what you mean by \"a lot of unnecessary risk\" - if I've reviewed an SBs profile, texted with them a while, spoken on the phone with them and had a M&G with them. And they go through all of that to rinse me for a platonic PPM, that doesn't seem like a lot of risk to me. That feels pretty low risk. \n\nThis word \"buffoon\" - it's a fabulous word, it's just fun to say / read - but I don't think it's the right word to describe a person following the game plan I outline above - which primarily involves taking time to get to know someone.. and that process will cause a lot of the scammers to drop off. and then, if after all of that they still seem like a strong candidate (relative to other women that I'm going through the same process with), then it feels like a low risk.\n\nIt feels to me like there's a group of SDs who are pissed that they can't get it down to ZERO risk. \n\nLast thing, I think your strategy re M&G is fine. Maybe even optimal. But let's also get clear on this: Your position that giving a surprise gift on good faith M&G's is not the norm. \n\nI'm saying this: I think it should be the norm. Maybe be careful about telegraphing your intention in certain circumstances (or in certain markets/areas). But, for me, giving a gift for a M&G that was good, but doesn't lead to an SR feels like the right thing to do.",
            "author": "SwimmingInSugar",
            "id": "gojerml",
            "parent_id": "t1_goi1uir",
            "score": 2,
            "created_utc": 1614134169.0,
            "replies": [
                {
                    "body": ">First, I don't think we're that far apart in our approach / philosophy\n\nI think that's probably true.  In the end, we have similar views on how an SD treats an SB -- which isn't necessarily anything any other SD has to buy into, but we're not far apart.   But I think it's a pretty critical tool -- more for the M&G, but also for platonic up-front dates -- to have her show up without a guaranteed payoff.  It's not one I'm willing to give up.\n\n>Second, it really depends on what you mean by \"a lot of unnecessary  risk\" - if I've reviewed an SBs profile, texted with them a while,  spoken on the phone with them and had a M&G with them. And they go  through all of that to rinse me for a platonic PPM, that doesn't seem  like a lot of risk to me. That feels pretty low risk.\n\nI don't think it's ever one PPM, do you?  The girls who do this go for as many PPM dates as possible, and based on many SD stories it seems like they're extremely adept at making it feel like \"Just a couple more, I'm getting super comfortable\".  They ghost when the SD finally puts his foot down.  I think you might be underestimating them -- most of the stories I've read, the girls went to the M&Gs, texted in between, etc., their whole deal is to get him excited and invested, then sunken-cost him until he wises up.\n\nI just don't see a need for any of this aggravation, when I think I can put nearly all of this to bed by just doing it my way... and still go home at night happy that I treated her well.\n\n>Last thing, I think your strategy re M&G is fine. Maybe even  optimal. But let's also get clear on this: Your position that giving a  surprise gift on good faith M&G's is not the norm.\n\nYou think so?  I think it's the norm **on slf.**   Nearly every SD does this, or claims they do, no?\n\nAlso, agree \"buffoon\" is a fantastic word.",
                    "author": "Azurecole",
                    "id": "gojgqk9",
                    "parent_id": "t1_gojerml",
                    "score": 2,
                    "created_utc": 1614135143.0,
                    "replies": [
                        {
                            "body": "I would love to see some data on all this. bcs it's super speculative right now. I'm sampling from (1) my experience and (2) the specific posts/comments that I've chanced to read on SLF and (3) conversations with a few friends that have some experience here.\n\nThat's a fairly small and skewed sample. \n\nWhich is to say: I don't \\_really\\_ know what the norm is. In the real world. Or on SLF. \n\nI have a feeling. \n\nAnd it's influenced by the highly charged posts from the last couple days. Where it felt like a number of SDs were losing their minds over the issue of paying and not getting sex.\n\nTheir comments + behavior felt (feel) wrong to me.\n\n\\---\n\nI probably am underestimating the scammers. In large part bcs I haven't had a traumatic experience like the one you describe, being played for multiple dates. \n\nI shake my head and say, \"That wouldn't happen to me.\"\n\nWhich another part of me know is exactly the kind of attitude that opens to the door to getting taken.\n\nBut without knowing how often this stuff happens. and some of the underlying fact pattern / details. it's really hard to know what level of risk there is for an SD that takes reasonable precautions. \n\nMy sense is that a good number of the guys who got scammed let their dick do too much of the thinking. and ignored a lot of red flags. \n\nbut I also admit that there are high quality scam artists out there. In every domain. And it's not just about $$$. They enjoy the art of the steal. If your adversary is an experienced pro, almost everyone is probably going to get taken down...\n\nok, I think I've run out of useful things to say (probably happened a few hundred (thousand?) words ago)\n\nI take my leave.",
                            "author": "SwimmingInSugar",
                            "id": "gojizdz",
                            "parent_id": "t1_gojgqk9",
                            "score": 3,
                            "created_utc": 1614136240.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Alright that's fair. I think you're maybe a little harsh on OP, but your argument isn't without merit.",
            "author": "Undertow83",
            "id": "goi2y4h",
            "parent_id": "t1_goi1uir",
            "score": 0,
            "created_utc": 1614111693.0,
            "replies": [
                {
                    "body": "I might be being less than generous on my interpretation :)  I do admit the \"if you can't afford to lose PPM you shouldn't be an SD\", I always find to be incredibly manipulative and disingenuous.  Don't get me wrong, it's also true.  But it's not a good reason to be a buffoon, which is always what the sentences following propose.",
                    "author": "Azurecole",
                    "id": "goi5ltd",
                    "parent_id": "t1_goi2y4h",
                    "score": 1,
                    "created_utc": 1614112716.0,
                    "replies": [
                        {
                            "body": ">it's also true\n\nlol\n\nyup\n\n\\---\n\nnot intended to be manipulative. \n\nintention: Wake up SDs. Shit doesn't always go right. Whether it's in business or in the bowl. \n\nSometimes you go out to dinner and the deal doesn't come together. You flew into town. Stayed at a hotel. You paid for the meal. \n\nAre you a buffoon now? \n\nNot necessarily.  \n\nIt's a cost of doing business. Deal with it.\n\nDef not suggesting that people just turn into money-burning buffoons.\n\nI am suggesting that SDs are likely to have some screening expenses. \n\nBe realistic. Budget for it. Emotionally and financially. \n\nThat's it. Not complicated.",
                            "author": "SwimmingInSugar",
                            "id": "gojfr3f",
                            "parent_id": "t1_goi5ltd",
                            "score": 3,
                            "created_utc": 1614134661.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't know GFE-Escort (GFEE), but it's easy to believe that GFEE could have a lot of overlap with SR. And in some cases be identical. \n\nStill, GFEE is just a part of Escort-land. And other parts of the escort-world may have less overlap with SRs.",
            "author": "SwimmingInSugar",
            "id": "gojcio0",
            "parent_id": "t1_goihfrj",
            "score": 3,
            "created_utc": 1614133024.0,
            "replies": []
        },
        {
            "body": "Agree.",
            "author": "sanfran4fun",
            "id": "goiozgv",
            "parent_id": "t1_goihfrj",
            "score": 1,
            "created_utc": 1614121159.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "goiuhwy",
            "parent_id": "t1_goitqqd",
            "score": 1,
            "created_utc": 1614123860.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gojb6sq",
                    "parent_id": "t1_goiuhwy",
                    "score": 2,
                    "created_utc": 1614132346.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "abbreviation is not one of my strengths\n\nand when I do abbreviate, it's often stylistically questionable\n\nI honestly need to work on tidying up my prose, being more concise. \n\n\\---\n\nI love etymology, sometimes you'll dig up something really interesting about the history of a word. I mostly use this site: [https://www.etymonline.com](https://www.etymonline.com)",
            "author": "SwimmingInSugar",
            "id": "goo9bya",
            "parent_id": "t1_gol6ie8",
            "score": 2,
            "created_utc": 1614229704.0,
            "replies": []
        },
        {
            "body": "I hear you man. I usually prefer having sex before drinking because I perform better also. I tell all my sexual partners this. However, of course they all want to have a few drinks before getting intimate. If we’ve been drinking all night then I’ll just want to go to bed, and no sex lol. It’s the SB’s that usually want to have sex haha. \n\nSame thing happened to me recently with one of my SB’s. She came over and I made her dinner. Had lots of wine. She started to get frisky and wanted to have sex but I wasn’t in the mood after a big dinner and lots of wine. She seemed a little offended and later told me she felt like I didn’t want her anymore. I said no I was just super full and drunk lol!",
            "author": "Fun_Focus8159",
            "id": "gohyhvs",
            "parent_id": "t1_gohx5kl",
            "score": 10,
            "created_utc": 1614109859.0,
            "replies": [
                {
                    "body": "I dont drink (but used to). Honestly a large meal and a bunch of alcohol does nothing but diminish my libido.",
                    "author": null,
                    "id": "goi0ftb",
                    "parent_id": "t1_gohyhvs",
                    "score": 8,
                    "created_utc": 1614110711.0,
                    "replies": [
                        {
                            "body": "Amen brother same here. Who wants to have sex with a full stomach! Feels weird.",
                            "author": "Fun_Focus8159",
                            "id": "goi0uaj",
                            "parent_id": "t1_goi0ftb",
                            "score": 8,
                            "created_utc": 1614110886.0,
                            "replies": [
                                {
                                    "body": "c'mon all the sloshing noises and ear belching is sexy!",
                                    "author": "idk_letstry",
                                    "id": "golzag2",
                                    "parent_id": "t1_goi0uaj",
                                    "score": 1,
                                    "created_utc": 1614190963.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yea for sure. It was her first time doing anything like that before. She was one of those that works full time and doesn’t need/want the money. For her it was more about having fun and sexual experiences with an older man.",
            "author": "Fun_Focus8159",
            "id": "goj7rp1",
            "parent_id": "t1_goj6tln",
            "score": 1,
            "created_utc": 1614130565.0,
            "replies": []
        },
        {
            "body": "> Im willing to risk her not having sex to make them feel.comfortable.\n> \n> Its a test if they do it i just never see them.again\n\nI've done this and feel the exact same way. I've had them get cold feet (total of twice) and walk before. Whatever. Their loss. \n\nTells me all I needed to know about them when they kept the money :-) \n\nInterestingly enough I had both want to \"try again\" and I told them both not interested. \n\nFool me once, shame on you. Fool me twice? Shame on me.",
            "author": "SDRippington",
            "id": "gorxs8b",
            "parent_id": "t1_gojt7zh",
            "score": 2,
            "created_utc": 1614300593.0,
            "replies": [
                {
                    "body": "Yeh sometimes they message next week desperate foe money and I just gjost them.  I let anyone tip me off just once.",
                    "author": "wb19081908",
                    "id": "gos3wb6",
                    "parent_id": "t1_gorxs8b",
                    "score": 1,
                    "created_utc": 1614303652.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ve never seen an uncomfortable SB, and all of mine have always received it  at the end of the date, and most of them initiated intimacy",
            "author": null,
            "id": "gol2odi",
            "parent_id": "t1_gojt7zh",
            "score": 0,
            "created_utc": 1614177078.0,
            "replies": []
        },
        {
            "body": "Young men are typically not in the position to freely give money... that’s why they are so bitter and resentful when they do",
            "author": "PsychologicalMud9673",
            "id": "gom1uh2",
            "parent_id": "t1_gom0h86",
            "score": 2,
            "created_utc": 1614191901.0,
            "replies": [
                {
                    "body": "Absolutely... I even added a note on my profile about me looking for an older and experienced SD Only, but it hasn’t really helped",
                    "author": "Beachbabe1024",
                    "id": "gom7ngn",
                    "parent_id": "t1_gom1uh2",
                    "score": 2,
                    "created_utc": 1614194095.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">First, I don't think we're that far apart in our approach / philosophy\n\nI think that's probably true.  In the end, we have similar views on how an SD treats an SB -- which isn't necessarily anything any other SD has to buy into, but we're not far apart.   But I think it's a pretty critical tool -- more for the M&G, but also for platonic up-front dates -- to have her show up without a guaranteed payoff.  It's not one I'm willing to give up.\n\n>Second, it really depends on what you mean by \"a lot of unnecessary  risk\" - if I've reviewed an SBs profile, texted with them a while,  spoken on the phone with them and had a M&G with them. And they go  through all of that to rinse me for a platonic PPM, that doesn't seem  like a lot of risk to me. That feels pretty low risk.\n\nI don't think it's ever one PPM, do you?  The girls who do this go for as many PPM dates as possible, and based on many SD stories it seems like they're extremely adept at making it feel like \"Just a couple more, I'm getting super comfortable\".  They ghost when the SD finally puts his foot down.  I think you might be underestimating them -- most of the stories I've read, the girls went to the M&Gs, texted in between, etc., their whole deal is to get him excited and invested, then sunken-cost him until he wises up.\n\nI just don't see a need for any of this aggravation, when I think I can put nearly all of this to bed by just doing it my way... and still go home at night happy that I treated her well.\n\n>Last thing, I think your strategy re M&G is fine. Maybe even  optimal. But let's also get clear on this: Your position that giving a  surprise gift on good faith M&G's is not the norm.\n\nYou think so?  I think it's the norm **on slf.**   Nearly every SD does this, or claims they do, no?\n\nAlso, agree \"buffoon\" is a fantastic word.",
            "author": "Azurecole",
            "id": "gojgqk9",
            "parent_id": "t1_gojerml",
            "score": 2,
            "created_utc": 1614135143.0,
            "replies": [
                {
                    "body": "I would love to see some data on all this. bcs it's super speculative right now. I'm sampling from (1) my experience and (2) the specific posts/comments that I've chanced to read on SLF and (3) conversations with a few friends that have some experience here.\n\nThat's a fairly small and skewed sample. \n\nWhich is to say: I don't \\_really\\_ know what the norm is. In the real world. Or on SLF. \n\nI have a feeling. \n\nAnd it's influenced by the highly charged posts from the last couple days. Where it felt like a number of SDs were losing their minds over the issue of paying and not getting sex.\n\nTheir comments + behavior felt (feel) wrong to me.\n\n\\---\n\nI probably am underestimating the scammers. In large part bcs I haven't had a traumatic experience like the one you describe, being played for multiple dates. \n\nI shake my head and say, \"That wouldn't happen to me.\"\n\nWhich another part of me know is exactly the kind of attitude that opens to the door to getting taken.\n\nBut without knowing how often this stuff happens. and some of the underlying fact pattern / details. it's really hard to know what level of risk there is for an SD that takes reasonable precautions. \n\nMy sense is that a good number of the guys who got scammed let their dick do too much of the thinking. and ignored a lot of red flags. \n\nbut I also admit that there are high quality scam artists out there. In every domain. And it's not just about $$$. They enjoy the art of the steal. If your adversary is an experienced pro, almost everyone is probably going to get taken down...\n\nok, I think I've run out of useful things to say (probably happened a few hundred (thousand?) words ago)\n\nI take my leave.",
                    "author": "SwimmingInSugar",
                    "id": "gojizdz",
                    "parent_id": "t1_gojgqk9",
                    "score": 3,
                    "created_utc": 1614136240.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I might be being less than generous on my interpretation :)  I do admit the \"if you can't afford to lose PPM you shouldn't be an SD\", I always find to be incredibly manipulative and disingenuous.  Don't get me wrong, it's also true.  But it's not a good reason to be a buffoon, which is always what the sentences following propose.",
            "author": "Azurecole",
            "id": "goi5ltd",
            "parent_id": "t1_goi2y4h",
            "score": 1,
            "created_utc": 1614112716.0,
            "replies": [
                {
                    "body": ">it's also true\n\nlol\n\nyup\n\n\\---\n\nnot intended to be manipulative. \n\nintention: Wake up SDs. Shit doesn't always go right. Whether it's in business or in the bowl. \n\nSometimes you go out to dinner and the deal doesn't come together. You flew into town. Stayed at a hotel. You paid for the meal. \n\nAre you a buffoon now? \n\nNot necessarily.  \n\nIt's a cost of doing business. Deal with it.\n\nDef not suggesting that people just turn into money-burning buffoons.\n\nI am suggesting that SDs are likely to have some screening expenses. \n\nBe realistic. Budget for it. Emotionally and financially. \n\nThat's it. Not complicated.",
                    "author": "SwimmingInSugar",
                    "id": "gojfr3f",
                    "parent_id": "t1_goi5ltd",
                    "score": 3,
                    "created_utc": 1614134661.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gojb6sq",
            "parent_id": "t1_goiuhwy",
            "score": 2,
            "created_utc": 1614132346.0,
            "replies": []
        },
        {
            "body": "I dont drink (but used to). Honestly a large meal and a bunch of alcohol does nothing but diminish my libido.",
            "author": null,
            "id": "goi0ftb",
            "parent_id": "t1_gohyhvs",
            "score": 8,
            "created_utc": 1614110711.0,
            "replies": [
                {
                    "body": "Amen brother same here. Who wants to have sex with a full stomach! Feels weird.",
                    "author": "Fun_Focus8159",
                    "id": "goi0uaj",
                    "parent_id": "t1_goi0ftb",
                    "score": 8,
                    "created_utc": 1614110886.0,
                    "replies": [
                        {
                            "body": "c'mon all the sloshing noises and ear belching is sexy!",
                            "author": "idk_letstry",
                            "id": "golzag2",
                            "parent_id": "t1_goi0uaj",
                            "score": 1,
                            "created_utc": 1614190963.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeh sometimes they message next week desperate foe money and I just gjost them.  I let anyone tip me off just once.",
            "author": "wb19081908",
            "id": "gos3wb6",
            "parent_id": "t1_gorxs8b",
            "score": 1,
            "created_utc": 1614303652.0,
            "replies": []
        },
        {
            "body": "Absolutely... I even added a note on my profile about me looking for an older and experienced SD Only, but it hasn’t really helped",
            "author": "Beachbabe1024",
            "id": "gom7ngn",
            "parent_id": "t1_gom1uh2",
            "score": 2,
            "created_utc": 1614194095.0,
            "replies": []
        },
        {
            "body": "I would love to see some data on all this. bcs it's super speculative right now. I'm sampling from (1) my experience and (2) the specific posts/comments that I've chanced to read on SLF and (3) conversations with a few friends that have some experience here.\n\nThat's a fairly small and skewed sample. \n\nWhich is to say: I don't \\_really\\_ know what the norm is. In the real world. Or on SLF. \n\nI have a feeling. \n\nAnd it's influenced by the highly charged posts from the last couple days. Where it felt like a number of SDs were losing their minds over the issue of paying and not getting sex.\n\nTheir comments + behavior felt (feel) wrong to me.\n\n\\---\n\nI probably am underestimating the scammers. In large part bcs I haven't had a traumatic experience like the one you describe, being played for multiple dates. \n\nI shake my head and say, \"That wouldn't happen to me.\"\n\nWhich another part of me know is exactly the kind of attitude that opens to the door to getting taken.\n\nBut without knowing how often this stuff happens. and some of the underlying fact pattern / details. it's really hard to know what level of risk there is for an SD that takes reasonable precautions. \n\nMy sense is that a good number of the guys who got scammed let their dick do too much of the thinking. and ignored a lot of red flags. \n\nbut I also admit that there are high quality scam artists out there. In every domain. And it's not just about $$$. They enjoy the art of the steal. If your adversary is an experienced pro, almost everyone is probably going to get taken down...\n\nok, I think I've run out of useful things to say (probably happened a few hundred (thousand?) words ago)\n\nI take my leave.",
            "author": "SwimmingInSugar",
            "id": "gojizdz",
            "parent_id": "t1_gojgqk9",
            "score": 3,
            "created_utc": 1614136240.0,
            "replies": []
        },
        {
            "body": ">it's also true\n\nlol\n\nyup\n\n\\---\n\nnot intended to be manipulative. \n\nintention: Wake up SDs. Shit doesn't always go right. Whether it's in business or in the bowl. \n\nSometimes you go out to dinner and the deal doesn't come together. You flew into town. Stayed at a hotel. You paid for the meal. \n\nAre you a buffoon now? \n\nNot necessarily.  \n\nIt's a cost of doing business. Deal with it.\n\nDef not suggesting that people just turn into money-burning buffoons.\n\nI am suggesting that SDs are likely to have some screening expenses. \n\nBe realistic. Budget for it. Emotionally and financially. \n\nThat's it. Not complicated.",
            "author": "SwimmingInSugar",
            "id": "gojfr3f",
            "parent_id": "t1_goi5ltd",
            "score": 3,
            "created_utc": 1614134661.0,
            "replies": []
        },
        {
            "body": "Amen brother same here. Who wants to have sex with a full stomach! Feels weird.",
            "author": "Fun_Focus8159",
            "id": "goi0uaj",
            "parent_id": "t1_goi0ftb",
            "score": 8,
            "created_utc": 1614110886.0,
            "replies": [
                {
                    "body": "c'mon all the sloshing noises and ear belching is sexy!",
                    "author": "idk_letstry",
                    "id": "golzag2",
                    "parent_id": "t1_goi0uaj",
                    "score": 1,
                    "created_utc": 1614190963.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "c'mon all the sloshing noises and ear belching is sexy!",
            "author": "idk_letstry",
            "id": "golzag2",
            "parent_id": "t1_goi0uaj",
            "score": 1,
            "created_utc": 1614190963.0,
            "replies": []
        }
    ]
}