{
    "title": "Take a step back, and see it through someone else's eyes",
    "post_id": "5tg6kz",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/5tg6kz/take_a_step_back_and_see_it_through_someone_elses/",
    "author": "SDRippington",
    "body": "I was having some very long conversations over Reddit PM’s yesterday (seriously, my fingers are almost bleeding) and something that one of the SB’s pointed out to me made me stop and give pause.\n\nShe said:\n\n> I think guys just don't get what it's like for us in the bowl. The biggest concerns you guys seem to have relate to your wallets and egos. But we have to worry about being raped, abused, scammed, stalked, disrespected, insulted, treated like objects. The stakes are just so much higher for us. \n\n> It can be really scary and nerve wracking. We feel so vulnerable. You guys are like 3x our ages and have decades of experience on us, negotiating ability, net worth, etc. The power imbalance is crazy. And women in general are used to putting other people's feelings over our own and not being assertive so we're especially at a disadvantage.\n\nShe also made a rather poignant quote from Margaret Atwood — \n\n> \"Men are afraid that women will laugh at them. Women are afraid that men will kill them.\"\n\nSo this got me to thinking. As an SD I feel like I'm always bitching about the \"flakes\" the \"rinsers\" and how so many SB's are out there trying to play us. I rarely if ever \"slow my roll\" and take a step back to try to see it from the eyes of the SB sitting across from me at Starbucks - and learn what things must look like from her perspective.\n\nIs this post meant for the degenerate douchebags that treat women like shit? No. Even if I were to etch the word \"respect\" into a baseball bat and beat them with it, those ass-clowns don't care.\n\nNo, this post is directed to SD's like me. Ones that some days get frustrated with the POT that's acting so skittish and we get impatient thinking, _\"why can't she see I actually am a nice guy?!\"_. I realize it doesn't have anything to do with _me_ per-se, but the fact is that to this beautiful unicorn sitting across from me? I could just as easily be a starving lion as I could a small stuffed teddy bear spreading my little stuffed arms as wide as they can go and saying \"I like you!\"\n\nAm I saying \"Good things come to those who wait?\" Not completely ;-) That unicorn sitting across from me is gorgeous, intelligent, so full of wonder and life that if I wait too long she _will_ pick another companion. That is a given.\n\nWhat I am saying is don't go so fast you scare her off - as in \"The early bird gets the worm, but it's the second mouse that gets the cheese\" Don't be the worm, and especially don't be the _first_ mouse!\n\nSlow and steady wins the race - the race being spending time with a playful unicorn in ways that enrich both of our lives.\n\nSo if you're frustrated? I get it! Just stop. Take a deep breath, and remember to look at this whole \"dance\" from _her_ perspective every now and again. \n\nBeautiful, intelligent women are like bars of soap. They smell amazing, feel awesome against your skin, but if you squeeze too tight? That soap is gonna pop outta your hand and go flying across the bathroom. You'll shake your head and be all like \"Son of a!....\" and you're going to make a horrible mess of the place trying to get it again.\n\nSo stop squeezing so damn tight! lol!\n\n\n",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/5tg6kz/take_a_step_back_and_see_it_through_someone_elses/",
    "score": 103,
    "upvote_ratio": 0.95,
    "created_utc": 1486833887.0,
    "num_comments": 96,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Thanks for the post Rip. Really resonates with me right now. Had a M&G and the pot would not stop suggesting getting a hotel and starting the arrangement the same night. Had he just slowed the fuck down it maybe could have turned to something in the future but I was creeped out by that time!! Thanks again.",
            "author": "grandmaSb",
            "id": "ddmhos8",
            "parent_id": "t3_5tg6kz",
            "score": 17,
            "created_utc": 1486845421.0,
            "replies": [
                {
                    "body": "SDs who are patient about sex can do very very well.  But I some SDs just want to notch up conquests.",
                    "author": "DSMIAGuy",
                    "id": "ddmli70",
                    "parent_id": "t1_ddmhos8",
                    "score": 8,
                    "created_utc": 1486851198.0,
                    "replies": []
                },
                {
                    "body": "And when they truly show that they do not care much about us as a person at all and try to move so fast. I can go fast when we have had lots of conversations and have the gist of each other; but one dude who was pressuring me to move it to a hotel did not pass my pop quiz- \"what is my name\"? Feels like a tinder date, haha!",
                    "author": null,
                    "id": "ddmmr5k",
                    "parent_id": "t1_ddmhos8",
                    "score": 9,
                    "created_utc": 1486853122.0,
                    "replies": [
                        {
                            "body": "> did not pass my pop quiz- \"what is my name\"? \n\na classic.........  ",
                            "author": "pinotandsugar",
                            "id": "ddmyv04",
                            "parent_id": "t1_ddmmr5k",
                            "score": 5,
                            "created_utc": 1486872128.0,
                            "replies": []
                        },
                        {
                            "body": "I recently had the opposite problem.  A girl pressuring me to go to the hotel across the street from a trendy bar.  I didn't even know there was a hotel across the street.  I think it all really depends on the guy, girl and chemistry.  Even in my vanilla dating years, I struggle to recall the girls that it took more than a week to sleep with.  Usually if it was more than a week or 2, they just weren't that into me and we never dated in the first place.  But I do agree with the post about this being risky for the girl.  For the guy, it's just expensive (you can go to Maui or Europe 3-6x a year on what it takes to sugar), lose your reputation (and income, family if you have one).  But girls stand a greater chance of losing their health or life.  Thus proving that free money for something simple is never really free.",
                            "author": null,
                            "id": "ddnawpq",
                            "parent_id": "t1_ddmmr5k",
                            "score": 5,
                            "created_utc": 1486903385.0,
                            "replies": [
                                {
                                    "body": "\"Even in my vanilla dating years, I struggle to recall the girls that it took more than a week to sleep with. \" Yes, at least in the vanilla dating world I try to stress this exact concept vs the people who want to wait x amount of dates or 2 months to be intimate. If you had to wait that long, maybe I am not attracted to you; do not slut shame someone who actually wants to jump your bones! Be flattered! ",
                                    "author": null,
                                    "id": "ddnntj8",
                                    "parent_id": "t1_ddnawpq",
                                    "score": 1,
                                    "created_utc": 1486925715.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Great post and it's always good to be reminded of this. \n\nI agree that the stakes for a SB are much higher, normally in every sense.\n\nIf we put aside the physical and potential emotional risks for one moment and focus on simple practicalities, then SBs are at a disadvantage.\n\nNormally a SB will be entering the bowl with some level of financial necessity attached, not always, but I suspect in most cases this would be true. Bills to pay, student loans to clear....likely minimal disposable income.\n\nEvery SD is doing this through pure choice, we've made our money and now we're going to splurge on a beautiful young woman....the difference could not me more stark.\n\nAt every stage of the relationship the SB is at a disadvantage and it takes a step back to realize that we have a responsibility as SD's to act accordingly.\n\n\n",
            "author": "SDGentleman70",
            "id": "ddmjmai",
            "parent_id": "t3_5tg6kz",
            "score": 15,
            "created_utc": 1486848316.0,
            "replies": []
        },
        {
            "body": "Empathy is wonderful and difficult skill. Unfortunately not everyone has it naturally.",
            "author": "midwesternguru",
            "id": "ddmg59i",
            "parent_id": "t3_5tg6kz",
            "score": 12,
            "created_utc": 1486843146.0,
            "replies": [
                {
                    "body": "So so true... I think I have more empathy for most... Problem is my sympathy is on the low side. I can see them in their shoes... but most of the time I think they brought it on with their poor decisions!",
                    "author": "SD_AU",
                    "id": "ddmmmh8",
                    "parent_id": "t1_ddmg59i",
                    "score": 5,
                    "created_utc": 1486852924.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes this is a huge problem. When scammers and douche bags take really great POT SBs and turn them cynical and skittish because of such poor behavior. It really ruins things for SDs out there that want a true SR.",
            "author": "Ryan111778",
            "id": "ddm9rnm",
            "parent_id": "t3_5tg6kz",
            "score": 31,
            "created_utc": 1486834196.0,
            "replies": [
                {
                    "body": "And with the closing down of Backpage, the pool is even more diluted on both sides with predators on both sides making it a rather wild ocean to navigate.\n\nI guess it just means in that in order to find a quality SR, learning patience and even a little more empathy we can still find what we're looking for. ",
                    "author": "SDRippington",
                    "id": "ddm9vm3",
                    "parent_id": "t1_ddm9rnm",
                    "score": 14,
                    "created_utc": 1486834353.0,
                    "replies": [
                        {
                            "body": "I have had a couple POTs recently that I tried to set up a M&G with and they just wanted me to come over to their apartment for an hour. Hmmm.....",
                            "author": "Ryan111778",
                            "id": "ddma6b6",
                            "parent_id": "t1_ddm9vm3",
                            "score": 2,
                            "created_utc": 1486834783.0,
                            "replies": [
                                {
                                    "body": "Like I said - pool is being diluted.",
                                    "author": "SDRippington",
                                    "id": "ddmag65",
                                    "parent_id": "t1_ddma6b6",
                                    "score": 5,
                                    "created_utc": 1486835175.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Sorry to be the bearer of bad news. IMHO, the quoted two paragraphs came from a very \"professional\" perspective, and were meant to manipulate.  A normal girl would not be spelling out those two paragraphs for you, as it would not deter a real scammer or rapist.  A normal girl is not likely to play her vulnerability card to a stranger; a pro would. If a normal girl actually believed what she wrote, the only rational course of action would be quitting the venue altogether; I would if I were in her shoes believing what she purports to believe. The reward/risk ratio doesn't make any sense.\n\nBTW, while she is correct that men are usually physically stronger than women, women are mentally much more capable than men when it comes to relationships and framing the other person's mind. Historically, it was probably necessary for women to use their brains to move the muscles around them.\n\nEdit: OK, the professional down-voters are afraid that their industrial secret is out in the open, may as well lay the detailed analysis out in the open, as reward for their down-voting:\n\n> I think guys just don't get what it's like for us in the bowl. \n\nThen shouldn't she find someone who gets it instead? or stop meeting guys altogether?  Why does she insist on meeting guys who don't get it? Classic industrial-grade shaming tactic to start the conversation.\n\n> The biggest concerns you guys seem to have relate to your wallets and egos. But we have to worry about being raped, abused, scammed, stalked, disrespected, insulted, treated like objects. The stakes are just so much higher for us.\n\nIf she is treating it like normal dating, why would she be encountering that long list of reactions (any more  than normal vanilla dating)?  How is risk of being raped/abused/stalked any greater in the sugar bowl than in vanilla (online) dating? given that the guy in the sugar bowl is likely to have more assets and social standing at risk than the average guy in vanilla online dating. Is she advocating parents be match makers or mandatory chaperones for all (online) dating? Why is she not if she believes those high risks. Scammed is a wallet issue; disrespected/insulted/treated like objects are ego issues.  Does she believe her ego is more important than the POT's ego? Yes she does, as she clearly stated, and she believes you should agree that her ego is more important than yours.   \n\n> It can be really scary and nerve wracking. We feel so vulnerable. \n\nThen why not get out of the sugar bowl? I'm not saying people shouldn't take precautions; however, trying to manipulate using the \"vulnerability\" card is tantamount to perverse selection: cock-blocking the \"nice guys\" while not having any effect on the less ethical. Most normal girls know that and therefore don't play the card; it's the professionals who play that card in order to exploit the men.  Most normal girls know some risks are involved just like in normal vanilla dating; that's why they find guys who are attractive enough and capable enough then stick with them. It's the professionals who talk about exorbitant risks and then keep going back into the bowl fishing for the next patron.\n\n>You guys are like 3x our ages \n\nWhy doesn't she pick someone 2x or 1.5x? 20x3=60, 25x3=75. There are plenty SD's not that old. The \"SB\" who assumes and is deliberately looking for men in their 60-75 years of age is probably a pro, as she clearly associates sex in the sugar bowl with distaste. How can she not be a pro if all she finds are men 3x her own age? and has to speak of herself in plural? as in the prostitute collective.\n\n> and have decades of experience on us, negotiating ability, net worth, etc. The power imbalance is crazy. \n\nShe probably has more sex partners in a year than he does in a decade if not a life time. The power imbalance is crazy: he is the romantic whereas she is the exploitationist; she has him by the balls.\n\n> And women in general are used to putting other people's feelings over our own and not being assertive so we're especially at a disadvantage.\n\nThe general case is not correct, unless \"other people\" means her own children. She has clearly shown that her ego is more important to her than your ego is to her . . . which is not wrong in itself, but very manipulative of her then to claim herself putting other people's feelings ahead of her own. The two paragraphs indicate at least narcissistic personality: unable to recognize other people's feelings. Could be a BPD chronicle liar as well. An attractive girl finding relatively easy success in the sugar bowl wouldn't have the dire thoughts or first-hand experience to share with you. ",
                            "author": "orsugar",
                            "id": "ddmyy0x",
                            "parent_id": "t1_ddm9vm3",
                            "score": -11,
                            "created_utc": 1486872262.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ddnp3os",
                    "parent_id": "t1_ddm9rnm",
                    "score": 5,
                    "created_utc": 1486927481.0,
                    "replies": [
                        {
                            "body": "Good job taking one sentence out of context and trying to start a fight for no reason.",
                            "author": "Ryan111778",
                            "id": "ddnrcta",
                            "parent_id": "t1_ddnp3os",
                            "score": 3,
                            "created_utc": 1486930585.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm torn between responding with earnest agreement and responding with, \"In other news, water is wet.\"",
            "author": "sugarfatty",
            "id": "ddmdzfq",
            "parent_id": "t3_5tg6kz",
            "score": 12,
            "created_utc": 1486840064.0,
            "replies": [
                {
                    "body": "Wanna know the best part? \n\nThe best part is you can reply with both!\n\n;-)",
                    "author": "SDRippington",
                    "id": "ddmh39v",
                    "parent_id": "t1_ddmdzfq",
                    "score": 7,
                    "created_utc": 1486844536.0,
                    "replies": [
                        {
                            "body": "Hahaha I was feeling super snarky earlier. But I do agree with your point (and think it's accurate re: women in general, not just beautiful and intelligent ones haha). And the Louis C.K. clip is apt!\n\nOn another note, it kinda makes me sad that a guy writes it and that everyone applauds him for it. I feel like the reaction (at least in general society) might be different if a girl said the same.",
                            "author": "sugarfatty",
                            "id": "ddmme4v",
                            "parent_id": "t1_ddmh39v",
                            "score": 10,
                            "created_utc": 1486852566.0,
                            "replies": [
                                {
                                    "body": "I feel this is something we constantly try to explain but many Just respond with \" suck it up, butter cup.\"\n\nEmpathy is so rare these days it seems. ",
                                    "author": null,
                                    "id": "ddmzal5",
                                    "parent_id": "t1_ddmme4v",
                                    "score": 6,
                                    "created_utc": 1486872834.0,
                                    "replies": []
                                },
                                {
                                    "body": "Well, a girl is the one that said it so I guess you could just call me \"the messenger\" :-)\n\nBut yeah, that observation is sadly true :-/",
                                    "author": "SDRippington",
                                    "id": "ddmmy3k",
                                    "parent_id": "t1_ddmme4v",
                                    "score": 3,
                                    "created_utc": 1486853418.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Same",
                    "author": null,
                    "id": "ddmz8c9",
                    "parent_id": "t1_ddmdzfq",
                    "score": 3,
                    "created_utc": 1486872730.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love the sugar bowl but just hate the scariness of the POTs before something is established. I get pissed that the true and experienced SDs on this board are not easy to find in real life! Thanks for the empathy and SDs and or SR's can move fast for me no prob as long as there is respect, chemistry, and we do not keep getting pressured to meet in private too soon. I still want hotels for the first few meets before going to an apartment. POTs who keep insisting that I host early on are going to be scratched off the list!",
            "author": null,
            "id": "ddmmi9p",
            "parent_id": "t3_5tg6kz",
            "score": 7,
            "created_utc": 1486852743.0,
            "replies": [
                {
                    "body": "The converse is also extremely true that there just aren't quality SBs out there either. The sugar lifestyle has been so pushed with sensationalized stories in the media that it is become more and more difficult for decent people to actually find each other.",
                    "author": "Ryan111778",
                    "id": "ddmrpn8",
                    "parent_id": "t1_ddmmi9p",
                    "score": 6,
                    "created_utc": 1486860836.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "are you getting any work done while writing these masterpieces. \n\nI have never regretted losing an SB because we were apart on the allowance or frequency expectations.  However, I do regret a couple I lost because I either waited too long to express my interest in proceeding  or did not leave her space to think.  As a result I am more likely to say something like  I really like the idea of proceeding with something like                   I know this is an important decision for you and if you would like to think about it overnight , have questions or meet again socially  that's fine. ",
            "author": "pinotandsugar",
            "id": "ddmysvr",
            "parent_id": "t3_5tg6kz",
            "score": 5,
            "created_utc": 1486872033.0,
            "replies": [
                {
                    "body": "Since my work involves sitting in front of a computer most of time? Yep! :)\n\nAnd I agree wholeheartedly.\n",
                    "author": "SDRippington",
                    "id": "ddnpirw",
                    "parent_id": "t1_ddmysvr",
                    "score": 2,
                    "created_utc": 1486928055.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love this post so much. ",
            "author": "Brownbaby202",
            "id": "ddmbx7n",
            "parent_id": "t3_5tg6kz",
            "score": 11,
            "created_utc": 1486837192.0,
            "replies": [
                {
                    "body": "Thanks! I was inspired by a conversation with one of the SB's here to write it - because she was absolutely right.\n\nI'm constantly bemoaning the flakes, but I'm not constantly trying to see things through their eyes. I know of a couple of M&G's in the last two weeks that had I been less \"annoyed\" things might have come out differently.\n\nHindsight is always 20/20 :-)",
                    "author": "SDRippington",
                    "id": "ddmcs7g",
                    "parent_id": "t1_ddmbx7n",
                    "score": 7,
                    "created_utc": 1486838377.0,
                    "replies": []
                },
                {
                    "body": "Really great to see a SD and responding SDs who \"get it'",
                    "author": "wailingmantis",
                    "id": "ddmfzed",
                    "parent_id": "t1_ddmbx7n",
                    "score": 5,
                    "created_utc": 1486842905.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes yes yes. I've been saying this forever; empathy is so important....not just in an SR, bit everywhere in life. Lack of empathy is why our society is so messed up; no one ever stops to think about how their actions will affect 1 , 2, or millions of people. \n\n\nThanks for writing this....it's a great reminder to everyone",
            "author": "ch1ps-ah0y",
            "id": "ddmtblh",
            "parent_id": "t3_5tg6kz",
            "score": 5,
            "created_utc": 1486863378.0,
            "replies": []
        },
        {
            "body": "This was so nice to read. :)",
            "author": "bubblessquare",
            "id": "ddocsk3",
            "parent_id": "t3_5tg6kz",
            "score": 5,
            "created_utc": 1486960126.0,
            "replies": []
        },
        {
            "body": "I have said it many times and even been attacked for saying it. Take your time and you will diminish a lot of the threats. Sugar is not an essential part of life, just like I barely bother anymore due to the lack of quality SB's and the lack of women who actually get it, if the bowl is getting too murky step away from it. \n\nTake care of yourself.",
            "author": null,
            "id": "ddmbd9p",
            "parent_id": "t3_5tg6kz",
            "score": 7,
            "created_utc": 1486836425.0,
            "replies": [
                {
                    "body": "> Take care of yourself.\n\nTo thine own self be true. \n\nNever sacrifice safety for the promise of $ and gifts. If everyone remembered this, so much of the inherent danger would be gone. ",
                    "author": "SDRippington",
                    "id": "ddmbgph",
                    "parent_id": "t1_ddmbd9p",
                    "score": 6,
                    "created_utc": 1486836560.0,
                    "replies": [
                        {
                            "body": "One thing I never do is meet the women who via messaging tell me to come by their apartments. I might be a bloke but I do think of my safety, how do I know I won't turn up and be jumped by her boyfriends mates?\n\nIf something seems too easy than there is a good reason something is very wrong.",
                            "author": null,
                            "id": "ddmblxk",
                            "parent_id": "t1_ddmbgph",
                            "score": 2,
                            "created_utc": 1486836763.0,
                            "replies": [
                                {
                                    "body": "Exactly this!!!\n\nOpportunism is the easiest thing for someone to prey on. \n\nI get _really_ paranoid when that happens. Especially if it's THE M&G. I'll pass - thanks!",
                                    "author": "SDRippington",
                                    "id": "ddmbo4q",
                                    "parent_id": "t1_ddmblxk",
                                    "score": 2,
                                    "created_utc": 1486836848.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for sharing this.",
            "author": null,
            "id": "ddmqvzd",
            "parent_id": "t3_5tg6kz",
            "score": 3,
            "created_utc": 1486859545.0,
            "replies": []
        },
        {
            "body": "I love that Atwood quote. Empathy is an excellent practice in all walks of life!",
            "author": "Cledaddy23",
            "id": "ddmyaez",
            "parent_id": "t3_5tg6kz",
            "score": 3,
            "created_utc": 1486871202.0,
            "replies": []
        },
        {
            "body": "Stuff like this is why I put in my \" what I'm looking for\" someone who understands and enacts in introspection. \n\nAs a person, my true self, I really appreciate this and respect your growth. ",
            "author": null,
            "id": "ddmz73z",
            "parent_id": "t3_5tg6kz",
            "score": 3,
            "created_utc": 1486872674.0,
            "replies": []
        },
        {
            "body": "\nGreat comments \n\nSlow is fast and fast is slow  in getting to sugar wonderland ",
            "author": "pinotandsugar",
            "id": "ddmbjj6",
            "parent_id": "t3_5tg6kz",
            "score": 3,
            "created_utc": 1486836670.0,
            "replies": []
        },
        {
            "body": "Great post",
            "author": "Chublinsand",
            "id": "ddmjyvl",
            "parent_id": "t3_5tg6kz",
            "score": 4,
            "created_utc": 1486848848.0,
            "replies": []
        },
        {
            "body": "I can completely understand and agree the risk factors but these risk for women exist, sugaring or not. I do not agree that bowl amplifies any of these risk factor. Do we have the statistic to say that this happens more in sugaring v/s vanilla?\n\nYes, the age difference is huge sometimes but wasn't that the reason why a SD has to pay to date. Would a SB just date a SD just because he is a \"nice\" guy, mostly NO. Do you think I have not been verbally abused and told nasty stuff, do you think some SD has not been blackmailed, you were doxxed recently. The risk exist on both sides.\n\nI believe we are all equal, if not, we balance with what we bring to the table. Treat the other person with respect and that goes both ways. I am emphatic towards your emotions and position but it doesn't diminishes mine in any way.  ",
            "author": null,
            "id": "ddn3nyd",
            "parent_id": "t3_5tg6kz",
            "score": 4,
            "created_utc": 1486880737.0,
            "replies": [
                {
                    "body": "Thank you for this. SDs also face abuse and risks. People should know or would know the case of the Google executive who lost his life to a lady who he apparently met up on SA. This case is 3 years old but is chilling. SA has all types of women from the sweet innocent college girl to the normal working woman to the struggling single mom to the educated attorney or the tech worker just there for the variety but don't discount the escorts and the druggies, women with criminal records and women who may not be acting alone or those simply associated with the wrong people like say douche bag boyfriends with criminal mindsets. If people think they don't exist in the bowl then they are not living in reality. Put it differently there are many SDs who totally have their act together in life, great education, great career, a family and social status and a wrong association can quickly ruin that in an instant not just for them but for their reputations and families. So back to empathy, no need. Be nice and be respectful. All of us are best advised to be safe and follow our instincts! There is no need to kiss up to the SB community and say we empathize! We don't need to. ",
                    "author": null,
                    "id": "ddnrzme",
                    "parent_id": "t1_ddn3nyd",
                    "score": -2,
                    "created_utc": 1486931469.0,
                    "replies": [
                        {
                            "body": "> People should know or would know the case of the Google executive who lost his life to a lady who he apparently met up on SA.\n\nThe fact that some SD's still reference this one event, 3 years after the fact, as proof of the dangers of SA for me is telling. ",
                            "author": "_azucar_",
                            "id": "ddo4zf8",
                            "parent_id": "t1_ddnrzme",
                            "score": 7,
                            "created_utc": 1486949445.0,
                            "replies": [
                                {
                                    "body": "That was one incident that was publicly reported! It was unfortunately tragic and you are asking \"so what\"! That's a shame!! Hey what about the other one where some old fart was tied and robbed by two girls he met on SA. What about other instances which never get reported. The point is stuff happens with men as well. ",
                                    "author": null,
                                    "id": "ddo898z",
                                    "parent_id": "t1_ddo4zf8",
                                    "score": 6,
                                    "created_utc": 1486953847.0,
                                    "replies": [
                                        {
                                            "body": "Excuse me! Where exactly do you see me saying 'So what' please? That was a horrible crime and she's rightfully paying the price in prison. I'm simply pointing out that the frequency is so low that there are only 1/2 cases that SD's repeatedly reference.\n\nOf course, it happens with both but only a fool would try and argue that it's on the same level.",
                                            "author": "_azucar_",
                                            "id": "ddo8yrz",
                                            "parent_id": "t1_ddo898z",
                                            "score": 2,
                                            "created_utc": 1486954776.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Love that guy. Funny as hell and tells it like it is :)",
            "author": "SDRippington",
            "id": "ddmhav9",
            "parent_id": "t3_5tg6kz",
            "score": 1,
            "created_utc": 1486844844.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ddmbyt6",
            "parent_id": "t3_5tg6kz",
            "score": -7,
            "created_utc": 1486837250.0,
            "replies": [
                {
                    "body": "i understand what you're saying and i understand the statistics you are referencing, but the lived experience of women -- and SBs in particular -- is that you are spending a lot of your time alone with people who could *easily* overpower you physically were they to simply decide to do so. \n\nand i think to discount that fear as 'irrational' is an invalidation of what our experience of the world is, and simply bad advice. the number of women who have suffered some form of sexual assault is very high, and self-preservation and safety should always been \"worried\" about.  \n\ni do, however, agree with you that masculinity shouldn't be so restrictive as to prevent men from talking about their own fears or times they were victimized. ",
                    "author": "SquidSB",
                    "id": "ddme25t",
                    "parent_id": "t1_ddmbyt6",
                    "score": 14,
                    "created_utc": 1486840173.0,
                    "replies": [
                        {
                            "body": "Women DO get raped a lot. \n\nan SD I met off of SA refused to stop when I told him he was hurting me. I went home bleeding downstairs and bruised about. Since money was involved, legal action would harm me too. I had 2 really new SR's at the time. the other one was actually rapidly becoming emotionally close, so.. that kept on. This had happened to me with boyfriends a handful of times when I was younger, so my reaction was more exasperation than trauma. SD's will get angry at me if I want to text a friend what hotel I'm at, or drive myself, or send texts every hour or so on the first imtimacy date or two. But.. all of this didn't even stop the above guy. This just stops like... human trafficking, and probably not even that.",
                            "author": "Elvishgirl",
                            "id": "ddmepcr",
                            "parent_id": "t1_ddme25t",
                            "score": 19,
                            "created_utc": 1486841077.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I don't want to be that 1% or low percentage whatever the number :). And as I posted earlier- my friend's co-worker went home with a guy who tore her apart and disembowled her and this happened a few months ago in Dallas. I have come close, but have personally known plenty of rape victims in my life too. It is not that uncommon and we are putting ourselves out there in a world where typical predators might roam SA for just this reason; finding a victim. So be sympathetic, just like unprotected sex- I still do not like risking the low chance of getting HIV or the uncurable diseases. Health and safety are first. Prefer that over pissing off a man who gets insulted that I want to make sure he is not in the low percentage of criminals. Any percentage regarding my life is too high. ",
                    "author": null,
                    "id": "ddmnedp",
                    "parent_id": "t1_ddmbyt6",
                    "score": 7,
                    "created_utc": 1486854122.0,
                    "replies": []
                },
                {
                    "body": "Even if men are 5x more likely to be victims of violence from other men than women are, they're indescribably more capable of defending themselves. 1 man vs. another makes for a fight, 1 man vs a woman makes for that man doing whatever he wants. ",
                    "author": "wailingmantis",
                    "id": "ddmg2o1",
                    "parent_id": "t1_ddmbyt6",
                    "score": 11,
                    "created_utc": 1486843041.0,
                    "replies": [
                        {
                            "body": "Tell that to the women soldiers and women police officers . . . also the Congress people who insist on raising quotas.",
                            "author": "orsugar",
                            "id": "ddnp2na",
                            "parent_id": "t1_ddmg2o1",
                            "score": 0,
                            "created_utc": 1486927440.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> This creates the illusion that women have more to worry about when statistically that's not the case.\n\nWhile what you stated is 100% correct, it still boils down to the simple fact that a person's **perception** _is their reality_. \n\nI'll point to that part of my post where I said:\n> we get impatient thinking, \"why can't she see I actually am a nice guy?!\"\n\nWe can throw rationality and statistics around until we've proven the earth is shaped like a ball, but to the person sitting across from me? I just need to take a moment and realize that in spite of any statistical facts, she could literally be scared shitless at that moment. That is _her_ reality - and it costs me nothing to chill out :)",
                    "author": "SDRippington",
                    "id": "ddmcd2f",
                    "parent_id": "t1_ddmbyt6",
                    "score": 6,
                    "created_utc": 1486837792.0,
                    "replies": [
                        {
                            "body": "No. You need to get out of there if the person sitting across you is \"literally scared shitless.\"  You have no idea into what her contrived perception (her \"reality\") will degenerate.\n\nNever sleep with a crazy; never sleep with a manipulative BPD.",
                            "author": "orsugar",
                            "id": "ddno5w8",
                            "parent_id": "t1_ddmcd2f",
                            "score": -1,
                            "created_utc": 1486926186.0,
                            "replies": [
                                {
                                    "body": "It was simply a figure of speech. My whole point is to at least relax and feel a shred of empathy - especially if she's rather inexperienced.",
                                    "author": "SDRippington",
                                    "id": "ddnp86k",
                                    "parent_id": "t1_ddno5w8",
                                    "score": 4,
                                    "created_utc": 1486927652.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "To your comment, we can also add that the victims in the majority instances of rape are men as well: most instances of rape are carried out on male prison inmates. \n\nWhat really comes down to is this: sperms are cheap, whereas eggs/uterus-space are expensive.  Society puts much more emphasis on women's issues than on men's issues. Just look at the size difference between the medical department devoted to women issues vs. the medical department devoted to men issues; the latter doesn't exist!  \n\nThat societal bias in and of itself is what it is, just a fact.  However, for the author of those two paragraphs to turn around and try to frame the mind of OP, that is some serious professional-grade manipulation work. ",
                    "author": "orsugar",
                    "id": "ddnnmn4",
                    "parent_id": "t1_ddmbyt6",
                    "score": 0,
                    "created_utc": 1486925455.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good post. But lets not forget that there are plenty lies from SB's that have got you to that jaded place.\n\nFor example. Thursday had a lovely meet up with a girl for coffee. She went of for a lecture and we agreed a further meet up this weekend where we would have a meal and get a hotel. We texted back and forth and allowance hadn't even really been discussed (numbers wise at least). As I awaited her to say the figure she has suddenly had a family emergency.\n\nFamily Emergency and my phone is being repaired. Happens freakishly often in the bowl.",
            "author": "DaddyUK",
            "id": "ddmdnbt",
            "parent_id": "t3_5tg6kz",
            "score": -5,
            "created_utc": 1486839589.0,
            "replies": [
                {
                    "body": "Well that's exactly the point. You might get flakes but you generally don't have to worry about raped or murdered.",
                    "author": "okaydooke",
                    "id": "ddmec60",
                    "parent_id": "t1_ddmdnbt",
                    "score": 16,
                    "created_utc": 1486840571.0,
                    "replies": [
                        {
                            "body": "Yes!!!!!! I keep procrastinating a pepper spray purchase too. Reminds me! ",
                            "author": null,
                            "id": "ddmn6l8",
                            "parent_id": "t1_ddmec60",
                            "score": 5,
                            "created_utc": 1486853778.0,
                            "replies": []
                        },
                        {
                            "body": "Well the chance of a mugging or being attacked has been a distinct possibility.  But yes there is far more fear from the female perspective ",
                            "author": "DaddyUK",
                            "id": "ddmf5yw",
                            "parent_id": "t1_ddmec60",
                            "score": 1,
                            "created_utc": 1486841729.0,
                            "replies": []
                        },
                        {
                            "body": "The only case of murder relating to SA that we know of is that of the former google exec. He was murdered by his SB when she administered drugs to him intravenously.",
                            "author": "orsugar",
                            "id": "ddnqkih",
                            "parent_id": "t1_ddmec60",
                            "score": 1,
                            "created_utc": 1486929498.0,
                            "replies": [
                                {
                                    "body": "ive heard stories of girls getting raped and im sure theres worse. being a sugar baby is a lot more risk then being a rich , powerful man. (or someone pretending to be)",
                                    "author": "okaydooke",
                                    "id": "ddo87nq",
                                    "parent_id": "t1_ddnqkih",
                                    "score": 3,
                                    "created_utc": 1486953786.0,
                                    "replies": [
                                        {
                                            "body": "Being a rich powerful man is the result of his past achievement or result of birth, not a result of being an SD.\n\nBeing susceptible to rape is a result of being a human being (most instances of rape involve male victims who are prison inmates), not a result of being a sugar baby. In fact, dating wealthy and socially  established men is probably safer than dating average men.\n\nMost stories are false. When there is a police report followed by a conviction, like that murder case carried out by the SB, I will believe it.",
                                            "author": "orsugar",
                                            "id": "ddo9xry",
                                            "parent_id": "t1_ddo87nq",
                                            "score": 0,
                                            "created_utc": 1486956034.0,
                                            "replies": [
                                                {
                                                    "body": "lol are u really saying most rape stories are false? yeah okay",
                                                    "author": "okaydooke",
                                                    "id": "ddobe34",
                                                    "parent_id": "t1_ddo9xry",
                                                    "score": 2,
                                                    "created_utc": 1486958077.0,
                                                    "replies": [
                                                        {
                                                            "body": "Stories are. Police reports are found to be close to 50:50.\n\nI have been told personal rape stories a few times in my life, and every single time it's a girl who was about to cheat on me, or lie to me in order to get more money than original agreement, or just disappear after receiving money; i.e. scamming/rinsing. Every, single, time, regardless whether I had met the girl only that week or had been with that girl for more than a year. It's as if there were some kind of warrior's honor code of not revealing past rape victimhood until they have their knives out for you.\n\nI'm not at all exaggerating about this, the correlation has been 100%!  Nowadays, if someone tells me her past rape victimhood, I'd clutch at my wallet and make sure it's still there.",
                                                            "author": "orsugar",
                                                            "id": "ddobm9x",
                                                            "parent_id": "t1_ddobe34",
                                                            "score": 1,
                                                            "created_utc": 1486958397.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ddmecqr",
                    "parent_id": "t1_ddmdnbt",
                    "score": 8,
                    "created_utc": 1486840593.0,
                    "replies": [
                        {
                            "body": "She does want to meet up again. Shes suggesting a platonic meet again next week. If I had dangled a £400 carrot we would be in bed now. Its the fact she has lied thats annoying.",
                            "author": "DaddyUK",
                            "id": "ddmf7z3",
                            "parent_id": "t1_ddmecqr",
                            "score": -6,
                            "created_utc": 1486841807.0,
                            "replies": [
                                {
                                    "body": "How do you know she lied about a family emergency? ",
                                    "author": null,
                                    "id": "ddmiyc3",
                                    "parent_id": "t1_ddmf7z3",
                                    "score": 4,
                                    "created_utc": 1486847317.0,
                                    "replies": [
                                        {
                                            "body": "Er..... I have a family emergency. Then run off quickly. If I do that, I generally do follow up txt a few hours later and explain that I didn't feel comfortable and won't be continuing ahead. ",
                                            "author": "thatchick1993",
                                            "id": "ddmkcri",
                                            "parent_id": "t1_ddmiyc3",
                                            "score": 1,
                                            "created_utc": 1486849439.0,
                                            "replies": [
                                                {
                                                    "body": "Its a transparent white lie. ",
                                                    "author": "DaddyUK",
                                                    "id": "ddmpjxa",
                                                    "parent_id": "t1_ddmkcri",
                                                    "score": 1,
                                                    "created_utc": 1486857470.0,
                                                    "replies": [
                                                        {
                                                            "body": "Because I don't do confrontation very well and I don't like letting people down. I have a good heart and come from a good place and feel more comfortable letting them down over txt. It gives me time to truly think about the right things to say instead of saying the wrong thing and ending either hurting them more or end up in an argument. ",
                                                            "author": "thatchick1993",
                                                            "id": "ddn2nxm",
                                                            "parent_id": "t1_ddmpjxa",
                                                            "score": 1,
                                                            "created_utc": 1486878767.0,
                                                            "replies": [
                                                                {
                                                                    "body": "But you have let someone down. And you need to be honest. So you would be fine with someone dumping you via text. Its weak.",
                                                                    "author": "DaddyUK",
                                                                    "id": "ddnbzi7",
                                                                    "parent_id": "t1_ddn2nxm",
                                                                    "score": 1,
                                                                    "created_utc": 1486906414.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I'd be perfectly fine someome dumping me via text as long as they give me a reasonable explanation as to why they're dumping me. I don't do well talking about my emotions in person. So if someone dumps me via text it allows me to get my emotions in check and respond in a sensible way. \n\nMy SD and I have huge D&Ms over text then continue them in person. He knows I'm not good with expressing my emotions in person, so if it means he gets more out of me via text he will. ",
                                                                            "author": "thatchick1993",
                                                                            "id": "ddo415h",
                                                                            "parent_id": "t1_ddnbzi7",
                                                                            "score": 1,
                                                                            "created_utc": 1486948182.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "The amount of SB's that have family emergencies and phones being repaired is really something. \n\nMaybe im being too skeptical. Though if i was a betting man - I'd guess her mums health is just fine.",
                                            "author": "DaddyUK",
                                            "id": "ddmpi70",
                                            "parent_id": "t1_ddmiyc3",
                                            "score": -1,
                                            "created_utc": 1486857395.0,
                                            "replies": [
                                                {
                                                    "body": "So what reason did she have to lie in this situation, I'm confused? \n\nYou say she wanted to see you again so what's your point?",
                                                    "author": "_azucar_",
                                                    "id": "ddmsi4r",
                                                    "parent_id": "t1_ddmpi70",
                                                    "score": 1,
                                                    "created_utc": 1486862087.0,
                                                    "replies": [
                                                        {
                                                            "body": "She didn't want to meet this weekend as allowance figure was not nailed down. ",
                                                            "author": "DaddyUK",
                                                            "id": "ddnc10n",
                                                            "parent_id": "t1_ddmsi4r",
                                                            "score": 1,
                                                            "created_utc": 1486906520.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Yeah, I understand/agree. I've actually had a family member's health get in the way of a meet up and now I'm wondering if he thought I was flaking... ",
                                                    "author": null,
                                                    "id": "ddmsquw",
                                                    "parent_id": "t1_ddmpi70",
                                                    "score": 1,
                                                    "created_utc": 1486862474.0,
                                                    "replies": [
                                                        {
                                                            "body": "He has heard those words before and it depends on how sceptical he is. \n\nIf he is self made, he is rolling his eyes as he reads the text and making a mental note. ",
                                                            "author": "DaddyUK",
                                                            "id": "ddnc0if",
                                                            "parent_id": "t1_ddmsquw",
                                                            "score": 0,
                                                            "created_utc": 1486906482.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Better they make an excuse and not show then to run off with your money 😒",
                    "author": "Ryan111778",
                    "id": "ddmrtfg",
                    "parent_id": "t1_ddmdnbt",
                    "score": 3,
                    "created_utc": 1486861001.0,
                    "replies": [
                        {
                            "body": "for sure.",
                            "author": "DaddyUK",
                            "id": "ddnc1c5",
                            "parent_id": "t1_ddmrtfg",
                            "score": 1,
                            "created_utc": 1486906544.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "First off I can't see how they have to go through those pains to be an SB! I can't relate because I treat one and all with great respect. But WTF is with the 3X in age crap. How old is the average SB anyway! The average in my mind is 25 years, so 3X makes the average SD to be 75!! ",
            "author": null,
            "id": "ddma62m",
            "parent_id": "t3_5tg6kz",
            "score": -12,
            "created_utc": 1486834774.0,
            "replies": [
                {
                    "body": "> First off I can't see how they have to go through those pains to be an SB! I can't relate because I treat one and all with great respect.\n\nRight. And that's **you**. There are lots of douchebags out there who _are_ predators. Just because you're the Knight in Shining Armour doesn't mean there's not a whole horde of undead creeps behind you.\n\n> But WTF is with the 3X in age crap. How old is the average SB anyway! The average in my mind is 25 years, so 3X makes the average SD to be 75!!\n\nThis was told to me by a younger than 25 SB :-) But again, missing the point. We're older. Remember the saying, \"Old age and cunning will always overcome youth and skill\". Average age not important.",
                    "author": "SDRippington",
                    "id": "ddmabjr",
                    "parent_id": "t1_ddma62m",
                    "score": 13,
                    "created_utc": 1486834989.0,
                    "replies": [
                        {
                            "body": "Yes that's me. I am just a normal guy who respects one and all and all POTs are included in that. Too bad and very sad that such basic and normal behavior amounts to being the \"knight in shining armor \" in sugar land. Do I care where the SB is coming from or how many douche bags she has dated before she landed across the table from me. NO. That's her problem and not mine. Just like she could care a super rats ass on how hard I work to make my money or how tough it was to seal the last deal at work or that I cut of another important meeting to go see her. My responsibility is to treat her right period. Treating people as people should not be hailed as great! Your post has a meaning and it's good to be aware but I won't give anyone extra points for being an SB! It's done by choice and that entails having to deal with the pros and cons just like how they exist as part of all things in life - work, marriage, relationships, business etc! Ask entrepreneurs who have raised money and they will tell you how many investors flaked and faked and wasted their time etc until the right deal came along. So sorry no brownie points for SBs!!! \n",
                            "author": null,
                            "id": "ddmgmmw",
                            "parent_id": "t1_ddmabjr",
                            "score": -6,
                            "created_utc": 1486843851.0,
                            "replies": [
                                {
                                    "body": "I get all that- but again you're simply missing the point I was trying to make. Or you are and you're just saying \"So what?\" Of so then okay. I can respect that.\n\nThe ability to see things from someone else's perspective, irrespective of whether or not it's logical? Is simply empathy. You either choose to be that way or you don't. Not pointing fingers - just stating a fact of life.",
                                    "author": "SDRippington",
                                    "id": "ddmh9be",
                                    "parent_id": "t1_ddmgmmw",
                                    "score": 8,
                                    "created_utc": 1486844781.0,
                                    "replies": [
                                        {
                                            "body": "All I am saying is no need to empathize! Just make sure they are given due respect. Fact is there are probably 1 million women on SA who are in the ages of 18 - 40. There are another 10 - 30 million women in the same age bracket with same or better looks and similar financial circumstances who choose to do multiple jobs, go to school at night, cut corners, make sacrifices or whatever it takes to survive and thrive without resorting to sugaring or any other means. Empathize with them or millions of others who go through hardships in life to make ends meet. To empathize with SBs, not sure my friend. ",
                                            "author": null,
                                            "id": "ddmmm53",
                                            "parent_id": "t1_ddmh9be",
                                            "score": -5,
                                            "created_utc": 1486852909.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "ddmo2q1",
                                                    "parent_id": "t1_ddmmm53",
                                                    "score": 13,
                                                    "created_utc": 1486855181.0,
                                                    "replies": [
                                                        {
                                                            "body": "> I'm going to describe myself; this is the kind of woman on SA: * Had a part time job starting at 16 while attending HS. * Was a National Merit Scholarship finalist. * Had an almost perfect SAT score. * Was the first in my family to go to college. * Had 2 part time jobs while going to school full time. * Graduated magna cum laude. * Work in an extremely selective career path and have saved enough to buy a house in California.\n> Do I deserve more respect or empathy than someone who didn't make those choices? No.\n\nOf course you think you do. Why else wasting electrons making that long list?\n\nDo you not believe you deserve more respect than someone the same age as you but is a drug addict, been arrested and thrown in jail multiple times for possession, dealing, theft and fraud?  Yes, she is on SA too!  There is  a wide range of SB's, just like there is a wide range of SD's. \n\nRespect is earned. Fondness/dotage is given for free.",
                                                            "author": "orsugar",
                                                            "id": "ddnpq7c",
                                                            "parent_id": "t1_ddmo2q1",
                                                            "score": 1,
                                                            "created_utc": 1486928339.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "You deserve respect! You deserve respect first as a human and a woman. Your achievements deserve appreciation and I am sure you have received accolades for that. May you continue to succeed and buy more home. But Read up and check my views on respect. Respect is non-negotiable. Respect is table stakes! But to glorify the challenges one faces as an SB is not something I have much empathy for. It comes with the territory. ",
                                                            "author": null,
                                                            "id": "ddmonhm",
                                                            "parent_id": "t1_ddmo2q1",
                                                            "score": -1,
                                                            "created_utc": 1486856083.0,
                                                            "replies": [
                                                                {
                                                                    "body": "> But to glorify the challenges one faces as an SB is not something I have much empathy for. It comes with the territory.\n\nDating in general can be rather dangerous for a woman to begin with. Dating within the boundaries of an SR? Even moreso. \n\nJust because THEY picked to be there, doesn't mean you can't appreciate they are there, sitting in front of you, and taking more of a risk than if they were as you said, \"_do multiple jobs, go to school at night, cut corners, make sacrifices or whatever it takes to survive and thrive without resorting to sugaring_\"?\n\nIf it wasn't for them moving through their fears at that moment to be with you at an M&G? You wouldn't even be here discussing any of this. ",
                                                                    "author": "SDRippington",
                                                                    "id": "ddmq78k",
                                                                    "parent_id": "t1_ddmonhm",
                                                                    "score": 7,
                                                                    "created_utc": 1486858479.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "ddmpbyh",
                                                                    "parent_id": "t1_ddmonhm",
                                                                    "score": 4,
                                                                    "created_utc": 1486857128.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "And they could simply choose not to attempt any SR dating at all. Where would that leave you then? Freestyling like the days of old.\n\nShow empathy and you might have better success in the bowl. That is if that is even a concern of yours?\n\nMaybe you're a greek god and women throw themselves at you. If so? Awesome! ",
                                                                            "author": "SDRippington",
                                                                            "id": "ddmq9w0",
                                                                            "parent_id": "t1_ddmpbyh",
                                                                            "score": 5,
                                                                            "created_utc": 1486858590.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "We agree to disagree and that's not a bad thing. Please don't take anything I say personally. I see you have pointed at me and asked me if SR never existed, would I have other dating options! Yes I have and will continue to have. I won't elaborate on that or get into my success in the bowl or life in general, Enough said on that. I hope it's the same with you in terms of dating options. Will be a pathetic situation if SR and FS are the only options! ",
                                                                                    "author": null,
                                                                                    "id": "ddmroyw",
                                                                                    "parent_id": "t1_ddmq9w0",
                                                                                    "score": -3,
                                                                                    "created_utc": 1486860807.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "> All I am saying is no need to empathize!\n\nOn this part we have diverged to be polar opposites. \n\nI empathize with every client I engage with in my professional life - it allows me to assess and gauge their needs with better accuracy and better outcomes. The fact I don't always do this when sitting across from an SB is actually something I need to work on - because I recognize its value.\n\n> There are another 10 - 30 million women in the same age bracket with same or better looks and similar financial circumstances who choose to do multiple jobs, go to school at night, cut corners, make sacrifices or whatever it takes to survive and thrive without resorting to sugaring or any other means.\n\nYeah. Now I am going to say this, and please, read it slowly so it sinks in - _I can and will always try to empathize with anyone regardless of situation_  **however** what I am talking about here is having a modicum of empathy _for the woman sitting across from you at the !@#$ table of a M&G_. Whether you feel that is worth the effort or not is entirely _up to you_. \n\nThe simple fact is, anyone who makes the choice to empathize _will have a lot better chance_ of having an intimate time with said woman you are trying to be with. Why are you debating this simple point?\n\nI don't care if it's an SR Meet and Greet, or a date from someone I met in my vanilla life - the woman sitting across from me at the dinner table has a lot more to fear from me than I do about her. Why is this so difficult to understand? Because they are choosing to be there? Well **so what**! What the Hell does that have anything to do as to whether or not I should feel some empathy?",
                                                    "author": "SDRippington",
                                                    "id": "ddmq0zk",
                                                    "parent_id": "t1_ddmmm53",
                                                    "score": 7,
                                                    "created_utc": 1486858206.0,
                                                    "replies": [
                                                        {
                                                            "body": "I am not fighting a popularity contest here. If someone wants to be an SB, odds are they will have to put in the work and go through the drill. Why empathize or feel great if one does! That's the path chosen and they know the payoffs of success. It's a choice. As a young entrepreneur I remember a lot of doors got slammed on me. I was invited to many frivolous meet and greets. Many prospects would back out at the last minute.  Many said they would fund but never came through. There were enough but subtle attempts to rob the idea I had.  Hey it's all part of the game. I never expected my investors to empathize! And most never did. My goal was to get funded and I knew I had a great idea and that the right investor was around the corner. The investors could care less if I had skipped lunch or put in an all nighter on the pitch or that my coder just quit on me. I know different situations but similar principles. I am sure there will be reasons to disagree with my points and that's ok. ",
                                                            "author": null,
                                                            "id": "ddms8r3",
                                                            "parent_id": "t1_ddmq0zk",
                                                            "score": 0,
                                                            "created_utc": 1486861680.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "\"Just like she could care a super rats ass on how hard I work to make my money or how tough it was to seal the last deal at work or that I cut of another important meeting to go see her.\" I do appreciate this and stress it to SD's all the freakin time and even said that over and over during sex and has been a turn on! I value the kindness and hard work of the SD but you guys need to value our apprehension to be in private in the beginning and care about keeping our limbs in tact! My friend's colleague went home with a man (vanilla dating) and he disembowled this sweet girl. He was a young, attractive and charming guy. Give us some brownie points for caring about our longevity on this planet. If you have a sister I hope you would agree. ",
                                    "author": null,
                                    "id": "ddmn2xj",
                                    "parent_id": "t1_ddmgmmw",
                                    "score": 6,
                                    "created_utc": 1486853621.0,
                                    "replies": [
                                        {
                                            "body": "100 percent agree and that dude who disembowled your friend is God lucky that the girl he did that too is not my sister!! There is zero sympathy for such men in my mind  and heart!!  These young charming whatever types should be deported to Saudi Arabia for the right justice! Second, in all my SRs I have made sure we are both friendly enough (could be a few weeks) until we seek alone time. Like I said all this is table stakes for me and I only speak for myself and how I treat people. ",
                                            "author": null,
                                            "id": "ddmngpp",
                                            "parent_id": "t1_ddmn2xj",
                                            "score": 1,
                                            "created_utc": 1486854223.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ddmmr6v",
                                    "parent_id": "t1_ddmgmmw",
                                    "score": 6,
                                    "created_utc": 1486853124.0,
                                    "replies": [
                                        {
                                            "body": "Don't take anything personally. I have no desire to impress anyone on this thread or any interest in making friends. I am here to offer an opinion which differs from the OP. That does not make me disrespectful of anyone. ",
                                            "author": null,
                                            "id": "ddmn14c",
                                            "parent_id": "t1_ddmmr6v",
                                            "score": -2,
                                            "created_utc": 1486853541.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "If you just take the adult years past 18, a 46yo SD does have three times as much experience in adult life as a 25yo SB. I think the point is valid.",
                    "author": "calicocuddles",
                    "id": "ddmaeds",
                    "parent_id": "t1_ddma62m",
                    "score": 14,
                    "created_utc": 1486835101.0,
                    "replies": []
                },
                {
                    "body": "Watch this clip and you'll get it :-)\n\nhttps://www.youtube.com/watch?v=yRzs7v0do_Q\n\nAnd another funny one (love this guy)\n\nhttps://www.youtube.com/watch?v=OMBnZYdUBOw",
                    "author": "SDRippington",
                    "id": "ddmas3v",
                    "parent_id": "t1_ddma62m",
                    "score": 2,
                    "created_utc": 1486835617.0,
                    "replies": [
                        {
                            "body": "louis ck is so talented and so fuckable",
                            "author": "SquidSB",
                            "id": "ddme43p",
                            "parent_id": "t1_ddmas3v",
                            "score": 5,
                            "created_utc": 1486840252.0,
                            "replies": []
                        },
                        {
                            "body": "I saw louis c k live!  He was awesome.",
                            "author": "milliondollarkitty",
                            "id": "ddmg63p",
                            "parent_id": "t1_ddmas3v",
                            "score": 2,
                            "created_utc": 1486843182.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "SDs who are patient about sex can do very very well.  But I some SDs just want to notch up conquests.",
            "author": "DSMIAGuy",
            "id": "ddmli70",
            "parent_id": "t1_ddmhos8",
            "score": 8,
            "created_utc": 1486851198.0,
            "replies": []
        },
        {
            "body": "And when they truly show that they do not care much about us as a person at all and try to move so fast. I can go fast when we have had lots of conversations and have the gist of each other; but one dude who was pressuring me to move it to a hotel did not pass my pop quiz- \"what is my name\"? Feels like a tinder date, haha!",
            "author": null,
            "id": "ddmmr5k",
            "parent_id": "t1_ddmhos8",
            "score": 9,
            "created_utc": 1486853122.0,
            "replies": [
                {
                    "body": "> did not pass my pop quiz- \"what is my name\"? \n\na classic.........  ",
                    "author": "pinotandsugar",
                    "id": "ddmyv04",
                    "parent_id": "t1_ddmmr5k",
                    "score": 5,
                    "created_utc": 1486872128.0,
                    "replies": []
                },
                {
                    "body": "I recently had the opposite problem.  A girl pressuring me to go to the hotel across the street from a trendy bar.  I didn't even know there was a hotel across the street.  I think it all really depends on the guy, girl and chemistry.  Even in my vanilla dating years, I struggle to recall the girls that it took more than a week to sleep with.  Usually if it was more than a week or 2, they just weren't that into me and we never dated in the first place.  But I do agree with the post about this being risky for the girl.  For the guy, it's just expensive (you can go to Maui or Europe 3-6x a year on what it takes to sugar), lose your reputation (and income, family if you have one).  But girls stand a greater chance of losing their health or life.  Thus proving that free money for something simple is never really free.",
                    "author": null,
                    "id": "ddnawpq",
                    "parent_id": "t1_ddmmr5k",
                    "score": 5,
                    "created_utc": 1486903385.0,
                    "replies": [
                        {
                            "body": "\"Even in my vanilla dating years, I struggle to recall the girls that it took more than a week to sleep with. \" Yes, at least in the vanilla dating world I try to stress this exact concept vs the people who want to wait x amount of dates or 2 months to be intimate. If you had to wait that long, maybe I am not attracted to you; do not slut shame someone who actually wants to jump your bones! Be flattered! ",
                            "author": null,
                            "id": "ddnntj8",
                            "parent_id": "t1_ddnawpq",
                            "score": 1,
                            "created_utc": 1486925715.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So so true... I think I have more empathy for most... Problem is my sympathy is on the low side. I can see them in their shoes... but most of the time I think they brought it on with their poor decisions!",
            "author": "SD_AU",
            "id": "ddmmmh8",
            "parent_id": "t1_ddmg59i",
            "score": 5,
            "created_utc": 1486852924.0,
            "replies": []
        },
        {
            "body": "And with the closing down of Backpage, the pool is even more diluted on both sides with predators on both sides making it a rather wild ocean to navigate.\n\nI guess it just means in that in order to find a quality SR, learning patience and even a little more empathy we can still find what we're looking for. ",
            "author": "SDRippington",
            "id": "ddm9vm3",
            "parent_id": "t1_ddm9rnm",
            "score": 14,
            "created_utc": 1486834353.0,
            "replies": [
                {
                    "body": "I have had a couple POTs recently that I tried to set up a M&G with and they just wanted me to come over to their apartment for an hour. Hmmm.....",
                    "author": "Ryan111778",
                    "id": "ddma6b6",
                    "parent_id": "t1_ddm9vm3",
                    "score": 2,
                    "created_utc": 1486834783.0,
                    "replies": [
                        {
                            "body": "Like I said - pool is being diluted.",
                            "author": "SDRippington",
                            "id": "ddmag65",
                            "parent_id": "t1_ddma6b6",
                            "score": 5,
                            "created_utc": 1486835175.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Sorry to be the bearer of bad news. IMHO, the quoted two paragraphs came from a very \"professional\" perspective, and were meant to manipulate.  A normal girl would not be spelling out those two paragraphs for you, as it would not deter a real scammer or rapist.  A normal girl is not likely to play her vulnerability card to a stranger; a pro would. If a normal girl actually believed what she wrote, the only rational course of action would be quitting the venue altogether; I would if I were in her shoes believing what she purports to believe. The reward/risk ratio doesn't make any sense.\n\nBTW, while she is correct that men are usually physically stronger than women, women are mentally much more capable than men when it comes to relationships and framing the other person's mind. Historically, it was probably necessary for women to use their brains to move the muscles around them.\n\nEdit: OK, the professional down-voters are afraid that their industrial secret is out in the open, may as well lay the detailed analysis out in the open, as reward for their down-voting:\n\n> I think guys just don't get what it's like for us in the bowl. \n\nThen shouldn't she find someone who gets it instead? or stop meeting guys altogether?  Why does she insist on meeting guys who don't get it? Classic industrial-grade shaming tactic to start the conversation.\n\n> The biggest concerns you guys seem to have relate to your wallets and egos. But we have to worry about being raped, abused, scammed, stalked, disrespected, insulted, treated like objects. The stakes are just so much higher for us.\n\nIf she is treating it like normal dating, why would she be encountering that long list of reactions (any more  than normal vanilla dating)?  How is risk of being raped/abused/stalked any greater in the sugar bowl than in vanilla (online) dating? given that the guy in the sugar bowl is likely to have more assets and social standing at risk than the average guy in vanilla online dating. Is she advocating parents be match makers or mandatory chaperones for all (online) dating? Why is she not if she believes those high risks. Scammed is a wallet issue; disrespected/insulted/treated like objects are ego issues.  Does she believe her ego is more important than the POT's ego? Yes she does, as she clearly stated, and she believes you should agree that her ego is more important than yours.   \n\n> It can be really scary and nerve wracking. We feel so vulnerable. \n\nThen why not get out of the sugar bowl? I'm not saying people shouldn't take precautions; however, trying to manipulate using the \"vulnerability\" card is tantamount to perverse selection: cock-blocking the \"nice guys\" while not having any effect on the less ethical. Most normal girls know that and therefore don't play the card; it's the professionals who play that card in order to exploit the men.  Most normal girls know some risks are involved just like in normal vanilla dating; that's why they find guys who are attractive enough and capable enough then stick with them. It's the professionals who talk about exorbitant risks and then keep going back into the bowl fishing for the next patron.\n\n>You guys are like 3x our ages \n\nWhy doesn't she pick someone 2x or 1.5x? 20x3=60, 25x3=75. There are plenty SD's not that old. The \"SB\" who assumes and is deliberately looking for men in their 60-75 years of age is probably a pro, as she clearly associates sex in the sugar bowl with distaste. How can she not be a pro if all she finds are men 3x her own age? and has to speak of herself in plural? as in the prostitute collective.\n\n> and have decades of experience on us, negotiating ability, net worth, etc. The power imbalance is crazy. \n\nShe probably has more sex partners in a year than he does in a decade if not a life time. The power imbalance is crazy: he is the romantic whereas she is the exploitationist; she has him by the balls.\n\n> And women in general are used to putting other people's feelings over our own and not being assertive so we're especially at a disadvantage.\n\nThe general case is not correct, unless \"other people\" means her own children. She has clearly shown that her ego is more important to her than your ego is to her . . . which is not wrong in itself, but very manipulative of her then to claim herself putting other people's feelings ahead of her own. The two paragraphs indicate at least narcissistic personality: unable to recognize other people's feelings. Could be a BPD chronicle liar as well. An attractive girl finding relatively easy success in the sugar bowl wouldn't have the dire thoughts or first-hand experience to share with you. ",
                    "author": "orsugar",
                    "id": "ddmyy0x",
                    "parent_id": "t1_ddm9vm3",
                    "score": -11,
                    "created_utc": 1486872262.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ddnp3os",
            "parent_id": "t1_ddm9rnm",
            "score": 5,
            "created_utc": 1486927481.0,
            "replies": [
                {
                    "body": "Good job taking one sentence out of context and trying to start a fight for no reason.",
                    "author": "Ryan111778",
                    "id": "ddnrcta",
                    "parent_id": "t1_ddnp3os",
                    "score": 3,
                    "created_utc": 1486930585.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wanna know the best part? \n\nThe best part is you can reply with both!\n\n;-)",
            "author": "SDRippington",
            "id": "ddmh39v",
            "parent_id": "t1_ddmdzfq",
            "score": 7,
            "created_utc": 1486844536.0,
            "replies": [
                {
                    "body": "Hahaha I was feeling super snarky earlier. But I do agree with your point (and think it's accurate re: women in general, not just beautiful and intelligent ones haha). And the Louis C.K. clip is apt!\n\nOn another note, it kinda makes me sad that a guy writes it and that everyone applauds him for it. I feel like the reaction (at least in general society) might be different if a girl said the same.",
                    "author": "sugarfatty",
                    "id": "ddmme4v",
                    "parent_id": "t1_ddmh39v",
                    "score": 10,
                    "created_utc": 1486852566.0,
                    "replies": [
                        {
                            "body": "I feel this is something we constantly try to explain but many Just respond with \" suck it up, butter cup.\"\n\nEmpathy is so rare these days it seems. ",
                            "author": null,
                            "id": "ddmzal5",
                            "parent_id": "t1_ddmme4v",
                            "score": 6,
                            "created_utc": 1486872834.0,
                            "replies": []
                        },
                        {
                            "body": "Well, a girl is the one that said it so I guess you could just call me \"the messenger\" :-)\n\nBut yeah, that observation is sadly true :-/",
                            "author": "SDRippington",
                            "id": "ddmmy3k",
                            "parent_id": "t1_ddmme4v",
                            "score": 3,
                            "created_utc": 1486853418.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Same",
            "author": null,
            "id": "ddmz8c9",
            "parent_id": "t1_ddmdzfq",
            "score": 3,
            "created_utc": 1486872730.0,
            "replies": []
        },
        {
            "body": "The converse is also extremely true that there just aren't quality SBs out there either. The sugar lifestyle has been so pushed with sensationalized stories in the media that it is become more and more difficult for decent people to actually find each other.",
            "author": "Ryan111778",
            "id": "ddmrpn8",
            "parent_id": "t1_ddmmi9p",
            "score": 6,
            "created_utc": 1486860836.0,
            "replies": []
        },
        {
            "body": "Since my work involves sitting in front of a computer most of time? Yep! :)\n\nAnd I agree wholeheartedly.\n",
            "author": "SDRippington",
            "id": "ddnpirw",
            "parent_id": "t1_ddmysvr",
            "score": 2,
            "created_utc": 1486928055.0,
            "replies": []
        },
        {
            "body": "Thanks! I was inspired by a conversation with one of the SB's here to write it - because she was absolutely right.\n\nI'm constantly bemoaning the flakes, but I'm not constantly trying to see things through their eyes. I know of a couple of M&G's in the last two weeks that had I been less \"annoyed\" things might have come out differently.\n\nHindsight is always 20/20 :-)",
            "author": "SDRippington",
            "id": "ddmcs7g",
            "parent_id": "t1_ddmbx7n",
            "score": 7,
            "created_utc": 1486838377.0,
            "replies": []
        },
        {
            "body": "Really great to see a SD and responding SDs who \"get it'",
            "author": "wailingmantis",
            "id": "ddmfzed",
            "parent_id": "t1_ddmbx7n",
            "score": 5,
            "created_utc": 1486842905.0,
            "replies": []
        },
        {
            "body": "> Take care of yourself.\n\nTo thine own self be true. \n\nNever sacrifice safety for the promise of $ and gifts. If everyone remembered this, so much of the inherent danger would be gone. ",
            "author": "SDRippington",
            "id": "ddmbgph",
            "parent_id": "t1_ddmbd9p",
            "score": 6,
            "created_utc": 1486836560.0,
            "replies": [
                {
                    "body": "One thing I never do is meet the women who via messaging tell me to come by their apartments. I might be a bloke but I do think of my safety, how do I know I won't turn up and be jumped by her boyfriends mates?\n\nIf something seems too easy than there is a good reason something is very wrong.",
                    "author": null,
                    "id": "ddmblxk",
                    "parent_id": "t1_ddmbgph",
                    "score": 2,
                    "created_utc": 1486836763.0,
                    "replies": [
                        {
                            "body": "Exactly this!!!\n\nOpportunism is the easiest thing for someone to prey on. \n\nI get _really_ paranoid when that happens. Especially if it's THE M&G. I'll pass - thanks!",
                            "author": "SDRippington",
                            "id": "ddmbo4q",
                            "parent_id": "t1_ddmblxk",
                            "score": 2,
                            "created_utc": 1486836848.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for this. SDs also face abuse and risks. People should know or would know the case of the Google executive who lost his life to a lady who he apparently met up on SA. This case is 3 years old but is chilling. SA has all types of women from the sweet innocent college girl to the normal working woman to the struggling single mom to the educated attorney or the tech worker just there for the variety but don't discount the escorts and the druggies, women with criminal records and women who may not be acting alone or those simply associated with the wrong people like say douche bag boyfriends with criminal mindsets. If people think they don't exist in the bowl then they are not living in reality. Put it differently there are many SDs who totally have their act together in life, great education, great career, a family and social status and a wrong association can quickly ruin that in an instant not just for them but for their reputations and families. So back to empathy, no need. Be nice and be respectful. All of us are best advised to be safe and follow our instincts! There is no need to kiss up to the SB community and say we empathize! We don't need to. ",
            "author": null,
            "id": "ddnrzme",
            "parent_id": "t1_ddn3nyd",
            "score": -2,
            "created_utc": 1486931469.0,
            "replies": [
                {
                    "body": "> People should know or would know the case of the Google executive who lost his life to a lady who he apparently met up on SA.\n\nThe fact that some SD's still reference this one event, 3 years after the fact, as proof of the dangers of SA for me is telling. ",
                    "author": "_azucar_",
                    "id": "ddo4zf8",
                    "parent_id": "t1_ddnrzme",
                    "score": 7,
                    "created_utc": 1486949445.0,
                    "replies": [
                        {
                            "body": "That was one incident that was publicly reported! It was unfortunately tragic and you are asking \"so what\"! That's a shame!! Hey what about the other one where some old fart was tied and robbed by two girls he met on SA. What about other instances which never get reported. The point is stuff happens with men as well. ",
                            "author": null,
                            "id": "ddo898z",
                            "parent_id": "t1_ddo4zf8",
                            "score": 6,
                            "created_utc": 1486953847.0,
                            "replies": [
                                {
                                    "body": "Excuse me! Where exactly do you see me saying 'So what' please? That was a horrible crime and she's rightfully paying the price in prison. I'm simply pointing out that the frequency is so low that there are only 1/2 cases that SD's repeatedly reference.\n\nOf course, it happens with both but only a fool would try and argue that it's on the same level.",
                                    "author": "_azucar_",
                                    "id": "ddo8yrz",
                                    "parent_id": "t1_ddo898z",
                                    "score": 2,
                                    "created_utc": 1486954776.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "i understand what you're saying and i understand the statistics you are referencing, but the lived experience of women -- and SBs in particular -- is that you are spending a lot of your time alone with people who could *easily* overpower you physically were they to simply decide to do so. \n\nand i think to discount that fear as 'irrational' is an invalidation of what our experience of the world is, and simply bad advice. the number of women who have suffered some form of sexual assault is very high, and self-preservation and safety should always been \"worried\" about.  \n\ni do, however, agree with you that masculinity shouldn't be so restrictive as to prevent men from talking about their own fears or times they were victimized. ",
            "author": "SquidSB",
            "id": "ddme25t",
            "parent_id": "t1_ddmbyt6",
            "score": 14,
            "created_utc": 1486840173.0,
            "replies": [
                {
                    "body": "Women DO get raped a lot. \n\nan SD I met off of SA refused to stop when I told him he was hurting me. I went home bleeding downstairs and bruised about. Since money was involved, legal action would harm me too. I had 2 really new SR's at the time. the other one was actually rapidly becoming emotionally close, so.. that kept on. This had happened to me with boyfriends a handful of times when I was younger, so my reaction was more exasperation than trauma. SD's will get angry at me if I want to text a friend what hotel I'm at, or drive myself, or send texts every hour or so on the first imtimacy date or two. But.. all of this didn't even stop the above guy. This just stops like... human trafficking, and probably not even that.",
                    "author": "Elvishgirl",
                    "id": "ddmepcr",
                    "parent_id": "t1_ddme25t",
                    "score": 19,
                    "created_utc": 1486841077.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't want to be that 1% or low percentage whatever the number :). And as I posted earlier- my friend's co-worker went home with a guy who tore her apart and disembowled her and this happened a few months ago in Dallas. I have come close, but have personally known plenty of rape victims in my life too. It is not that uncommon and we are putting ourselves out there in a world where typical predators might roam SA for just this reason; finding a victim. So be sympathetic, just like unprotected sex- I still do not like risking the low chance of getting HIV or the uncurable diseases. Health and safety are first. Prefer that over pissing off a man who gets insulted that I want to make sure he is not in the low percentage of criminals. Any percentage regarding my life is too high. ",
            "author": null,
            "id": "ddmnedp",
            "parent_id": "t1_ddmbyt6",
            "score": 7,
            "created_utc": 1486854122.0,
            "replies": []
        },
        {
            "body": "Even if men are 5x more likely to be victims of violence from other men than women are, they're indescribably more capable of defending themselves. 1 man vs. another makes for a fight, 1 man vs a woman makes for that man doing whatever he wants. ",
            "author": "wailingmantis",
            "id": "ddmg2o1",
            "parent_id": "t1_ddmbyt6",
            "score": 11,
            "created_utc": 1486843041.0,
            "replies": [
                {
                    "body": "Tell that to the women soldiers and women police officers . . . also the Congress people who insist on raising quotas.",
                    "author": "orsugar",
                    "id": "ddnp2na",
                    "parent_id": "t1_ddmg2o1",
                    "score": 0,
                    "created_utc": 1486927440.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> This creates the illusion that women have more to worry about when statistically that's not the case.\n\nWhile what you stated is 100% correct, it still boils down to the simple fact that a person's **perception** _is their reality_. \n\nI'll point to that part of my post where I said:\n> we get impatient thinking, \"why can't she see I actually am a nice guy?!\"\n\nWe can throw rationality and statistics around until we've proven the earth is shaped like a ball, but to the person sitting across from me? I just need to take a moment and realize that in spite of any statistical facts, she could literally be scared shitless at that moment. That is _her_ reality - and it costs me nothing to chill out :)",
            "author": "SDRippington",
            "id": "ddmcd2f",
            "parent_id": "t1_ddmbyt6",
            "score": 6,
            "created_utc": 1486837792.0,
            "replies": [
                {
                    "body": "No. You need to get out of there if the person sitting across you is \"literally scared shitless.\"  You have no idea into what her contrived perception (her \"reality\") will degenerate.\n\nNever sleep with a crazy; never sleep with a manipulative BPD.",
                    "author": "orsugar",
                    "id": "ddno5w8",
                    "parent_id": "t1_ddmcd2f",
                    "score": -1,
                    "created_utc": 1486926186.0,
                    "replies": [
                        {
                            "body": "It was simply a figure of speech. My whole point is to at least relax and feel a shred of empathy - especially if she's rather inexperienced.",
                            "author": "SDRippington",
                            "id": "ddnp86k",
                            "parent_id": "t1_ddno5w8",
                            "score": 4,
                            "created_utc": 1486927652.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "To your comment, we can also add that the victims in the majority instances of rape are men as well: most instances of rape are carried out on male prison inmates. \n\nWhat really comes down to is this: sperms are cheap, whereas eggs/uterus-space are expensive.  Society puts much more emphasis on women's issues than on men's issues. Just look at the size difference between the medical department devoted to women issues vs. the medical department devoted to men issues; the latter doesn't exist!  \n\nThat societal bias in and of itself is what it is, just a fact.  However, for the author of those two paragraphs to turn around and try to frame the mind of OP, that is some serious professional-grade manipulation work. ",
            "author": "orsugar",
            "id": "ddnnmn4",
            "parent_id": "t1_ddmbyt6",
            "score": 0,
            "created_utc": 1486925455.0,
            "replies": []
        },
        {
            "body": "Well that's exactly the point. You might get flakes but you generally don't have to worry about raped or murdered.",
            "author": "okaydooke",
            "id": "ddmec60",
            "parent_id": "t1_ddmdnbt",
            "score": 16,
            "created_utc": 1486840571.0,
            "replies": [
                {
                    "body": "Yes!!!!!! I keep procrastinating a pepper spray purchase too. Reminds me! ",
                    "author": null,
                    "id": "ddmn6l8",
                    "parent_id": "t1_ddmec60",
                    "score": 5,
                    "created_utc": 1486853778.0,
                    "replies": []
                },
                {
                    "body": "Well the chance of a mugging or being attacked has been a distinct possibility.  But yes there is far more fear from the female perspective ",
                    "author": "DaddyUK",
                    "id": "ddmf5yw",
                    "parent_id": "t1_ddmec60",
                    "score": 1,
                    "created_utc": 1486841729.0,
                    "replies": []
                },
                {
                    "body": "The only case of murder relating to SA that we know of is that of the former google exec. He was murdered by his SB when she administered drugs to him intravenously.",
                    "author": "orsugar",
                    "id": "ddnqkih",
                    "parent_id": "t1_ddmec60",
                    "score": 1,
                    "created_utc": 1486929498.0,
                    "replies": [
                        {
                            "body": "ive heard stories of girls getting raped and im sure theres worse. being a sugar baby is a lot more risk then being a rich , powerful man. (or someone pretending to be)",
                            "author": "okaydooke",
                            "id": "ddo87nq",
                            "parent_id": "t1_ddnqkih",
                            "score": 3,
                            "created_utc": 1486953786.0,
                            "replies": [
                                {
                                    "body": "Being a rich powerful man is the result of his past achievement or result of birth, not a result of being an SD.\n\nBeing susceptible to rape is a result of being a human being (most instances of rape involve male victims who are prison inmates), not a result of being a sugar baby. In fact, dating wealthy and socially  established men is probably safer than dating average men.\n\nMost stories are false. When there is a police report followed by a conviction, like that murder case carried out by the SB, I will believe it.",
                                    "author": "orsugar",
                                    "id": "ddo9xry",
                                    "parent_id": "t1_ddo87nq",
                                    "score": 0,
                                    "created_utc": 1486956034.0,
                                    "replies": [
                                        {
                                            "body": "lol are u really saying most rape stories are false? yeah okay",
                                            "author": "okaydooke",
                                            "id": "ddobe34",
                                            "parent_id": "t1_ddo9xry",
                                            "score": 2,
                                            "created_utc": 1486958077.0,
                                            "replies": [
                                                {
                                                    "body": "Stories are. Police reports are found to be close to 50:50.\n\nI have been told personal rape stories a few times in my life, and every single time it's a girl who was about to cheat on me, or lie to me in order to get more money than original agreement, or just disappear after receiving money; i.e. scamming/rinsing. Every, single, time, regardless whether I had met the girl only that week or had been with that girl for more than a year. It's as if there were some kind of warrior's honor code of not revealing past rape victimhood until they have their knives out for you.\n\nI'm not at all exaggerating about this, the correlation has been 100%!  Nowadays, if someone tells me her past rape victimhood, I'd clutch at my wallet and make sure it's still there.",
                                                    "author": "orsugar",
                                                    "id": "ddobm9x",
                                                    "parent_id": "t1_ddobe34",
                                                    "score": 1,
                                                    "created_utc": 1486958397.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ddmecqr",
            "parent_id": "t1_ddmdnbt",
            "score": 8,
            "created_utc": 1486840593.0,
            "replies": [
                {
                    "body": "She does want to meet up again. Shes suggesting a platonic meet again next week. If I had dangled a £400 carrot we would be in bed now. Its the fact she has lied thats annoying.",
                    "author": "DaddyUK",
                    "id": "ddmf7z3",
                    "parent_id": "t1_ddmecqr",
                    "score": -6,
                    "created_utc": 1486841807.0,
                    "replies": [
                        {
                            "body": "How do you know she lied about a family emergency? ",
                            "author": null,
                            "id": "ddmiyc3",
                            "parent_id": "t1_ddmf7z3",
                            "score": 4,
                            "created_utc": 1486847317.0,
                            "replies": [
                                {
                                    "body": "Er..... I have a family emergency. Then run off quickly. If I do that, I generally do follow up txt a few hours later and explain that I didn't feel comfortable and won't be continuing ahead. ",
                                    "author": "thatchick1993",
                                    "id": "ddmkcri",
                                    "parent_id": "t1_ddmiyc3",
                                    "score": 1,
                                    "created_utc": 1486849439.0,
                                    "replies": [
                                        {
                                            "body": "Its a transparent white lie. ",
                                            "author": "DaddyUK",
                                            "id": "ddmpjxa",
                                            "parent_id": "t1_ddmkcri",
                                            "score": 1,
                                            "created_utc": 1486857470.0,
                                            "replies": [
                                                {
                                                    "body": "Because I don't do confrontation very well and I don't like letting people down. I have a good heart and come from a good place and feel more comfortable letting them down over txt. It gives me time to truly think about the right things to say instead of saying the wrong thing and ending either hurting them more or end up in an argument. ",
                                                    "author": "thatchick1993",
                                                    "id": "ddn2nxm",
                                                    "parent_id": "t1_ddmpjxa",
                                                    "score": 1,
                                                    "created_utc": 1486878767.0,
                                                    "replies": [
                                                        {
                                                            "body": "But you have let someone down. And you need to be honest. So you would be fine with someone dumping you via text. Its weak.",
                                                            "author": "DaddyUK",
                                                            "id": "ddnbzi7",
                                                            "parent_id": "t1_ddn2nxm",
                                                            "score": 1,
                                                            "created_utc": 1486906414.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I'd be perfectly fine someome dumping me via text as long as they give me a reasonable explanation as to why they're dumping me. I don't do well talking about my emotions in person. So if someone dumps me via text it allows me to get my emotions in check and respond in a sensible way. \n\nMy SD and I have huge D&Ms over text then continue them in person. He knows I'm not good with expressing my emotions in person, so if it means he gets more out of me via text he will. ",
                                                                    "author": "thatchick1993",
                                                                    "id": "ddo415h",
                                                                    "parent_id": "t1_ddnbzi7",
                                                                    "score": 1,
                                                                    "created_utc": 1486948182.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "The amount of SB's that have family emergencies and phones being repaired is really something. \n\nMaybe im being too skeptical. Though if i was a betting man - I'd guess her mums health is just fine.",
                                    "author": "DaddyUK",
                                    "id": "ddmpi70",
                                    "parent_id": "t1_ddmiyc3",
                                    "score": -1,
                                    "created_utc": 1486857395.0,
                                    "replies": [
                                        {
                                            "body": "So what reason did she have to lie in this situation, I'm confused? \n\nYou say she wanted to see you again so what's your point?",
                                            "author": "_azucar_",
                                            "id": "ddmsi4r",
                                            "parent_id": "t1_ddmpi70",
                                            "score": 1,
                                            "created_utc": 1486862087.0,
                                            "replies": [
                                                {
                                                    "body": "She didn't want to meet this weekend as allowance figure was not nailed down. ",
                                                    "author": "DaddyUK",
                                                    "id": "ddnc10n",
                                                    "parent_id": "t1_ddmsi4r",
                                                    "score": 1,
                                                    "created_utc": 1486906520.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Yeah, I understand/agree. I've actually had a family member's health get in the way of a meet up and now I'm wondering if he thought I was flaking... ",
                                            "author": null,
                                            "id": "ddmsquw",
                                            "parent_id": "t1_ddmpi70",
                                            "score": 1,
                                            "created_utc": 1486862474.0,
                                            "replies": [
                                                {
                                                    "body": "He has heard those words before and it depends on how sceptical he is. \n\nIf he is self made, he is rolling his eyes as he reads the text and making a mental note. ",
                                                    "author": "DaddyUK",
                                                    "id": "ddnc0if",
                                                    "parent_id": "t1_ddmsquw",
                                                    "score": 0,
                                                    "created_utc": 1486906482.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Better they make an excuse and not show then to run off with your money 😒",
            "author": "Ryan111778",
            "id": "ddmrtfg",
            "parent_id": "t1_ddmdnbt",
            "score": 3,
            "created_utc": 1486861001.0,
            "replies": [
                {
                    "body": "for sure.",
                    "author": "DaddyUK",
                    "id": "ddnc1c5",
                    "parent_id": "t1_ddmrtfg",
                    "score": 1,
                    "created_utc": 1486906544.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> First off I can't see how they have to go through those pains to be an SB! I can't relate because I treat one and all with great respect.\n\nRight. And that's **you**. There are lots of douchebags out there who _are_ predators. Just because you're the Knight in Shining Armour doesn't mean there's not a whole horde of undead creeps behind you.\n\n> But WTF is with the 3X in age crap. How old is the average SB anyway! The average in my mind is 25 years, so 3X makes the average SD to be 75!!\n\nThis was told to me by a younger than 25 SB :-) But again, missing the point. We're older. Remember the saying, \"Old age and cunning will always overcome youth and skill\". Average age not important.",
            "author": "SDRippington",
            "id": "ddmabjr",
            "parent_id": "t1_ddma62m",
            "score": 13,
            "created_utc": 1486834989.0,
            "replies": [
                {
                    "body": "Yes that's me. I am just a normal guy who respects one and all and all POTs are included in that. Too bad and very sad that such basic and normal behavior amounts to being the \"knight in shining armor \" in sugar land. Do I care where the SB is coming from or how many douche bags she has dated before she landed across the table from me. NO. That's her problem and not mine. Just like she could care a super rats ass on how hard I work to make my money or how tough it was to seal the last deal at work or that I cut of another important meeting to go see her. My responsibility is to treat her right period. Treating people as people should not be hailed as great! Your post has a meaning and it's good to be aware but I won't give anyone extra points for being an SB! It's done by choice and that entails having to deal with the pros and cons just like how they exist as part of all things in life - work, marriage, relationships, business etc! Ask entrepreneurs who have raised money and they will tell you how many investors flaked and faked and wasted their time etc until the right deal came along. So sorry no brownie points for SBs!!! \n",
                    "author": null,
                    "id": "ddmgmmw",
                    "parent_id": "t1_ddmabjr",
                    "score": -6,
                    "created_utc": 1486843851.0,
                    "replies": [
                        {
                            "body": "I get all that- but again you're simply missing the point I was trying to make. Or you are and you're just saying \"So what?\" Of so then okay. I can respect that.\n\nThe ability to see things from someone else's perspective, irrespective of whether or not it's logical? Is simply empathy. You either choose to be that way or you don't. Not pointing fingers - just stating a fact of life.",
                            "author": "SDRippington",
                            "id": "ddmh9be",
                            "parent_id": "t1_ddmgmmw",
                            "score": 8,
                            "created_utc": 1486844781.0,
                            "replies": [
                                {
                                    "body": "All I am saying is no need to empathize! Just make sure they are given due respect. Fact is there are probably 1 million women on SA who are in the ages of 18 - 40. There are another 10 - 30 million women in the same age bracket with same or better looks and similar financial circumstances who choose to do multiple jobs, go to school at night, cut corners, make sacrifices or whatever it takes to survive and thrive without resorting to sugaring or any other means. Empathize with them or millions of others who go through hardships in life to make ends meet. To empathize with SBs, not sure my friend. ",
                                    "author": null,
                                    "id": "ddmmm53",
                                    "parent_id": "t1_ddmh9be",
                                    "score": -5,
                                    "created_utc": 1486852909.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ddmo2q1",
                                            "parent_id": "t1_ddmmm53",
                                            "score": 13,
                                            "created_utc": 1486855181.0,
                                            "replies": [
                                                {
                                                    "body": "> I'm going to describe myself; this is the kind of woman on SA: * Had a part time job starting at 16 while attending HS. * Was a National Merit Scholarship finalist. * Had an almost perfect SAT score. * Was the first in my family to go to college. * Had 2 part time jobs while going to school full time. * Graduated magna cum laude. * Work in an extremely selective career path and have saved enough to buy a house in California.\n> Do I deserve more respect or empathy than someone who didn't make those choices? No.\n\nOf course you think you do. Why else wasting electrons making that long list?\n\nDo you not believe you deserve more respect than someone the same age as you but is a drug addict, been arrested and thrown in jail multiple times for possession, dealing, theft and fraud?  Yes, she is on SA too!  There is  a wide range of SB's, just like there is a wide range of SD's. \n\nRespect is earned. Fondness/dotage is given for free.",
                                                    "author": "orsugar",
                                                    "id": "ddnpq7c",
                                                    "parent_id": "t1_ddmo2q1",
                                                    "score": 1,
                                                    "created_utc": 1486928339.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "You deserve respect! You deserve respect first as a human and a woman. Your achievements deserve appreciation and I am sure you have received accolades for that. May you continue to succeed and buy more home. But Read up and check my views on respect. Respect is non-negotiable. Respect is table stakes! But to glorify the challenges one faces as an SB is not something I have much empathy for. It comes with the territory. ",
                                                    "author": null,
                                                    "id": "ddmonhm",
                                                    "parent_id": "t1_ddmo2q1",
                                                    "score": -1,
                                                    "created_utc": 1486856083.0,
                                                    "replies": [
                                                        {
                                                            "body": "> But to glorify the challenges one faces as an SB is not something I have much empathy for. It comes with the territory.\n\nDating in general can be rather dangerous for a woman to begin with. Dating within the boundaries of an SR? Even moreso. \n\nJust because THEY picked to be there, doesn't mean you can't appreciate they are there, sitting in front of you, and taking more of a risk than if they were as you said, \"_do multiple jobs, go to school at night, cut corners, make sacrifices or whatever it takes to survive and thrive without resorting to sugaring_\"?\n\nIf it wasn't for them moving through their fears at that moment to be with you at an M&G? You wouldn't even be here discussing any of this. ",
                                                            "author": "SDRippington",
                                                            "id": "ddmq78k",
                                                            "parent_id": "t1_ddmonhm",
                                                            "score": 7,
                                                            "created_utc": 1486858479.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "ddmpbyh",
                                                            "parent_id": "t1_ddmonhm",
                                                            "score": 4,
                                                            "created_utc": 1486857128.0,
                                                            "replies": [
                                                                {
                                                                    "body": "And they could simply choose not to attempt any SR dating at all. Where would that leave you then? Freestyling like the days of old.\n\nShow empathy and you might have better success in the bowl. That is if that is even a concern of yours?\n\nMaybe you're a greek god and women throw themselves at you. If so? Awesome! ",
                                                                    "author": "SDRippington",
                                                                    "id": "ddmq9w0",
                                                                    "parent_id": "t1_ddmpbyh",
                                                                    "score": 5,
                                                                    "created_utc": 1486858590.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "We agree to disagree and that's not a bad thing. Please don't take anything I say personally. I see you have pointed at me and asked me if SR never existed, would I have other dating options! Yes I have and will continue to have. I won't elaborate on that or get into my success in the bowl or life in general, Enough said on that. I hope it's the same with you in terms of dating options. Will be a pathetic situation if SR and FS are the only options! ",
                                                                            "author": null,
                                                                            "id": "ddmroyw",
                                                                            "parent_id": "t1_ddmq9w0",
                                                                            "score": -3,
                                                                            "created_utc": 1486860807.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "> All I am saying is no need to empathize!\n\nOn this part we have diverged to be polar opposites. \n\nI empathize with every client I engage with in my professional life - it allows me to assess and gauge their needs with better accuracy and better outcomes. The fact I don't always do this when sitting across from an SB is actually something I need to work on - because I recognize its value.\n\n> There are another 10 - 30 million women in the same age bracket with same or better looks and similar financial circumstances who choose to do multiple jobs, go to school at night, cut corners, make sacrifices or whatever it takes to survive and thrive without resorting to sugaring or any other means.\n\nYeah. Now I am going to say this, and please, read it slowly so it sinks in - _I can and will always try to empathize with anyone regardless of situation_  **however** what I am talking about here is having a modicum of empathy _for the woman sitting across from you at the !@#$ table of a M&G_. Whether you feel that is worth the effort or not is entirely _up to you_. \n\nThe simple fact is, anyone who makes the choice to empathize _will have a lot better chance_ of having an intimate time with said woman you are trying to be with. Why are you debating this simple point?\n\nI don't care if it's an SR Meet and Greet, or a date from someone I met in my vanilla life - the woman sitting across from me at the dinner table has a lot more to fear from me than I do about her. Why is this so difficult to understand? Because they are choosing to be there? Well **so what**! What the Hell does that have anything to do as to whether or not I should feel some empathy?",
                                            "author": "SDRippington",
                                            "id": "ddmq0zk",
                                            "parent_id": "t1_ddmmm53",
                                            "score": 7,
                                            "created_utc": 1486858206.0,
                                            "replies": [
                                                {
                                                    "body": "I am not fighting a popularity contest here. If someone wants to be an SB, odds are they will have to put in the work and go through the drill. Why empathize or feel great if one does! That's the path chosen and they know the payoffs of success. It's a choice. As a young entrepreneur I remember a lot of doors got slammed on me. I was invited to many frivolous meet and greets. Many prospects would back out at the last minute.  Many said they would fund but never came through. There were enough but subtle attempts to rob the idea I had.  Hey it's all part of the game. I never expected my investors to empathize! And most never did. My goal was to get funded and I knew I had a great idea and that the right investor was around the corner. The investors could care less if I had skipped lunch or put in an all nighter on the pitch or that my coder just quit on me. I know different situations but similar principles. I am sure there will be reasons to disagree with my points and that's ok. ",
                                                    "author": null,
                                                    "id": "ddms8r3",
                                                    "parent_id": "t1_ddmq0zk",
                                                    "score": 0,
                                                    "created_utc": 1486861680.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "\"Just like she could care a super rats ass on how hard I work to make my money or how tough it was to seal the last deal at work or that I cut of another important meeting to go see her.\" I do appreciate this and stress it to SD's all the freakin time and even said that over and over during sex and has been a turn on! I value the kindness and hard work of the SD but you guys need to value our apprehension to be in private in the beginning and care about keeping our limbs in tact! My friend's colleague went home with a man (vanilla dating) and he disembowled this sweet girl. He was a young, attractive and charming guy. Give us some brownie points for caring about our longevity on this planet. If you have a sister I hope you would agree. ",
                            "author": null,
                            "id": "ddmn2xj",
                            "parent_id": "t1_ddmgmmw",
                            "score": 6,
                            "created_utc": 1486853621.0,
                            "replies": [
                                {
                                    "body": "100 percent agree and that dude who disembowled your friend is God lucky that the girl he did that too is not my sister!! There is zero sympathy for such men in my mind  and heart!!  These young charming whatever types should be deported to Saudi Arabia for the right justice! Second, in all my SRs I have made sure we are both friendly enough (could be a few weeks) until we seek alone time. Like I said all this is table stakes for me and I only speak for myself and how I treat people. ",
                                    "author": null,
                                    "id": "ddmngpp",
                                    "parent_id": "t1_ddmn2xj",
                                    "score": 1,
                                    "created_utc": 1486854223.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ddmmr6v",
                            "parent_id": "t1_ddmgmmw",
                            "score": 6,
                            "created_utc": 1486853124.0,
                            "replies": [
                                {
                                    "body": "Don't take anything personally. I have no desire to impress anyone on this thread or any interest in making friends. I am here to offer an opinion which differs from the OP. That does not make me disrespectful of anyone. ",
                                    "author": null,
                                    "id": "ddmn14c",
                                    "parent_id": "t1_ddmmr6v",
                                    "score": -2,
                                    "created_utc": 1486853541.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you just take the adult years past 18, a 46yo SD does have three times as much experience in adult life as a 25yo SB. I think the point is valid.",
            "author": "calicocuddles",
            "id": "ddmaeds",
            "parent_id": "t1_ddma62m",
            "score": 14,
            "created_utc": 1486835101.0,
            "replies": []
        },
        {
            "body": "Watch this clip and you'll get it :-)\n\nhttps://www.youtube.com/watch?v=yRzs7v0do_Q\n\nAnd another funny one (love this guy)\n\nhttps://www.youtube.com/watch?v=OMBnZYdUBOw",
            "author": "SDRippington",
            "id": "ddmas3v",
            "parent_id": "t1_ddma62m",
            "score": 2,
            "created_utc": 1486835617.0,
            "replies": [
                {
                    "body": "louis ck is so talented and so fuckable",
                    "author": "SquidSB",
                    "id": "ddme43p",
                    "parent_id": "t1_ddmas3v",
                    "score": 5,
                    "created_utc": 1486840252.0,
                    "replies": []
                },
                {
                    "body": "I saw louis c k live!  He was awesome.",
                    "author": "milliondollarkitty",
                    "id": "ddmg63p",
                    "parent_id": "t1_ddmas3v",
                    "score": 2,
                    "created_utc": 1486843182.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> did not pass my pop quiz- \"what is my name\"? \n\na classic.........  ",
            "author": "pinotandsugar",
            "id": "ddmyv04",
            "parent_id": "t1_ddmmr5k",
            "score": 5,
            "created_utc": 1486872128.0,
            "replies": []
        },
        {
            "body": "I recently had the opposite problem.  A girl pressuring me to go to the hotel across the street from a trendy bar.  I didn't even know there was a hotel across the street.  I think it all really depends on the guy, girl and chemistry.  Even in my vanilla dating years, I struggle to recall the girls that it took more than a week to sleep with.  Usually if it was more than a week or 2, they just weren't that into me and we never dated in the first place.  But I do agree with the post about this being risky for the girl.  For the guy, it's just expensive (you can go to Maui or Europe 3-6x a year on what it takes to sugar), lose your reputation (and income, family if you have one).  But girls stand a greater chance of losing their health or life.  Thus proving that free money for something simple is never really free.",
            "author": null,
            "id": "ddnawpq",
            "parent_id": "t1_ddmmr5k",
            "score": 5,
            "created_utc": 1486903385.0,
            "replies": [
                {
                    "body": "\"Even in my vanilla dating years, I struggle to recall the girls that it took more than a week to sleep with. \" Yes, at least in the vanilla dating world I try to stress this exact concept vs the people who want to wait x amount of dates or 2 months to be intimate. If you had to wait that long, maybe I am not attracted to you; do not slut shame someone who actually wants to jump your bones! Be flattered! ",
                    "author": null,
                    "id": "ddnntj8",
                    "parent_id": "t1_ddnawpq",
                    "score": 1,
                    "created_utc": 1486925715.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have had a couple POTs recently that I tried to set up a M&G with and they just wanted me to come over to their apartment for an hour. Hmmm.....",
            "author": "Ryan111778",
            "id": "ddma6b6",
            "parent_id": "t1_ddm9vm3",
            "score": 2,
            "created_utc": 1486834783.0,
            "replies": [
                {
                    "body": "Like I said - pool is being diluted.",
                    "author": "SDRippington",
                    "id": "ddmag65",
                    "parent_id": "t1_ddma6b6",
                    "score": 5,
                    "created_utc": 1486835175.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry to be the bearer of bad news. IMHO, the quoted two paragraphs came from a very \"professional\" perspective, and were meant to manipulate.  A normal girl would not be spelling out those two paragraphs for you, as it would not deter a real scammer or rapist.  A normal girl is not likely to play her vulnerability card to a stranger; a pro would. If a normal girl actually believed what she wrote, the only rational course of action would be quitting the venue altogether; I would if I were in her shoes believing what she purports to believe. The reward/risk ratio doesn't make any sense.\n\nBTW, while she is correct that men are usually physically stronger than women, women are mentally much more capable than men when it comes to relationships and framing the other person's mind. Historically, it was probably necessary for women to use their brains to move the muscles around them.\n\nEdit: OK, the professional down-voters are afraid that their industrial secret is out in the open, may as well lay the detailed analysis out in the open, as reward for their down-voting:\n\n> I think guys just don't get what it's like for us in the bowl. \n\nThen shouldn't she find someone who gets it instead? or stop meeting guys altogether?  Why does she insist on meeting guys who don't get it? Classic industrial-grade shaming tactic to start the conversation.\n\n> The biggest concerns you guys seem to have relate to your wallets and egos. But we have to worry about being raped, abused, scammed, stalked, disrespected, insulted, treated like objects. The stakes are just so much higher for us.\n\nIf she is treating it like normal dating, why would she be encountering that long list of reactions (any more  than normal vanilla dating)?  How is risk of being raped/abused/stalked any greater in the sugar bowl than in vanilla (online) dating? given that the guy in the sugar bowl is likely to have more assets and social standing at risk than the average guy in vanilla online dating. Is she advocating parents be match makers or mandatory chaperones for all (online) dating? Why is she not if she believes those high risks. Scammed is a wallet issue; disrespected/insulted/treated like objects are ego issues.  Does she believe her ego is more important than the POT's ego? Yes she does, as she clearly stated, and she believes you should agree that her ego is more important than yours.   \n\n> It can be really scary and nerve wracking. We feel so vulnerable. \n\nThen why not get out of the sugar bowl? I'm not saying people shouldn't take precautions; however, trying to manipulate using the \"vulnerability\" card is tantamount to perverse selection: cock-blocking the \"nice guys\" while not having any effect on the less ethical. Most normal girls know that and therefore don't play the card; it's the professionals who play that card in order to exploit the men.  Most normal girls know some risks are involved just like in normal vanilla dating; that's why they find guys who are attractive enough and capable enough then stick with them. It's the professionals who talk about exorbitant risks and then keep going back into the bowl fishing for the next patron.\n\n>You guys are like 3x our ages \n\nWhy doesn't she pick someone 2x or 1.5x? 20x3=60, 25x3=75. There are plenty SD's not that old. The \"SB\" who assumes and is deliberately looking for men in their 60-75 years of age is probably a pro, as she clearly associates sex in the sugar bowl with distaste. How can she not be a pro if all she finds are men 3x her own age? and has to speak of herself in plural? as in the prostitute collective.\n\n> and have decades of experience on us, negotiating ability, net worth, etc. The power imbalance is crazy. \n\nShe probably has more sex partners in a year than he does in a decade if not a life time. The power imbalance is crazy: he is the romantic whereas she is the exploitationist; she has him by the balls.\n\n> And women in general are used to putting other people's feelings over our own and not being assertive so we're especially at a disadvantage.\n\nThe general case is not correct, unless \"other people\" means her own children. She has clearly shown that her ego is more important to her than your ego is to her . . . which is not wrong in itself, but very manipulative of her then to claim herself putting other people's feelings ahead of her own. The two paragraphs indicate at least narcissistic personality: unable to recognize other people's feelings. Could be a BPD chronicle liar as well. An attractive girl finding relatively easy success in the sugar bowl wouldn't have the dire thoughts or first-hand experience to share with you. ",
            "author": "orsugar",
            "id": "ddmyy0x",
            "parent_id": "t1_ddm9vm3",
            "score": -11,
            "created_utc": 1486872262.0,
            "replies": []
        },
        {
            "body": "Good job taking one sentence out of context and trying to start a fight for no reason.",
            "author": "Ryan111778",
            "id": "ddnrcta",
            "parent_id": "t1_ddnp3os",
            "score": 3,
            "created_utc": 1486930585.0,
            "replies": []
        },
        {
            "body": "Hahaha I was feeling super snarky earlier. But I do agree with your point (and think it's accurate re: women in general, not just beautiful and intelligent ones haha). And the Louis C.K. clip is apt!\n\nOn another note, it kinda makes me sad that a guy writes it and that everyone applauds him for it. I feel like the reaction (at least in general society) might be different if a girl said the same.",
            "author": "sugarfatty",
            "id": "ddmme4v",
            "parent_id": "t1_ddmh39v",
            "score": 10,
            "created_utc": 1486852566.0,
            "replies": [
                {
                    "body": "I feel this is something we constantly try to explain but many Just respond with \" suck it up, butter cup.\"\n\nEmpathy is so rare these days it seems. ",
                    "author": null,
                    "id": "ddmzal5",
                    "parent_id": "t1_ddmme4v",
                    "score": 6,
                    "created_utc": 1486872834.0,
                    "replies": []
                },
                {
                    "body": "Well, a girl is the one that said it so I guess you could just call me \"the messenger\" :-)\n\nBut yeah, that observation is sadly true :-/",
                    "author": "SDRippington",
                    "id": "ddmmy3k",
                    "parent_id": "t1_ddmme4v",
                    "score": 3,
                    "created_utc": 1486853418.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "One thing I never do is meet the women who via messaging tell me to come by their apartments. I might be a bloke but I do think of my safety, how do I know I won't turn up and be jumped by her boyfriends mates?\n\nIf something seems too easy than there is a good reason something is very wrong.",
            "author": null,
            "id": "ddmblxk",
            "parent_id": "t1_ddmbgph",
            "score": 2,
            "created_utc": 1486836763.0,
            "replies": [
                {
                    "body": "Exactly this!!!\n\nOpportunism is the easiest thing for someone to prey on. \n\nI get _really_ paranoid when that happens. Especially if it's THE M&G. I'll pass - thanks!",
                    "author": "SDRippington",
                    "id": "ddmbo4q",
                    "parent_id": "t1_ddmblxk",
                    "score": 2,
                    "created_utc": 1486836848.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> People should know or would know the case of the Google executive who lost his life to a lady who he apparently met up on SA.\n\nThe fact that some SD's still reference this one event, 3 years after the fact, as proof of the dangers of SA for me is telling. ",
            "author": "_azucar_",
            "id": "ddo4zf8",
            "parent_id": "t1_ddnrzme",
            "score": 7,
            "created_utc": 1486949445.0,
            "replies": [
                {
                    "body": "That was one incident that was publicly reported! It was unfortunately tragic and you are asking \"so what\"! That's a shame!! Hey what about the other one where some old fart was tied and robbed by two girls he met on SA. What about other instances which never get reported. The point is stuff happens with men as well. ",
                    "author": null,
                    "id": "ddo898z",
                    "parent_id": "t1_ddo4zf8",
                    "score": 6,
                    "created_utc": 1486953847.0,
                    "replies": [
                        {
                            "body": "Excuse me! Where exactly do you see me saying 'So what' please? That was a horrible crime and she's rightfully paying the price in prison. I'm simply pointing out that the frequency is so low that there are only 1/2 cases that SD's repeatedly reference.\n\nOf course, it happens with both but only a fool would try and argue that it's on the same level.",
                            "author": "_azucar_",
                            "id": "ddo8yrz",
                            "parent_id": "t1_ddo898z",
                            "score": 2,
                            "created_utc": 1486954776.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Women DO get raped a lot. \n\nan SD I met off of SA refused to stop when I told him he was hurting me. I went home bleeding downstairs and bruised about. Since money was involved, legal action would harm me too. I had 2 really new SR's at the time. the other one was actually rapidly becoming emotionally close, so.. that kept on. This had happened to me with boyfriends a handful of times when I was younger, so my reaction was more exasperation than trauma. SD's will get angry at me if I want to text a friend what hotel I'm at, or drive myself, or send texts every hour or so on the first imtimacy date or two. But.. all of this didn't even stop the above guy. This just stops like... human trafficking, and probably not even that.",
            "author": "Elvishgirl",
            "id": "ddmepcr",
            "parent_id": "t1_ddme25t",
            "score": 19,
            "created_utc": 1486841077.0,
            "replies": []
        },
        {
            "body": "Tell that to the women soldiers and women police officers . . . also the Congress people who insist on raising quotas.",
            "author": "orsugar",
            "id": "ddnp2na",
            "parent_id": "t1_ddmg2o1",
            "score": 0,
            "created_utc": 1486927440.0,
            "replies": []
        },
        {
            "body": "No. You need to get out of there if the person sitting across you is \"literally scared shitless.\"  You have no idea into what her contrived perception (her \"reality\") will degenerate.\n\nNever sleep with a crazy; never sleep with a manipulative BPD.",
            "author": "orsugar",
            "id": "ddno5w8",
            "parent_id": "t1_ddmcd2f",
            "score": -1,
            "created_utc": 1486926186.0,
            "replies": [
                {
                    "body": "It was simply a figure of speech. My whole point is to at least relax and feel a shred of empathy - especially if she's rather inexperienced.",
                    "author": "SDRippington",
                    "id": "ddnp86k",
                    "parent_id": "t1_ddno5w8",
                    "score": 4,
                    "created_utc": 1486927652.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes!!!!!! I keep procrastinating a pepper spray purchase too. Reminds me! ",
            "author": null,
            "id": "ddmn6l8",
            "parent_id": "t1_ddmec60",
            "score": 5,
            "created_utc": 1486853778.0,
            "replies": []
        },
        {
            "body": "Well the chance of a mugging or being attacked has been a distinct possibility.  But yes there is far more fear from the female perspective ",
            "author": "DaddyUK",
            "id": "ddmf5yw",
            "parent_id": "t1_ddmec60",
            "score": 1,
            "created_utc": 1486841729.0,
            "replies": []
        },
        {
            "body": "The only case of murder relating to SA that we know of is that of the former google exec. He was murdered by his SB when she administered drugs to him intravenously.",
            "author": "orsugar",
            "id": "ddnqkih",
            "parent_id": "t1_ddmec60",
            "score": 1,
            "created_utc": 1486929498.0,
            "replies": [
                {
                    "body": "ive heard stories of girls getting raped and im sure theres worse. being a sugar baby is a lot more risk then being a rich , powerful man. (or someone pretending to be)",
                    "author": "okaydooke",
                    "id": "ddo87nq",
                    "parent_id": "t1_ddnqkih",
                    "score": 3,
                    "created_utc": 1486953786.0,
                    "replies": [
                        {
                            "body": "Being a rich powerful man is the result of his past achievement or result of birth, not a result of being an SD.\n\nBeing susceptible to rape is a result of being a human being (most instances of rape involve male victims who are prison inmates), not a result of being a sugar baby. In fact, dating wealthy and socially  established men is probably safer than dating average men.\n\nMost stories are false. When there is a police report followed by a conviction, like that murder case carried out by the SB, I will believe it.",
                            "author": "orsugar",
                            "id": "ddo9xry",
                            "parent_id": "t1_ddo87nq",
                            "score": 0,
                            "created_utc": 1486956034.0,
                            "replies": [
                                {
                                    "body": "lol are u really saying most rape stories are false? yeah okay",
                                    "author": "okaydooke",
                                    "id": "ddobe34",
                                    "parent_id": "t1_ddo9xry",
                                    "score": 2,
                                    "created_utc": 1486958077.0,
                                    "replies": [
                                        {
                                            "body": "Stories are. Police reports are found to be close to 50:50.\n\nI have been told personal rape stories a few times in my life, and every single time it's a girl who was about to cheat on me, or lie to me in order to get more money than original agreement, or just disappear after receiving money; i.e. scamming/rinsing. Every, single, time, regardless whether I had met the girl only that week or had been with that girl for more than a year. It's as if there were some kind of warrior's honor code of not revealing past rape victimhood until they have their knives out for you.\n\nI'm not at all exaggerating about this, the correlation has been 100%!  Nowadays, if someone tells me her past rape victimhood, I'd clutch at my wallet and make sure it's still there.",
                                            "author": "orsugar",
                                            "id": "ddobm9x",
                                            "parent_id": "t1_ddobe34",
                                            "score": 1,
                                            "created_utc": 1486958397.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "She does want to meet up again. Shes suggesting a platonic meet again next week. If I had dangled a £400 carrot we would be in bed now. Its the fact she has lied thats annoying.",
            "author": "DaddyUK",
            "id": "ddmf7z3",
            "parent_id": "t1_ddmecqr",
            "score": -6,
            "created_utc": 1486841807.0,
            "replies": [
                {
                    "body": "How do you know she lied about a family emergency? ",
                    "author": null,
                    "id": "ddmiyc3",
                    "parent_id": "t1_ddmf7z3",
                    "score": 4,
                    "created_utc": 1486847317.0,
                    "replies": [
                        {
                            "body": "Er..... I have a family emergency. Then run off quickly. If I do that, I generally do follow up txt a few hours later and explain that I didn't feel comfortable and won't be continuing ahead. ",
                            "author": "thatchick1993",
                            "id": "ddmkcri",
                            "parent_id": "t1_ddmiyc3",
                            "score": 1,
                            "created_utc": 1486849439.0,
                            "replies": [
                                {
                                    "body": "Its a transparent white lie. ",
                                    "author": "DaddyUK",
                                    "id": "ddmpjxa",
                                    "parent_id": "t1_ddmkcri",
                                    "score": 1,
                                    "created_utc": 1486857470.0,
                                    "replies": [
                                        {
                                            "body": "Because I don't do confrontation very well and I don't like letting people down. I have a good heart and come from a good place and feel more comfortable letting them down over txt. It gives me time to truly think about the right things to say instead of saying the wrong thing and ending either hurting them more or end up in an argument. ",
                                            "author": "thatchick1993",
                                            "id": "ddn2nxm",
                                            "parent_id": "t1_ddmpjxa",
                                            "score": 1,
                                            "created_utc": 1486878767.0,
                                            "replies": [
                                                {
                                                    "body": "But you have let someone down. And you need to be honest. So you would be fine with someone dumping you via text. Its weak.",
                                                    "author": "DaddyUK",
                                                    "id": "ddnbzi7",
                                                    "parent_id": "t1_ddn2nxm",
                                                    "score": 1,
                                                    "created_utc": 1486906414.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'd be perfectly fine someome dumping me via text as long as they give me a reasonable explanation as to why they're dumping me. I don't do well talking about my emotions in person. So if someone dumps me via text it allows me to get my emotions in check and respond in a sensible way. \n\nMy SD and I have huge D&Ms over text then continue them in person. He knows I'm not good with expressing my emotions in person, so if it means he gets more out of me via text he will. ",
                                                            "author": "thatchick1993",
                                                            "id": "ddo415h",
                                                            "parent_id": "t1_ddnbzi7",
                                                            "score": 1,
                                                            "created_utc": 1486948182.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "The amount of SB's that have family emergencies and phones being repaired is really something. \n\nMaybe im being too skeptical. Though if i was a betting man - I'd guess her mums health is just fine.",
                            "author": "DaddyUK",
                            "id": "ddmpi70",
                            "parent_id": "t1_ddmiyc3",
                            "score": -1,
                            "created_utc": 1486857395.0,
                            "replies": [
                                {
                                    "body": "So what reason did she have to lie in this situation, I'm confused? \n\nYou say she wanted to see you again so what's your point?",
                                    "author": "_azucar_",
                                    "id": "ddmsi4r",
                                    "parent_id": "t1_ddmpi70",
                                    "score": 1,
                                    "created_utc": 1486862087.0,
                                    "replies": [
                                        {
                                            "body": "She didn't want to meet this weekend as allowance figure was not nailed down. ",
                                            "author": "DaddyUK",
                                            "id": "ddnc10n",
                                            "parent_id": "t1_ddmsi4r",
                                            "score": 1,
                                            "created_utc": 1486906520.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Yeah, I understand/agree. I've actually had a family member's health get in the way of a meet up and now I'm wondering if he thought I was flaking... ",
                                    "author": null,
                                    "id": "ddmsquw",
                                    "parent_id": "t1_ddmpi70",
                                    "score": 1,
                                    "created_utc": 1486862474.0,
                                    "replies": [
                                        {
                                            "body": "He has heard those words before and it depends on how sceptical he is. \n\nIf he is self made, he is rolling his eyes as he reads the text and making a mental note. ",
                                            "author": "DaddyUK",
                                            "id": "ddnc0if",
                                            "parent_id": "t1_ddmsquw",
                                            "score": 0,
                                            "created_utc": 1486906482.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "for sure.",
            "author": "DaddyUK",
            "id": "ddnc1c5",
            "parent_id": "t1_ddmrtfg",
            "score": 1,
            "created_utc": 1486906544.0,
            "replies": []
        },
        {
            "body": "Yes that's me. I am just a normal guy who respects one and all and all POTs are included in that. Too bad and very sad that such basic and normal behavior amounts to being the \"knight in shining armor \" in sugar land. Do I care where the SB is coming from or how many douche bags she has dated before she landed across the table from me. NO. That's her problem and not mine. Just like she could care a super rats ass on how hard I work to make my money or how tough it was to seal the last deal at work or that I cut of another important meeting to go see her. My responsibility is to treat her right period. Treating people as people should not be hailed as great! Your post has a meaning and it's good to be aware but I won't give anyone extra points for being an SB! It's done by choice and that entails having to deal with the pros and cons just like how they exist as part of all things in life - work, marriage, relationships, business etc! Ask entrepreneurs who have raised money and they will tell you how many investors flaked and faked and wasted their time etc until the right deal came along. So sorry no brownie points for SBs!!! \n",
            "author": null,
            "id": "ddmgmmw",
            "parent_id": "t1_ddmabjr",
            "score": -6,
            "created_utc": 1486843851.0,
            "replies": [
                {
                    "body": "I get all that- but again you're simply missing the point I was trying to make. Or you are and you're just saying \"So what?\" Of so then okay. I can respect that.\n\nThe ability to see things from someone else's perspective, irrespective of whether or not it's logical? Is simply empathy. You either choose to be that way or you don't. Not pointing fingers - just stating a fact of life.",
                    "author": "SDRippington",
                    "id": "ddmh9be",
                    "parent_id": "t1_ddmgmmw",
                    "score": 8,
                    "created_utc": 1486844781.0,
                    "replies": [
                        {
                            "body": "All I am saying is no need to empathize! Just make sure they are given due respect. Fact is there are probably 1 million women on SA who are in the ages of 18 - 40. There are another 10 - 30 million women in the same age bracket with same or better looks and similar financial circumstances who choose to do multiple jobs, go to school at night, cut corners, make sacrifices or whatever it takes to survive and thrive without resorting to sugaring or any other means. Empathize with them or millions of others who go through hardships in life to make ends meet. To empathize with SBs, not sure my friend. ",
                            "author": null,
                            "id": "ddmmm53",
                            "parent_id": "t1_ddmh9be",
                            "score": -5,
                            "created_utc": 1486852909.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ddmo2q1",
                                    "parent_id": "t1_ddmmm53",
                                    "score": 13,
                                    "created_utc": 1486855181.0,
                                    "replies": [
                                        {
                                            "body": "> I'm going to describe myself; this is the kind of woman on SA: * Had a part time job starting at 16 while attending HS. * Was a National Merit Scholarship finalist. * Had an almost perfect SAT score. * Was the first in my family to go to college. * Had 2 part time jobs while going to school full time. * Graduated magna cum laude. * Work in an extremely selective career path and have saved enough to buy a house in California.\n> Do I deserve more respect or empathy than someone who didn't make those choices? No.\n\nOf course you think you do. Why else wasting electrons making that long list?\n\nDo you not believe you deserve more respect than someone the same age as you but is a drug addict, been arrested and thrown in jail multiple times for possession, dealing, theft and fraud?  Yes, she is on SA too!  There is  a wide range of SB's, just like there is a wide range of SD's. \n\nRespect is earned. Fondness/dotage is given for free.",
                                            "author": "orsugar",
                                            "id": "ddnpq7c",
                                            "parent_id": "t1_ddmo2q1",
                                            "score": 1,
                                            "created_utc": 1486928339.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "You deserve respect! You deserve respect first as a human and a woman. Your achievements deserve appreciation and I am sure you have received accolades for that. May you continue to succeed and buy more home. But Read up and check my views on respect. Respect is non-negotiable. Respect is table stakes! But to glorify the challenges one faces as an SB is not something I have much empathy for. It comes with the territory. ",
                                            "author": null,
                                            "id": "ddmonhm",
                                            "parent_id": "t1_ddmo2q1",
                                            "score": -1,
                                            "created_utc": 1486856083.0,
                                            "replies": [
                                                {
                                                    "body": "> But to glorify the challenges one faces as an SB is not something I have much empathy for. It comes with the territory.\n\nDating in general can be rather dangerous for a woman to begin with. Dating within the boundaries of an SR? Even moreso. \n\nJust because THEY picked to be there, doesn't mean you can't appreciate they are there, sitting in front of you, and taking more of a risk than if they were as you said, \"_do multiple jobs, go to school at night, cut corners, make sacrifices or whatever it takes to survive and thrive without resorting to sugaring_\"?\n\nIf it wasn't for them moving through their fears at that moment to be with you at an M&G? You wouldn't even be here discussing any of this. ",
                                                    "author": "SDRippington",
                                                    "id": "ddmq78k",
                                                    "parent_id": "t1_ddmonhm",
                                                    "score": 7,
                                                    "created_utc": 1486858479.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "ddmpbyh",
                                                    "parent_id": "t1_ddmonhm",
                                                    "score": 4,
                                                    "created_utc": 1486857128.0,
                                                    "replies": [
                                                        {
                                                            "body": "And they could simply choose not to attempt any SR dating at all. Where would that leave you then? Freestyling like the days of old.\n\nShow empathy and you might have better success in the bowl. That is if that is even a concern of yours?\n\nMaybe you're a greek god and women throw themselves at you. If so? Awesome! ",
                                                            "author": "SDRippington",
                                                            "id": "ddmq9w0",
                                                            "parent_id": "t1_ddmpbyh",
                                                            "score": 5,
                                                            "created_utc": 1486858590.0,
                                                            "replies": [
                                                                {
                                                                    "body": "We agree to disagree and that's not a bad thing. Please don't take anything I say personally. I see you have pointed at me and asked me if SR never existed, would I have other dating options! Yes I have and will continue to have. I won't elaborate on that or get into my success in the bowl or life in general, Enough said on that. I hope it's the same with you in terms of dating options. Will be a pathetic situation if SR and FS are the only options! ",
                                                                    "author": null,
                                                                    "id": "ddmroyw",
                                                                    "parent_id": "t1_ddmq9w0",
                                                                    "score": -3,
                                                                    "created_utc": 1486860807.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "> All I am saying is no need to empathize!\n\nOn this part we have diverged to be polar opposites. \n\nI empathize with every client I engage with in my professional life - it allows me to assess and gauge their needs with better accuracy and better outcomes. The fact I don't always do this when sitting across from an SB is actually something I need to work on - because I recognize its value.\n\n> There are another 10 - 30 million women in the same age bracket with same or better looks and similar financial circumstances who choose to do multiple jobs, go to school at night, cut corners, make sacrifices or whatever it takes to survive and thrive without resorting to sugaring or any other means.\n\nYeah. Now I am going to say this, and please, read it slowly so it sinks in - _I can and will always try to empathize with anyone regardless of situation_  **however** what I am talking about here is having a modicum of empathy _for the woman sitting across from you at the !@#$ table of a M&G_. Whether you feel that is worth the effort or not is entirely _up to you_. \n\nThe simple fact is, anyone who makes the choice to empathize _will have a lot better chance_ of having an intimate time with said woman you are trying to be with. Why are you debating this simple point?\n\nI don't care if it's an SR Meet and Greet, or a date from someone I met in my vanilla life - the woman sitting across from me at the dinner table has a lot more to fear from me than I do about her. Why is this so difficult to understand? Because they are choosing to be there? Well **so what**! What the Hell does that have anything to do as to whether or not I should feel some empathy?",
                                    "author": "SDRippington",
                                    "id": "ddmq0zk",
                                    "parent_id": "t1_ddmmm53",
                                    "score": 7,
                                    "created_utc": 1486858206.0,
                                    "replies": [
                                        {
                                            "body": "I am not fighting a popularity contest here. If someone wants to be an SB, odds are they will have to put in the work and go through the drill. Why empathize or feel great if one does! That's the path chosen and they know the payoffs of success. It's a choice. As a young entrepreneur I remember a lot of doors got slammed on me. I was invited to many frivolous meet and greets. Many prospects would back out at the last minute.  Many said they would fund but never came through. There were enough but subtle attempts to rob the idea I had.  Hey it's all part of the game. I never expected my investors to empathize! And most never did. My goal was to get funded and I knew I had a great idea and that the right investor was around the corner. The investors could care less if I had skipped lunch or put in an all nighter on the pitch or that my coder just quit on me. I know different situations but similar principles. I am sure there will be reasons to disagree with my points and that's ok. ",
                                            "author": null,
                                            "id": "ddms8r3",
                                            "parent_id": "t1_ddmq0zk",
                                            "score": 0,
                                            "created_utc": 1486861680.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "\"Just like she could care a super rats ass on how hard I work to make my money or how tough it was to seal the last deal at work or that I cut of another important meeting to go see her.\" I do appreciate this and stress it to SD's all the freakin time and even said that over and over during sex and has been a turn on! I value the kindness and hard work of the SD but you guys need to value our apprehension to be in private in the beginning and care about keeping our limbs in tact! My friend's colleague went home with a man (vanilla dating) and he disembowled this sweet girl. He was a young, attractive and charming guy. Give us some brownie points for caring about our longevity on this planet. If you have a sister I hope you would agree. ",
                    "author": null,
                    "id": "ddmn2xj",
                    "parent_id": "t1_ddmgmmw",
                    "score": 6,
                    "created_utc": 1486853621.0,
                    "replies": [
                        {
                            "body": "100 percent agree and that dude who disembowled your friend is God lucky that the girl he did that too is not my sister!! There is zero sympathy for such men in my mind  and heart!!  These young charming whatever types should be deported to Saudi Arabia for the right justice! Second, in all my SRs I have made sure we are both friendly enough (could be a few weeks) until we seek alone time. Like I said all this is table stakes for me and I only speak for myself and how I treat people. ",
                            "author": null,
                            "id": "ddmngpp",
                            "parent_id": "t1_ddmn2xj",
                            "score": 1,
                            "created_utc": 1486854223.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ddmmr6v",
                    "parent_id": "t1_ddmgmmw",
                    "score": 6,
                    "created_utc": 1486853124.0,
                    "replies": [
                        {
                            "body": "Don't take anything personally. I have no desire to impress anyone on this thread or any interest in making friends. I am here to offer an opinion which differs from the OP. That does not make me disrespectful of anyone. ",
                            "author": null,
                            "id": "ddmn14c",
                            "parent_id": "t1_ddmmr6v",
                            "score": -2,
                            "created_utc": 1486853541.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "louis ck is so talented and so fuckable",
            "author": "SquidSB",
            "id": "ddme43p",
            "parent_id": "t1_ddmas3v",
            "score": 5,
            "created_utc": 1486840252.0,
            "replies": []
        },
        {
            "body": "I saw louis c k live!  He was awesome.",
            "author": "milliondollarkitty",
            "id": "ddmg63p",
            "parent_id": "t1_ddmas3v",
            "score": 2,
            "created_utc": 1486843182.0,
            "replies": []
        },
        {
            "body": "\"Even in my vanilla dating years, I struggle to recall the girls that it took more than a week to sleep with. \" Yes, at least in the vanilla dating world I try to stress this exact concept vs the people who want to wait x amount of dates or 2 months to be intimate. If you had to wait that long, maybe I am not attracted to you; do not slut shame someone who actually wants to jump your bones! Be flattered! ",
            "author": null,
            "id": "ddnntj8",
            "parent_id": "t1_ddnawpq",
            "score": 1,
            "created_utc": 1486925715.0,
            "replies": []
        },
        {
            "body": "Like I said - pool is being diluted.",
            "author": "SDRippington",
            "id": "ddmag65",
            "parent_id": "t1_ddma6b6",
            "score": 5,
            "created_utc": 1486835175.0,
            "replies": []
        },
        {
            "body": "I feel this is something we constantly try to explain but many Just respond with \" suck it up, butter cup.\"\n\nEmpathy is so rare these days it seems. ",
            "author": null,
            "id": "ddmzal5",
            "parent_id": "t1_ddmme4v",
            "score": 6,
            "created_utc": 1486872834.0,
            "replies": []
        },
        {
            "body": "Well, a girl is the one that said it so I guess you could just call me \"the messenger\" :-)\n\nBut yeah, that observation is sadly true :-/",
            "author": "SDRippington",
            "id": "ddmmy3k",
            "parent_id": "t1_ddmme4v",
            "score": 3,
            "created_utc": 1486853418.0,
            "replies": []
        },
        {
            "body": "Exactly this!!!\n\nOpportunism is the easiest thing for someone to prey on. \n\nI get _really_ paranoid when that happens. Especially if it's THE M&G. I'll pass - thanks!",
            "author": "SDRippington",
            "id": "ddmbo4q",
            "parent_id": "t1_ddmblxk",
            "score": 2,
            "created_utc": 1486836848.0,
            "replies": []
        },
        {
            "body": "That was one incident that was publicly reported! It was unfortunately tragic and you are asking \"so what\"! That's a shame!! Hey what about the other one where some old fart was tied and robbed by two girls he met on SA. What about other instances which never get reported. The point is stuff happens with men as well. ",
            "author": null,
            "id": "ddo898z",
            "parent_id": "t1_ddo4zf8",
            "score": 6,
            "created_utc": 1486953847.0,
            "replies": [
                {
                    "body": "Excuse me! Where exactly do you see me saying 'So what' please? That was a horrible crime and she's rightfully paying the price in prison. I'm simply pointing out that the frequency is so low that there are only 1/2 cases that SD's repeatedly reference.\n\nOf course, it happens with both but only a fool would try and argue that it's on the same level.",
                    "author": "_azucar_",
                    "id": "ddo8yrz",
                    "parent_id": "t1_ddo898z",
                    "score": 2,
                    "created_utc": 1486954776.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It was simply a figure of speech. My whole point is to at least relax and feel a shred of empathy - especially if she's rather inexperienced.",
            "author": "SDRippington",
            "id": "ddnp86k",
            "parent_id": "t1_ddno5w8",
            "score": 4,
            "created_utc": 1486927652.0,
            "replies": []
        },
        {
            "body": "ive heard stories of girls getting raped and im sure theres worse. being a sugar baby is a lot more risk then being a rich , powerful man. (or someone pretending to be)",
            "author": "okaydooke",
            "id": "ddo87nq",
            "parent_id": "t1_ddnqkih",
            "score": 3,
            "created_utc": 1486953786.0,
            "replies": [
                {
                    "body": "Being a rich powerful man is the result of his past achievement or result of birth, not a result of being an SD.\n\nBeing susceptible to rape is a result of being a human being (most instances of rape involve male victims who are prison inmates), not a result of being a sugar baby. In fact, dating wealthy and socially  established men is probably safer than dating average men.\n\nMost stories are false. When there is a police report followed by a conviction, like that murder case carried out by the SB, I will believe it.",
                    "author": "orsugar",
                    "id": "ddo9xry",
                    "parent_id": "t1_ddo87nq",
                    "score": 0,
                    "created_utc": 1486956034.0,
                    "replies": [
                        {
                            "body": "lol are u really saying most rape stories are false? yeah okay",
                            "author": "okaydooke",
                            "id": "ddobe34",
                            "parent_id": "t1_ddo9xry",
                            "score": 2,
                            "created_utc": 1486958077.0,
                            "replies": [
                                {
                                    "body": "Stories are. Police reports are found to be close to 50:50.\n\nI have been told personal rape stories a few times in my life, and every single time it's a girl who was about to cheat on me, or lie to me in order to get more money than original agreement, or just disappear after receiving money; i.e. scamming/rinsing. Every, single, time, regardless whether I had met the girl only that week or had been with that girl for more than a year. It's as if there were some kind of warrior's honor code of not revealing past rape victimhood until they have their knives out for you.\n\nI'm not at all exaggerating about this, the correlation has been 100%!  Nowadays, if someone tells me her past rape victimhood, I'd clutch at my wallet and make sure it's still there.",
                                    "author": "orsugar",
                                    "id": "ddobm9x",
                                    "parent_id": "t1_ddobe34",
                                    "score": 1,
                                    "created_utc": 1486958397.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How do you know she lied about a family emergency? ",
            "author": null,
            "id": "ddmiyc3",
            "parent_id": "t1_ddmf7z3",
            "score": 4,
            "created_utc": 1486847317.0,
            "replies": [
                {
                    "body": "Er..... I have a family emergency. Then run off quickly. If I do that, I generally do follow up txt a few hours later and explain that I didn't feel comfortable and won't be continuing ahead. ",
                    "author": "thatchick1993",
                    "id": "ddmkcri",
                    "parent_id": "t1_ddmiyc3",
                    "score": 1,
                    "created_utc": 1486849439.0,
                    "replies": [
                        {
                            "body": "Its a transparent white lie. ",
                            "author": "DaddyUK",
                            "id": "ddmpjxa",
                            "parent_id": "t1_ddmkcri",
                            "score": 1,
                            "created_utc": 1486857470.0,
                            "replies": [
                                {
                                    "body": "Because I don't do confrontation very well and I don't like letting people down. I have a good heart and come from a good place and feel more comfortable letting them down over txt. It gives me time to truly think about the right things to say instead of saying the wrong thing and ending either hurting them more or end up in an argument. ",
                                    "author": "thatchick1993",
                                    "id": "ddn2nxm",
                                    "parent_id": "t1_ddmpjxa",
                                    "score": 1,
                                    "created_utc": 1486878767.0,
                                    "replies": [
                                        {
                                            "body": "But you have let someone down. And you need to be honest. So you would be fine with someone dumping you via text. Its weak.",
                                            "author": "DaddyUK",
                                            "id": "ddnbzi7",
                                            "parent_id": "t1_ddn2nxm",
                                            "score": 1,
                                            "created_utc": 1486906414.0,
                                            "replies": [
                                                {
                                                    "body": "I'd be perfectly fine someome dumping me via text as long as they give me a reasonable explanation as to why they're dumping me. I don't do well talking about my emotions in person. So if someone dumps me via text it allows me to get my emotions in check and respond in a sensible way. \n\nMy SD and I have huge D&Ms over text then continue them in person. He knows I'm not good with expressing my emotions in person, so if it means he gets more out of me via text he will. ",
                                                    "author": "thatchick1993",
                                                    "id": "ddo415h",
                                                    "parent_id": "t1_ddnbzi7",
                                                    "score": 1,
                                                    "created_utc": 1486948182.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "The amount of SB's that have family emergencies and phones being repaired is really something. \n\nMaybe im being too skeptical. Though if i was a betting man - I'd guess her mums health is just fine.",
                    "author": "DaddyUK",
                    "id": "ddmpi70",
                    "parent_id": "t1_ddmiyc3",
                    "score": -1,
                    "created_utc": 1486857395.0,
                    "replies": [
                        {
                            "body": "So what reason did she have to lie in this situation, I'm confused? \n\nYou say she wanted to see you again so what's your point?",
                            "author": "_azucar_",
                            "id": "ddmsi4r",
                            "parent_id": "t1_ddmpi70",
                            "score": 1,
                            "created_utc": 1486862087.0,
                            "replies": [
                                {
                                    "body": "She didn't want to meet this weekend as allowance figure was not nailed down. ",
                                    "author": "DaddyUK",
                                    "id": "ddnc10n",
                                    "parent_id": "t1_ddmsi4r",
                                    "score": 1,
                                    "created_utc": 1486906520.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yeah, I understand/agree. I've actually had a family member's health get in the way of a meet up and now I'm wondering if he thought I was flaking... ",
                            "author": null,
                            "id": "ddmsquw",
                            "parent_id": "t1_ddmpi70",
                            "score": 1,
                            "created_utc": 1486862474.0,
                            "replies": [
                                {
                                    "body": "He has heard those words before and it depends on how sceptical he is. \n\nIf he is self made, he is rolling his eyes as he reads the text and making a mental note. ",
                                    "author": "DaddyUK",
                                    "id": "ddnc0if",
                                    "parent_id": "t1_ddmsquw",
                                    "score": 0,
                                    "created_utc": 1486906482.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I get all that- but again you're simply missing the point I was trying to make. Or you are and you're just saying \"So what?\" Of so then okay. I can respect that.\n\nThe ability to see things from someone else's perspective, irrespective of whether or not it's logical? Is simply empathy. You either choose to be that way or you don't. Not pointing fingers - just stating a fact of life.",
            "author": "SDRippington",
            "id": "ddmh9be",
            "parent_id": "t1_ddmgmmw",
            "score": 8,
            "created_utc": 1486844781.0,
            "replies": [
                {
                    "body": "All I am saying is no need to empathize! Just make sure they are given due respect. Fact is there are probably 1 million women on SA who are in the ages of 18 - 40. There are another 10 - 30 million women in the same age bracket with same or better looks and similar financial circumstances who choose to do multiple jobs, go to school at night, cut corners, make sacrifices or whatever it takes to survive and thrive without resorting to sugaring or any other means. Empathize with them or millions of others who go through hardships in life to make ends meet. To empathize with SBs, not sure my friend. ",
                    "author": null,
                    "id": "ddmmm53",
                    "parent_id": "t1_ddmh9be",
                    "score": -5,
                    "created_utc": 1486852909.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ddmo2q1",
                            "parent_id": "t1_ddmmm53",
                            "score": 13,
                            "created_utc": 1486855181.0,
                            "replies": [
                                {
                                    "body": "> I'm going to describe myself; this is the kind of woman on SA: * Had a part time job starting at 16 while attending HS. * Was a National Merit Scholarship finalist. * Had an almost perfect SAT score. * Was the first in my family to go to college. * Had 2 part time jobs while going to school full time. * Graduated magna cum laude. * Work in an extremely selective career path and have saved enough to buy a house in California.\n> Do I deserve more respect or empathy than someone who didn't make those choices? No.\n\nOf course you think you do. Why else wasting electrons making that long list?\n\nDo you not believe you deserve more respect than someone the same age as you but is a drug addict, been arrested and thrown in jail multiple times for possession, dealing, theft and fraud?  Yes, she is on SA too!  There is  a wide range of SB's, just like there is a wide range of SD's. \n\nRespect is earned. Fondness/dotage is given for free.",
                                    "author": "orsugar",
                                    "id": "ddnpq7c",
                                    "parent_id": "t1_ddmo2q1",
                                    "score": 1,
                                    "created_utc": 1486928339.0,
                                    "replies": []
                                },
                                {
                                    "body": "You deserve respect! You deserve respect first as a human and a woman. Your achievements deserve appreciation and I am sure you have received accolades for that. May you continue to succeed and buy more home. But Read up and check my views on respect. Respect is non-negotiable. Respect is table stakes! But to glorify the challenges one faces as an SB is not something I have much empathy for. It comes with the territory. ",
                                    "author": null,
                                    "id": "ddmonhm",
                                    "parent_id": "t1_ddmo2q1",
                                    "score": -1,
                                    "created_utc": 1486856083.0,
                                    "replies": [
                                        {
                                            "body": "> But to glorify the challenges one faces as an SB is not something I have much empathy for. It comes with the territory.\n\nDating in general can be rather dangerous for a woman to begin with. Dating within the boundaries of an SR? Even moreso. \n\nJust because THEY picked to be there, doesn't mean you can't appreciate they are there, sitting in front of you, and taking more of a risk than if they were as you said, \"_do multiple jobs, go to school at night, cut corners, make sacrifices or whatever it takes to survive and thrive without resorting to sugaring_\"?\n\nIf it wasn't for them moving through their fears at that moment to be with you at an M&G? You wouldn't even be here discussing any of this. ",
                                            "author": "SDRippington",
                                            "id": "ddmq78k",
                                            "parent_id": "t1_ddmonhm",
                                            "score": 7,
                                            "created_utc": 1486858479.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ddmpbyh",
                                            "parent_id": "t1_ddmonhm",
                                            "score": 4,
                                            "created_utc": 1486857128.0,
                                            "replies": [
                                                {
                                                    "body": "And they could simply choose not to attempt any SR dating at all. Where would that leave you then? Freestyling like the days of old.\n\nShow empathy and you might have better success in the bowl. That is if that is even a concern of yours?\n\nMaybe you're a greek god and women throw themselves at you. If so? Awesome! ",
                                                    "author": "SDRippington",
                                                    "id": "ddmq9w0",
                                                    "parent_id": "t1_ddmpbyh",
                                                    "score": 5,
                                                    "created_utc": 1486858590.0,
                                                    "replies": [
                                                        {
                                                            "body": "We agree to disagree and that's not a bad thing. Please don't take anything I say personally. I see you have pointed at me and asked me if SR never existed, would I have other dating options! Yes I have and will continue to have. I won't elaborate on that or get into my success in the bowl or life in general, Enough said on that. I hope it's the same with you in terms of dating options. Will be a pathetic situation if SR and FS are the only options! ",
                                                            "author": null,
                                                            "id": "ddmroyw",
                                                            "parent_id": "t1_ddmq9w0",
                                                            "score": -3,
                                                            "created_utc": 1486860807.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "> All I am saying is no need to empathize!\n\nOn this part we have diverged to be polar opposites. \n\nI empathize with every client I engage with in my professional life - it allows me to assess and gauge their needs with better accuracy and better outcomes. The fact I don't always do this when sitting across from an SB is actually something I need to work on - because I recognize its value.\n\n> There are another 10 - 30 million women in the same age bracket with same or better looks and similar financial circumstances who choose to do multiple jobs, go to school at night, cut corners, make sacrifices or whatever it takes to survive and thrive without resorting to sugaring or any other means.\n\nYeah. Now I am going to say this, and please, read it slowly so it sinks in - _I can and will always try to empathize with anyone regardless of situation_  **however** what I am talking about here is having a modicum of empathy _for the woman sitting across from you at the !@#$ table of a M&G_. Whether you feel that is worth the effort or not is entirely _up to you_. \n\nThe simple fact is, anyone who makes the choice to empathize _will have a lot better chance_ of having an intimate time with said woman you are trying to be with. Why are you debating this simple point?\n\nI don't care if it's an SR Meet and Greet, or a date from someone I met in my vanilla life - the woman sitting across from me at the dinner table has a lot more to fear from me than I do about her. Why is this so difficult to understand? Because they are choosing to be there? Well **so what**! What the Hell does that have anything to do as to whether or not I should feel some empathy?",
                            "author": "SDRippington",
                            "id": "ddmq0zk",
                            "parent_id": "t1_ddmmm53",
                            "score": 7,
                            "created_utc": 1486858206.0,
                            "replies": [
                                {
                                    "body": "I am not fighting a popularity contest here. If someone wants to be an SB, odds are they will have to put in the work and go through the drill. Why empathize or feel great if one does! That's the path chosen and they know the payoffs of success. It's a choice. As a young entrepreneur I remember a lot of doors got slammed on me. I was invited to many frivolous meet and greets. Many prospects would back out at the last minute.  Many said they would fund but never came through. There were enough but subtle attempts to rob the idea I had.  Hey it's all part of the game. I never expected my investors to empathize! And most never did. My goal was to get funded and I knew I had a great idea and that the right investor was around the corner. The investors could care less if I had skipped lunch or put in an all nighter on the pitch or that my coder just quit on me. I know different situations but similar principles. I am sure there will be reasons to disagree with my points and that's ok. ",
                                    "author": null,
                                    "id": "ddms8r3",
                                    "parent_id": "t1_ddmq0zk",
                                    "score": 0,
                                    "created_utc": 1486861680.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"Just like she could care a super rats ass on how hard I work to make my money or how tough it was to seal the last deal at work or that I cut of another important meeting to go see her.\" I do appreciate this and stress it to SD's all the freakin time and even said that over and over during sex and has been a turn on! I value the kindness and hard work of the SD but you guys need to value our apprehension to be in private in the beginning and care about keeping our limbs in tact! My friend's colleague went home with a man (vanilla dating) and he disembowled this sweet girl. He was a young, attractive and charming guy. Give us some brownie points for caring about our longevity on this planet. If you have a sister I hope you would agree. ",
            "author": null,
            "id": "ddmn2xj",
            "parent_id": "t1_ddmgmmw",
            "score": 6,
            "created_utc": 1486853621.0,
            "replies": [
                {
                    "body": "100 percent agree and that dude who disembowled your friend is God lucky that the girl he did that too is not my sister!! There is zero sympathy for such men in my mind  and heart!!  These young charming whatever types should be deported to Saudi Arabia for the right justice! Second, in all my SRs I have made sure we are both friendly enough (could be a few weeks) until we seek alone time. Like I said all this is table stakes for me and I only speak for myself and how I treat people. ",
                    "author": null,
                    "id": "ddmngpp",
                    "parent_id": "t1_ddmn2xj",
                    "score": 1,
                    "created_utc": 1486854223.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ddmmr6v",
            "parent_id": "t1_ddmgmmw",
            "score": 6,
            "created_utc": 1486853124.0,
            "replies": [
                {
                    "body": "Don't take anything personally. I have no desire to impress anyone on this thread or any interest in making friends. I am here to offer an opinion which differs from the OP. That does not make me disrespectful of anyone. ",
                    "author": null,
                    "id": "ddmn14c",
                    "parent_id": "t1_ddmmr6v",
                    "score": -2,
                    "created_utc": 1486853541.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Excuse me! Where exactly do you see me saying 'So what' please? That was a horrible crime and she's rightfully paying the price in prison. I'm simply pointing out that the frequency is so low that there are only 1/2 cases that SD's repeatedly reference.\n\nOf course, it happens with both but only a fool would try and argue that it's on the same level.",
            "author": "_azucar_",
            "id": "ddo8yrz",
            "parent_id": "t1_ddo898z",
            "score": 2,
            "created_utc": 1486954776.0,
            "replies": []
        },
        {
            "body": "Being a rich powerful man is the result of his past achievement or result of birth, not a result of being an SD.\n\nBeing susceptible to rape is a result of being a human being (most instances of rape involve male victims who are prison inmates), not a result of being a sugar baby. In fact, dating wealthy and socially  established men is probably safer than dating average men.\n\nMost stories are false. When there is a police report followed by a conviction, like that murder case carried out by the SB, I will believe it.",
            "author": "orsugar",
            "id": "ddo9xry",
            "parent_id": "t1_ddo87nq",
            "score": 0,
            "created_utc": 1486956034.0,
            "replies": [
                {
                    "body": "lol are u really saying most rape stories are false? yeah okay",
                    "author": "okaydooke",
                    "id": "ddobe34",
                    "parent_id": "t1_ddo9xry",
                    "score": 2,
                    "created_utc": 1486958077.0,
                    "replies": [
                        {
                            "body": "Stories are. Police reports are found to be close to 50:50.\n\nI have been told personal rape stories a few times in my life, and every single time it's a girl who was about to cheat on me, or lie to me in order to get more money than original agreement, or just disappear after receiving money; i.e. scamming/rinsing. Every, single, time, regardless whether I had met the girl only that week or had been with that girl for more than a year. It's as if there were some kind of warrior's honor code of not revealing past rape victimhood until they have their knives out for you.\n\nI'm not at all exaggerating about this, the correlation has been 100%!  Nowadays, if someone tells me her past rape victimhood, I'd clutch at my wallet and make sure it's still there.",
                            "author": "orsugar",
                            "id": "ddobm9x",
                            "parent_id": "t1_ddobe34",
                            "score": 1,
                            "created_utc": 1486958397.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Er..... I have a family emergency. Then run off quickly. If I do that, I generally do follow up txt a few hours later and explain that I didn't feel comfortable and won't be continuing ahead. ",
            "author": "thatchick1993",
            "id": "ddmkcri",
            "parent_id": "t1_ddmiyc3",
            "score": 1,
            "created_utc": 1486849439.0,
            "replies": [
                {
                    "body": "Its a transparent white lie. ",
                    "author": "DaddyUK",
                    "id": "ddmpjxa",
                    "parent_id": "t1_ddmkcri",
                    "score": 1,
                    "created_utc": 1486857470.0,
                    "replies": [
                        {
                            "body": "Because I don't do confrontation very well and I don't like letting people down. I have a good heart and come from a good place and feel more comfortable letting them down over txt. It gives me time to truly think about the right things to say instead of saying the wrong thing and ending either hurting them more or end up in an argument. ",
                            "author": "thatchick1993",
                            "id": "ddn2nxm",
                            "parent_id": "t1_ddmpjxa",
                            "score": 1,
                            "created_utc": 1486878767.0,
                            "replies": [
                                {
                                    "body": "But you have let someone down. And you need to be honest. So you would be fine with someone dumping you via text. Its weak.",
                                    "author": "DaddyUK",
                                    "id": "ddnbzi7",
                                    "parent_id": "t1_ddn2nxm",
                                    "score": 1,
                                    "created_utc": 1486906414.0,
                                    "replies": [
                                        {
                                            "body": "I'd be perfectly fine someome dumping me via text as long as they give me a reasonable explanation as to why they're dumping me. I don't do well talking about my emotions in person. So if someone dumps me via text it allows me to get my emotions in check and respond in a sensible way. \n\nMy SD and I have huge D&Ms over text then continue them in person. He knows I'm not good with expressing my emotions in person, so if it means he gets more out of me via text he will. ",
                                            "author": "thatchick1993",
                                            "id": "ddo415h",
                                            "parent_id": "t1_ddnbzi7",
                                            "score": 1,
                                            "created_utc": 1486948182.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The amount of SB's that have family emergencies and phones being repaired is really something. \n\nMaybe im being too skeptical. Though if i was a betting man - I'd guess her mums health is just fine.",
            "author": "DaddyUK",
            "id": "ddmpi70",
            "parent_id": "t1_ddmiyc3",
            "score": -1,
            "created_utc": 1486857395.0,
            "replies": [
                {
                    "body": "So what reason did she have to lie in this situation, I'm confused? \n\nYou say she wanted to see you again so what's your point?",
                    "author": "_azucar_",
                    "id": "ddmsi4r",
                    "parent_id": "t1_ddmpi70",
                    "score": 1,
                    "created_utc": 1486862087.0,
                    "replies": [
                        {
                            "body": "She didn't want to meet this weekend as allowance figure was not nailed down. ",
                            "author": "DaddyUK",
                            "id": "ddnc10n",
                            "parent_id": "t1_ddmsi4r",
                            "score": 1,
                            "created_utc": 1486906520.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeah, I understand/agree. I've actually had a family member's health get in the way of a meet up and now I'm wondering if he thought I was flaking... ",
                    "author": null,
                    "id": "ddmsquw",
                    "parent_id": "t1_ddmpi70",
                    "score": 1,
                    "created_utc": 1486862474.0,
                    "replies": [
                        {
                            "body": "He has heard those words before and it depends on how sceptical he is. \n\nIf he is self made, he is rolling his eyes as he reads the text and making a mental note. ",
                            "author": "DaddyUK",
                            "id": "ddnc0if",
                            "parent_id": "t1_ddmsquw",
                            "score": 0,
                            "created_utc": 1486906482.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "All I am saying is no need to empathize! Just make sure they are given due respect. Fact is there are probably 1 million women on SA who are in the ages of 18 - 40. There are another 10 - 30 million women in the same age bracket with same or better looks and similar financial circumstances who choose to do multiple jobs, go to school at night, cut corners, make sacrifices or whatever it takes to survive and thrive without resorting to sugaring or any other means. Empathize with them or millions of others who go through hardships in life to make ends meet. To empathize with SBs, not sure my friend. ",
            "author": null,
            "id": "ddmmm53",
            "parent_id": "t1_ddmh9be",
            "score": -5,
            "created_utc": 1486852909.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ddmo2q1",
                    "parent_id": "t1_ddmmm53",
                    "score": 13,
                    "created_utc": 1486855181.0,
                    "replies": [
                        {
                            "body": "> I'm going to describe myself; this is the kind of woman on SA: * Had a part time job starting at 16 while attending HS. * Was a National Merit Scholarship finalist. * Had an almost perfect SAT score. * Was the first in my family to go to college. * Had 2 part time jobs while going to school full time. * Graduated magna cum laude. * Work in an extremely selective career path and have saved enough to buy a house in California.\n> Do I deserve more respect or empathy than someone who didn't make those choices? No.\n\nOf course you think you do. Why else wasting electrons making that long list?\n\nDo you not believe you deserve more respect than someone the same age as you but is a drug addict, been arrested and thrown in jail multiple times for possession, dealing, theft and fraud?  Yes, she is on SA too!  There is  a wide range of SB's, just like there is a wide range of SD's. \n\nRespect is earned. Fondness/dotage is given for free.",
                            "author": "orsugar",
                            "id": "ddnpq7c",
                            "parent_id": "t1_ddmo2q1",
                            "score": 1,
                            "created_utc": 1486928339.0,
                            "replies": []
                        },
                        {
                            "body": "You deserve respect! You deserve respect first as a human and a woman. Your achievements deserve appreciation and I am sure you have received accolades for that. May you continue to succeed and buy more home. But Read up and check my views on respect. Respect is non-negotiable. Respect is table stakes! But to glorify the challenges one faces as an SB is not something I have much empathy for. It comes with the territory. ",
                            "author": null,
                            "id": "ddmonhm",
                            "parent_id": "t1_ddmo2q1",
                            "score": -1,
                            "created_utc": 1486856083.0,
                            "replies": [
                                {
                                    "body": "> But to glorify the challenges one faces as an SB is not something I have much empathy for. It comes with the territory.\n\nDating in general can be rather dangerous for a woman to begin with. Dating within the boundaries of an SR? Even moreso. \n\nJust because THEY picked to be there, doesn't mean you can't appreciate they are there, sitting in front of you, and taking more of a risk than if they were as you said, \"_do multiple jobs, go to school at night, cut corners, make sacrifices or whatever it takes to survive and thrive without resorting to sugaring_\"?\n\nIf it wasn't for them moving through their fears at that moment to be with you at an M&G? You wouldn't even be here discussing any of this. ",
                                    "author": "SDRippington",
                                    "id": "ddmq78k",
                                    "parent_id": "t1_ddmonhm",
                                    "score": 7,
                                    "created_utc": 1486858479.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ddmpbyh",
                                    "parent_id": "t1_ddmonhm",
                                    "score": 4,
                                    "created_utc": 1486857128.0,
                                    "replies": [
                                        {
                                            "body": "And they could simply choose not to attempt any SR dating at all. Where would that leave you then? Freestyling like the days of old.\n\nShow empathy and you might have better success in the bowl. That is if that is even a concern of yours?\n\nMaybe you're a greek god and women throw themselves at you. If so? Awesome! ",
                                            "author": "SDRippington",
                                            "id": "ddmq9w0",
                                            "parent_id": "t1_ddmpbyh",
                                            "score": 5,
                                            "created_utc": 1486858590.0,
                                            "replies": [
                                                {
                                                    "body": "We agree to disagree and that's not a bad thing. Please don't take anything I say personally. I see you have pointed at me and asked me if SR never existed, would I have other dating options! Yes I have and will continue to have. I won't elaborate on that or get into my success in the bowl or life in general, Enough said on that. I hope it's the same with you in terms of dating options. Will be a pathetic situation if SR and FS are the only options! ",
                                                    "author": null,
                                                    "id": "ddmroyw",
                                                    "parent_id": "t1_ddmq9w0",
                                                    "score": -3,
                                                    "created_utc": 1486860807.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> All I am saying is no need to empathize!\n\nOn this part we have diverged to be polar opposites. \n\nI empathize with every client I engage with in my professional life - it allows me to assess and gauge their needs with better accuracy and better outcomes. The fact I don't always do this when sitting across from an SB is actually something I need to work on - because I recognize its value.\n\n> There are another 10 - 30 million women in the same age bracket with same or better looks and similar financial circumstances who choose to do multiple jobs, go to school at night, cut corners, make sacrifices or whatever it takes to survive and thrive without resorting to sugaring or any other means.\n\nYeah. Now I am going to say this, and please, read it slowly so it sinks in - _I can and will always try to empathize with anyone regardless of situation_  **however** what I am talking about here is having a modicum of empathy _for the woman sitting across from you at the !@#$ table of a M&G_. Whether you feel that is worth the effort or not is entirely _up to you_. \n\nThe simple fact is, anyone who makes the choice to empathize _will have a lot better chance_ of having an intimate time with said woman you are trying to be with. Why are you debating this simple point?\n\nI don't care if it's an SR Meet and Greet, or a date from someone I met in my vanilla life - the woman sitting across from me at the dinner table has a lot more to fear from me than I do about her. Why is this so difficult to understand? Because they are choosing to be there? Well **so what**! What the Hell does that have anything to do as to whether or not I should feel some empathy?",
                    "author": "SDRippington",
                    "id": "ddmq0zk",
                    "parent_id": "t1_ddmmm53",
                    "score": 7,
                    "created_utc": 1486858206.0,
                    "replies": [
                        {
                            "body": "I am not fighting a popularity contest here. If someone wants to be an SB, odds are they will have to put in the work and go through the drill. Why empathize or feel great if one does! That's the path chosen and they know the payoffs of success. It's a choice. As a young entrepreneur I remember a lot of doors got slammed on me. I was invited to many frivolous meet and greets. Many prospects would back out at the last minute.  Many said they would fund but never came through. There were enough but subtle attempts to rob the idea I had.  Hey it's all part of the game. I never expected my investors to empathize! And most never did. My goal was to get funded and I knew I had a great idea and that the right investor was around the corner. The investors could care less if I had skipped lunch or put in an all nighter on the pitch or that my coder just quit on me. I know different situations but similar principles. I am sure there will be reasons to disagree with my points and that's ok. ",
                            "author": null,
                            "id": "ddms8r3",
                            "parent_id": "t1_ddmq0zk",
                            "score": 0,
                            "created_utc": 1486861680.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "100 percent agree and that dude who disembowled your friend is God lucky that the girl he did that too is not my sister!! There is zero sympathy for such men in my mind  and heart!!  These young charming whatever types should be deported to Saudi Arabia for the right justice! Second, in all my SRs I have made sure we are both friendly enough (could be a few weeks) until we seek alone time. Like I said all this is table stakes for me and I only speak for myself and how I treat people. ",
            "author": null,
            "id": "ddmngpp",
            "parent_id": "t1_ddmn2xj",
            "score": 1,
            "created_utc": 1486854223.0,
            "replies": []
        },
        {
            "body": "Don't take anything personally. I have no desire to impress anyone on this thread or any interest in making friends. I am here to offer an opinion which differs from the OP. That does not make me disrespectful of anyone. ",
            "author": null,
            "id": "ddmn14c",
            "parent_id": "t1_ddmmr6v",
            "score": -2,
            "created_utc": 1486853541.0,
            "replies": []
        },
        {
            "body": "lol are u really saying most rape stories are false? yeah okay",
            "author": "okaydooke",
            "id": "ddobe34",
            "parent_id": "t1_ddo9xry",
            "score": 2,
            "created_utc": 1486958077.0,
            "replies": [
                {
                    "body": "Stories are. Police reports are found to be close to 50:50.\n\nI have been told personal rape stories a few times in my life, and every single time it's a girl who was about to cheat on me, or lie to me in order to get more money than original agreement, or just disappear after receiving money; i.e. scamming/rinsing. Every, single, time, regardless whether I had met the girl only that week or had been with that girl for more than a year. It's as if there were some kind of warrior's honor code of not revealing past rape victimhood until they have their knives out for you.\n\nI'm not at all exaggerating about this, the correlation has been 100%!  Nowadays, if someone tells me her past rape victimhood, I'd clutch at my wallet and make sure it's still there.",
                    "author": "orsugar",
                    "id": "ddobm9x",
                    "parent_id": "t1_ddobe34",
                    "score": 1,
                    "created_utc": 1486958397.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Its a transparent white lie. ",
            "author": "DaddyUK",
            "id": "ddmpjxa",
            "parent_id": "t1_ddmkcri",
            "score": 1,
            "created_utc": 1486857470.0,
            "replies": [
                {
                    "body": "Because I don't do confrontation very well and I don't like letting people down. I have a good heart and come from a good place and feel more comfortable letting them down over txt. It gives me time to truly think about the right things to say instead of saying the wrong thing and ending either hurting them more or end up in an argument. ",
                    "author": "thatchick1993",
                    "id": "ddn2nxm",
                    "parent_id": "t1_ddmpjxa",
                    "score": 1,
                    "created_utc": 1486878767.0,
                    "replies": [
                        {
                            "body": "But you have let someone down. And you need to be honest. So you would be fine with someone dumping you via text. Its weak.",
                            "author": "DaddyUK",
                            "id": "ddnbzi7",
                            "parent_id": "t1_ddn2nxm",
                            "score": 1,
                            "created_utc": 1486906414.0,
                            "replies": [
                                {
                                    "body": "I'd be perfectly fine someome dumping me via text as long as they give me a reasonable explanation as to why they're dumping me. I don't do well talking about my emotions in person. So if someone dumps me via text it allows me to get my emotions in check and respond in a sensible way. \n\nMy SD and I have huge D&Ms over text then continue them in person. He knows I'm not good with expressing my emotions in person, so if it means he gets more out of me via text he will. ",
                                    "author": "thatchick1993",
                                    "id": "ddo415h",
                                    "parent_id": "t1_ddnbzi7",
                                    "score": 1,
                                    "created_utc": 1486948182.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So what reason did she have to lie in this situation, I'm confused? \n\nYou say she wanted to see you again so what's your point?",
            "author": "_azucar_",
            "id": "ddmsi4r",
            "parent_id": "t1_ddmpi70",
            "score": 1,
            "created_utc": 1486862087.0,
            "replies": [
                {
                    "body": "She didn't want to meet this weekend as allowance figure was not nailed down. ",
                    "author": "DaddyUK",
                    "id": "ddnc10n",
                    "parent_id": "t1_ddmsi4r",
                    "score": 1,
                    "created_utc": 1486906520.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, I understand/agree. I've actually had a family member's health get in the way of a meet up and now I'm wondering if he thought I was flaking... ",
            "author": null,
            "id": "ddmsquw",
            "parent_id": "t1_ddmpi70",
            "score": 1,
            "created_utc": 1486862474.0,
            "replies": [
                {
                    "body": "He has heard those words before and it depends on how sceptical he is. \n\nIf he is self made, he is rolling his eyes as he reads the text and making a mental note. ",
                    "author": "DaddyUK",
                    "id": "ddnc0if",
                    "parent_id": "t1_ddmsquw",
                    "score": 0,
                    "created_utc": 1486906482.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ddmo2q1",
            "parent_id": "t1_ddmmm53",
            "score": 13,
            "created_utc": 1486855181.0,
            "replies": [
                {
                    "body": "> I'm going to describe myself; this is the kind of woman on SA: * Had a part time job starting at 16 while attending HS. * Was a National Merit Scholarship finalist. * Had an almost perfect SAT score. * Was the first in my family to go to college. * Had 2 part time jobs while going to school full time. * Graduated magna cum laude. * Work in an extremely selective career path and have saved enough to buy a house in California.\n> Do I deserve more respect or empathy than someone who didn't make those choices? No.\n\nOf course you think you do. Why else wasting electrons making that long list?\n\nDo you not believe you deserve more respect than someone the same age as you but is a drug addict, been arrested and thrown in jail multiple times for possession, dealing, theft and fraud?  Yes, she is on SA too!  There is  a wide range of SB's, just like there is a wide range of SD's. \n\nRespect is earned. Fondness/dotage is given for free.",
                    "author": "orsugar",
                    "id": "ddnpq7c",
                    "parent_id": "t1_ddmo2q1",
                    "score": 1,
                    "created_utc": 1486928339.0,
                    "replies": []
                },
                {
                    "body": "You deserve respect! You deserve respect first as a human and a woman. Your achievements deserve appreciation and I am sure you have received accolades for that. May you continue to succeed and buy more home. But Read up and check my views on respect. Respect is non-negotiable. Respect is table stakes! But to glorify the challenges one faces as an SB is not something I have much empathy for. It comes with the territory. ",
                    "author": null,
                    "id": "ddmonhm",
                    "parent_id": "t1_ddmo2q1",
                    "score": -1,
                    "created_utc": 1486856083.0,
                    "replies": [
                        {
                            "body": "> But to glorify the challenges one faces as an SB is not something I have much empathy for. It comes with the territory.\n\nDating in general can be rather dangerous for a woman to begin with. Dating within the boundaries of an SR? Even moreso. \n\nJust because THEY picked to be there, doesn't mean you can't appreciate they are there, sitting in front of you, and taking more of a risk than if they were as you said, \"_do multiple jobs, go to school at night, cut corners, make sacrifices or whatever it takes to survive and thrive without resorting to sugaring_\"?\n\nIf it wasn't for them moving through their fears at that moment to be with you at an M&G? You wouldn't even be here discussing any of this. ",
                            "author": "SDRippington",
                            "id": "ddmq78k",
                            "parent_id": "t1_ddmonhm",
                            "score": 7,
                            "created_utc": 1486858479.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ddmpbyh",
                            "parent_id": "t1_ddmonhm",
                            "score": 4,
                            "created_utc": 1486857128.0,
                            "replies": [
                                {
                                    "body": "And they could simply choose not to attempt any SR dating at all. Where would that leave you then? Freestyling like the days of old.\n\nShow empathy and you might have better success in the bowl. That is if that is even a concern of yours?\n\nMaybe you're a greek god and women throw themselves at you. If so? Awesome! ",
                                    "author": "SDRippington",
                                    "id": "ddmq9w0",
                                    "parent_id": "t1_ddmpbyh",
                                    "score": 5,
                                    "created_utc": 1486858590.0,
                                    "replies": [
                                        {
                                            "body": "We agree to disagree and that's not a bad thing. Please don't take anything I say personally. I see you have pointed at me and asked me if SR never existed, would I have other dating options! Yes I have and will continue to have. I won't elaborate on that or get into my success in the bowl or life in general, Enough said on that. I hope it's the same with you in terms of dating options. Will be a pathetic situation if SR and FS are the only options! ",
                                            "author": null,
                                            "id": "ddmroyw",
                                            "parent_id": "t1_ddmq9w0",
                                            "score": -3,
                                            "created_utc": 1486860807.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> All I am saying is no need to empathize!\n\nOn this part we have diverged to be polar opposites. \n\nI empathize with every client I engage with in my professional life - it allows me to assess and gauge their needs with better accuracy and better outcomes. The fact I don't always do this when sitting across from an SB is actually something I need to work on - because I recognize its value.\n\n> There are another 10 - 30 million women in the same age bracket with same or better looks and similar financial circumstances who choose to do multiple jobs, go to school at night, cut corners, make sacrifices or whatever it takes to survive and thrive without resorting to sugaring or any other means.\n\nYeah. Now I am going to say this, and please, read it slowly so it sinks in - _I can and will always try to empathize with anyone regardless of situation_  **however** what I am talking about here is having a modicum of empathy _for the woman sitting across from you at the !@#$ table of a M&G_. Whether you feel that is worth the effort or not is entirely _up to you_. \n\nThe simple fact is, anyone who makes the choice to empathize _will have a lot better chance_ of having an intimate time with said woman you are trying to be with. Why are you debating this simple point?\n\nI don't care if it's an SR Meet and Greet, or a date from someone I met in my vanilla life - the woman sitting across from me at the dinner table has a lot more to fear from me than I do about her. Why is this so difficult to understand? Because they are choosing to be there? Well **so what**! What the Hell does that have anything to do as to whether or not I should feel some empathy?",
            "author": "SDRippington",
            "id": "ddmq0zk",
            "parent_id": "t1_ddmmm53",
            "score": 7,
            "created_utc": 1486858206.0,
            "replies": [
                {
                    "body": "I am not fighting a popularity contest here. If someone wants to be an SB, odds are they will have to put in the work and go through the drill. Why empathize or feel great if one does! That's the path chosen and they know the payoffs of success. It's a choice. As a young entrepreneur I remember a lot of doors got slammed on me. I was invited to many frivolous meet and greets. Many prospects would back out at the last minute.  Many said they would fund but never came through. There were enough but subtle attempts to rob the idea I had.  Hey it's all part of the game. I never expected my investors to empathize! And most never did. My goal was to get funded and I knew I had a great idea and that the right investor was around the corner. The investors could care less if I had skipped lunch or put in an all nighter on the pitch or that my coder just quit on me. I know different situations but similar principles. I am sure there will be reasons to disagree with my points and that's ok. ",
                    "author": null,
                    "id": "ddms8r3",
                    "parent_id": "t1_ddmq0zk",
                    "score": 0,
                    "created_utc": 1486861680.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Stories are. Police reports are found to be close to 50:50.\n\nI have been told personal rape stories a few times in my life, and every single time it's a girl who was about to cheat on me, or lie to me in order to get more money than original agreement, or just disappear after receiving money; i.e. scamming/rinsing. Every, single, time, regardless whether I had met the girl only that week or had been with that girl for more than a year. It's as if there were some kind of warrior's honor code of not revealing past rape victimhood until they have their knives out for you.\n\nI'm not at all exaggerating about this, the correlation has been 100%!  Nowadays, if someone tells me her past rape victimhood, I'd clutch at my wallet and make sure it's still there.",
            "author": "orsugar",
            "id": "ddobm9x",
            "parent_id": "t1_ddobe34",
            "score": 1,
            "created_utc": 1486958397.0,
            "replies": []
        },
        {
            "body": "Because I don't do confrontation very well and I don't like letting people down. I have a good heart and come from a good place and feel more comfortable letting them down over txt. It gives me time to truly think about the right things to say instead of saying the wrong thing and ending either hurting them more or end up in an argument. ",
            "author": "thatchick1993",
            "id": "ddn2nxm",
            "parent_id": "t1_ddmpjxa",
            "score": 1,
            "created_utc": 1486878767.0,
            "replies": [
                {
                    "body": "But you have let someone down. And you need to be honest. So you would be fine with someone dumping you via text. Its weak.",
                    "author": "DaddyUK",
                    "id": "ddnbzi7",
                    "parent_id": "t1_ddn2nxm",
                    "score": 1,
                    "created_utc": 1486906414.0,
                    "replies": [
                        {
                            "body": "I'd be perfectly fine someome dumping me via text as long as they give me a reasonable explanation as to why they're dumping me. I don't do well talking about my emotions in person. So if someone dumps me via text it allows me to get my emotions in check and respond in a sensible way. \n\nMy SD and I have huge D&Ms over text then continue them in person. He knows I'm not good with expressing my emotions in person, so if it means he gets more out of me via text he will. ",
                            "author": "thatchick1993",
                            "id": "ddo415h",
                            "parent_id": "t1_ddnbzi7",
                            "score": 1,
                            "created_utc": 1486948182.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "She didn't want to meet this weekend as allowance figure was not nailed down. ",
            "author": "DaddyUK",
            "id": "ddnc10n",
            "parent_id": "t1_ddmsi4r",
            "score": 1,
            "created_utc": 1486906520.0,
            "replies": []
        },
        {
            "body": "He has heard those words before and it depends on how sceptical he is. \n\nIf he is self made, he is rolling his eyes as he reads the text and making a mental note. ",
            "author": "DaddyUK",
            "id": "ddnc0if",
            "parent_id": "t1_ddmsquw",
            "score": 0,
            "created_utc": 1486906482.0,
            "replies": []
        },
        {
            "body": "> I'm going to describe myself; this is the kind of woman on SA: * Had a part time job starting at 16 while attending HS. * Was a National Merit Scholarship finalist. * Had an almost perfect SAT score. * Was the first in my family to go to college. * Had 2 part time jobs while going to school full time. * Graduated magna cum laude. * Work in an extremely selective career path and have saved enough to buy a house in California.\n> Do I deserve more respect or empathy than someone who didn't make those choices? No.\n\nOf course you think you do. Why else wasting electrons making that long list?\n\nDo you not believe you deserve more respect than someone the same age as you but is a drug addict, been arrested and thrown in jail multiple times for possession, dealing, theft and fraud?  Yes, she is on SA too!  There is  a wide range of SB's, just like there is a wide range of SD's. \n\nRespect is earned. Fondness/dotage is given for free.",
            "author": "orsugar",
            "id": "ddnpq7c",
            "parent_id": "t1_ddmo2q1",
            "score": 1,
            "created_utc": 1486928339.0,
            "replies": []
        },
        {
            "body": "You deserve respect! You deserve respect first as a human and a woman. Your achievements deserve appreciation and I am sure you have received accolades for that. May you continue to succeed and buy more home. But Read up and check my views on respect. Respect is non-negotiable. Respect is table stakes! But to glorify the challenges one faces as an SB is not something I have much empathy for. It comes with the territory. ",
            "author": null,
            "id": "ddmonhm",
            "parent_id": "t1_ddmo2q1",
            "score": -1,
            "created_utc": 1486856083.0,
            "replies": [
                {
                    "body": "> But to glorify the challenges one faces as an SB is not something I have much empathy for. It comes with the territory.\n\nDating in general can be rather dangerous for a woman to begin with. Dating within the boundaries of an SR? Even moreso. \n\nJust because THEY picked to be there, doesn't mean you can't appreciate they are there, sitting in front of you, and taking more of a risk than if they were as you said, \"_do multiple jobs, go to school at night, cut corners, make sacrifices or whatever it takes to survive and thrive without resorting to sugaring_\"?\n\nIf it wasn't for them moving through their fears at that moment to be with you at an M&G? You wouldn't even be here discussing any of this. ",
                    "author": "SDRippington",
                    "id": "ddmq78k",
                    "parent_id": "t1_ddmonhm",
                    "score": 7,
                    "created_utc": 1486858479.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ddmpbyh",
                    "parent_id": "t1_ddmonhm",
                    "score": 4,
                    "created_utc": 1486857128.0,
                    "replies": [
                        {
                            "body": "And they could simply choose not to attempt any SR dating at all. Where would that leave you then? Freestyling like the days of old.\n\nShow empathy and you might have better success in the bowl. That is if that is even a concern of yours?\n\nMaybe you're a greek god and women throw themselves at you. If so? Awesome! ",
                            "author": "SDRippington",
                            "id": "ddmq9w0",
                            "parent_id": "t1_ddmpbyh",
                            "score": 5,
                            "created_utc": 1486858590.0,
                            "replies": [
                                {
                                    "body": "We agree to disagree and that's not a bad thing. Please don't take anything I say personally. I see you have pointed at me and asked me if SR never existed, would I have other dating options! Yes I have and will continue to have. I won't elaborate on that or get into my success in the bowl or life in general, Enough said on that. I hope it's the same with you in terms of dating options. Will be a pathetic situation if SR and FS are the only options! ",
                                    "author": null,
                                    "id": "ddmroyw",
                                    "parent_id": "t1_ddmq9w0",
                                    "score": -3,
                                    "created_utc": 1486860807.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am not fighting a popularity contest here. If someone wants to be an SB, odds are they will have to put in the work and go through the drill. Why empathize or feel great if one does! That's the path chosen and they know the payoffs of success. It's a choice. As a young entrepreneur I remember a lot of doors got slammed on me. I was invited to many frivolous meet and greets. Many prospects would back out at the last minute.  Many said they would fund but never came through. There were enough but subtle attempts to rob the idea I had.  Hey it's all part of the game. I never expected my investors to empathize! And most never did. My goal was to get funded and I knew I had a great idea and that the right investor was around the corner. The investors could care less if I had skipped lunch or put in an all nighter on the pitch or that my coder just quit on me. I know different situations but similar principles. I am sure there will be reasons to disagree with my points and that's ok. ",
            "author": null,
            "id": "ddms8r3",
            "parent_id": "t1_ddmq0zk",
            "score": 0,
            "created_utc": 1486861680.0,
            "replies": []
        },
        {
            "body": "But you have let someone down. And you need to be honest. So you would be fine with someone dumping you via text. Its weak.",
            "author": "DaddyUK",
            "id": "ddnbzi7",
            "parent_id": "t1_ddn2nxm",
            "score": 1,
            "created_utc": 1486906414.0,
            "replies": [
                {
                    "body": "I'd be perfectly fine someome dumping me via text as long as they give me a reasonable explanation as to why they're dumping me. I don't do well talking about my emotions in person. So if someone dumps me via text it allows me to get my emotions in check and respond in a sensible way. \n\nMy SD and I have huge D&Ms over text then continue them in person. He knows I'm not good with expressing my emotions in person, so if it means he gets more out of me via text he will. ",
                    "author": "thatchick1993",
                    "id": "ddo415h",
                    "parent_id": "t1_ddnbzi7",
                    "score": 1,
                    "created_utc": 1486948182.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> But to glorify the challenges one faces as an SB is not something I have much empathy for. It comes with the territory.\n\nDating in general can be rather dangerous for a woman to begin with. Dating within the boundaries of an SR? Even moreso. \n\nJust because THEY picked to be there, doesn't mean you can't appreciate they are there, sitting in front of you, and taking more of a risk than if they were as you said, \"_do multiple jobs, go to school at night, cut corners, make sacrifices or whatever it takes to survive and thrive without resorting to sugaring_\"?\n\nIf it wasn't for them moving through their fears at that moment to be with you at an M&G? You wouldn't even be here discussing any of this. ",
            "author": "SDRippington",
            "id": "ddmq78k",
            "parent_id": "t1_ddmonhm",
            "score": 7,
            "created_utc": 1486858479.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ddmpbyh",
            "parent_id": "t1_ddmonhm",
            "score": 4,
            "created_utc": 1486857128.0,
            "replies": [
                {
                    "body": "And they could simply choose not to attempt any SR dating at all. Where would that leave you then? Freestyling like the days of old.\n\nShow empathy and you might have better success in the bowl. That is if that is even a concern of yours?\n\nMaybe you're a greek god and women throw themselves at you. If so? Awesome! ",
                    "author": "SDRippington",
                    "id": "ddmq9w0",
                    "parent_id": "t1_ddmpbyh",
                    "score": 5,
                    "created_utc": 1486858590.0,
                    "replies": [
                        {
                            "body": "We agree to disagree and that's not a bad thing. Please don't take anything I say personally. I see you have pointed at me and asked me if SR never existed, would I have other dating options! Yes I have and will continue to have. I won't elaborate on that or get into my success in the bowl or life in general, Enough said on that. I hope it's the same with you in terms of dating options. Will be a pathetic situation if SR and FS are the only options! ",
                            "author": null,
                            "id": "ddmroyw",
                            "parent_id": "t1_ddmq9w0",
                            "score": -3,
                            "created_utc": 1486860807.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'd be perfectly fine someome dumping me via text as long as they give me a reasonable explanation as to why they're dumping me. I don't do well talking about my emotions in person. So if someone dumps me via text it allows me to get my emotions in check and respond in a sensible way. \n\nMy SD and I have huge D&Ms over text then continue them in person. He knows I'm not good with expressing my emotions in person, so if it means he gets more out of me via text he will. ",
            "author": "thatchick1993",
            "id": "ddo415h",
            "parent_id": "t1_ddnbzi7",
            "score": 1,
            "created_utc": 1486948182.0,
            "replies": []
        },
        {
            "body": "And they could simply choose not to attempt any SR dating at all. Where would that leave you then? Freestyling like the days of old.\n\nShow empathy and you might have better success in the bowl. That is if that is even a concern of yours?\n\nMaybe you're a greek god and women throw themselves at you. If so? Awesome! ",
            "author": "SDRippington",
            "id": "ddmq9w0",
            "parent_id": "t1_ddmpbyh",
            "score": 5,
            "created_utc": 1486858590.0,
            "replies": [
                {
                    "body": "We agree to disagree and that's not a bad thing. Please don't take anything I say personally. I see you have pointed at me and asked me if SR never existed, would I have other dating options! Yes I have and will continue to have. I won't elaborate on that or get into my success in the bowl or life in general, Enough said on that. I hope it's the same with you in terms of dating options. Will be a pathetic situation if SR and FS are the only options! ",
                    "author": null,
                    "id": "ddmroyw",
                    "parent_id": "t1_ddmq9w0",
                    "score": -3,
                    "created_utc": 1486860807.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We agree to disagree and that's not a bad thing. Please don't take anything I say personally. I see you have pointed at me and asked me if SR never existed, would I have other dating options! Yes I have and will continue to have. I won't elaborate on that or get into my success in the bowl or life in general, Enough said on that. I hope it's the same with you in terms of dating options. Will be a pathetic situation if SR and FS are the only options! ",
            "author": null,
            "id": "ddmroyw",
            "parent_id": "t1_ddmq9w0",
            "score": -3,
            "created_utc": 1486860807.0,
            "replies": []
        }
    ]
}