{
    "title": "Thank You Sugar Babies",
    "post_id": "glipfc",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/glipfc/thank_you_sugar_babies/",
    "author": "AFSMSgt",
    "body": "A discussion on here yesterday, a self-described, socially awkward SD was concerned because he was never married and never had a long-term vanilla relationship. It got me thinking about the immeasurable joy, satisfaction, and pleasure I have gotten from my SR's over the years. I am single and living the life now I wish I had lived in my 40's and 50's. I have had so many wonderful experiences with so many wonderful women I would never have had except through sugaring.\n\nI have to say to you SB's, thank you for making my life, and I am sure many other SD's lives, richer, more rewarding, and more fulfilled.  I am a better man because of having you in my life.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/glipfc/thank_you_sugar_babies/",
    "score": 149,
    "upvote_ratio": 0.92,
    "created_utc": 1589734133.0,
    "num_comments": 40,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I (21f) As an aspiring SB i feel encouraged to take this great adventure. I wanna feel appreciated and cared for and return the same good energy i can’t wait :)",
            "author": null,
            "id": "fqyonvp",
            "parent_id": "t3_glipfc",
            "score": 9,
            "created_utc": 1589752015.0,
            "replies": [
                {
                    "body": "This is what an SR should be. I hope you find the perfect SD who will return your good energy",
                    "author": "AFSMSgt",
                    "id": "fqyu3nj",
                    "parent_id": "t1_fqyonvp",
                    "score": 3,
                    "created_utc": 1589754576.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s never too late to live the life you always wanted and to be happy ☺️❤️",
            "author": "_mimi97",
            "id": "fqxmfa6",
            "parent_id": "t3_glipfc",
            "score": 15,
            "created_utc": 1589734554.0,
            "replies": []
        },
        {
            "body": "Agreed that this is such an amazing opportunity and thanks to the SBs for being out there!    I'm in my mid-40s now, and after a 20+ year marriage gone bad, how the bowl treats me for the next little while will partly determine whether I look for another vanilla LTR or not, but it is truly amazing to have this opportunity.",
            "author": "UseTheForceRey",
            "id": "fqxnwc4",
            "parent_id": "t3_glipfc",
            "score": 11,
            "created_utc": 1589735203.0,
            "replies": [
                {
                    "body": "I'm similar to you.  The bowl really helped me stay positive about vanilla relationships.",
                    "author": null,
                    "id": "fqxrpl9",
                    "parent_id": "t1_fqxnwc4",
                    "score": 4,
                    "created_utc": 1589736822.0,
                    "replies": []
                },
                {
                    "body": "Bud,   Once you have a few good SR’s the vanilla world can never measure up.",
                    "author": "LotBuilder",
                    "id": "fqya0xa",
                    "parent_id": "t1_fqxnwc4",
                    "score": 1,
                    "created_utc": 1589745197.0,
                    "replies": [
                        {
                            "body": "Oh, I expect that.  That's my point, if SRs meet my needs, I think I'll be pretty happy to stick with sugar and avoid the vanilla.",
                            "author": "UseTheForceRey",
                            "id": "fqybtvh",
                            "parent_id": "t1_fqya0xa",
                            "score": 2,
                            "created_utc": 1589746059.0,
                            "replies": [
                                {
                                    "body": "You realize that:  1.  If you are well off then all dating is vanilla dating because you are paying.  2.  If that’s how it’s going to be you may as well get the type of women you really want.",
                                    "author": "LotBuilder",
                                    "id": "fqycie2",
                                    "parent_id": "t1_fqybtvh",
                                    "score": 6,
                                    "created_utc": 1589746369.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is such a lovely reflection! You SDs enrich our lives as well",
            "author": "TheBestToothache",
            "id": "fqxrdn7",
            "parent_id": "t3_glipfc",
            "score": 8,
            "created_utc": 1589736677.0,
            "replies": []
        },
        {
            "body": "Why is eveyone so sweet today. Maybe it's the near perfect weather? 😁",
            "author": "PioneerExperience",
            "id": "fqyotme",
            "parent_id": "t3_glipfc",
            "score": 2,
            "created_utc": 1589752090.0,
            "replies": [
                {
                    "body": "I think that sometimes you just have to consider the things in your life that give you pleasure.",
                    "author": "AFSMSgt",
                    "id": "fqytu5c",
                    "parent_id": "t1_fqyotme",
                    "score": 3,
                    "created_utc": 1589754452.0,
                    "replies": [
                        {
                            "body": "Like sucre!!!",
                            "author": "PioneerExperience",
                            "id": "fqyu7x5",
                            "parent_id": "t1_fqytu5c",
                            "score": 1,
                            "created_utc": 1589754635.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks for sharing your story and perspective. Early 40’s and just trying to enjoy life, meet interesting and fun people, and be good to each other. \n\n“Wherever you are, whatever your circumstances may be, whatever misfortune you may have suffered, the music of your life has not gone. It's inside you - if you listen to it, you can play it.” - Nido R Qubein",
            "author": "SweetHelicopter1",
            "id": "fqxsl8y",
            "parent_id": "t3_glipfc",
            "score": 3,
            "created_utc": 1589737201.0,
            "replies": [
                {
                    "body": "I would raise you the word “life” for “love”: .. the music of you love is not gone. It is inside you - if you dare to listen.",
                    "author": "why_so_sexy_",
                    "id": "fqy41za",
                    "parent_id": "t1_fqxsl8y",
                    "score": 2,
                    "created_utc": 1589742242.0,
                    "replies": []
                },
                {
                    "body": "👍",
                    "author": "AFSMSgt",
                    "id": "fqy44ww",
                    "parent_id": "t1_fqxsl8y",
                    "score": 0,
                    "created_utc": 1589742281.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not all sugar daddies are enriching or good for us. I had a sugar daddy who left me in over thousands of debt because all the money he sent bounced and was taken out of my count putting me into thousands in the negative. And I’m still severely struggling because of him",
            "author": "GawgusEyes",
            "id": "fqy23ut",
            "parent_id": "t3_glipfc",
            "score": 4,
            "created_utc": 1589741344.0,
            "replies": [
                {
                    "body": "Sorry this happened to you. I understand you feeling negative but this was a scammer and not a true SD. Assuming you haven't yet read the newbie starters, included scammers, if you decide to reenter the bowl please read first. Your personal banking information, you helping him move money via your account is an immediate RED FLAG. Any legitimate SD does not need his SB to help him in finances, he's an SD because he's already made wise financial decisions and can afford his sugar side of life. Not passing judgement, just trying to give you advice. I wish you much luck 🦋",
                    "author": "MyBeautifulLife4Me",
                    "id": "fqyo9gk",
                    "parent_id": "t1_fqy23ut",
                    "score": 5,
                    "created_utc": 1589751822.0,
                    "replies": []
                },
                {
                    "body": "So sorry. Finding the right SD is so damn hard.  I have had a bunch of not very satisfying short-term SR's. But the ones that lasted are so very special.",
                    "author": "AFSMSgt",
                    "id": "fqy33s6",
                    "parent_id": "t1_fqy23ut",
                    "score": 3,
                    "created_utc": 1589741809.0,
                    "replies": []
                },
                {
                    "body": "This may be a little tough but good parents teach their kids to come to a complete stop and look both ways before running across the street.  \n\nYoung women  entering sugar need to apply a similar process and one of the most fundamental rules is to avoid financial exposure both for the financial loss and the emotional loss.  A responsible SD understands that and is comfortable handling such things in a way that is both comforting and respectful of the SB and the relationship.\n\nIf your potential SD is unwilling to deliver on his part of the arrangement prior to any intimacy you should come to a full stop.  It is the job of the SD to relieve financial pressure, exposure and anxiety.  Yes there are dirtbags who systematically take advantage of people and businesses. \n\nUnfortunately there are those who are consummate manipulators and take joy in defrauding others.",
                    "author": "pinotandsugar",
                    "id": "fqzjwb7",
                    "parent_id": "t1_fqy23ut",
                    "score": 2,
                    "created_utc": 1589768943.0,
                    "replies": []
                },
                {
                    "body": "I am very sorry to hear this happened to you.  He wasn't a SD, he was a scammer.  I don't consider the girls that have tried/succeeded to rinse me SBs.  I won't allow their actions to taint my perception of what a real SB is.",
                    "author": "storm170",
                    "id": "fqyllbi",
                    "parent_id": "t1_fqy23ut",
                    "score": 1,
                    "created_utc": 1589750575.0,
                    "replies": []
                },
                {
                    "body": "\nI’m so sorry to hear that. Not all SDs are good. Some can really burn you out emotionally. However, you should always be financially enriched. That’s the entire premise of the relationship. You got yourself a con artist, not a SD. They prey on new girls. You’re not the first I’ve heard this story from. In the future set your boundaries, including how you’re willing to accept payments, and stick to them. If a SD won’t respect your boundaries then he’s not good and probably not even real. Good luck in the future.",
                    "author": null,
                    "id": "fqz1ieg",
                    "parent_id": "t1_fqy23ut",
                    "score": 1,
                    "created_utc": 1589758241.0,
                    "replies": []
                },
                {
                    "body": "I’m this happened to you, but you didn’t have a sugar daddy, you had a scammer that pretended to be a SD. This was most likely someone part of an organized crime ring.",
                    "author": null,
                    "id": "fr0tp98",
                    "parent_id": "t1_fqy23ut",
                    "score": 1,
                    "created_utc": 1589806488.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hear hear!",
            "author": "mrjimmyjsz",
            "id": "fqyomxc",
            "parent_id": "t3_glipfc",
            "score": 1,
            "created_utc": 1589752003.0,
            "replies": []
        },
        {
            "body": "❤️",
            "author": "35inFL",
            "id": "fqyvyvu",
            "parent_id": "t3_glipfc",
            "score": 1,
            "created_utc": 1589755491.0,
            "replies": []
        },
        {
            "body": "Wow, this is amazing. I Hope once I get my SD that we can connect and make eachother feel free and joyous. We all need to feel that at least once in our lives. Blessings to you and your SB 💕",
            "author": "Toriyaa",
            "id": "fqzeqsz",
            "parent_id": "t3_glipfc",
            "score": 1,
            "created_utc": 1589765827.0,
            "replies": []
        },
        {
            "body": "this is so sweet🥺❤️so glad you’re happy and living your best life",
            "author": "LeilaNicole",
            "id": "fqzirea",
            "parent_id": "t3_glipfc",
            "score": 1,
            "created_utc": 1589768254.0,
            "replies": []
        },
        {
            "body": "Cool",
            "author": "localbise",
            "id": "fqzo5nn",
            "parent_id": "t3_glipfc",
            "score": 1,
            "created_utc": 1589771542.0,
            "replies": []
        },
        {
            "body": "Amen, to that brother! Very thankful to have met such wonderful SB's on secretbenefits.com. They bring so much light to my life!",
            "author": "ShaneJMD",
            "id": "fr0pjvs",
            "parent_id": "t3_glipfc",
            "score": 1,
            "created_utc": 1589803345.0,
            "replies": []
        },
        {
            "body": "Honestly I concur. There are so many women who just have no idea how this works and ruin it for the rest... its up to us to create a new culture. I love to see this comments in this group... my students in our sorority only grow and level up because of each other.... community is so important.  I always tell them this lifestyle level up doesn't work because of me... and my program... it works because you took action with the tools given in the program. These ladies can give you all the best advice but if you don't apply it and take action you'll get no where... community is vital",
            "author": "sugabareli",
            "id": "fr15mk8",
            "parent_id": "t3_glipfc",
            "score": 1,
            "created_utc": 1589813706.0,
            "replies": []
        },
        {
            "body": "As an aspiring SB (18F) this is really encouraging",
            "author": "keysrose",
            "id": "fr2iwsg",
            "parent_id": "t3_glipfc",
            "score": 1,
            "created_utc": 1589838084.0,
            "replies": []
        },
        {
            "body": "Good luck, but not all sugar relationships benefit both parties.",
            "author": "Joannasweetgirl",
            "id": "fvu0jco",
            "parent_id": "t3_glipfc",
            "score": 1,
            "created_utc": 1592987580.0,
            "replies": []
        },
        {
            "body": "Signed.  It has been a privilege to have the amazing SBs I've had in my life.  I hope I enriched their lives as much as they did mine.",
            "author": "Azurecole",
            "id": "fqxn0rx",
            "parent_id": "t3_glipfc",
            "score": 1,
            "created_utc": 1589734824.0,
            "replies": []
        },
        {
            "body": "I’m reading all the SD comments, they are so sweet 🥰 I can’t wait to have a SR like this with the man that it’s up to come",
            "author": "_mimi97",
            "id": "fqxwdt4",
            "parent_id": "t3_glipfc",
            "score": 1,
            "created_utc": 1589738875.0,
            "replies": [
                {
                    "body": "Not all SR's are so great. Each is different and unique. Finding the right daddy like finding the right baby is so damn hard. I've had any number of short SR's that went nowhere. But the long-term ones made my life so happy, complete and satisfying.",
                    "author": "AFSMSgt",
                    "id": "fqxzf6o",
                    "parent_id": "t1_fqxwdt4",
                    "score": 2,
                    "created_utc": 1589740164.0,
                    "replies": [
                        {
                            "body": "In my area there's not such a thing as 'sugar culture' as in the States maybe it's due the mindset of the society here where I live, that's why it's so hard to meet SDs, not to mention one person who is perfect for one another...",
                            "author": "_mimi97",
                            "id": "fro6q3j",
                            "parent_id": "t1_fqxzf6o",
                            "score": 1,
                            "created_utc": 1590333894.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is so sweet <3",
            "author": "bb_salad",
            "id": "fqxxz8b",
            "parent_id": "t3_glipfc",
            "score": 0,
            "created_utc": 1589739552.0,
            "replies": []
        },
        {
            "body": "It goes both ways. I’m glad to see you are meeting women who give you a certain type of joy you didn’t have before. I hope to think most people in SRs grow in a positive way and flourish independently.",
            "author": "callmeDonatella",
            "id": "fqy4ucz",
            "parent_id": "t3_glipfc",
            "score": 0,
            "created_utc": 1589742607.0,
            "replies": []
        },
        {
            "body": "While my past SRs haven't been the best, I have gotten to know some amazing people along the way and I recently found the most amazing girl in the sugar bowl too.",
            "author": "realitytomydreams",
            "id": "fqyaijb",
            "parent_id": "t3_glipfc",
            "score": 0,
            "created_utc": 1589745451.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fqz4wcy",
            "parent_id": "t3_glipfc",
            "score": 0,
            "created_utc": 1589759968.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fqy0429",
            "parent_id": "t3_glipfc",
            "score": -1,
            "created_utc": 1589740463.0,
            "replies": [
                {
                    "body": "I am no saint. Most of my SR's started because I was lonely and horny and the SB's were needed financial help. But the ones that lasted progressed past the monetary considerations. I gave because I appreciated the emotional gifts they gave. They accepted because they knew my gifts come from the heart.",
                    "author": "AFSMSgt",
                    "id": "fqy3spj",
                    "parent_id": "t1_fqy0429",
                    "score": 3,
                    "created_utc": 1589742124.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is what an SR should be. I hope you find the perfect SD who will return your good energy",
            "author": "AFSMSgt",
            "id": "fqyu3nj",
            "parent_id": "t1_fqyonvp",
            "score": 3,
            "created_utc": 1589754576.0,
            "replies": []
        },
        {
            "body": "I'm similar to you.  The bowl really helped me stay positive about vanilla relationships.",
            "author": null,
            "id": "fqxrpl9",
            "parent_id": "t1_fqxnwc4",
            "score": 4,
            "created_utc": 1589736822.0,
            "replies": []
        },
        {
            "body": "Bud,   Once you have a few good SR’s the vanilla world can never measure up.",
            "author": "LotBuilder",
            "id": "fqya0xa",
            "parent_id": "t1_fqxnwc4",
            "score": 1,
            "created_utc": 1589745197.0,
            "replies": [
                {
                    "body": "Oh, I expect that.  That's my point, if SRs meet my needs, I think I'll be pretty happy to stick with sugar and avoid the vanilla.",
                    "author": "UseTheForceRey",
                    "id": "fqybtvh",
                    "parent_id": "t1_fqya0xa",
                    "score": 2,
                    "created_utc": 1589746059.0,
                    "replies": [
                        {
                            "body": "You realize that:  1.  If you are well off then all dating is vanilla dating because you are paying.  2.  If that’s how it’s going to be you may as well get the type of women you really want.",
                            "author": "LotBuilder",
                            "id": "fqycie2",
                            "parent_id": "t1_fqybtvh",
                            "score": 6,
                            "created_utc": 1589746369.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think that sometimes you just have to consider the things in your life that give you pleasure.",
            "author": "AFSMSgt",
            "id": "fqytu5c",
            "parent_id": "t1_fqyotme",
            "score": 3,
            "created_utc": 1589754452.0,
            "replies": [
                {
                    "body": "Like sucre!!!",
                    "author": "PioneerExperience",
                    "id": "fqyu7x5",
                    "parent_id": "t1_fqytu5c",
                    "score": 1,
                    "created_utc": 1589754635.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would raise you the word “life” for “love”: .. the music of you love is not gone. It is inside you - if you dare to listen.",
            "author": "why_so_sexy_",
            "id": "fqy41za",
            "parent_id": "t1_fqxsl8y",
            "score": 2,
            "created_utc": 1589742242.0,
            "replies": []
        },
        {
            "body": "👍",
            "author": "AFSMSgt",
            "id": "fqy44ww",
            "parent_id": "t1_fqxsl8y",
            "score": 0,
            "created_utc": 1589742281.0,
            "replies": []
        },
        {
            "body": "Sorry this happened to you. I understand you feeling negative but this was a scammer and not a true SD. Assuming you haven't yet read the newbie starters, included scammers, if you decide to reenter the bowl please read first. Your personal banking information, you helping him move money via your account is an immediate RED FLAG. Any legitimate SD does not need his SB to help him in finances, he's an SD because he's already made wise financial decisions and can afford his sugar side of life. Not passing judgement, just trying to give you advice. I wish you much luck 🦋",
            "author": "MyBeautifulLife4Me",
            "id": "fqyo9gk",
            "parent_id": "t1_fqy23ut",
            "score": 5,
            "created_utc": 1589751822.0,
            "replies": []
        },
        {
            "body": "So sorry. Finding the right SD is so damn hard.  I have had a bunch of not very satisfying short-term SR's. But the ones that lasted are so very special.",
            "author": "AFSMSgt",
            "id": "fqy33s6",
            "parent_id": "t1_fqy23ut",
            "score": 3,
            "created_utc": 1589741809.0,
            "replies": []
        },
        {
            "body": "This may be a little tough but good parents teach their kids to come to a complete stop and look both ways before running across the street.  \n\nYoung women  entering sugar need to apply a similar process and one of the most fundamental rules is to avoid financial exposure both for the financial loss and the emotional loss.  A responsible SD understands that and is comfortable handling such things in a way that is both comforting and respectful of the SB and the relationship.\n\nIf your potential SD is unwilling to deliver on his part of the arrangement prior to any intimacy you should come to a full stop.  It is the job of the SD to relieve financial pressure, exposure and anxiety.  Yes there are dirtbags who systematically take advantage of people and businesses. \n\nUnfortunately there are those who are consummate manipulators and take joy in defrauding others.",
            "author": "pinotandsugar",
            "id": "fqzjwb7",
            "parent_id": "t1_fqy23ut",
            "score": 2,
            "created_utc": 1589768943.0,
            "replies": []
        },
        {
            "body": "I am very sorry to hear this happened to you.  He wasn't a SD, he was a scammer.  I don't consider the girls that have tried/succeeded to rinse me SBs.  I won't allow their actions to taint my perception of what a real SB is.",
            "author": "storm170",
            "id": "fqyllbi",
            "parent_id": "t1_fqy23ut",
            "score": 1,
            "created_utc": 1589750575.0,
            "replies": []
        },
        {
            "body": "\nI’m so sorry to hear that. Not all SDs are good. Some can really burn you out emotionally. However, you should always be financially enriched. That’s the entire premise of the relationship. You got yourself a con artist, not a SD. They prey on new girls. You’re not the first I’ve heard this story from. In the future set your boundaries, including how you’re willing to accept payments, and stick to them. If a SD won’t respect your boundaries then he’s not good and probably not even real. Good luck in the future.",
            "author": null,
            "id": "fqz1ieg",
            "parent_id": "t1_fqy23ut",
            "score": 1,
            "created_utc": 1589758241.0,
            "replies": []
        },
        {
            "body": "I’m this happened to you, but you didn’t have a sugar daddy, you had a scammer that pretended to be a SD. This was most likely someone part of an organized crime ring.",
            "author": null,
            "id": "fr0tp98",
            "parent_id": "t1_fqy23ut",
            "score": 1,
            "created_utc": 1589806488.0,
            "replies": []
        },
        {
            "body": "Not all SR's are so great. Each is different and unique. Finding the right daddy like finding the right baby is so damn hard. I've had any number of short SR's that went nowhere. But the long-term ones made my life so happy, complete and satisfying.",
            "author": "AFSMSgt",
            "id": "fqxzf6o",
            "parent_id": "t1_fqxwdt4",
            "score": 2,
            "created_utc": 1589740164.0,
            "replies": [
                {
                    "body": "In my area there's not such a thing as 'sugar culture' as in the States maybe it's due the mindset of the society here where I live, that's why it's so hard to meet SDs, not to mention one person who is perfect for one another...",
                    "author": "_mimi97",
                    "id": "fro6q3j",
                    "parent_id": "t1_fqxzf6o",
                    "score": 1,
                    "created_utc": 1590333894.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am no saint. Most of my SR's started because I was lonely and horny and the SB's were needed financial help. But the ones that lasted progressed past the monetary considerations. I gave because I appreciated the emotional gifts they gave. They accepted because they knew my gifts come from the heart.",
            "author": "AFSMSgt",
            "id": "fqy3spj",
            "parent_id": "t1_fqy0429",
            "score": 3,
            "created_utc": 1589742124.0,
            "replies": []
        },
        {
            "body": "Oh, I expect that.  That's my point, if SRs meet my needs, I think I'll be pretty happy to stick with sugar and avoid the vanilla.",
            "author": "UseTheForceRey",
            "id": "fqybtvh",
            "parent_id": "t1_fqya0xa",
            "score": 2,
            "created_utc": 1589746059.0,
            "replies": [
                {
                    "body": "You realize that:  1.  If you are well off then all dating is vanilla dating because you are paying.  2.  If that’s how it’s going to be you may as well get the type of women you really want.",
                    "author": "LotBuilder",
                    "id": "fqycie2",
                    "parent_id": "t1_fqybtvh",
                    "score": 6,
                    "created_utc": 1589746369.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Like sucre!!!",
            "author": "PioneerExperience",
            "id": "fqyu7x5",
            "parent_id": "t1_fqytu5c",
            "score": 1,
            "created_utc": 1589754635.0,
            "replies": []
        },
        {
            "body": "In my area there's not such a thing as 'sugar culture' as in the States maybe it's due the mindset of the society here where I live, that's why it's so hard to meet SDs, not to mention one person who is perfect for one another...",
            "author": "_mimi97",
            "id": "fro6q3j",
            "parent_id": "t1_fqxzf6o",
            "score": 1,
            "created_utc": 1590333894.0,
            "replies": []
        },
        {
            "body": "You realize that:  1.  If you are well off then all dating is vanilla dating because you are paying.  2.  If that’s how it’s going to be you may as well get the type of women you really want.",
            "author": "LotBuilder",
            "id": "fqycie2",
            "parent_id": "t1_fqybtvh",
            "score": 6,
            "created_utc": 1589746369.0,
            "replies": []
        }
    ]
}