{
    "title": "Seeking Success",
    "post_id": "rjyv64",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/rjyv64/seeking_success/",
    "author": "glassjaw90",
    "body": "So, I’m 31 SD I make 6 figures and have been on the site for a while. Well a few months ago I contacted a gorgeous 26 year old SB on there. We immediately hit it off we texted for about a week until we were finally able to meet. When we did she came over and I cooked for her and the whole night was really magical. Long story short, cut to now and we’re living together. I was able to get her added to my health insurance by us becoming domestic partners. I get to surprise her with jewelry, Victoria secret, and pretty much anything else she wants almost weekly. So, now she’s the first thing I see in the morning and last thing I see at night. We’re doing the holidays together visiting family that are out of state and things couldn’t be better! So for everyone reading it does happen, you can find real success on the site!",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/rjyv64/seeking_success/",
    "score": 103,
    "upvote_ratio": 0.88,
    "created_utc": 1639927421.0,
    "num_comments": 67,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Success for 98% of the SD's on this subreddit is a decent sane SB. Not moving her in and getting into a domestic partnership. Congratulations and be careful.",
            "author": "southernslick",
            "id": "hp6pr22",
            "parent_id": "t3_rjyv64",
            "score": 40,
            "created_utc": 1639933405.0,
            "replies": [
                {
                    "body": "Huzzah to the 2%!!!",
                    "author": "YakiMe",
                    "id": "hp6vqlz",
                    "parent_id": "t1_hp6pr22",
                    "score": 7,
                    "created_utc": 1639935847.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s really terrific and proof that “mutually beneficial” means more than just sex and money.",
            "author": "daddoms",
            "id": "hp79h9i",
            "parent_id": "t3_rjyv64",
            "score": 22,
            "created_utc": 1639941401.0,
            "replies": [
                {
                    "body": "I personally love the ability to say \"go home\". I fund my SB life and enjoy her, but, I do enjoy my own life.",
                    "author": "Smitt727",
                    "id": "hp88am9",
                    "parent_id": "t1_hp79h9i",
                    "score": 9,
                    "created_utc": 1639956038.0,
                    "replies": [
                        {
                            "body": "That’s a different dynamic. Perhaps emotionally hands off and allowance/ppm in lieu. That’s also mutually beneficial. figuring out what your partner wants and giving them that makes for a good relationship. \n\nMy own style is more emotionally involved and I look for partners who also want that.",
                            "author": "daddoms",
                            "id": "hp89uhg",
                            "parent_id": "t1_hp88am9",
                            "score": 8,
                            "created_utc": 1639956725.0,
                            "replies": [
                                {
                                    "body": "I am emotionally attached, but at 60, I am not raising a 3 year old. I never had kids , by choice.",
                                    "author": "Smitt727",
                                    "id": "hp8a4bo",
                                    "parent_id": "t1_hp89uhg",
                                    "score": 1,
                                    "created_utc": 1639956846.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did you ever pay her an allowance or are you currently paying her one?",
            "author": null,
            "id": "hp6gqe9",
            "parent_id": "t3_rjyv64",
            "score": 18,
            "created_utc": 1639929524.0,
            "replies": [
                {
                    "body": "hes paying alot more than an allowance by supporting her",
                    "author": "vtec__",
                    "id": "hp7v7if",
                    "parent_id": "t1_hp6gqe9",
                    "score": 4,
                    "created_utc": 1639950352.0,
                    "replies": [
                        {
                            "body": "Agreed.",
                            "author": null,
                            "id": "hp7veny",
                            "parent_id": "t1_hp7v7if",
                            "score": 1,
                            "created_utc": 1639950435.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Congratulations! However I don’t understand how this is an SR from what you have mentioned. Your story would have been similar even if you met on Tinder or Christian mingle etc",
            "author": "supportiveceo",
            "id": "hp6qabp",
            "parent_id": "t3_rjyv64",
            "score": 19,
            "created_utc": 1639933620.0,
            "replies": []
        },
        {
            "body": "Your age difference is only 5 years. It’s much easier to find success when two people are on the same maturity level and similar points in life. Happy for you, may your relationship blossom with success.",
            "author": "whatifitdoescometrue",
            "id": "hp6xpz0",
            "parent_id": "t3_rjyv64",
            "score": 14,
            "created_utc": 1639936668.0,
            "replies": [
                {
                    "body": "#Fact",
                    "author": "Smitt727",
                    "id": "hp88d7s",
                    "parent_id": "t1_hp6xpz0",
                    "score": 1,
                    "created_utc": 1639956070.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"Long story short, cut to now and we’re living together\"\n\n\"now she’s the first thing I see in the morning and last thing I see at night\"\n\nGood for you. I love happy endings.\n\nOne of my sb's lives with me too.",
            "author": "LuckyINTJ",
            "id": "hp6flef",
            "parent_id": "t3_rjyv64",
            "score": 10,
            "created_utc": 1639929024.0,
            "replies": [
                {
                    "body": "\\>> \"One of my sb's lives with me too.\" <<\n\nWhat is her opinion of your other SB's? (I ask only to better understand whether your experience is likely to also be a \"happy ending.\")",
                    "author": "qwer5r",
                    "id": "hp843gf",
                    "parent_id": "t1_hp6flef",
                    "score": 4,
                    "created_utc": 1639954174.0,
                    "replies": [
                        {
                            "body": "\"What is her opinion of your other SB's?\"\n\nThey are all friends and get along great.\n\nIn fact my live-in helped me pick out my other two sugar babies.\n\nI wanted to make sure they would all like each other so I gave her veto power over who I chose. We \"auditioned\" about a dozen pots before we found one we both agreed on.\n\nWhen we went to chose my third sugar baby I gave both of them a voice in chosing her.\n\nIt is the only way to have a successful polyamorous relationship.  Eveyone has to get along and there has to be total transparency and honesty.",
                            "author": "LuckyINTJ",
                            "id": "hp8dsfm",
                            "parent_id": "t1_hp843gf",
                            "score": 5,
                            "created_utc": 1639958496.0,
                            "replies": [
                                {
                                    "body": "My congratulations.",
                                    "author": "qwer5r",
                                    "id": "hp8gce2",
                                    "parent_id": "t1_hp8dsfm",
                                    "score": 1,
                                    "created_utc": 1639959681.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is a post that proves that the \"definition of success\" is key for any successful communication 🤣   Seriously though, congrats on finding and achieving a situation that meets your definition of success, that's awesome.  I've reached my definition of success a few times, but it didn't include living together or becoming domestic partners.  That's okay, different strokes!  Although in retrospect, I've been talking with some 40+ SBs lately, which puts me in a similar situation as you in that they are SBs who are in the same age range as the women I date (only hotter! lol).  It has occurred to me that where I am not at all open to a 24-year-old moving in with me and transitioning to a vanilla relationship, I might be open to that as a possible outcome with a 40+ year old",
            "author": "Azurecole",
            "id": "hp71qxg",
            "parent_id": "t3_rjyv64",
            "score": 8,
            "created_utc": 1639938268.0,
            "replies": [
                {
                    "body": "Oh no! You've been a shining beacon of hope with your singleness here. Are you feeling the pull again? :D",
                    "author": "AnSteall",
                    "id": "hp77178",
                    "parent_id": "t1_hp71qxg",
                    "score": 4,
                    "created_utc": 1639940386.0,
                    "replies": [
                        {
                            "body": "Haha, I've always been vanilla dating all this time, although have to admit that when I'm happy in an SR there are sometimes many-month stretches where I don't really even try.  But sure, I'd couple up again, especially with an older woman who is still attractive enough to be an SB!",
                            "author": "Azurecole",
                            "id": "hp77nh3",
                            "parent_id": "t1_hp77178",
                            "score": 3,
                            "created_utc": 1639940643.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm glad you included how much you make, so I didn't have to ask.",
            "author": "Harpua1",
            "id": "hp6cqdh",
            "parent_id": "t3_rjyv64",
            "score": 10,
            "created_utc": 1639927722.0,
            "replies": [
                {
                    "body": "🤣🤣🤣🤣",
                    "author": "icnslt4u",
                    "id": "hp6dg4y",
                    "parent_id": "t1_hp6cqdh",
                    "score": 2,
                    "created_utc": 1639928049.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Might as well be married. Hahahaha",
            "author": "garret6758",
            "id": "hp6g392",
            "parent_id": "t3_rjyv64",
            "score": 9,
            "created_utc": 1639929244.0,
            "replies": [
                {
                    "body": "They already are 😂",
                    "author": "ICanOnlyGetSoElect",
                    "id": "hp6lrm8",
                    "parent_id": "t1_hp6g392",
                    "score": 6,
                    "created_utc": 1639931727.0,
                    "replies": [
                        {
                            "body": "We all create our own hell. 👹",
                            "author": "garret6758",
                            "id": "hp6wcrp",
                            "parent_id": "t1_hp6lrm8",
                            "score": 10,
                            "created_utc": 1639936099.0,
                            "replies": [
                                {
                                    "body": "This made me lol",
                                    "author": "noobNYCsd",
                                    "id": "hp78qry",
                                    "parent_id": "t1_hp6wcrp",
                                    "score": 2,
                                    "created_utc": 1639941097.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Happy 4 you; I’m ready for my happy arrangement/relationship",
            "author": null,
            "id": "hp8krdb",
            "parent_id": "t3_rjyv64",
            "score": 3,
            "created_utc": 1639961778.0,
            "replies": []
        },
        {
            "body": "I guess I don't quite understand people getting in a sugar relationship when their ages are so close together. The reality is, that's pretty much a vanilla relationship. If you are 31, not addicted to anything, employed, not living in your parents basement, it kind of makes you a catch anyway. You should be able to attract a woman you're approximate age without the addition of an allowance.  Many younger women look for older men because they don't want to date somebody their own age that is pretty much homeless.\n\n I guess I don't really get it...  My own vanilla relationship is with somebody who is about 15 years my junior.",
            "author": "Spirited-Sun-5924",
            "id": "hp6lm90",
            "parent_id": "t3_rjyv64",
            "score": 9,
            "created_utc": 1639931662.0,
            "replies": [
                {
                    "body": "I've sugar dated close to my age (30s)and while it feels kinda vanilla it's not. Typically they are still career focused which puts a lot of pressure on a traditional relationship. The benefit of a sugar relationship in my case is that all the broken dates/postponed trips comes with more understanding on my end and a nicer reward on his end.",
                    "author": "Crezia1591",
                    "id": "hp6z8ew",
                    "parent_id": "t1_hp6lm90",
                    "score": 13,
                    "created_utc": 1639937259.0,
                    "replies": []
                },
                {
                    "body": "I think you underestimate how bleak the vanilla dating scene is for men. Even an above average man will struggle to have success on Tinder or Hinge. If you have anything “wrong” with you like going bald, short, weird face, certain ethnicity it doesn’t matter if you are physically healthy, sane, and make 6 figures, you will be ignored by any woman who isn’t obese and/or has a mental illness.",
                    "author": "Sicuoeksncn",
                    "id": "hp7gooh",
                    "parent_id": "t1_hp6lm90",
                    "score": 1,
                    "created_utc": 1639944353.0,
                    "replies": []
                },
                {
                    "body": "you need to be 6 ft tall and reasonably handsome. most of us are not",
                    "author": "vtec__",
                    "id": "hp7w4qj",
                    "parent_id": "t1_hp6lm90",
                    "score": 1,
                    "created_utc": 1639950736.0,
                    "replies": [
                        {
                            "body": "The 6 foot thing makes me so mad for my guy friends. I've had \\*great\\* luck with men under 6ft, and I guess I can thank all the weird, picky women for leaving the good ones for the rest of us =)",
                            "author": "cami_dub",
                            "id": "hpd5v0g",
                            "parent_id": "t1_hp7w4qj",
                            "score": 2,
                            "created_utc": 1640047964.0,
                            "replies": [
                                {
                                    "body": "yeah, it sucks..i try not to cop an attitude about it because ive had very attractive women tell me im good looking but the height thing has always been a problem for me and alot of guys in the west..spending your formative years getting shunned doesnt help build confidence at all and in my opinion its hurting alot of millenial and gen Z women because there isnt enough 6 ft tall guys with 6 figure jobs to go around and support the 1950s housewife lifestyle that they want...",
                                    "author": "vtec__",
                                    "id": "hpd6eus",
                                    "parent_id": "t1_hpd5v0g",
                                    "score": 1,
                                    "created_utc": 1640048221.0,
                                    "replies": [
                                        {
                                            "body": "All I can do is promise you not all of us girls in the west are this disgustingly shallow. Height doesn't say jack about ones personality or worth.",
                                            "author": "cami_dub",
                                            "id": "hpfhy88",
                                            "parent_id": "t1_hpd6eus",
                                            "score": 1,
                                            "created_utc": 1640098603.0,
                                            "replies": [
                                                {
                                                    "body": "oh for sure, ive met lots of nice ladies on SA but it just seems like the more attractive they are, the worst this trait comes out.",
                                                    "author": "vtec__",
                                                    "id": "hpgsvp9",
                                                    "parent_id": "t1_hpfhy88",
                                                    "score": 2,
                                                    "created_utc": 1640117534.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Doesn’t sound like a sugar relationship. Sounds more like a vanilla relationship. But I agree, I won’t sugar date someone who is close to my age (mid 30’s).",
                    "author": null,
                    "id": "hp6wxkk",
                    "parent_id": "t1_hp6lm90",
                    "score": 0,
                    "created_utc": 1639936339.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Are you still paying an allowance or are you a dater?",
            "author": "GSSD",
            "id": "hpaerhn",
            "parent_id": "t3_rjyv64",
            "score": 2,
            "created_utc": 1640004190.0,
            "replies": []
        },
        {
            "body": "Umm not sure where you are from but from where I live you are setting yourself up to her getting half of everything you own after 6 months….you do not need to be married to be considered a mate.  Its called common law here after 6 months.",
            "author": "DomDaddyNW",
            "id": "hp81scs",
            "parent_id": "t3_rjyv64",
            "score": 3,
            "created_utc": 1639953167.0,
            "replies": []
        },
        {
            "body": "Enjoy your divorce.\n\nYou do understand a domestic partnership is virtually identical to marriage legally right? They're intended for gay couples in places that don't allow gay marriage.\n\nYou're liable for losing 1/2 your assets, alimony, etc.",
            "author": "ICanOnlyGetSoElect",
            "id": "hp6g4xt",
            "parent_id": "t3_rjyv64",
            "score": 0,
            "created_utc": 1639929264.0,
            "replies": [
                {
                    "body": "What about if he makes her sign a pre nup lol?",
                    "author": null,
                    "id": "hp6gmim",
                    "parent_id": "t1_hp6g4xt",
                    "score": 4,
                    "created_utc": 1639929478.0,
                    "replies": [
                        {
                            "body": "After the fact? It holds less weight than even a normal prenup.\n\nI just find it funny that the guy got married and isn't aware.\n\nHe's not talking about spending the rest of his life with her, when the breakup happens he'll be in for a shock, or, worse yet when he finds out he can't get married to someone else, because he's already married.",
                            "author": "ICanOnlyGetSoElect",
                            "id": "hp6gump",
                            "parent_id": "t1_hp6gmim",
                            "score": 2,
                            "created_utc": 1639929575.0,
                            "replies": [
                                {
                                    "body": "Hes 31. I doubt he has significant assets. Maybe he does. But whatever. No need to be negative about it. Just wish them well.",
                                    "author": null,
                                    "id": "hp6k64s",
                                    "parent_id": "t1_hp6gump",
                                    "score": 6,
                                    "created_utc": 1639931039.0,
                                    "replies": [
                                        {
                                            "body": "Nah, its not what he has now, it's when he goes to get married in 10 years, needs a divorce, and the judge splits his assets then, and awards alimony right as he's about to get married.",
                                            "author": "ICanOnlyGetSoElect",
                                            "id": "hp6kkqw",
                                            "parent_id": "t1_hp6k64s",
                                            "score": 2,
                                            "created_utc": 1639931214.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Uhhh yea, why would you assume I haven’t looked into all of this already? Also, you’re completely unaware if It was a county or city registry or what area it’s in. All of these things are factors. I appreciate your concern, but of course I have these things covered.",
                                    "author": "glassjaw90",
                                    "id": "hp6j2p9",
                                    "parent_id": "t1_hp6gump",
                                    "score": 4,
                                    "created_utc": 1639930560.0,
                                    "replies": [
                                        {
                                            "body": ">you’re completely unaware if It was a county or city registry or what area it’s in. All of these things are factors\n\nNah, you're unaware that it doesn't matter.\n\nThe jurisdiction you're married in does not determine the jurisdiction she divorces you in. If she moves to Canada for a year, she can file for divorce there.\n\nAny prenup is out the window, and they won't treat it any differently from any other marriage.\n\n>these things are factors\n\nThey're really not.\n\n>I have these things covered.\n\nYou don't.",
                                            "author": "ICanOnlyGetSoElect",
                                            "id": "hp6jsoe",
                                            "parent_id": "t1_hp6j2p9",
                                            "score": 0,
                                            "created_utc": 1639930876.0,
                                            "replies": [
                                                {
                                                    "body": "You’re right",
                                                    "author": "glassjaw90",
                                                    "id": "hp6l5c2",
                                                    "parent_id": "t1_hp6jsoe",
                                                    "score": 2,
                                                    "created_utc": 1639931461.0,
                                                    "replies": [
                                                        {
                                                            "body": "You might as well make it official and have a big wedding, since you know, legally you're already married anyways.\n\nBest of luck to you, I hope it works out.",
                                                            "author": "ICanOnlyGetSoElect",
                                                            "id": "hp6lo3t",
                                                            "parent_id": "t1_hp6l5c2",
                                                            "score": 1,
                                                            "created_utc": 1639931685.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[removed]",
                                                                    "author": null,
                                                                    "id": "hp6mmwi",
                                                                    "parent_id": "t1_hp6lo3t",
                                                                    "score": 2,
                                                                    "created_utc": 1639932110.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "There's a reason OP left him with \"You're right.\"",
                                                                            "author": "GACyberCool",
                                                                            "id": "hp8spr9",
                                                                            "parent_id": "t1_hp6mmwi",
                                                                            "score": 2,
                                                                            "created_utc": 1639965679.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": ">This is bad legal advice\n\nIt's not legal advice, its awareness of international legal systems.\n\nBut, don't take my word for it:\n\nhttps://travel.state.gov/content/travel/en/international-travel/while-abroad/divorce-abroad.html\n\n>A foreign judgment of divorce generally is recognized in a state in the United States on the basis of legal reciprocity where both parties had notice of the divorce proceeding and an opportunity to be heard within these proceedings. Marriage and divorce generally are considered matters reserved to the states rather than to the federal government.\n\nhttps://travel.state.gov/content/travel/en/international-travel/while-abroad/divorce-abroad/divorce-abroad-legal.html\n\n>a divorce decree issued in a foreign country generally is recognized in a state in the United States on the basis of comity (Hilton v. Guyot, 159 U.S. 113, 163-64 (1895), where both parties had notice of the divorce proceeding and an opportunity to be heard within these proceedings. Under the principle of comity, a divorce obtained in a foreign country under the circumstances described above generally will be recognized by states within the United States. States also may consider the jurisdictional basis upon which the foreign decree is founded and may not recognize the foreign divorce if the court is not satisfied that at least one party was domiciled in the country at the time of the divorce.\n\n>Divorce impacts eligibility for and distribution of federal benefits. Accordingly, the U.S. Social Security Administration, Veterans Administration, and Internal Revenue Service have made determinations regarding the validity of foreign divorces based on the laws of the state of residence applicable with respect to claims for benefits. For Social Security issues, please visit their website. Generally, federal entities apply the law of the state of residence of the beneficiary in question.\n\nFor example, in the UK, civil partnerships:\n\nhttps://www.gov.uk/end-civil-partnership\n\n>How to end your civil partnership\n>You must send paperwork to a court to ask for permission to end your civil partnership.\n\n>Separate from the paperwork, you and your ex-partner may need to work out:\n\n>arrangements for looking after any children\n>child maintenance payments for any children\n>***You also need to divide your money and property. There’s a deadline if you want to make this legally binding.***\n\n>You can usually avoid going to court hearings if you agree about children, money and property and the reasons for ending your civil partnership.\n\nMost countries have rules about who can file for divorce in their country.\n\nMost countries set the line as one of the partners living in that country for a year to be eligible for divorce there.",
                                                                            "author": "ICanOnlyGetSoElect",
                                                                            "id": "hp6o3rw",
                                                                            "parent_id": "t1_hp6mmwi",
                                                                            "score": -2,
                                                                            "created_utc": 1639932722.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[removed]",
                                                                                    "author": null,
                                                                                    "id": "hp6pjgt",
                                                                                    "parent_id": "t1_hp6o3rw",
                                                                                    "score": 8,
                                                                                    "created_utc": 1639933318.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Well, you know, many countries signed on to the Hague divorce convention, or are controlled by the Brussels II regulation. So those are pretty standard.\n\nI think you'll find just about any country in the world aside from the Philippines will grant a divorce to anyone who's been a resident for whatever their minimum period of time is (usually a year), and the US will recognize it.",
                                                                                            "author": "ICanOnlyGetSoElect",
                                                                                            "id": "hp6qajl",
                                                                                            "parent_id": "t1_hp6pjgt",
                                                                                            "score": 1,
                                                                                            "created_utc": 1639933622.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Congrats on your success, and I hope it continues.\n\nOne thing to be aware of are the risks of common law marriage, child support, alimony, and fake restraining orders, via family courts that are extremely abusive and that do not follow the law in the US. You need to at least be aware of this risk, and how high it is. Read the online materials and books, from these 4 influencers on Youtube:\n\nRollo Tomassi, Rich Cooper, Better Bachelor, and Coach Greg Adams\n\nI have 3 SB's, and I am phasing out even allowing them to stay overnight, because of how much of an abusive scam the family courts are in the US.",
            "author": "Nomad_Bill",
            "id": "hp6jotb",
            "parent_id": "t3_rjyv64",
            "score": 0,
            "created_utc": 1639930830.0,
            "replies": [
                {
                    "body": "The only reason why I love paying ppms and allowances is they buy you that arms length control to end things on your own terms vs getting the courts or the rest of the world involved. That’s the beauty of a sugar relationship!!",
                    "author": null,
                    "id": "hp6q2xq",
                    "parent_id": "t1_hp6jotb",
                    "score": 7,
                    "created_utc": 1639933538.0,
                    "replies": [
                        {
                            "body": "Exactly. That's why I do allowances only. No vanilla dating.\n\nBut remember, just because you pay an allowance, that doesn't automatically preclude family court involvement. You need to be careful you don't meet your jurisdiction's rules (based on case law), of what constitutes a common law marriage, if you do any overnight stays.\n\nThat definition is becoming wider as time goes on, based on court rulings. Just something to be aware of. I keep track of the case law on this issue.",
                            "author": "Nomad_Bill",
                            "id": "hp6re6b",
                            "parent_id": "t1_hp6q2xq",
                            "score": 0,
                            "created_utc": 1639934079.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hp6twal",
                    "parent_id": "t1_hp6jotb",
                    "score": 4,
                    "created_utc": 1639935095.0,
                    "replies": [
                        {
                            "body": "\\^Hey, it's the forum troll. He's back!  ... LOL\n\n(Bankruptcy Law 101: 7-figure IRA's are kept in a bankruptcy)",
                            "author": "Nomad_Bill",
                            "id": "hp6udky",
                            "parent_id": "t1_hp6twal",
                            "score": -5,
                            "created_utc": 1639935291.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hp7m1iy",
                                    "parent_id": "t1_hp6udky",
                                    "score": 4,
                                    "created_utc": 1639946541.0,
                                    "replies": [
                                        {
                                            "body": "He is also this sub’s leading expert on not responding to requests to link to studies that support ivermectin and HCQ therapies for Covid-19 that have not been subsequently retracted or discredited. \n\n*“Do your own research!”* \n🙄",
                                            "author": "Chill_SD1974",
                                            "id": "hp9ecaa",
                                            "parent_id": "t1_hp7m1iy",
                                            "score": 2,
                                            "created_utc": 1639976699.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "\\^Trollin, trolling, trollin\n\nBankruptcy Law 101: 7-figure IRA's are kept in a bankruptcy\n\n:-)",
                                            "author": "Nomad_Bill",
                                            "id": "hp81iu7",
                                            "parent_id": "t1_hp7m1iy",
                                            "score": -3,
                                            "created_utc": 1639953054.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "hpaslkl",
                                                    "parent_id": "t1_hp81iu7",
                                                    "score": 2,
                                                    "created_utc": 1640011668.0,
                                                    "replies": [
                                                        {
                                                            "body": "I clearly destroyed your argument in that thread, which anyone can clearly see. And that's exactly why you didn't re-post any specifics of it in this thread, because you know you'll get destroyed again. \n\nBankruptcy Law 101: 7-figure IRA's are preserved in a bankruptcy.",
                                                            "author": "Nomad_Bill",
                                                            "id": "hpb4coh",
                                                            "parent_id": "t1_hpaslkl",
                                                            "score": -1,
                                                            "created_utc": 1640016870.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "hpb4ke6",
                                                                    "parent_id": "t1_hpb4coh",
                                                                    "score": 1,
                                                                    "created_utc": 1640016962.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "It's obvious that I did destroy you, because you \\*still\\* won't re-post any specifics here. And the obvious reason is because you know you'll get destroyed again.\n\nI'll summarize it, since you won't - Bankruptcy Law 101: 7-figure IRA's are preserved in a bankruptcy.\n\nThe reader can judge for themselves. Res ipsa loquitor  :-)",
                                                                            "author": "Nomad_Bill",
                                                                            "id": "hpb5yvv",
                                                                            "parent_id": "t1_hpb4ke6",
                                                                            "score": 0,
                                                                            "created_utc": 1640017546.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "hpb8dlz",
                                                                                    "parent_id": "t1_hpb5yvv",
                                                                                    "score": 1,
                                                                                    "created_utc": 1640018559.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Pro-tip: copy and paste doesn't take any more \"time away from your work\", than posting in this thread does. \n\nCould your responses be any more transparently ridiculous? \n\nLMAO!",
                                                                                            "author": "Nomad_Bill",
                                                                                            "id": "hpb8s8s",
                                                                                            "parent_id": "t1_hpb8dlz",
                                                                                            "score": -1,
                                                                                            "created_utc": 1640018727.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "CGA has a lot of great content on this and I trust him cause he went through it. It’s definitely worth OP looking into. Moving in together this fast is dicey. I hope this doesn’t end badly",
                    "author": "UnearthlyDinosaur",
                    "id": "hp73rv2",
                    "parent_id": "t1_hp6jotb",
                    "score": 2,
                    "created_utc": 1639939062.0,
                    "replies": []
                },
                {
                    "body": "sup fam",
                    "author": "vtec__",
                    "id": "hp7whc2",
                    "parent_id": "t1_hp6jotb",
                    "score": 1,
                    "created_utc": 1639950882.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeh but most guys on sa aren’t picking girls 5 years younger are they",
            "author": "wb19081908",
            "id": "hp9p6pg",
            "parent_id": "t3_rjyv64",
            "score": 0,
            "created_utc": 1639983853.0,
            "replies": []
        },
        {
            "body": "Not me 😅",
            "author": "Ronconcocacola333",
            "id": "hp80zi1",
            "parent_id": "t3_rjyv64",
            "score": 1,
            "created_utc": 1639952821.0,
            "replies": []
        },
        {
            "body": "Wow That’s exactly what I’m looking for!! So hard to find though :/",
            "author": "National-Dig1823",
            "id": "hp94865",
            "parent_id": "t3_rjyv64",
            "score": 1,
            "created_utc": 1639971325.0,
            "replies": []
        },
        {
            "body": "RemindMe! 6 months",
            "author": "lipstickdiet",
            "id": "hp99alu",
            "parent_id": "t3_rjyv64",
            "score": 1,
            "created_utc": 1639973871.0,
            "replies": []
        },
        {
            "body": "Wow. So incredibly lucky for you both. I’m hoping for the same and trying not lose hope.",
            "author": "Intelligent_Signal86",
            "id": "hp9baht",
            "parent_id": "t3_rjyv64",
            "score": 1,
            "created_utc": 1639974942.0,
            "replies": []
        },
        {
            "body": "Huzzah to the 2%!!!",
            "author": "YakiMe",
            "id": "hp6vqlz",
            "parent_id": "t1_hp6pr22",
            "score": 7,
            "created_utc": 1639935847.0,
            "replies": []
        },
        {
            "body": "I personally love the ability to say \"go home\". I fund my SB life and enjoy her, but, I do enjoy my own life.",
            "author": "Smitt727",
            "id": "hp88am9",
            "parent_id": "t1_hp79h9i",
            "score": 9,
            "created_utc": 1639956038.0,
            "replies": [
                {
                    "body": "That’s a different dynamic. Perhaps emotionally hands off and allowance/ppm in lieu. That’s also mutually beneficial. figuring out what your partner wants and giving them that makes for a good relationship. \n\nMy own style is more emotionally involved and I look for partners who also want that.",
                    "author": "daddoms",
                    "id": "hp89uhg",
                    "parent_id": "t1_hp88am9",
                    "score": 8,
                    "created_utc": 1639956725.0,
                    "replies": [
                        {
                            "body": "I am emotionally attached, but at 60, I am not raising a 3 year old. I never had kids , by choice.",
                            "author": "Smitt727",
                            "id": "hp8a4bo",
                            "parent_id": "t1_hp89uhg",
                            "score": 1,
                            "created_utc": 1639956846.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "hes paying alot more than an allowance by supporting her",
            "author": "vtec__",
            "id": "hp7v7if",
            "parent_id": "t1_hp6gqe9",
            "score": 4,
            "created_utc": 1639950352.0,
            "replies": [
                {
                    "body": "Agreed.",
                    "author": null,
                    "id": "hp7veny",
                    "parent_id": "t1_hp7v7if",
                    "score": 1,
                    "created_utc": 1639950435.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "#Fact",
            "author": "Smitt727",
            "id": "hp88d7s",
            "parent_id": "t1_hp6xpz0",
            "score": 1,
            "created_utc": 1639956070.0,
            "replies": []
        },
        {
            "body": "\\>> \"One of my sb's lives with me too.\" <<\n\nWhat is her opinion of your other SB's? (I ask only to better understand whether your experience is likely to also be a \"happy ending.\")",
            "author": "qwer5r",
            "id": "hp843gf",
            "parent_id": "t1_hp6flef",
            "score": 4,
            "created_utc": 1639954174.0,
            "replies": [
                {
                    "body": "\"What is her opinion of your other SB's?\"\n\nThey are all friends and get along great.\n\nIn fact my live-in helped me pick out my other two sugar babies.\n\nI wanted to make sure they would all like each other so I gave her veto power over who I chose. We \"auditioned\" about a dozen pots before we found one we both agreed on.\n\nWhen we went to chose my third sugar baby I gave both of them a voice in chosing her.\n\nIt is the only way to have a successful polyamorous relationship.  Eveyone has to get along and there has to be total transparency and honesty.",
                    "author": "LuckyINTJ",
                    "id": "hp8dsfm",
                    "parent_id": "t1_hp843gf",
                    "score": 5,
                    "created_utc": 1639958496.0,
                    "replies": [
                        {
                            "body": "My congratulations.",
                            "author": "qwer5r",
                            "id": "hp8gce2",
                            "parent_id": "t1_hp8dsfm",
                            "score": 1,
                            "created_utc": 1639959681.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh no! You've been a shining beacon of hope with your singleness here. Are you feeling the pull again? :D",
            "author": "AnSteall",
            "id": "hp77178",
            "parent_id": "t1_hp71qxg",
            "score": 4,
            "created_utc": 1639940386.0,
            "replies": [
                {
                    "body": "Haha, I've always been vanilla dating all this time, although have to admit that when I'm happy in an SR there are sometimes many-month stretches where I don't really even try.  But sure, I'd couple up again, especially with an older woman who is still attractive enough to be an SB!",
                    "author": "Azurecole",
                    "id": "hp77nh3",
                    "parent_id": "t1_hp77178",
                    "score": 3,
                    "created_utc": 1639940643.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🤣🤣🤣🤣",
            "author": "icnslt4u",
            "id": "hp6dg4y",
            "parent_id": "t1_hp6cqdh",
            "score": 2,
            "created_utc": 1639928049.0,
            "replies": []
        },
        {
            "body": "They already are 😂",
            "author": "ICanOnlyGetSoElect",
            "id": "hp6lrm8",
            "parent_id": "t1_hp6g392",
            "score": 6,
            "created_utc": 1639931727.0,
            "replies": [
                {
                    "body": "We all create our own hell. 👹",
                    "author": "garret6758",
                    "id": "hp6wcrp",
                    "parent_id": "t1_hp6lrm8",
                    "score": 10,
                    "created_utc": 1639936099.0,
                    "replies": [
                        {
                            "body": "This made me lol",
                            "author": "noobNYCsd",
                            "id": "hp78qry",
                            "parent_id": "t1_hp6wcrp",
                            "score": 2,
                            "created_utc": 1639941097.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've sugar dated close to my age (30s)and while it feels kinda vanilla it's not. Typically they are still career focused which puts a lot of pressure on a traditional relationship. The benefit of a sugar relationship in my case is that all the broken dates/postponed trips comes with more understanding on my end and a nicer reward on his end.",
            "author": "Crezia1591",
            "id": "hp6z8ew",
            "parent_id": "t1_hp6lm90",
            "score": 13,
            "created_utc": 1639937259.0,
            "replies": []
        },
        {
            "body": "I think you underestimate how bleak the vanilla dating scene is for men. Even an above average man will struggle to have success on Tinder or Hinge. If you have anything “wrong” with you like going bald, short, weird face, certain ethnicity it doesn’t matter if you are physically healthy, sane, and make 6 figures, you will be ignored by any woman who isn’t obese and/or has a mental illness.",
            "author": "Sicuoeksncn",
            "id": "hp7gooh",
            "parent_id": "t1_hp6lm90",
            "score": 1,
            "created_utc": 1639944353.0,
            "replies": []
        },
        {
            "body": "you need to be 6 ft tall and reasonably handsome. most of us are not",
            "author": "vtec__",
            "id": "hp7w4qj",
            "parent_id": "t1_hp6lm90",
            "score": 1,
            "created_utc": 1639950736.0,
            "replies": [
                {
                    "body": "The 6 foot thing makes me so mad for my guy friends. I've had \\*great\\* luck with men under 6ft, and I guess I can thank all the weird, picky women for leaving the good ones for the rest of us =)",
                    "author": "cami_dub",
                    "id": "hpd5v0g",
                    "parent_id": "t1_hp7w4qj",
                    "score": 2,
                    "created_utc": 1640047964.0,
                    "replies": [
                        {
                            "body": "yeah, it sucks..i try not to cop an attitude about it because ive had very attractive women tell me im good looking but the height thing has always been a problem for me and alot of guys in the west..spending your formative years getting shunned doesnt help build confidence at all and in my opinion its hurting alot of millenial and gen Z women because there isnt enough 6 ft tall guys with 6 figure jobs to go around and support the 1950s housewife lifestyle that they want...",
                            "author": "vtec__",
                            "id": "hpd6eus",
                            "parent_id": "t1_hpd5v0g",
                            "score": 1,
                            "created_utc": 1640048221.0,
                            "replies": [
                                {
                                    "body": "All I can do is promise you not all of us girls in the west are this disgustingly shallow. Height doesn't say jack about ones personality or worth.",
                                    "author": "cami_dub",
                                    "id": "hpfhy88",
                                    "parent_id": "t1_hpd6eus",
                                    "score": 1,
                                    "created_utc": 1640098603.0,
                                    "replies": [
                                        {
                                            "body": "oh for sure, ive met lots of nice ladies on SA but it just seems like the more attractive they are, the worst this trait comes out.",
                                            "author": "vtec__",
                                            "id": "hpgsvp9",
                                            "parent_id": "t1_hpfhy88",
                                            "score": 2,
                                            "created_utc": 1640117534.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Doesn’t sound like a sugar relationship. Sounds more like a vanilla relationship. But I agree, I won’t sugar date someone who is close to my age (mid 30’s).",
            "author": null,
            "id": "hp6wxkk",
            "parent_id": "t1_hp6lm90",
            "score": 0,
            "created_utc": 1639936339.0,
            "replies": []
        },
        {
            "body": "What about if he makes her sign a pre nup lol?",
            "author": null,
            "id": "hp6gmim",
            "parent_id": "t1_hp6g4xt",
            "score": 4,
            "created_utc": 1639929478.0,
            "replies": [
                {
                    "body": "After the fact? It holds less weight than even a normal prenup.\n\nI just find it funny that the guy got married and isn't aware.\n\nHe's not talking about spending the rest of his life with her, when the breakup happens he'll be in for a shock, or, worse yet when he finds out he can't get married to someone else, because he's already married.",
                    "author": "ICanOnlyGetSoElect",
                    "id": "hp6gump",
                    "parent_id": "t1_hp6gmim",
                    "score": 2,
                    "created_utc": 1639929575.0,
                    "replies": [
                        {
                            "body": "Hes 31. I doubt he has significant assets. Maybe he does. But whatever. No need to be negative about it. Just wish them well.",
                            "author": null,
                            "id": "hp6k64s",
                            "parent_id": "t1_hp6gump",
                            "score": 6,
                            "created_utc": 1639931039.0,
                            "replies": [
                                {
                                    "body": "Nah, its not what he has now, it's when he goes to get married in 10 years, needs a divorce, and the judge splits his assets then, and awards alimony right as he's about to get married.",
                                    "author": "ICanOnlyGetSoElect",
                                    "id": "hp6kkqw",
                                    "parent_id": "t1_hp6k64s",
                                    "score": 2,
                                    "created_utc": 1639931214.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Uhhh yea, why would you assume I haven’t looked into all of this already? Also, you’re completely unaware if It was a county or city registry or what area it’s in. All of these things are factors. I appreciate your concern, but of course I have these things covered.",
                            "author": "glassjaw90",
                            "id": "hp6j2p9",
                            "parent_id": "t1_hp6gump",
                            "score": 4,
                            "created_utc": 1639930560.0,
                            "replies": [
                                {
                                    "body": ">you’re completely unaware if It was a county or city registry or what area it’s in. All of these things are factors\n\nNah, you're unaware that it doesn't matter.\n\nThe jurisdiction you're married in does not determine the jurisdiction she divorces you in. If she moves to Canada for a year, she can file for divorce there.\n\nAny prenup is out the window, and they won't treat it any differently from any other marriage.\n\n>these things are factors\n\nThey're really not.\n\n>I have these things covered.\n\nYou don't.",
                                    "author": "ICanOnlyGetSoElect",
                                    "id": "hp6jsoe",
                                    "parent_id": "t1_hp6j2p9",
                                    "score": 0,
                                    "created_utc": 1639930876.0,
                                    "replies": [
                                        {
                                            "body": "You’re right",
                                            "author": "glassjaw90",
                                            "id": "hp6l5c2",
                                            "parent_id": "t1_hp6jsoe",
                                            "score": 2,
                                            "created_utc": 1639931461.0,
                                            "replies": [
                                                {
                                                    "body": "You might as well make it official and have a big wedding, since you know, legally you're already married anyways.\n\nBest of luck to you, I hope it works out.",
                                                    "author": "ICanOnlyGetSoElect",
                                                    "id": "hp6lo3t",
                                                    "parent_id": "t1_hp6l5c2",
                                                    "score": 1,
                                                    "created_utc": 1639931685.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "hp6mmwi",
                                                            "parent_id": "t1_hp6lo3t",
                                                            "score": 2,
                                                            "created_utc": 1639932110.0,
                                                            "replies": [
                                                                {
                                                                    "body": "There's a reason OP left him with \"You're right.\"",
                                                                    "author": "GACyberCool",
                                                                    "id": "hp8spr9",
                                                                    "parent_id": "t1_hp6mmwi",
                                                                    "score": 2,
                                                                    "created_utc": 1639965679.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": ">This is bad legal advice\n\nIt's not legal advice, its awareness of international legal systems.\n\nBut, don't take my word for it:\n\nhttps://travel.state.gov/content/travel/en/international-travel/while-abroad/divorce-abroad.html\n\n>A foreign judgment of divorce generally is recognized in a state in the United States on the basis of legal reciprocity where both parties had notice of the divorce proceeding and an opportunity to be heard within these proceedings. Marriage and divorce generally are considered matters reserved to the states rather than to the federal government.\n\nhttps://travel.state.gov/content/travel/en/international-travel/while-abroad/divorce-abroad/divorce-abroad-legal.html\n\n>a divorce decree issued in a foreign country generally is recognized in a state in the United States on the basis of comity (Hilton v. Guyot, 159 U.S. 113, 163-64 (1895), where both parties had notice of the divorce proceeding and an opportunity to be heard within these proceedings. Under the principle of comity, a divorce obtained in a foreign country under the circumstances described above generally will be recognized by states within the United States. States also may consider the jurisdictional basis upon which the foreign decree is founded and may not recognize the foreign divorce if the court is not satisfied that at least one party was domiciled in the country at the time of the divorce.\n\n>Divorce impacts eligibility for and distribution of federal benefits. Accordingly, the U.S. Social Security Administration, Veterans Administration, and Internal Revenue Service have made determinations regarding the validity of foreign divorces based on the laws of the state of residence applicable with respect to claims for benefits. For Social Security issues, please visit their website. Generally, federal entities apply the law of the state of residence of the beneficiary in question.\n\nFor example, in the UK, civil partnerships:\n\nhttps://www.gov.uk/end-civil-partnership\n\n>How to end your civil partnership\n>You must send paperwork to a court to ask for permission to end your civil partnership.\n\n>Separate from the paperwork, you and your ex-partner may need to work out:\n\n>arrangements for looking after any children\n>child maintenance payments for any children\n>***You also need to divide your money and property. There’s a deadline if you want to make this legally binding.***\n\n>You can usually avoid going to court hearings if you agree about children, money and property and the reasons for ending your civil partnership.\n\nMost countries have rules about who can file for divorce in their country.\n\nMost countries set the line as one of the partners living in that country for a year to be eligible for divorce there.",
                                                                    "author": "ICanOnlyGetSoElect",
                                                                    "id": "hp6o3rw",
                                                                    "parent_id": "t1_hp6mmwi",
                                                                    "score": -2,
                                                                    "created_utc": 1639932722.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[removed]",
                                                                            "author": null,
                                                                            "id": "hp6pjgt",
                                                                            "parent_id": "t1_hp6o3rw",
                                                                            "score": 8,
                                                                            "created_utc": 1639933318.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Well, you know, many countries signed on to the Hague divorce convention, or are controlled by the Brussels II regulation. So those are pretty standard.\n\nI think you'll find just about any country in the world aside from the Philippines will grant a divorce to anyone who's been a resident for whatever their minimum period of time is (usually a year), and the US will recognize it.",
                                                                                    "author": "ICanOnlyGetSoElect",
                                                                                    "id": "hp6qajl",
                                                                                    "parent_id": "t1_hp6pjgt",
                                                                                    "score": 1,
                                                                                    "created_utc": 1639933622.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The only reason why I love paying ppms and allowances is they buy you that arms length control to end things on your own terms vs getting the courts or the rest of the world involved. That’s the beauty of a sugar relationship!!",
            "author": null,
            "id": "hp6q2xq",
            "parent_id": "t1_hp6jotb",
            "score": 7,
            "created_utc": 1639933538.0,
            "replies": [
                {
                    "body": "Exactly. That's why I do allowances only. No vanilla dating.\n\nBut remember, just because you pay an allowance, that doesn't automatically preclude family court involvement. You need to be careful you don't meet your jurisdiction's rules (based on case law), of what constitutes a common law marriage, if you do any overnight stays.\n\nThat definition is becoming wider as time goes on, based on court rulings. Just something to be aware of. I keep track of the case law on this issue.",
                    "author": "Nomad_Bill",
                    "id": "hp6re6b",
                    "parent_id": "t1_hp6q2xq",
                    "score": 0,
                    "created_utc": 1639934079.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hp6twal",
            "parent_id": "t1_hp6jotb",
            "score": 4,
            "created_utc": 1639935095.0,
            "replies": [
                {
                    "body": "\\^Hey, it's the forum troll. He's back!  ... LOL\n\n(Bankruptcy Law 101: 7-figure IRA's are kept in a bankruptcy)",
                    "author": "Nomad_Bill",
                    "id": "hp6udky",
                    "parent_id": "t1_hp6twal",
                    "score": -5,
                    "created_utc": 1639935291.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hp7m1iy",
                            "parent_id": "t1_hp6udky",
                            "score": 4,
                            "created_utc": 1639946541.0,
                            "replies": [
                                {
                                    "body": "He is also this sub’s leading expert on not responding to requests to link to studies that support ivermectin and HCQ therapies for Covid-19 that have not been subsequently retracted or discredited. \n\n*“Do your own research!”* \n🙄",
                                    "author": "Chill_SD1974",
                                    "id": "hp9ecaa",
                                    "parent_id": "t1_hp7m1iy",
                                    "score": 2,
                                    "created_utc": 1639976699.0,
                                    "replies": []
                                },
                                {
                                    "body": "\\^Trollin, trolling, trollin\n\nBankruptcy Law 101: 7-figure IRA's are kept in a bankruptcy\n\n:-)",
                                    "author": "Nomad_Bill",
                                    "id": "hp81iu7",
                                    "parent_id": "t1_hp7m1iy",
                                    "score": -3,
                                    "created_utc": 1639953054.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hpaslkl",
                                            "parent_id": "t1_hp81iu7",
                                            "score": 2,
                                            "created_utc": 1640011668.0,
                                            "replies": [
                                                {
                                                    "body": "I clearly destroyed your argument in that thread, which anyone can clearly see. And that's exactly why you didn't re-post any specifics of it in this thread, because you know you'll get destroyed again. \n\nBankruptcy Law 101: 7-figure IRA's are preserved in a bankruptcy.",
                                                    "author": "Nomad_Bill",
                                                    "id": "hpb4coh",
                                                    "parent_id": "t1_hpaslkl",
                                                    "score": -1,
                                                    "created_utc": 1640016870.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "hpb4ke6",
                                                            "parent_id": "t1_hpb4coh",
                                                            "score": 1,
                                                            "created_utc": 1640016962.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It's obvious that I did destroy you, because you \\*still\\* won't re-post any specifics here. And the obvious reason is because you know you'll get destroyed again.\n\nI'll summarize it, since you won't - Bankruptcy Law 101: 7-figure IRA's are preserved in a bankruptcy.\n\nThe reader can judge for themselves. Res ipsa loquitor  :-)",
                                                                    "author": "Nomad_Bill",
                                                                    "id": "hpb5yvv",
                                                                    "parent_id": "t1_hpb4ke6",
                                                                    "score": 0,
                                                                    "created_utc": 1640017546.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "hpb8dlz",
                                                                            "parent_id": "t1_hpb5yvv",
                                                                            "score": 1,
                                                                            "created_utc": 1640018559.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Pro-tip: copy and paste doesn't take any more \"time away from your work\", than posting in this thread does. \n\nCould your responses be any more transparently ridiculous? \n\nLMAO!",
                                                                                    "author": "Nomad_Bill",
                                                                                    "id": "hpb8s8s",
                                                                                    "parent_id": "t1_hpb8dlz",
                                                                                    "score": -1,
                                                                                    "created_utc": 1640018727.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "CGA has a lot of great content on this and I trust him cause he went through it. It’s definitely worth OP looking into. Moving in together this fast is dicey. I hope this doesn’t end badly",
            "author": "UnearthlyDinosaur",
            "id": "hp73rv2",
            "parent_id": "t1_hp6jotb",
            "score": 2,
            "created_utc": 1639939062.0,
            "replies": []
        },
        {
            "body": "sup fam",
            "author": "vtec__",
            "id": "hp7whc2",
            "parent_id": "t1_hp6jotb",
            "score": 1,
            "created_utc": 1639950882.0,
            "replies": []
        },
        {
            "body": "That’s a different dynamic. Perhaps emotionally hands off and allowance/ppm in lieu. That’s also mutually beneficial. figuring out what your partner wants and giving them that makes for a good relationship. \n\nMy own style is more emotionally involved and I look for partners who also want that.",
            "author": "daddoms",
            "id": "hp89uhg",
            "parent_id": "t1_hp88am9",
            "score": 8,
            "created_utc": 1639956725.0,
            "replies": [
                {
                    "body": "I am emotionally attached, but at 60, I am not raising a 3 year old. I never had kids , by choice.",
                    "author": "Smitt727",
                    "id": "hp8a4bo",
                    "parent_id": "t1_hp89uhg",
                    "score": 1,
                    "created_utc": 1639956846.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed.",
            "author": null,
            "id": "hp7veny",
            "parent_id": "t1_hp7v7if",
            "score": 1,
            "created_utc": 1639950435.0,
            "replies": []
        },
        {
            "body": "\"What is her opinion of your other SB's?\"\n\nThey are all friends and get along great.\n\nIn fact my live-in helped me pick out my other two sugar babies.\n\nI wanted to make sure they would all like each other so I gave her veto power over who I chose. We \"auditioned\" about a dozen pots before we found one we both agreed on.\n\nWhen we went to chose my third sugar baby I gave both of them a voice in chosing her.\n\nIt is the only way to have a successful polyamorous relationship.  Eveyone has to get along and there has to be total transparency and honesty.",
            "author": "LuckyINTJ",
            "id": "hp8dsfm",
            "parent_id": "t1_hp843gf",
            "score": 5,
            "created_utc": 1639958496.0,
            "replies": [
                {
                    "body": "My congratulations.",
                    "author": "qwer5r",
                    "id": "hp8gce2",
                    "parent_id": "t1_hp8dsfm",
                    "score": 1,
                    "created_utc": 1639959681.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haha, I've always been vanilla dating all this time, although have to admit that when I'm happy in an SR there are sometimes many-month stretches where I don't really even try.  But sure, I'd couple up again, especially with an older woman who is still attractive enough to be an SB!",
            "author": "Azurecole",
            "id": "hp77nh3",
            "parent_id": "t1_hp77178",
            "score": 3,
            "created_utc": 1639940643.0,
            "replies": []
        },
        {
            "body": "We all create our own hell. 👹",
            "author": "garret6758",
            "id": "hp6wcrp",
            "parent_id": "t1_hp6lrm8",
            "score": 10,
            "created_utc": 1639936099.0,
            "replies": [
                {
                    "body": "This made me lol",
                    "author": "noobNYCsd",
                    "id": "hp78qry",
                    "parent_id": "t1_hp6wcrp",
                    "score": 2,
                    "created_utc": 1639941097.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The 6 foot thing makes me so mad for my guy friends. I've had \\*great\\* luck with men under 6ft, and I guess I can thank all the weird, picky women for leaving the good ones for the rest of us =)",
            "author": "cami_dub",
            "id": "hpd5v0g",
            "parent_id": "t1_hp7w4qj",
            "score": 2,
            "created_utc": 1640047964.0,
            "replies": [
                {
                    "body": "yeah, it sucks..i try not to cop an attitude about it because ive had very attractive women tell me im good looking but the height thing has always been a problem for me and alot of guys in the west..spending your formative years getting shunned doesnt help build confidence at all and in my opinion its hurting alot of millenial and gen Z women because there isnt enough 6 ft tall guys with 6 figure jobs to go around and support the 1950s housewife lifestyle that they want...",
                    "author": "vtec__",
                    "id": "hpd6eus",
                    "parent_id": "t1_hpd5v0g",
                    "score": 1,
                    "created_utc": 1640048221.0,
                    "replies": [
                        {
                            "body": "All I can do is promise you not all of us girls in the west are this disgustingly shallow. Height doesn't say jack about ones personality or worth.",
                            "author": "cami_dub",
                            "id": "hpfhy88",
                            "parent_id": "t1_hpd6eus",
                            "score": 1,
                            "created_utc": 1640098603.0,
                            "replies": [
                                {
                                    "body": "oh for sure, ive met lots of nice ladies on SA but it just seems like the more attractive they are, the worst this trait comes out.",
                                    "author": "vtec__",
                                    "id": "hpgsvp9",
                                    "parent_id": "t1_hpfhy88",
                                    "score": 2,
                                    "created_utc": 1640117534.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "After the fact? It holds less weight than even a normal prenup.\n\nI just find it funny that the guy got married and isn't aware.\n\nHe's not talking about spending the rest of his life with her, when the breakup happens he'll be in for a shock, or, worse yet when he finds out he can't get married to someone else, because he's already married.",
            "author": "ICanOnlyGetSoElect",
            "id": "hp6gump",
            "parent_id": "t1_hp6gmim",
            "score": 2,
            "created_utc": 1639929575.0,
            "replies": [
                {
                    "body": "Hes 31. I doubt he has significant assets. Maybe he does. But whatever. No need to be negative about it. Just wish them well.",
                    "author": null,
                    "id": "hp6k64s",
                    "parent_id": "t1_hp6gump",
                    "score": 6,
                    "created_utc": 1639931039.0,
                    "replies": [
                        {
                            "body": "Nah, its not what he has now, it's when he goes to get married in 10 years, needs a divorce, and the judge splits his assets then, and awards alimony right as he's about to get married.",
                            "author": "ICanOnlyGetSoElect",
                            "id": "hp6kkqw",
                            "parent_id": "t1_hp6k64s",
                            "score": 2,
                            "created_utc": 1639931214.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Uhhh yea, why would you assume I haven’t looked into all of this already? Also, you’re completely unaware if It was a county or city registry or what area it’s in. All of these things are factors. I appreciate your concern, but of course I have these things covered.",
                    "author": "glassjaw90",
                    "id": "hp6j2p9",
                    "parent_id": "t1_hp6gump",
                    "score": 4,
                    "created_utc": 1639930560.0,
                    "replies": [
                        {
                            "body": ">you’re completely unaware if It was a county or city registry or what area it’s in. All of these things are factors\n\nNah, you're unaware that it doesn't matter.\n\nThe jurisdiction you're married in does not determine the jurisdiction she divorces you in. If she moves to Canada for a year, she can file for divorce there.\n\nAny prenup is out the window, and they won't treat it any differently from any other marriage.\n\n>these things are factors\n\nThey're really not.\n\n>I have these things covered.\n\nYou don't.",
                            "author": "ICanOnlyGetSoElect",
                            "id": "hp6jsoe",
                            "parent_id": "t1_hp6j2p9",
                            "score": 0,
                            "created_utc": 1639930876.0,
                            "replies": [
                                {
                                    "body": "You’re right",
                                    "author": "glassjaw90",
                                    "id": "hp6l5c2",
                                    "parent_id": "t1_hp6jsoe",
                                    "score": 2,
                                    "created_utc": 1639931461.0,
                                    "replies": [
                                        {
                                            "body": "You might as well make it official and have a big wedding, since you know, legally you're already married anyways.\n\nBest of luck to you, I hope it works out.",
                                            "author": "ICanOnlyGetSoElect",
                                            "id": "hp6lo3t",
                                            "parent_id": "t1_hp6l5c2",
                                            "score": 1,
                                            "created_utc": 1639931685.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "hp6mmwi",
                                                    "parent_id": "t1_hp6lo3t",
                                                    "score": 2,
                                                    "created_utc": 1639932110.0,
                                                    "replies": [
                                                        {
                                                            "body": "There's a reason OP left him with \"You're right.\"",
                                                            "author": "GACyberCool",
                                                            "id": "hp8spr9",
                                                            "parent_id": "t1_hp6mmwi",
                                                            "score": 2,
                                                            "created_utc": 1639965679.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": ">This is bad legal advice\n\nIt's not legal advice, its awareness of international legal systems.\n\nBut, don't take my word for it:\n\nhttps://travel.state.gov/content/travel/en/international-travel/while-abroad/divorce-abroad.html\n\n>A foreign judgment of divorce generally is recognized in a state in the United States on the basis of legal reciprocity where both parties had notice of the divorce proceeding and an opportunity to be heard within these proceedings. Marriage and divorce generally are considered matters reserved to the states rather than to the federal government.\n\nhttps://travel.state.gov/content/travel/en/international-travel/while-abroad/divorce-abroad/divorce-abroad-legal.html\n\n>a divorce decree issued in a foreign country generally is recognized in a state in the United States on the basis of comity (Hilton v. Guyot, 159 U.S. 113, 163-64 (1895), where both parties had notice of the divorce proceeding and an opportunity to be heard within these proceedings. Under the principle of comity, a divorce obtained in a foreign country under the circumstances described above generally will be recognized by states within the United States. States also may consider the jurisdictional basis upon which the foreign decree is founded and may not recognize the foreign divorce if the court is not satisfied that at least one party was domiciled in the country at the time of the divorce.\n\n>Divorce impacts eligibility for and distribution of federal benefits. Accordingly, the U.S. Social Security Administration, Veterans Administration, and Internal Revenue Service have made determinations regarding the validity of foreign divorces based on the laws of the state of residence applicable with respect to claims for benefits. For Social Security issues, please visit their website. Generally, federal entities apply the law of the state of residence of the beneficiary in question.\n\nFor example, in the UK, civil partnerships:\n\nhttps://www.gov.uk/end-civil-partnership\n\n>How to end your civil partnership\n>You must send paperwork to a court to ask for permission to end your civil partnership.\n\n>Separate from the paperwork, you and your ex-partner may need to work out:\n\n>arrangements for looking after any children\n>child maintenance payments for any children\n>***You also need to divide your money and property. There’s a deadline if you want to make this legally binding.***\n\n>You can usually avoid going to court hearings if you agree about children, money and property and the reasons for ending your civil partnership.\n\nMost countries have rules about who can file for divorce in their country.\n\nMost countries set the line as one of the partners living in that country for a year to be eligible for divorce there.",
                                                            "author": "ICanOnlyGetSoElect",
                                                            "id": "hp6o3rw",
                                                            "parent_id": "t1_hp6mmwi",
                                                            "score": -2,
                                                            "created_utc": 1639932722.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[removed]",
                                                                    "author": null,
                                                                    "id": "hp6pjgt",
                                                                    "parent_id": "t1_hp6o3rw",
                                                                    "score": 8,
                                                                    "created_utc": 1639933318.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Well, you know, many countries signed on to the Hague divorce convention, or are controlled by the Brussels II regulation. So those are pretty standard.\n\nI think you'll find just about any country in the world aside from the Philippines will grant a divorce to anyone who's been a resident for whatever their minimum period of time is (usually a year), and the US will recognize it.",
                                                                            "author": "ICanOnlyGetSoElect",
                                                                            "id": "hp6qajl",
                                                                            "parent_id": "t1_hp6pjgt",
                                                                            "score": 1,
                                                                            "created_utc": 1639933622.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly. That's why I do allowances only. No vanilla dating.\n\nBut remember, just because you pay an allowance, that doesn't automatically preclude family court involvement. You need to be careful you don't meet your jurisdiction's rules (based on case law), of what constitutes a common law marriage, if you do any overnight stays.\n\nThat definition is becoming wider as time goes on, based on court rulings. Just something to be aware of. I keep track of the case law on this issue.",
            "author": "Nomad_Bill",
            "id": "hp6re6b",
            "parent_id": "t1_hp6q2xq",
            "score": 0,
            "created_utc": 1639934079.0,
            "replies": []
        },
        {
            "body": "\\^Hey, it's the forum troll. He's back!  ... LOL\n\n(Bankruptcy Law 101: 7-figure IRA's are kept in a bankruptcy)",
            "author": "Nomad_Bill",
            "id": "hp6udky",
            "parent_id": "t1_hp6twal",
            "score": -5,
            "created_utc": 1639935291.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hp7m1iy",
                    "parent_id": "t1_hp6udky",
                    "score": 4,
                    "created_utc": 1639946541.0,
                    "replies": [
                        {
                            "body": "He is also this sub’s leading expert on not responding to requests to link to studies that support ivermectin and HCQ therapies for Covid-19 that have not been subsequently retracted or discredited. \n\n*“Do your own research!”* \n🙄",
                            "author": "Chill_SD1974",
                            "id": "hp9ecaa",
                            "parent_id": "t1_hp7m1iy",
                            "score": 2,
                            "created_utc": 1639976699.0,
                            "replies": []
                        },
                        {
                            "body": "\\^Trollin, trolling, trollin\n\nBankruptcy Law 101: 7-figure IRA's are kept in a bankruptcy\n\n:-)",
                            "author": "Nomad_Bill",
                            "id": "hp81iu7",
                            "parent_id": "t1_hp7m1iy",
                            "score": -3,
                            "created_utc": 1639953054.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hpaslkl",
                                    "parent_id": "t1_hp81iu7",
                                    "score": 2,
                                    "created_utc": 1640011668.0,
                                    "replies": [
                                        {
                                            "body": "I clearly destroyed your argument in that thread, which anyone can clearly see. And that's exactly why you didn't re-post any specifics of it in this thread, because you know you'll get destroyed again. \n\nBankruptcy Law 101: 7-figure IRA's are preserved in a bankruptcy.",
                                            "author": "Nomad_Bill",
                                            "id": "hpb4coh",
                                            "parent_id": "t1_hpaslkl",
                                            "score": -1,
                                            "created_utc": 1640016870.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "hpb4ke6",
                                                    "parent_id": "t1_hpb4coh",
                                                    "score": 1,
                                                    "created_utc": 1640016962.0,
                                                    "replies": [
                                                        {
                                                            "body": "It's obvious that I did destroy you, because you \\*still\\* won't re-post any specifics here. And the obvious reason is because you know you'll get destroyed again.\n\nI'll summarize it, since you won't - Bankruptcy Law 101: 7-figure IRA's are preserved in a bankruptcy.\n\nThe reader can judge for themselves. Res ipsa loquitor  :-)",
                                                            "author": "Nomad_Bill",
                                                            "id": "hpb5yvv",
                                                            "parent_id": "t1_hpb4ke6",
                                                            "score": 0,
                                                            "created_utc": 1640017546.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "hpb8dlz",
                                                                    "parent_id": "t1_hpb5yvv",
                                                                    "score": 1,
                                                                    "created_utc": 1640018559.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Pro-tip: copy and paste doesn't take any more \"time away from your work\", than posting in this thread does. \n\nCould your responses be any more transparently ridiculous? \n\nLMAO!",
                                                                            "author": "Nomad_Bill",
                                                                            "id": "hpb8s8s",
                                                                            "parent_id": "t1_hpb8dlz",
                                                                            "score": -1,
                                                                            "created_utc": 1640018727.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am emotionally attached, but at 60, I am not raising a 3 year old. I never had kids , by choice.",
            "author": "Smitt727",
            "id": "hp8a4bo",
            "parent_id": "t1_hp89uhg",
            "score": 1,
            "created_utc": 1639956846.0,
            "replies": []
        },
        {
            "body": "My congratulations.",
            "author": "qwer5r",
            "id": "hp8gce2",
            "parent_id": "t1_hp8dsfm",
            "score": 1,
            "created_utc": 1639959681.0,
            "replies": []
        },
        {
            "body": "This made me lol",
            "author": "noobNYCsd",
            "id": "hp78qry",
            "parent_id": "t1_hp6wcrp",
            "score": 2,
            "created_utc": 1639941097.0,
            "replies": []
        },
        {
            "body": "yeah, it sucks..i try not to cop an attitude about it because ive had very attractive women tell me im good looking but the height thing has always been a problem for me and alot of guys in the west..spending your formative years getting shunned doesnt help build confidence at all and in my opinion its hurting alot of millenial and gen Z women because there isnt enough 6 ft tall guys with 6 figure jobs to go around and support the 1950s housewife lifestyle that they want...",
            "author": "vtec__",
            "id": "hpd6eus",
            "parent_id": "t1_hpd5v0g",
            "score": 1,
            "created_utc": 1640048221.0,
            "replies": [
                {
                    "body": "All I can do is promise you not all of us girls in the west are this disgustingly shallow. Height doesn't say jack about ones personality or worth.",
                    "author": "cami_dub",
                    "id": "hpfhy88",
                    "parent_id": "t1_hpd6eus",
                    "score": 1,
                    "created_utc": 1640098603.0,
                    "replies": [
                        {
                            "body": "oh for sure, ive met lots of nice ladies on SA but it just seems like the more attractive they are, the worst this trait comes out.",
                            "author": "vtec__",
                            "id": "hpgsvp9",
                            "parent_id": "t1_hpfhy88",
                            "score": 2,
                            "created_utc": 1640117534.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hes 31. I doubt he has significant assets. Maybe he does. But whatever. No need to be negative about it. Just wish them well.",
            "author": null,
            "id": "hp6k64s",
            "parent_id": "t1_hp6gump",
            "score": 6,
            "created_utc": 1639931039.0,
            "replies": [
                {
                    "body": "Nah, its not what he has now, it's when he goes to get married in 10 years, needs a divorce, and the judge splits his assets then, and awards alimony right as he's about to get married.",
                    "author": "ICanOnlyGetSoElect",
                    "id": "hp6kkqw",
                    "parent_id": "t1_hp6k64s",
                    "score": 2,
                    "created_utc": 1639931214.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Uhhh yea, why would you assume I haven’t looked into all of this already? Also, you’re completely unaware if It was a county or city registry or what area it’s in. All of these things are factors. I appreciate your concern, but of course I have these things covered.",
            "author": "glassjaw90",
            "id": "hp6j2p9",
            "parent_id": "t1_hp6gump",
            "score": 4,
            "created_utc": 1639930560.0,
            "replies": [
                {
                    "body": ">you’re completely unaware if It was a county or city registry or what area it’s in. All of these things are factors\n\nNah, you're unaware that it doesn't matter.\n\nThe jurisdiction you're married in does not determine the jurisdiction she divorces you in. If she moves to Canada for a year, she can file for divorce there.\n\nAny prenup is out the window, and they won't treat it any differently from any other marriage.\n\n>these things are factors\n\nThey're really not.\n\n>I have these things covered.\n\nYou don't.",
                    "author": "ICanOnlyGetSoElect",
                    "id": "hp6jsoe",
                    "parent_id": "t1_hp6j2p9",
                    "score": 0,
                    "created_utc": 1639930876.0,
                    "replies": [
                        {
                            "body": "You’re right",
                            "author": "glassjaw90",
                            "id": "hp6l5c2",
                            "parent_id": "t1_hp6jsoe",
                            "score": 2,
                            "created_utc": 1639931461.0,
                            "replies": [
                                {
                                    "body": "You might as well make it official and have a big wedding, since you know, legally you're already married anyways.\n\nBest of luck to you, I hope it works out.",
                                    "author": "ICanOnlyGetSoElect",
                                    "id": "hp6lo3t",
                                    "parent_id": "t1_hp6l5c2",
                                    "score": 1,
                                    "created_utc": 1639931685.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "hp6mmwi",
                                            "parent_id": "t1_hp6lo3t",
                                            "score": 2,
                                            "created_utc": 1639932110.0,
                                            "replies": [
                                                {
                                                    "body": "There's a reason OP left him with \"You're right.\"",
                                                    "author": "GACyberCool",
                                                    "id": "hp8spr9",
                                                    "parent_id": "t1_hp6mmwi",
                                                    "score": 2,
                                                    "created_utc": 1639965679.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": ">This is bad legal advice\n\nIt's not legal advice, its awareness of international legal systems.\n\nBut, don't take my word for it:\n\nhttps://travel.state.gov/content/travel/en/international-travel/while-abroad/divorce-abroad.html\n\n>A foreign judgment of divorce generally is recognized in a state in the United States on the basis of legal reciprocity where both parties had notice of the divorce proceeding and an opportunity to be heard within these proceedings. Marriage and divorce generally are considered matters reserved to the states rather than to the federal government.\n\nhttps://travel.state.gov/content/travel/en/international-travel/while-abroad/divorce-abroad/divorce-abroad-legal.html\n\n>a divorce decree issued in a foreign country generally is recognized in a state in the United States on the basis of comity (Hilton v. Guyot, 159 U.S. 113, 163-64 (1895), where both parties had notice of the divorce proceeding and an opportunity to be heard within these proceedings. Under the principle of comity, a divorce obtained in a foreign country under the circumstances described above generally will be recognized by states within the United States. States also may consider the jurisdictional basis upon which the foreign decree is founded and may not recognize the foreign divorce if the court is not satisfied that at least one party was domiciled in the country at the time of the divorce.\n\n>Divorce impacts eligibility for and distribution of federal benefits. Accordingly, the U.S. Social Security Administration, Veterans Administration, and Internal Revenue Service have made determinations regarding the validity of foreign divorces based on the laws of the state of residence applicable with respect to claims for benefits. For Social Security issues, please visit their website. Generally, federal entities apply the law of the state of residence of the beneficiary in question.\n\nFor example, in the UK, civil partnerships:\n\nhttps://www.gov.uk/end-civil-partnership\n\n>How to end your civil partnership\n>You must send paperwork to a court to ask for permission to end your civil partnership.\n\n>Separate from the paperwork, you and your ex-partner may need to work out:\n\n>arrangements for looking after any children\n>child maintenance payments for any children\n>***You also need to divide your money and property. There’s a deadline if you want to make this legally binding.***\n\n>You can usually avoid going to court hearings if you agree about children, money and property and the reasons for ending your civil partnership.\n\nMost countries have rules about who can file for divorce in their country.\n\nMost countries set the line as one of the partners living in that country for a year to be eligible for divorce there.",
                                                    "author": "ICanOnlyGetSoElect",
                                                    "id": "hp6o3rw",
                                                    "parent_id": "t1_hp6mmwi",
                                                    "score": -2,
                                                    "created_utc": 1639932722.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "hp6pjgt",
                                                            "parent_id": "t1_hp6o3rw",
                                                            "score": 8,
                                                            "created_utc": 1639933318.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Well, you know, many countries signed on to the Hague divorce convention, or are controlled by the Brussels II regulation. So those are pretty standard.\n\nI think you'll find just about any country in the world aside from the Philippines will grant a divorce to anyone who's been a resident for whatever their minimum period of time is (usually a year), and the US will recognize it.",
                                                                    "author": "ICanOnlyGetSoElect",
                                                                    "id": "hp6qajl",
                                                                    "parent_id": "t1_hp6pjgt",
                                                                    "score": 1,
                                                                    "created_utc": 1639933622.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hp7m1iy",
            "parent_id": "t1_hp6udky",
            "score": 4,
            "created_utc": 1639946541.0,
            "replies": [
                {
                    "body": "He is also this sub’s leading expert on not responding to requests to link to studies that support ivermectin and HCQ therapies for Covid-19 that have not been subsequently retracted or discredited. \n\n*“Do your own research!”* \n🙄",
                    "author": "Chill_SD1974",
                    "id": "hp9ecaa",
                    "parent_id": "t1_hp7m1iy",
                    "score": 2,
                    "created_utc": 1639976699.0,
                    "replies": []
                },
                {
                    "body": "\\^Trollin, trolling, trollin\n\nBankruptcy Law 101: 7-figure IRA's are kept in a bankruptcy\n\n:-)",
                    "author": "Nomad_Bill",
                    "id": "hp81iu7",
                    "parent_id": "t1_hp7m1iy",
                    "score": -3,
                    "created_utc": 1639953054.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hpaslkl",
                            "parent_id": "t1_hp81iu7",
                            "score": 2,
                            "created_utc": 1640011668.0,
                            "replies": [
                                {
                                    "body": "I clearly destroyed your argument in that thread, which anyone can clearly see. And that's exactly why you didn't re-post any specifics of it in this thread, because you know you'll get destroyed again. \n\nBankruptcy Law 101: 7-figure IRA's are preserved in a bankruptcy.",
                                    "author": "Nomad_Bill",
                                    "id": "hpb4coh",
                                    "parent_id": "t1_hpaslkl",
                                    "score": -1,
                                    "created_utc": 1640016870.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hpb4ke6",
                                            "parent_id": "t1_hpb4coh",
                                            "score": 1,
                                            "created_utc": 1640016962.0,
                                            "replies": [
                                                {
                                                    "body": "It's obvious that I did destroy you, because you \\*still\\* won't re-post any specifics here. And the obvious reason is because you know you'll get destroyed again.\n\nI'll summarize it, since you won't - Bankruptcy Law 101: 7-figure IRA's are preserved in a bankruptcy.\n\nThe reader can judge for themselves. Res ipsa loquitor  :-)",
                                                    "author": "Nomad_Bill",
                                                    "id": "hpb5yvv",
                                                    "parent_id": "t1_hpb4ke6",
                                                    "score": 0,
                                                    "created_utc": 1640017546.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "hpb8dlz",
                                                            "parent_id": "t1_hpb5yvv",
                                                            "score": 1,
                                                            "created_utc": 1640018559.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Pro-tip: copy and paste doesn't take any more \"time away from your work\", than posting in this thread does. \n\nCould your responses be any more transparently ridiculous? \n\nLMAO!",
                                                                    "author": "Nomad_Bill",
                                                                    "id": "hpb8s8s",
                                                                    "parent_id": "t1_hpb8dlz",
                                                                    "score": -1,
                                                                    "created_utc": 1640018727.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "All I can do is promise you not all of us girls in the west are this disgustingly shallow. Height doesn't say jack about ones personality or worth.",
            "author": "cami_dub",
            "id": "hpfhy88",
            "parent_id": "t1_hpd6eus",
            "score": 1,
            "created_utc": 1640098603.0,
            "replies": [
                {
                    "body": "oh for sure, ive met lots of nice ladies on SA but it just seems like the more attractive they are, the worst this trait comes out.",
                    "author": "vtec__",
                    "id": "hpgsvp9",
                    "parent_id": "t1_hpfhy88",
                    "score": 2,
                    "created_utc": 1640117534.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nah, its not what he has now, it's when he goes to get married in 10 years, needs a divorce, and the judge splits his assets then, and awards alimony right as he's about to get married.",
            "author": "ICanOnlyGetSoElect",
            "id": "hp6kkqw",
            "parent_id": "t1_hp6k64s",
            "score": 2,
            "created_utc": 1639931214.0,
            "replies": []
        },
        {
            "body": ">you’re completely unaware if It was a county or city registry or what area it’s in. All of these things are factors\n\nNah, you're unaware that it doesn't matter.\n\nThe jurisdiction you're married in does not determine the jurisdiction she divorces you in. If she moves to Canada for a year, she can file for divorce there.\n\nAny prenup is out the window, and they won't treat it any differently from any other marriage.\n\n>these things are factors\n\nThey're really not.\n\n>I have these things covered.\n\nYou don't.",
            "author": "ICanOnlyGetSoElect",
            "id": "hp6jsoe",
            "parent_id": "t1_hp6j2p9",
            "score": 0,
            "created_utc": 1639930876.0,
            "replies": [
                {
                    "body": "You’re right",
                    "author": "glassjaw90",
                    "id": "hp6l5c2",
                    "parent_id": "t1_hp6jsoe",
                    "score": 2,
                    "created_utc": 1639931461.0,
                    "replies": [
                        {
                            "body": "You might as well make it official and have a big wedding, since you know, legally you're already married anyways.\n\nBest of luck to you, I hope it works out.",
                            "author": "ICanOnlyGetSoElect",
                            "id": "hp6lo3t",
                            "parent_id": "t1_hp6l5c2",
                            "score": 1,
                            "created_utc": 1639931685.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "hp6mmwi",
                                    "parent_id": "t1_hp6lo3t",
                                    "score": 2,
                                    "created_utc": 1639932110.0,
                                    "replies": [
                                        {
                                            "body": "There's a reason OP left him with \"You're right.\"",
                                            "author": "GACyberCool",
                                            "id": "hp8spr9",
                                            "parent_id": "t1_hp6mmwi",
                                            "score": 2,
                                            "created_utc": 1639965679.0,
                                            "replies": []
                                        },
                                        {
                                            "body": ">This is bad legal advice\n\nIt's not legal advice, its awareness of international legal systems.\n\nBut, don't take my word for it:\n\nhttps://travel.state.gov/content/travel/en/international-travel/while-abroad/divorce-abroad.html\n\n>A foreign judgment of divorce generally is recognized in a state in the United States on the basis of legal reciprocity where both parties had notice of the divorce proceeding and an opportunity to be heard within these proceedings. Marriage and divorce generally are considered matters reserved to the states rather than to the federal government.\n\nhttps://travel.state.gov/content/travel/en/international-travel/while-abroad/divorce-abroad/divorce-abroad-legal.html\n\n>a divorce decree issued in a foreign country generally is recognized in a state in the United States on the basis of comity (Hilton v. Guyot, 159 U.S. 113, 163-64 (1895), where both parties had notice of the divorce proceeding and an opportunity to be heard within these proceedings. Under the principle of comity, a divorce obtained in a foreign country under the circumstances described above generally will be recognized by states within the United States. States also may consider the jurisdictional basis upon which the foreign decree is founded and may not recognize the foreign divorce if the court is not satisfied that at least one party was domiciled in the country at the time of the divorce.\n\n>Divorce impacts eligibility for and distribution of federal benefits. Accordingly, the U.S. Social Security Administration, Veterans Administration, and Internal Revenue Service have made determinations regarding the validity of foreign divorces based on the laws of the state of residence applicable with respect to claims for benefits. For Social Security issues, please visit their website. Generally, federal entities apply the law of the state of residence of the beneficiary in question.\n\nFor example, in the UK, civil partnerships:\n\nhttps://www.gov.uk/end-civil-partnership\n\n>How to end your civil partnership\n>You must send paperwork to a court to ask for permission to end your civil partnership.\n\n>Separate from the paperwork, you and your ex-partner may need to work out:\n\n>arrangements for looking after any children\n>child maintenance payments for any children\n>***You also need to divide your money and property. There’s a deadline if you want to make this legally binding.***\n\n>You can usually avoid going to court hearings if you agree about children, money and property and the reasons for ending your civil partnership.\n\nMost countries have rules about who can file for divorce in their country.\n\nMost countries set the line as one of the partners living in that country for a year to be eligible for divorce there.",
                                            "author": "ICanOnlyGetSoElect",
                                            "id": "hp6o3rw",
                                            "parent_id": "t1_hp6mmwi",
                                            "score": -2,
                                            "created_utc": 1639932722.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "hp6pjgt",
                                                    "parent_id": "t1_hp6o3rw",
                                                    "score": 8,
                                                    "created_utc": 1639933318.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well, you know, many countries signed on to the Hague divorce convention, or are controlled by the Brussels II regulation. So those are pretty standard.\n\nI think you'll find just about any country in the world aside from the Philippines will grant a divorce to anyone who's been a resident for whatever their minimum period of time is (usually a year), and the US will recognize it.",
                                                            "author": "ICanOnlyGetSoElect",
                                                            "id": "hp6qajl",
                                                            "parent_id": "t1_hp6pjgt",
                                                            "score": 1,
                                                            "created_utc": 1639933622.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He is also this sub’s leading expert on not responding to requests to link to studies that support ivermectin and HCQ therapies for Covid-19 that have not been subsequently retracted or discredited. \n\n*“Do your own research!”* \n🙄",
            "author": "Chill_SD1974",
            "id": "hp9ecaa",
            "parent_id": "t1_hp7m1iy",
            "score": 2,
            "created_utc": 1639976699.0,
            "replies": []
        },
        {
            "body": "\\^Trollin, trolling, trollin\n\nBankruptcy Law 101: 7-figure IRA's are kept in a bankruptcy\n\n:-)",
            "author": "Nomad_Bill",
            "id": "hp81iu7",
            "parent_id": "t1_hp7m1iy",
            "score": -3,
            "created_utc": 1639953054.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hpaslkl",
                    "parent_id": "t1_hp81iu7",
                    "score": 2,
                    "created_utc": 1640011668.0,
                    "replies": [
                        {
                            "body": "I clearly destroyed your argument in that thread, which anyone can clearly see. And that's exactly why you didn't re-post any specifics of it in this thread, because you know you'll get destroyed again. \n\nBankruptcy Law 101: 7-figure IRA's are preserved in a bankruptcy.",
                            "author": "Nomad_Bill",
                            "id": "hpb4coh",
                            "parent_id": "t1_hpaslkl",
                            "score": -1,
                            "created_utc": 1640016870.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hpb4ke6",
                                    "parent_id": "t1_hpb4coh",
                                    "score": 1,
                                    "created_utc": 1640016962.0,
                                    "replies": [
                                        {
                                            "body": "It's obvious that I did destroy you, because you \\*still\\* won't re-post any specifics here. And the obvious reason is because you know you'll get destroyed again.\n\nI'll summarize it, since you won't - Bankruptcy Law 101: 7-figure IRA's are preserved in a bankruptcy.\n\nThe reader can judge for themselves. Res ipsa loquitor  :-)",
                                            "author": "Nomad_Bill",
                                            "id": "hpb5yvv",
                                            "parent_id": "t1_hpb4ke6",
                                            "score": 0,
                                            "created_utc": 1640017546.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "hpb8dlz",
                                                    "parent_id": "t1_hpb5yvv",
                                                    "score": 1,
                                                    "created_utc": 1640018559.0,
                                                    "replies": [
                                                        {
                                                            "body": "Pro-tip: copy and paste doesn't take any more \"time away from your work\", than posting in this thread does. \n\nCould your responses be any more transparently ridiculous? \n\nLMAO!",
                                                            "author": "Nomad_Bill",
                                                            "id": "hpb8s8s",
                                                            "parent_id": "t1_hpb8dlz",
                                                            "score": -1,
                                                            "created_utc": 1640018727.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "oh for sure, ive met lots of nice ladies on SA but it just seems like the more attractive they are, the worst this trait comes out.",
            "author": "vtec__",
            "id": "hpgsvp9",
            "parent_id": "t1_hpfhy88",
            "score": 2,
            "created_utc": 1640117534.0,
            "replies": []
        },
        {
            "body": "You’re right",
            "author": "glassjaw90",
            "id": "hp6l5c2",
            "parent_id": "t1_hp6jsoe",
            "score": 2,
            "created_utc": 1639931461.0,
            "replies": [
                {
                    "body": "You might as well make it official and have a big wedding, since you know, legally you're already married anyways.\n\nBest of luck to you, I hope it works out.",
                    "author": "ICanOnlyGetSoElect",
                    "id": "hp6lo3t",
                    "parent_id": "t1_hp6l5c2",
                    "score": 1,
                    "created_utc": 1639931685.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "hp6mmwi",
                            "parent_id": "t1_hp6lo3t",
                            "score": 2,
                            "created_utc": 1639932110.0,
                            "replies": [
                                {
                                    "body": "There's a reason OP left him with \"You're right.\"",
                                    "author": "GACyberCool",
                                    "id": "hp8spr9",
                                    "parent_id": "t1_hp6mmwi",
                                    "score": 2,
                                    "created_utc": 1639965679.0,
                                    "replies": []
                                },
                                {
                                    "body": ">This is bad legal advice\n\nIt's not legal advice, its awareness of international legal systems.\n\nBut, don't take my word for it:\n\nhttps://travel.state.gov/content/travel/en/international-travel/while-abroad/divorce-abroad.html\n\n>A foreign judgment of divorce generally is recognized in a state in the United States on the basis of legal reciprocity where both parties had notice of the divorce proceeding and an opportunity to be heard within these proceedings. Marriage and divorce generally are considered matters reserved to the states rather than to the federal government.\n\nhttps://travel.state.gov/content/travel/en/international-travel/while-abroad/divorce-abroad/divorce-abroad-legal.html\n\n>a divorce decree issued in a foreign country generally is recognized in a state in the United States on the basis of comity (Hilton v. Guyot, 159 U.S. 113, 163-64 (1895), where both parties had notice of the divorce proceeding and an opportunity to be heard within these proceedings. Under the principle of comity, a divorce obtained in a foreign country under the circumstances described above generally will be recognized by states within the United States. States also may consider the jurisdictional basis upon which the foreign decree is founded and may not recognize the foreign divorce if the court is not satisfied that at least one party was domiciled in the country at the time of the divorce.\n\n>Divorce impacts eligibility for and distribution of federal benefits. Accordingly, the U.S. Social Security Administration, Veterans Administration, and Internal Revenue Service have made determinations regarding the validity of foreign divorces based on the laws of the state of residence applicable with respect to claims for benefits. For Social Security issues, please visit their website. Generally, federal entities apply the law of the state of residence of the beneficiary in question.\n\nFor example, in the UK, civil partnerships:\n\nhttps://www.gov.uk/end-civil-partnership\n\n>How to end your civil partnership\n>You must send paperwork to a court to ask for permission to end your civil partnership.\n\n>Separate from the paperwork, you and your ex-partner may need to work out:\n\n>arrangements for looking after any children\n>child maintenance payments for any children\n>***You also need to divide your money and property. There’s a deadline if you want to make this legally binding.***\n\n>You can usually avoid going to court hearings if you agree about children, money and property and the reasons for ending your civil partnership.\n\nMost countries have rules about who can file for divorce in their country.\n\nMost countries set the line as one of the partners living in that country for a year to be eligible for divorce there.",
                                    "author": "ICanOnlyGetSoElect",
                                    "id": "hp6o3rw",
                                    "parent_id": "t1_hp6mmwi",
                                    "score": -2,
                                    "created_utc": 1639932722.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "hp6pjgt",
                                            "parent_id": "t1_hp6o3rw",
                                            "score": 8,
                                            "created_utc": 1639933318.0,
                                            "replies": [
                                                {
                                                    "body": "Well, you know, many countries signed on to the Hague divorce convention, or are controlled by the Brussels II regulation. So those are pretty standard.\n\nI think you'll find just about any country in the world aside from the Philippines will grant a divorce to anyone who's been a resident for whatever their minimum period of time is (usually a year), and the US will recognize it.",
                                                    "author": "ICanOnlyGetSoElect",
                                                    "id": "hp6qajl",
                                                    "parent_id": "t1_hp6pjgt",
                                                    "score": 1,
                                                    "created_utc": 1639933622.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hpaslkl",
            "parent_id": "t1_hp81iu7",
            "score": 2,
            "created_utc": 1640011668.0,
            "replies": [
                {
                    "body": "I clearly destroyed your argument in that thread, which anyone can clearly see. And that's exactly why you didn't re-post any specifics of it in this thread, because you know you'll get destroyed again. \n\nBankruptcy Law 101: 7-figure IRA's are preserved in a bankruptcy.",
                    "author": "Nomad_Bill",
                    "id": "hpb4coh",
                    "parent_id": "t1_hpaslkl",
                    "score": -1,
                    "created_utc": 1640016870.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hpb4ke6",
                            "parent_id": "t1_hpb4coh",
                            "score": 1,
                            "created_utc": 1640016962.0,
                            "replies": [
                                {
                                    "body": "It's obvious that I did destroy you, because you \\*still\\* won't re-post any specifics here. And the obvious reason is because you know you'll get destroyed again.\n\nI'll summarize it, since you won't - Bankruptcy Law 101: 7-figure IRA's are preserved in a bankruptcy.\n\nThe reader can judge for themselves. Res ipsa loquitor  :-)",
                                    "author": "Nomad_Bill",
                                    "id": "hpb5yvv",
                                    "parent_id": "t1_hpb4ke6",
                                    "score": 0,
                                    "created_utc": 1640017546.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hpb8dlz",
                                            "parent_id": "t1_hpb5yvv",
                                            "score": 1,
                                            "created_utc": 1640018559.0,
                                            "replies": [
                                                {
                                                    "body": "Pro-tip: copy and paste doesn't take any more \"time away from your work\", than posting in this thread does. \n\nCould your responses be any more transparently ridiculous? \n\nLMAO!",
                                                    "author": "Nomad_Bill",
                                                    "id": "hpb8s8s",
                                                    "parent_id": "t1_hpb8dlz",
                                                    "score": -1,
                                                    "created_utc": 1640018727.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You might as well make it official and have a big wedding, since you know, legally you're already married anyways.\n\nBest of luck to you, I hope it works out.",
            "author": "ICanOnlyGetSoElect",
            "id": "hp6lo3t",
            "parent_id": "t1_hp6l5c2",
            "score": 1,
            "created_utc": 1639931685.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "hp6mmwi",
                    "parent_id": "t1_hp6lo3t",
                    "score": 2,
                    "created_utc": 1639932110.0,
                    "replies": [
                        {
                            "body": "There's a reason OP left him with \"You're right.\"",
                            "author": "GACyberCool",
                            "id": "hp8spr9",
                            "parent_id": "t1_hp6mmwi",
                            "score": 2,
                            "created_utc": 1639965679.0,
                            "replies": []
                        },
                        {
                            "body": ">This is bad legal advice\n\nIt's not legal advice, its awareness of international legal systems.\n\nBut, don't take my word for it:\n\nhttps://travel.state.gov/content/travel/en/international-travel/while-abroad/divorce-abroad.html\n\n>A foreign judgment of divorce generally is recognized in a state in the United States on the basis of legal reciprocity where both parties had notice of the divorce proceeding and an opportunity to be heard within these proceedings. Marriage and divorce generally are considered matters reserved to the states rather than to the federal government.\n\nhttps://travel.state.gov/content/travel/en/international-travel/while-abroad/divorce-abroad/divorce-abroad-legal.html\n\n>a divorce decree issued in a foreign country generally is recognized in a state in the United States on the basis of comity (Hilton v. Guyot, 159 U.S. 113, 163-64 (1895), where both parties had notice of the divorce proceeding and an opportunity to be heard within these proceedings. Under the principle of comity, a divorce obtained in a foreign country under the circumstances described above generally will be recognized by states within the United States. States also may consider the jurisdictional basis upon which the foreign decree is founded and may not recognize the foreign divorce if the court is not satisfied that at least one party was domiciled in the country at the time of the divorce.\n\n>Divorce impacts eligibility for and distribution of federal benefits. Accordingly, the U.S. Social Security Administration, Veterans Administration, and Internal Revenue Service have made determinations regarding the validity of foreign divorces based on the laws of the state of residence applicable with respect to claims for benefits. For Social Security issues, please visit their website. Generally, federal entities apply the law of the state of residence of the beneficiary in question.\n\nFor example, in the UK, civil partnerships:\n\nhttps://www.gov.uk/end-civil-partnership\n\n>How to end your civil partnership\n>You must send paperwork to a court to ask for permission to end your civil partnership.\n\n>Separate from the paperwork, you and your ex-partner may need to work out:\n\n>arrangements for looking after any children\n>child maintenance payments for any children\n>***You also need to divide your money and property. There’s a deadline if you want to make this legally binding.***\n\n>You can usually avoid going to court hearings if you agree about children, money and property and the reasons for ending your civil partnership.\n\nMost countries have rules about who can file for divorce in their country.\n\nMost countries set the line as one of the partners living in that country for a year to be eligible for divorce there.",
                            "author": "ICanOnlyGetSoElect",
                            "id": "hp6o3rw",
                            "parent_id": "t1_hp6mmwi",
                            "score": -2,
                            "created_utc": 1639932722.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "hp6pjgt",
                                    "parent_id": "t1_hp6o3rw",
                                    "score": 8,
                                    "created_utc": 1639933318.0,
                                    "replies": [
                                        {
                                            "body": "Well, you know, many countries signed on to the Hague divorce convention, or are controlled by the Brussels II regulation. So those are pretty standard.\n\nI think you'll find just about any country in the world aside from the Philippines will grant a divorce to anyone who's been a resident for whatever their minimum period of time is (usually a year), and the US will recognize it.",
                                            "author": "ICanOnlyGetSoElect",
                                            "id": "hp6qajl",
                                            "parent_id": "t1_hp6pjgt",
                                            "score": 1,
                                            "created_utc": 1639933622.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I clearly destroyed your argument in that thread, which anyone can clearly see. And that's exactly why you didn't re-post any specifics of it in this thread, because you know you'll get destroyed again. \n\nBankruptcy Law 101: 7-figure IRA's are preserved in a bankruptcy.",
            "author": "Nomad_Bill",
            "id": "hpb4coh",
            "parent_id": "t1_hpaslkl",
            "score": -1,
            "created_utc": 1640016870.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hpb4ke6",
                    "parent_id": "t1_hpb4coh",
                    "score": 1,
                    "created_utc": 1640016962.0,
                    "replies": [
                        {
                            "body": "It's obvious that I did destroy you, because you \\*still\\* won't re-post any specifics here. And the obvious reason is because you know you'll get destroyed again.\n\nI'll summarize it, since you won't - Bankruptcy Law 101: 7-figure IRA's are preserved in a bankruptcy.\n\nThe reader can judge for themselves. Res ipsa loquitor  :-)",
                            "author": "Nomad_Bill",
                            "id": "hpb5yvv",
                            "parent_id": "t1_hpb4ke6",
                            "score": 0,
                            "created_utc": 1640017546.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hpb8dlz",
                                    "parent_id": "t1_hpb5yvv",
                                    "score": 1,
                                    "created_utc": 1640018559.0,
                                    "replies": [
                                        {
                                            "body": "Pro-tip: copy and paste doesn't take any more \"time away from your work\", than posting in this thread does. \n\nCould your responses be any more transparently ridiculous? \n\nLMAO!",
                                            "author": "Nomad_Bill",
                                            "id": "hpb8s8s",
                                            "parent_id": "t1_hpb8dlz",
                                            "score": -1,
                                            "created_utc": 1640018727.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hp6mmwi",
            "parent_id": "t1_hp6lo3t",
            "score": 2,
            "created_utc": 1639932110.0,
            "replies": [
                {
                    "body": "There's a reason OP left him with \"You're right.\"",
                    "author": "GACyberCool",
                    "id": "hp8spr9",
                    "parent_id": "t1_hp6mmwi",
                    "score": 2,
                    "created_utc": 1639965679.0,
                    "replies": []
                },
                {
                    "body": ">This is bad legal advice\n\nIt's not legal advice, its awareness of international legal systems.\n\nBut, don't take my word for it:\n\nhttps://travel.state.gov/content/travel/en/international-travel/while-abroad/divorce-abroad.html\n\n>A foreign judgment of divorce generally is recognized in a state in the United States on the basis of legal reciprocity where both parties had notice of the divorce proceeding and an opportunity to be heard within these proceedings. Marriage and divorce generally are considered matters reserved to the states rather than to the federal government.\n\nhttps://travel.state.gov/content/travel/en/international-travel/while-abroad/divorce-abroad/divorce-abroad-legal.html\n\n>a divorce decree issued in a foreign country generally is recognized in a state in the United States on the basis of comity (Hilton v. Guyot, 159 U.S. 113, 163-64 (1895), where both parties had notice of the divorce proceeding and an opportunity to be heard within these proceedings. Under the principle of comity, a divorce obtained in a foreign country under the circumstances described above generally will be recognized by states within the United States. States also may consider the jurisdictional basis upon which the foreign decree is founded and may not recognize the foreign divorce if the court is not satisfied that at least one party was domiciled in the country at the time of the divorce.\n\n>Divorce impacts eligibility for and distribution of federal benefits. Accordingly, the U.S. Social Security Administration, Veterans Administration, and Internal Revenue Service have made determinations regarding the validity of foreign divorces based on the laws of the state of residence applicable with respect to claims for benefits. For Social Security issues, please visit their website. Generally, federal entities apply the law of the state of residence of the beneficiary in question.\n\nFor example, in the UK, civil partnerships:\n\nhttps://www.gov.uk/end-civil-partnership\n\n>How to end your civil partnership\n>You must send paperwork to a court to ask for permission to end your civil partnership.\n\n>Separate from the paperwork, you and your ex-partner may need to work out:\n\n>arrangements for looking after any children\n>child maintenance payments for any children\n>***You also need to divide your money and property. There’s a deadline if you want to make this legally binding.***\n\n>You can usually avoid going to court hearings if you agree about children, money and property and the reasons for ending your civil partnership.\n\nMost countries have rules about who can file for divorce in their country.\n\nMost countries set the line as one of the partners living in that country for a year to be eligible for divorce there.",
                    "author": "ICanOnlyGetSoElect",
                    "id": "hp6o3rw",
                    "parent_id": "t1_hp6mmwi",
                    "score": -2,
                    "created_utc": 1639932722.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "hp6pjgt",
                            "parent_id": "t1_hp6o3rw",
                            "score": 8,
                            "created_utc": 1639933318.0,
                            "replies": [
                                {
                                    "body": "Well, you know, many countries signed on to the Hague divorce convention, or are controlled by the Brussels II regulation. So those are pretty standard.\n\nI think you'll find just about any country in the world aside from the Philippines will grant a divorce to anyone who's been a resident for whatever their minimum period of time is (usually a year), and the US will recognize it.",
                                    "author": "ICanOnlyGetSoElect",
                                    "id": "hp6qajl",
                                    "parent_id": "t1_hp6pjgt",
                                    "score": 1,
                                    "created_utc": 1639933622.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hpb4ke6",
            "parent_id": "t1_hpb4coh",
            "score": 1,
            "created_utc": 1640016962.0,
            "replies": [
                {
                    "body": "It's obvious that I did destroy you, because you \\*still\\* won't re-post any specifics here. And the obvious reason is because you know you'll get destroyed again.\n\nI'll summarize it, since you won't - Bankruptcy Law 101: 7-figure IRA's are preserved in a bankruptcy.\n\nThe reader can judge for themselves. Res ipsa loquitor  :-)",
                    "author": "Nomad_Bill",
                    "id": "hpb5yvv",
                    "parent_id": "t1_hpb4ke6",
                    "score": 0,
                    "created_utc": 1640017546.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hpb8dlz",
                            "parent_id": "t1_hpb5yvv",
                            "score": 1,
                            "created_utc": 1640018559.0,
                            "replies": [
                                {
                                    "body": "Pro-tip: copy and paste doesn't take any more \"time away from your work\", than posting in this thread does. \n\nCould your responses be any more transparently ridiculous? \n\nLMAO!",
                                    "author": "Nomad_Bill",
                                    "id": "hpb8s8s",
                                    "parent_id": "t1_hpb8dlz",
                                    "score": -1,
                                    "created_utc": 1640018727.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There's a reason OP left him with \"You're right.\"",
            "author": "GACyberCool",
            "id": "hp8spr9",
            "parent_id": "t1_hp6mmwi",
            "score": 2,
            "created_utc": 1639965679.0,
            "replies": []
        },
        {
            "body": ">This is bad legal advice\n\nIt's not legal advice, its awareness of international legal systems.\n\nBut, don't take my word for it:\n\nhttps://travel.state.gov/content/travel/en/international-travel/while-abroad/divorce-abroad.html\n\n>A foreign judgment of divorce generally is recognized in a state in the United States on the basis of legal reciprocity where both parties had notice of the divorce proceeding and an opportunity to be heard within these proceedings. Marriage and divorce generally are considered matters reserved to the states rather than to the federal government.\n\nhttps://travel.state.gov/content/travel/en/international-travel/while-abroad/divorce-abroad/divorce-abroad-legal.html\n\n>a divorce decree issued in a foreign country generally is recognized in a state in the United States on the basis of comity (Hilton v. Guyot, 159 U.S. 113, 163-64 (1895), where both parties had notice of the divorce proceeding and an opportunity to be heard within these proceedings. Under the principle of comity, a divorce obtained in a foreign country under the circumstances described above generally will be recognized by states within the United States. States also may consider the jurisdictional basis upon which the foreign decree is founded and may not recognize the foreign divorce if the court is not satisfied that at least one party was domiciled in the country at the time of the divorce.\n\n>Divorce impacts eligibility for and distribution of federal benefits. Accordingly, the U.S. Social Security Administration, Veterans Administration, and Internal Revenue Service have made determinations regarding the validity of foreign divorces based on the laws of the state of residence applicable with respect to claims for benefits. For Social Security issues, please visit their website. Generally, federal entities apply the law of the state of residence of the beneficiary in question.\n\nFor example, in the UK, civil partnerships:\n\nhttps://www.gov.uk/end-civil-partnership\n\n>How to end your civil partnership\n>You must send paperwork to a court to ask for permission to end your civil partnership.\n\n>Separate from the paperwork, you and your ex-partner may need to work out:\n\n>arrangements for looking after any children\n>child maintenance payments for any children\n>***You also need to divide your money and property. There’s a deadline if you want to make this legally binding.***\n\n>You can usually avoid going to court hearings if you agree about children, money and property and the reasons for ending your civil partnership.\n\nMost countries have rules about who can file for divorce in their country.\n\nMost countries set the line as one of the partners living in that country for a year to be eligible for divorce there.",
            "author": "ICanOnlyGetSoElect",
            "id": "hp6o3rw",
            "parent_id": "t1_hp6mmwi",
            "score": -2,
            "created_utc": 1639932722.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "hp6pjgt",
                    "parent_id": "t1_hp6o3rw",
                    "score": 8,
                    "created_utc": 1639933318.0,
                    "replies": [
                        {
                            "body": "Well, you know, many countries signed on to the Hague divorce convention, or are controlled by the Brussels II regulation. So those are pretty standard.\n\nI think you'll find just about any country in the world aside from the Philippines will grant a divorce to anyone who's been a resident for whatever their minimum period of time is (usually a year), and the US will recognize it.",
                            "author": "ICanOnlyGetSoElect",
                            "id": "hp6qajl",
                            "parent_id": "t1_hp6pjgt",
                            "score": 1,
                            "created_utc": 1639933622.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's obvious that I did destroy you, because you \\*still\\* won't re-post any specifics here. And the obvious reason is because you know you'll get destroyed again.\n\nI'll summarize it, since you won't - Bankruptcy Law 101: 7-figure IRA's are preserved in a bankruptcy.\n\nThe reader can judge for themselves. Res ipsa loquitor  :-)",
            "author": "Nomad_Bill",
            "id": "hpb5yvv",
            "parent_id": "t1_hpb4ke6",
            "score": 0,
            "created_utc": 1640017546.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hpb8dlz",
                    "parent_id": "t1_hpb5yvv",
                    "score": 1,
                    "created_utc": 1640018559.0,
                    "replies": [
                        {
                            "body": "Pro-tip: copy and paste doesn't take any more \"time away from your work\", than posting in this thread does. \n\nCould your responses be any more transparently ridiculous? \n\nLMAO!",
                            "author": "Nomad_Bill",
                            "id": "hpb8s8s",
                            "parent_id": "t1_hpb8dlz",
                            "score": -1,
                            "created_utc": 1640018727.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hp6pjgt",
            "parent_id": "t1_hp6o3rw",
            "score": 8,
            "created_utc": 1639933318.0,
            "replies": [
                {
                    "body": "Well, you know, many countries signed on to the Hague divorce convention, or are controlled by the Brussels II regulation. So those are pretty standard.\n\nI think you'll find just about any country in the world aside from the Philippines will grant a divorce to anyone who's been a resident for whatever their minimum period of time is (usually a year), and the US will recognize it.",
                    "author": "ICanOnlyGetSoElect",
                    "id": "hp6qajl",
                    "parent_id": "t1_hp6pjgt",
                    "score": 1,
                    "created_utc": 1639933622.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hpb8dlz",
            "parent_id": "t1_hpb5yvv",
            "score": 1,
            "created_utc": 1640018559.0,
            "replies": [
                {
                    "body": "Pro-tip: copy and paste doesn't take any more \"time away from your work\", than posting in this thread does. \n\nCould your responses be any more transparently ridiculous? \n\nLMAO!",
                    "author": "Nomad_Bill",
                    "id": "hpb8s8s",
                    "parent_id": "t1_hpb8dlz",
                    "score": -1,
                    "created_utc": 1640018727.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, you know, many countries signed on to the Hague divorce convention, or are controlled by the Brussels II regulation. So those are pretty standard.\n\nI think you'll find just about any country in the world aside from the Philippines will grant a divorce to anyone who's been a resident for whatever their minimum period of time is (usually a year), and the US will recognize it.",
            "author": "ICanOnlyGetSoElect",
            "id": "hp6qajl",
            "parent_id": "t1_hp6pjgt",
            "score": 1,
            "created_utc": 1639933622.0,
            "replies": []
        },
        {
            "body": "Pro-tip: copy and paste doesn't take any more \"time away from your work\", than posting in this thread does. \n\nCould your responses be any more transparently ridiculous? \n\nLMAO!",
            "author": "Nomad_Bill",
            "id": "hpb8s8s",
            "parent_id": "t1_hpb8dlz",
            "score": -1,
            "created_utc": 1640018727.0,
            "replies": []
        }
    ]
}