{
    "title": "Unpopular opinion time: I'm glad that Song Ji Hyo isn't the \"ace\" anymore",
    "post_id": "hw3dd4",
    "post_url": "https://www.reddit.com/r/runningman/comments/hw3dd4/unpopular_opinion_time_im_glad_that_song_ji_hyo/",
    "author": "imperialstyle",
    "body": "I will be textually slaughtered for this but hear me out. SJH has always ALWAYS been my favourite cast member, I stan her and she is my queen. Ever since I was introduced to Running Man years ago I always supported her in every episode that I watched, so to my fellow SJH fans please know that I'm not trying to hate on her. \n\nIn the earlier episodes she was known as the \"Ace\" of Running Man, the one who was good at everything and who could change the outcome of the games single-handedly, and I'll admit I really enjoyed how important she appeared, but I feel like those days created an unhealthy and unsustainable image for her. She had to be perfect and good at everything, and any time she didn't perform up to expectation it was heavily downplayed.\n\nI'm sure everyone knows how over the last few years, SJH had been getting less screen time and was less involved than the early years. I was super worried myself that she would leave the show. I feel like a part of this was because the show couldn't figure out how to adapt SJH's old image to the new format.\n\nHere's the good part thought! In the past few episodes, I feel like Ji Hyo and the rest of the cast have adopted a new image for her, and after taking some time to understand it I've come to absolutely love it. After a long time of just being an almost invisible presence, she started getting more attention, not as a perfect \"Ace\" anymore but more for relatable, imperfect and down-to-earth aspects. I have to admit I was a tiny bit offended at \"Cavewoman\" Ji Hyo at first, but I realized that I felt I could connect to her and care for her more than ever before. Running Man has taken the last few episodes especially to develop a new character for her even more, and honestly I can't wait to see how she'll continue to contribute to the show now.\n\nJi Hyo will always be  \"Gold Jihyo\" to me, not because she wins, but because she's just that valuable.",
    "url": "https://www.reddit.com/r/runningman/comments/hw3dd4/unpopular_opinion_time_im_glad_that_song_ji_hyo/",
    "score": 247,
    "upvote_ratio": 0.93,
    "created_utc": 1595455947.0,
    "num_comments": 52,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I, for one, enjoy Slob Jihyo.",
            "author": "hypekillsJNSQ",
            "id": "fyx51pn",
            "parent_id": "t3_hw3dd4",
            "score": 115,
            "created_utc": 1595456473.0,
            "replies": [
                {
                    "body": "Cave Jihyo and blank Jihyo too",
                    "author": "kikiampops",
                    "id": "fyxvztq",
                    "parent_id": "t1_fyx51pn",
                    "score": 32,
                    "created_utc": 1595471713.0,
                    "replies": [
                        {
                            "body": "Thug JiHyo for life",
                            "author": "twigsandgrace",
                            "id": "fyz4emt",
                            "parent_id": "t1_fyxvztq",
                            "score": 16,
                            "created_utc": 1595508821.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think its about time that SJH evolved/developed a new persona, which some of the cast members have been able to do. \n\nNo one will be able to surpass SJH as the Ace, even now, no one is able to do it consistently. However, like the cast, the show has also revised its course and theme.\n\nI would love to see more of her on the show, who doesn't? Her persona there has always been reactionary and thats not a bad thing. I've seen people here complaining that she always had to have help being setup into a situation to be funny or noticed. So what? That's her role there! \n\nThe cast is just realigning itself where people are learning to properly insert themselves and not overpower each other. Its trial and error. \n\nThese days Cavewoman and Slob Ji Hyo are making their appearances. Haha. \n\nThanks for the bravery OP! It does need to be said though.",
            "author": null,
            "id": "fyx8lm7",
            "parent_id": "t3_hw3dd4",
            "score": 50,
            "created_utc": 1595458464.0,
            "replies": [
                {
                    "body": "Just out of curiosity, what are new old vs new personas that other members have developed throughout the years? I noticed that most of the new personas are usually the expansion of the existing personas\n\nI really like the one episode where Jae Suk started being mean to guests and I thought that was a direct contrast to Jae Suk's persona. However, it didn't stick out",
                    "author": "ashdodo",
                    "id": "fyyc6ar",
                    "parent_id": "t1_fyx8lm7",
                    "score": 7,
                    "created_utc": 1595482882.0,
                    "replies": [
                        {
                            "body": "I think Haha used to have this playboy persona which stopped when he got married. \n\nLKS used to \"fall in love\" with a lot of female guests until LSB.\n\nI guess you may be more correct to when you said that they expanded their personas and not necessarily created new ones..",
                            "author": null,
                            "id": "fyyhxbe",
                            "parent_id": "t1_fyyc6ar",
                            "score": 11,
                            "created_utc": 1595487977.0,
                            "replies": []
                        },
                        {
                            "body": "LKS used to be the quiet scammer who was basically the friendly giant and would make up stories about Jihyo swearing at kids or about KJK painting his nails in the bathroom. He was the fall in love with guests type for a while. He also was a part of the Feel-Chok-Cross thing. The betrayer. \n\nKJK was always Sparta and was known for being the strong man he develeped a cuter personality for a couple episodes though\n\nHaha was known as the kid of the group before he got married, hed fall in love with every female guest and he was very silly and had more slapstick than now. Now he's more comedic in a mature way.\n\nJaesuk has had a lot of personalities but hes known for having a super nose, bullying Sukjin, being fast.\n\nSukjin will always be the race starter, he was part of the betrayer group too.\n\nJihyo as the OP said was the Ace and in the beginning she was the Monday Couple too. Now we get Blank Jihyo, Cavewoman Jihyo and Slob Jihyo.\n\nSechan and Somin are relatively new they havent had too many characters yet.\n\nScammer Kwangsoo should make a comeback.",
                            "author": "kiikkoman",
                            "id": "fyys3ew",
                            "parent_id": "t1_fyyc6ar",
                            "score": 5,
                            "created_utc": 1595498359.0,
                            "replies": [
                                {
                                    "body": "what episodes did KS say those things? lol I love it when they make up stories about other members (like KJK having children in US, LKS visiting JSM in her apartment, etc.)\n\nI'd appreciate it if others also share rumor episodes lol thanks!",
                                    "author": "OppafromPH",
                                    "id": "fz2lx54",
                                    "parent_id": "t1_fyys3ew",
                                    "score": 3,
                                    "created_utc": 1595579641.0,
                                    "replies": [
                                        {
                                            "body": "Theyre pretty early episodes I can see if I can find them tonight but it was when LkS had long hair and a big mustache looked like he was 50 lol",
                                            "author": "kiikkoman",
                                            "id": "fzu1u2h",
                                            "parent_id": "t1_fz2lx54",
                                            "score": 2,
                                            "created_utc": 1596173403.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "But in that sense even ji hyo was always called blank because she's always lost.. So they have improved on that aspect more",
                            "author": "Tinted_reflections",
                            "id": "fyynlhl",
                            "parent_id": "t1_fyyc6ar",
                            "score": 2,
                            "created_utc": 1595493765.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree! The pressure of being an “ace” in everything can really take a toll on you. SJH is still a great asset and I’m glad their building her character. I hope she continues to bring her best and that the other RM members support her. It’s a two way street. The last episode like YJS said “it’s refreshing” when she speaks up. I want her to shine as well as all members!\n\nWhat would really be nice is if she could dress nice for an intro. Like show the world she’s stunning as she always has been. I think that would help her self esteem. Not that she needs to if she’s not comfortable with that, but I liked it when she dressed in really nice things and all the members and guests were like wow! It’s her choice and if she’s comfy in clothes that’s fine. Just a thought. Imagine! Jihyo and Somin walk out in stunning outfits! Wow!",
            "author": "K8tybugz",
            "id": "fyx506i",
            "parent_id": "t3_hw3dd4",
            "score": 29,
            "created_utc": 1595456448.0,
            "replies": [
                {
                    "body": "I think she doesn't do it because it's been 10 years of every Monday, she also might be preferring to just shoot and leave. But I do love it when she dresses up and everyone is speechless",
                    "author": "Tinted_reflections",
                    "id": "fyyr4n0",
                    "parent_id": "t1_fyx506i",
                    "score": 2,
                    "created_utc": 1595497384.0,
                    "replies": []
                },
                {
                    "body": "I think a lot of korean fans and international fans pointed this out. i forget in which episode (recent episode, 510-something), a lot of korean fans comment about her outfit in naver.. International fans also comment about this in her agency instagram. They said that the stylist is the one who dress song ji hyo like that, and they post about the way sjh's stylist clothes are same with sjh itself. but i dont know about the truth. i think sjh just want to be comfortable with her outfit. Remember the way she use double clothes (the heated one) and when kwangsoo saw that, he called her grandma? because of that i think she want to be comfy and take care of her health (using double clothes so it could reduce cold)",
                    "author": "ci_minri",
                    "id": "g4y6oh6",
                    "parent_id": "t1_fyx506i",
                    "score": 1,
                    "created_utc": 1599930933.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She's already used her \"out of it\" reputation to her advantage once recently as a spy.",
            "author": "MegalomaniacHack",
            "id": "fyxra8n",
            "parent_id": "t3_hw3dd4",
            "score": 11,
            "created_utc": 1595468951.0,
            "replies": [
                {
                    "body": "That episode where she >!told Kwang soo she didn’t get the game and then won it in the end!< was crazy",
                    "author": "bigbangandromeda",
                    "id": "fyxva99",
                    "parent_id": "t1_fyxra8n",
                    "score": 26,
                    "created_utc": 1595471292.0,
                    "replies": [
                        {
                            "body": "Whenever a game or episode ends and she's been keeping a secret or won a game they didn't know about, she keeps the blank look right up until the PD announces and then the sly grin just spreads across her face.",
                            "author": "MegalomaniacHack",
                            "id": "fyxxev6",
                            "parent_id": "t1_fyxva99",
                            "score": 28,
                            "created_utc": 1595472552.0,
                            "replies": [
                                {
                                    "body": "she's a brilliant actress HAHAHA",
                                    "author": "fudgee02",
                                    "id": "fz6e7nk",
                                    "parent_id": "t1_fyxxev6",
                                    "score": 1,
                                    "created_utc": 1595662547.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Which episode is this if you don’t mind me asking?",
                            "author": "CynisterWriter",
                            "id": "fyyplxu",
                            "parent_id": "t1_fyxva99",
                            "score": 1,
                            "created_utc": 1595495824.0,
                            "replies": [
                                {
                                    "body": "Episode >!505!< if I recall correctly",
                                    "author": "bigbangandromeda",
                                    "id": "fz1f3c7",
                                    "parent_id": "t1_fyyplxu",
                                    "score": 1,
                                    "created_utc": 1595550176.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fz31hh4",
                                            "parent_id": "t1_fz1f3c7",
                                            "score": 2,
                                            "created_utc": 1595593785.0,
                                            "replies": [
                                                {
                                                    "body": "OH I’m wrong it’s episode >!510!< oops",
                                                    "author": "bigbangandromeda",
                                                    "id": "fz5e9c9",
                                                    "parent_id": "t1_fz31hh4",
                                                    "score": 3,
                                                    "created_utc": 1595637250.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Haha in one of the recent episodes >!  (Ep 510), she used her sleepiness to avoid suspicion. Kwangsoo was even trying to keep her awake by telling her that being caught requires more work out in the sun !<",
                    "author": "moriatea",
                    "id": "fyy3lsr",
                    "parent_id": "t1_fyxra8n",
                    "score": 3,
                    "created_utc": 1595476471.0,
                    "replies": [
                        {
                            "body": "That was a great episode",
                            "author": "bigbangandromeda",
                            "id": "fz5ebwg",
                            "parent_id": "t1_fyy3lsr",
                            "score": 1,
                            "created_utc": 1595637291.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love how relaxed and real she is. Like when she was running late to the intro and when she put her mic on in front of everybody. I think I just relate to her more, loving sleep and wanting to be a rock lol.",
            "author": "MiniNutella",
            "id": "fyxntqk",
            "parent_id": "t3_hw3dd4",
            "score": 18,
            "created_utc": 1595466966.0,
            "replies": []
        },
        {
            "body": "LOVE MONG ji hyo",
            "author": "blimpnuts",
            "id": "fyxp2iv",
            "parent_id": "t3_hw3dd4",
            "score": 11,
            "created_utc": 1595467685.0,
            "replies": []
        },
        {
            "body": "No hate to SJH and I like how she has improved from how she used to be, but I believe there is a great overrating of SJH's ace skills. She is also deified to the level of a goddess because of her variety character. She could change the fate of games single-handed in the early days? Typical overreaction. That was mostly KJK and even there, some scripting was involved. Everyone must know that RM in the early days was mostly scripted with certain outcomes that had to happen and they needed a strongwoman character. JH wasn't even the strongest in the bunch. They gave her that character because they needed someone to play that role. That ace role has been passed down to her from Xman and FO which were varieties with strong female characters.\n\nSJH was never a threat when strong female guests or athletes came. Even within the cast, you could see the guys often went easy on her so she could retain that title. Not saying she hasn't done her best on a male-dominated show or isn't one of the best in height missions, but this overreaction to her is partly the reason why RM fandom has become so toxic. I don't see this level of deification when it comes to other RM cast and that is why the fans can take it easy when their favourite members do not get screen time in a particular episode.\n\nI hate the deification of Korean stars in general.  They get paid for what they do and most of their variety images and the outcomes in a show with a game format like RM is scripted. JH couldn't carry the ace title after a point. It's been like that for a long time. In 2017, other than the Nevis Swing episode, her memorable moments were mostly about her luck. But that grew stale and now, she has got another character that suits her better. She is doing better than she used to be, but it is also obvious that the PDs and members and JH herself,  after the longest time, has been working hard  for it. But it is a fact that she struggled for years and it was not just because she couldn't be the ace, but because of poor variety skills. I hope she gets better at her job, but I also hope her fans who deify her appreciate the other cast who have been successful at adapting to the show without the kind of help JH has got over the years.",
            "author": "springaugust",
            "id": "fyz323y",
            "parent_id": "t3_hw3dd4",
            "score": 12,
            "created_utc": 1595507883.0,
            "replies": []
        },
        {
            "body": "I just goes to show how one's character in RM can change throughout 10+ years. It's actually a good thing because we get to see different funny or just unique sides of each member in RM, as they also develop and change in their jokes and character they put out. This \"character\" thing I'm saying is more like how they describe and joke about a member, and do not get me wrong, it's not like they put on something fake just for the show",
            "author": "Loveparknima",
            "id": "fyxxtkv",
            "parent_id": "t3_hw3dd4",
            "score": 3,
            "created_utc": 1595472795.0,
            "replies": []
        },
        {
            "body": "I like the ace Jihyo but my favorite has never been her as I never expected something from her in nametag ripping games (KJK was always my pick next to Gary)\n\n  \nMongJi and the cavewoman are two of my favorite personalities from her, specially the cavewoman since she really doesn't know new things  :  \nAn example is in Knowing Bros when they ask 3 of the most \"Caveperson\" in the show including Jihyo what DM was and she said \"Digital Message\" I think this persona really suits her, even on instagram you can see she often uploads something and then delete it because she forgot to add a picture (And that has happened so many times already)\n\n&#x200B;\n\nAnd I really think being mong and \"Cavewoman\" are the real her more than the ace",
            "author": null,
            "id": "g30gjeq",
            "parent_id": "t3_hw3dd4",
            "score": 3,
            "created_utc": 1598528364.0,
            "replies": []
        },
        {
            "body": "I agree.",
            "author": "duhwanderer_",
            "id": "fyxijrr",
            "parent_id": "t3_hw3dd4",
            "score": 4,
            "created_utc": 1595463969.0,
            "replies": []
        },
        {
            "body": "I didn't watch Running Man back in Jihyo's \"ace\" days so it's hard to imagine since her current image is so ingrained into my brain lol.",
            "author": "brotherfrentis",
            "id": "fyyziya",
            "parent_id": "t3_hw3dd4",
            "score": 2,
            "created_utc": 1595505166.0,
            "replies": []
        },
        {
            "body": "I really loved Jihyo as parent zombie. That time when Kwangsoo asked, \"You're tired, aren't you?\" I got tricked by her brilliant act 😆",
            "author": "dindillap",
            "id": "g03npif",
            "parent_id": "t3_hw3dd4",
            "score": 2,
            "created_utc": 1596378223.0,
            "replies": []
        },
        {
            "body": "completely agree with this",
            "author": "hj6702",
            "id": "fyx5w6o",
            "parent_id": "t3_hw3dd4",
            "score": 4,
            "created_utc": 1595456961.0,
            "replies": []
        },
        {
            "body": "She's obviously the least talented member in terms of variety the ace persona was something to give her more screentime imo, especially in the start of running man. Her screentime when they were doing old races with 3 teams n stuff mostly consisted of doing  something really minor and adding the ace title with cool sounds or the monday couple thing.",
            "author": "loldiiij",
            "id": "fyxs6xw",
            "parent_id": "t3_hw3dd4",
            "score": 2,
            "created_utc": 1595469479.0,
            "replies": [
                {
                    "body": "I think you’re underestimating her a bit there, she’s wasn’t just given the ace title cuz she needed a title, she got it because she earned it. Specially in the first half of the decade before the show was reformatted. She was the luckiest member (still is lucky), the bravest one (iconic Macau jump), and she was one of the members with the most wins and was even the one who had the most gold winnings. Sounds deserving to me 🤷‍♀️",
                    "author": "iwantbubbleteanowpls",
                    "id": "fyy6vk0",
                    "parent_id": "t1_fyxs6xw",
                    "score": 10,
                    "created_utc": 1595478734.0,
                    "replies": [
                        {
                            "body": "Just to add onto the Macau jump as one of the brave moments, this series of clips also has other moments: https://www.youtube.com/watch?v=48rxqU3WAuA&feature=youtu.be\n\nEven if the entire RM cast were fearless, I’ve always found it entertaining to see how much JH enjoys those kinds of daredevil stunts. People can be fearless and just look cool but emotionless doing it, but seeing someone actually have fun during them is definitely an experience the show can share with viewers who could never even picture doing that themselves.",
                            "author": "amelisa28",
                            "id": "fyy9bot",
                            "parent_id": "t1_fyy6vk0",
                            "score": 6,
                            "created_utc": 1595480600.0,
                            "replies": [
                                {
                                    "body": "Some people just arent afraid of heights, when u compare it to her fear of insects it seems like polar opposites.",
                                    "author": "loldiiij",
                                    "id": "fyy9ruc",
                                    "parent_id": "t1_fyy9bot",
                                    "score": 8,
                                    "created_utc": 1595480952.0,
                                    "replies": [
                                        {
                                            "body": "That is very true, especially since in addition to bugs, JH also fears her mom. It’s a stark enough contrast that it adds a layer to her variety persona. Similar to how JK’s physique contrasts his singing voice or how SJ is one of the members that keeps up with “the youth’s” trends and has a particular kind of confidence, despite being the oldest member and one of the weakest. Even if members may have features that may be seen as disadvantages or flaws, they add to their personas and contributions to the show.",
                                            "author": "amelisa28",
                                            "id": "fyyauvo",
                                            "parent_id": "t1_fyy9ruc",
                                            "score": -2,
                                            "created_utc": 1595481813.0,
                                            "replies": [
                                                {
                                                    "body": "Her mong ji persona in general for me was way more fun than the ace one, since when u think of an ace u usually would think its someone sharp and in good condition, mong ji usually comes to sets looking tired and as if she just woke up. The contrast between the both is that she doesnt know how to play to her mong ji strenghts since she's an actress and being sloppy could ruin her career, being the ace i think was easier since she usually just needed to be agressive and act dominant w members like haha, seok jin n kwang soo.",
                                                    "author": "loldiiij",
                                                    "id": "fyybylv",
                                                    "parent_id": "t1_fyyauvo",
                                                    "score": 4,
                                                    "created_utc": 1595482708.0,
                                                    "replies": [
                                                        {
                                                            "body": "I think for me, I find Mong Ji and Angry Bird/Yok Jihyo (I differentiate that as a different persona from her Ace persona) funny, but enjoy Ace Jihyo more since I‘m happier when I see other people that I like be happy or having fun. For that same reason, I really love seeing warm exchanges between the cast members, which is why I’m grateful we’ve gotten to see more interactions between JH and SM since there is a different support system between them versus how they are separately with the guys.\n\nThat in mind, I would think that the show is better off incorporating a versatile persona by having both of those extreme ends (and whatever in between) since it then appeals to a wider audience. \n\nHowever, I am curious that if not for the pandemic, there would be more instances of the daredevil side of her Ace persona since a lot of those came out during episodes with traveling. It would be interesting to see if more complicated facets would come out from there since we’ve gotten to see more dynamics and aspects of the cast members in recent episodes due to how much Bopil focuses on them.",
                                                            "author": "amelisa28",
                                                            "id": "fyyebuo",
                                                            "parent_id": "t1_fyybylv",
                                                            "score": 1,
                                                            "created_utc": 1595484712.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "What I love the most about the Macau jump though was that she volunteered to do it for the other team just because she felt sleepy climbing up the top of the building 😂",
                                    "author": "iwantbubbleteanowpls",
                                    "id": "fyyn87g",
                                    "parent_id": "t1_fyy9bot",
                                    "score": 2,
                                    "created_utc": 1595493389.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "She has the worst deduction skills from the old crew, obviously the weakest, worst at quiz's but people still call her the ace due to the old wins she was practically given and that one girl crush moment at Macau. Not a hater tho, i just dislike it when people get put on a padestal for nothing that special. I understand that she's a female but in the past when she practically doesnt do anything for the whole game and ends up winning just coz someone has to turn theyre back to her ends up frustrating, mostly happened to kwang soo since his character was made to be that way.",
                            "author": "loldiiij",
                            "id": "fyy88pm",
                            "parent_id": "t1_fyy6vk0",
                            "score": -1,
                            "created_utc": 1595479759.0,
                            "replies": [
                                {
                                    "body": "well, all the members play roles in the show. Sometimes, editing, crew, and other members helping out to establish the character. I am sure some of the brilliant moments by members like Haha and YJS were also not completely organic. ANd Kwangsoo's Unlucky character is for sure hyped up. \n\nWell, nobody is thinking that SJH will actually win in a completely competitive game played by rules, like in Olympics or cool kiz on the block. She is fearless and more tolerant to pain and doesn't mind getting physical in the game. Well, they played it up obviously but so what? Every adult, sensible person knows that the members' variety persona is exaggerated.",
                                    "author": "rainsunicecream",
                                    "id": "fyyfp5e",
                                    "parent_id": "t1_fyy88pm",
                                    "score": 8,
                                    "created_utc": 1595485927.0,
                                    "replies": []
                                },
                                {
                                    "body": "That’s three weekness you’ve listed, one is very arguable if you mean physically weak since she’s stronger than SJ, has beaten other members a few times and even carried Gary once on a mission. So that’s two against the strengths that I listed. \nI don’t get how her “old wins” and “girl crush moments” (there’s more than that one moment in Macau) doesn’t make her deserving of that title? \nAnd also that’s called tactic, waiting at the last minute when others are fighting and she ousts the last person remaining. Obviously she’s at a disadvantage so instead of going head on she bids her time and waits for the last fight before making her move, that’s what a strategy is and a smart one at that. \nPeople are going to put her on a pedestal because they find her special and there’s nothing wrong with that, especially as they have reasons to put her on one.",
                                    "author": "iwantbubbleteanowpls",
                                    "id": "fyyn3xz",
                                    "parent_id": "t1_fyy88pm",
                                    "score": 3,
                                    "created_utc": 1595493266.0,
                                    "replies": [
                                        {
                                            "body": "It is commendable that she wasn't afraid to be physical, at least in the early days. The title of ace derives from playing cards, as being the highest valued card, the best of the best. Out of all the running man members, she is not even close to being the smartest, fastest, strongest, wittiest, etc, all traits that are essential to majority of their missions. Luck is arguable, I don't believe in it, especially not on a television show that can easily manipulate factors to create a narrative. Braveness, second to JK imo, and possibly other members that play it up for the camera. \n\nAs for most wins, you'd have to be extremely naive to believe that she would be able to win any name-tag ripping games without any advantages from the writing and production, or members taking it easy on her or simply ignoring her. Correct me if I'm wrong, but I'm assuming you're not experienced or knowledgeable in any athletics or sports associated with strength. It is nearly impossible for a female with a weight disparity of (\\~40?) lbs, without any discipline in strength training to be physically stronger than any healthy male that hasn't suffered from muscle atrophy, and yes that includes JSJ. \n\nThere's nothing wrong with people putting her on a pedestal, but I believe a large percentage that do so don't realize that her title of ace is completely fabricated. Someone above mentioned being too critical of her because of prejudices against her, but the same can be said of those too complimentary of her because of biases in favor of her. Everything I mentioned above seems pretty objective, without any prejudices nor biases imo.",
                                            "author": "babushka142",
                                            "id": "fyyrwf1",
                                            "parent_id": "t1_fyyn3xz",
                                            "score": 7,
                                            "created_utc": 1595498164.0,
                                            "replies": [
                                                {
                                                    "body": "Those people who overate JH don't know how variety works or think all her wins in the early years are because of her superior tactic and strength. RM was most scripted with fabricated scenarios and outcomes in the early years. In spy missions, it is so obvious they want the spy not to be outed till the fag end of the race. The exceptions are LKS and JSJ who can be outed because the episodes are funnier with such twists. It is an unwritten rule that RM members almost never out a member even when they know that person is suspicious. One recent example that comes to mind is how no member outed  SJH when she was the spy along with LKS in a recent episode. It was a male guest guesting on RM for the second time who mentioned her name. So did the members who have known her for 10 years get fooled because of her acting? From the expressions on everyone's faces, you could see the cast and the PDs didn't want it since it was going off script and she wouldn't get screen time. The PD then allowed her to participate in the games though she was arrested.",
                                                    "author": "springaugust",
                                                    "id": "fyz5dez",
                                                    "parent_id": "t1_fyyrwf1",
                                                    "score": 4,
                                                    "created_utc": 1595509458.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "In general terms yeah that’s true but in running man, her ace title stemmed from her being good at games, specially luck-based ones. You may not believe in luck but a lot of people do and although rm may exaggerate her luck, exaggeration is still based on truth. For example the pebble game where they had to guess the amount of pebbles in the players’ hands, she predicted correctly five times in a row- all kill game, it required no skill, she was just lucky. \n\nWhen I mentioned most wins, I meant winning the overall game/ep and in most of her solo wins, it wasn’t even from normal name tag ripping ones. I don’t even think she ever won overall from a name tag ripping game. I never said she was strong, just that she wasn’t the weakest.\n\nI honestly don’t think people are fooled into thinking rm is unscripted, in fact sometimes people even doubt when some members in general win since it is a variety show after all. As for being too complimentary, I don’t see that as a problem, everyone has their own biases and of course they’re going to boost them up. It’s only truly a problem when others are dragged down. As I mentioned, the ace thing came from being good at games but also as the show progressed, other factors such as her bravery and overall personality added to it.",
                                                    "author": "iwantbubbleteanowpls",
                                                    "id": "fyywyzl",
                                                    "parent_id": "t1_fyyrwf1",
                                                    "score": 3,
                                                    "created_utc": 1595502995.0,
                                                    "replies": [
                                                        {
                                                            "body": "Fair points, although I disagree with pretty much all of them, I can see how Running Man's narrative lead people to think like you. You may think she's good at games because of the constant \"that's our ace\" editing shoved down every one's throat in the past. Another member could've done the same exact thing or even better without any recognition as being the 'ace'. A large proportion, especially in the early days of RM concluded with a name tag ripping game to obtain the final win/prize. It'd be impossible to claim she had the most wins without winning a good chunk of name tag ripping games. \n\nIf we can both agree that she's not even close to being the smartest, strongest, fastest, wittiest, etc, do you honestly believe that she would have the most wins solely on her own merit? Aren't the traits that I mentioned above important to be an ace? Exaggeration may be based on truth, but not necessarily every instance. For example, when SJH and LKS 'fight', heavily exaggerated, but nowhere near the truth if it were real. \n\nYou even conceded to the fact that her luck is exaggerated, which is extremely arbitrary, and the only trait that she holds above the other members. Aren't you arguing that her ace title is deserved? I don't see how gaining advantages from writing and production is deserving. \n\nI never said being too complimentary is a problem. I am saying that in the same way someone's perspective can be skewed from prior prejudices against her, the same can be said for someone with unconditional biases in favor of her.",
                                                            "author": "babushka142",
                                                            "id": "fz0l7vn",
                                                            "parent_id": "t1_fyywyzl",
                                                            "score": 7,
                                                            "created_utc": 1595534993.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "i think what makes ji hyo the ace is the fact that she’s not afraid to try new things and is always willing to put up a fight even if she’s a girl. That’s ace quality, being FEARLESS. Ofc she’s the weakest, she’s the only girl but did she let that get on her way? NO. It’s not just the Macau episode. She’s the bravest one next to Jong Kook and I think that’s what makes her the ace. U say you’re not a hater but i think you’re wrong. I also hate it when people watch something/someone too critically because they have a prejudice against that person. Ji hyo was added to the cast because they thought they needed a girl or a damsel in distress but that was not the case with ji hyo because she tries her best at any challenge. And I think she deserves to be put up on a pedestal because she’s an inspiration to girls that you can do anything if you try in a world that’s dominated by guys.",
                                    "author": "youngjae10",
                                    "id": "fyymdk4",
                                    "parent_id": "t1_fyy88pm",
                                    "score": 3,
                                    "created_utc": 1595492523.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm a big fan of Song Ji Yok",
            "author": "asapkim",
            "id": "fze45qa",
            "parent_id": "t3_hw3dd4",
            "score": 1,
            "created_utc": 1595846501.0,
            "replies": []
        },
        {
            "body": "FACTS!",
            "author": "wontoan87",
            "id": "fyy7lty",
            "parent_id": "t3_hw3dd4",
            "score": 1,
            "created_utc": 1595479276.0,
            "replies": []
        },
        {
            "body": "I don't think Song Ji Hyo was under any pressure to perform earlier and she's still Ace. Earlier also there were many games in which she failed and many games she won effortlessly. In luck games, she was naturally lucky and in other games she won by playing nice. In games she was not good at, she just lost but majority she won. But in none of the games she took it as if she has to win it to remain Ace.",
            "author": "Tnr2D",
            "id": "fyy8yp1",
            "parent_id": "t3_hw3dd4",
            "score": 1,
            "created_utc": 1595480321.0,
            "replies": []
        },
        {
            "body": "Mong Jihyo > Gold Jihyo > Ace Jihyo",
            "author": "linyangyi",
            "id": "fz2c8ir",
            "parent_id": "t3_hw3dd4",
            "score": 0,
            "created_utc": 1595570714.0,
            "replies": []
        },
        {
            "body": "Cave Jihyo and blank Jihyo too",
            "author": "kikiampops",
            "id": "fyxvztq",
            "parent_id": "t1_fyx51pn",
            "score": 32,
            "created_utc": 1595471713.0,
            "replies": [
                {
                    "body": "Thug JiHyo for life",
                    "author": "twigsandgrace",
                    "id": "fyz4emt",
                    "parent_id": "t1_fyxvztq",
                    "score": 16,
                    "created_utc": 1595508821.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just out of curiosity, what are new old vs new personas that other members have developed throughout the years? I noticed that most of the new personas are usually the expansion of the existing personas\n\nI really like the one episode where Jae Suk started being mean to guests and I thought that was a direct contrast to Jae Suk's persona. However, it didn't stick out",
            "author": "ashdodo",
            "id": "fyyc6ar",
            "parent_id": "t1_fyx8lm7",
            "score": 7,
            "created_utc": 1595482882.0,
            "replies": [
                {
                    "body": "I think Haha used to have this playboy persona which stopped when he got married. \n\nLKS used to \"fall in love\" with a lot of female guests until LSB.\n\nI guess you may be more correct to when you said that they expanded their personas and not necessarily created new ones..",
                    "author": null,
                    "id": "fyyhxbe",
                    "parent_id": "t1_fyyc6ar",
                    "score": 11,
                    "created_utc": 1595487977.0,
                    "replies": []
                },
                {
                    "body": "LKS used to be the quiet scammer who was basically the friendly giant and would make up stories about Jihyo swearing at kids or about KJK painting his nails in the bathroom. He was the fall in love with guests type for a while. He also was a part of the Feel-Chok-Cross thing. The betrayer. \n\nKJK was always Sparta and was known for being the strong man he develeped a cuter personality for a couple episodes though\n\nHaha was known as the kid of the group before he got married, hed fall in love with every female guest and he was very silly and had more slapstick than now. Now he's more comedic in a mature way.\n\nJaesuk has had a lot of personalities but hes known for having a super nose, bullying Sukjin, being fast.\n\nSukjin will always be the race starter, he was part of the betrayer group too.\n\nJihyo as the OP said was the Ace and in the beginning she was the Monday Couple too. Now we get Blank Jihyo, Cavewoman Jihyo and Slob Jihyo.\n\nSechan and Somin are relatively new they havent had too many characters yet.\n\nScammer Kwangsoo should make a comeback.",
                    "author": "kiikkoman",
                    "id": "fyys3ew",
                    "parent_id": "t1_fyyc6ar",
                    "score": 5,
                    "created_utc": 1595498359.0,
                    "replies": [
                        {
                            "body": "what episodes did KS say those things? lol I love it when they make up stories about other members (like KJK having children in US, LKS visiting JSM in her apartment, etc.)\n\nI'd appreciate it if others also share rumor episodes lol thanks!",
                            "author": "OppafromPH",
                            "id": "fz2lx54",
                            "parent_id": "t1_fyys3ew",
                            "score": 3,
                            "created_utc": 1595579641.0,
                            "replies": [
                                {
                                    "body": "Theyre pretty early episodes I can see if I can find them tonight but it was when LkS had long hair and a big mustache looked like he was 50 lol",
                                    "author": "kiikkoman",
                                    "id": "fzu1u2h",
                                    "parent_id": "t1_fz2lx54",
                                    "score": 2,
                                    "created_utc": 1596173403.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "But in that sense even ji hyo was always called blank because she's always lost.. So they have improved on that aspect more",
                    "author": "Tinted_reflections",
                    "id": "fyynlhl",
                    "parent_id": "t1_fyyc6ar",
                    "score": 2,
                    "created_utc": 1595493765.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think she doesn't do it because it's been 10 years of every Monday, she also might be preferring to just shoot and leave. But I do love it when she dresses up and everyone is speechless",
            "author": "Tinted_reflections",
            "id": "fyyr4n0",
            "parent_id": "t1_fyx506i",
            "score": 2,
            "created_utc": 1595497384.0,
            "replies": []
        },
        {
            "body": "I think a lot of korean fans and international fans pointed this out. i forget in which episode (recent episode, 510-something), a lot of korean fans comment about her outfit in naver.. International fans also comment about this in her agency instagram. They said that the stylist is the one who dress song ji hyo like that, and they post about the way sjh's stylist clothes are same with sjh itself. but i dont know about the truth. i think sjh just want to be comfortable with her outfit. Remember the way she use double clothes (the heated one) and when kwangsoo saw that, he called her grandma? because of that i think she want to be comfy and take care of her health (using double clothes so it could reduce cold)",
            "author": "ci_minri",
            "id": "g4y6oh6",
            "parent_id": "t1_fyx506i",
            "score": 1,
            "created_utc": 1599930933.0,
            "replies": []
        },
        {
            "body": "That episode where she >!told Kwang soo she didn’t get the game and then won it in the end!< was crazy",
            "author": "bigbangandromeda",
            "id": "fyxva99",
            "parent_id": "t1_fyxra8n",
            "score": 26,
            "created_utc": 1595471292.0,
            "replies": [
                {
                    "body": "Whenever a game or episode ends and she's been keeping a secret or won a game they didn't know about, she keeps the blank look right up until the PD announces and then the sly grin just spreads across her face.",
                    "author": "MegalomaniacHack",
                    "id": "fyxxev6",
                    "parent_id": "t1_fyxva99",
                    "score": 28,
                    "created_utc": 1595472552.0,
                    "replies": [
                        {
                            "body": "she's a brilliant actress HAHAHA",
                            "author": "fudgee02",
                            "id": "fz6e7nk",
                            "parent_id": "t1_fyxxev6",
                            "score": 1,
                            "created_utc": 1595662547.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Which episode is this if you don’t mind me asking?",
                    "author": "CynisterWriter",
                    "id": "fyyplxu",
                    "parent_id": "t1_fyxva99",
                    "score": 1,
                    "created_utc": 1595495824.0,
                    "replies": [
                        {
                            "body": "Episode >!505!< if I recall correctly",
                            "author": "bigbangandromeda",
                            "id": "fz1f3c7",
                            "parent_id": "t1_fyyplxu",
                            "score": 1,
                            "created_utc": 1595550176.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fz31hh4",
                                    "parent_id": "t1_fz1f3c7",
                                    "score": 2,
                                    "created_utc": 1595593785.0,
                                    "replies": [
                                        {
                                            "body": "OH I’m wrong it’s episode >!510!< oops",
                                            "author": "bigbangandromeda",
                                            "id": "fz5e9c9",
                                            "parent_id": "t1_fz31hh4",
                                            "score": 3,
                                            "created_utc": 1595637250.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Haha in one of the recent episodes >!  (Ep 510), she used her sleepiness to avoid suspicion. Kwangsoo was even trying to keep her awake by telling her that being caught requires more work out in the sun !<",
            "author": "moriatea",
            "id": "fyy3lsr",
            "parent_id": "t1_fyxra8n",
            "score": 3,
            "created_utc": 1595476471.0,
            "replies": [
                {
                    "body": "That was a great episode",
                    "author": "bigbangandromeda",
                    "id": "fz5ebwg",
                    "parent_id": "t1_fyy3lsr",
                    "score": 1,
                    "created_utc": 1595637291.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think you’re underestimating her a bit there, she’s wasn’t just given the ace title cuz she needed a title, she got it because she earned it. Specially in the first half of the decade before the show was reformatted. She was the luckiest member (still is lucky), the bravest one (iconic Macau jump), and she was one of the members with the most wins and was even the one who had the most gold winnings. Sounds deserving to me 🤷‍♀️",
            "author": "iwantbubbleteanowpls",
            "id": "fyy6vk0",
            "parent_id": "t1_fyxs6xw",
            "score": 10,
            "created_utc": 1595478734.0,
            "replies": [
                {
                    "body": "Just to add onto the Macau jump as one of the brave moments, this series of clips also has other moments: https://www.youtube.com/watch?v=48rxqU3WAuA&feature=youtu.be\n\nEven if the entire RM cast were fearless, I’ve always found it entertaining to see how much JH enjoys those kinds of daredevil stunts. People can be fearless and just look cool but emotionless doing it, but seeing someone actually have fun during them is definitely an experience the show can share with viewers who could never even picture doing that themselves.",
                    "author": "amelisa28",
                    "id": "fyy9bot",
                    "parent_id": "t1_fyy6vk0",
                    "score": 6,
                    "created_utc": 1595480600.0,
                    "replies": [
                        {
                            "body": "Some people just arent afraid of heights, when u compare it to her fear of insects it seems like polar opposites.",
                            "author": "loldiiij",
                            "id": "fyy9ruc",
                            "parent_id": "t1_fyy9bot",
                            "score": 8,
                            "created_utc": 1595480952.0,
                            "replies": [
                                {
                                    "body": "That is very true, especially since in addition to bugs, JH also fears her mom. It’s a stark enough contrast that it adds a layer to her variety persona. Similar to how JK’s physique contrasts his singing voice or how SJ is one of the members that keeps up with “the youth’s” trends and has a particular kind of confidence, despite being the oldest member and one of the weakest. Even if members may have features that may be seen as disadvantages or flaws, they add to their personas and contributions to the show.",
                                    "author": "amelisa28",
                                    "id": "fyyauvo",
                                    "parent_id": "t1_fyy9ruc",
                                    "score": -2,
                                    "created_utc": 1595481813.0,
                                    "replies": [
                                        {
                                            "body": "Her mong ji persona in general for me was way more fun than the ace one, since when u think of an ace u usually would think its someone sharp and in good condition, mong ji usually comes to sets looking tired and as if she just woke up. The contrast between the both is that she doesnt know how to play to her mong ji strenghts since she's an actress and being sloppy could ruin her career, being the ace i think was easier since she usually just needed to be agressive and act dominant w members like haha, seok jin n kwang soo.",
                                            "author": "loldiiij",
                                            "id": "fyybylv",
                                            "parent_id": "t1_fyyauvo",
                                            "score": 4,
                                            "created_utc": 1595482708.0,
                                            "replies": [
                                                {
                                                    "body": "I think for me, I find Mong Ji and Angry Bird/Yok Jihyo (I differentiate that as a different persona from her Ace persona) funny, but enjoy Ace Jihyo more since I‘m happier when I see other people that I like be happy or having fun. For that same reason, I really love seeing warm exchanges between the cast members, which is why I’m grateful we’ve gotten to see more interactions between JH and SM since there is a different support system between them versus how they are separately with the guys.\n\nThat in mind, I would think that the show is better off incorporating a versatile persona by having both of those extreme ends (and whatever in between) since it then appeals to a wider audience. \n\nHowever, I am curious that if not for the pandemic, there would be more instances of the daredevil side of her Ace persona since a lot of those came out during episodes with traveling. It would be interesting to see if more complicated facets would come out from there since we’ve gotten to see more dynamics and aspects of the cast members in recent episodes due to how much Bopil focuses on them.",
                                                    "author": "amelisa28",
                                                    "id": "fyyebuo",
                                                    "parent_id": "t1_fyybylv",
                                                    "score": 1,
                                                    "created_utc": 1595484712.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "What I love the most about the Macau jump though was that she volunteered to do it for the other team just because she felt sleepy climbing up the top of the building 😂",
                            "author": "iwantbubbleteanowpls",
                            "id": "fyyn87g",
                            "parent_id": "t1_fyy9bot",
                            "score": 2,
                            "created_utc": 1595493389.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "She has the worst deduction skills from the old crew, obviously the weakest, worst at quiz's but people still call her the ace due to the old wins she was practically given and that one girl crush moment at Macau. Not a hater tho, i just dislike it when people get put on a padestal for nothing that special. I understand that she's a female but in the past when she practically doesnt do anything for the whole game and ends up winning just coz someone has to turn theyre back to her ends up frustrating, mostly happened to kwang soo since his character was made to be that way.",
                    "author": "loldiiij",
                    "id": "fyy88pm",
                    "parent_id": "t1_fyy6vk0",
                    "score": -1,
                    "created_utc": 1595479759.0,
                    "replies": [
                        {
                            "body": "well, all the members play roles in the show. Sometimes, editing, crew, and other members helping out to establish the character. I am sure some of the brilliant moments by members like Haha and YJS were also not completely organic. ANd Kwangsoo's Unlucky character is for sure hyped up. \n\nWell, nobody is thinking that SJH will actually win in a completely competitive game played by rules, like in Olympics or cool kiz on the block. She is fearless and more tolerant to pain and doesn't mind getting physical in the game. Well, they played it up obviously but so what? Every adult, sensible person knows that the members' variety persona is exaggerated.",
                            "author": "rainsunicecream",
                            "id": "fyyfp5e",
                            "parent_id": "t1_fyy88pm",
                            "score": 8,
                            "created_utc": 1595485927.0,
                            "replies": []
                        },
                        {
                            "body": "That’s three weekness you’ve listed, one is very arguable if you mean physically weak since she’s stronger than SJ, has beaten other members a few times and even carried Gary once on a mission. So that’s two against the strengths that I listed. \nI don’t get how her “old wins” and “girl crush moments” (there’s more than that one moment in Macau) doesn’t make her deserving of that title? \nAnd also that’s called tactic, waiting at the last minute when others are fighting and she ousts the last person remaining. Obviously she’s at a disadvantage so instead of going head on she bids her time and waits for the last fight before making her move, that’s what a strategy is and a smart one at that. \nPeople are going to put her on a pedestal because they find her special and there’s nothing wrong with that, especially as they have reasons to put her on one.",
                            "author": "iwantbubbleteanowpls",
                            "id": "fyyn3xz",
                            "parent_id": "t1_fyy88pm",
                            "score": 3,
                            "created_utc": 1595493266.0,
                            "replies": [
                                {
                                    "body": "It is commendable that she wasn't afraid to be physical, at least in the early days. The title of ace derives from playing cards, as being the highest valued card, the best of the best. Out of all the running man members, she is not even close to being the smartest, fastest, strongest, wittiest, etc, all traits that are essential to majority of their missions. Luck is arguable, I don't believe in it, especially not on a television show that can easily manipulate factors to create a narrative. Braveness, second to JK imo, and possibly other members that play it up for the camera. \n\nAs for most wins, you'd have to be extremely naive to believe that she would be able to win any name-tag ripping games without any advantages from the writing and production, or members taking it easy on her or simply ignoring her. Correct me if I'm wrong, but I'm assuming you're not experienced or knowledgeable in any athletics or sports associated with strength. It is nearly impossible for a female with a weight disparity of (\\~40?) lbs, without any discipline in strength training to be physically stronger than any healthy male that hasn't suffered from muscle atrophy, and yes that includes JSJ. \n\nThere's nothing wrong with people putting her on a pedestal, but I believe a large percentage that do so don't realize that her title of ace is completely fabricated. Someone above mentioned being too critical of her because of prejudices against her, but the same can be said of those too complimentary of her because of biases in favor of her. Everything I mentioned above seems pretty objective, without any prejudices nor biases imo.",
                                    "author": "babushka142",
                                    "id": "fyyrwf1",
                                    "parent_id": "t1_fyyn3xz",
                                    "score": 7,
                                    "created_utc": 1595498164.0,
                                    "replies": [
                                        {
                                            "body": "Those people who overate JH don't know how variety works or think all her wins in the early years are because of her superior tactic and strength. RM was most scripted with fabricated scenarios and outcomes in the early years. In spy missions, it is so obvious they want the spy not to be outed till the fag end of the race. The exceptions are LKS and JSJ who can be outed because the episodes are funnier with such twists. It is an unwritten rule that RM members almost never out a member even when they know that person is suspicious. One recent example that comes to mind is how no member outed  SJH when she was the spy along with LKS in a recent episode. It was a male guest guesting on RM for the second time who mentioned her name. So did the members who have known her for 10 years get fooled because of her acting? From the expressions on everyone's faces, you could see the cast and the PDs didn't want it since it was going off script and she wouldn't get screen time. The PD then allowed her to participate in the games though she was arrested.",
                                            "author": "springaugust",
                                            "id": "fyz5dez",
                                            "parent_id": "t1_fyyrwf1",
                                            "score": 4,
                                            "created_utc": 1595509458.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "In general terms yeah that’s true but in running man, her ace title stemmed from her being good at games, specially luck-based ones. You may not believe in luck but a lot of people do and although rm may exaggerate her luck, exaggeration is still based on truth. For example the pebble game where they had to guess the amount of pebbles in the players’ hands, she predicted correctly five times in a row- all kill game, it required no skill, she was just lucky. \n\nWhen I mentioned most wins, I meant winning the overall game/ep and in most of her solo wins, it wasn’t even from normal name tag ripping ones. I don’t even think she ever won overall from a name tag ripping game. I never said she was strong, just that she wasn’t the weakest.\n\nI honestly don’t think people are fooled into thinking rm is unscripted, in fact sometimes people even doubt when some members in general win since it is a variety show after all. As for being too complimentary, I don’t see that as a problem, everyone has their own biases and of course they’re going to boost them up. It’s only truly a problem when others are dragged down. As I mentioned, the ace thing came from being good at games but also as the show progressed, other factors such as her bravery and overall personality added to it.",
                                            "author": "iwantbubbleteanowpls",
                                            "id": "fyywyzl",
                                            "parent_id": "t1_fyyrwf1",
                                            "score": 3,
                                            "created_utc": 1595502995.0,
                                            "replies": [
                                                {
                                                    "body": "Fair points, although I disagree with pretty much all of them, I can see how Running Man's narrative lead people to think like you. You may think she's good at games because of the constant \"that's our ace\" editing shoved down every one's throat in the past. Another member could've done the same exact thing or even better without any recognition as being the 'ace'. A large proportion, especially in the early days of RM concluded with a name tag ripping game to obtain the final win/prize. It'd be impossible to claim she had the most wins without winning a good chunk of name tag ripping games. \n\nIf we can both agree that she's not even close to being the smartest, strongest, fastest, wittiest, etc, do you honestly believe that she would have the most wins solely on her own merit? Aren't the traits that I mentioned above important to be an ace? Exaggeration may be based on truth, but not necessarily every instance. For example, when SJH and LKS 'fight', heavily exaggerated, but nowhere near the truth if it were real. \n\nYou even conceded to the fact that her luck is exaggerated, which is extremely arbitrary, and the only trait that she holds above the other members. Aren't you arguing that her ace title is deserved? I don't see how gaining advantages from writing and production is deserving. \n\nI never said being too complimentary is a problem. I am saying that in the same way someone's perspective can be skewed from prior prejudices against her, the same can be said for someone with unconditional biases in favor of her.",
                                                    "author": "babushka142",
                                                    "id": "fz0l7vn",
                                                    "parent_id": "t1_fyywyzl",
                                                    "score": 7,
                                                    "created_utc": 1595534993.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "i think what makes ji hyo the ace is the fact that she’s not afraid to try new things and is always willing to put up a fight even if she’s a girl. That’s ace quality, being FEARLESS. Ofc she’s the weakest, she’s the only girl but did she let that get on her way? NO. It’s not just the Macau episode. She’s the bravest one next to Jong Kook and I think that’s what makes her the ace. U say you’re not a hater but i think you’re wrong. I also hate it when people watch something/someone too critically because they have a prejudice against that person. Ji hyo was added to the cast because they thought they needed a girl or a damsel in distress but that was not the case with ji hyo because she tries her best at any challenge. And I think she deserves to be put up on a pedestal because she’s an inspiration to girls that you can do anything if you try in a world that’s dominated by guys.",
                            "author": "youngjae10",
                            "id": "fyymdk4",
                            "parent_id": "t1_fyy88pm",
                            "score": 3,
                            "created_utc": 1595492523.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thug JiHyo for life",
            "author": "twigsandgrace",
            "id": "fyz4emt",
            "parent_id": "t1_fyxvztq",
            "score": 16,
            "created_utc": 1595508821.0,
            "replies": []
        },
        {
            "body": "I think Haha used to have this playboy persona which stopped when he got married. \n\nLKS used to \"fall in love\" with a lot of female guests until LSB.\n\nI guess you may be more correct to when you said that they expanded their personas and not necessarily created new ones..",
            "author": null,
            "id": "fyyhxbe",
            "parent_id": "t1_fyyc6ar",
            "score": 11,
            "created_utc": 1595487977.0,
            "replies": []
        },
        {
            "body": "LKS used to be the quiet scammer who was basically the friendly giant and would make up stories about Jihyo swearing at kids or about KJK painting his nails in the bathroom. He was the fall in love with guests type for a while. He also was a part of the Feel-Chok-Cross thing. The betrayer. \n\nKJK was always Sparta and was known for being the strong man he develeped a cuter personality for a couple episodes though\n\nHaha was known as the kid of the group before he got married, hed fall in love with every female guest and he was very silly and had more slapstick than now. Now he's more comedic in a mature way.\n\nJaesuk has had a lot of personalities but hes known for having a super nose, bullying Sukjin, being fast.\n\nSukjin will always be the race starter, he was part of the betrayer group too.\n\nJihyo as the OP said was the Ace and in the beginning she was the Monday Couple too. Now we get Blank Jihyo, Cavewoman Jihyo and Slob Jihyo.\n\nSechan and Somin are relatively new they havent had too many characters yet.\n\nScammer Kwangsoo should make a comeback.",
            "author": "kiikkoman",
            "id": "fyys3ew",
            "parent_id": "t1_fyyc6ar",
            "score": 5,
            "created_utc": 1595498359.0,
            "replies": [
                {
                    "body": "what episodes did KS say those things? lol I love it when they make up stories about other members (like KJK having children in US, LKS visiting JSM in her apartment, etc.)\n\nI'd appreciate it if others also share rumor episodes lol thanks!",
                    "author": "OppafromPH",
                    "id": "fz2lx54",
                    "parent_id": "t1_fyys3ew",
                    "score": 3,
                    "created_utc": 1595579641.0,
                    "replies": [
                        {
                            "body": "Theyre pretty early episodes I can see if I can find them tonight but it was when LkS had long hair and a big mustache looked like he was 50 lol",
                            "author": "kiikkoman",
                            "id": "fzu1u2h",
                            "parent_id": "t1_fz2lx54",
                            "score": 2,
                            "created_utc": 1596173403.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "But in that sense even ji hyo was always called blank because she's always lost.. So they have improved on that aspect more",
            "author": "Tinted_reflections",
            "id": "fyynlhl",
            "parent_id": "t1_fyyc6ar",
            "score": 2,
            "created_utc": 1595493765.0,
            "replies": []
        },
        {
            "body": "Whenever a game or episode ends and she's been keeping a secret or won a game they didn't know about, she keeps the blank look right up until the PD announces and then the sly grin just spreads across her face.",
            "author": "MegalomaniacHack",
            "id": "fyxxev6",
            "parent_id": "t1_fyxva99",
            "score": 28,
            "created_utc": 1595472552.0,
            "replies": [
                {
                    "body": "she's a brilliant actress HAHAHA",
                    "author": "fudgee02",
                    "id": "fz6e7nk",
                    "parent_id": "t1_fyxxev6",
                    "score": 1,
                    "created_utc": 1595662547.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Which episode is this if you don’t mind me asking?",
            "author": "CynisterWriter",
            "id": "fyyplxu",
            "parent_id": "t1_fyxva99",
            "score": 1,
            "created_utc": 1595495824.0,
            "replies": [
                {
                    "body": "Episode >!505!< if I recall correctly",
                    "author": "bigbangandromeda",
                    "id": "fz1f3c7",
                    "parent_id": "t1_fyyplxu",
                    "score": 1,
                    "created_utc": 1595550176.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fz31hh4",
                            "parent_id": "t1_fz1f3c7",
                            "score": 2,
                            "created_utc": 1595593785.0,
                            "replies": [
                                {
                                    "body": "OH I’m wrong it’s episode >!510!< oops",
                                    "author": "bigbangandromeda",
                                    "id": "fz5e9c9",
                                    "parent_id": "t1_fz31hh4",
                                    "score": 3,
                                    "created_utc": 1595637250.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That was a great episode",
            "author": "bigbangandromeda",
            "id": "fz5ebwg",
            "parent_id": "t1_fyy3lsr",
            "score": 1,
            "created_utc": 1595637291.0,
            "replies": []
        },
        {
            "body": "Just to add onto the Macau jump as one of the brave moments, this series of clips also has other moments: https://www.youtube.com/watch?v=48rxqU3WAuA&feature=youtu.be\n\nEven if the entire RM cast were fearless, I’ve always found it entertaining to see how much JH enjoys those kinds of daredevil stunts. People can be fearless and just look cool but emotionless doing it, but seeing someone actually have fun during them is definitely an experience the show can share with viewers who could never even picture doing that themselves.",
            "author": "amelisa28",
            "id": "fyy9bot",
            "parent_id": "t1_fyy6vk0",
            "score": 6,
            "created_utc": 1595480600.0,
            "replies": [
                {
                    "body": "Some people just arent afraid of heights, when u compare it to her fear of insects it seems like polar opposites.",
                    "author": "loldiiij",
                    "id": "fyy9ruc",
                    "parent_id": "t1_fyy9bot",
                    "score": 8,
                    "created_utc": 1595480952.0,
                    "replies": [
                        {
                            "body": "That is very true, especially since in addition to bugs, JH also fears her mom. It’s a stark enough contrast that it adds a layer to her variety persona. Similar to how JK’s physique contrasts his singing voice or how SJ is one of the members that keeps up with “the youth’s” trends and has a particular kind of confidence, despite being the oldest member and one of the weakest. Even if members may have features that may be seen as disadvantages or flaws, they add to their personas and contributions to the show.",
                            "author": "amelisa28",
                            "id": "fyyauvo",
                            "parent_id": "t1_fyy9ruc",
                            "score": -2,
                            "created_utc": 1595481813.0,
                            "replies": [
                                {
                                    "body": "Her mong ji persona in general for me was way more fun than the ace one, since when u think of an ace u usually would think its someone sharp and in good condition, mong ji usually comes to sets looking tired and as if she just woke up. The contrast between the both is that she doesnt know how to play to her mong ji strenghts since she's an actress and being sloppy could ruin her career, being the ace i think was easier since she usually just needed to be agressive and act dominant w members like haha, seok jin n kwang soo.",
                                    "author": "loldiiij",
                                    "id": "fyybylv",
                                    "parent_id": "t1_fyyauvo",
                                    "score": 4,
                                    "created_utc": 1595482708.0,
                                    "replies": [
                                        {
                                            "body": "I think for me, I find Mong Ji and Angry Bird/Yok Jihyo (I differentiate that as a different persona from her Ace persona) funny, but enjoy Ace Jihyo more since I‘m happier when I see other people that I like be happy or having fun. For that same reason, I really love seeing warm exchanges between the cast members, which is why I’m grateful we’ve gotten to see more interactions between JH and SM since there is a different support system between them versus how they are separately with the guys.\n\nThat in mind, I would think that the show is better off incorporating a versatile persona by having both of those extreme ends (and whatever in between) since it then appeals to a wider audience. \n\nHowever, I am curious that if not for the pandemic, there would be more instances of the daredevil side of her Ace persona since a lot of those came out during episodes with traveling. It would be interesting to see if more complicated facets would come out from there since we’ve gotten to see more dynamics and aspects of the cast members in recent episodes due to how much Bopil focuses on them.",
                                            "author": "amelisa28",
                                            "id": "fyyebuo",
                                            "parent_id": "t1_fyybylv",
                                            "score": 1,
                                            "created_utc": 1595484712.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "What I love the most about the Macau jump though was that she volunteered to do it for the other team just because she felt sleepy climbing up the top of the building 😂",
                    "author": "iwantbubbleteanowpls",
                    "id": "fyyn87g",
                    "parent_id": "t1_fyy9bot",
                    "score": 2,
                    "created_utc": 1595493389.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She has the worst deduction skills from the old crew, obviously the weakest, worst at quiz's but people still call her the ace due to the old wins she was practically given and that one girl crush moment at Macau. Not a hater tho, i just dislike it when people get put on a padestal for nothing that special. I understand that she's a female but in the past when she practically doesnt do anything for the whole game and ends up winning just coz someone has to turn theyre back to her ends up frustrating, mostly happened to kwang soo since his character was made to be that way.",
            "author": "loldiiij",
            "id": "fyy88pm",
            "parent_id": "t1_fyy6vk0",
            "score": -1,
            "created_utc": 1595479759.0,
            "replies": [
                {
                    "body": "well, all the members play roles in the show. Sometimes, editing, crew, and other members helping out to establish the character. I am sure some of the brilliant moments by members like Haha and YJS were also not completely organic. ANd Kwangsoo's Unlucky character is for sure hyped up. \n\nWell, nobody is thinking that SJH will actually win in a completely competitive game played by rules, like in Olympics or cool kiz on the block. She is fearless and more tolerant to pain and doesn't mind getting physical in the game. Well, they played it up obviously but so what? Every adult, sensible person knows that the members' variety persona is exaggerated.",
                    "author": "rainsunicecream",
                    "id": "fyyfp5e",
                    "parent_id": "t1_fyy88pm",
                    "score": 8,
                    "created_utc": 1595485927.0,
                    "replies": []
                },
                {
                    "body": "That’s three weekness you’ve listed, one is very arguable if you mean physically weak since she’s stronger than SJ, has beaten other members a few times and even carried Gary once on a mission. So that’s two against the strengths that I listed. \nI don’t get how her “old wins” and “girl crush moments” (there’s more than that one moment in Macau) doesn’t make her deserving of that title? \nAnd also that’s called tactic, waiting at the last minute when others are fighting and she ousts the last person remaining. Obviously she’s at a disadvantage so instead of going head on she bids her time and waits for the last fight before making her move, that’s what a strategy is and a smart one at that. \nPeople are going to put her on a pedestal because they find her special and there’s nothing wrong with that, especially as they have reasons to put her on one.",
                    "author": "iwantbubbleteanowpls",
                    "id": "fyyn3xz",
                    "parent_id": "t1_fyy88pm",
                    "score": 3,
                    "created_utc": 1595493266.0,
                    "replies": [
                        {
                            "body": "It is commendable that she wasn't afraid to be physical, at least in the early days. The title of ace derives from playing cards, as being the highest valued card, the best of the best. Out of all the running man members, she is not even close to being the smartest, fastest, strongest, wittiest, etc, all traits that are essential to majority of their missions. Luck is arguable, I don't believe in it, especially not on a television show that can easily manipulate factors to create a narrative. Braveness, second to JK imo, and possibly other members that play it up for the camera. \n\nAs for most wins, you'd have to be extremely naive to believe that she would be able to win any name-tag ripping games without any advantages from the writing and production, or members taking it easy on her or simply ignoring her. Correct me if I'm wrong, but I'm assuming you're not experienced or knowledgeable in any athletics or sports associated with strength. It is nearly impossible for a female with a weight disparity of (\\~40?) lbs, without any discipline in strength training to be physically stronger than any healthy male that hasn't suffered from muscle atrophy, and yes that includes JSJ. \n\nThere's nothing wrong with people putting her on a pedestal, but I believe a large percentage that do so don't realize that her title of ace is completely fabricated. Someone above mentioned being too critical of her because of prejudices against her, but the same can be said of those too complimentary of her because of biases in favor of her. Everything I mentioned above seems pretty objective, without any prejudices nor biases imo.",
                            "author": "babushka142",
                            "id": "fyyrwf1",
                            "parent_id": "t1_fyyn3xz",
                            "score": 7,
                            "created_utc": 1595498164.0,
                            "replies": [
                                {
                                    "body": "Those people who overate JH don't know how variety works or think all her wins in the early years are because of her superior tactic and strength. RM was most scripted with fabricated scenarios and outcomes in the early years. In spy missions, it is so obvious they want the spy not to be outed till the fag end of the race. The exceptions are LKS and JSJ who can be outed because the episodes are funnier with such twists. It is an unwritten rule that RM members almost never out a member even when they know that person is suspicious. One recent example that comes to mind is how no member outed  SJH when she was the spy along with LKS in a recent episode. It was a male guest guesting on RM for the second time who mentioned her name. So did the members who have known her for 10 years get fooled because of her acting? From the expressions on everyone's faces, you could see the cast and the PDs didn't want it since it was going off script and she wouldn't get screen time. The PD then allowed her to participate in the games though she was arrested.",
                                    "author": "springaugust",
                                    "id": "fyz5dez",
                                    "parent_id": "t1_fyyrwf1",
                                    "score": 4,
                                    "created_utc": 1595509458.0,
                                    "replies": []
                                },
                                {
                                    "body": "In general terms yeah that’s true but in running man, her ace title stemmed from her being good at games, specially luck-based ones. You may not believe in luck but a lot of people do and although rm may exaggerate her luck, exaggeration is still based on truth. For example the pebble game where they had to guess the amount of pebbles in the players’ hands, she predicted correctly five times in a row- all kill game, it required no skill, she was just lucky. \n\nWhen I mentioned most wins, I meant winning the overall game/ep and in most of her solo wins, it wasn’t even from normal name tag ripping ones. I don’t even think she ever won overall from a name tag ripping game. I never said she was strong, just that she wasn’t the weakest.\n\nI honestly don’t think people are fooled into thinking rm is unscripted, in fact sometimes people even doubt when some members in general win since it is a variety show after all. As for being too complimentary, I don’t see that as a problem, everyone has their own biases and of course they’re going to boost them up. It’s only truly a problem when others are dragged down. As I mentioned, the ace thing came from being good at games but also as the show progressed, other factors such as her bravery and overall personality added to it.",
                                    "author": "iwantbubbleteanowpls",
                                    "id": "fyywyzl",
                                    "parent_id": "t1_fyyrwf1",
                                    "score": 3,
                                    "created_utc": 1595502995.0,
                                    "replies": [
                                        {
                                            "body": "Fair points, although I disagree with pretty much all of them, I can see how Running Man's narrative lead people to think like you. You may think she's good at games because of the constant \"that's our ace\" editing shoved down every one's throat in the past. Another member could've done the same exact thing or even better without any recognition as being the 'ace'. A large proportion, especially in the early days of RM concluded with a name tag ripping game to obtain the final win/prize. It'd be impossible to claim she had the most wins without winning a good chunk of name tag ripping games. \n\nIf we can both agree that she's not even close to being the smartest, strongest, fastest, wittiest, etc, do you honestly believe that she would have the most wins solely on her own merit? Aren't the traits that I mentioned above important to be an ace? Exaggeration may be based on truth, but not necessarily every instance. For example, when SJH and LKS 'fight', heavily exaggerated, but nowhere near the truth if it were real. \n\nYou even conceded to the fact that her luck is exaggerated, which is extremely arbitrary, and the only trait that she holds above the other members. Aren't you arguing that her ace title is deserved? I don't see how gaining advantages from writing and production is deserving. \n\nI never said being too complimentary is a problem. I am saying that in the same way someone's perspective can be skewed from prior prejudices against her, the same can be said for someone with unconditional biases in favor of her.",
                                            "author": "babushka142",
                                            "id": "fz0l7vn",
                                            "parent_id": "t1_fyywyzl",
                                            "score": 7,
                                            "created_utc": 1595534993.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "i think what makes ji hyo the ace is the fact that she’s not afraid to try new things and is always willing to put up a fight even if she’s a girl. That’s ace quality, being FEARLESS. Ofc she’s the weakest, she’s the only girl but did she let that get on her way? NO. It’s not just the Macau episode. She’s the bravest one next to Jong Kook and I think that’s what makes her the ace. U say you’re not a hater but i think you’re wrong. I also hate it when people watch something/someone too critically because they have a prejudice against that person. Ji hyo was added to the cast because they thought they needed a girl or a damsel in distress but that was not the case with ji hyo because she tries her best at any challenge. And I think she deserves to be put up on a pedestal because she’s an inspiration to girls that you can do anything if you try in a world that’s dominated by guys.",
                    "author": "youngjae10",
                    "id": "fyymdk4",
                    "parent_id": "t1_fyy88pm",
                    "score": 3,
                    "created_utc": 1595492523.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "what episodes did KS say those things? lol I love it when they make up stories about other members (like KJK having children in US, LKS visiting JSM in her apartment, etc.)\n\nI'd appreciate it if others also share rumor episodes lol thanks!",
            "author": "OppafromPH",
            "id": "fz2lx54",
            "parent_id": "t1_fyys3ew",
            "score": 3,
            "created_utc": 1595579641.0,
            "replies": [
                {
                    "body": "Theyre pretty early episodes I can see if I can find them tonight but it was when LkS had long hair and a big mustache looked like he was 50 lol",
                    "author": "kiikkoman",
                    "id": "fzu1u2h",
                    "parent_id": "t1_fz2lx54",
                    "score": 2,
                    "created_utc": 1596173403.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "she's a brilliant actress HAHAHA",
            "author": "fudgee02",
            "id": "fz6e7nk",
            "parent_id": "t1_fyxxev6",
            "score": 1,
            "created_utc": 1595662547.0,
            "replies": []
        },
        {
            "body": "Episode >!505!< if I recall correctly",
            "author": "bigbangandromeda",
            "id": "fz1f3c7",
            "parent_id": "t1_fyyplxu",
            "score": 1,
            "created_utc": 1595550176.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz31hh4",
                    "parent_id": "t1_fz1f3c7",
                    "score": 2,
                    "created_utc": 1595593785.0,
                    "replies": [
                        {
                            "body": "OH I’m wrong it’s episode >!510!< oops",
                            "author": "bigbangandromeda",
                            "id": "fz5e9c9",
                            "parent_id": "t1_fz31hh4",
                            "score": 3,
                            "created_utc": 1595637250.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some people just arent afraid of heights, when u compare it to her fear of insects it seems like polar opposites.",
            "author": "loldiiij",
            "id": "fyy9ruc",
            "parent_id": "t1_fyy9bot",
            "score": 8,
            "created_utc": 1595480952.0,
            "replies": [
                {
                    "body": "That is very true, especially since in addition to bugs, JH also fears her mom. It’s a stark enough contrast that it adds a layer to her variety persona. Similar to how JK’s physique contrasts his singing voice or how SJ is one of the members that keeps up with “the youth’s” trends and has a particular kind of confidence, despite being the oldest member and one of the weakest. Even if members may have features that may be seen as disadvantages or flaws, they add to their personas and contributions to the show.",
                    "author": "amelisa28",
                    "id": "fyyauvo",
                    "parent_id": "t1_fyy9ruc",
                    "score": -2,
                    "created_utc": 1595481813.0,
                    "replies": [
                        {
                            "body": "Her mong ji persona in general for me was way more fun than the ace one, since when u think of an ace u usually would think its someone sharp and in good condition, mong ji usually comes to sets looking tired and as if she just woke up. The contrast between the both is that she doesnt know how to play to her mong ji strenghts since she's an actress and being sloppy could ruin her career, being the ace i think was easier since she usually just needed to be agressive and act dominant w members like haha, seok jin n kwang soo.",
                            "author": "loldiiij",
                            "id": "fyybylv",
                            "parent_id": "t1_fyyauvo",
                            "score": 4,
                            "created_utc": 1595482708.0,
                            "replies": [
                                {
                                    "body": "I think for me, I find Mong Ji and Angry Bird/Yok Jihyo (I differentiate that as a different persona from her Ace persona) funny, but enjoy Ace Jihyo more since I‘m happier when I see other people that I like be happy or having fun. For that same reason, I really love seeing warm exchanges between the cast members, which is why I’m grateful we’ve gotten to see more interactions between JH and SM since there is a different support system between them versus how they are separately with the guys.\n\nThat in mind, I would think that the show is better off incorporating a versatile persona by having both of those extreme ends (and whatever in between) since it then appeals to a wider audience. \n\nHowever, I am curious that if not for the pandemic, there would be more instances of the daredevil side of her Ace persona since a lot of those came out during episodes with traveling. It would be interesting to see if more complicated facets would come out from there since we’ve gotten to see more dynamics and aspects of the cast members in recent episodes due to how much Bopil focuses on them.",
                                    "author": "amelisa28",
                                    "id": "fyyebuo",
                                    "parent_id": "t1_fyybylv",
                                    "score": 1,
                                    "created_utc": 1595484712.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What I love the most about the Macau jump though was that she volunteered to do it for the other team just because she felt sleepy climbing up the top of the building 😂",
            "author": "iwantbubbleteanowpls",
            "id": "fyyn87g",
            "parent_id": "t1_fyy9bot",
            "score": 2,
            "created_utc": 1595493389.0,
            "replies": []
        },
        {
            "body": "well, all the members play roles in the show. Sometimes, editing, crew, and other members helping out to establish the character. I am sure some of the brilliant moments by members like Haha and YJS were also not completely organic. ANd Kwangsoo's Unlucky character is for sure hyped up. \n\nWell, nobody is thinking that SJH will actually win in a completely competitive game played by rules, like in Olympics or cool kiz on the block. She is fearless and more tolerant to pain and doesn't mind getting physical in the game. Well, they played it up obviously but so what? Every adult, sensible person knows that the members' variety persona is exaggerated.",
            "author": "rainsunicecream",
            "id": "fyyfp5e",
            "parent_id": "t1_fyy88pm",
            "score": 8,
            "created_utc": 1595485927.0,
            "replies": []
        },
        {
            "body": "That’s three weekness you’ve listed, one is very arguable if you mean physically weak since she’s stronger than SJ, has beaten other members a few times and even carried Gary once on a mission. So that’s two against the strengths that I listed. \nI don’t get how her “old wins” and “girl crush moments” (there’s more than that one moment in Macau) doesn’t make her deserving of that title? \nAnd also that’s called tactic, waiting at the last minute when others are fighting and she ousts the last person remaining. Obviously she’s at a disadvantage so instead of going head on she bids her time and waits for the last fight before making her move, that’s what a strategy is and a smart one at that. \nPeople are going to put her on a pedestal because they find her special and there’s nothing wrong with that, especially as they have reasons to put her on one.",
            "author": "iwantbubbleteanowpls",
            "id": "fyyn3xz",
            "parent_id": "t1_fyy88pm",
            "score": 3,
            "created_utc": 1595493266.0,
            "replies": [
                {
                    "body": "It is commendable that she wasn't afraid to be physical, at least in the early days. The title of ace derives from playing cards, as being the highest valued card, the best of the best. Out of all the running man members, she is not even close to being the smartest, fastest, strongest, wittiest, etc, all traits that are essential to majority of their missions. Luck is arguable, I don't believe in it, especially not on a television show that can easily manipulate factors to create a narrative. Braveness, second to JK imo, and possibly other members that play it up for the camera. \n\nAs for most wins, you'd have to be extremely naive to believe that she would be able to win any name-tag ripping games without any advantages from the writing and production, or members taking it easy on her or simply ignoring her. Correct me if I'm wrong, but I'm assuming you're not experienced or knowledgeable in any athletics or sports associated with strength. It is nearly impossible for a female with a weight disparity of (\\~40?) lbs, without any discipline in strength training to be physically stronger than any healthy male that hasn't suffered from muscle atrophy, and yes that includes JSJ. \n\nThere's nothing wrong with people putting her on a pedestal, but I believe a large percentage that do so don't realize that her title of ace is completely fabricated. Someone above mentioned being too critical of her because of prejudices against her, but the same can be said of those too complimentary of her because of biases in favor of her. Everything I mentioned above seems pretty objective, without any prejudices nor biases imo.",
                    "author": "babushka142",
                    "id": "fyyrwf1",
                    "parent_id": "t1_fyyn3xz",
                    "score": 7,
                    "created_utc": 1595498164.0,
                    "replies": [
                        {
                            "body": "Those people who overate JH don't know how variety works or think all her wins in the early years are because of her superior tactic and strength. RM was most scripted with fabricated scenarios and outcomes in the early years. In spy missions, it is so obvious they want the spy not to be outed till the fag end of the race. The exceptions are LKS and JSJ who can be outed because the episodes are funnier with such twists. It is an unwritten rule that RM members almost never out a member even when they know that person is suspicious. One recent example that comes to mind is how no member outed  SJH when she was the spy along with LKS in a recent episode. It was a male guest guesting on RM for the second time who mentioned her name. So did the members who have known her for 10 years get fooled because of her acting? From the expressions on everyone's faces, you could see the cast and the PDs didn't want it since it was going off script and she wouldn't get screen time. The PD then allowed her to participate in the games though she was arrested.",
                            "author": "springaugust",
                            "id": "fyz5dez",
                            "parent_id": "t1_fyyrwf1",
                            "score": 4,
                            "created_utc": 1595509458.0,
                            "replies": []
                        },
                        {
                            "body": "In general terms yeah that’s true but in running man, her ace title stemmed from her being good at games, specially luck-based ones. You may not believe in luck but a lot of people do and although rm may exaggerate her luck, exaggeration is still based on truth. For example the pebble game where they had to guess the amount of pebbles in the players’ hands, she predicted correctly five times in a row- all kill game, it required no skill, she was just lucky. \n\nWhen I mentioned most wins, I meant winning the overall game/ep and in most of her solo wins, it wasn’t even from normal name tag ripping ones. I don’t even think she ever won overall from a name tag ripping game. I never said she was strong, just that she wasn’t the weakest.\n\nI honestly don’t think people are fooled into thinking rm is unscripted, in fact sometimes people even doubt when some members in general win since it is a variety show after all. As for being too complimentary, I don’t see that as a problem, everyone has their own biases and of course they’re going to boost them up. It’s only truly a problem when others are dragged down. As I mentioned, the ace thing came from being good at games but also as the show progressed, other factors such as her bravery and overall personality added to it.",
                            "author": "iwantbubbleteanowpls",
                            "id": "fyywyzl",
                            "parent_id": "t1_fyyrwf1",
                            "score": 3,
                            "created_utc": 1595502995.0,
                            "replies": [
                                {
                                    "body": "Fair points, although I disagree with pretty much all of them, I can see how Running Man's narrative lead people to think like you. You may think she's good at games because of the constant \"that's our ace\" editing shoved down every one's throat in the past. Another member could've done the same exact thing or even better without any recognition as being the 'ace'. A large proportion, especially in the early days of RM concluded with a name tag ripping game to obtain the final win/prize. It'd be impossible to claim she had the most wins without winning a good chunk of name tag ripping games. \n\nIf we can both agree that she's not even close to being the smartest, strongest, fastest, wittiest, etc, do you honestly believe that she would have the most wins solely on her own merit? Aren't the traits that I mentioned above important to be an ace? Exaggeration may be based on truth, but not necessarily every instance. For example, when SJH and LKS 'fight', heavily exaggerated, but nowhere near the truth if it were real. \n\nYou even conceded to the fact that her luck is exaggerated, which is extremely arbitrary, and the only trait that she holds above the other members. Aren't you arguing that her ace title is deserved? I don't see how gaining advantages from writing and production is deserving. \n\nI never said being too complimentary is a problem. I am saying that in the same way someone's perspective can be skewed from prior prejudices against her, the same can be said for someone with unconditional biases in favor of her.",
                                    "author": "babushka142",
                                    "id": "fz0l7vn",
                                    "parent_id": "t1_fyywyzl",
                                    "score": 7,
                                    "created_utc": 1595534993.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "i think what makes ji hyo the ace is the fact that she’s not afraid to try new things and is always willing to put up a fight even if she’s a girl. That’s ace quality, being FEARLESS. Ofc she’s the weakest, she’s the only girl but did she let that get on her way? NO. It’s not just the Macau episode. She’s the bravest one next to Jong Kook and I think that’s what makes her the ace. U say you’re not a hater but i think you’re wrong. I also hate it when people watch something/someone too critically because they have a prejudice against that person. Ji hyo was added to the cast because they thought they needed a girl or a damsel in distress but that was not the case with ji hyo because she tries her best at any challenge. And I think she deserves to be put up on a pedestal because she’s an inspiration to girls that you can do anything if you try in a world that’s dominated by guys.",
            "author": "youngjae10",
            "id": "fyymdk4",
            "parent_id": "t1_fyy88pm",
            "score": 3,
            "created_utc": 1595492523.0,
            "replies": []
        },
        {
            "body": "Theyre pretty early episodes I can see if I can find them tonight but it was when LkS had long hair and a big mustache looked like he was 50 lol",
            "author": "kiikkoman",
            "id": "fzu1u2h",
            "parent_id": "t1_fz2lx54",
            "score": 2,
            "created_utc": 1596173403.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz31hh4",
            "parent_id": "t1_fz1f3c7",
            "score": 2,
            "created_utc": 1595593785.0,
            "replies": [
                {
                    "body": "OH I’m wrong it’s episode >!510!< oops",
                    "author": "bigbangandromeda",
                    "id": "fz5e9c9",
                    "parent_id": "t1_fz31hh4",
                    "score": 3,
                    "created_utc": 1595637250.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is very true, especially since in addition to bugs, JH also fears her mom. It’s a stark enough contrast that it adds a layer to her variety persona. Similar to how JK’s physique contrasts his singing voice or how SJ is one of the members that keeps up with “the youth’s” trends and has a particular kind of confidence, despite being the oldest member and one of the weakest. Even if members may have features that may be seen as disadvantages or flaws, they add to their personas and contributions to the show.",
            "author": "amelisa28",
            "id": "fyyauvo",
            "parent_id": "t1_fyy9ruc",
            "score": -2,
            "created_utc": 1595481813.0,
            "replies": [
                {
                    "body": "Her mong ji persona in general for me was way more fun than the ace one, since when u think of an ace u usually would think its someone sharp and in good condition, mong ji usually comes to sets looking tired and as if she just woke up. The contrast between the both is that she doesnt know how to play to her mong ji strenghts since she's an actress and being sloppy could ruin her career, being the ace i think was easier since she usually just needed to be agressive and act dominant w members like haha, seok jin n kwang soo.",
                    "author": "loldiiij",
                    "id": "fyybylv",
                    "parent_id": "t1_fyyauvo",
                    "score": 4,
                    "created_utc": 1595482708.0,
                    "replies": [
                        {
                            "body": "I think for me, I find Mong Ji and Angry Bird/Yok Jihyo (I differentiate that as a different persona from her Ace persona) funny, but enjoy Ace Jihyo more since I‘m happier when I see other people that I like be happy or having fun. For that same reason, I really love seeing warm exchanges between the cast members, which is why I’m grateful we’ve gotten to see more interactions between JH and SM since there is a different support system between them versus how they are separately with the guys.\n\nThat in mind, I would think that the show is better off incorporating a versatile persona by having both of those extreme ends (and whatever in between) since it then appeals to a wider audience. \n\nHowever, I am curious that if not for the pandemic, there would be more instances of the daredevil side of her Ace persona since a lot of those came out during episodes with traveling. It would be interesting to see if more complicated facets would come out from there since we’ve gotten to see more dynamics and aspects of the cast members in recent episodes due to how much Bopil focuses on them.",
                            "author": "amelisa28",
                            "id": "fyyebuo",
                            "parent_id": "t1_fyybylv",
                            "score": 1,
                            "created_utc": 1595484712.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It is commendable that she wasn't afraid to be physical, at least in the early days. The title of ace derives from playing cards, as being the highest valued card, the best of the best. Out of all the running man members, she is not even close to being the smartest, fastest, strongest, wittiest, etc, all traits that are essential to majority of their missions. Luck is arguable, I don't believe in it, especially not on a television show that can easily manipulate factors to create a narrative. Braveness, second to JK imo, and possibly other members that play it up for the camera. \n\nAs for most wins, you'd have to be extremely naive to believe that she would be able to win any name-tag ripping games without any advantages from the writing and production, or members taking it easy on her or simply ignoring her. Correct me if I'm wrong, but I'm assuming you're not experienced or knowledgeable in any athletics or sports associated with strength. It is nearly impossible for a female with a weight disparity of (\\~40?) lbs, without any discipline in strength training to be physically stronger than any healthy male that hasn't suffered from muscle atrophy, and yes that includes JSJ. \n\nThere's nothing wrong with people putting her on a pedestal, but I believe a large percentage that do so don't realize that her title of ace is completely fabricated. Someone above mentioned being too critical of her because of prejudices against her, but the same can be said of those too complimentary of her because of biases in favor of her. Everything I mentioned above seems pretty objective, without any prejudices nor biases imo.",
            "author": "babushka142",
            "id": "fyyrwf1",
            "parent_id": "t1_fyyn3xz",
            "score": 7,
            "created_utc": 1595498164.0,
            "replies": [
                {
                    "body": "Those people who overate JH don't know how variety works or think all her wins in the early years are because of her superior tactic and strength. RM was most scripted with fabricated scenarios and outcomes in the early years. In spy missions, it is so obvious they want the spy not to be outed till the fag end of the race. The exceptions are LKS and JSJ who can be outed because the episodes are funnier with such twists. It is an unwritten rule that RM members almost never out a member even when they know that person is suspicious. One recent example that comes to mind is how no member outed  SJH when she was the spy along with LKS in a recent episode. It was a male guest guesting on RM for the second time who mentioned her name. So did the members who have known her for 10 years get fooled because of her acting? From the expressions on everyone's faces, you could see the cast and the PDs didn't want it since it was going off script and she wouldn't get screen time. The PD then allowed her to participate in the games though she was arrested.",
                    "author": "springaugust",
                    "id": "fyz5dez",
                    "parent_id": "t1_fyyrwf1",
                    "score": 4,
                    "created_utc": 1595509458.0,
                    "replies": []
                },
                {
                    "body": "In general terms yeah that’s true but in running man, her ace title stemmed from her being good at games, specially luck-based ones. You may not believe in luck but a lot of people do and although rm may exaggerate her luck, exaggeration is still based on truth. For example the pebble game where they had to guess the amount of pebbles in the players’ hands, she predicted correctly five times in a row- all kill game, it required no skill, she was just lucky. \n\nWhen I mentioned most wins, I meant winning the overall game/ep and in most of her solo wins, it wasn’t even from normal name tag ripping ones. I don’t even think she ever won overall from a name tag ripping game. I never said she was strong, just that she wasn’t the weakest.\n\nI honestly don’t think people are fooled into thinking rm is unscripted, in fact sometimes people even doubt when some members in general win since it is a variety show after all. As for being too complimentary, I don’t see that as a problem, everyone has their own biases and of course they’re going to boost them up. It’s only truly a problem when others are dragged down. As I mentioned, the ace thing came from being good at games but also as the show progressed, other factors such as her bravery and overall personality added to it.",
                    "author": "iwantbubbleteanowpls",
                    "id": "fyywyzl",
                    "parent_id": "t1_fyyrwf1",
                    "score": 3,
                    "created_utc": 1595502995.0,
                    "replies": [
                        {
                            "body": "Fair points, although I disagree with pretty much all of them, I can see how Running Man's narrative lead people to think like you. You may think she's good at games because of the constant \"that's our ace\" editing shoved down every one's throat in the past. Another member could've done the same exact thing or even better without any recognition as being the 'ace'. A large proportion, especially in the early days of RM concluded with a name tag ripping game to obtain the final win/prize. It'd be impossible to claim she had the most wins without winning a good chunk of name tag ripping games. \n\nIf we can both agree that she's not even close to being the smartest, strongest, fastest, wittiest, etc, do you honestly believe that she would have the most wins solely on her own merit? Aren't the traits that I mentioned above important to be an ace? Exaggeration may be based on truth, but not necessarily every instance. For example, when SJH and LKS 'fight', heavily exaggerated, but nowhere near the truth if it were real. \n\nYou even conceded to the fact that her luck is exaggerated, which is extremely arbitrary, and the only trait that she holds above the other members. Aren't you arguing that her ace title is deserved? I don't see how gaining advantages from writing and production is deserving. \n\nI never said being too complimentary is a problem. I am saying that in the same way someone's perspective can be skewed from prior prejudices against her, the same can be said for someone with unconditional biases in favor of her.",
                            "author": "babushka142",
                            "id": "fz0l7vn",
                            "parent_id": "t1_fyywyzl",
                            "score": 7,
                            "created_utc": 1595534993.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "OH I’m wrong it’s episode >!510!< oops",
            "author": "bigbangandromeda",
            "id": "fz5e9c9",
            "parent_id": "t1_fz31hh4",
            "score": 3,
            "created_utc": 1595637250.0,
            "replies": []
        },
        {
            "body": "Her mong ji persona in general for me was way more fun than the ace one, since when u think of an ace u usually would think its someone sharp and in good condition, mong ji usually comes to sets looking tired and as if she just woke up. The contrast between the both is that she doesnt know how to play to her mong ji strenghts since she's an actress and being sloppy could ruin her career, being the ace i think was easier since she usually just needed to be agressive and act dominant w members like haha, seok jin n kwang soo.",
            "author": "loldiiij",
            "id": "fyybylv",
            "parent_id": "t1_fyyauvo",
            "score": 4,
            "created_utc": 1595482708.0,
            "replies": [
                {
                    "body": "I think for me, I find Mong Ji and Angry Bird/Yok Jihyo (I differentiate that as a different persona from her Ace persona) funny, but enjoy Ace Jihyo more since I‘m happier when I see other people that I like be happy or having fun. For that same reason, I really love seeing warm exchanges between the cast members, which is why I’m grateful we’ve gotten to see more interactions between JH and SM since there is a different support system between them versus how they are separately with the guys.\n\nThat in mind, I would think that the show is better off incorporating a versatile persona by having both of those extreme ends (and whatever in between) since it then appeals to a wider audience. \n\nHowever, I am curious that if not for the pandemic, there would be more instances of the daredevil side of her Ace persona since a lot of those came out during episodes with traveling. It would be interesting to see if more complicated facets would come out from there since we’ve gotten to see more dynamics and aspects of the cast members in recent episodes due to how much Bopil focuses on them.",
                    "author": "amelisa28",
                    "id": "fyyebuo",
                    "parent_id": "t1_fyybylv",
                    "score": 1,
                    "created_utc": 1595484712.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Those people who overate JH don't know how variety works or think all her wins in the early years are because of her superior tactic and strength. RM was most scripted with fabricated scenarios and outcomes in the early years. In spy missions, it is so obvious they want the spy not to be outed till the fag end of the race. The exceptions are LKS and JSJ who can be outed because the episodes are funnier with such twists. It is an unwritten rule that RM members almost never out a member even when they know that person is suspicious. One recent example that comes to mind is how no member outed  SJH when she was the spy along with LKS in a recent episode. It was a male guest guesting on RM for the second time who mentioned her name. So did the members who have known her for 10 years get fooled because of her acting? From the expressions on everyone's faces, you could see the cast and the PDs didn't want it since it was going off script and she wouldn't get screen time. The PD then allowed her to participate in the games though she was arrested.",
            "author": "springaugust",
            "id": "fyz5dez",
            "parent_id": "t1_fyyrwf1",
            "score": 4,
            "created_utc": 1595509458.0,
            "replies": []
        },
        {
            "body": "In general terms yeah that’s true but in running man, her ace title stemmed from her being good at games, specially luck-based ones. You may not believe in luck but a lot of people do and although rm may exaggerate her luck, exaggeration is still based on truth. For example the pebble game where they had to guess the amount of pebbles in the players’ hands, she predicted correctly five times in a row- all kill game, it required no skill, she was just lucky. \n\nWhen I mentioned most wins, I meant winning the overall game/ep and in most of her solo wins, it wasn’t even from normal name tag ripping ones. I don’t even think she ever won overall from a name tag ripping game. I never said she was strong, just that she wasn’t the weakest.\n\nI honestly don’t think people are fooled into thinking rm is unscripted, in fact sometimes people even doubt when some members in general win since it is a variety show after all. As for being too complimentary, I don’t see that as a problem, everyone has their own biases and of course they’re going to boost them up. It’s only truly a problem when others are dragged down. As I mentioned, the ace thing came from being good at games but also as the show progressed, other factors such as her bravery and overall personality added to it.",
            "author": "iwantbubbleteanowpls",
            "id": "fyywyzl",
            "parent_id": "t1_fyyrwf1",
            "score": 3,
            "created_utc": 1595502995.0,
            "replies": [
                {
                    "body": "Fair points, although I disagree with pretty much all of them, I can see how Running Man's narrative lead people to think like you. You may think she's good at games because of the constant \"that's our ace\" editing shoved down every one's throat in the past. Another member could've done the same exact thing or even better without any recognition as being the 'ace'. A large proportion, especially in the early days of RM concluded with a name tag ripping game to obtain the final win/prize. It'd be impossible to claim she had the most wins without winning a good chunk of name tag ripping games. \n\nIf we can both agree that she's not even close to being the smartest, strongest, fastest, wittiest, etc, do you honestly believe that she would have the most wins solely on her own merit? Aren't the traits that I mentioned above important to be an ace? Exaggeration may be based on truth, but not necessarily every instance. For example, when SJH and LKS 'fight', heavily exaggerated, but nowhere near the truth if it were real. \n\nYou even conceded to the fact that her luck is exaggerated, which is extremely arbitrary, and the only trait that she holds above the other members. Aren't you arguing that her ace title is deserved? I don't see how gaining advantages from writing and production is deserving. \n\nI never said being too complimentary is a problem. I am saying that in the same way someone's perspective can be skewed from prior prejudices against her, the same can be said for someone with unconditional biases in favor of her.",
                    "author": "babushka142",
                    "id": "fz0l7vn",
                    "parent_id": "t1_fyywyzl",
                    "score": 7,
                    "created_utc": 1595534993.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think for me, I find Mong Ji and Angry Bird/Yok Jihyo (I differentiate that as a different persona from her Ace persona) funny, but enjoy Ace Jihyo more since I‘m happier when I see other people that I like be happy or having fun. For that same reason, I really love seeing warm exchanges between the cast members, which is why I’m grateful we’ve gotten to see more interactions between JH and SM since there is a different support system between them versus how they are separately with the guys.\n\nThat in mind, I would think that the show is better off incorporating a versatile persona by having both of those extreme ends (and whatever in between) since it then appeals to a wider audience. \n\nHowever, I am curious that if not for the pandemic, there would be more instances of the daredevil side of her Ace persona since a lot of those came out during episodes with traveling. It would be interesting to see if more complicated facets would come out from there since we’ve gotten to see more dynamics and aspects of the cast members in recent episodes due to how much Bopil focuses on them.",
            "author": "amelisa28",
            "id": "fyyebuo",
            "parent_id": "t1_fyybylv",
            "score": 1,
            "created_utc": 1595484712.0,
            "replies": []
        },
        {
            "body": "Fair points, although I disagree with pretty much all of them, I can see how Running Man's narrative lead people to think like you. You may think she's good at games because of the constant \"that's our ace\" editing shoved down every one's throat in the past. Another member could've done the same exact thing or even better without any recognition as being the 'ace'. A large proportion, especially in the early days of RM concluded with a name tag ripping game to obtain the final win/prize. It'd be impossible to claim she had the most wins without winning a good chunk of name tag ripping games. \n\nIf we can both agree that she's not even close to being the smartest, strongest, fastest, wittiest, etc, do you honestly believe that she would have the most wins solely on her own merit? Aren't the traits that I mentioned above important to be an ace? Exaggeration may be based on truth, but not necessarily every instance. For example, when SJH and LKS 'fight', heavily exaggerated, but nowhere near the truth if it were real. \n\nYou even conceded to the fact that her luck is exaggerated, which is extremely arbitrary, and the only trait that she holds above the other members. Aren't you arguing that her ace title is deserved? I don't see how gaining advantages from writing and production is deserving. \n\nI never said being too complimentary is a problem. I am saying that in the same way someone's perspective can be skewed from prior prejudices against her, the same can be said for someone with unconditional biases in favor of her.",
            "author": "babushka142",
            "id": "fz0l7vn",
            "parent_id": "t1_fyywyzl",
            "score": 7,
            "created_utc": 1595534993.0,
            "replies": []
        }
    ]
}