{
    "title": "Me, My Depression and Running Man",
    "post_id": "htxpud",
    "post_url": "https://www.reddit.com/r/runningman/comments/htxpud/me_my_depression_and_running_man/",
    "author": "cherryxjam",
    "body": "It was February when I was diagnosed with Clinical Depression. I am living alone and just got off a six year relationship. I lost all my friends and most of the time never speak at work. The next thing I knew, the Pandemic hits and I'm worse than ever.\n\nI took another suicide attempt on May(first one was before I was diagnosed) which I thought would kill me since I could not ask anyone for help due to eh lockdown. Days of diarrhea and fever later I still managed to survive.\n\nIt was June when Twice held their comeback. I decided to binge watch all the shows they have been. Youtube algorithm led me to their third appearance at Knowing Bros. What a weird show I thought. But knowing that the characters have a dark past before and how they overcome it made me hopeful. Next thing I knew, I've watch around 30 eps. This is how I was introduced into variety shows.\n\nNetflix seems to knew as the next recommendation to me was Busted. Another weird show I guess. But hell do I enjoy it. Plot twists, humor, their characters and all. Took me three days to finish both seasons. And yes I craved for more.\n\nSo Google search suggested Running Man. I watched few clips on yt and I'm hooked. Did watch some eps. from Viu but I wanted  to watch from ep. 1 which is not available on the platform. Then I joined this community and was able to access the myrunningman.com. I have finished 100 eps and eps 500-current, which still is a long way to go.\n\nOn my last meeting with my therapist she seem to have seen some improvements in me. I now exercise daily, perform yoga and meditation and cook and eat healthier food. My workmates also seem to notice the change.\n\nLong story short, I would like to thank all mods here as well as the web admin, subbers and seeders of the myrunningman.com site to make the show accessible for international fans. This show and everyone who made it should know that you've helped at least a single soul get better from their depression.\n\nHopeful for their concert in the Philippines to be successful as well as I already reserved a VIP seat. :)\n\nTLDR; I've a depression, Running Man and other variety shows helped me get through it. My therapist is glad I'm no longer having dark thoughts.",
    "url": "https://www.reddit.com/r/runningman/comments/htxpud/me_my_depression_and_running_man/",
    "score": 278,
    "upvote_ratio": 0.98,
    "created_utc": 1595150260.0,
    "num_comments": 39,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Huge respect to you.",
            "author": null,
            "id": "fyjn715",
            "parent_id": "t3_htxpud",
            "score": 25,
            "created_utc": 1595151893.0,
            "replies": [
                {
                    "body": "Hn7nu",
                    "author": "nina_wants_to_fly",
                    "id": "fyk3omn",
                    "parent_id": "t1_fyjn715",
                    "score": 1,
                    "created_utc": 1595166782.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am glad you are still here and that you're getting support through therapy! When I'm telling my friends about Running Man, I usually call it my source of joy for the last four years (which is when I discovered it). Everyone absolutely benefits from having something in their lives that they can look forward to, and I'm glad you've found that with this show.",
            "author": "ShellsFeathersFur",
            "id": "fyjngpp",
            "parent_id": "t3_htxpud",
            "score": 20,
            "created_utc": 1595152195.0,
            "replies": []
        },
        {
            "body": "Running man helped me through some tough days during grad school. Such a special show.",
            "author": "alienfromjupiter",
            "id": "fyjpxz1",
            "parent_id": "t3_htxpud",
            "score": 14,
            "created_utc": 1595154941.0,
            "replies": [
                {
                    "body": "me too! i had to drop out for reasons, but throughout it all, running man helped give me the good times i desperately needed!",
                    "author": "Cat4Why7",
                    "id": "fyku4a1",
                    "parent_id": "t1_fyjpxz1",
                    "score": 6,
                    "created_utc": 1595181576.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am so proud of you and your story. Running Man did the same thing to me. A few weeks ago, I was already so convinced of ending everything in my life as well. I made a suicide note and put it on my bedside table. But i couldn't calm myself down so I watched the episode 473, the one with the they cant laugh challenge, which was by far the funniest thing I have ever seen. That moment of euphoria saved my life. Running Man saved my life at that moment, and I haven't looked back since. \n\nYour journey is an inspiration.",
            "author": "MFlash08",
            "id": "fyjvsz0",
            "parent_id": "t3_htxpud",
            "score": 14,
            "created_utc": 1595160730.0,
            "replies": []
        },
        {
            "body": "Just think that KJK is gonna get angry when you don't eat healthy and exercise. Fighting!",
            "author": "rvxmaedncx",
            "id": "fyjpvuo",
            "parent_id": "t3_htxpud",
            "score": 19,
            "created_utc": 1595154876.0,
            "replies": []
        },
        {
            "body": "I'm so glad you were able to tackle your depression😊\n\nEven for me running man holds a special place, when I was depressed at a point of time even my parents and friends couldn't understand, this was the only show that brought me happiness and laughter.",
            "author": "nehzz44",
            "id": "fyjtrgr",
            "parent_id": "t3_htxpud",
            "score": 8,
            "created_utc": 1595158767.0,
            "replies": []
        },
        {
            "body": "This post is wholesome. I’m from Philippines too and we know how mental illness is not treated seriously here. Kudos to you for seeking medical attention. There is a sub of r/koreanvariety here if you want to check out more shows. I hope it helps you more. :)",
            "author": "Isnihart",
            "id": "fyjqm3t",
            "parent_id": "t3_htxpud",
            "score": 5,
            "created_utc": 1595155667.0,
            "replies": []
        },
        {
            "body": "I am glad to hear that you are doing well and we are so proud of you for coming this far! ♥️ If you don't mind, I would like to suggest 2 shows that I found calming and giving positive vibe to my life. Hyori's Bed and Breakfast and Youn's Kitchen.\n\nFor context, Hyori's B&B is about Hyori, a once-superstar (still are imo haha) running a B&B with her loving husband, Sangsoon (musician) along with the help of part-timer (IU in season 1 and Yoona & Park Bogum in season 2). It's available on Netflix.\n\nFor Youn's Kitchen, a group of actors and actresses run a restaurant abroad lead by Youn Yuh-jung. Season 1 was filmed in Indonesia with Shin Goo, Lee Seo Jin and Park Yu Mi. Season 2 was filmed in Spain with Lee Seo Jin, Park Yu Mi and Park Seo Joon. I personally like Season 2 :D",
            "author": "liaadh",
            "id": "fyjy7se",
            "parent_id": "t3_htxpud",
            "score": 5,
            "created_utc": 1595162816.0,
            "replies": []
        },
        {
            "body": "Considering how heavy a topic this is and the darker parts of their lives that people are sharing in this post - I would like to encourage those who feel as if they're struggling with finding some form of inner peace and/or have suicidal thoughts, to please reach out for help. Whether family or a friend, just talking about it helps. Doesn't even have to be face-to-face. Preferably a professional, but I know how it can be, so small steps, no?\n\nOn a similar note, please keep doing things that you enjoy whether that's watching the show, a hobby etc. Doing these things helps you stay afloat to hopefully find yourself in a time where you may find more strength to actively pursue a healthier mental state.",
            "author": "BoneToBeWild",
            "id": "fykjp02",
            "parent_id": "t3_htxpud",
            "score": 6,
            "created_utc": 1595176072.0,
            "replies": []
        },
        {
            "body": "So so glad you found Running Man and the other shows. Sending hugs. See you at the Manila Fanmeeting! :)",
            "author": "seoulaces",
            "id": "fyjoc9w",
            "parent_id": "t3_htxpud",
            "score": 5,
            "created_utc": 1595153160.0,
            "replies": []
        },
        {
            "body": "So happy to hear you’re improving. Big respect for sharing this. Cheers to more happy days in future.",
            "author": "nipunsrs",
            "id": "fyjpihr",
            "parent_id": "t3_htxpud",
            "score": 5,
            "created_utc": 1595154477.0,
            "replies": []
        },
        {
            "body": "I’m so happy you found running man! It helped me so much during the time I moved countries (I’m originally from philippines btw!) It’s always going to have a special place in my heart",
            "author": "ee_123ee",
            "id": "fyjr10d",
            "parent_id": "t3_htxpud",
            "score": 5,
            "created_utc": 1595156120.0,
            "replies": []
        },
        {
            "body": "Looking forward to something every Sunday is keeping me from hurting myself. Glad to see it’s helping other people too. Wish you the best",
            "author": "jangdangit",
            "id": "fyjumux",
            "parent_id": "t3_htxpud",
            "score": 5,
            "created_utc": 1595159623.0,
            "replies": []
        },
        {
            "body": "This seriously made me tear up in pride. I'm very proud of you for being in the process of overcoming that struggle. Let's look forward to brighter days.",
            "author": "frankoloxu",
            "id": "fykc7ws",
            "parent_id": "t3_htxpud",
            "score": 4,
            "created_utc": 1595171986.0,
            "replies": []
        },
        {
            "body": "Well, Running man save me too. 5 years ago, I literally on lowest point of my life. Lose friend, failed in degree, got dengue, heart broken. And then i remember previous housemate always laugh like crazy while watch this one show. Yes its runningman. I give it try. My mental health become better. Still watch runningman today, never skip. At least got my little sister join me nowadays.",
            "author": "hafhaf93",
            "id": "fykh67t",
            "parent_id": "t3_htxpud",
            "score": 4,
            "created_utc": 1595174699.0,
            "replies": []
        },
        {
            "body": "For some people, pop culture are the best way to entertain ourselves. To have a good laugh and excitement. I watch running man, football, K-pop, movie and anime as a way to entertain myself. In my life, people are rarely positive plus I'm an introvert as well. Watching this feed my fantasy need and it makes me happy. Throwback to my high school year in 2013/2014, I've got ton of assignment, test, exam and classes for the whole week. Totally exhausting. But Friday night with running man was the moment I waited every week. This show has become my weekly dose of laugh and happiness that totally refresh myself again for next week challenges. What a nostalgia.",
            "author": "ZrlSyM",
            "id": "fyjxler",
            "parent_id": "t3_htxpud",
            "score": 3,
            "created_utc": 1595162303.0,
            "replies": []
        },
        {
            "body": "As the koreans would say, “Fighting!!”\n\n(But OP I feel you, im glad that it has been good and helpful for you too and I wish you all the best)",
            "author": "bleachfann",
            "id": "fyk2p6z",
            "parent_id": "t3_htxpud",
            "score": 3,
            "created_utc": 1595166143.0,
            "replies": []
        },
        {
            "body": "I'm happy that you've made such positive changes in your life, keep it up and let's keep on running! Hopeful for their PH concert as well when things go back to normal :) \n\nI just finished my 500th episode yesterday after two years. I feel so grateful to these people who have no idea how much they've lifted my spirits during the darkest days.",
            "author": "boredandhungryalways",
            "id": "fyk6ac2",
            "parent_id": "t3_htxpud",
            "score": 3,
            "created_utc": 1595168466.0,
            "replies": []
        },
        {
            "body": "Good to know that it isn’t just me that turns to Running Man. This show really has a special place in my heart too. I consider them my family <3 I’ve been through dark times too and this show really helped me. Now, I’m going through another dark phase and Running Man will always be there for me.",
            "author": "jannlani",
            "id": "fykis7r",
            "parent_id": "t3_htxpud",
            "score": 3,
            "created_utc": 1595175577.0,
            "replies": []
        },
        {
            "body": "I'm so happy you're here with us and thank you for sharing your story, which was very humbling. A new thing I've started doing recently is livestreaming a past episode on Twitch every Friday, which is something to look forward to every week; you can find the link at the bottom-right corner of my site to vote on which episode(s) you're interested in. \n\nYou can also join the /r/RunningMan Discord if you want (https://discord.com/invite/m2DMpDa), I'm @andrew on there and we can keep in touch, feel free to private message me any time. This invite also goes out to anyone else :)\n\nMuch love from North America <3",
            "author": "myrunningman",
            "id": "fyktqa5",
            "parent_id": "t3_htxpud",
            "score": 3,
            "created_utc": 1595181383.0,
            "replies": []
        },
        {
            "body": "Seeing your posting and the comments surprised me. I just realize that many people find joy from Running Man when struggling with sadness / depression. I've watched RM since 2012. I wouldn't say that I have clinical depression because I haven't consulted with professional therapist, but this pandemic hits me quite hard. Since April I started to have the anxiety and constant worries. I think it hit the peak in June-mid July. I would suddenly cry, less and less appetite. But fortunately, I still have the interest to watch RM. Not a single day passed without me playing running man videos, whether I really watched it or just doing something while listening to the audio. Playing RM videos as the background of my every other activity really set the mood and atmosphere brighter. I believe I'm getting better and slowly but surely I will overcome the dark feeling that has been haunting me these couple months. I'm greatly thankful to everyone that made it possible for us to enjoy the show, and I wish the best for everyone.\n\noh, and If you like RM maybe you'll enjoy \"Family Outing\" (for me season 1 is preferable). It also has Yoo Jae Suk and Kim Jong Kook, and all other FO members have been guests in RM. It's older (2008-2010) but worth to watch, really.  I've recently rewatched some of the FO episodes.  Although it's supposed to be funny and superficial, I've unexpectedly found a lot of \"life lesson\" from there, like \"Timing is now\", and \"The Flavor of all soups can be enhanced\" (from episode 27 & 29).",
            "author": "Think_things",
            "id": "fyzg0sx",
            "parent_id": "t3_htxpud",
            "score": 3,
            "created_utc": 1595515603.0,
            "replies": []
        },
        {
            "body": "Continue doing good work! Keep on Running!!",
            "author": "shxxbi",
            "id": "fyk2msi",
            "parent_id": "t3_htxpud",
            "score": 2,
            "created_utc": 1595166097.0,
            "replies": []
        },
        {
            "body": "Kkkbnbnnwwwb",
            "author": "nina_wants_to_fly",
            "id": "fyk3p52",
            "parent_id": "t3_htxpud",
            "score": 2,
            "created_utc": 1595166790.0,
            "replies": []
        },
        {
            "body": "Yes! Whenever i feel down or i feel the need to laugh i just pull out running man 🤣😃",
            "author": "seulrene0903",
            "id": "fykd71i",
            "parent_id": "t3_htxpud",
            "score": 2,
            "created_utc": 1595172532.0,
            "replies": []
        },
        {
            "body": "I'm glad you could overcome it. Stay strong.",
            "author": "Ned_Flanders0",
            "id": "fykepw5",
            "parent_id": "t3_htxpud",
            "score": 2,
            "created_utc": 1595173360.0,
            "replies": []
        },
        {
            "body": "Very glad you found Running Man and are here with us. I suffer from depression and have many tines where nothing can get through but my little flicker of joy is RM, it sounds silly to those that don’t have mental health problems but RM has saved many a life.",
            "author": "real_highlight_reel",
            "id": "fykiw7l",
            "parent_id": "t3_htxpud",
            "score": 2,
            "created_utc": 1595175636.0,
            "replies": []
        },
        {
            "body": "Fighting! We can overcome this! 😊😊",
            "author": "jonzdepaz018",
            "id": "fykjpr1",
            "parent_id": "t3_htxpud",
            "score": 2,
            "created_utc": 1595176083.0,
            "replies": []
        },
        {
            "body": "Running man got me through my depression as well! Any time I’m down these days I can count on running man to make me happy again :) I hope they come to my part of US someday",
            "author": "kyramaro",
            "id": "fykjwyn",
            "parent_id": "t3_htxpud",
            "score": 2,
            "created_utc": 1595176191.0,
            "replies": []
        },
        {
            "body": "I am glad you also found the wholesome and uplifting effect of Running Man. It has helped me through some dark times. A weekly dose of good vibes that helped me in the same way.",
            "author": "vereelimee",
            "id": "fykwttu",
            "parent_id": "t3_htxpud",
            "score": 2,
            "created_utc": 1595182979.0,
            "replies": []
        },
        {
            "body": "Laban lang kabayan. Fighting.",
            "author": "MaestroAleks",
            "id": "fykysh9",
            "parent_id": "t3_htxpud",
            "score": 2,
            "created_utc": 1595184014.0,
            "replies": []
        },
        {
            "body": "I haven't been diagnosed or anything, but I felt pretty depressed too recently (still tbh), but I decided to start watching Running Man again Friday (after not watching for like 2 years) and it brought me instant joy and everything felt familiar even after all these years.",
            "author": "DonnaxNL",
            "id": "fyl71ds",
            "parent_id": "t3_htxpud",
            "score": 2,
            "created_utc": 1595188399.0,
            "replies": []
        },
        {
            "body": "So happy for you! Keep going! Fighting!",
            "author": "lazypizza00",
            "id": "fymlcnp",
            "parent_id": "t3_htxpud",
            "score": 2,
            "created_utc": 1595218035.0,
            "replies": []
        },
        {
            "body": "Very happy for you!! Definitely went through the same thing in high school when I was constantly moving running man was my only friend🥺 but as always it always gets better! Cheer up butter cup!\nAlso, korean dramas are my ride or die. The reply series is a good one to start for some light hearted laughs.",
            "author": "misspotatoebum",
            "id": "fymoi48",
            "parent_id": "t3_htxpud",
            "score": 2,
            "created_utc": 1595220332.0,
            "replies": []
        },
        {
            "body": "I worked in a really stressful environment. I would make a ton of mistakes and get reprimanded by my boss. I try my best but would still fail at work all the time. Every week, I would watch one episode of running man and it would make me forget about the stress and allow me to laugh out loud. Korean variety shows really have a magical touch that makes you laugh. I've heard others say that watching tv is a waste of time and that we are just escaping the reality. For me, Tv is my way to release stress, take a break and allow me to continue. I definitely thank all producers, actors, comedians, backstage crews for doing their best to give us a great show to watch every weekend.",
            "author": "vanilladreamcream",
            "id": "fz9gnef",
            "parent_id": "t3_htxpud",
            "score": 2,
            "created_utc": 1595729508.0,
            "replies": []
        },
        {
            "body": "I would also like to suggest Infinity Challenge, I live Alone, Player and 1N2D. They are all great variety shows that make me laugh out loud after watching. Just keep on trying and you will see the light at the end of the world. I've been there and it felt hopeless at first. Although things still aren't great for me right now, I'm hopeful and thank god my parents, family and friends were there to help me out. Don't give up because it will definitely get better.",
            "author": "vanilladreamcream",
            "id": "fz9hgki",
            "parent_id": "t3_htxpud",
            "score": 2,
            "created_utc": 1595730003.0,
            "replies": []
        },
        {
            "body": "Running man is the only thing keeping me sane this quarantine. I’m just glad i’m not alone",
            "author": "acaCianna",
            "id": "fywi96v",
            "parent_id": "t3_htxpud",
            "score": 2,
            "created_utc": 1595445424.0,
            "replies": []
        },
        {
            "body": "Hn7nu",
            "author": "nina_wants_to_fly",
            "id": "fyk3omn",
            "parent_id": "t1_fyjn715",
            "score": 1,
            "created_utc": 1595166782.0,
            "replies": []
        },
        {
            "body": "me too! i had to drop out for reasons, but throughout it all, running man helped give me the good times i desperately needed!",
            "author": "Cat4Why7",
            "id": "fyku4a1",
            "parent_id": "t1_fyjpxz1",
            "score": 6,
            "created_utc": 1595181576.0,
            "replies": []
        }
    ]
}