{
    "title": "YJS revealed to have paid heart transplant patient's 15 million won hospital bill",
    "post_id": "v61pq6",
    "post_url": "https://www.reddit.com/r/runningman/comments/v61pq6/yjs_revealed_to_have_paid_heart_transplant/",
    "author": "awperpro",
    "body": "",
    "url": "https://www.joongang.co.kr/article/25077057",
    "score": 269,
    "upvote_ratio": 1.0,
    "created_utc": 1654516338.0,
    "num_comments": 9,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Some contexts Papago missed:\n- the reason why specifically 15 mil was paid was because the rest of the costs were covered by the patient's insurance.\n-the part where the nurse is mentioned is missing a whole conversation. When the patient heard the philanthropist's name, he asked the nurse if it really is who he thinks it is (and not another person with the same name) and the nurse answered that it indeed is the person you are thinking of.\n\nThanks for sharing the article and love YJS's positive influence everywhere!",
            "author": "Cantfitanythinghere",
            "id": "ibdanmu",
            "parent_id": "t3_v61pq6",
            "score": 81,
            "created_utc": 1654525151.0,
            "replies": []
        },
        {
            "body": ">The story has been revealed that broadcaster Yoo Jae-seok (50) paid 15 million won for a heart patient in need instead.  \n>  \n>Yoo Jae-seok's donation story was first known through an article by a netizen posted on the online community \"Bbom-bbbum\" on the 6th.  \n>  \n>Writer A wrote in the early morning that day, \"My acquaintance couldn't work for a long time because of heart disease,\" adding, \"I had a heart transplant surgery, and the total amount of the hospital came out to be 88 million won, of which 15 million won was paid.\"  \n>  \n>A said, \"The hospital has a system to support people in need, so I received all the hospital expenses with the amount donated by a philanthropist,\" adding, \"The philanthropist only informs the donor of his name, but it was Yoo Jae-seok.\"  \n>  \n>I asked him just in case, and he said he was the one who thought the nurse would tell him. I got goosebumps listening to it, he said. \"He's a real light.\"  \n>  \n>A said, \"As I get help from my close acquaintances, I realize how much you donate. I don't think you'd like to post this, but I think this kind of good story should spread a little,\" he said, explaining the reason why he disclosed the donation.  \n>  \n>Yoo Jae-seok's agency, Antenna, said, \"It is difficult to officially give you a position because it was done by an artist personally.\"  \n>  \n>Yoo Jae-seok has been nicknamed \"a beautiful story vending machine\" by practicing steady donations for neighbors in need due to low-income families, COVID-19 and forest fires.  \n>  \n>Yoo Jae-seok, who made his debut through KBS' first university gag festival in 1991, has recently been active in MBC's \"What Do You Play?\" tvN's \"You Quiz On the Block,\" SBS' \"Running Man\" and tvN's \"Sixth Sense 3.\"\n\nTranslated with Papago",
            "author": "awperpro",
            "id": "ibcuyu5",
            "parent_id": "t3_v61pq6",
            "score": 74,
            "created_utc": 1654516393.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ibd1vsn",
            "parent_id": "t3_v61pq6",
            "score": 50,
            "created_utc": 1654520646.0,
            "replies": [
                {
                    "body": "Seriously.  Hes fucking hilarious and a saint.",
                    "author": "Shintard",
                    "id": "ibfi5hq",
                    "parent_id": "t1_ibd1vsn",
                    "score": 5,
                    "created_utc": 1654560895.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've been supporting my role model since family outing days 2008 (i was 16 years old when i discovered him) and now a MASSIVE fan.\n\nIndeed my role model YJS",
            "author": "JamesHyung",
            "id": "ibfcgtc",
            "parent_id": "t3_v61pq6",
            "score": 11,
            "created_utc": 1654558009.0,
            "replies": []
        },
        {
            "body": "\"A beautiful story vending machine\" that is the perfect way to put it",
            "author": "Arktoscircle",
            "id": "ibggg1t",
            "parent_id": "t3_v61pq6",
            "score": 9,
            "created_utc": 1654580064.0,
            "replies": []
        },
        {
            "body": "a true light to the world",
            "author": "moretoachieve",
            "id": "ibfwse8",
            "parent_id": "t3_v61pq6",
            "score": 7,
            "created_utc": 1654568305.0,
            "replies": []
        },
        {
            "body": "I really respect how he genuinely pays it forward, whether it's donating to good causes or helping entertainers who are struggling or starting out.",
            "author": "fadedcosy",
            "id": "ibfwacd",
            "parent_id": "t3_v61pq6",
            "score": 6,
            "created_utc": 1654568045.0,
            "replies": []
        },
        {
            "body": "Such a good role model.",
            "author": "IAmShe10",
            "id": "ibgyia4",
            "parent_id": "t3_v61pq6",
            "score": 3,
            "created_utc": 1654596074.0,
            "replies": []
        },
        {
            "body": "Heart of gold",
            "author": "TheFluffy-Monster",
            "id": "ibkwpeg",
            "parent_id": "t3_v61pq6",
            "score": 2,
            "created_utc": 1654670004.0,
            "replies": []
        },
        {
            "body": "Seriously.  Hes fucking hilarious and a saint.",
            "author": "Shintard",
            "id": "ibfi5hq",
            "parent_id": "t1_ibd1vsn",
            "score": 5,
            "created_utc": 1654560895.0,
            "replies": []
        }
    ]
}