{
    "title": "But how should your sugar partner feel?",
    "post_id": "ruftpu",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ruftpu/but_how_should_your_sugar_partner_feel/",
    "author": "Azurecole",
    "body": "MThere's a lot of discussion about what someone wants a sugar relationship to be like, or what they want to experience.   From the opposite perspective, what are you bringing to your sugar partner?  Here's my version -- I don't claim it's right or wrong, just the way I want my SB to feel in an SR once we're past the short-term, building-trust phase.  I like connected, strings-attached SRs.  This is a partial list!\n\n* **My SB should feel a little pampered.**  Outside of allowance, covering little things like mani/pedis, little shopping trips, all the way to more luxury shopping, travel, etc.\n* **My SB should feel like she's having experiences she otherwise wouldn't**.  Self explanatory.\n* **My SB should feel like she's got a bit of a safety net** she otherwise wouldn't have.  She's got a perfect storm of her student loan, car insurance, rent, health insurance premium, big car repair bill, and some other things, all converging this month?  No worries -- I've got her.  It shouldn't be often, and it shouldn't be the result of recklessness.  Otherwise, no, no SB of mine is going to miss her rent payment or not have health insurance.\n* **My SB should feel like she's got access to a level of people she otherwise wouldn't**.  Me, of course -- I'm a successful executive with some knowledge about life that a 24 year old normally wouldn't have access to.  If we get close, chances are she'll meet my friends, who at this point are a diverse group of very successful people, and knowing she's my SB, are extremely willing to give her advice or perspectives, in one case one managed to hook up my SB as an intern with someone in his network, etc.\n* **My SB should feel like I genuinely care about her, beyond the structured agreement** in the sugar relationship.  Forget sex and allowance, she should feel like I'm on her side.  One measure of this is how often there's still a relationship even after the SR ends.\n* **My SB should feel like her sexual satisfaction is important to me**.  I'll leave it up to her to decide whether I'm successful 🤣\n* **My SB should feel like she can be herself, warts and all**, rather than have to be \"on\"\n* **My SB should feel listened to, respected, and appreciated**.  Whether it's where we should go on vacation, or her comfort level about how we interact and what she needs to feel safe and happy.\n* **My SB should be able to tell I put in effort to romance her, to look good for her**\n* **My SB should feel rock solid secure that I'll do the things I say I'll do**.\n\nI will point out three important things:\n\n1. Sometimes people ask \"what's the difference between a sugar relationship and X?\"   We all know what X usually is, but X can be anything -- vanilla relationship, lawyer, auto mechanic, whatever.  If it's important to you that your auto mechanic feel like what I described above.... well then yes, I suppose auto maintenance IS just like sugar.  If your auto mechanic feels like you are genuinely on their side in life, you're providing pampering beyond anything you've agreed to, you're their safety net if they get in a financial bind, their sexual satisfaction is important to you, you're so connected that the personal relationship might continue even after you're not taking your car there anymore -- then yes, auto maintenance is just like sugar.  Otherwise, it's nothing like sugar.  Replace auto mechanic with any other profession you'd like to compare sugar to, same result :)\n2. I didn't mention PPM vs allowance because it doesn't matter.  Typically, I'm building an SR like what I describe above while we're still on PPM, and then there's a transition to allowance.  Allowance vs PPM is more of a footnote than the driver of what the SR feels like.\n3. Obviously, I expect SRs to be balanced in what they bring to both of us.  I expect to be experiencing awesomeness on the same level as above, from her.\n\nFor you for a moment -- what is it you want your SD or SB to feel like, when in an SR with you, in the longer term (obviously, first few days, weeks, or even months, this is something we're building towards, it's not day 1)?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ruftpu/but_how_should_your_sugar_partner_feel/",
    "score": 172,
    "upvote_ratio": 0.97,
    "created_utc": 1641148065.0,
    "num_comments": 82,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "My best SB ever - one of her many quotes - \"YBD, when I am with you, I feel like I'm in paradise on vacation, not a care in the world.  I hate leaving to go back to the real world\".\n\nThat kind off stuff, makes it worth all the tough times you get through doesn't it.",
            "author": "YourBadDecision",
            "id": "hqyqjuq",
            "parent_id": "t3_ruftpu",
            "score": 70,
            "created_utc": 1641148682.0,
            "replies": [
                {
                    "body": "Yes!  And if she's making you feel the same way... jackpot!",
                    "author": "Azurecole",
                    "id": "hqyrqnd",
                    "parent_id": "t1_hqyqjuq",
                    "score": 25,
                    "created_utc": 1641149105.0,
                    "replies": [
                        {
                            "body": "That she did a fabulous job of!\n\nAnd here, take an upvote for a great post!",
                            "author": "YourBadDecision",
                            "id": "hqysb5q",
                            "parent_id": "t1_hqyrqnd",
                            "score": 15,
                            "created_utc": 1641149307.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This feels SOOOO familiar to me.  With the exception of the meeting friends part.  We don’t do that.  \n\nThought it might be useful to explain how I got to the place you are describing.  It took a few months.  She had some very strict ground rules going in about no PDA, having her space and so on.  Our beginning was very measured.\n\nWe started traveling together.  Wanted to start giving her experiences.  First trip was to a high performance driving school at a racetrack.  Rented an AirBnB where she had her own bedroom suite if she wanted privacy at times.\n\nThen we had our third trip months later, and that trip was the clincher for me in wanting to treat her the way you describe.  Something in her changed in that trip.  With no prompting from me.  Evidence of the change came in many forms:\n\n1. I was giving her space with her own bedroom.  Not all the time.  Unprompted she started giving me shit for that because she wanted to cuddle.  I will never forget how she crawled into my tiny bed, and would not let me go.  Including play fighting and wrestling.  She didn’t need to do any of this.\n\n2. In Uber rides, she would slide across and rest her head on my shoulder, and grab me by the hand.\n\n3. Went to a broadway show.  Same kind of thing with head on my shoulder and so on.  She didn’t care what people thought any more.  \n\n4. Went to a concert.  Got front row seats.  Bunch of girls her age started giving her dirty looks.  Obviously disapproving of her being with me.  She started showering kisses on me and putting on a show.  Later on she explained how those “bitches” pissed her off, and how she thought they needed a show.  \n\nThese and countless other gestures convinced me that I wasn’t just an ATM to her.  The irony is that her affection and desire to maximize time together for no additional financial gain kind of turned me into more of an ATM.\n\nSo just like OP, I have always been there when she needed me.  For things like expensive dental work, and even some therapy.  And seriously expensive experiences and travel.  And a new car when her old one was just getting more unreliable.  She never asked for any of this.  I just wanted to do it.\n\nSo my own experience and this thread tell me that when these relationships work, they are so beyond the simplistic labels that people feel compelled to attach to what we do here.  \n\nOnce again - great post OP!",
            "author": "MrBuzzard",
            "id": "hqyvrkg",
            "parent_id": "t3_ruftpu",
            "score": 61,
            "created_utc": 1641150563.0,
            "replies": [
                {
                    "body": "I think this is a great example of how things just evolve and progress if you've actually connected.",
                    "author": "Azurecole",
                    "id": "hqyy6k4",
                    "parent_id": "t1_hqyvrkg",
                    "score": 27,
                    "created_utc": 1641151439.0,
                    "replies": [
                        {
                            "body": "You know there seems to be a bit of a theme here.  My greatest SB ever, didn't start out that way, we evolved into it.  I was supposed to be a casual fling for her, a vacay from her vanilla BF.  I sure wasn't looking for the thing that developed, but as we grew into spending more and more time together, it just had a natural energy of its own.  Doubtless, if either of us had pushed it to be more than it was at any point in time, the other one may have fled to the hills.  Till the day we split, it always seemed we were getting better all the time, with no plan as to where it might end up.  u/MrBuzzard, seems like your thing went along the same path, am I correct?\n\nTakeaway?  Be glad for what you have, while you have it.  Comparison is the enemy of a fine and happy place, don't worry about what someone else has, they are not you.  Be happy for what you have.",
                            "author": "YourBadDecision",
                            "id": "hr0pk7h",
                            "parent_id": "t1_hqyy6k4",
                            "score": 10,
                            "created_utc": 1641176390.0,
                            "replies": [
                                {
                                    "body": "Ya, very similar path.  She had experienced jerks prior to me.  So very early on, we had discussions about her high level expectations.  That helped me develop a rapid understanding of how she ticked.  My primary takeaway was to not be aggressive and let her come to me at her own pace.  I was VERY patient with her.  During that phase it became apparent that I cared about her as a person first and foremost, and did not see her as some kind of wind-up sex doll.   When her affection really kicked in, I knew it was real.",
                                    "author": "MrBuzzard",
                                    "id": "hr0s3si",
                                    "parent_id": "t1_hr0pk7h",
                                    "score": 11,
                                    "created_utc": 1641177451.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I honestly can’t wait till I find something this solid 😣😭",
                    "author": "DallasForeignForeign",
                    "id": "hr1ignh",
                    "parent_id": "t1_hqyvrkg",
                    "score": 9,
                    "created_utc": 1641190278.0,
                    "replies": []
                },
                {
                    "body": "Wow that sounds great! I think every kind of relationship develop in this way. At the beginning,  you don't trust too much and then you discover more about the other person and realize that they  make you feel confident ... and as the post said, this only develop with the time. When we feel confotable we start showing all our feeling more naturally. I hope evething going well for you and her! 😊",
                    "author": "Effy-del-Valle",
                    "id": "i0aaud5",
                    "parent_id": "t1_hqyvrkg",
                    "score": 3,
                    "created_utc": 1647030713.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m not technically in a SR, but I don’t see many comments from the SB side of things. And I approach any romantic relationship the same anyways. \n\nI think a lot of OP’s list goes both ways (the parts that don’t explicitly rely on one partner having decades more life experience/time to build net worth).  I want my person to know I genuinely care for him; that his sexual satisfaction is important to me; he can be himself/not be “turned on”; I want him to feel listened to, respected, and appreciated; and secure that I will follow through on what I say I’ll do. \n\nI also hope my partner feels adored, looked up to, trusted, and like they can be vulnerable with me. \n\nThis sort of goes with not having to be “turned on”, but I don’t want them feeling like they have to filter topics of discussion (eg filtering opinions/preferences if they’re afraid of being judged, not bringing up something they’re interested in as much as they’d like because they assume I’d find it boring, or tip-toeing around mentioning kids when we both know they exist). That’s all a lot of emotional work I don’t want someone I care about to waste happiness utiles on. \n\nI want them to trust I won’t get annoyed over small things. Like if things aren’t going perfectly at dinner/on vacation/etc, I don’t want an added worry to be my emotions about it. \n\nI actually find this fairly difficult to answer since if someone is being a “good man”, even in the “traditional how-dating-is-supposed-to-be” sense (without the sugary part), I always worry I’m getting more out of it than I give him. Especially re sexual satisfaction, I’m often worried I’m getting more than I’m giving since I’m pretty submissive (though not passive).",
            "author": null,
            "id": "hqzairf",
            "parent_id": "t3_ruftpu",
            "score": 15,
            "created_utc": 1641155932.0,
            "replies": [
                {
                    "body": "Yes, I agree, a lot of it goes both ways... or if not, there's a sort of SB-equivalent.  When this is really working, it's a positive feedback loop of both of us just doing nice things for each other, and for a few years or months, both of our lives are so much better for having the other in it",
                    "author": "Azurecole",
                    "id": "hqzcicd",
                    "parent_id": "t1_hqzairf",
                    "score": 6,
                    "created_utc": 1641156647.0,
                    "replies": []
                },
                {
                    "body": "Aside from “blah blah access to people she otherwise couldn’t” I think these are great principles for almost any relationship, both ways.   Generally if one side is putting more into the relationship then resentment builds. If there isn’t mutual respect and genuine caring then that’s not a good recipe.\n\nNot “technically” in an SR, are you getting compensated in something like *cocaine*?",
                    "author": "daddoms",
                    "id": "hr0elz1",
                    "parent_id": "t1_hqzairf",
                    "score": 5,
                    "created_utc": 1641171831.0,
                    "replies": [
                        {
                            "body": "I think I’ve been promised some psychedelics in the desert at some point",
                            "author": null,
                            "id": "hr0g1tm",
                            "parent_id": "t1_hr0elz1",
                            "score": 7,
                            "created_utc": 1641172434.0,
                            "replies": [
                                {
                                    "body": " *That* sounds like an experience worth having!",
                                    "author": "daddoms",
                                    "id": "hr0gd7f",
                                    "parent_id": "t1_hr0g1tm",
                                    "score": 3,
                                    "created_utc": 1641172567.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You nailed it in your post. I want us to share mutual and authentic respect, trust, attraction, and communication.",
            "author": "PlugItWithaBeer",
            "id": "hqyr80m",
            "parent_id": "t3_ruftpu",
            "score": 14,
            "created_utc": 1641148922.0,
            "replies": []
        },
        {
            "body": "I like my SD to feel just as pampered as me. Cared for, spoiled, and heard. I like when there is an emotional connection, I’ve noticed I can’t continue a SR if there isn’t. My current SD is basically like my best friend at this point. We game together, text every day, and I realized I talk to him more than anyone else. I give him everything he asks for and he does the same for me. It’s pretty perfect. I wish every SR was like this honestly. When two people are being themselves and actually connecting then everything you listed comes naturally in a SR.",
            "author": "katsandlasers",
            "id": "hr08yn1",
            "parent_id": "t3_ruftpu",
            "score": 9,
            "created_utc": 1641169496.0,
            "replies": [
                {
                    "body": "Exactly!  Some people aren't looking for this much connection of course.  But that's exactly what I enjoy -- texting because it's organic and fun, not because it's a chore or checkbox.  Symmetric amount of effort into the SR, etc",
                    "author": "Azurecole",
                    "id": "hr0blnu",
                    "parent_id": "t1_hr08yn1",
                    "score": 7,
                    "created_utc": 1641170575.0,
                    "replies": [
                        {
                            "body": "Yeah I’m definitely not knocking those who prefer NSA, I just feel for any long term SR then there’s definitely some strings involved. I connect with people easily though so maybe my opinion are a bit biased lol",
                            "author": "katsandlasers",
                            "id": "hr0c2yz",
                            "parent_id": "t1_hr0blnu",
                            "score": 3,
                            "created_utc": 1641170776.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This sounds perfect in my opinion",
            "author": "queeenlilith",
            "id": "hqypfob",
            "parent_id": "t3_ruftpu",
            "score": 8,
            "created_utc": 1641148284.0,
            "replies": [
                {
                    "body": "Right?!?",
                    "author": "Azurecole",
                    "id": "hqyrb6j",
                    "parent_id": "t1_hqypfob",
                    "score": 9,
                    "created_utc": 1641148954.0,
                    "replies": [
                        {
                            "body": "Yes 😭",
                            "author": "queeenlilith",
                            "id": "hqyrcub",
                            "parent_id": "t1_hqyrb6j",
                            "score": 4,
                            "created_utc": 1641148971.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I add one more. SB shouldn't feel she is getting an allowance for sex. If she feels that, SD has failed.",
            "author": "forgotten3434",
            "id": "hqzdfb1",
            "parent_id": "t3_ruftpu",
            "score": 6,
            "created_utc": 1641156966.0,
            "replies": []
        },
        {
            "body": "I love this. So many commenters here seems quite self centered and only concerned about their own experience. \nThis was really refreshing to read! 💕",
            "author": "WestCoastCompanion",
            "id": "hqz5k87",
            "parent_id": "t3_ruftpu",
            "score": 15,
            "created_utc": 1641154140.0,
            "replies": []
        },
        {
            "body": "This is the ideal spot for an SB to be in. Once achieved, or having come close, what causes the relationships to end?",
            "author": "SDforreal",
            "id": "hqyptae",
            "parent_id": "t3_ruftpu",
            "score": 6,
            "created_utc": 1641148418.0,
            "replies": [
                {
                    "body": "Most of the time, if the SR is good enough that we've actually achieved the above, I'm deliriously happy and so is she.  The SR goes long term until she has some change of life status (meet her BF/finacee, move somewhere to start her career, etc etc).",
                    "author": "Azurecole",
                    "id": "hqyqrun",
                    "parent_id": "t1_hqyptae",
                    "score": 13,
                    "created_utc": 1641148761.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nice post, just wanted to say that as a newer SD, this is very helpful to make me think more clearly (and maybe jot down) how I want my SB(s) to feel, and thus more proactively steer the SR that way and achieve it.\n\nThat last point is great too, I want my SB to know I'm a man of my word. But like a few others here, I'm not yet comfortable sharing my friends and other parts of my life with SBs, but we'll see.\n\nIf I can add one that's not (explicitly) on your list, for me, I also want my SB to feel like her boundaries are respected, and that I won't become clingy, jealous, needy, or fall in love. I realize this may be specific to the type of SRs I'm seeking and building with my SBs but so far we on both sides want a more drama-free, NSA experience. So I'm being careful to toe the line between \"genuinely care about her beyond the arrangement\" and \"over escalating the emotional or time labor of the relationship\".",
            "author": "noobNYCsd",
            "id": "hqzuxnl",
            "parent_id": "t3_ruftpu",
            "score": 4,
            "created_utc": 1641163904.0,
            "replies": [
                {
                    "body": "I think looking for  drama-free is great, just be aware that this is a bit like Mike Tyson's quote, \"everyone has a plan until they get hit\".  Every SD has a plan until he meets an SB who makes him feel alive and masculine and appreciated.  Not easy to stay NSA.   Of course, based on the number of SBs posting \"I fell in love with my SD\" posts, this can go either way, and the outcome can still be messy.\n\nFor myself, I am most decidedly looking for a highly-connected, strings-attached SR.  I found ways to help maintain things where I like them to be -- at \"luv ya!\" rather than \"I love you\" -- which lets me savor how much I adore her, without slipping into jealousy and other negative feelings.  You'll probably figure out your own way to navigate this.",
                    "author": "Azurecole",
                    "id": "hqzzlw4",
                    "parent_id": "t1_hqzuxnl",
                    "score": 4,
                    "created_utc": 1641165750.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly this!!! This is the dream and the goal for me and to have all that returned to me from her (obv not the $ aspect 🤣)",
            "author": "thereadinessisall",
            "id": "hqyr4b6",
            "parent_id": "t3_ruftpu",
            "score": 4,
            "created_utc": 1641148885.0,
            "replies": []
        },
        {
            "body": "Wow OP I wish you were my SD! Happy for you and your special lady.",
            "author": "NorthernGirlHere",
            "id": "hr0rkmj",
            "parent_id": "t3_ruftpu",
            "score": 4,
            "created_utc": 1641177232.0,
            "replies": [
                {
                    "body": "Girl me too ! Or every SD who agrees with this",
                    "author": "DallasForeignForeign",
                    "id": "hr1j9gd",
                    "parent_id": "t1_hr0rkmj",
                    "score": 3,
                    "created_utc": 1641190774.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My SB should feel that perhaps the old times were good times when \"Ladies First\" was something young men were taught before they learned its most important application.",
            "author": "pinotandsugar",
            "id": "hr09ak5",
            "parent_id": "t3_ruftpu",
            "score": 4,
            "created_utc": 1641169635.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hqyvzkt",
            "parent_id": "t3_ruftpu",
            "score": 3,
            "created_utc": 1641150645.0,
            "replies": [
                {
                    "body": "Nope, I've never had an explicit discussion about this.  My experiences have been consistently more like what u/MrBuzzard describes, organic feeling.  Usually, I just start escalating how well I treat her (starting with small gestures), and if I feel like she's reciprocating, I just keep doing it.  If not, I'll pull back.  But in most cases, actions rather than words are the proof",
                    "author": "Azurecole",
                    "id": "hqyxyuq",
                    "parent_id": "t1_hqyvzkt",
                    "score": 7,
                    "created_utc": 1641151361.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hqyznaw",
                            "parent_id": "t1_hqyxyuq",
                            "score": 3,
                            "created_utc": 1641151983.0,
                            "replies": [
                                {
                                    "body": "Yes.  And not just over-communication.  Spontaneously pampering your SB is going to absolutely delight her.  But if you give her a big speech about how you're going to pamper her, now she has every right to have some expectations -- her idea of pampering might be very different from yours and end up disappointing her, and/or she might rely on \"I'll pamper you\" as a promise and part of the reason she accepts the allowance (in other words, it's now an entitlement rather than a delightful surprise).  So to me it's less about over-communicating than it is about unintentionally turning your organic gestures into an entitlement\n\nTake the risk, do extra for her, realizing it might not be reciprocated, and see how things go",
                                    "author": "Azurecole",
                                    "id": "hqz0ecs",
                                    "parent_id": "t1_hqyznaw",
                                    "score": 7,
                                    "created_utc": 1641152263.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good post. I’ve experienced most of those bullet points, but hopefully I’ll find an SR that ticks all the boxes soon. Especially not feeling like you have to be “on” at all times. It is nice to be able to genuinely let your guard down around someone.",
            "author": "ma-ri-ah",
            "id": "hqzzizp",
            "parent_id": "t3_ruftpu",
            "score": 3,
            "created_utc": 1641165718.0,
            "replies": []
        },
        {
            "body": "Absolute perfection!",
            "author": "Cdnsugarr",
            "id": "hqyv6fx",
            "parent_id": "t3_ruftpu",
            "score": 6,
            "created_utc": 1641150351.0,
            "replies": [
                {
                    "body": "Thanks!  I actually think we have a ton more in common on slf than we think.  It's the nature of internet forums to focus in on where you differ",
                    "author": "Azurecole",
                    "id": "hqyyhd3",
                    "parent_id": "t1_hqyv6fx",
                    "score": 7,
                    "created_utc": 1641151551.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is a great post.  \n\nJust reminds me of a meet and greet I went on with a woman.  Where she was just saying things like \"I've had better\" but still wanted an arrangement.  \n\nObviously she was beautiful but I said no.  No need to be with a person that has different expectations and I could do very little to make happy, outside of what she was already claiming to have.",
            "author": "saltgrindr",
            "id": "hqz9ruz",
            "parent_id": "t3_ruftpu",
            "score": 2,
            "created_utc": 1641155664.0,
            "replies": []
        },
        {
            "body": "If an SD messaged me something like this, I would be his in a heartbeat. This is how every SD should feel. Perfection.",
            "author": null,
            "id": "hr0e2cn",
            "parent_id": "t3_ruftpu",
            "score": 2,
            "created_utc": 1641171604.0,
            "replies": [
                {
                    "body": "I completely agree.  Quality over quantity is bliss for me.",
                    "author": "Tequila-porfavor",
                    "id": "hr0sh36",
                    "parent_id": "t1_hr0e2cn",
                    "score": 2,
                    "created_utc": 1641177608.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good post. My #1 goal with a SB is to establish her trust in me, early on. I want her to feel safe, protected, and know that I will respect her boundaries, whatever they turn out to be as the relationship develops (I don't do PPM). The SB's often comment on how refreshing and surprising this is (compared to their past experiences with the male trash in the sugar bowl).\n\nThis is also especially important for me to do, because by appearances, many SB's have initial skepticism that I'm even a SD at all, and not just a PPM John looking to spend a benjamin. As a minimalist, I live in a crap-hole studio apartment, and have no car, which I warn them about prior to their first visit ... so I still need to overcome that initial adverse perception.\n\nBut after that simple 'trust' objective is achieved, everything else falls into place nicely.",
            "author": "Nomad_Bill",
            "id": "hqz6v4u",
            "parent_id": "t3_ruftpu",
            "score": 3,
            "created_utc": 1641154606.0,
            "replies": []
        },
        {
            "body": "tbh I want my SB to feel the same way about me as my accountant feels about me",
            "author": null,
            "id": "hqyppll",
            "parent_id": "t3_ruftpu",
            "score": 2,
            "created_utc": 1641148382.0,
            "replies": [
                {
                    "body": "You want your SB to worry that you might be over-invested in large caps? :)",
                    "author": "Azurecole",
                    "id": "hqyqki8",
                    "parent_id": "t1_hqyppll",
                    "score": 13,
                    "created_utc": 1641148689.0,
                    "replies": [
                        {
                            "body": "🤣🤣🤣  this hits close to home",
                            "author": null,
                            "id": "hqyt449",
                            "parent_id": "t1_hqyqki8",
                            "score": 6,
                            "created_utc": 1641149595.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "SRs are a spectrum and we ought to all do what works best for us. Beyond mutual attraction, key is mutual respect for each other and mutual respect for each other’s boundaries.",
            "author": null,
            "id": "hqyyvxe",
            "parent_id": "t3_ruftpu",
            "score": 2,
            "created_utc": 1641151699.0,
            "replies": [
                {
                    "body": "Absolutely agree.  I'm not preaching what an SR has to feel like, I'm saying how I want my SRs to feel like. And of course inviting people to say what theirs should feel like.  No right or wrong... well, to a point, I guess!",
                    "author": "Azurecole",
                    "id": "hqyz9fi",
                    "parent_id": "t1_hqyyvxe",
                    "score": 4,
                    "created_utc": 1641151837.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She should feel comfortable with our arrangement.   That’s really about it for me.  Obviously being comfortable with a relationship implies a certain feeling of safety, contentment with the allowance, sense of reliability, etc.  I don’t think it’s my place to dictate how other people should or should not feel.  They feel whatever they feel and are entitled to whatever feelings they have.  Obviously if their feelings are a problem for our relationship, then the relationship will probably end.",
            "author": "63daddy",
            "id": "hqz1j1h",
            "parent_id": "t3_ruftpu",
            "score": 0,
            "created_utc": 1641152683.0,
            "replies": []
        },
        {
            "body": "Sorry, but you sound like a simp.  A SR is about mutual attraction, mutual respect, and mutual benefits.\n\nI'm sure your SB only 'feels' all your bullet points, as long as she's receiving her allowance.  Sorry but them are the facts.  All that other stuff may be true and real, but remember its all about the sugar.",
            "author": "BimmerM550",
            "id": "hr0c8ct",
            "parent_id": "t3_ruftpu",
            "score": -4,
            "created_utc": 1641170838.0,
            "replies": [
                {
                    "body": "It's possible to remember that it's a sugar relationship, and do all those other things (and have her make you feel the same way).   Obviously, if she decides she's not going to have sex with me anymore, or I decide I'm not offering her financial support anymore, our relationship will change.  But I am still in touch with a number of my ex-SBs, I spent a few hours texting with an ex-SB just last week (she initiated).  I don't provide them any financial support anymore, they don't have sex with me anymore, but we're still friends -- the personal relationship part was real, we like each other, so we're in touch.\n\nBut even if it didn't, so what?  Enjoy an amazing experience with an amazing woman.  Enjoy the way she returns the effort and appreciation.  When it ends, it ends.  How is that anything but a huge win?",
                    "author": "Azurecole",
                    "id": "hr0k69u",
                    "parent_id": "t1_hr0c8ct",
                    "score": 4,
                    "created_utc": 1641174160.0,
                    "replies": []
                },
                {
                    "body": "Sorry what he wrote isn’t simping. Having genuine respect and caring for your partners will be rewarded with mutual respect and caring. If you don’t care, they won’t either.",
                    "author": "daddoms",
                    "id": "hr0cudh",
                    "parent_id": "t1_hr0c8ct",
                    "score": 5,
                    "created_utc": 1641171092.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Excellent post.  I don’t offer the “access to my friends” part, but aside from that I agree with all of this.  I think a short summary that differentiates how I feel about her vs. some type of service provider, as embodied in your comments, is that I genuinely care about her, not just during our time together, but as a person.  I want her to be as happy as possible and I’ll do what I can within reason to make her happy that way.   Of course I hope my auto mechanic is happy too, but I’m not going out of my way to make sure he is.",
            "author": null,
            "id": "hqzqwpl",
            "parent_id": "t3_ruftpu",
            "score": 1,
            "created_utc": 1641162340.0,
            "replies": []
        },
        {
            "body": "Brilliant",
            "author": "daddoms",
            "id": "hr0chb0",
            "parent_id": "t3_ruftpu",
            "score": 1,
            "created_utc": 1641170943.0,
            "replies": []
        },
        {
            "body": "What a great mindset! Sounds similar to what I expect as well.",
            "author": "bright__eyes",
            "id": "hr0udik",
            "parent_id": "t3_ruftpu",
            "score": 1,
            "created_utc": 1641178417.0,
            "replies": []
        },
        {
            "body": "I wish I felt this. Most times I was fishing and asking around the guys don’t get it and just think it’s one way street then I see my friends getting perfect men.",
            "author": null,
            "id": "hr10iqs",
            "parent_id": "t3_ruftpu",
            "score": 1,
            "created_utc": 1641181116.0,
            "replies": [
                {
                    "body": "Just to not set unreasonable expectations, it takes a while for an SR to grow into all that, that's why I took pains to say this describes my SRs that at least have gotten past those opening few weeks & months, while we're still building trust, learning about each other, etc.",
                    "author": "Azurecole",
                    "id": "hr13u28",
                    "parent_id": "t1_hr10iqs",
                    "score": 1,
                    "created_utc": 1641182623.0,
                    "replies": [
                        {
                            "body": "OP, I honestly loved this post. Do you think it would be coming out as too strong if what you said was summarized and shared with POTs who ask what you looking for in an arrangement? Or with current SDs ?",
                            "author": "DallasForeignForeign",
                            "id": "hr1tpof",
                            "parent_id": "t1_hr13u28",
                            "score": 1,
                            "created_utc": 1641198008.0,
                            "replies": [
                                {
                                    "body": "Yes, I suspect it's too much.  IME, it takes months -- sometimes longer -- to hit everything above.  And my expectation is, you could write an SB-version of my post, and I need to be feeling all that back.    Presenting this to a POT, might be like going on Tinder and while you're still messaging, jumping straight to \"so I want to be married, house, three kids.  What should we name the dog?\"  Hey, maybe we should have a first date first!\n\nI do think you can back off this to the elements that give you a chance to build towards it -- chemistry and connection (not nsa or fwb), mutual respect and appreciation, etc.  The seeds that have potential to grow into something great",
                                    "author": "Azurecole",
                                    "id": "hr2wfvw",
                                    "parent_id": "t1_hr1tpof",
                                    "score": 2,
                                    "created_utc": 1641222889.0,
                                    "replies": [
                                        {
                                            "body": "Lol I absolutely understand presenting  it to a POT might be too much. Makes sense. Thanks",
                                            "author": "DallasForeignForeign",
                                            "id": "hr381au",
                                            "parent_id": "t1_hr2wfvw",
                                            "score": 1,
                                            "created_utc": 1641227649.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Aww at the genuineness of it all 🥺 this level of adoration should engender an equivalent amount of awesomeness for you!",
            "author": "babyorris",
            "id": "hr1btyg",
            "parent_id": "t3_ruftpu",
            "score": 1,
            "created_utc": 1641186513.0,
            "replies": []
        },
        {
            "body": "You pretty much nailed it.  I probably wouldn't have put it any differently.  \n\nMaybe a different topic but I'm wondering, as a newer SD in the bowl, if the above stated set of experiences over time lends itself to a bias towards a sense of diminishing returns.  In other words, after the honeymoon phase ends does it require increasingly more effort on both sides to maintain the satisfaction levels you've outlined?",
            "author": "YummyFrostingSD",
            "id": "hr37l0b",
            "parent_id": "t3_ruftpu",
            "score": 1,
            "created_utc": 1641227473.0,
            "replies": [
                {
                    "body": "Great question!  I think you have one thing backwards: the honeymoon phase will be over (depending on how you define honeymoon phase) *before* she's feeling all of the above, in most cases, at least to its full extent as it's realized in a long-term SR. \n\nBut that said, I have not found it gets stale.  I guess different people start taking things for granted more easily.  I have my faults but that's not one of them, I find what I outlined (with her delivering the SB equivalent back to me) is the context with which an SR makes me super super happy. We can keep things fresh by exploring new activities, vacations, kinks, etc.  But the overall context I described never gets old, at least to me",
                    "author": "Azurecole",
                    "id": "hr3bxn7",
                    "parent_id": "t1_hr37l0b",
                    "score": 2,
                    "created_utc": 1641229139.0,
                    "replies": [
                        {
                            "body": "Good call re. the honeymoon phase.  Feeling that way would likely require a fair bit of time.  \n\nI guess the more effort I was talking about was what you're referring to as keeping it fresh.  Maybe the same amount of effort but some added overhead in finding new ways to enjoy each other.",
                            "author": "YummyFrostingSD",
                            "id": "hr3rdjg",
                            "parent_id": "t1_hr3bxn7",
                            "score": 1,
                            "created_utc": 1641234832.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love this list! I agree with the safety net portion the most lol. If your SB gets into an accident or something happens to her, SD who cares should make sure she's taken care of in all ways.",
            "author": null,
            "id": "hr4do0d",
            "parent_id": "t3_ruftpu",
            "score": 1,
            "created_utc": 1641243121.0,
            "replies": [
                {
                    "body": "\"in all ways\" leaves a lot of open territory :)  But within reasonable limits of affordability and other factors etc (I'm not going to let myself go broke or anything), **if the SB is also delivering the SB equivalent of this list back to me**,  I've got her. If she isn't, I don't. It's a two way street, awesome begets awesome",
                    "author": "Azurecole",
                    "id": "hr4g20w",
                    "parent_id": "t1_hr4do0d",
                    "score": 3,
                    "created_utc": 1641244041.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dang...you sound great. Are you in Dallas by any chance? :D",
            "author": "Electrical-Heart-245",
            "id": "hrbcohr",
            "parent_id": "t3_ruftpu",
            "score": 1,
            "created_utc": 1641358561.0,
            "replies": [
                {
                    "body": "Yippie Kai ay!\n\nLol nowhere close. I'm glad SBs are seeing what they're looking for, in what I'm giving!",
                    "author": "Azurecole",
                    "id": "hrbdym9",
                    "parent_id": "t1_hrbcohr",
                    "score": 1,
                    "created_utc": 1641359222.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "❤️",
            "author": "Sugarnewbie878",
            "id": "hwgagfi",
            "parent_id": "t3_ruftpu",
            "score": 1,
            "created_utc": 1644546132.0,
            "replies": []
        },
        {
            "body": "This made me cry. Beautiful.",
            "author": "Objective_Method_306",
            "id": "i944sc2",
            "parent_id": "t3_ruftpu",
            "score": 1,
            "created_utc": 1652903809.0,
            "replies": [
                {
                    "body": "That's the goal! 🤣",
                    "author": "Azurecole",
                    "id": "i94cb66",
                    "parent_id": "t1_i944sc2",
                    "score": 2,
                    "created_utc": 1652906881.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "iamioln",
            "parent_id": "t3_ruftpu",
            "score": 1,
            "created_utc": 1653969881.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "iaml26b",
                    "parent_id": "t1_iamioln",
                    "score": 1,
                    "created_utc": 1653971426.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "iamo6e9",
                            "parent_id": "t1_iaml26b",
                            "score": 1,
                            "created_utc": 1653973534.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "iamq2fn",
                                    "parent_id": "t1_iamo6e9",
                                    "score": 1,
                                    "created_utc": 1653974876.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "iamsjon",
                                            "parent_id": "t1_iamq2fn",
                                            "score": 1,
                                            "created_utc": 1653976725.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "iamv1sm",
                                                    "parent_id": "t1_iamsjon",
                                                    "score": 1,
                                                    "created_utc": 1653978722.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "ianxkoz",
                                                            "parent_id": "t1_iamv1sm",
                                                            "score": 1,
                                                            "created_utc": 1654006236.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[removed]",
                                                                    "author": null,
                                                                    "id": "iao23di",
                                                                    "parent_id": "t1_ianxkoz",
                                                                    "score": 1,
                                                                    "created_utc": 1654008295.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[removed]",
                                                                            "author": null,
                                                                            "id": "iap6xgf",
                                                                            "parent_id": "t1_iao23di",
                                                                            "score": 1,
                                                                            "created_utc": 1654026294.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Your goal here is to troll, not have a discussion -- and you want to be argumentative and negative the entire time.  The mod team is split between SBs and SDs.  We don't compare to SW because that mostly means people outside our community -- escorts -- come in and tell us what our community is supposed to be about.  Good day",
                                                                                    "author": "Azurecole",
                                                                                    "id": "iap8837",
                                                                                    "parent_id": "t1_iap6xgf",
                                                                                    "score": 1,
                                                                                    "created_utc": 1654026855.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What a great and thoughtful post. Today I had a date with my SB after not seeing her for two weeks. The last date was a near disaster, but we still both had fun. This time we hiked in a park with her toddler. She is a single mother. I had never met him before although heard him many times on phone calls and she was anxious about him becoming attached to me and our relationship ending. I understand that fully and I would never want to hurt a young child. btw, I don't see a lot of discussion about SBs with kids and what happens to them. I purchased a car seat and we had a great time. We went out for lunch after. I had to get them home before the little guy fell asleep for his mid day nap. I think its these kinds of things that make SRs special.  I wanted to hold her hand in the park but did so only in my mind. And I was very attentive to the little guy helping him explore. I did steal a kiss when I dropped her off. It was all I needed. Best date ever.",
            "author": null,
            "id": "ibkhacg",
            "parent_id": "t3_ruftpu",
            "score": 1,
            "created_utc": 1654659372.0,
            "replies": []
        },
        {
            "body": "I enjoyed reading this. You are a very thoughtful SD!",
            "author": "4amrambler",
            "id": "is09cu2",
            "parent_id": "t3_ruftpu",
            "score": 1,
            "created_utc": 1665572963.0,
            "replies": [
                {
                    "body": "Thanks! I think many SRs are like this, just needed to be captured!",
                    "author": "Azurecole",
                    "id": "is139l5",
                    "parent_id": "t1_is09cu2",
                    "score": 1,
                    "created_utc": 1665587677.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wish there was more like you in the bowl. Seriously… how refreshing! 💕🥰",
            "author": "Vibrant_Vixen14",
            "id": "j4k40bm",
            "parent_id": "t3_ruftpu",
            "score": 1,
            "created_utc": 1673852893.0,
            "replies": []
        },
        {
            "body": "Yes!  And if she's making you feel the same way... jackpot!",
            "author": "Azurecole",
            "id": "hqyrqnd",
            "parent_id": "t1_hqyqjuq",
            "score": 25,
            "created_utc": 1641149105.0,
            "replies": [
                {
                    "body": "That she did a fabulous job of!\n\nAnd here, take an upvote for a great post!",
                    "author": "YourBadDecision",
                    "id": "hqysb5q",
                    "parent_id": "t1_hqyrqnd",
                    "score": 15,
                    "created_utc": 1641149307.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think this is a great example of how things just evolve and progress if you've actually connected.",
            "author": "Azurecole",
            "id": "hqyy6k4",
            "parent_id": "t1_hqyvrkg",
            "score": 27,
            "created_utc": 1641151439.0,
            "replies": [
                {
                    "body": "You know there seems to be a bit of a theme here.  My greatest SB ever, didn't start out that way, we evolved into it.  I was supposed to be a casual fling for her, a vacay from her vanilla BF.  I sure wasn't looking for the thing that developed, but as we grew into spending more and more time together, it just had a natural energy of its own.  Doubtless, if either of us had pushed it to be more than it was at any point in time, the other one may have fled to the hills.  Till the day we split, it always seemed we were getting better all the time, with no plan as to where it might end up.  u/MrBuzzard, seems like your thing went along the same path, am I correct?\n\nTakeaway?  Be glad for what you have, while you have it.  Comparison is the enemy of a fine and happy place, don't worry about what someone else has, they are not you.  Be happy for what you have.",
                    "author": "YourBadDecision",
                    "id": "hr0pk7h",
                    "parent_id": "t1_hqyy6k4",
                    "score": 10,
                    "created_utc": 1641176390.0,
                    "replies": [
                        {
                            "body": "Ya, very similar path.  She had experienced jerks prior to me.  So very early on, we had discussions about her high level expectations.  That helped me develop a rapid understanding of how she ticked.  My primary takeaway was to not be aggressive and let her come to me at her own pace.  I was VERY patient with her.  During that phase it became apparent that I cared about her as a person first and foremost, and did not see her as some kind of wind-up sex doll.   When her affection really kicked in, I knew it was real.",
                            "author": "MrBuzzard",
                            "id": "hr0s3si",
                            "parent_id": "t1_hr0pk7h",
                            "score": 11,
                            "created_utc": 1641177451.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I honestly can’t wait till I find something this solid 😣😭",
            "author": "DallasForeignForeign",
            "id": "hr1ignh",
            "parent_id": "t1_hqyvrkg",
            "score": 9,
            "created_utc": 1641190278.0,
            "replies": []
        },
        {
            "body": "Wow that sounds great! I think every kind of relationship develop in this way. At the beginning,  you don't trust too much and then you discover more about the other person and realize that they  make you feel confident ... and as the post said, this only develop with the time. When we feel confotable we start showing all our feeling more naturally. I hope evething going well for you and her! 😊",
            "author": "Effy-del-Valle",
            "id": "i0aaud5",
            "parent_id": "t1_hqyvrkg",
            "score": 3,
            "created_utc": 1647030713.0,
            "replies": []
        },
        {
            "body": "Yes, I agree, a lot of it goes both ways... or if not, there's a sort of SB-equivalent.  When this is really working, it's a positive feedback loop of both of us just doing nice things for each other, and for a few years or months, both of our lives are so much better for having the other in it",
            "author": "Azurecole",
            "id": "hqzcicd",
            "parent_id": "t1_hqzairf",
            "score": 6,
            "created_utc": 1641156647.0,
            "replies": []
        },
        {
            "body": "Aside from “blah blah access to people she otherwise couldn’t” I think these are great principles for almost any relationship, both ways.   Generally if one side is putting more into the relationship then resentment builds. If there isn’t mutual respect and genuine caring then that’s not a good recipe.\n\nNot “technically” in an SR, are you getting compensated in something like *cocaine*?",
            "author": "daddoms",
            "id": "hr0elz1",
            "parent_id": "t1_hqzairf",
            "score": 5,
            "created_utc": 1641171831.0,
            "replies": [
                {
                    "body": "I think I’ve been promised some psychedelics in the desert at some point",
                    "author": null,
                    "id": "hr0g1tm",
                    "parent_id": "t1_hr0elz1",
                    "score": 7,
                    "created_utc": 1641172434.0,
                    "replies": [
                        {
                            "body": " *That* sounds like an experience worth having!",
                            "author": "daddoms",
                            "id": "hr0gd7f",
                            "parent_id": "t1_hr0g1tm",
                            "score": 3,
                            "created_utc": 1641172567.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly!  Some people aren't looking for this much connection of course.  But that's exactly what I enjoy -- texting because it's organic and fun, not because it's a chore or checkbox.  Symmetric amount of effort into the SR, etc",
            "author": "Azurecole",
            "id": "hr0blnu",
            "parent_id": "t1_hr08yn1",
            "score": 7,
            "created_utc": 1641170575.0,
            "replies": [
                {
                    "body": "Yeah I’m definitely not knocking those who prefer NSA, I just feel for any long term SR then there’s definitely some strings involved. I connect with people easily though so maybe my opinion are a bit biased lol",
                    "author": "katsandlasers",
                    "id": "hr0c2yz",
                    "parent_id": "t1_hr0blnu",
                    "score": 3,
                    "created_utc": 1641170776.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right?!?",
            "author": "Azurecole",
            "id": "hqyrb6j",
            "parent_id": "t1_hqypfob",
            "score": 9,
            "created_utc": 1641148954.0,
            "replies": [
                {
                    "body": "Yes 😭",
                    "author": "queeenlilith",
                    "id": "hqyrcub",
                    "parent_id": "t1_hqyrb6j",
                    "score": 4,
                    "created_utc": 1641148971.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Most of the time, if the SR is good enough that we've actually achieved the above, I'm deliriously happy and so is she.  The SR goes long term until she has some change of life status (meet her BF/finacee, move somewhere to start her career, etc etc).",
            "author": "Azurecole",
            "id": "hqyqrun",
            "parent_id": "t1_hqyptae",
            "score": 13,
            "created_utc": 1641148761.0,
            "replies": []
        },
        {
            "body": "I think looking for  drama-free is great, just be aware that this is a bit like Mike Tyson's quote, \"everyone has a plan until they get hit\".  Every SD has a plan until he meets an SB who makes him feel alive and masculine and appreciated.  Not easy to stay NSA.   Of course, based on the number of SBs posting \"I fell in love with my SD\" posts, this can go either way, and the outcome can still be messy.\n\nFor myself, I am most decidedly looking for a highly-connected, strings-attached SR.  I found ways to help maintain things where I like them to be -- at \"luv ya!\" rather than \"I love you\" -- which lets me savor how much I adore her, without slipping into jealousy and other negative feelings.  You'll probably figure out your own way to navigate this.",
            "author": "Azurecole",
            "id": "hqzzlw4",
            "parent_id": "t1_hqzuxnl",
            "score": 4,
            "created_utc": 1641165750.0,
            "replies": []
        },
        {
            "body": "Girl me too ! Or every SD who agrees with this",
            "author": "DallasForeignForeign",
            "id": "hr1j9gd",
            "parent_id": "t1_hr0rkmj",
            "score": 3,
            "created_utc": 1641190774.0,
            "replies": []
        },
        {
            "body": "Nope, I've never had an explicit discussion about this.  My experiences have been consistently more like what u/MrBuzzard describes, organic feeling.  Usually, I just start escalating how well I treat her (starting with small gestures), and if I feel like she's reciprocating, I just keep doing it.  If not, I'll pull back.  But in most cases, actions rather than words are the proof",
            "author": "Azurecole",
            "id": "hqyxyuq",
            "parent_id": "t1_hqyvzkt",
            "score": 7,
            "created_utc": 1641151361.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hqyznaw",
                    "parent_id": "t1_hqyxyuq",
                    "score": 3,
                    "created_utc": 1641151983.0,
                    "replies": [
                        {
                            "body": "Yes.  And not just over-communication.  Spontaneously pampering your SB is going to absolutely delight her.  But if you give her a big speech about how you're going to pamper her, now she has every right to have some expectations -- her idea of pampering might be very different from yours and end up disappointing her, and/or she might rely on \"I'll pamper you\" as a promise and part of the reason she accepts the allowance (in other words, it's now an entitlement rather than a delightful surprise).  So to me it's less about over-communicating than it is about unintentionally turning your organic gestures into an entitlement\n\nTake the risk, do extra for her, realizing it might not be reciprocated, and see how things go",
                            "author": "Azurecole",
                            "id": "hqz0ecs",
                            "parent_id": "t1_hqyznaw",
                            "score": 7,
                            "created_utc": 1641152263.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks!  I actually think we have a ton more in common on slf than we think.  It's the nature of internet forums to focus in on where you differ",
            "author": "Azurecole",
            "id": "hqyyhd3",
            "parent_id": "t1_hqyv6fx",
            "score": 7,
            "created_utc": 1641151551.0,
            "replies": []
        },
        {
            "body": "I completely agree.  Quality over quantity is bliss for me.",
            "author": "Tequila-porfavor",
            "id": "hr0sh36",
            "parent_id": "t1_hr0e2cn",
            "score": 2,
            "created_utc": 1641177608.0,
            "replies": []
        },
        {
            "body": "You want your SB to worry that you might be over-invested in large caps? :)",
            "author": "Azurecole",
            "id": "hqyqki8",
            "parent_id": "t1_hqyppll",
            "score": 13,
            "created_utc": 1641148689.0,
            "replies": [
                {
                    "body": "🤣🤣🤣  this hits close to home",
                    "author": null,
                    "id": "hqyt449",
                    "parent_id": "t1_hqyqki8",
                    "score": 6,
                    "created_utc": 1641149595.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Absolutely agree.  I'm not preaching what an SR has to feel like, I'm saying how I want my SRs to feel like. And of course inviting people to say what theirs should feel like.  No right or wrong... well, to a point, I guess!",
            "author": "Azurecole",
            "id": "hqyz9fi",
            "parent_id": "t1_hqyyvxe",
            "score": 4,
            "created_utc": 1641151837.0,
            "replies": []
        },
        {
            "body": "It's possible to remember that it's a sugar relationship, and do all those other things (and have her make you feel the same way).   Obviously, if she decides she's not going to have sex with me anymore, or I decide I'm not offering her financial support anymore, our relationship will change.  But I am still in touch with a number of my ex-SBs, I spent a few hours texting with an ex-SB just last week (she initiated).  I don't provide them any financial support anymore, they don't have sex with me anymore, but we're still friends -- the personal relationship part was real, we like each other, so we're in touch.\n\nBut even if it didn't, so what?  Enjoy an amazing experience with an amazing woman.  Enjoy the way she returns the effort and appreciation.  When it ends, it ends.  How is that anything but a huge win?",
            "author": "Azurecole",
            "id": "hr0k69u",
            "parent_id": "t1_hr0c8ct",
            "score": 4,
            "created_utc": 1641174160.0,
            "replies": []
        },
        {
            "body": "Sorry what he wrote isn’t simping. Having genuine respect and caring for your partners will be rewarded with mutual respect and caring. If you don’t care, they won’t either.",
            "author": "daddoms",
            "id": "hr0cudh",
            "parent_id": "t1_hr0c8ct",
            "score": 5,
            "created_utc": 1641171092.0,
            "replies": []
        },
        {
            "body": "Just to not set unreasonable expectations, it takes a while for an SR to grow into all that, that's why I took pains to say this describes my SRs that at least have gotten past those opening few weeks & months, while we're still building trust, learning about each other, etc.",
            "author": "Azurecole",
            "id": "hr13u28",
            "parent_id": "t1_hr10iqs",
            "score": 1,
            "created_utc": 1641182623.0,
            "replies": [
                {
                    "body": "OP, I honestly loved this post. Do you think it would be coming out as too strong if what you said was summarized and shared with POTs who ask what you looking for in an arrangement? Or with current SDs ?",
                    "author": "DallasForeignForeign",
                    "id": "hr1tpof",
                    "parent_id": "t1_hr13u28",
                    "score": 1,
                    "created_utc": 1641198008.0,
                    "replies": [
                        {
                            "body": "Yes, I suspect it's too much.  IME, it takes months -- sometimes longer -- to hit everything above.  And my expectation is, you could write an SB-version of my post, and I need to be feeling all that back.    Presenting this to a POT, might be like going on Tinder and while you're still messaging, jumping straight to \"so I want to be married, house, three kids.  What should we name the dog?\"  Hey, maybe we should have a first date first!\n\nI do think you can back off this to the elements that give you a chance to build towards it -- chemistry and connection (not nsa or fwb), mutual respect and appreciation, etc.  The seeds that have potential to grow into something great",
                            "author": "Azurecole",
                            "id": "hr2wfvw",
                            "parent_id": "t1_hr1tpof",
                            "score": 2,
                            "created_utc": 1641222889.0,
                            "replies": [
                                {
                                    "body": "Lol I absolutely understand presenting  it to a POT might be too much. Makes sense. Thanks",
                                    "author": "DallasForeignForeign",
                                    "id": "hr381au",
                                    "parent_id": "t1_hr2wfvw",
                                    "score": 1,
                                    "created_utc": 1641227649.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Great question!  I think you have one thing backwards: the honeymoon phase will be over (depending on how you define honeymoon phase) *before* she's feeling all of the above, in most cases, at least to its full extent as it's realized in a long-term SR. \n\nBut that said, I have not found it gets stale.  I guess different people start taking things for granted more easily.  I have my faults but that's not one of them, I find what I outlined (with her delivering the SB equivalent back to me) is the context with which an SR makes me super super happy. We can keep things fresh by exploring new activities, vacations, kinks, etc.  But the overall context I described never gets old, at least to me",
            "author": "Azurecole",
            "id": "hr3bxn7",
            "parent_id": "t1_hr37l0b",
            "score": 2,
            "created_utc": 1641229139.0,
            "replies": [
                {
                    "body": "Good call re. the honeymoon phase.  Feeling that way would likely require a fair bit of time.  \n\nI guess the more effort I was talking about was what you're referring to as keeping it fresh.  Maybe the same amount of effort but some added overhead in finding new ways to enjoy each other.",
                    "author": "YummyFrostingSD",
                    "id": "hr3rdjg",
                    "parent_id": "t1_hr3bxn7",
                    "score": 1,
                    "created_utc": 1641234832.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"in all ways\" leaves a lot of open territory :)  But within reasonable limits of affordability and other factors etc (I'm not going to let myself go broke or anything), **if the SB is also delivering the SB equivalent of this list back to me**,  I've got her. If she isn't, I don't. It's a two way street, awesome begets awesome",
            "author": "Azurecole",
            "id": "hr4g20w",
            "parent_id": "t1_hr4do0d",
            "score": 3,
            "created_utc": 1641244041.0,
            "replies": []
        },
        {
            "body": "Yippie Kai ay!\n\nLol nowhere close. I'm glad SBs are seeing what they're looking for, in what I'm giving!",
            "author": "Azurecole",
            "id": "hrbdym9",
            "parent_id": "t1_hrbcohr",
            "score": 1,
            "created_utc": 1641359222.0,
            "replies": []
        },
        {
            "body": "That's the goal! 🤣",
            "author": "Azurecole",
            "id": "i94cb66",
            "parent_id": "t1_i944sc2",
            "score": 2,
            "created_utc": 1652906881.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "iaml26b",
            "parent_id": "t1_iamioln",
            "score": 1,
            "created_utc": 1653971426.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "iamo6e9",
                    "parent_id": "t1_iaml26b",
                    "score": 1,
                    "created_utc": 1653973534.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "iamq2fn",
                            "parent_id": "t1_iamo6e9",
                            "score": 1,
                            "created_utc": 1653974876.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "iamsjon",
                                    "parent_id": "t1_iamq2fn",
                                    "score": 1,
                                    "created_utc": 1653976725.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "iamv1sm",
                                            "parent_id": "t1_iamsjon",
                                            "score": 1,
                                            "created_utc": 1653978722.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "ianxkoz",
                                                    "parent_id": "t1_iamv1sm",
                                                    "score": 1,
                                                    "created_utc": 1654006236.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "iao23di",
                                                            "parent_id": "t1_ianxkoz",
                                                            "score": 1,
                                                            "created_utc": 1654008295.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[removed]",
                                                                    "author": null,
                                                                    "id": "iap6xgf",
                                                                    "parent_id": "t1_iao23di",
                                                                    "score": 1,
                                                                    "created_utc": 1654026294.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Your goal here is to troll, not have a discussion -- and you want to be argumentative and negative the entire time.  The mod team is split between SBs and SDs.  We don't compare to SW because that mostly means people outside our community -- escorts -- come in and tell us what our community is supposed to be about.  Good day",
                                                                            "author": "Azurecole",
                                                                            "id": "iap8837",
                                                                            "parent_id": "t1_iap6xgf",
                                                                            "score": 1,
                                                                            "created_utc": 1654026855.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks! I think many SRs are like this, just needed to be captured!",
            "author": "Azurecole",
            "id": "is139l5",
            "parent_id": "t1_is09cu2",
            "score": 1,
            "created_utc": 1665587677.0,
            "replies": []
        },
        {
            "body": "That she did a fabulous job of!\n\nAnd here, take an upvote for a great post!",
            "author": "YourBadDecision",
            "id": "hqysb5q",
            "parent_id": "t1_hqyrqnd",
            "score": 15,
            "created_utc": 1641149307.0,
            "replies": []
        },
        {
            "body": "You know there seems to be a bit of a theme here.  My greatest SB ever, didn't start out that way, we evolved into it.  I was supposed to be a casual fling for her, a vacay from her vanilla BF.  I sure wasn't looking for the thing that developed, but as we grew into spending more and more time together, it just had a natural energy of its own.  Doubtless, if either of us had pushed it to be more than it was at any point in time, the other one may have fled to the hills.  Till the day we split, it always seemed we were getting better all the time, with no plan as to where it might end up.  u/MrBuzzard, seems like your thing went along the same path, am I correct?\n\nTakeaway?  Be glad for what you have, while you have it.  Comparison is the enemy of a fine and happy place, don't worry about what someone else has, they are not you.  Be happy for what you have.",
            "author": "YourBadDecision",
            "id": "hr0pk7h",
            "parent_id": "t1_hqyy6k4",
            "score": 10,
            "created_utc": 1641176390.0,
            "replies": [
                {
                    "body": "Ya, very similar path.  She had experienced jerks prior to me.  So very early on, we had discussions about her high level expectations.  That helped me develop a rapid understanding of how she ticked.  My primary takeaway was to not be aggressive and let her come to me at her own pace.  I was VERY patient with her.  During that phase it became apparent that I cared about her as a person first and foremost, and did not see her as some kind of wind-up sex doll.   When her affection really kicked in, I knew it was real.",
                    "author": "MrBuzzard",
                    "id": "hr0s3si",
                    "parent_id": "t1_hr0pk7h",
                    "score": 11,
                    "created_utc": 1641177451.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think I’ve been promised some psychedelics in the desert at some point",
            "author": null,
            "id": "hr0g1tm",
            "parent_id": "t1_hr0elz1",
            "score": 7,
            "created_utc": 1641172434.0,
            "replies": [
                {
                    "body": " *That* sounds like an experience worth having!",
                    "author": "daddoms",
                    "id": "hr0gd7f",
                    "parent_id": "t1_hr0g1tm",
                    "score": 3,
                    "created_utc": 1641172567.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah I’m definitely not knocking those who prefer NSA, I just feel for any long term SR then there’s definitely some strings involved. I connect with people easily though so maybe my opinion are a bit biased lol",
            "author": "katsandlasers",
            "id": "hr0c2yz",
            "parent_id": "t1_hr0blnu",
            "score": 3,
            "created_utc": 1641170776.0,
            "replies": []
        },
        {
            "body": "Yes 😭",
            "author": "queeenlilith",
            "id": "hqyrcub",
            "parent_id": "t1_hqyrb6j",
            "score": 4,
            "created_utc": 1641148971.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hqyznaw",
            "parent_id": "t1_hqyxyuq",
            "score": 3,
            "created_utc": 1641151983.0,
            "replies": [
                {
                    "body": "Yes.  And not just over-communication.  Spontaneously pampering your SB is going to absolutely delight her.  But if you give her a big speech about how you're going to pamper her, now she has every right to have some expectations -- her idea of pampering might be very different from yours and end up disappointing her, and/or she might rely on \"I'll pamper you\" as a promise and part of the reason she accepts the allowance (in other words, it's now an entitlement rather than a delightful surprise).  So to me it's less about over-communicating than it is about unintentionally turning your organic gestures into an entitlement\n\nTake the risk, do extra for her, realizing it might not be reciprocated, and see how things go",
                    "author": "Azurecole",
                    "id": "hqz0ecs",
                    "parent_id": "t1_hqyznaw",
                    "score": 7,
                    "created_utc": 1641152263.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🤣🤣🤣  this hits close to home",
            "author": null,
            "id": "hqyt449",
            "parent_id": "t1_hqyqki8",
            "score": 6,
            "created_utc": 1641149595.0,
            "replies": []
        },
        {
            "body": "OP, I honestly loved this post. Do you think it would be coming out as too strong if what you said was summarized and shared with POTs who ask what you looking for in an arrangement? Or with current SDs ?",
            "author": "DallasForeignForeign",
            "id": "hr1tpof",
            "parent_id": "t1_hr13u28",
            "score": 1,
            "created_utc": 1641198008.0,
            "replies": [
                {
                    "body": "Yes, I suspect it's too much.  IME, it takes months -- sometimes longer -- to hit everything above.  And my expectation is, you could write an SB-version of my post, and I need to be feeling all that back.    Presenting this to a POT, might be like going on Tinder and while you're still messaging, jumping straight to \"so I want to be married, house, three kids.  What should we name the dog?\"  Hey, maybe we should have a first date first!\n\nI do think you can back off this to the elements that give you a chance to build towards it -- chemistry and connection (not nsa or fwb), mutual respect and appreciation, etc.  The seeds that have potential to grow into something great",
                    "author": "Azurecole",
                    "id": "hr2wfvw",
                    "parent_id": "t1_hr1tpof",
                    "score": 2,
                    "created_utc": 1641222889.0,
                    "replies": [
                        {
                            "body": "Lol I absolutely understand presenting  it to a POT might be too much. Makes sense. Thanks",
                            "author": "DallasForeignForeign",
                            "id": "hr381au",
                            "parent_id": "t1_hr2wfvw",
                            "score": 1,
                            "created_utc": 1641227649.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good call re. the honeymoon phase.  Feeling that way would likely require a fair bit of time.  \n\nI guess the more effort I was talking about was what you're referring to as keeping it fresh.  Maybe the same amount of effort but some added overhead in finding new ways to enjoy each other.",
            "author": "YummyFrostingSD",
            "id": "hr3rdjg",
            "parent_id": "t1_hr3bxn7",
            "score": 1,
            "created_utc": 1641234832.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "iamo6e9",
            "parent_id": "t1_iaml26b",
            "score": 1,
            "created_utc": 1653973534.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "iamq2fn",
                    "parent_id": "t1_iamo6e9",
                    "score": 1,
                    "created_utc": 1653974876.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "iamsjon",
                            "parent_id": "t1_iamq2fn",
                            "score": 1,
                            "created_utc": 1653976725.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "iamv1sm",
                                    "parent_id": "t1_iamsjon",
                                    "score": 1,
                                    "created_utc": 1653978722.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "ianxkoz",
                                            "parent_id": "t1_iamv1sm",
                                            "score": 1,
                                            "created_utc": 1654006236.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "iao23di",
                                                    "parent_id": "t1_ianxkoz",
                                                    "score": 1,
                                                    "created_utc": 1654008295.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "iap6xgf",
                                                            "parent_id": "t1_iao23di",
                                                            "score": 1,
                                                            "created_utc": 1654026294.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Your goal here is to troll, not have a discussion -- and you want to be argumentative and negative the entire time.  The mod team is split between SBs and SDs.  We don't compare to SW because that mostly means people outside our community -- escorts -- come in and tell us what our community is supposed to be about.  Good day",
                                                                    "author": "Azurecole",
                                                                    "id": "iap8837",
                                                                    "parent_id": "t1_iap6xgf",
                                                                    "score": 1,
                                                                    "created_utc": 1654026855.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ya, very similar path.  She had experienced jerks prior to me.  So very early on, we had discussions about her high level expectations.  That helped me develop a rapid understanding of how she ticked.  My primary takeaway was to not be aggressive and let her come to me at her own pace.  I was VERY patient with her.  During that phase it became apparent that I cared about her as a person first and foremost, and did not see her as some kind of wind-up sex doll.   When her affection really kicked in, I knew it was real.",
            "author": "MrBuzzard",
            "id": "hr0s3si",
            "parent_id": "t1_hr0pk7h",
            "score": 11,
            "created_utc": 1641177451.0,
            "replies": []
        },
        {
            "body": " *That* sounds like an experience worth having!",
            "author": "daddoms",
            "id": "hr0gd7f",
            "parent_id": "t1_hr0g1tm",
            "score": 3,
            "created_utc": 1641172567.0,
            "replies": []
        },
        {
            "body": "Yes.  And not just over-communication.  Spontaneously pampering your SB is going to absolutely delight her.  But if you give her a big speech about how you're going to pamper her, now she has every right to have some expectations -- her idea of pampering might be very different from yours and end up disappointing her, and/or she might rely on \"I'll pamper you\" as a promise and part of the reason she accepts the allowance (in other words, it's now an entitlement rather than a delightful surprise).  So to me it's less about over-communicating than it is about unintentionally turning your organic gestures into an entitlement\n\nTake the risk, do extra for her, realizing it might not be reciprocated, and see how things go",
            "author": "Azurecole",
            "id": "hqz0ecs",
            "parent_id": "t1_hqyznaw",
            "score": 7,
            "created_utc": 1641152263.0,
            "replies": []
        },
        {
            "body": "Yes, I suspect it's too much.  IME, it takes months -- sometimes longer -- to hit everything above.  And my expectation is, you could write an SB-version of my post, and I need to be feeling all that back.    Presenting this to a POT, might be like going on Tinder and while you're still messaging, jumping straight to \"so I want to be married, house, three kids.  What should we name the dog?\"  Hey, maybe we should have a first date first!\n\nI do think you can back off this to the elements that give you a chance to build towards it -- chemistry and connection (not nsa or fwb), mutual respect and appreciation, etc.  The seeds that have potential to grow into something great",
            "author": "Azurecole",
            "id": "hr2wfvw",
            "parent_id": "t1_hr1tpof",
            "score": 2,
            "created_utc": 1641222889.0,
            "replies": [
                {
                    "body": "Lol I absolutely understand presenting  it to a POT might be too much. Makes sense. Thanks",
                    "author": "DallasForeignForeign",
                    "id": "hr381au",
                    "parent_id": "t1_hr2wfvw",
                    "score": 1,
                    "created_utc": 1641227649.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "iamq2fn",
            "parent_id": "t1_iamo6e9",
            "score": 1,
            "created_utc": 1653974876.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "iamsjon",
                    "parent_id": "t1_iamq2fn",
                    "score": 1,
                    "created_utc": 1653976725.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "iamv1sm",
                            "parent_id": "t1_iamsjon",
                            "score": 1,
                            "created_utc": 1653978722.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "ianxkoz",
                                    "parent_id": "t1_iamv1sm",
                                    "score": 1,
                                    "created_utc": 1654006236.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "iao23di",
                                            "parent_id": "t1_ianxkoz",
                                            "score": 1,
                                            "created_utc": 1654008295.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "iap6xgf",
                                                    "parent_id": "t1_iao23di",
                                                    "score": 1,
                                                    "created_utc": 1654026294.0,
                                                    "replies": [
                                                        {
                                                            "body": "Your goal here is to troll, not have a discussion -- and you want to be argumentative and negative the entire time.  The mod team is split between SBs and SDs.  We don't compare to SW because that mostly means people outside our community -- escorts -- come in and tell us what our community is supposed to be about.  Good day",
                                                            "author": "Azurecole",
                                                            "id": "iap8837",
                                                            "parent_id": "t1_iap6xgf",
                                                            "score": 1,
                                                            "created_utc": 1654026855.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol I absolutely understand presenting  it to a POT might be too much. Makes sense. Thanks",
            "author": "DallasForeignForeign",
            "id": "hr381au",
            "parent_id": "t1_hr2wfvw",
            "score": 1,
            "created_utc": 1641227649.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "iamsjon",
            "parent_id": "t1_iamq2fn",
            "score": 1,
            "created_utc": 1653976725.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "iamv1sm",
                    "parent_id": "t1_iamsjon",
                    "score": 1,
                    "created_utc": 1653978722.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "ianxkoz",
                            "parent_id": "t1_iamv1sm",
                            "score": 1,
                            "created_utc": 1654006236.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "iao23di",
                                    "parent_id": "t1_ianxkoz",
                                    "score": 1,
                                    "created_utc": 1654008295.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "iap6xgf",
                                            "parent_id": "t1_iao23di",
                                            "score": 1,
                                            "created_utc": 1654026294.0,
                                            "replies": [
                                                {
                                                    "body": "Your goal here is to troll, not have a discussion -- and you want to be argumentative and negative the entire time.  The mod team is split between SBs and SDs.  We don't compare to SW because that mostly means people outside our community -- escorts -- come in and tell us what our community is supposed to be about.  Good day",
                                                    "author": "Azurecole",
                                                    "id": "iap8837",
                                                    "parent_id": "t1_iap6xgf",
                                                    "score": 1,
                                                    "created_utc": 1654026855.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "iamv1sm",
            "parent_id": "t1_iamsjon",
            "score": 1,
            "created_utc": 1653978722.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "ianxkoz",
                    "parent_id": "t1_iamv1sm",
                    "score": 1,
                    "created_utc": 1654006236.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "iao23di",
                            "parent_id": "t1_ianxkoz",
                            "score": 1,
                            "created_utc": 1654008295.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "iap6xgf",
                                    "parent_id": "t1_iao23di",
                                    "score": 1,
                                    "created_utc": 1654026294.0,
                                    "replies": [
                                        {
                                            "body": "Your goal here is to troll, not have a discussion -- and you want to be argumentative and negative the entire time.  The mod team is split between SBs and SDs.  We don't compare to SW because that mostly means people outside our community -- escorts -- come in and tell us what our community is supposed to be about.  Good day",
                                            "author": "Azurecole",
                                            "id": "iap8837",
                                            "parent_id": "t1_iap6xgf",
                                            "score": 1,
                                            "created_utc": 1654026855.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ianxkoz",
            "parent_id": "t1_iamv1sm",
            "score": 1,
            "created_utc": 1654006236.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "iao23di",
                    "parent_id": "t1_ianxkoz",
                    "score": 1,
                    "created_utc": 1654008295.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "iap6xgf",
                            "parent_id": "t1_iao23di",
                            "score": 1,
                            "created_utc": 1654026294.0,
                            "replies": [
                                {
                                    "body": "Your goal here is to troll, not have a discussion -- and you want to be argumentative and negative the entire time.  The mod team is split between SBs and SDs.  We don't compare to SW because that mostly means people outside our community -- escorts -- come in and tell us what our community is supposed to be about.  Good day",
                                    "author": "Azurecole",
                                    "id": "iap8837",
                                    "parent_id": "t1_iap6xgf",
                                    "score": 1,
                                    "created_utc": 1654026855.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "iao23di",
            "parent_id": "t1_ianxkoz",
            "score": 1,
            "created_utc": 1654008295.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "iap6xgf",
                    "parent_id": "t1_iao23di",
                    "score": 1,
                    "created_utc": 1654026294.0,
                    "replies": [
                        {
                            "body": "Your goal here is to troll, not have a discussion -- and you want to be argumentative and negative the entire time.  The mod team is split between SBs and SDs.  We don't compare to SW because that mostly means people outside our community -- escorts -- come in and tell us what our community is supposed to be about.  Good day",
                            "author": "Azurecole",
                            "id": "iap8837",
                            "parent_id": "t1_iap6xgf",
                            "score": 1,
                            "created_utc": 1654026855.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "iap6xgf",
            "parent_id": "t1_iao23di",
            "score": 1,
            "created_utc": 1654026294.0,
            "replies": [
                {
                    "body": "Your goal here is to troll, not have a discussion -- and you want to be argumentative and negative the entire time.  The mod team is split between SBs and SDs.  We don't compare to SW because that mostly means people outside our community -- escorts -- come in and tell us what our community is supposed to be about.  Good day",
                    "author": "Azurecole",
                    "id": "iap8837",
                    "parent_id": "t1_iap6xgf",
                    "score": 1,
                    "created_utc": 1654026855.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your goal here is to troll, not have a discussion -- and you want to be argumentative and negative the entire time.  The mod team is split between SBs and SDs.  We don't compare to SW because that mostly means people outside our community -- escorts -- come in and tell us what our community is supposed to be about.  Good day",
            "author": "Azurecole",
            "id": "iap8837",
            "parent_id": "t1_iap6xgf",
            "score": 1,
            "created_utc": 1654026855.0,
            "replies": []
        }
    ]
}