{
    "title": "JWJ getting recognized as a \"Funny Guy\" in the Denmark because of Running Man(Dopojarak: Story of Homme the K-Wanderer EP. 4)",
    "post_id": "we340e",
    "post_url": "https://www.reddit.com/r/runningman/comments/we340e/jwj_getting_recognized_as_a_funny_guy_in_the/",
    "author": "kkang_kkang",
    "body": "",
    "url": "https://v.redd.it/5zs20bzii8f91",
    "score": 338,
    "upvote_ratio": 0.99,
    "created_utc": 1659417565.0,
    "num_comments": 41,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "lol the way he tries to fix his image by saying he is a model not a funny guy. There is no going back once u appear in RM like tht.\n\nLKS tried for 11 years n couldn't either 😂",
            "author": "MeepnBeep",
            "id": "iilzeth",
            "parent_id": "t3_we340e",
            "score": 116,
            "created_utc": 1659420030.0,
            "replies": [
                {
                    "body": "Definitely, there is no going back. RM won't let you do anyway. I hope the next episode with JWJ and other guests will be funnier as hell.",
                    "author": "kkang_kkang",
                    "id": "iim2xu8",
                    "parent_id": "t1_iilzeth",
                    "score": 37,
                    "created_utc": 1659422616.0,
                    "replies": []
                },
                {
                    "body": "LKS tried and ended up a 'Hybrid' instead hahaha",
                    "author": "PotatoBulletGun",
                    "id": "iimmd7d",
                    "parent_id": "t1_iilzeth",
                    "score": 20,
                    "created_utc": 1659438105.0,
                    "replies": []
                },
                {
                    "body": "To be fair he still has hope. Joong Ki fixed his image of being an overeager clumsy guy and Gary fixed his image from the funny \"randumb\" guy in RM to a doting sentimental family man.",
                    "author": "lolminna",
                    "id": "iimia7z",
                    "parent_id": "t1_iilzeth",
                    "score": 17,
                    "created_utc": 1659435082.0,
                    "replies": []
                },
                {
                    "body": "Lol He went from model/actor to actor/entertainer to entertainer/actor",
                    "author": "wontoan87",
                    "id": "iimxjz6",
                    "parent_id": "t1_iilzeth",
                    "score": 9,
                    "created_utc": 1659444615.0,
                    "replies": []
                },
                {
                    "body": "Time to pay the association fee",
                    "author": "Eenix95",
                    "id": "iioh1fq",
                    "parent_id": "t1_iilzeth",
                    "score": 9,
                    "created_utc": 1659466378.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm glad RM uncovered the gem that is Woojae 😂 Excited to see him back for this Sunday's ep",
            "author": "Deroucadetoo",
            "id": "iilwnvm",
            "parent_id": "t3_we340e",
            "score": 70,
            "created_utc": 1659418173.0,
            "replies": [
                {
                    "body": "Yes, I am very much excited. I don't know how many RM fans watch \"Dopojarak: Story of Homme the K-Wanderer\" because of KJK and/or JWJ, but it is really a good show. And JWJ is really funny, un-predictive and stupid at the same like LKS and even though KJK is on the show, JWJ gets enough footage on his own without trying hard. \n\nIf you watch it you'll immediately realize the difference between the KJK of RM and KJK of this show. Maybe because of KJK's different role in these two shows and the different format of these shows as well. But, it's a good show which you can give it a try.",
                    "author": "kkang_kkang",
                    "id": "iilxhbc",
                    "parent_id": "t1_iilwnvm",
                    "score": 22,
                    "created_utc": 1659418717.0,
                    "replies": [
                        {
                            "body": "Where can I watch it?",
                            "author": "howtosarang",
                            "id": "iiqbux8",
                            "parent_id": "t1_iilxhbc",
                            "score": 2,
                            "created_utc": 1659493768.0,
                            "replies": [
                                {
                                    "body": "Kocowa and ondemandkorea",
                                    "author": "kkang_kkang",
                                    "id": "iiqokd8",
                                    "parent_id": "t1_iiqbux8",
                                    "score": 1,
                                    "created_utc": 1659500093.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I just finished the whole season! It was so good. JWJ is really a variety rising star. Noh Sang Hyun was surprisingly good as well. No one would expect such a handsome man to be that funny and witty. I love his dry humor.",
                            "author": "SirHovaOfBrooklyn",
                            "id": "ip67svc",
                            "parent_id": "t1_iilxhbc",
                            "score": 2,
                            "created_utc": 1663664588.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "With this clip and YSC being recognized by the tourist on recent ep, I am glad to see that Running Man remains relevant.",
            "author": "Arktoscircle",
            "id": "iim45d3",
            "parent_id": "t3_we340e",
            "score": 60,
            "created_utc": 1659423549.0,
            "replies": [
                {
                    "body": "Yeah, that's true. I hope this COVID situation gets over so they can launch second global family project so they can connect with the overseas fans directly. RM is no longer limited to South Asia any more, slowly it's getting popular in rest of the world as well.",
                    "author": "kkang_kkang",
                    "id": "iim5qxs",
                    "parent_id": "t1_iim45d3",
                    "score": 12,
                    "created_utc": 1659424801.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Seriously, Running Man is very big outside Korea. Just look at the latest episode. That ajussi doesn't really gove a hoot but that Singaporean family really knows who Se Chan is.",
            "author": "abgbob",
            "id": "iim7pwn",
            "parent_id": "t3_we340e",
            "score": 60,
            "created_utc": 1659426403.0,
            "replies": [
                {
                    "body": "Yes, even in this show, KJK easily gets recognised because of RM in Denmark, which is a European country.",
                    "author": "kkang_kkang",
                    "id": "iim8f1r",
                    "parent_id": "t1_iim7pwn",
                    "score": 18,
                    "created_utc": 1659426972.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The ship has sailed on that one, JWJ. You're now a  \"funny guy on RM that's also a model.\"",
            "author": "badstewie",
            "id": "iim4tss",
            "parent_id": "t3_we340e",
            "score": 25,
            "created_utc": 1659424070.0,
            "replies": []
        },
        {
            "body": "He's one of my favorite guests. Excited for next week episode.",
            "author": "juanritos",
            "id": "iim55sp",
            "parent_id": "t3_we340e",
            "score": 12,
            "created_utc": 1659424335.0,
            "replies": []
        },
        {
            "body": "Denmark? Wow, never thought they would be recognised in Denmark. That really shows that running man is really popular outside of South Korea.",
            "author": "soldierdiablo",
            "id": "iimqcxq",
            "parent_id": "t3_we340e",
            "score": 11,
            "created_utc": 1659440686.0,
            "replies": [
                {
                    "body": "It is indeed. And it shows that it is getting more popular day by day. I hope COVID gets over as soon as possible so RM can launch new global family tour in other parts of the world as well.",
                    "author": "kkang_kkang",
                    "id": "iimrua9",
                    "parent_id": "t1_iimqcxq",
                    "score": 6,
                    "created_utc": 1659441551.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "WAIT WHAT?! Jongkook was in my humble nation, Denmark?! F\\*CK, wish I had known. Would have taken the next plane to Copenhagen to meet him.",
            "author": "Rude_Kaleidoscope_63",
            "id": "iip4p3l",
            "parent_id": "t3_we340e",
            "score": 7,
            "created_utc": 1659475374.0,
            "replies": []
        },
        {
            "body": "Where can we watch this? It's not in VIU :(",
            "author": "Terrible_Albatross53",
            "id": "iim34px",
            "parent_id": "t3_we340e",
            "score": 5,
            "created_utc": 1659422761.0,
            "replies": [
                {
                    "body": "On Kocowa, ondemandkorea, etc. it is available.",
                    "author": "kkang_kkang",
                    "id": "iim3pvc",
                    "parent_id": "t1_iim34px",
                    "score": 5,
                    "created_utc": 1659423215.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Woo Jae is basically the next Kwang Soo, except the betrayer part.",
            "author": "Apprehensive-Ant8102",
            "id": "iin7wwt",
            "parent_id": "t3_we340e",
            "score": 5,
            "created_utc": 1659449311.0,
            "replies": []
        },
        {
            "body": "This proves the huge international popularity of RM!",
            "author": "AbbreviationsMuch382",
            "id": "iio2duj",
            "parent_id": "t3_we340e",
            "score": 4,
            "created_utc": 1659460884.0,
            "replies": [
                {
                    "body": "Yes, it does. And this show is on MBC, so they must be envious of SBS because of RM. On the other hand, this way as well RM members will get more opportunities to do various shows.",
                    "author": "kkang_kkang",
                    "id": "iio3373",
                    "parent_id": "t1_iio2duj",
                    "score": 2,
                    "created_utc": 1659461146.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What episode does he show up? Can someone list them please?",
            "author": "bucckhy",
            "id": "iimomso",
            "parent_id": "t3_we340e",
            "score": 2,
            "created_utc": 1659439613.0,
            "replies": [
                {
                    "body": "Well, he is the regular member of this show. This particular clip is from the episode number 4, as mentioned in the title of the post.",
                    "author": "kkang_kkang",
                    "id": "iimrmr5",
                    "parent_id": "t1_iimomso",
                    "score": 1,
                    "created_utc": 1659441430.0,
                    "replies": []
                },
                {
                    "body": "Woo Jae starts appearing on RM early this year. Episode 588-589, 592 and 601. He will be the guest on the coming episode as well: 615",
                    "author": "Arktoscircle",
                    "id": "iip7lsu",
                    "parent_id": "t1_iimomso",
                    "score": 1,
                    "created_utc": 1659476512.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "lmao",
            "author": "SupremeDogEater",
            "id": "iin9uum",
            "parent_id": "t3_we340e",
            "score": 2,
            "created_utc": 1659450120.0,
            "replies": []
        },
        {
            "body": "I didn’t know about this show where can I watch it?",
            "author": "MchllGrc",
            "id": "iinea1h",
            "parent_id": "t3_we340e",
            "score": 2,
            "created_utc": 1659451887.0,
            "replies": [
                {
                    "body": " You may watch it on Kocowa, ondemandkorea.",
                    "author": "kkang_kkang",
                    "id": "iinehu5",
                    "parent_id": "t1_iinea1h",
                    "score": 2,
                    "created_utc": 1659451973.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I thought about posting this after watching the episode, good that it was posted. Running Man really is that popular, I don't think SBS would ever shut it down. Also idk about everyone but I have always felt that JWJ is not very funny, his humor and execution feels stiff. And maybe I'm a little off on the mark, but I think he can't laugh at himself. He got irritated when Jae Seok was showing his teeth, now here funny guy must have translated to him as comedian so he corrected them by repeatedly saying he's a model.",
            "author": "DanRelkiyn",
            "id": "iilz0bb",
            "parent_id": "t3_we340e",
            "score": 6,
            "created_utc": 1659419744.0,
            "replies": [
                {
                    "body": "I think any “irritation” he shows is kind of like pantomime - to make his beleaguered, unappreciated, unacknowledged status in that moment even funnier. I’ve been finding him really funny lately.\n\nWoo Jae asking the RM crew if they’d rather not know what “Earth” is or not know what “shine muscat” is lives in my head rent-free.\n\nI just watched the second ep of a new variety show called “홍김동전” with Joo woo Jae, Hong Jinkyung, Kim Sook, among others… He really shone in that episode. And it becomes clear he takes the trials and tribulations that variety foists on him with a very light, playful touch.\n\nHe’s really coming into this own variety-wise. It’s been fun seeing it, because I used to watch Sechan and Woo Jae in the traveling dating show they used to do together, and Woo Jae was basically a background prop on that show. He barely made any impact. But things are dramatically different now.",
                    "author": "it-s-luminescent",
                    "id": "iimdvoc",
                    "parent_id": "t1_iilz0bb",
                    "score": 15,
                    "created_utc": 1659431481.0,
                    "replies": []
                },
                {
                    "body": ">I have always felt that JWJ is not very funny, his humor and execution feels stiff. And maybe I'm a little off on the mark, but I think he can't laugh at himself.\n\nHe is NOT A COMEDIAN. He is different kind of person which makes people happy by not showing any kind emotions or very less emotions on his face in situations. If we compare LKS with JWJ, you'll realize that the LKS is very expressive and that made him best or one of the best in the reality/variety shows. But compared to LKS, JWJ is not that expressive but what he does or says is similar to what LKS did in the past. But JWJ is different that the LKS. But there is no doubt he is funny, even if you watch this show you'll realize that. The games they played to choose the room, conversations between them especially with KJK when KJK suggested that he can sleep on couch and JWJ replied to KJK instantly to do that. It's funny.\n\n>He got irritated when Jae Seok was showing his teeth\n\nYou need people to respond you in any way to get attention. You don't want only RM member teasing JWJ only in one direction only. That would become boring after some time. And in fact, it was good when he got irritated with YJS so that means he is totally engrossed in the situation and showing his true emotions which is the IMPORTANT FACTOR to get screen time in reality/variety shows.\n\nEDIT: many guests who came of RM hardly shows any reactions or respond back and that doesn't help them to get more screen time, in fact they get very few screen time because of they don't show their \"real self\" and hence RM fans hardly talks about them. There are very few guests who really clicked with the RM members and definitely JWJ is one of the them, no doubt.",
                    "author": "kkang_kkang",
                    "id": "iim26hz",
                    "parent_id": "t1_iilz0bb",
                    "score": 9,
                    "created_utc": 1659422052.0,
                    "replies": [
                        {
                            "body": "He really isn't a comedian or an entertaining person, he's not very humorous. I get that his shtick is his dry humor, but again it's not well executed. I do watch this show and I still don't find him funny. It's just my opinion, why so serious?  Suddenly talking about how variety shows work, screen times, and comparing him and kwangsoo, when it doesn't change the fact that he is what I said he is. This all boils down to difference in opinion, but you want to act as if its a fact that he's funny and you wouldn't want it any other way. Again, it's my opinion that he's not funny regardless of how others find him entertaining, I've already said that before. Don't be so upset about this.",
                            "author": "DanRelkiyn",
                            "id": "iim5nbb",
                            "parent_id": "t1_iim26hz",
                            "score": -1,
                            "created_utc": 1659424722.0,
                            "replies": [
                                {
                                    "body": "No, I am not upset. I get it that you are explaining your perspective and opinion on JWJ. And I accept that not every RM fans loves every guests, including RM members. \n\nI am just telling you why RM fans loves him more than they loved any other guests who appeared in this show. He is different which is I don't think it's everyone's cup of tea, most of the RM fans loves him might be because there is a gap after departure of LKS, maybe he reminds then of LKS, etc. \n\nBut I get your point. He is \"different\", but sometime you gets bored seeing similar stuff such as only comedians doing comedy, and you get excited when unexpectedly, someone brings laughter who were not supposed to in the first place.\n\nEdit: JWJ first appeared on the show in the \"Model\" episode where no one expected him to bring laughter but he managed to do that without trying hard with his interactions with other members, his imitation of other celebrities, etc. And I think that's why RM fans loved him.",
                                    "author": "kkang_kkang",
                                    "id": "iim6szn",
                                    "parent_id": "t1_iim5nbb",
                                    "score": 7,
                                    "created_utc": 1659425650.0,
                                    "replies": [
                                        {
                                            "body": "Ok, I get that. Everyone has their own favorite guests, that's true. I personally find Do Kwon and Young Ji entertaining.",
                                            "author": "DanRelkiyn",
                                            "id": "iim7kgy",
                                            "parent_id": "t1_iim6szn",
                                            "score": 2,
                                            "created_utc": 1659426278.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah, that's true. I love HYJ as well. I hope, if RM starts another global family project, she gets a chance. She has good chemistry with the RM members. \nOn a side note, I don't know whether you are aware of it or not, but HYJ and YSC are co- hosts on \"Change Days\" which is a dating show along with JDY and Code Kunst. It's really good.",
                                                    "author": "kkang_kkang",
                                                    "id": "iim7uu0",
                                                    "parent_id": "t1_iim7kgy",
                                                    "score": 5,
                                                    "created_utc": 1659426514.0,
                                                    "replies": [
                                                        {
                                                            "body": "Great line up of hosts with the exception of Code Kunst who I don't really care much about. Although I really like YSC, JDY and HYJ, I don't think I'll watch, thanks for the suggestion anyway.",
                                                            "author": "DanRelkiyn",
                                                            "id": "iim8ozl",
                                                            "parent_id": "t1_iim7uu0",
                                                            "score": 2,
                                                            "created_utc": 1659427201.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Looking hd video. Anyone have link or torrent plz share 👍👍",
            "author": "shin_chan07",
            "id": "ik69m83",
            "parent_id": "t3_we340e",
            "score": 1,
            "created_utc": 1660424197.0,
            "replies": []
        },
        {
            "body": "Definitely, there is no going back. RM won't let you do anyway. I hope the next episode with JWJ and other guests will be funnier as hell.",
            "author": "kkang_kkang",
            "id": "iim2xu8",
            "parent_id": "t1_iilzeth",
            "score": 37,
            "created_utc": 1659422616.0,
            "replies": []
        },
        {
            "body": "LKS tried and ended up a 'Hybrid' instead hahaha",
            "author": "PotatoBulletGun",
            "id": "iimmd7d",
            "parent_id": "t1_iilzeth",
            "score": 20,
            "created_utc": 1659438105.0,
            "replies": []
        },
        {
            "body": "To be fair he still has hope. Joong Ki fixed his image of being an overeager clumsy guy and Gary fixed his image from the funny \"randumb\" guy in RM to a doting sentimental family man.",
            "author": "lolminna",
            "id": "iimia7z",
            "parent_id": "t1_iilzeth",
            "score": 17,
            "created_utc": 1659435082.0,
            "replies": []
        },
        {
            "body": "Lol He went from model/actor to actor/entertainer to entertainer/actor",
            "author": "wontoan87",
            "id": "iimxjz6",
            "parent_id": "t1_iilzeth",
            "score": 9,
            "created_utc": 1659444615.0,
            "replies": []
        },
        {
            "body": "Time to pay the association fee",
            "author": "Eenix95",
            "id": "iioh1fq",
            "parent_id": "t1_iilzeth",
            "score": 9,
            "created_utc": 1659466378.0,
            "replies": []
        },
        {
            "body": "Yes, I am very much excited. I don't know how many RM fans watch \"Dopojarak: Story of Homme the K-Wanderer\" because of KJK and/or JWJ, but it is really a good show. And JWJ is really funny, un-predictive and stupid at the same like LKS and even though KJK is on the show, JWJ gets enough footage on his own without trying hard. \n\nIf you watch it you'll immediately realize the difference between the KJK of RM and KJK of this show. Maybe because of KJK's different role in these two shows and the different format of these shows as well. But, it's a good show which you can give it a try.",
            "author": "kkang_kkang",
            "id": "iilxhbc",
            "parent_id": "t1_iilwnvm",
            "score": 22,
            "created_utc": 1659418717.0,
            "replies": [
                {
                    "body": "Where can I watch it?",
                    "author": "howtosarang",
                    "id": "iiqbux8",
                    "parent_id": "t1_iilxhbc",
                    "score": 2,
                    "created_utc": 1659493768.0,
                    "replies": [
                        {
                            "body": "Kocowa and ondemandkorea",
                            "author": "kkang_kkang",
                            "id": "iiqokd8",
                            "parent_id": "t1_iiqbux8",
                            "score": 1,
                            "created_utc": 1659500093.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I just finished the whole season! It was so good. JWJ is really a variety rising star. Noh Sang Hyun was surprisingly good as well. No one would expect such a handsome man to be that funny and witty. I love his dry humor.",
                    "author": "SirHovaOfBrooklyn",
                    "id": "ip67svc",
                    "parent_id": "t1_iilxhbc",
                    "score": 2,
                    "created_utc": 1663664588.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, that's true. I hope this COVID situation gets over so they can launch second global family project so they can connect with the overseas fans directly. RM is no longer limited to South Asia any more, slowly it's getting popular in rest of the world as well.",
            "author": "kkang_kkang",
            "id": "iim5qxs",
            "parent_id": "t1_iim45d3",
            "score": 12,
            "created_utc": 1659424801.0,
            "replies": []
        },
        {
            "body": "Yes, even in this show, KJK easily gets recognised because of RM in Denmark, which is a European country.",
            "author": "kkang_kkang",
            "id": "iim8f1r",
            "parent_id": "t1_iim7pwn",
            "score": 18,
            "created_utc": 1659426972.0,
            "replies": []
        },
        {
            "body": "It is indeed. And it shows that it is getting more popular day by day. I hope COVID gets over as soon as possible so RM can launch new global family tour in other parts of the world as well.",
            "author": "kkang_kkang",
            "id": "iimrua9",
            "parent_id": "t1_iimqcxq",
            "score": 6,
            "created_utc": 1659441551.0,
            "replies": []
        },
        {
            "body": "On Kocowa, ondemandkorea, etc. it is available.",
            "author": "kkang_kkang",
            "id": "iim3pvc",
            "parent_id": "t1_iim34px",
            "score": 5,
            "created_utc": 1659423215.0,
            "replies": []
        },
        {
            "body": "Yes, it does. And this show is on MBC, so they must be envious of SBS because of RM. On the other hand, this way as well RM members will get more opportunities to do various shows.",
            "author": "kkang_kkang",
            "id": "iio3373",
            "parent_id": "t1_iio2duj",
            "score": 2,
            "created_utc": 1659461146.0,
            "replies": []
        },
        {
            "body": "Well, he is the regular member of this show. This particular clip is from the episode number 4, as mentioned in the title of the post.",
            "author": "kkang_kkang",
            "id": "iimrmr5",
            "parent_id": "t1_iimomso",
            "score": 1,
            "created_utc": 1659441430.0,
            "replies": []
        },
        {
            "body": "Woo Jae starts appearing on RM early this year. Episode 588-589, 592 and 601. He will be the guest on the coming episode as well: 615",
            "author": "Arktoscircle",
            "id": "iip7lsu",
            "parent_id": "t1_iimomso",
            "score": 1,
            "created_utc": 1659476512.0,
            "replies": []
        },
        {
            "body": " You may watch it on Kocowa, ondemandkorea.",
            "author": "kkang_kkang",
            "id": "iinehu5",
            "parent_id": "t1_iinea1h",
            "score": 2,
            "created_utc": 1659451973.0,
            "replies": []
        },
        {
            "body": "I think any “irritation” he shows is kind of like pantomime - to make his beleaguered, unappreciated, unacknowledged status in that moment even funnier. I’ve been finding him really funny lately.\n\nWoo Jae asking the RM crew if they’d rather not know what “Earth” is or not know what “shine muscat” is lives in my head rent-free.\n\nI just watched the second ep of a new variety show called “홍김동전” with Joo woo Jae, Hong Jinkyung, Kim Sook, among others… He really shone in that episode. And it becomes clear he takes the trials and tribulations that variety foists on him with a very light, playful touch.\n\nHe’s really coming into this own variety-wise. It’s been fun seeing it, because I used to watch Sechan and Woo Jae in the traveling dating show they used to do together, and Woo Jae was basically a background prop on that show. He barely made any impact. But things are dramatically different now.",
            "author": "it-s-luminescent",
            "id": "iimdvoc",
            "parent_id": "t1_iilz0bb",
            "score": 15,
            "created_utc": 1659431481.0,
            "replies": []
        },
        {
            "body": ">I have always felt that JWJ is not very funny, his humor and execution feels stiff. And maybe I'm a little off on the mark, but I think he can't laugh at himself.\n\nHe is NOT A COMEDIAN. He is different kind of person which makes people happy by not showing any kind emotions or very less emotions on his face in situations. If we compare LKS with JWJ, you'll realize that the LKS is very expressive and that made him best or one of the best in the reality/variety shows. But compared to LKS, JWJ is not that expressive but what he does or says is similar to what LKS did in the past. But JWJ is different that the LKS. But there is no doubt he is funny, even if you watch this show you'll realize that. The games they played to choose the room, conversations between them especially with KJK when KJK suggested that he can sleep on couch and JWJ replied to KJK instantly to do that. It's funny.\n\n>He got irritated when Jae Seok was showing his teeth\n\nYou need people to respond you in any way to get attention. You don't want only RM member teasing JWJ only in one direction only. That would become boring after some time. And in fact, it was good when he got irritated with YJS so that means he is totally engrossed in the situation and showing his true emotions which is the IMPORTANT FACTOR to get screen time in reality/variety shows.\n\nEDIT: many guests who came of RM hardly shows any reactions or respond back and that doesn't help them to get more screen time, in fact they get very few screen time because of they don't show their \"real self\" and hence RM fans hardly talks about them. There are very few guests who really clicked with the RM members and definitely JWJ is one of the them, no doubt.",
            "author": "kkang_kkang",
            "id": "iim26hz",
            "parent_id": "t1_iilz0bb",
            "score": 9,
            "created_utc": 1659422052.0,
            "replies": [
                {
                    "body": "He really isn't a comedian or an entertaining person, he's not very humorous. I get that his shtick is his dry humor, but again it's not well executed. I do watch this show and I still don't find him funny. It's just my opinion, why so serious?  Suddenly talking about how variety shows work, screen times, and comparing him and kwangsoo, when it doesn't change the fact that he is what I said he is. This all boils down to difference in opinion, but you want to act as if its a fact that he's funny and you wouldn't want it any other way. Again, it's my opinion that he's not funny regardless of how others find him entertaining, I've already said that before. Don't be so upset about this.",
                    "author": "DanRelkiyn",
                    "id": "iim5nbb",
                    "parent_id": "t1_iim26hz",
                    "score": -1,
                    "created_utc": 1659424722.0,
                    "replies": [
                        {
                            "body": "No, I am not upset. I get it that you are explaining your perspective and opinion on JWJ. And I accept that not every RM fans loves every guests, including RM members. \n\nI am just telling you why RM fans loves him more than they loved any other guests who appeared in this show. He is different which is I don't think it's everyone's cup of tea, most of the RM fans loves him might be because there is a gap after departure of LKS, maybe he reminds then of LKS, etc. \n\nBut I get your point. He is \"different\", but sometime you gets bored seeing similar stuff such as only comedians doing comedy, and you get excited when unexpectedly, someone brings laughter who were not supposed to in the first place.\n\nEdit: JWJ first appeared on the show in the \"Model\" episode where no one expected him to bring laughter but he managed to do that without trying hard with his interactions with other members, his imitation of other celebrities, etc. And I think that's why RM fans loved him.",
                            "author": "kkang_kkang",
                            "id": "iim6szn",
                            "parent_id": "t1_iim5nbb",
                            "score": 7,
                            "created_utc": 1659425650.0,
                            "replies": [
                                {
                                    "body": "Ok, I get that. Everyone has their own favorite guests, that's true. I personally find Do Kwon and Young Ji entertaining.",
                                    "author": "DanRelkiyn",
                                    "id": "iim7kgy",
                                    "parent_id": "t1_iim6szn",
                                    "score": 2,
                                    "created_utc": 1659426278.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, that's true. I love HYJ as well. I hope, if RM starts another global family project, she gets a chance. She has good chemistry with the RM members. \nOn a side note, I don't know whether you are aware of it or not, but HYJ and YSC are co- hosts on \"Change Days\" which is a dating show along with JDY and Code Kunst. It's really good.",
                                            "author": "kkang_kkang",
                                            "id": "iim7uu0",
                                            "parent_id": "t1_iim7kgy",
                                            "score": 5,
                                            "created_utc": 1659426514.0,
                                            "replies": [
                                                {
                                                    "body": "Great line up of hosts with the exception of Code Kunst who I don't really care much about. Although I really like YSC, JDY and HYJ, I don't think I'll watch, thanks for the suggestion anyway.",
                                                    "author": "DanRelkiyn",
                                                    "id": "iim8ozl",
                                                    "parent_id": "t1_iim7uu0",
                                                    "score": 2,
                                                    "created_utc": 1659427201.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Where can I watch it?",
            "author": "howtosarang",
            "id": "iiqbux8",
            "parent_id": "t1_iilxhbc",
            "score": 2,
            "created_utc": 1659493768.0,
            "replies": [
                {
                    "body": "Kocowa and ondemandkorea",
                    "author": "kkang_kkang",
                    "id": "iiqokd8",
                    "parent_id": "t1_iiqbux8",
                    "score": 1,
                    "created_utc": 1659500093.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I just finished the whole season! It was so good. JWJ is really a variety rising star. Noh Sang Hyun was surprisingly good as well. No one would expect such a handsome man to be that funny and witty. I love his dry humor.",
            "author": "SirHovaOfBrooklyn",
            "id": "ip67svc",
            "parent_id": "t1_iilxhbc",
            "score": 2,
            "created_utc": 1663664588.0,
            "replies": []
        },
        {
            "body": "He really isn't a comedian or an entertaining person, he's not very humorous. I get that his shtick is his dry humor, but again it's not well executed. I do watch this show and I still don't find him funny. It's just my opinion, why so serious?  Suddenly talking about how variety shows work, screen times, and comparing him and kwangsoo, when it doesn't change the fact that he is what I said he is. This all boils down to difference in opinion, but you want to act as if its a fact that he's funny and you wouldn't want it any other way. Again, it's my opinion that he's not funny regardless of how others find him entertaining, I've already said that before. Don't be so upset about this.",
            "author": "DanRelkiyn",
            "id": "iim5nbb",
            "parent_id": "t1_iim26hz",
            "score": -1,
            "created_utc": 1659424722.0,
            "replies": [
                {
                    "body": "No, I am not upset. I get it that you are explaining your perspective and opinion on JWJ. And I accept that not every RM fans loves every guests, including RM members. \n\nI am just telling you why RM fans loves him more than they loved any other guests who appeared in this show. He is different which is I don't think it's everyone's cup of tea, most of the RM fans loves him might be because there is a gap after departure of LKS, maybe he reminds then of LKS, etc. \n\nBut I get your point. He is \"different\", but sometime you gets bored seeing similar stuff such as only comedians doing comedy, and you get excited when unexpectedly, someone brings laughter who were not supposed to in the first place.\n\nEdit: JWJ first appeared on the show in the \"Model\" episode where no one expected him to bring laughter but he managed to do that without trying hard with his interactions with other members, his imitation of other celebrities, etc. And I think that's why RM fans loved him.",
                    "author": "kkang_kkang",
                    "id": "iim6szn",
                    "parent_id": "t1_iim5nbb",
                    "score": 7,
                    "created_utc": 1659425650.0,
                    "replies": [
                        {
                            "body": "Ok, I get that. Everyone has their own favorite guests, that's true. I personally find Do Kwon and Young Ji entertaining.",
                            "author": "DanRelkiyn",
                            "id": "iim7kgy",
                            "parent_id": "t1_iim6szn",
                            "score": 2,
                            "created_utc": 1659426278.0,
                            "replies": [
                                {
                                    "body": "Yeah, that's true. I love HYJ as well. I hope, if RM starts another global family project, she gets a chance. She has good chemistry with the RM members. \nOn a side note, I don't know whether you are aware of it or not, but HYJ and YSC are co- hosts on \"Change Days\" which is a dating show along with JDY and Code Kunst. It's really good.",
                                    "author": "kkang_kkang",
                                    "id": "iim7uu0",
                                    "parent_id": "t1_iim7kgy",
                                    "score": 5,
                                    "created_utc": 1659426514.0,
                                    "replies": [
                                        {
                                            "body": "Great line up of hosts with the exception of Code Kunst who I don't really care much about. Although I really like YSC, JDY and HYJ, I don't think I'll watch, thanks for the suggestion anyway.",
                                            "author": "DanRelkiyn",
                                            "id": "iim8ozl",
                                            "parent_id": "t1_iim7uu0",
                                            "score": 2,
                                            "created_utc": 1659427201.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Kocowa and ondemandkorea",
            "author": "kkang_kkang",
            "id": "iiqokd8",
            "parent_id": "t1_iiqbux8",
            "score": 1,
            "created_utc": 1659500093.0,
            "replies": []
        },
        {
            "body": "No, I am not upset. I get it that you are explaining your perspective and opinion on JWJ. And I accept that not every RM fans loves every guests, including RM members. \n\nI am just telling you why RM fans loves him more than they loved any other guests who appeared in this show. He is different which is I don't think it's everyone's cup of tea, most of the RM fans loves him might be because there is a gap after departure of LKS, maybe he reminds then of LKS, etc. \n\nBut I get your point. He is \"different\", but sometime you gets bored seeing similar stuff such as only comedians doing comedy, and you get excited when unexpectedly, someone brings laughter who were not supposed to in the first place.\n\nEdit: JWJ first appeared on the show in the \"Model\" episode where no one expected him to bring laughter but he managed to do that without trying hard with his interactions with other members, his imitation of other celebrities, etc. And I think that's why RM fans loved him.",
            "author": "kkang_kkang",
            "id": "iim6szn",
            "parent_id": "t1_iim5nbb",
            "score": 7,
            "created_utc": 1659425650.0,
            "replies": [
                {
                    "body": "Ok, I get that. Everyone has their own favorite guests, that's true. I personally find Do Kwon and Young Ji entertaining.",
                    "author": "DanRelkiyn",
                    "id": "iim7kgy",
                    "parent_id": "t1_iim6szn",
                    "score": 2,
                    "created_utc": 1659426278.0,
                    "replies": [
                        {
                            "body": "Yeah, that's true. I love HYJ as well. I hope, if RM starts another global family project, she gets a chance. She has good chemistry with the RM members. \nOn a side note, I don't know whether you are aware of it or not, but HYJ and YSC are co- hosts on \"Change Days\" which is a dating show along with JDY and Code Kunst. It's really good.",
                            "author": "kkang_kkang",
                            "id": "iim7uu0",
                            "parent_id": "t1_iim7kgy",
                            "score": 5,
                            "created_utc": 1659426514.0,
                            "replies": [
                                {
                                    "body": "Great line up of hosts with the exception of Code Kunst who I don't really care much about. Although I really like YSC, JDY and HYJ, I don't think I'll watch, thanks for the suggestion anyway.",
                                    "author": "DanRelkiyn",
                                    "id": "iim8ozl",
                                    "parent_id": "t1_iim7uu0",
                                    "score": 2,
                                    "created_utc": 1659427201.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ok, I get that. Everyone has their own favorite guests, that's true. I personally find Do Kwon and Young Ji entertaining.",
            "author": "DanRelkiyn",
            "id": "iim7kgy",
            "parent_id": "t1_iim6szn",
            "score": 2,
            "created_utc": 1659426278.0,
            "replies": [
                {
                    "body": "Yeah, that's true. I love HYJ as well. I hope, if RM starts another global family project, she gets a chance. She has good chemistry with the RM members. \nOn a side note, I don't know whether you are aware of it or not, but HYJ and YSC are co- hosts on \"Change Days\" which is a dating show along with JDY and Code Kunst. It's really good.",
                    "author": "kkang_kkang",
                    "id": "iim7uu0",
                    "parent_id": "t1_iim7kgy",
                    "score": 5,
                    "created_utc": 1659426514.0,
                    "replies": [
                        {
                            "body": "Great line up of hosts with the exception of Code Kunst who I don't really care much about. Although I really like YSC, JDY and HYJ, I don't think I'll watch, thanks for the suggestion anyway.",
                            "author": "DanRelkiyn",
                            "id": "iim8ozl",
                            "parent_id": "t1_iim7uu0",
                            "score": 2,
                            "created_utc": 1659427201.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, that's true. I love HYJ as well. I hope, if RM starts another global family project, she gets a chance. She has good chemistry with the RM members. \nOn a side note, I don't know whether you are aware of it or not, but HYJ and YSC are co- hosts on \"Change Days\" which is a dating show along with JDY and Code Kunst. It's really good.",
            "author": "kkang_kkang",
            "id": "iim7uu0",
            "parent_id": "t1_iim7kgy",
            "score": 5,
            "created_utc": 1659426514.0,
            "replies": [
                {
                    "body": "Great line up of hosts with the exception of Code Kunst who I don't really care much about. Although I really like YSC, JDY and HYJ, I don't think I'll watch, thanks for the suggestion anyway.",
                    "author": "DanRelkiyn",
                    "id": "iim8ozl",
                    "parent_id": "t1_iim7uu0",
                    "score": 2,
                    "created_utc": 1659427201.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great line up of hosts with the exception of Code Kunst who I don't really care much about. Although I really like YSC, JDY and HYJ, I don't think I'll watch, thanks for the suggestion anyway.",
            "author": "DanRelkiyn",
            "id": "iim8ozl",
            "parent_id": "t1_iim7uu0",
            "score": 2,
            "created_utc": 1659427201.0,
            "replies": []
        }
    ]
}