{
    "title": "This a****** wouldn't have changed at all",
    "post_id": "pnzr0e",
    "post_url": "https://www.reddit.com/r/dankruto/comments/pnzr0e/this_a_wouldnt_have_changed_at_all/",
    "author": "SeaworthinessWeary68",
    "body": "",
    "url": "https://i.redd.it/nni9sk5bzfn71.jpg",
    "score": 4596,
    "upvote_ratio": 0.99,
    "created_utc": 1631613571.0,
    "num_comments": 108,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "“For the village!”",
            "author": "idontwanttobeonthis",
            "id": "hct4vm3",
            "parent_id": "t3_pnzr0e",
            "score": 477,
            "created_utc": 1631620228.0,
            "replies": [
                {
                    "body": "The sad part is I think Danzo is deluded enough to actually believe that his actions are necessary and selfless.",
                    "author": "sonfoa",
                    "id": "hctzvgz",
                    "parent_id": "t1_hct4vm3",
                    "score": 207,
                    "created_utc": 1631634628.0,
                    "replies": [
                        {
                            "body": "More \"aggravating\" than \"sad\" for me. I think I could love to hate a villain who's wholly selfish and masks his actions with a thin veneer of patriotism, but the extent of Danzo's self-delusion is just baffling.",
                            "author": "secretMollusk",
                            "id": "hcuktvl",
                            "parent_id": "t1_hctzvgz",
                            "score": 80,
                            "created_utc": 1631643028.0,
                            "replies": [
                                {
                                    "body": "He is the most realistic villain - an irredeemable selfish hypocritical asshole who just want to ruin everyone's day while screaming he is doing it for the good of people.",
                                    "author": "sephelutis",
                                    "id": "hcvclh5",
                                    "parent_id": "t1_hcuktvl",
                                    "score": 53,
                                    "created_utc": 1631654054.0,
                                    "replies": [
                                        {
                                            "body": "Actually in danzos mind, and the feudal lord and councils, he was doing the right thing for the time. Uchiha massacre was valid since he did make a good point and they'd most likely try it again. Still should've tried shisuis plan though but shisui needed to die before the show to limit plot holes. Convincing hanzo(?) That the akasuki were villains wasn't exactly wrong either. By doing so, he had the chance to get rid of the biggest threats to his village. Danzo is a messed up fuck, but his actions, most atleast, weren't wrong for the time. He had selfish intent, but then again, so does Naruto and literally every other character in the show and people In real life. Danzo could've been the best villain in the show besides maybe madara, if he had his own saga.",
                                            "author": "xNuxIsGod",
                                            "id": "hcw01p6",
                                            "parent_id": "t1_hcvclh5",
                                            "score": 17,
                                            "created_utc": 1631664608.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "This sub: man danzo was an asshole, he eradicated an entire clan and used their own people to do it!\n\nAlso this sub: the Uchiha were evil and we're going to destroy the village if they took over!",
                                            "author": "nizzy2k11",
                                            "id": "hcwc48g",
                                            "parent_id": "t1_hcvclh5",
                                            "score": 5,
                                            "created_utc": 1631670127.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I agree. Danzos last act was to try to destroy Sasuke, who wanted to destroy the leaf village. He was a piece of shit, evil, dictatorial motherclucker, but I think he did care about the Leaf.\n\nJust not anyone but him running it.",
                            "author": "PMMeMeiRule34",
                            "id": "hcv072y",
                            "parent_id": "t1_hctzvgz",
                            "score": 36,
                            "created_utc": 1631649089.0,
                            "replies": [
                                {
                                    "body": "Headcannon fans would say otherwise but its established by even Danzo's worst enemies in the series he did everything for the Leaf. There is not one character that has said otherwise.",
                                    "author": "1RonnieMund",
                                    "id": "hcvv49i",
                                    "parent_id": "t1_hcv072y",
                                    "score": 8,
                                    "created_utc": 1631662298.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "The executed countless secret missions for the benefit of the village. Especially after the fourth died there was hardly anyone else to keep the other villages from attacking and leave room for relative peace.",
                            "author": "ac714",
                            "id": "hcuz0hj",
                            "parent_id": "t1_hctzvgz",
                            "score": 6,
                            "created_utc": 1631648625.0,
                            "replies": [
                                {
                                    "body": "Especially during and after the 1st shinobi war too. Both of Konoha's greatest weapons were dead and the village was still relatively new. There could have been all kinds of betrayal from the clans.",
                                    "author": "1RonnieMund",
                                    "id": "hcvv95s",
                                    "parent_id": "t1_hcuz0hj",
                                    "score": 3,
                                    "created_utc": 1631662361.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I'm sure Danzo would have taken out Otsutski to protect the village if Sasuke hadn't killed him... /s",
                    "author": null,
                    "id": "hct5gvt",
                    "parent_id": "t1_hct4vm3",
                    "score": 124,
                    "created_utc": 1631620601.0,
                    "replies": [
                        {
                            "body": "Danzo would bravely hide underground when Momoshiki showed up.",
                            "author": "sonfoa",
                            "id": "hctzaq3",
                            "parent_id": "t1_hct5gvt",
                            "score": 97,
                            "created_utc": 1631634397.0,
                            "replies": [
                                {
                                    "body": "Big facts. “We’ll rebuild and then I’ll become hokage” - danzo",
                                    "author": "idontwanttobeonthis",
                                    "id": "hctzrfj",
                                    "parent_id": "t1_hctzaq3",
                                    "score": 86,
                                    "created_utc": 1631634583.0,
                                    "replies": []
                                },
                                {
                                    "body": "Liked your usage of 'bravely' here lmao",
                                    "author": "AERegeneratel38",
                                    "id": "hcwaq3v",
                                    "parent_id": "t1_hctzaq3",
                                    "score": 2,
                                    "created_utc": 1631669490.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly tho, imagine if Danzo survived and went into hiding, and then he was the one who joined Kara instead of Ao, tho they could've also both joined, having more old characters in there would've made the whole thing more impactful(maybe he had another sharingan and the sealing attack he used when he was dying was just a diversion). Then in Boruto he'd have a few sharingans(let's say he took one from the Shins),  byakugans, and maybe he would've stolen one of Chino's katseryugan. It would've been pretty dope (also would've had Sasuke absolutely pissed off lol)",
            "author": "Tsynami",
            "id": "hct7np3",
            "parent_id": "t3_pnzr0e",
            "score": 158,
            "created_utc": 1631621919.0,
            "replies": [
                {
                    "body": "Didnt he steal shishui's eye?He could have applied his genjustsu on sasuke and tobi to make them think he died,i dont know",
                    "author": "tuberemulator",
                    "id": "hctcgyt",
                    "parent_id": "t1_hct7np3",
                    "score": 58,
                    "created_utc": 1631624503.0,
                    "replies": [
                        {
                            "body": "The genjutsu of Shisui was so powerful so it had a cooldown before it can be used again . Since Danzo used it in the five kage summit he didnt had the option of using it at that time and any other genjutsu would have been way too weak for Sasuke and Danzo",
                            "author": "Tarkik_Vatsa",
                            "id": "hctswzo",
                            "parent_id": "t1_hctcgyt",
                            "score": 48,
                            "created_utc": 1631631793.0,
                            "replies": [
                                {
                                    "body": "Thats not entirely true. Danzo could have used Shisui's eye but couldn't because he needed it for Madara. He says this during the fight that the eye is ready but he needs it for Madara and that Sasuke is already a lost cause.",
                                    "author": "1RonnieMund",
                                    "id": "hcvvgd8",
                                    "parent_id": "t1_hctswzo",
                                    "score": 7,
                                    "created_utc": 1631662452.0,
                                    "replies": [
                                        {
                                            "body": "So why didnt he do it on madara?",
                                            "author": "steplaser",
                                            "id": "hcvyu2d",
                                            "parent_id": "t1_hcvvgd8",
                                            "score": 1,
                                            "created_utc": 1631664049.0,
                                            "replies": [
                                                {
                                                    "body": "I'm not making it up Danzo literally says this during the fight. I'll break it down. \n\nDanzo was saving up the entire fight for Madara. He says it to himself and even Karin acknowledges the only time Danzo actually exerts himself and uses his chakra is for the Wood jutsu because he couldn't avoid Susano's arrow any other way. He says it to himself as well that he's forced to use chakra and it's a setback. He was relying on the Izanagi to tire Sasuke out and he did succeed but Sasuke casting the genjutsu for the final Izanagi set him back a ways. He was severely weakened and with no Izanagi. Still he was strong enough to avoid a chidori from Sasuke and capture Karin which he would settle on Sasuke being weak hearted and take Karin hostage thinking after Sasuke gives up to spare Karin, Madara would step in and then use the eye. Instead Sasuke chooses to attack her and Danzo and at that point he was probably too weakened to use Shisui's eye and chose instead to get rid of them both with his final sealing jutsu.\n\nI just finished rewatching the fight. It's a lot better than people give credit. Definitely worth a rewatch imo. The only thing I didn't like was Sasuke screaming away Danzo's paralysis jutsu and Danzo taking the time to taunt him instead of just killing him right away . Cliche villain writing lol.",
                                                    "author": "1RonnieMund",
                                                    "id": "hcwetfu",
                                                    "parent_id": "t1_hcvyu2d",
                                                    "score": 7,
                                                    "created_utc": 1631671355.0,
                                                    "replies": [
                                                        {
                                                            "body": "Nice review. What bothers me is that danzo could have killed sasuke with that curse marrk but sasuke noped out of it another kishi bs writing.",
                                                            "author": "steplaser",
                                                            "id": "hcwnbh7",
                                                            "parent_id": "t1_hcwetfu",
                                                            "score": 2,
                                                            "created_utc": 1631675499.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah not many people in the world can break an MS user's genjutsu let alone counter it ftw but as you say he just screams it off and Danzo does his little soliloquy instead of just finishing it sooner lol very cliché writing. Still I'll acknowledge Danzo's ability to just brush that off and even taunt him. He's not a real Uchiha and really not even a genius. Has futon...that's actually it. He has no special abilities other than the ones he had to steal and just through sheer planning was able to even put up a fight with an actual reincarnation of a god Uchiha. He planned so long how to fight even the strongest of the Uchiha it's almost like he was prepping for Madara all along.",
                                                                    "author": "1RonnieMund",
                                                                    "id": "hcxx1dp",
                                                                    "parent_id": "t1_hcwnbh7",
                                                                    "score": 1,
                                                                    "created_utc": 1631708463.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "But how effective would a sharingan genjutsu be against a dual eternal mangekyo sharingan Uchiha ?",
                                    "author": "EliYafah",
                                    "id": "hcutkx9",
                                    "parent_id": "t1_hctswzo",
                                    "score": 3,
                                    "created_utc": 1631646473.0,
                                    "replies": [
                                        {
                                            "body": "Shisui had a Mangekyo too . Plus , Konomanatsuki (i think I spelled it completely wrong) was stated to be the strongest genjutsu ever even stronger than Tsukuyomi .",
                                            "author": "Tarkik_Vatsa",
                                            "id": "hcuuic2",
                                            "parent_id": "t1_hcutkx9",
                                            "score": 12,
                                            "created_utc": 1631646844.0,
                                            "replies": [
                                                {
                                                    "body": "kotoamatsukami :)",
                                                    "author": "August_28th",
                                                    "id": "hcv320c",
                                                    "parent_id": "t1_hcuuic2",
                                                    "score": 6,
                                                    "created_utc": 1631650219.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ahh I got it wrong then 😅 . Thanks for correcting",
                                                            "author": "Tarkik_Vatsa",
                                                            "id": "hcwmiwo",
                                                            "parent_id": "t1_hcv320c",
                                                            "score": 2,
                                                            "created_utc": 1631675092.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "He's mangekyo is in video games only afaik and non Uchiha kakashi, with a single implemented normal sharingan was able to resist the tsukoyomi for a few seconds. So the likes of Sasuke who are pure Uchiha and have 2 eternal mangekyo are a totally different beast.",
                                                    "author": "EliYafah",
                                                    "id": "hcuxcdt",
                                                    "parent_id": "t1_hcuuic2",
                                                    "score": 1,
                                                    "created_utc": 1631647968.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Shisui was basically Aizen so it could only be used very sparingly. So good to mind control people for you with no drawbacks.",
                                                    "author": "ac714",
                                                    "id": "hcuzj1l",
                                                    "parent_id": "t1_hcuuic2",
                                                    "score": 1,
                                                    "created_utc": 1631648828.0,
                                                    "replies": [
                                                        {
                                                            "body": "Actually, his only drawback was that it used a lot of chakra and that it would blind him eventually. The time drawback was only for non uchiha users",
                                                            "author": "julio2399",
                                                            "id": "hcvxlv5",
                                                            "parent_id": "t1_hcuzj1l",
                                                            "score": 1,
                                                            "created_utc": 1631663464.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Wut? You’re not understanding the situation at all.\n\nThe guy can mind control…anyone. This includes other uchihas to use izanagi for his benefit, collect or create sharingans, and just straight up create an EMS solving the blindness issue.\n\nWe already know what a person can do with a kage in their pocket like Obito and Yagura so imagine having all the kages under your thumb. Hardly a stretch to accomplish given what we’ve been told.",
                                                                    "author": "ac714",
                                                                    "id": "hcvym8i",
                                                                    "parent_id": "t1_hcvxlv5",
                                                                    "score": 0,
                                                                    "created_utc": 1631663947.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "He was so dumb why didnt he save it for sasuke??",
                                    "author": "steplaser",
                                    "id": "hcvynxa",
                                    "parent_id": "t1_hctswzo",
                                    "score": 1,
                                    "created_utc": 1631663970.0,
                                    "replies": [
                                        {
                                            "body": "Q)why didnt he save it for sasuke??\n\nA)He was so dumb \n\nYou yourself answered your question",
                                            "author": "Tarkik_Vatsa",
                                            "id": "hcwmzz8",
                                            "parent_id": "t1_hcvynxa",
                                            "score": 1,
                                            "created_utc": 1631675335.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yeah, that could've also been done. Danzo just felt too disappointing, he was built up for so long but didn't amount to much",
                            "author": "Tsynami",
                            "id": "hctgpxn",
                            "parent_id": "t1_hctcgyt",
                            "score": 18,
                            "created_utc": 1631626549.0,
                            "replies": [
                                {
                                    "body": "Yeah honestly I think he shouldn't have died but that's my opinion maybe instead of the shin leader imagine if it was danzo",
                                    "author": "Gizshot",
                                    "id": "hcu91pw",
                                    "parent_id": "t1_hctgpxn",
                                    "score": 6,
                                    "created_utc": 1631638296.0,
                                    "replies": [
                                        {
                                            "body": "This would've made the whole thing way better tbh. Shin was already pretty bland, replacing him with Danzo who has the same gimmick as him (a ton of sharingan over his body) would've been pretty cool",
                                            "author": "Tsynami",
                                            "id": "hcujlbd",
                                            "parent_id": "t1_hcu91pw",
                                            "score": 5,
                                            "created_utc": 1631642520.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah would create a new evil arc and with shikimaru being like the dark side of the kage position that he is. he is quietly sending messages for intel with danzo. But I understand this is supposed to be muh next generation and danzo doesn't fit that but whatever.",
                                                    "author": "Gizshot",
                                                    "id": "hcuonbj",
                                                    "parent_id": "t1_hcujlbd",
                                                    "score": 4,
                                                    "created_utc": 1631644556.0,
                                                    "replies": [
                                                        {
                                                            "body": "I mean, it could've turned out that he was actually an outer for Kara and that's how he was getting resources. Plus we know that people like Sumire's dad were still loyal to Danzo even after his death, so it's not a stretch to say that he'd have some spies in Konoha",
                                                            "author": "Tsynami",
                                                            "id": "hcupw7m",
                                                            "parent_id": "t1_hcuonbj",
                                                            "score": 2,
                                                            "created_utc": 1631645030.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I liked his behind the scenes impact as a morally gray villain, stretching back to the Uchiha Massacre and even influencing the creation of Alatsuki. We didn’t see him fight much but I think he got just the right amount of screen time.",
                                    "author": "theuncommonman",
                                    "id": "hcvvng6",
                                    "parent_id": "t1_hctgpxn",
                                    "score": 2,
                                    "created_utc": 1631662540.0,
                                    "replies": []
                                },
                                {
                                    "body": "Built up for so long? When did that happen? He was brought in midway and rushed right the fuck out.",
                                    "author": "1RonnieMund",
                                    "id": "hcvvhid",
                                    "parent_id": "t1_hctgpxn",
                                    "score": 1,
                                    "created_utc": 1631662466.0,
                                    "replies": [
                                        {
                                            "body": "They started building him up when Sai was introduced",
                                            "author": "Tsynami",
                                            "id": "hcx68ih",
                                            "parent_id": "t1_hcvvhid",
                                            "score": 1,
                                            "created_utc": 1631687158.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "what if he just used substitution jutsu? /s",
                            "author": "Jugbot",
                            "id": "hcuhjmc",
                            "parent_id": "t1_hctcgyt",
                            "score": 4,
                            "created_utc": 1631641685.0,
                            "replies": []
                        },
                        {
                            "body": "he was trying to use kotoamatsukami, but sasuke didnt give him any options to use it,",
                            "author": "Doctor99268",
                            "id": "hcun3np",
                            "parent_id": "t1_hctcgyt",
                            "score": 0,
                            "created_utc": 1631643935.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Gotta get em all",
            "author": null,
            "id": "hct52jt",
            "parent_id": "t3_pnzr0e",
            "score": 91,
            "created_utc": 1631620352.0,
            "replies": [
                {
                    "body": "I wanna be the very best, that no one ever was. To steal them is my real test to implant them is my cause.\n\nI will travel across the land searching for far and wide \n\nSteal dojustu and understand the power that's inside \n\n(Dojustu gotta steal them all) it's me and me\n\nBeing hokage is my destiny \n\n(Dojustu) oh your my best plan/ in a village I must command",
                    "author": null,
                    "id": "hcub0uz",
                    "parent_id": "t1_hct52jt",
                    "score": 27,
                    "created_utc": 1631639088.0,
                    "replies": []
                },
                {
                    "body": "It's like the infinity stones.",
                    "author": "nizzy2k11",
                    "id": "hcwc9s2",
                    "parent_id": "t1_hct52jt",
                    "score": 3,
                    "created_utc": 1631670197.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "mangekyo! I chooooose youuuu!!!!",
            "author": "I_fking_Hate_Reddit",
            "id": "hcu0tow",
            "parent_id": "t3_pnzr0e",
            "score": 28,
            "created_utc": 1631635007.0,
            "replies": []
        },
        {
            "body": "One thing is for sure . There would have plenty more Nagatos",
            "author": "Tarkik_Vatsa",
            "id": "hctsivu",
            "parent_id": "t3_pnzr0e",
            "score": 45,
            "created_utc": 1631631631.0,
            "replies": [
                {
                    "body": "You really cannot blame Danzo for Nagato, the whole thing with Nagato would happen regardless of Danzo's input since Nagato was Madara's chosen one",
                    "author": "HateshWarkio",
                    "id": "hcu5a0p",
                    "parent_id": "t1_hctsivu",
                    "score": 19,
                    "created_utc": 1631636790.0,
                    "replies": [
                        {
                            "body": ">You really cannot blame Danzo for Nagato\n\nWhy not ? He was responsible for the killing of Yahiko . Yes Nagato was Madara's chosen one and he would have been his tool anyways but still that doesnt make Danzo's actions any better",
                            "author": "Tarkik_Vatsa",
                            "id": "hcu8f2d",
                            "parent_id": "t1_hcu5a0p",
                            "score": 14,
                            "created_utc": 1631638047.0,
                            "replies": [
                                {
                                    "body": "Except that that part is mostly filler\n\nThe only canon thing is that Hanzo teamed up with Danzo, that's it\n\nSo yes, you cannot blame Danzo for Nagato because canonically he just helped someone else (Hanzo) with their plan and that was probably just to ensure a better relationship between the Rain and the Leaf",
                                    "author": "HateshWarkio",
                                    "id": "hcu93ix",
                                    "parent_id": "t1_hcu8f2d",
                                    "score": 7,
                                    "created_utc": 1631638317.0,
                                    "replies": [
                                        {
                                            "body": "Damn . I forgot what part was filler and what was not . The fillers were trying too hard to show Danzo as evil . I think you are right then . I thought that Danzo manipulating Hanzo was canon .",
                                            "author": "Tarkik_Vatsa",
                                            "id": "hcuapmk",
                                            "parent_id": "t1_hcu93ix",
                                            "score": 7,
                                            "created_utc": 1631638962.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah, 99% of the shit that gets blamed on Danzo is from fillers, they were really making him into this evilest guy around\n\nWhen in reality, he was just ruthless and calculating\n\nHe might even have Sasuke-like background since we know that Danzo comes from the Shimura clan but the only thing we know about the Shimura clan is that Danzo's father and grandfather got killed on a battlefield so he might be the last member of his clan",
                                                    "author": "HateshWarkio",
                                                    "id": "hcuemqw",
                                                    "parent_id": "t1_hcuapmk",
                                                    "score": 12,
                                                    "created_utc": 1631640528.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Anime filler yeah. Made him a cartoon villain to fill time.",
                                                    "author": "1RonnieMund",
                                                    "id": "hcvvuqz",
                                                    "parent_id": "t1_hcuapmk",
                                                    "score": 2,
                                                    "created_utc": 1631662636.0,
                                                    "replies": [
                                                        {
                                                            "body": "Cartoon villains have more depth than whatever the hell the fillers were doing with Danzo",
                                                            "author": "HateshWarkio",
                                                            "id": "hd1jvxs",
                                                            "parent_id": "t1_hcvvuqz",
                                                            "score": 2,
                                                            "created_utc": 1631767380.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "It was to destroy either of the groups in the proposed alliance from getting stronger. Hanzo was already feared by Konoha fighting all the Sannin now hes teaming up with a rising organization filled with young idealistic shinobi who he would definitely use for his own benefit. No one can afford that to happen.",
                                            "author": "1RonnieMund",
                                            "id": "hcvw5ei",
                                            "parent_id": "t1_hcu93ix",
                                            "score": 1,
                                            "created_utc": 1631662774.0,
                                            "replies": [
                                                {
                                                    "body": "Doesn't make sense to support the stronger one if you want them to destroy each other",
                                                    "author": "HateshWarkio",
                                                    "id": "hcw4h3y",
                                                    "parent_id": "t1_hcvw5ei",
                                                    "score": 1,
                                                    "created_utc": 1631666621.0,
                                                    "replies": [
                                                        {
                                                            "body": "He really wasn't supporting either of them only pretending to. The only real goal is to prevent the alliance.",
                                                            "author": "1RonnieMund",
                                                            "id": "hcxy9ti",
                                                            "parent_id": "t1_hcw4h3y",
                                                            "score": 1,
                                                            "created_utc": 1631709161.0,
                                                            "replies": [
                                                                {
                                                                    "body": "He lent a lot of ninjas to Hanzo, that's a big support, especially considering that the Rain is not that big village in a quite small country so they have a limited number of ninjas",
                                                                    "author": "HateshWarkio",
                                                                    "id": "hcxzf02",
                                                                    "parent_id": "t1_hcxy9ti",
                                                                    "score": 1,
                                                                    "created_utc": 1631709784.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Again the goal remains the same.",
                                                                            "author": "1RonnieMund",
                                                                            "id": "hd2op9g",
                                                                            "parent_id": "t1_hcxzf02",
                                                                            "score": 1,
                                                                            "created_utc": 1631797717.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Nagato is a tool for Zetsu and Madara's plan. They arent letting him off the hook.",
                                    "author": "1RonnieMund",
                                    "id": "hcvvnkt",
                                    "parent_id": "t1_hcu8f2d",
                                    "score": 2,
                                    "created_utc": 1631662542.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I think he was referring to Pain’s birth moment, not his eyes specifically",
                            "author": "LinuxMintRejection",
                            "id": "hcugcj9",
                            "parent_id": "t1_hcu5a0p",
                            "score": 2,
                            "created_utc": 1631641208.0,
                            "replies": [
                                {
                                    "body": "Again, Danzo didn't do shit for that\n\nCanonically he just lent Hanzo some ninjas and let him do whatever the hell he wanted\n\nIf you wanna blame someone for Pain then you can blame Hanzo",
                                    "author": "HateshWarkio",
                                    "id": "hcugzw0",
                                    "parent_id": "t1_hcugcj9",
                                    "score": 5,
                                    "created_utc": 1631641467.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lmao",
            "author": "Kakashi___Hatake___",
            "id": "hctojyo",
            "parent_id": "t3_pnzr0e",
            "score": 11,
            "created_utc": 1631629980.0,
            "replies": []
        },
        {
            "body": "Danzo would’ve been so strong with the rinnegan he can just spam all mighty push and get a aim bot with his wind style. He still has izanagi, he would have the ability to see the shadows with the jougan and help the village and lastly he has the ability to see behind him so he can avoid a wasted izanagi. Op as hell and he still would have Hashirama cells with the curse mark.",
            "author": "ShuBakuhatsuSatsujin",
            "id": "hcutj8e",
            "parent_id": "t3_pnzr0e",
            "score": 8,
            "created_utc": 1631646455.0,
            "replies": []
        },
        {
            "body": "The funniest part about danzo is he's convinced he's the true hero making the hard decisions everyone else can't \n\ndespite almost every decision he's ever made putting the leaf Village at Great risk and in several occasions active Danger",
            "author": "Dismal_Performer7556",
            "id": "hcu6cdn",
            "parent_id": "t3_pnzr0e",
            "score": 14,
            "created_utc": 1631637215.0,
            "replies": [
                {
                    "body": "We dont know that. We get a glimpse of SOME of the things Danzo has done over 50 years. Most of the other missions are not shown. What is shown is despite his worst moments the Hokage, the Elders, and members of Root carrying out the missions who are in the know say he was incredible for Konoha.",
                    "author": "1RonnieMund",
                    "id": "hcvwiay",
                    "parent_id": "t1_hcu6cdn",
                    "score": 1,
                    "created_utc": 1631662945.0,
                    "replies": [
                        {
                            "body": "That just tells me that the negatives he's done are truly Preposterous in proportion to the good he's done and any good he has done also doesn't change the fact but a lot of the bad he's done was out of his own selfishness\n\nI'm like most people I don't entirely blame him for the Uchiha genocide except for what happened with shisui Uchiha that was entirely self-serving and unnecessary\n\nBut I think ultimately destroying the Uchiha Clan as it was was unfortunately necessary but there was no doubt in my mind of the selfishness of his intentions display in the gratuitous amount of Sharingan he kept on him certainly doesn't speak of good intentions",
                            "author": "Dismal_Performer7556",
                            "id": "hcw155o",
                            "parent_id": "t1_hcvwiay",
                            "score": 0,
                            "created_utc": 1631665107.0,
                            "replies": [
                                {
                                    "body": "Even Itachi says Shishi's plan would have failed and he would ultimately side with his clan. Itachi was even trying to find ways to beat Shishi and said maybe it was better that they got to go out as friends. That's his own best friend and his own das who the mission depended on. \n\nSo Danzo should have let Madara have even more eyes...\n\nYou don't even know the good he did but you already write it off and the people who do knows opinions mean nothing. Thats headcanon. There's a reason he was respected and allowed to do what he did for 50 years 2nd in command of the village and helping the only Hokage to ever survive long enough to lead anything should have been a hint to you.",
                                    "author": "1RonnieMund",
                                    "id": "hcwh2wq",
                                    "parent_id": "t1_hcw155o",
                                    "score": 3,
                                    "created_utc": 1631672416.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "hahahaha I bet he is alive somehow",
            "author": "Better-Solution-7410",
            "id": "hctuae4",
            "parent_id": "t3_pnzr0e",
            "score": 5,
            "created_utc": 1631632358.0,
            "replies": []
        },
        {
            "body": "He’d probably even have an Orochimaru eye as well",
            "author": "xMarioTheSupahx",
            "id": "hctw5m1",
            "parent_id": "t3_pnzr0e",
            "score": 8,
            "created_utc": 1631633124.0,
            "replies": []
        },
        {
            "body": "they made dojutsu the super saiyan of naruto. You have sharingan, mangekyo, eternal mangekyo,rinnegan,rinnesharingan,.\n\nWay too fucking much, and boruto added even more💀💀💀💀",
            "author": "Masterelia",
            "id": "hcuva6l",
            "parent_id": "t3_pnzr0e",
            "score": 3,
            "created_utc": 1631647153.0,
            "replies": []
        },
        {
            "body": "Bro this image is a whole optical illusion. Look at the rinnegan, there is a thin white line spinning inside it, but it's a still image. I even screenshotted just to make sure and sure enough it's a still image but the brain makes it look like it's moving.",
            "author": "Any-Throat-2645",
            "id": "hcux0fe",
            "parent_id": "t3_pnzr0e",
            "score": 3,
            "created_utc": 1631647835.0,
            "replies": [
                {
                    "body": "who says you're not already trapped in my genjutsu?",
                    "author": "whitey-ofwgkta",
                    "id": "hcvdxee",
                    "parent_id": "t1_hcux0fe",
                    "score": 4,
                    "created_utc": 1631654607.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "if danzo were smart he would've nabbed some dna from tsunade and turn all his sharingan into rinnegan",
            "author": "Monoshi",
            "id": "hcvb58g",
            "parent_id": "t3_pnzr0e",
            "score": 3,
            "created_utc": 1631653446.0,
            "replies": [
                {
                    "body": "It has to be Madara and Hashirama because of the Indra/Asura connection.  and on top of that Hashirama alone was special, maybe because of his unique sage mode\n\nI do wonder what would happen if you scraped Naruto and Sasuke cells today\n\nedit: who downvoted me I'm right.  He already had Hashirama cells in his arm but since he didn't Madara (or Sasuke's) either cells or Sharingan it didn't turn them into Rinnegan, he just got the \"regular\" Hashirama boost",
                    "author": "whitey-ofwgkta",
                    "id": "hcvdqi4",
                    "parent_id": "t1_hcvb58g",
                    "score": 0,
                    "created_utc": 1631654526.0,
                    "replies": [
                        {
                            "body": "Similar things with narutos cell you get bigger chakra reserves some regeneration I think not sure if you could use a bit of the kyubi’s power",
                            "author": "stretchmarks55",
                            "id": "hd16pqk",
                            "parent_id": "t1_hcvdqi4",
                            "score": 1,
                            "created_utc": 1631760070.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I just Imagine this idiot spamming Rinne Rivival while still getting his ass whooped",
            "author": "FrozenSabre",
            "id": "hcw3tzw",
            "parent_id": "t3_pnzr0e",
            "score": 3,
            "created_utc": 1631666327.0,
            "replies": []
        },
        {
            "body": "Wouldn’t have made sense, as other doujutsu are useless and can’t revive him",
            "author": "Krish220307",
            "id": "hct7aov",
            "parent_id": "t3_pnzr0e",
            "score": 10,
            "created_utc": 1631621709.0,
            "replies": [
                {
                    "body": "Eh not exactly. Rinnegan would give him six paths and tenseigan would give him a chakra mode.\n\nBut the Byakugan and Jougan would be useless in the arm lol",
                    "author": "Starlight_Requiem_XD",
                    "id": "hctbiz4",
                    "parent_id": "t1_hct7aov",
                    "score": 30,
                    "created_utc": 1631624019.0,
                    "replies": [
                        {
                            "body": "Danzo would die if he tried to use Rinnegan abilities. Obito had trouble handling one and he was a full-blooded Uchiha who was basically half Hashirama tissue.",
                            "author": "sonfoa",
                            "id": "hctzmt4",
                            "parent_id": "t1_hctbiz4",
                            "score": 18,
                            "created_utc": 1631634532.0,
                            "replies": [
                                {
                                    "body": "his arm is from shin, whos body can accept transplants without issue",
                                    "author": "Doctor99268",
                                    "id": "hcuniif",
                                    "parent_id": "t1_hctzmt4",
                                    "score": 3,
                                    "created_utc": 1631644098.0,
                                    "replies": [
                                        {
                                            "body": "I don't think the transplant is the issue, it has something to do with chakra levels",
                                            "author": "whitey-ofwgkta",
                                            "id": "hcvden1",
                                            "parent_id": "t1_hcuniif",
                                            "score": 5,
                                            "created_utc": 1631654389.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah",
                                                    "author": "Starlight_Requiem_XD",
                                                    "id": "hcvmftk",
                                                    "parent_id": "t1_hcvden1",
                                                    "score": 1,
                                                    "created_utc": 1631658301.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I mean u ain’t wrong tho",
                            "author": "Krish220307",
                            "id": "hctbmn8",
                            "parent_id": "t1_hctbiz4",
                            "score": 1,
                            "created_utc": 1631624072.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just make him watch YouTube, he'd go blind in no time. Or just kill himself",
            "author": null,
            "id": "hcv1gh2",
            "parent_id": "t3_pnzr0e",
            "score": 2,
            "created_utc": 1631649584.0,
            "replies": []
        },
        {
            "body": "Why would he change? Things aint all that bright lol",
            "author": "1RonnieMund",
            "id": "hcvux1y",
            "parent_id": "t3_pnzr0e",
            "score": 2,
            "created_utc": 1631662206.0,
            "replies": []
        },
        {
            "body": "Is it bad that I am wishing that Danzo won is encounter with Sasuke with a sacrifice move and that also got Tobi?",
            "author": "red_000",
            "id": "hcvw1q0",
            "parent_id": "t3_pnzr0e",
            "score": 2,
            "created_utc": 1631662726.0,
            "replies": []
        },
        {
            "body": "Man if Danzo found out about kawaki and Boruto and how they had alien dna inside of them that was a threat to the village he would of sneaked in Naruto house and killed them",
            "author": null,
            "id": "hcw0tos",
            "parent_id": "t3_pnzr0e",
            "score": 2,
            "created_utc": 1631664960.0,
            "replies": []
        },
        {
            "body": "\"Next we'll get Isshiki's eyes because daddy needs new testicles\"",
            "author": "Chemp_Chemp",
            "id": "hcxbnl3",
            "parent_id": "t3_pnzr0e",
            "score": 2,
            "created_utc": 1631691645.0,
            "replies": [
                {
                    "body": "I can't imagine how Danzo would react to Urashiki have 2 sets of Rinnegan and a Byakugan..",
                    "author": "Wiggity_Gur",
                    "id": "j791irr",
                    "parent_id": "t1_hcxbnl3",
                    "score": 1,
                    "created_utc": 1675556911.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Mmmmm rinnegan go brrrrrr",
            "author": "Ilikepeepee69",
            "id": "hcye4ib",
            "parent_id": "t3_pnzr0e",
            "score": 2,
            "created_utc": 1631716706.0,
            "replies": []
        },
        {
            "body": "This dude is like a ballhog for sharingans",
            "author": "bomberman0210",
            "id": "hcu2raj",
            "parent_id": "t3_pnzr0e",
            "score": 2,
            "created_utc": 1631635783.0,
            "replies": []
        },
        {
            "body": "Bold of you to assume he could kill any Rinnegan user",
            "author": "YukihyoUchiha",
            "id": "hcux7o4",
            "parent_id": "t3_pnzr0e",
            "score": 1,
            "created_utc": 1631647916.0,
            "replies": []
        },
        {
            "body": "Karma 🤢",
            "author": null,
            "id": "hcv70mq",
            "parent_id": "t3_pnzr0e",
            "score": 1,
            "created_utc": 1631651784.0,
            "replies": []
        },
        {
            "body": "Danzo did nothing wrong.",
            "author": "zombieguy224",
            "id": "hcw141s",
            "parent_id": "t3_pnzr0e",
            "score": 1,
            "created_utc": 1631665093.0,
            "replies": []
        },
        {
            "body": "Gotta catch ‘em all, clan bloodlines!",
            "author": null,
            "id": "hcw7on4",
            "parent_id": "t3_pnzr0e",
            "score": 1,
            "created_utc": 1631668089.0,
            "replies": []
        },
        {
            "body": "Danzo is probably the one character that couldn't be redeemed by talk no jutsu. 🙄",
            "author": "Tie_Little",
            "id": "hcwbgpr",
            "parent_id": "t3_pnzr0e",
            "score": 1,
            "created_utc": 1631669826.0,
            "replies": []
        },
        {
            "body": "Still probably the most disgusting thing in the series",
            "author": "Kgb725",
            "id": "hcwbhr2",
            "parent_id": "t3_pnzr0e",
            "score": 1,
            "created_utc": 1631669839.0,
            "replies": []
        },
        {
            "body": "He was evil but a necessary evil",
            "author": "dougie96",
            "id": "hcwef5q",
            "parent_id": "t3_pnzr0e",
            "score": 1,
            "created_utc": 1631671175.0,
            "replies": []
        },
        {
            "body": "Grandfather of Thanos",
            "author": "Rasanu",
            "id": "hcwkyqa",
            "parent_id": "t3_pnzr0e",
            "score": 1,
            "created_utc": 1631674305.0,
            "replies": []
        },
        {
            "body": "Gotta collect ‘em all",
            "author": null,
            "id": "hcwlle5",
            "parent_id": "t3_pnzr0e",
            "score": 1,
            "created_utc": 1631674622.0,
            "replies": []
        },
        {
            "body": "Lol, he wouldn’t have. Konoha would have immediately imprisoned him and charged him for high treason and collaborating with other rogue nin and criminals. Man would have been executed or imprisoned for life",
            "author": "TegamiBachi25",
            "id": "hcwsckx",
            "parent_id": "t3_pnzr0e",
            "score": 1,
            "created_utc": 1631678147.0,
            "replies": [
                {
                    "body": "Then why didn't any of that happen in shippuden?",
                    "author": "Elad2007",
                    "id": "hcxa5ug",
                    "parent_id": "t1_hcwsckx",
                    "score": 1,
                    "created_utc": 1631690337.0,
                    "replies": [
                        {
                            "body": "Because nobody found out about his crimes. Konoha showed their ignorance and let danzo get away with many things. He was a necessary evil of sorts. Except that now since naruto is hokage, he wouldn't put up with danzo's bullshit and have him executed or imprisoned for his crimes against the uchiha clan.",
                            "author": "TegamiBachi25",
                            "id": "hczp6f0",
                            "parent_id": "t1_hcxa5ug",
                            "score": 2,
                            "created_utc": 1631735954.0,
                            "replies": [
                                {
                                    "body": "K",
                                    "author": "Elad2007",
                                    "id": "hczqlwp",
                                    "parent_id": "t1_hczp6f0",
                                    "score": 1,
                                    "created_utc": 1631736521.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Although characters like Pain or Might Guy can still beat him in this form",
            "author": "Mundane_Rule_7162",
            "id": "hcwuqb1",
            "parent_id": "t3_pnzr0e",
            "score": 1,
            "created_utc": 1631679501.0,
            "replies": [
                {
                    "body": "Or any rinnegan users in naruto",
                    "author": "stretchmarks55",
                    "id": "hd16dmg",
                    "parent_id": "t1_hcwuqb1",
                    "score": 1,
                    "created_utc": 1631759905.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He needs sage mode eyes then he has bingo",
            "author": "Seeking-demons",
            "id": "hcynswd",
            "parent_id": "t3_pnzr0e",
            "score": 1,
            "created_utc": 1631720752.0,
            "replies": []
        },
        {
            "body": "The sad part is I think Danzo is deluded enough to actually believe that his actions are necessary and selfless.",
            "author": "sonfoa",
            "id": "hctzvgz",
            "parent_id": "t1_hct4vm3",
            "score": 207,
            "created_utc": 1631634628.0,
            "replies": [
                {
                    "body": "More \"aggravating\" than \"sad\" for me. I think I could love to hate a villain who's wholly selfish and masks his actions with a thin veneer of patriotism, but the extent of Danzo's self-delusion is just baffling.",
                    "author": "secretMollusk",
                    "id": "hcuktvl",
                    "parent_id": "t1_hctzvgz",
                    "score": 80,
                    "created_utc": 1631643028.0,
                    "replies": [
                        {
                            "body": "He is the most realistic villain - an irredeemable selfish hypocritical asshole who just want to ruin everyone's day while screaming he is doing it for the good of people.",
                            "author": "sephelutis",
                            "id": "hcvclh5",
                            "parent_id": "t1_hcuktvl",
                            "score": 53,
                            "created_utc": 1631654054.0,
                            "replies": [
                                {
                                    "body": "Actually in danzos mind, and the feudal lord and councils, he was doing the right thing for the time. Uchiha massacre was valid since he did make a good point and they'd most likely try it again. Still should've tried shisuis plan though but shisui needed to die before the show to limit plot holes. Convincing hanzo(?) That the akasuki were villains wasn't exactly wrong either. By doing so, he had the chance to get rid of the biggest threats to his village. Danzo is a messed up fuck, but his actions, most atleast, weren't wrong for the time. He had selfish intent, but then again, so does Naruto and literally every other character in the show and people In real life. Danzo could've been the best villain in the show besides maybe madara, if he had his own saga.",
                                    "author": "xNuxIsGod",
                                    "id": "hcw01p6",
                                    "parent_id": "t1_hcvclh5",
                                    "score": 17,
                                    "created_utc": 1631664608.0,
                                    "replies": []
                                },
                                {
                                    "body": "This sub: man danzo was an asshole, he eradicated an entire clan and used their own people to do it!\n\nAlso this sub: the Uchiha were evil and we're going to destroy the village if they took over!",
                                    "author": "nizzy2k11",
                                    "id": "hcwc48g",
                                    "parent_id": "t1_hcvclh5",
                                    "score": 5,
                                    "created_utc": 1631670127.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I agree. Danzos last act was to try to destroy Sasuke, who wanted to destroy the leaf village. He was a piece of shit, evil, dictatorial motherclucker, but I think he did care about the Leaf.\n\nJust not anyone but him running it.",
                    "author": "PMMeMeiRule34",
                    "id": "hcv072y",
                    "parent_id": "t1_hctzvgz",
                    "score": 36,
                    "created_utc": 1631649089.0,
                    "replies": [
                        {
                            "body": "Headcannon fans would say otherwise but its established by even Danzo's worst enemies in the series he did everything for the Leaf. There is not one character that has said otherwise.",
                            "author": "1RonnieMund",
                            "id": "hcvv49i",
                            "parent_id": "t1_hcv072y",
                            "score": 8,
                            "created_utc": 1631662298.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "The executed countless secret missions for the benefit of the village. Especially after the fourth died there was hardly anyone else to keep the other villages from attacking and leave room for relative peace.",
                    "author": "ac714",
                    "id": "hcuz0hj",
                    "parent_id": "t1_hctzvgz",
                    "score": 6,
                    "created_utc": 1631648625.0,
                    "replies": [
                        {
                            "body": "Especially during and after the 1st shinobi war too. Both of Konoha's greatest weapons were dead and the village was still relatively new. There could have been all kinds of betrayal from the clans.",
                            "author": "1RonnieMund",
                            "id": "hcvv95s",
                            "parent_id": "t1_hcuz0hj",
                            "score": 3,
                            "created_utc": 1631662361.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm sure Danzo would have taken out Otsutski to protect the village if Sasuke hadn't killed him... /s",
            "author": null,
            "id": "hct5gvt",
            "parent_id": "t1_hct4vm3",
            "score": 124,
            "created_utc": 1631620601.0,
            "replies": [
                {
                    "body": "Danzo would bravely hide underground when Momoshiki showed up.",
                    "author": "sonfoa",
                    "id": "hctzaq3",
                    "parent_id": "t1_hct5gvt",
                    "score": 97,
                    "created_utc": 1631634397.0,
                    "replies": [
                        {
                            "body": "Big facts. “We’ll rebuild and then I’ll become hokage” - danzo",
                            "author": "idontwanttobeonthis",
                            "id": "hctzrfj",
                            "parent_id": "t1_hctzaq3",
                            "score": 86,
                            "created_utc": 1631634583.0,
                            "replies": []
                        },
                        {
                            "body": "Liked your usage of 'bravely' here lmao",
                            "author": "AERegeneratel38",
                            "id": "hcwaq3v",
                            "parent_id": "t1_hctzaq3",
                            "score": 2,
                            "created_utc": 1631669490.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Didnt he steal shishui's eye?He could have applied his genjustsu on sasuke and tobi to make them think he died,i dont know",
            "author": "tuberemulator",
            "id": "hctcgyt",
            "parent_id": "t1_hct7np3",
            "score": 58,
            "created_utc": 1631624503.0,
            "replies": [
                {
                    "body": "The genjutsu of Shisui was so powerful so it had a cooldown before it can be used again . Since Danzo used it in the five kage summit he didnt had the option of using it at that time and any other genjutsu would have been way too weak for Sasuke and Danzo",
                    "author": "Tarkik_Vatsa",
                    "id": "hctswzo",
                    "parent_id": "t1_hctcgyt",
                    "score": 48,
                    "created_utc": 1631631793.0,
                    "replies": [
                        {
                            "body": "Thats not entirely true. Danzo could have used Shisui's eye but couldn't because he needed it for Madara. He says this during the fight that the eye is ready but he needs it for Madara and that Sasuke is already a lost cause.",
                            "author": "1RonnieMund",
                            "id": "hcvvgd8",
                            "parent_id": "t1_hctswzo",
                            "score": 7,
                            "created_utc": 1631662452.0,
                            "replies": [
                                {
                                    "body": "So why didnt he do it on madara?",
                                    "author": "steplaser",
                                    "id": "hcvyu2d",
                                    "parent_id": "t1_hcvvgd8",
                                    "score": 1,
                                    "created_utc": 1631664049.0,
                                    "replies": [
                                        {
                                            "body": "I'm not making it up Danzo literally says this during the fight. I'll break it down. \n\nDanzo was saving up the entire fight for Madara. He says it to himself and even Karin acknowledges the only time Danzo actually exerts himself and uses his chakra is for the Wood jutsu because he couldn't avoid Susano's arrow any other way. He says it to himself as well that he's forced to use chakra and it's a setback. He was relying on the Izanagi to tire Sasuke out and he did succeed but Sasuke casting the genjutsu for the final Izanagi set him back a ways. He was severely weakened and with no Izanagi. Still he was strong enough to avoid a chidori from Sasuke and capture Karin which he would settle on Sasuke being weak hearted and take Karin hostage thinking after Sasuke gives up to spare Karin, Madara would step in and then use the eye. Instead Sasuke chooses to attack her and Danzo and at that point he was probably too weakened to use Shisui's eye and chose instead to get rid of them both with his final sealing jutsu.\n\nI just finished rewatching the fight. It's a lot better than people give credit. Definitely worth a rewatch imo. The only thing I didn't like was Sasuke screaming away Danzo's paralysis jutsu and Danzo taking the time to taunt him instead of just killing him right away . Cliche villain writing lol.",
                                            "author": "1RonnieMund",
                                            "id": "hcwetfu",
                                            "parent_id": "t1_hcvyu2d",
                                            "score": 7,
                                            "created_utc": 1631671355.0,
                                            "replies": [
                                                {
                                                    "body": "Nice review. What bothers me is that danzo could have killed sasuke with that curse marrk but sasuke noped out of it another kishi bs writing.",
                                                    "author": "steplaser",
                                                    "id": "hcwnbh7",
                                                    "parent_id": "t1_hcwetfu",
                                                    "score": 2,
                                                    "created_utc": 1631675499.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah not many people in the world can break an MS user's genjutsu let alone counter it ftw but as you say he just screams it off and Danzo does his little soliloquy instead of just finishing it sooner lol very cliché writing. Still I'll acknowledge Danzo's ability to just brush that off and even taunt him. He's not a real Uchiha and really not even a genius. Has futon...that's actually it. He has no special abilities other than the ones he had to steal and just through sheer planning was able to even put up a fight with an actual reincarnation of a god Uchiha. He planned so long how to fight even the strongest of the Uchiha it's almost like he was prepping for Madara all along.",
                                                            "author": "1RonnieMund",
                                                            "id": "hcxx1dp",
                                                            "parent_id": "t1_hcwnbh7",
                                                            "score": 1,
                                                            "created_utc": 1631708463.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "But how effective would a sharingan genjutsu be against a dual eternal mangekyo sharingan Uchiha ?",
                            "author": "EliYafah",
                            "id": "hcutkx9",
                            "parent_id": "t1_hctswzo",
                            "score": 3,
                            "created_utc": 1631646473.0,
                            "replies": [
                                {
                                    "body": "Shisui had a Mangekyo too . Plus , Konomanatsuki (i think I spelled it completely wrong) was stated to be the strongest genjutsu ever even stronger than Tsukuyomi .",
                                    "author": "Tarkik_Vatsa",
                                    "id": "hcuuic2",
                                    "parent_id": "t1_hcutkx9",
                                    "score": 12,
                                    "created_utc": 1631646844.0,
                                    "replies": [
                                        {
                                            "body": "kotoamatsukami :)",
                                            "author": "August_28th",
                                            "id": "hcv320c",
                                            "parent_id": "t1_hcuuic2",
                                            "score": 6,
                                            "created_utc": 1631650219.0,
                                            "replies": [
                                                {
                                                    "body": "Ahh I got it wrong then 😅 . Thanks for correcting",
                                                    "author": "Tarkik_Vatsa",
                                                    "id": "hcwmiwo",
                                                    "parent_id": "t1_hcv320c",
                                                    "score": 2,
                                                    "created_utc": 1631675092.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "He's mangekyo is in video games only afaik and non Uchiha kakashi, with a single implemented normal sharingan was able to resist the tsukoyomi for a few seconds. So the likes of Sasuke who are pure Uchiha and have 2 eternal mangekyo are a totally different beast.",
                                            "author": "EliYafah",
                                            "id": "hcuxcdt",
                                            "parent_id": "t1_hcuuic2",
                                            "score": 1,
                                            "created_utc": 1631647968.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Shisui was basically Aizen so it could only be used very sparingly. So good to mind control people for you with no drawbacks.",
                                            "author": "ac714",
                                            "id": "hcuzj1l",
                                            "parent_id": "t1_hcuuic2",
                                            "score": 1,
                                            "created_utc": 1631648828.0,
                                            "replies": [
                                                {
                                                    "body": "Actually, his only drawback was that it used a lot of chakra and that it would blind him eventually. The time drawback was only for non uchiha users",
                                                    "author": "julio2399",
                                                    "id": "hcvxlv5",
                                                    "parent_id": "t1_hcuzj1l",
                                                    "score": 1,
                                                    "created_utc": 1631663464.0,
                                                    "replies": [
                                                        {
                                                            "body": "Wut? You’re not understanding the situation at all.\n\nThe guy can mind control…anyone. This includes other uchihas to use izanagi for his benefit, collect or create sharingans, and just straight up create an EMS solving the blindness issue.\n\nWe already know what a person can do with a kage in their pocket like Obito and Yagura so imagine having all the kages under your thumb. Hardly a stretch to accomplish given what we’ve been told.",
                                                            "author": "ac714",
                                                            "id": "hcvym8i",
                                                            "parent_id": "t1_hcvxlv5",
                                                            "score": 0,
                                                            "created_utc": 1631663947.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "He was so dumb why didnt he save it for sasuke??",
                            "author": "steplaser",
                            "id": "hcvynxa",
                            "parent_id": "t1_hctswzo",
                            "score": 1,
                            "created_utc": 1631663970.0,
                            "replies": [
                                {
                                    "body": "Q)why didnt he save it for sasuke??\n\nA)He was so dumb \n\nYou yourself answered your question",
                                    "author": "Tarkik_Vatsa",
                                    "id": "hcwmzz8",
                                    "parent_id": "t1_hcvynxa",
                                    "score": 1,
                                    "created_utc": 1631675335.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah, that could've also been done. Danzo just felt too disappointing, he was built up for so long but didn't amount to much",
                    "author": "Tsynami",
                    "id": "hctgpxn",
                    "parent_id": "t1_hctcgyt",
                    "score": 18,
                    "created_utc": 1631626549.0,
                    "replies": [
                        {
                            "body": "Yeah honestly I think he shouldn't have died but that's my opinion maybe instead of the shin leader imagine if it was danzo",
                            "author": "Gizshot",
                            "id": "hcu91pw",
                            "parent_id": "t1_hctgpxn",
                            "score": 6,
                            "created_utc": 1631638296.0,
                            "replies": [
                                {
                                    "body": "This would've made the whole thing way better tbh. Shin was already pretty bland, replacing him with Danzo who has the same gimmick as him (a ton of sharingan over his body) would've been pretty cool",
                                    "author": "Tsynami",
                                    "id": "hcujlbd",
                                    "parent_id": "t1_hcu91pw",
                                    "score": 5,
                                    "created_utc": 1631642520.0,
                                    "replies": [
                                        {
                                            "body": "Yeah would create a new evil arc and with shikimaru being like the dark side of the kage position that he is. he is quietly sending messages for intel with danzo. But I understand this is supposed to be muh next generation and danzo doesn't fit that but whatever.",
                                            "author": "Gizshot",
                                            "id": "hcuonbj",
                                            "parent_id": "t1_hcujlbd",
                                            "score": 4,
                                            "created_utc": 1631644556.0,
                                            "replies": [
                                                {
                                                    "body": "I mean, it could've turned out that he was actually an outer for Kara and that's how he was getting resources. Plus we know that people like Sumire's dad were still loyal to Danzo even after his death, so it's not a stretch to say that he'd have some spies in Konoha",
                                                    "author": "Tsynami",
                                                    "id": "hcupw7m",
                                                    "parent_id": "t1_hcuonbj",
                                                    "score": 2,
                                                    "created_utc": 1631645030.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I liked his behind the scenes impact as a morally gray villain, stretching back to the Uchiha Massacre and even influencing the creation of Alatsuki. We didn’t see him fight much but I think he got just the right amount of screen time.",
                            "author": "theuncommonman",
                            "id": "hcvvng6",
                            "parent_id": "t1_hctgpxn",
                            "score": 2,
                            "created_utc": 1631662540.0,
                            "replies": []
                        },
                        {
                            "body": "Built up for so long? When did that happen? He was brought in midway and rushed right the fuck out.",
                            "author": "1RonnieMund",
                            "id": "hcvvhid",
                            "parent_id": "t1_hctgpxn",
                            "score": 1,
                            "created_utc": 1631662466.0,
                            "replies": [
                                {
                                    "body": "They started building him up when Sai was introduced",
                                    "author": "Tsynami",
                                    "id": "hcx68ih",
                                    "parent_id": "t1_hcvvhid",
                                    "score": 1,
                                    "created_utc": 1631687158.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "what if he just used substitution jutsu? /s",
                    "author": "Jugbot",
                    "id": "hcuhjmc",
                    "parent_id": "t1_hctcgyt",
                    "score": 4,
                    "created_utc": 1631641685.0,
                    "replies": []
                },
                {
                    "body": "he was trying to use kotoamatsukami, but sasuke didnt give him any options to use it,",
                    "author": "Doctor99268",
                    "id": "hcun3np",
                    "parent_id": "t1_hctcgyt",
                    "score": 0,
                    "created_utc": 1631643935.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wanna be the very best, that no one ever was. To steal them is my real test to implant them is my cause.\n\nI will travel across the land searching for far and wide \n\nSteal dojustu and understand the power that's inside \n\n(Dojustu gotta steal them all) it's me and me\n\nBeing hokage is my destiny \n\n(Dojustu) oh your my best plan/ in a village I must command",
            "author": null,
            "id": "hcub0uz",
            "parent_id": "t1_hct52jt",
            "score": 27,
            "created_utc": 1631639088.0,
            "replies": []
        },
        {
            "body": "It's like the infinity stones.",
            "author": "nizzy2k11",
            "id": "hcwc9s2",
            "parent_id": "t1_hct52jt",
            "score": 3,
            "created_utc": 1631670197.0,
            "replies": []
        },
        {
            "body": "You really cannot blame Danzo for Nagato, the whole thing with Nagato would happen regardless of Danzo's input since Nagato was Madara's chosen one",
            "author": "HateshWarkio",
            "id": "hcu5a0p",
            "parent_id": "t1_hctsivu",
            "score": 19,
            "created_utc": 1631636790.0,
            "replies": [
                {
                    "body": ">You really cannot blame Danzo for Nagato\n\nWhy not ? He was responsible for the killing of Yahiko . Yes Nagato was Madara's chosen one and he would have been his tool anyways but still that doesnt make Danzo's actions any better",
                    "author": "Tarkik_Vatsa",
                    "id": "hcu8f2d",
                    "parent_id": "t1_hcu5a0p",
                    "score": 14,
                    "created_utc": 1631638047.0,
                    "replies": [
                        {
                            "body": "Except that that part is mostly filler\n\nThe only canon thing is that Hanzo teamed up with Danzo, that's it\n\nSo yes, you cannot blame Danzo for Nagato because canonically he just helped someone else (Hanzo) with their plan and that was probably just to ensure a better relationship between the Rain and the Leaf",
                            "author": "HateshWarkio",
                            "id": "hcu93ix",
                            "parent_id": "t1_hcu8f2d",
                            "score": 7,
                            "created_utc": 1631638317.0,
                            "replies": [
                                {
                                    "body": "Damn . I forgot what part was filler and what was not . The fillers were trying too hard to show Danzo as evil . I think you are right then . I thought that Danzo manipulating Hanzo was canon .",
                                    "author": "Tarkik_Vatsa",
                                    "id": "hcuapmk",
                                    "parent_id": "t1_hcu93ix",
                                    "score": 7,
                                    "created_utc": 1631638962.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, 99% of the shit that gets blamed on Danzo is from fillers, they were really making him into this evilest guy around\n\nWhen in reality, he was just ruthless and calculating\n\nHe might even have Sasuke-like background since we know that Danzo comes from the Shimura clan but the only thing we know about the Shimura clan is that Danzo's father and grandfather got killed on a battlefield so he might be the last member of his clan",
                                            "author": "HateshWarkio",
                                            "id": "hcuemqw",
                                            "parent_id": "t1_hcuapmk",
                                            "score": 12,
                                            "created_utc": 1631640528.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Anime filler yeah. Made him a cartoon villain to fill time.",
                                            "author": "1RonnieMund",
                                            "id": "hcvvuqz",
                                            "parent_id": "t1_hcuapmk",
                                            "score": 2,
                                            "created_utc": 1631662636.0,
                                            "replies": [
                                                {
                                                    "body": "Cartoon villains have more depth than whatever the hell the fillers were doing with Danzo",
                                                    "author": "HateshWarkio",
                                                    "id": "hd1jvxs",
                                                    "parent_id": "t1_hcvvuqz",
                                                    "score": 2,
                                                    "created_utc": 1631767380.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "It was to destroy either of the groups in the proposed alliance from getting stronger. Hanzo was already feared by Konoha fighting all the Sannin now hes teaming up with a rising organization filled with young idealistic shinobi who he would definitely use for his own benefit. No one can afford that to happen.",
                                    "author": "1RonnieMund",
                                    "id": "hcvw5ei",
                                    "parent_id": "t1_hcu93ix",
                                    "score": 1,
                                    "created_utc": 1631662774.0,
                                    "replies": [
                                        {
                                            "body": "Doesn't make sense to support the stronger one if you want them to destroy each other",
                                            "author": "HateshWarkio",
                                            "id": "hcw4h3y",
                                            "parent_id": "t1_hcvw5ei",
                                            "score": 1,
                                            "created_utc": 1631666621.0,
                                            "replies": [
                                                {
                                                    "body": "He really wasn't supporting either of them only pretending to. The only real goal is to prevent the alliance.",
                                                    "author": "1RonnieMund",
                                                    "id": "hcxy9ti",
                                                    "parent_id": "t1_hcw4h3y",
                                                    "score": 1,
                                                    "created_utc": 1631709161.0,
                                                    "replies": [
                                                        {
                                                            "body": "He lent a lot of ninjas to Hanzo, that's a big support, especially considering that the Rain is not that big village in a quite small country so they have a limited number of ninjas",
                                                            "author": "HateshWarkio",
                                                            "id": "hcxzf02",
                                                            "parent_id": "t1_hcxy9ti",
                                                            "score": 1,
                                                            "created_utc": 1631709784.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Again the goal remains the same.",
                                                                    "author": "1RonnieMund",
                                                                    "id": "hd2op9g",
                                                                    "parent_id": "t1_hcxzf02",
                                                                    "score": 1,
                                                                    "created_utc": 1631797717.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Nagato is a tool for Zetsu and Madara's plan. They arent letting him off the hook.",
                            "author": "1RonnieMund",
                            "id": "hcvvnkt",
                            "parent_id": "t1_hcu8f2d",
                            "score": 2,
                            "created_utc": 1631662542.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think he was referring to Pain’s birth moment, not his eyes specifically",
                    "author": "LinuxMintRejection",
                    "id": "hcugcj9",
                    "parent_id": "t1_hcu5a0p",
                    "score": 2,
                    "created_utc": 1631641208.0,
                    "replies": [
                        {
                            "body": "Again, Danzo didn't do shit for that\n\nCanonically he just lent Hanzo some ninjas and let him do whatever the hell he wanted\n\nIf you wanna blame someone for Pain then you can blame Hanzo",
                            "author": "HateshWarkio",
                            "id": "hcugzw0",
                            "parent_id": "t1_hcugcj9",
                            "score": 5,
                            "created_utc": 1631641467.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "We dont know that. We get a glimpse of SOME of the things Danzo has done over 50 years. Most of the other missions are not shown. What is shown is despite his worst moments the Hokage, the Elders, and members of Root carrying out the missions who are in the know say he was incredible for Konoha.",
            "author": "1RonnieMund",
            "id": "hcvwiay",
            "parent_id": "t1_hcu6cdn",
            "score": 1,
            "created_utc": 1631662945.0,
            "replies": [
                {
                    "body": "That just tells me that the negatives he's done are truly Preposterous in proportion to the good he's done and any good he has done also doesn't change the fact but a lot of the bad he's done was out of his own selfishness\n\nI'm like most people I don't entirely blame him for the Uchiha genocide except for what happened with shisui Uchiha that was entirely self-serving and unnecessary\n\nBut I think ultimately destroying the Uchiha Clan as it was was unfortunately necessary but there was no doubt in my mind of the selfishness of his intentions display in the gratuitous amount of Sharingan he kept on him certainly doesn't speak of good intentions",
                    "author": "Dismal_Performer7556",
                    "id": "hcw155o",
                    "parent_id": "t1_hcvwiay",
                    "score": 0,
                    "created_utc": 1631665107.0,
                    "replies": [
                        {
                            "body": "Even Itachi says Shishi's plan would have failed and he would ultimately side with his clan. Itachi was even trying to find ways to beat Shishi and said maybe it was better that they got to go out as friends. That's his own best friend and his own das who the mission depended on. \n\nSo Danzo should have let Madara have even more eyes...\n\nYou don't even know the good he did but you already write it off and the people who do knows opinions mean nothing. Thats headcanon. There's a reason he was respected and allowed to do what he did for 50 years 2nd in command of the village and helping the only Hokage to ever survive long enough to lead anything should have been a hint to you.",
                            "author": "1RonnieMund",
                            "id": "hcwh2wq",
                            "parent_id": "t1_hcw155o",
                            "score": 3,
                            "created_utc": 1631672416.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "who says you're not already trapped in my genjutsu?",
            "author": "whitey-ofwgkta",
            "id": "hcvdxee",
            "parent_id": "t1_hcux0fe",
            "score": 4,
            "created_utc": 1631654607.0,
            "replies": []
        },
        {
            "body": "It has to be Madara and Hashirama because of the Indra/Asura connection.  and on top of that Hashirama alone was special, maybe because of his unique sage mode\n\nI do wonder what would happen if you scraped Naruto and Sasuke cells today\n\nedit: who downvoted me I'm right.  He already had Hashirama cells in his arm but since he didn't Madara (or Sasuke's) either cells or Sharingan it didn't turn them into Rinnegan, he just got the \"regular\" Hashirama boost",
            "author": "whitey-ofwgkta",
            "id": "hcvdqi4",
            "parent_id": "t1_hcvb58g",
            "score": 0,
            "created_utc": 1631654526.0,
            "replies": [
                {
                    "body": "Similar things with narutos cell you get bigger chakra reserves some regeneration I think not sure if you could use a bit of the kyubi’s power",
                    "author": "stretchmarks55",
                    "id": "hd16pqk",
                    "parent_id": "t1_hcvdqi4",
                    "score": 1,
                    "created_utc": 1631760070.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Eh not exactly. Rinnegan would give him six paths and tenseigan would give him a chakra mode.\n\nBut the Byakugan and Jougan would be useless in the arm lol",
            "author": "Starlight_Requiem_XD",
            "id": "hctbiz4",
            "parent_id": "t1_hct7aov",
            "score": 30,
            "created_utc": 1631624019.0,
            "replies": [
                {
                    "body": "Danzo would die if he tried to use Rinnegan abilities. Obito had trouble handling one and he was a full-blooded Uchiha who was basically half Hashirama tissue.",
                    "author": "sonfoa",
                    "id": "hctzmt4",
                    "parent_id": "t1_hctbiz4",
                    "score": 18,
                    "created_utc": 1631634532.0,
                    "replies": [
                        {
                            "body": "his arm is from shin, whos body can accept transplants without issue",
                            "author": "Doctor99268",
                            "id": "hcuniif",
                            "parent_id": "t1_hctzmt4",
                            "score": 3,
                            "created_utc": 1631644098.0,
                            "replies": [
                                {
                                    "body": "I don't think the transplant is the issue, it has something to do with chakra levels",
                                    "author": "whitey-ofwgkta",
                                    "id": "hcvden1",
                                    "parent_id": "t1_hcuniif",
                                    "score": 5,
                                    "created_utc": 1631654389.0,
                                    "replies": [
                                        {
                                            "body": "Yeah",
                                            "author": "Starlight_Requiem_XD",
                                            "id": "hcvmftk",
                                            "parent_id": "t1_hcvden1",
                                            "score": 1,
                                            "created_utc": 1631658301.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I mean u ain’t wrong tho",
                    "author": "Krish220307",
                    "id": "hctbmn8",
                    "parent_id": "t1_hctbiz4",
                    "score": 1,
                    "created_utc": 1631624072.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can't imagine how Danzo would react to Urashiki have 2 sets of Rinnegan and a Byakugan..",
            "author": "Wiggity_Gur",
            "id": "j791irr",
            "parent_id": "t1_hcxbnl3",
            "score": 1,
            "created_utc": 1675556911.0,
            "replies": []
        },
        {
            "body": "Then why didn't any of that happen in shippuden?",
            "author": "Elad2007",
            "id": "hcxa5ug",
            "parent_id": "t1_hcwsckx",
            "score": 1,
            "created_utc": 1631690337.0,
            "replies": [
                {
                    "body": "Because nobody found out about his crimes. Konoha showed their ignorance and let danzo get away with many things. He was a necessary evil of sorts. Except that now since naruto is hokage, he wouldn't put up with danzo's bullshit and have him executed or imprisoned for his crimes against the uchiha clan.",
                    "author": "TegamiBachi25",
                    "id": "hczp6f0",
                    "parent_id": "t1_hcxa5ug",
                    "score": 2,
                    "created_utc": 1631735954.0,
                    "replies": [
                        {
                            "body": "K",
                            "author": "Elad2007",
                            "id": "hczqlwp",
                            "parent_id": "t1_hczp6f0",
                            "score": 1,
                            "created_utc": 1631736521.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Or any rinnegan users in naruto",
            "author": "stretchmarks55",
            "id": "hd16dmg",
            "parent_id": "t1_hcwuqb1",
            "score": 1,
            "created_utc": 1631759905.0,
            "replies": []
        },
        {
            "body": "More \"aggravating\" than \"sad\" for me. I think I could love to hate a villain who's wholly selfish and masks his actions with a thin veneer of patriotism, but the extent of Danzo's self-delusion is just baffling.",
            "author": "secretMollusk",
            "id": "hcuktvl",
            "parent_id": "t1_hctzvgz",
            "score": 80,
            "created_utc": 1631643028.0,
            "replies": [
                {
                    "body": "He is the most realistic villain - an irredeemable selfish hypocritical asshole who just want to ruin everyone's day while screaming he is doing it for the good of people.",
                    "author": "sephelutis",
                    "id": "hcvclh5",
                    "parent_id": "t1_hcuktvl",
                    "score": 53,
                    "created_utc": 1631654054.0,
                    "replies": [
                        {
                            "body": "Actually in danzos mind, and the feudal lord and councils, he was doing the right thing for the time. Uchiha massacre was valid since he did make a good point and they'd most likely try it again. Still should've tried shisuis plan though but shisui needed to die before the show to limit plot holes. Convincing hanzo(?) That the akasuki were villains wasn't exactly wrong either. By doing so, he had the chance to get rid of the biggest threats to his village. Danzo is a messed up fuck, but his actions, most atleast, weren't wrong for the time. He had selfish intent, but then again, so does Naruto and literally every other character in the show and people In real life. Danzo could've been the best villain in the show besides maybe madara, if he had his own saga.",
                            "author": "xNuxIsGod",
                            "id": "hcw01p6",
                            "parent_id": "t1_hcvclh5",
                            "score": 17,
                            "created_utc": 1631664608.0,
                            "replies": []
                        },
                        {
                            "body": "This sub: man danzo was an asshole, he eradicated an entire clan and used their own people to do it!\n\nAlso this sub: the Uchiha were evil and we're going to destroy the village if they took over!",
                            "author": "nizzy2k11",
                            "id": "hcwc48g",
                            "parent_id": "t1_hcvclh5",
                            "score": 5,
                            "created_utc": 1631670127.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree. Danzos last act was to try to destroy Sasuke, who wanted to destroy the leaf village. He was a piece of shit, evil, dictatorial motherclucker, but I think he did care about the Leaf.\n\nJust not anyone but him running it.",
            "author": "PMMeMeiRule34",
            "id": "hcv072y",
            "parent_id": "t1_hctzvgz",
            "score": 36,
            "created_utc": 1631649089.0,
            "replies": [
                {
                    "body": "Headcannon fans would say otherwise but its established by even Danzo's worst enemies in the series he did everything for the Leaf. There is not one character that has said otherwise.",
                    "author": "1RonnieMund",
                    "id": "hcvv49i",
                    "parent_id": "t1_hcv072y",
                    "score": 8,
                    "created_utc": 1631662298.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The executed countless secret missions for the benefit of the village. Especially after the fourth died there was hardly anyone else to keep the other villages from attacking and leave room for relative peace.",
            "author": "ac714",
            "id": "hcuz0hj",
            "parent_id": "t1_hctzvgz",
            "score": 6,
            "created_utc": 1631648625.0,
            "replies": [
                {
                    "body": "Especially during and after the 1st shinobi war too. Both of Konoha's greatest weapons were dead and the village was still relatively new. There could have been all kinds of betrayal from the clans.",
                    "author": "1RonnieMund",
                    "id": "hcvv95s",
                    "parent_id": "t1_hcuz0hj",
                    "score": 3,
                    "created_utc": 1631662361.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Danzo would bravely hide underground when Momoshiki showed up.",
            "author": "sonfoa",
            "id": "hctzaq3",
            "parent_id": "t1_hct5gvt",
            "score": 97,
            "created_utc": 1631634397.0,
            "replies": [
                {
                    "body": "Big facts. “We’ll rebuild and then I’ll become hokage” - danzo",
                    "author": "idontwanttobeonthis",
                    "id": "hctzrfj",
                    "parent_id": "t1_hctzaq3",
                    "score": 86,
                    "created_utc": 1631634583.0,
                    "replies": []
                },
                {
                    "body": "Liked your usage of 'bravely' here lmao",
                    "author": "AERegeneratel38",
                    "id": "hcwaq3v",
                    "parent_id": "t1_hctzaq3",
                    "score": 2,
                    "created_utc": 1631669490.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The genjutsu of Shisui was so powerful so it had a cooldown before it can be used again . Since Danzo used it in the five kage summit he didnt had the option of using it at that time and any other genjutsu would have been way too weak for Sasuke and Danzo",
            "author": "Tarkik_Vatsa",
            "id": "hctswzo",
            "parent_id": "t1_hctcgyt",
            "score": 48,
            "created_utc": 1631631793.0,
            "replies": [
                {
                    "body": "Thats not entirely true. Danzo could have used Shisui's eye but couldn't because he needed it for Madara. He says this during the fight that the eye is ready but he needs it for Madara and that Sasuke is already a lost cause.",
                    "author": "1RonnieMund",
                    "id": "hcvvgd8",
                    "parent_id": "t1_hctswzo",
                    "score": 7,
                    "created_utc": 1631662452.0,
                    "replies": [
                        {
                            "body": "So why didnt he do it on madara?",
                            "author": "steplaser",
                            "id": "hcvyu2d",
                            "parent_id": "t1_hcvvgd8",
                            "score": 1,
                            "created_utc": 1631664049.0,
                            "replies": [
                                {
                                    "body": "I'm not making it up Danzo literally says this during the fight. I'll break it down. \n\nDanzo was saving up the entire fight for Madara. He says it to himself and even Karin acknowledges the only time Danzo actually exerts himself and uses his chakra is for the Wood jutsu because he couldn't avoid Susano's arrow any other way. He says it to himself as well that he's forced to use chakra and it's a setback. He was relying on the Izanagi to tire Sasuke out and he did succeed but Sasuke casting the genjutsu for the final Izanagi set him back a ways. He was severely weakened and with no Izanagi. Still he was strong enough to avoid a chidori from Sasuke and capture Karin which he would settle on Sasuke being weak hearted and take Karin hostage thinking after Sasuke gives up to spare Karin, Madara would step in and then use the eye. Instead Sasuke chooses to attack her and Danzo and at that point he was probably too weakened to use Shisui's eye and chose instead to get rid of them both with his final sealing jutsu.\n\nI just finished rewatching the fight. It's a lot better than people give credit. Definitely worth a rewatch imo. The only thing I didn't like was Sasuke screaming away Danzo's paralysis jutsu and Danzo taking the time to taunt him instead of just killing him right away . Cliche villain writing lol.",
                                    "author": "1RonnieMund",
                                    "id": "hcwetfu",
                                    "parent_id": "t1_hcvyu2d",
                                    "score": 7,
                                    "created_utc": 1631671355.0,
                                    "replies": [
                                        {
                                            "body": "Nice review. What bothers me is that danzo could have killed sasuke with that curse marrk but sasuke noped out of it another kishi bs writing.",
                                            "author": "steplaser",
                                            "id": "hcwnbh7",
                                            "parent_id": "t1_hcwetfu",
                                            "score": 2,
                                            "created_utc": 1631675499.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah not many people in the world can break an MS user's genjutsu let alone counter it ftw but as you say he just screams it off and Danzo does his little soliloquy instead of just finishing it sooner lol very cliché writing. Still I'll acknowledge Danzo's ability to just brush that off and even taunt him. He's not a real Uchiha and really not even a genius. Has futon...that's actually it. He has no special abilities other than the ones he had to steal and just through sheer planning was able to even put up a fight with an actual reincarnation of a god Uchiha. He planned so long how to fight even the strongest of the Uchiha it's almost like he was prepping for Madara all along.",
                                                    "author": "1RonnieMund",
                                                    "id": "hcxx1dp",
                                                    "parent_id": "t1_hcwnbh7",
                                                    "score": 1,
                                                    "created_utc": 1631708463.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "But how effective would a sharingan genjutsu be against a dual eternal mangekyo sharingan Uchiha ?",
                    "author": "EliYafah",
                    "id": "hcutkx9",
                    "parent_id": "t1_hctswzo",
                    "score": 3,
                    "created_utc": 1631646473.0,
                    "replies": [
                        {
                            "body": "Shisui had a Mangekyo too . Plus , Konomanatsuki (i think I spelled it completely wrong) was stated to be the strongest genjutsu ever even stronger than Tsukuyomi .",
                            "author": "Tarkik_Vatsa",
                            "id": "hcuuic2",
                            "parent_id": "t1_hcutkx9",
                            "score": 12,
                            "created_utc": 1631646844.0,
                            "replies": [
                                {
                                    "body": "kotoamatsukami :)",
                                    "author": "August_28th",
                                    "id": "hcv320c",
                                    "parent_id": "t1_hcuuic2",
                                    "score": 6,
                                    "created_utc": 1631650219.0,
                                    "replies": [
                                        {
                                            "body": "Ahh I got it wrong then 😅 . Thanks for correcting",
                                            "author": "Tarkik_Vatsa",
                                            "id": "hcwmiwo",
                                            "parent_id": "t1_hcv320c",
                                            "score": 2,
                                            "created_utc": 1631675092.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "He's mangekyo is in video games only afaik and non Uchiha kakashi, with a single implemented normal sharingan was able to resist the tsukoyomi for a few seconds. So the likes of Sasuke who are pure Uchiha and have 2 eternal mangekyo are a totally different beast.",
                                    "author": "EliYafah",
                                    "id": "hcuxcdt",
                                    "parent_id": "t1_hcuuic2",
                                    "score": 1,
                                    "created_utc": 1631647968.0,
                                    "replies": []
                                },
                                {
                                    "body": "Shisui was basically Aizen so it could only be used very sparingly. So good to mind control people for you with no drawbacks.",
                                    "author": "ac714",
                                    "id": "hcuzj1l",
                                    "parent_id": "t1_hcuuic2",
                                    "score": 1,
                                    "created_utc": 1631648828.0,
                                    "replies": [
                                        {
                                            "body": "Actually, his only drawback was that it used a lot of chakra and that it would blind him eventually. The time drawback was only for non uchiha users",
                                            "author": "julio2399",
                                            "id": "hcvxlv5",
                                            "parent_id": "t1_hcuzj1l",
                                            "score": 1,
                                            "created_utc": 1631663464.0,
                                            "replies": [
                                                {
                                                    "body": "Wut? You’re not understanding the situation at all.\n\nThe guy can mind control…anyone. This includes other uchihas to use izanagi for his benefit, collect or create sharingans, and just straight up create an EMS solving the blindness issue.\n\nWe already know what a person can do with a kage in their pocket like Obito and Yagura so imagine having all the kages under your thumb. Hardly a stretch to accomplish given what we’ve been told.",
                                                    "author": "ac714",
                                                    "id": "hcvym8i",
                                                    "parent_id": "t1_hcvxlv5",
                                                    "score": 0,
                                                    "created_utc": 1631663947.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "He was so dumb why didnt he save it for sasuke??",
                    "author": "steplaser",
                    "id": "hcvynxa",
                    "parent_id": "t1_hctswzo",
                    "score": 1,
                    "created_utc": 1631663970.0,
                    "replies": [
                        {
                            "body": "Q)why didnt he save it for sasuke??\n\nA)He was so dumb \n\nYou yourself answered your question",
                            "author": "Tarkik_Vatsa",
                            "id": "hcwmzz8",
                            "parent_id": "t1_hcvynxa",
                            "score": 1,
                            "created_utc": 1631675335.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, that could've also been done. Danzo just felt too disappointing, he was built up for so long but didn't amount to much",
            "author": "Tsynami",
            "id": "hctgpxn",
            "parent_id": "t1_hctcgyt",
            "score": 18,
            "created_utc": 1631626549.0,
            "replies": [
                {
                    "body": "Yeah honestly I think he shouldn't have died but that's my opinion maybe instead of the shin leader imagine if it was danzo",
                    "author": "Gizshot",
                    "id": "hcu91pw",
                    "parent_id": "t1_hctgpxn",
                    "score": 6,
                    "created_utc": 1631638296.0,
                    "replies": [
                        {
                            "body": "This would've made the whole thing way better tbh. Shin was already pretty bland, replacing him with Danzo who has the same gimmick as him (a ton of sharingan over his body) would've been pretty cool",
                            "author": "Tsynami",
                            "id": "hcujlbd",
                            "parent_id": "t1_hcu91pw",
                            "score": 5,
                            "created_utc": 1631642520.0,
                            "replies": [
                                {
                                    "body": "Yeah would create a new evil arc and with shikimaru being like the dark side of the kage position that he is. he is quietly sending messages for intel with danzo. But I understand this is supposed to be muh next generation and danzo doesn't fit that but whatever.",
                                    "author": "Gizshot",
                                    "id": "hcuonbj",
                                    "parent_id": "t1_hcujlbd",
                                    "score": 4,
                                    "created_utc": 1631644556.0,
                                    "replies": [
                                        {
                                            "body": "I mean, it could've turned out that he was actually an outer for Kara and that's how he was getting resources. Plus we know that people like Sumire's dad were still loyal to Danzo even after his death, so it's not a stretch to say that he'd have some spies in Konoha",
                                            "author": "Tsynami",
                                            "id": "hcupw7m",
                                            "parent_id": "t1_hcuonbj",
                                            "score": 2,
                                            "created_utc": 1631645030.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I liked his behind the scenes impact as a morally gray villain, stretching back to the Uchiha Massacre and even influencing the creation of Alatsuki. We didn’t see him fight much but I think he got just the right amount of screen time.",
                    "author": "theuncommonman",
                    "id": "hcvvng6",
                    "parent_id": "t1_hctgpxn",
                    "score": 2,
                    "created_utc": 1631662540.0,
                    "replies": []
                },
                {
                    "body": "Built up for so long? When did that happen? He was brought in midway and rushed right the fuck out.",
                    "author": "1RonnieMund",
                    "id": "hcvvhid",
                    "parent_id": "t1_hctgpxn",
                    "score": 1,
                    "created_utc": 1631662466.0,
                    "replies": [
                        {
                            "body": "They started building him up when Sai was introduced",
                            "author": "Tsynami",
                            "id": "hcx68ih",
                            "parent_id": "t1_hcvvhid",
                            "score": 1,
                            "created_utc": 1631687158.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "what if he just used substitution jutsu? /s",
            "author": "Jugbot",
            "id": "hcuhjmc",
            "parent_id": "t1_hctcgyt",
            "score": 4,
            "created_utc": 1631641685.0,
            "replies": []
        },
        {
            "body": "he was trying to use kotoamatsukami, but sasuke didnt give him any options to use it,",
            "author": "Doctor99268",
            "id": "hcun3np",
            "parent_id": "t1_hctcgyt",
            "score": 0,
            "created_utc": 1631643935.0,
            "replies": []
        },
        {
            "body": ">You really cannot blame Danzo for Nagato\n\nWhy not ? He was responsible for the killing of Yahiko . Yes Nagato was Madara's chosen one and he would have been his tool anyways but still that doesnt make Danzo's actions any better",
            "author": "Tarkik_Vatsa",
            "id": "hcu8f2d",
            "parent_id": "t1_hcu5a0p",
            "score": 14,
            "created_utc": 1631638047.0,
            "replies": [
                {
                    "body": "Except that that part is mostly filler\n\nThe only canon thing is that Hanzo teamed up with Danzo, that's it\n\nSo yes, you cannot blame Danzo for Nagato because canonically he just helped someone else (Hanzo) with their plan and that was probably just to ensure a better relationship between the Rain and the Leaf",
                    "author": "HateshWarkio",
                    "id": "hcu93ix",
                    "parent_id": "t1_hcu8f2d",
                    "score": 7,
                    "created_utc": 1631638317.0,
                    "replies": [
                        {
                            "body": "Damn . I forgot what part was filler and what was not . The fillers were trying too hard to show Danzo as evil . I think you are right then . I thought that Danzo manipulating Hanzo was canon .",
                            "author": "Tarkik_Vatsa",
                            "id": "hcuapmk",
                            "parent_id": "t1_hcu93ix",
                            "score": 7,
                            "created_utc": 1631638962.0,
                            "replies": [
                                {
                                    "body": "Yeah, 99% of the shit that gets blamed on Danzo is from fillers, they were really making him into this evilest guy around\n\nWhen in reality, he was just ruthless and calculating\n\nHe might even have Sasuke-like background since we know that Danzo comes from the Shimura clan but the only thing we know about the Shimura clan is that Danzo's father and grandfather got killed on a battlefield so he might be the last member of his clan",
                                    "author": "HateshWarkio",
                                    "id": "hcuemqw",
                                    "parent_id": "t1_hcuapmk",
                                    "score": 12,
                                    "created_utc": 1631640528.0,
                                    "replies": []
                                },
                                {
                                    "body": "Anime filler yeah. Made him a cartoon villain to fill time.",
                                    "author": "1RonnieMund",
                                    "id": "hcvvuqz",
                                    "parent_id": "t1_hcuapmk",
                                    "score": 2,
                                    "created_utc": 1631662636.0,
                                    "replies": [
                                        {
                                            "body": "Cartoon villains have more depth than whatever the hell the fillers were doing with Danzo",
                                            "author": "HateshWarkio",
                                            "id": "hd1jvxs",
                                            "parent_id": "t1_hcvvuqz",
                                            "score": 2,
                                            "created_utc": 1631767380.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "It was to destroy either of the groups in the proposed alliance from getting stronger. Hanzo was already feared by Konoha fighting all the Sannin now hes teaming up with a rising organization filled with young idealistic shinobi who he would definitely use for his own benefit. No one can afford that to happen.",
                            "author": "1RonnieMund",
                            "id": "hcvw5ei",
                            "parent_id": "t1_hcu93ix",
                            "score": 1,
                            "created_utc": 1631662774.0,
                            "replies": [
                                {
                                    "body": "Doesn't make sense to support the stronger one if you want them to destroy each other",
                                    "author": "HateshWarkio",
                                    "id": "hcw4h3y",
                                    "parent_id": "t1_hcvw5ei",
                                    "score": 1,
                                    "created_utc": 1631666621.0,
                                    "replies": [
                                        {
                                            "body": "He really wasn't supporting either of them only pretending to. The only real goal is to prevent the alliance.",
                                            "author": "1RonnieMund",
                                            "id": "hcxy9ti",
                                            "parent_id": "t1_hcw4h3y",
                                            "score": 1,
                                            "created_utc": 1631709161.0,
                                            "replies": [
                                                {
                                                    "body": "He lent a lot of ninjas to Hanzo, that's a big support, especially considering that the Rain is not that big village in a quite small country so they have a limited number of ninjas",
                                                    "author": "HateshWarkio",
                                                    "id": "hcxzf02",
                                                    "parent_id": "t1_hcxy9ti",
                                                    "score": 1,
                                                    "created_utc": 1631709784.0,
                                                    "replies": [
                                                        {
                                                            "body": "Again the goal remains the same.",
                                                            "author": "1RonnieMund",
                                                            "id": "hd2op9g",
                                                            "parent_id": "t1_hcxzf02",
                                                            "score": 1,
                                                            "created_utc": 1631797717.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Nagato is a tool for Zetsu and Madara's plan. They arent letting him off the hook.",
                    "author": "1RonnieMund",
                    "id": "hcvvnkt",
                    "parent_id": "t1_hcu8f2d",
                    "score": 2,
                    "created_utc": 1631662542.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think he was referring to Pain’s birth moment, not his eyes specifically",
            "author": "LinuxMintRejection",
            "id": "hcugcj9",
            "parent_id": "t1_hcu5a0p",
            "score": 2,
            "created_utc": 1631641208.0,
            "replies": [
                {
                    "body": "Again, Danzo didn't do shit for that\n\nCanonically he just lent Hanzo some ninjas and let him do whatever the hell he wanted\n\nIf you wanna blame someone for Pain then you can blame Hanzo",
                    "author": "HateshWarkio",
                    "id": "hcugzw0",
                    "parent_id": "t1_hcugcj9",
                    "score": 5,
                    "created_utc": 1631641467.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That just tells me that the negatives he's done are truly Preposterous in proportion to the good he's done and any good he has done also doesn't change the fact but a lot of the bad he's done was out of his own selfishness\n\nI'm like most people I don't entirely blame him for the Uchiha genocide except for what happened with shisui Uchiha that was entirely self-serving and unnecessary\n\nBut I think ultimately destroying the Uchiha Clan as it was was unfortunately necessary but there was no doubt in my mind of the selfishness of his intentions display in the gratuitous amount of Sharingan he kept on him certainly doesn't speak of good intentions",
            "author": "Dismal_Performer7556",
            "id": "hcw155o",
            "parent_id": "t1_hcvwiay",
            "score": 0,
            "created_utc": 1631665107.0,
            "replies": [
                {
                    "body": "Even Itachi says Shishi's plan would have failed and he would ultimately side with his clan. Itachi was even trying to find ways to beat Shishi and said maybe it was better that they got to go out as friends. That's his own best friend and his own das who the mission depended on. \n\nSo Danzo should have let Madara have even more eyes...\n\nYou don't even know the good he did but you already write it off and the people who do knows opinions mean nothing. Thats headcanon. There's a reason he was respected and allowed to do what he did for 50 years 2nd in command of the village and helping the only Hokage to ever survive long enough to lead anything should have been a hint to you.",
                    "author": "1RonnieMund",
                    "id": "hcwh2wq",
                    "parent_id": "t1_hcw155o",
                    "score": 3,
                    "created_utc": 1631672416.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Similar things with narutos cell you get bigger chakra reserves some regeneration I think not sure if you could use a bit of the kyubi’s power",
            "author": "stretchmarks55",
            "id": "hd16pqk",
            "parent_id": "t1_hcvdqi4",
            "score": 1,
            "created_utc": 1631760070.0,
            "replies": []
        },
        {
            "body": "Danzo would die if he tried to use Rinnegan abilities. Obito had trouble handling one and he was a full-blooded Uchiha who was basically half Hashirama tissue.",
            "author": "sonfoa",
            "id": "hctzmt4",
            "parent_id": "t1_hctbiz4",
            "score": 18,
            "created_utc": 1631634532.0,
            "replies": [
                {
                    "body": "his arm is from shin, whos body can accept transplants without issue",
                    "author": "Doctor99268",
                    "id": "hcuniif",
                    "parent_id": "t1_hctzmt4",
                    "score": 3,
                    "created_utc": 1631644098.0,
                    "replies": [
                        {
                            "body": "I don't think the transplant is the issue, it has something to do with chakra levels",
                            "author": "whitey-ofwgkta",
                            "id": "hcvden1",
                            "parent_id": "t1_hcuniif",
                            "score": 5,
                            "created_utc": 1631654389.0,
                            "replies": [
                                {
                                    "body": "Yeah",
                                    "author": "Starlight_Requiem_XD",
                                    "id": "hcvmftk",
                                    "parent_id": "t1_hcvden1",
                                    "score": 1,
                                    "created_utc": 1631658301.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean u ain’t wrong tho",
            "author": "Krish220307",
            "id": "hctbmn8",
            "parent_id": "t1_hctbiz4",
            "score": 1,
            "created_utc": 1631624072.0,
            "replies": []
        },
        {
            "body": "Because nobody found out about his crimes. Konoha showed their ignorance and let danzo get away with many things. He was a necessary evil of sorts. Except that now since naruto is hokage, he wouldn't put up with danzo's bullshit and have him executed or imprisoned for his crimes against the uchiha clan.",
            "author": "TegamiBachi25",
            "id": "hczp6f0",
            "parent_id": "t1_hcxa5ug",
            "score": 2,
            "created_utc": 1631735954.0,
            "replies": [
                {
                    "body": "K",
                    "author": "Elad2007",
                    "id": "hczqlwp",
                    "parent_id": "t1_hczp6f0",
                    "score": 1,
                    "created_utc": 1631736521.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He is the most realistic villain - an irredeemable selfish hypocritical asshole who just want to ruin everyone's day while screaming he is doing it for the good of people.",
            "author": "sephelutis",
            "id": "hcvclh5",
            "parent_id": "t1_hcuktvl",
            "score": 53,
            "created_utc": 1631654054.0,
            "replies": [
                {
                    "body": "Actually in danzos mind, and the feudal lord and councils, he was doing the right thing for the time. Uchiha massacre was valid since he did make a good point and they'd most likely try it again. Still should've tried shisuis plan though but shisui needed to die before the show to limit plot holes. Convincing hanzo(?) That the akasuki were villains wasn't exactly wrong either. By doing so, he had the chance to get rid of the biggest threats to his village. Danzo is a messed up fuck, but his actions, most atleast, weren't wrong for the time. He had selfish intent, but then again, so does Naruto and literally every other character in the show and people In real life. Danzo could've been the best villain in the show besides maybe madara, if he had his own saga.",
                    "author": "xNuxIsGod",
                    "id": "hcw01p6",
                    "parent_id": "t1_hcvclh5",
                    "score": 17,
                    "created_utc": 1631664608.0,
                    "replies": []
                },
                {
                    "body": "This sub: man danzo was an asshole, he eradicated an entire clan and used their own people to do it!\n\nAlso this sub: the Uchiha were evil and we're going to destroy the village if they took over!",
                    "author": "nizzy2k11",
                    "id": "hcwc48g",
                    "parent_id": "t1_hcvclh5",
                    "score": 5,
                    "created_utc": 1631670127.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Headcannon fans would say otherwise but its established by even Danzo's worst enemies in the series he did everything for the Leaf. There is not one character that has said otherwise.",
            "author": "1RonnieMund",
            "id": "hcvv49i",
            "parent_id": "t1_hcv072y",
            "score": 8,
            "created_utc": 1631662298.0,
            "replies": []
        },
        {
            "body": "Especially during and after the 1st shinobi war too. Both of Konoha's greatest weapons were dead and the village was still relatively new. There could have been all kinds of betrayal from the clans.",
            "author": "1RonnieMund",
            "id": "hcvv95s",
            "parent_id": "t1_hcuz0hj",
            "score": 3,
            "created_utc": 1631662361.0,
            "replies": []
        },
        {
            "body": "Big facts. “We’ll rebuild and then I’ll become hokage” - danzo",
            "author": "idontwanttobeonthis",
            "id": "hctzrfj",
            "parent_id": "t1_hctzaq3",
            "score": 86,
            "created_utc": 1631634583.0,
            "replies": []
        },
        {
            "body": "Liked your usage of 'bravely' here lmao",
            "author": "AERegeneratel38",
            "id": "hcwaq3v",
            "parent_id": "t1_hctzaq3",
            "score": 2,
            "created_utc": 1631669490.0,
            "replies": []
        },
        {
            "body": "Thats not entirely true. Danzo could have used Shisui's eye but couldn't because he needed it for Madara. He says this during the fight that the eye is ready but he needs it for Madara and that Sasuke is already a lost cause.",
            "author": "1RonnieMund",
            "id": "hcvvgd8",
            "parent_id": "t1_hctswzo",
            "score": 7,
            "created_utc": 1631662452.0,
            "replies": [
                {
                    "body": "So why didnt he do it on madara?",
                    "author": "steplaser",
                    "id": "hcvyu2d",
                    "parent_id": "t1_hcvvgd8",
                    "score": 1,
                    "created_utc": 1631664049.0,
                    "replies": [
                        {
                            "body": "I'm not making it up Danzo literally says this during the fight. I'll break it down. \n\nDanzo was saving up the entire fight for Madara. He says it to himself and even Karin acknowledges the only time Danzo actually exerts himself and uses his chakra is for the Wood jutsu because he couldn't avoid Susano's arrow any other way. He says it to himself as well that he's forced to use chakra and it's a setback. He was relying on the Izanagi to tire Sasuke out and he did succeed but Sasuke casting the genjutsu for the final Izanagi set him back a ways. He was severely weakened and with no Izanagi. Still he was strong enough to avoid a chidori from Sasuke and capture Karin which he would settle on Sasuke being weak hearted and take Karin hostage thinking after Sasuke gives up to spare Karin, Madara would step in and then use the eye. Instead Sasuke chooses to attack her and Danzo and at that point he was probably too weakened to use Shisui's eye and chose instead to get rid of them both with his final sealing jutsu.\n\nI just finished rewatching the fight. It's a lot better than people give credit. Definitely worth a rewatch imo. The only thing I didn't like was Sasuke screaming away Danzo's paralysis jutsu and Danzo taking the time to taunt him instead of just killing him right away . Cliche villain writing lol.",
                            "author": "1RonnieMund",
                            "id": "hcwetfu",
                            "parent_id": "t1_hcvyu2d",
                            "score": 7,
                            "created_utc": 1631671355.0,
                            "replies": [
                                {
                                    "body": "Nice review. What bothers me is that danzo could have killed sasuke with that curse marrk but sasuke noped out of it another kishi bs writing.",
                                    "author": "steplaser",
                                    "id": "hcwnbh7",
                                    "parent_id": "t1_hcwetfu",
                                    "score": 2,
                                    "created_utc": 1631675499.0,
                                    "replies": [
                                        {
                                            "body": "Yeah not many people in the world can break an MS user's genjutsu let alone counter it ftw but as you say he just screams it off and Danzo does his little soliloquy instead of just finishing it sooner lol very cliché writing. Still I'll acknowledge Danzo's ability to just brush that off and even taunt him. He's not a real Uchiha and really not even a genius. Has futon...that's actually it. He has no special abilities other than the ones he had to steal and just through sheer planning was able to even put up a fight with an actual reincarnation of a god Uchiha. He planned so long how to fight even the strongest of the Uchiha it's almost like he was prepping for Madara all along.",
                                            "author": "1RonnieMund",
                                            "id": "hcxx1dp",
                                            "parent_id": "t1_hcwnbh7",
                                            "score": 1,
                                            "created_utc": 1631708463.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "But how effective would a sharingan genjutsu be against a dual eternal mangekyo sharingan Uchiha ?",
            "author": "EliYafah",
            "id": "hcutkx9",
            "parent_id": "t1_hctswzo",
            "score": 3,
            "created_utc": 1631646473.0,
            "replies": [
                {
                    "body": "Shisui had a Mangekyo too . Plus , Konomanatsuki (i think I spelled it completely wrong) was stated to be the strongest genjutsu ever even stronger than Tsukuyomi .",
                    "author": "Tarkik_Vatsa",
                    "id": "hcuuic2",
                    "parent_id": "t1_hcutkx9",
                    "score": 12,
                    "created_utc": 1631646844.0,
                    "replies": [
                        {
                            "body": "kotoamatsukami :)",
                            "author": "August_28th",
                            "id": "hcv320c",
                            "parent_id": "t1_hcuuic2",
                            "score": 6,
                            "created_utc": 1631650219.0,
                            "replies": [
                                {
                                    "body": "Ahh I got it wrong then 😅 . Thanks for correcting",
                                    "author": "Tarkik_Vatsa",
                                    "id": "hcwmiwo",
                                    "parent_id": "t1_hcv320c",
                                    "score": 2,
                                    "created_utc": 1631675092.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "He's mangekyo is in video games only afaik and non Uchiha kakashi, with a single implemented normal sharingan was able to resist the tsukoyomi for a few seconds. So the likes of Sasuke who are pure Uchiha and have 2 eternal mangekyo are a totally different beast.",
                            "author": "EliYafah",
                            "id": "hcuxcdt",
                            "parent_id": "t1_hcuuic2",
                            "score": 1,
                            "created_utc": 1631647968.0,
                            "replies": []
                        },
                        {
                            "body": "Shisui was basically Aizen so it could only be used very sparingly. So good to mind control people for you with no drawbacks.",
                            "author": "ac714",
                            "id": "hcuzj1l",
                            "parent_id": "t1_hcuuic2",
                            "score": 1,
                            "created_utc": 1631648828.0,
                            "replies": [
                                {
                                    "body": "Actually, his only drawback was that it used a lot of chakra and that it would blind him eventually. The time drawback was only for non uchiha users",
                                    "author": "julio2399",
                                    "id": "hcvxlv5",
                                    "parent_id": "t1_hcuzj1l",
                                    "score": 1,
                                    "created_utc": 1631663464.0,
                                    "replies": [
                                        {
                                            "body": "Wut? You’re not understanding the situation at all.\n\nThe guy can mind control…anyone. This includes other uchihas to use izanagi for his benefit, collect or create sharingans, and just straight up create an EMS solving the blindness issue.\n\nWe already know what a person can do with a kage in their pocket like Obito and Yagura so imagine having all the kages under your thumb. Hardly a stretch to accomplish given what we’ve been told.",
                                            "author": "ac714",
                                            "id": "hcvym8i",
                                            "parent_id": "t1_hcvxlv5",
                                            "score": 0,
                                            "created_utc": 1631663947.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He was so dumb why didnt he save it for sasuke??",
            "author": "steplaser",
            "id": "hcvynxa",
            "parent_id": "t1_hctswzo",
            "score": 1,
            "created_utc": 1631663970.0,
            "replies": [
                {
                    "body": "Q)why didnt he save it for sasuke??\n\nA)He was so dumb \n\nYou yourself answered your question",
                    "author": "Tarkik_Vatsa",
                    "id": "hcwmzz8",
                    "parent_id": "t1_hcvynxa",
                    "score": 1,
                    "created_utc": 1631675335.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah honestly I think he shouldn't have died but that's my opinion maybe instead of the shin leader imagine if it was danzo",
            "author": "Gizshot",
            "id": "hcu91pw",
            "parent_id": "t1_hctgpxn",
            "score": 6,
            "created_utc": 1631638296.0,
            "replies": [
                {
                    "body": "This would've made the whole thing way better tbh. Shin was already pretty bland, replacing him with Danzo who has the same gimmick as him (a ton of sharingan over his body) would've been pretty cool",
                    "author": "Tsynami",
                    "id": "hcujlbd",
                    "parent_id": "t1_hcu91pw",
                    "score": 5,
                    "created_utc": 1631642520.0,
                    "replies": [
                        {
                            "body": "Yeah would create a new evil arc and with shikimaru being like the dark side of the kage position that he is. he is quietly sending messages for intel with danzo. But I understand this is supposed to be muh next generation and danzo doesn't fit that but whatever.",
                            "author": "Gizshot",
                            "id": "hcuonbj",
                            "parent_id": "t1_hcujlbd",
                            "score": 4,
                            "created_utc": 1631644556.0,
                            "replies": [
                                {
                                    "body": "I mean, it could've turned out that he was actually an outer for Kara and that's how he was getting resources. Plus we know that people like Sumire's dad were still loyal to Danzo even after his death, so it's not a stretch to say that he'd have some spies in Konoha",
                                    "author": "Tsynami",
                                    "id": "hcupw7m",
                                    "parent_id": "t1_hcuonbj",
                                    "score": 2,
                                    "created_utc": 1631645030.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I liked his behind the scenes impact as a morally gray villain, stretching back to the Uchiha Massacre and even influencing the creation of Alatsuki. We didn’t see him fight much but I think he got just the right amount of screen time.",
            "author": "theuncommonman",
            "id": "hcvvng6",
            "parent_id": "t1_hctgpxn",
            "score": 2,
            "created_utc": 1631662540.0,
            "replies": []
        },
        {
            "body": "Built up for so long? When did that happen? He was brought in midway and rushed right the fuck out.",
            "author": "1RonnieMund",
            "id": "hcvvhid",
            "parent_id": "t1_hctgpxn",
            "score": 1,
            "created_utc": 1631662466.0,
            "replies": [
                {
                    "body": "They started building him up when Sai was introduced",
                    "author": "Tsynami",
                    "id": "hcx68ih",
                    "parent_id": "t1_hcvvhid",
                    "score": 1,
                    "created_utc": 1631687158.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Except that that part is mostly filler\n\nThe only canon thing is that Hanzo teamed up with Danzo, that's it\n\nSo yes, you cannot blame Danzo for Nagato because canonically he just helped someone else (Hanzo) with their plan and that was probably just to ensure a better relationship between the Rain and the Leaf",
            "author": "HateshWarkio",
            "id": "hcu93ix",
            "parent_id": "t1_hcu8f2d",
            "score": 7,
            "created_utc": 1631638317.0,
            "replies": [
                {
                    "body": "Damn . I forgot what part was filler and what was not . The fillers were trying too hard to show Danzo as evil . I think you are right then . I thought that Danzo manipulating Hanzo was canon .",
                    "author": "Tarkik_Vatsa",
                    "id": "hcuapmk",
                    "parent_id": "t1_hcu93ix",
                    "score": 7,
                    "created_utc": 1631638962.0,
                    "replies": [
                        {
                            "body": "Yeah, 99% of the shit that gets blamed on Danzo is from fillers, they were really making him into this evilest guy around\n\nWhen in reality, he was just ruthless and calculating\n\nHe might even have Sasuke-like background since we know that Danzo comes from the Shimura clan but the only thing we know about the Shimura clan is that Danzo's father and grandfather got killed on a battlefield so he might be the last member of his clan",
                            "author": "HateshWarkio",
                            "id": "hcuemqw",
                            "parent_id": "t1_hcuapmk",
                            "score": 12,
                            "created_utc": 1631640528.0,
                            "replies": []
                        },
                        {
                            "body": "Anime filler yeah. Made him a cartoon villain to fill time.",
                            "author": "1RonnieMund",
                            "id": "hcvvuqz",
                            "parent_id": "t1_hcuapmk",
                            "score": 2,
                            "created_utc": 1631662636.0,
                            "replies": [
                                {
                                    "body": "Cartoon villains have more depth than whatever the hell the fillers were doing with Danzo",
                                    "author": "HateshWarkio",
                                    "id": "hd1jvxs",
                                    "parent_id": "t1_hcvvuqz",
                                    "score": 2,
                                    "created_utc": 1631767380.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It was to destroy either of the groups in the proposed alliance from getting stronger. Hanzo was already feared by Konoha fighting all the Sannin now hes teaming up with a rising organization filled with young idealistic shinobi who he would definitely use for his own benefit. No one can afford that to happen.",
                    "author": "1RonnieMund",
                    "id": "hcvw5ei",
                    "parent_id": "t1_hcu93ix",
                    "score": 1,
                    "created_utc": 1631662774.0,
                    "replies": [
                        {
                            "body": "Doesn't make sense to support the stronger one if you want them to destroy each other",
                            "author": "HateshWarkio",
                            "id": "hcw4h3y",
                            "parent_id": "t1_hcvw5ei",
                            "score": 1,
                            "created_utc": 1631666621.0,
                            "replies": [
                                {
                                    "body": "He really wasn't supporting either of them only pretending to. The only real goal is to prevent the alliance.",
                                    "author": "1RonnieMund",
                                    "id": "hcxy9ti",
                                    "parent_id": "t1_hcw4h3y",
                                    "score": 1,
                                    "created_utc": 1631709161.0,
                                    "replies": [
                                        {
                                            "body": "He lent a lot of ninjas to Hanzo, that's a big support, especially considering that the Rain is not that big village in a quite small country so they have a limited number of ninjas",
                                            "author": "HateshWarkio",
                                            "id": "hcxzf02",
                                            "parent_id": "t1_hcxy9ti",
                                            "score": 1,
                                            "created_utc": 1631709784.0,
                                            "replies": [
                                                {
                                                    "body": "Again the goal remains the same.",
                                                    "author": "1RonnieMund",
                                                    "id": "hd2op9g",
                                                    "parent_id": "t1_hcxzf02",
                                                    "score": 1,
                                                    "created_utc": 1631797717.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nagato is a tool for Zetsu and Madara's plan. They arent letting him off the hook.",
            "author": "1RonnieMund",
            "id": "hcvvnkt",
            "parent_id": "t1_hcu8f2d",
            "score": 2,
            "created_utc": 1631662542.0,
            "replies": []
        },
        {
            "body": "Again, Danzo didn't do shit for that\n\nCanonically he just lent Hanzo some ninjas and let him do whatever the hell he wanted\n\nIf you wanna blame someone for Pain then you can blame Hanzo",
            "author": "HateshWarkio",
            "id": "hcugzw0",
            "parent_id": "t1_hcugcj9",
            "score": 5,
            "created_utc": 1631641467.0,
            "replies": []
        },
        {
            "body": "Even Itachi says Shishi's plan would have failed and he would ultimately side with his clan. Itachi was even trying to find ways to beat Shishi and said maybe it was better that they got to go out as friends. That's his own best friend and his own das who the mission depended on. \n\nSo Danzo should have let Madara have even more eyes...\n\nYou don't even know the good he did but you already write it off and the people who do knows opinions mean nothing. Thats headcanon. There's a reason he was respected and allowed to do what he did for 50 years 2nd in command of the village and helping the only Hokage to ever survive long enough to lead anything should have been a hint to you.",
            "author": "1RonnieMund",
            "id": "hcwh2wq",
            "parent_id": "t1_hcw155o",
            "score": 3,
            "created_utc": 1631672416.0,
            "replies": []
        },
        {
            "body": "his arm is from shin, whos body can accept transplants without issue",
            "author": "Doctor99268",
            "id": "hcuniif",
            "parent_id": "t1_hctzmt4",
            "score": 3,
            "created_utc": 1631644098.0,
            "replies": [
                {
                    "body": "I don't think the transplant is the issue, it has something to do with chakra levels",
                    "author": "whitey-ofwgkta",
                    "id": "hcvden1",
                    "parent_id": "t1_hcuniif",
                    "score": 5,
                    "created_utc": 1631654389.0,
                    "replies": [
                        {
                            "body": "Yeah",
                            "author": "Starlight_Requiem_XD",
                            "id": "hcvmftk",
                            "parent_id": "t1_hcvden1",
                            "score": 1,
                            "created_utc": 1631658301.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "K",
            "author": "Elad2007",
            "id": "hczqlwp",
            "parent_id": "t1_hczp6f0",
            "score": 1,
            "created_utc": 1631736521.0,
            "replies": []
        },
        {
            "body": "Actually in danzos mind, and the feudal lord and councils, he was doing the right thing for the time. Uchiha massacre was valid since he did make a good point and they'd most likely try it again. Still should've tried shisuis plan though but shisui needed to die before the show to limit plot holes. Convincing hanzo(?) That the akasuki were villains wasn't exactly wrong either. By doing so, he had the chance to get rid of the biggest threats to his village. Danzo is a messed up fuck, but his actions, most atleast, weren't wrong for the time. He had selfish intent, but then again, so does Naruto and literally every other character in the show and people In real life. Danzo could've been the best villain in the show besides maybe madara, if he had his own saga.",
            "author": "xNuxIsGod",
            "id": "hcw01p6",
            "parent_id": "t1_hcvclh5",
            "score": 17,
            "created_utc": 1631664608.0,
            "replies": []
        },
        {
            "body": "This sub: man danzo was an asshole, he eradicated an entire clan and used their own people to do it!\n\nAlso this sub: the Uchiha were evil and we're going to destroy the village if they took over!",
            "author": "nizzy2k11",
            "id": "hcwc48g",
            "parent_id": "t1_hcvclh5",
            "score": 5,
            "created_utc": 1631670127.0,
            "replies": []
        },
        {
            "body": "So why didnt he do it on madara?",
            "author": "steplaser",
            "id": "hcvyu2d",
            "parent_id": "t1_hcvvgd8",
            "score": 1,
            "created_utc": 1631664049.0,
            "replies": [
                {
                    "body": "I'm not making it up Danzo literally says this during the fight. I'll break it down. \n\nDanzo was saving up the entire fight for Madara. He says it to himself and even Karin acknowledges the only time Danzo actually exerts himself and uses his chakra is for the Wood jutsu because he couldn't avoid Susano's arrow any other way. He says it to himself as well that he's forced to use chakra and it's a setback. He was relying on the Izanagi to tire Sasuke out and he did succeed but Sasuke casting the genjutsu for the final Izanagi set him back a ways. He was severely weakened and with no Izanagi. Still he was strong enough to avoid a chidori from Sasuke and capture Karin which he would settle on Sasuke being weak hearted and take Karin hostage thinking after Sasuke gives up to spare Karin, Madara would step in and then use the eye. Instead Sasuke chooses to attack her and Danzo and at that point he was probably too weakened to use Shisui's eye and chose instead to get rid of them both with his final sealing jutsu.\n\nI just finished rewatching the fight. It's a lot better than people give credit. Definitely worth a rewatch imo. The only thing I didn't like was Sasuke screaming away Danzo's paralysis jutsu and Danzo taking the time to taunt him instead of just killing him right away . Cliche villain writing lol.",
                    "author": "1RonnieMund",
                    "id": "hcwetfu",
                    "parent_id": "t1_hcvyu2d",
                    "score": 7,
                    "created_utc": 1631671355.0,
                    "replies": [
                        {
                            "body": "Nice review. What bothers me is that danzo could have killed sasuke with that curse marrk but sasuke noped out of it another kishi bs writing.",
                            "author": "steplaser",
                            "id": "hcwnbh7",
                            "parent_id": "t1_hcwetfu",
                            "score": 2,
                            "created_utc": 1631675499.0,
                            "replies": [
                                {
                                    "body": "Yeah not many people in the world can break an MS user's genjutsu let alone counter it ftw but as you say he just screams it off and Danzo does his little soliloquy instead of just finishing it sooner lol very cliché writing. Still I'll acknowledge Danzo's ability to just brush that off and even taunt him. He's not a real Uchiha and really not even a genius. Has futon...that's actually it. He has no special abilities other than the ones he had to steal and just through sheer planning was able to even put up a fight with an actual reincarnation of a god Uchiha. He planned so long how to fight even the strongest of the Uchiha it's almost like he was prepping for Madara all along.",
                                    "author": "1RonnieMund",
                                    "id": "hcxx1dp",
                                    "parent_id": "t1_hcwnbh7",
                                    "score": 1,
                                    "created_utc": 1631708463.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Shisui had a Mangekyo too . Plus , Konomanatsuki (i think I spelled it completely wrong) was stated to be the strongest genjutsu ever even stronger than Tsukuyomi .",
            "author": "Tarkik_Vatsa",
            "id": "hcuuic2",
            "parent_id": "t1_hcutkx9",
            "score": 12,
            "created_utc": 1631646844.0,
            "replies": [
                {
                    "body": "kotoamatsukami :)",
                    "author": "August_28th",
                    "id": "hcv320c",
                    "parent_id": "t1_hcuuic2",
                    "score": 6,
                    "created_utc": 1631650219.0,
                    "replies": [
                        {
                            "body": "Ahh I got it wrong then 😅 . Thanks for correcting",
                            "author": "Tarkik_Vatsa",
                            "id": "hcwmiwo",
                            "parent_id": "t1_hcv320c",
                            "score": 2,
                            "created_utc": 1631675092.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "He's mangekyo is in video games only afaik and non Uchiha kakashi, with a single implemented normal sharingan was able to resist the tsukoyomi for a few seconds. So the likes of Sasuke who are pure Uchiha and have 2 eternal mangekyo are a totally different beast.",
                    "author": "EliYafah",
                    "id": "hcuxcdt",
                    "parent_id": "t1_hcuuic2",
                    "score": 1,
                    "created_utc": 1631647968.0,
                    "replies": []
                },
                {
                    "body": "Shisui was basically Aizen so it could only be used very sparingly. So good to mind control people for you with no drawbacks.",
                    "author": "ac714",
                    "id": "hcuzj1l",
                    "parent_id": "t1_hcuuic2",
                    "score": 1,
                    "created_utc": 1631648828.0,
                    "replies": [
                        {
                            "body": "Actually, his only drawback was that it used a lot of chakra and that it would blind him eventually. The time drawback was only for non uchiha users",
                            "author": "julio2399",
                            "id": "hcvxlv5",
                            "parent_id": "t1_hcuzj1l",
                            "score": 1,
                            "created_utc": 1631663464.0,
                            "replies": [
                                {
                                    "body": "Wut? You’re not understanding the situation at all.\n\nThe guy can mind control…anyone. This includes other uchihas to use izanagi for his benefit, collect or create sharingans, and just straight up create an EMS solving the blindness issue.\n\nWe already know what a person can do with a kage in their pocket like Obito and Yagura so imagine having all the kages under your thumb. Hardly a stretch to accomplish given what we’ve been told.",
                                    "author": "ac714",
                                    "id": "hcvym8i",
                                    "parent_id": "t1_hcvxlv5",
                                    "score": 0,
                                    "created_utc": 1631663947.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Q)why didnt he save it for sasuke??\n\nA)He was so dumb \n\nYou yourself answered your question",
            "author": "Tarkik_Vatsa",
            "id": "hcwmzz8",
            "parent_id": "t1_hcvynxa",
            "score": 1,
            "created_utc": 1631675335.0,
            "replies": []
        },
        {
            "body": "This would've made the whole thing way better tbh. Shin was already pretty bland, replacing him with Danzo who has the same gimmick as him (a ton of sharingan over his body) would've been pretty cool",
            "author": "Tsynami",
            "id": "hcujlbd",
            "parent_id": "t1_hcu91pw",
            "score": 5,
            "created_utc": 1631642520.0,
            "replies": [
                {
                    "body": "Yeah would create a new evil arc and with shikimaru being like the dark side of the kage position that he is. he is quietly sending messages for intel with danzo. But I understand this is supposed to be muh next generation and danzo doesn't fit that but whatever.",
                    "author": "Gizshot",
                    "id": "hcuonbj",
                    "parent_id": "t1_hcujlbd",
                    "score": 4,
                    "created_utc": 1631644556.0,
                    "replies": [
                        {
                            "body": "I mean, it could've turned out that he was actually an outer for Kara and that's how he was getting resources. Plus we know that people like Sumire's dad were still loyal to Danzo even after his death, so it's not a stretch to say that he'd have some spies in Konoha",
                            "author": "Tsynami",
                            "id": "hcupw7m",
                            "parent_id": "t1_hcuonbj",
                            "score": 2,
                            "created_utc": 1631645030.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "They started building him up when Sai was introduced",
            "author": "Tsynami",
            "id": "hcx68ih",
            "parent_id": "t1_hcvvhid",
            "score": 1,
            "created_utc": 1631687158.0,
            "replies": []
        },
        {
            "body": "Damn . I forgot what part was filler and what was not . The fillers were trying too hard to show Danzo as evil . I think you are right then . I thought that Danzo manipulating Hanzo was canon .",
            "author": "Tarkik_Vatsa",
            "id": "hcuapmk",
            "parent_id": "t1_hcu93ix",
            "score": 7,
            "created_utc": 1631638962.0,
            "replies": [
                {
                    "body": "Yeah, 99% of the shit that gets blamed on Danzo is from fillers, they were really making him into this evilest guy around\n\nWhen in reality, he was just ruthless and calculating\n\nHe might even have Sasuke-like background since we know that Danzo comes from the Shimura clan but the only thing we know about the Shimura clan is that Danzo's father and grandfather got killed on a battlefield so he might be the last member of his clan",
                    "author": "HateshWarkio",
                    "id": "hcuemqw",
                    "parent_id": "t1_hcuapmk",
                    "score": 12,
                    "created_utc": 1631640528.0,
                    "replies": []
                },
                {
                    "body": "Anime filler yeah. Made him a cartoon villain to fill time.",
                    "author": "1RonnieMund",
                    "id": "hcvvuqz",
                    "parent_id": "t1_hcuapmk",
                    "score": 2,
                    "created_utc": 1631662636.0,
                    "replies": [
                        {
                            "body": "Cartoon villains have more depth than whatever the hell the fillers were doing with Danzo",
                            "author": "HateshWarkio",
                            "id": "hd1jvxs",
                            "parent_id": "t1_hcvvuqz",
                            "score": 2,
                            "created_utc": 1631767380.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It was to destroy either of the groups in the proposed alliance from getting stronger. Hanzo was already feared by Konoha fighting all the Sannin now hes teaming up with a rising organization filled with young idealistic shinobi who he would definitely use for his own benefit. No one can afford that to happen.",
            "author": "1RonnieMund",
            "id": "hcvw5ei",
            "parent_id": "t1_hcu93ix",
            "score": 1,
            "created_utc": 1631662774.0,
            "replies": [
                {
                    "body": "Doesn't make sense to support the stronger one if you want them to destroy each other",
                    "author": "HateshWarkio",
                    "id": "hcw4h3y",
                    "parent_id": "t1_hcvw5ei",
                    "score": 1,
                    "created_utc": 1631666621.0,
                    "replies": [
                        {
                            "body": "He really wasn't supporting either of them only pretending to. The only real goal is to prevent the alliance.",
                            "author": "1RonnieMund",
                            "id": "hcxy9ti",
                            "parent_id": "t1_hcw4h3y",
                            "score": 1,
                            "created_utc": 1631709161.0,
                            "replies": [
                                {
                                    "body": "He lent a lot of ninjas to Hanzo, that's a big support, especially considering that the Rain is not that big village in a quite small country so they have a limited number of ninjas",
                                    "author": "HateshWarkio",
                                    "id": "hcxzf02",
                                    "parent_id": "t1_hcxy9ti",
                                    "score": 1,
                                    "created_utc": 1631709784.0,
                                    "replies": [
                                        {
                                            "body": "Again the goal remains the same.",
                                            "author": "1RonnieMund",
                                            "id": "hd2op9g",
                                            "parent_id": "t1_hcxzf02",
                                            "score": 1,
                                            "created_utc": 1631797717.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't think the transplant is the issue, it has something to do with chakra levels",
            "author": "whitey-ofwgkta",
            "id": "hcvden1",
            "parent_id": "t1_hcuniif",
            "score": 5,
            "created_utc": 1631654389.0,
            "replies": [
                {
                    "body": "Yeah",
                    "author": "Starlight_Requiem_XD",
                    "id": "hcvmftk",
                    "parent_id": "t1_hcvden1",
                    "score": 1,
                    "created_utc": 1631658301.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm not making it up Danzo literally says this during the fight. I'll break it down. \n\nDanzo was saving up the entire fight for Madara. He says it to himself and even Karin acknowledges the only time Danzo actually exerts himself and uses his chakra is for the Wood jutsu because he couldn't avoid Susano's arrow any other way. He says it to himself as well that he's forced to use chakra and it's a setback. He was relying on the Izanagi to tire Sasuke out and he did succeed but Sasuke casting the genjutsu for the final Izanagi set him back a ways. He was severely weakened and with no Izanagi. Still he was strong enough to avoid a chidori from Sasuke and capture Karin which he would settle on Sasuke being weak hearted and take Karin hostage thinking after Sasuke gives up to spare Karin, Madara would step in and then use the eye. Instead Sasuke chooses to attack her and Danzo and at that point he was probably too weakened to use Shisui's eye and chose instead to get rid of them both with his final sealing jutsu.\n\nI just finished rewatching the fight. It's a lot better than people give credit. Definitely worth a rewatch imo. The only thing I didn't like was Sasuke screaming away Danzo's paralysis jutsu and Danzo taking the time to taunt him instead of just killing him right away . Cliche villain writing lol.",
            "author": "1RonnieMund",
            "id": "hcwetfu",
            "parent_id": "t1_hcvyu2d",
            "score": 7,
            "created_utc": 1631671355.0,
            "replies": [
                {
                    "body": "Nice review. What bothers me is that danzo could have killed sasuke with that curse marrk but sasuke noped out of it another kishi bs writing.",
                    "author": "steplaser",
                    "id": "hcwnbh7",
                    "parent_id": "t1_hcwetfu",
                    "score": 2,
                    "created_utc": 1631675499.0,
                    "replies": [
                        {
                            "body": "Yeah not many people in the world can break an MS user's genjutsu let alone counter it ftw but as you say he just screams it off and Danzo does his little soliloquy instead of just finishing it sooner lol very cliché writing. Still I'll acknowledge Danzo's ability to just brush that off and even taunt him. He's not a real Uchiha and really not even a genius. Has futon...that's actually it. He has no special abilities other than the ones he had to steal and just through sheer planning was able to even put up a fight with an actual reincarnation of a god Uchiha. He planned so long how to fight even the strongest of the Uchiha it's almost like he was prepping for Madara all along.",
                            "author": "1RonnieMund",
                            "id": "hcxx1dp",
                            "parent_id": "t1_hcwnbh7",
                            "score": 1,
                            "created_utc": 1631708463.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "kotoamatsukami :)",
            "author": "August_28th",
            "id": "hcv320c",
            "parent_id": "t1_hcuuic2",
            "score": 6,
            "created_utc": 1631650219.0,
            "replies": [
                {
                    "body": "Ahh I got it wrong then 😅 . Thanks for correcting",
                    "author": "Tarkik_Vatsa",
                    "id": "hcwmiwo",
                    "parent_id": "t1_hcv320c",
                    "score": 2,
                    "created_utc": 1631675092.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He's mangekyo is in video games only afaik and non Uchiha kakashi, with a single implemented normal sharingan was able to resist the tsukoyomi for a few seconds. So the likes of Sasuke who are pure Uchiha and have 2 eternal mangekyo are a totally different beast.",
            "author": "EliYafah",
            "id": "hcuxcdt",
            "parent_id": "t1_hcuuic2",
            "score": 1,
            "created_utc": 1631647968.0,
            "replies": []
        },
        {
            "body": "Shisui was basically Aizen so it could only be used very sparingly. So good to mind control people for you with no drawbacks.",
            "author": "ac714",
            "id": "hcuzj1l",
            "parent_id": "t1_hcuuic2",
            "score": 1,
            "created_utc": 1631648828.0,
            "replies": [
                {
                    "body": "Actually, his only drawback was that it used a lot of chakra and that it would blind him eventually. The time drawback was only for non uchiha users",
                    "author": "julio2399",
                    "id": "hcvxlv5",
                    "parent_id": "t1_hcuzj1l",
                    "score": 1,
                    "created_utc": 1631663464.0,
                    "replies": [
                        {
                            "body": "Wut? You’re not understanding the situation at all.\n\nThe guy can mind control…anyone. This includes other uchihas to use izanagi for his benefit, collect or create sharingans, and just straight up create an EMS solving the blindness issue.\n\nWe already know what a person can do with a kage in their pocket like Obito and Yagura so imagine having all the kages under your thumb. Hardly a stretch to accomplish given what we’ve been told.",
                            "author": "ac714",
                            "id": "hcvym8i",
                            "parent_id": "t1_hcvxlv5",
                            "score": 0,
                            "created_utc": 1631663947.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah would create a new evil arc and with shikimaru being like the dark side of the kage position that he is. he is quietly sending messages for intel with danzo. But I understand this is supposed to be muh next generation and danzo doesn't fit that but whatever.",
            "author": "Gizshot",
            "id": "hcuonbj",
            "parent_id": "t1_hcujlbd",
            "score": 4,
            "created_utc": 1631644556.0,
            "replies": [
                {
                    "body": "I mean, it could've turned out that he was actually an outer for Kara and that's how he was getting resources. Plus we know that people like Sumire's dad were still loyal to Danzo even after his death, so it's not a stretch to say that he'd have some spies in Konoha",
                    "author": "Tsynami",
                    "id": "hcupw7m",
                    "parent_id": "t1_hcuonbj",
                    "score": 2,
                    "created_utc": 1631645030.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, 99% of the shit that gets blamed on Danzo is from fillers, they were really making him into this evilest guy around\n\nWhen in reality, he was just ruthless and calculating\n\nHe might even have Sasuke-like background since we know that Danzo comes from the Shimura clan but the only thing we know about the Shimura clan is that Danzo's father and grandfather got killed on a battlefield so he might be the last member of his clan",
            "author": "HateshWarkio",
            "id": "hcuemqw",
            "parent_id": "t1_hcuapmk",
            "score": 12,
            "created_utc": 1631640528.0,
            "replies": []
        },
        {
            "body": "Anime filler yeah. Made him a cartoon villain to fill time.",
            "author": "1RonnieMund",
            "id": "hcvvuqz",
            "parent_id": "t1_hcuapmk",
            "score": 2,
            "created_utc": 1631662636.0,
            "replies": [
                {
                    "body": "Cartoon villains have more depth than whatever the hell the fillers were doing with Danzo",
                    "author": "HateshWarkio",
                    "id": "hd1jvxs",
                    "parent_id": "t1_hcvvuqz",
                    "score": 2,
                    "created_utc": 1631767380.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Doesn't make sense to support the stronger one if you want them to destroy each other",
            "author": "HateshWarkio",
            "id": "hcw4h3y",
            "parent_id": "t1_hcvw5ei",
            "score": 1,
            "created_utc": 1631666621.0,
            "replies": [
                {
                    "body": "He really wasn't supporting either of them only pretending to. The only real goal is to prevent the alliance.",
                    "author": "1RonnieMund",
                    "id": "hcxy9ti",
                    "parent_id": "t1_hcw4h3y",
                    "score": 1,
                    "created_utc": 1631709161.0,
                    "replies": [
                        {
                            "body": "He lent a lot of ninjas to Hanzo, that's a big support, especially considering that the Rain is not that big village in a quite small country so they have a limited number of ninjas",
                            "author": "HateshWarkio",
                            "id": "hcxzf02",
                            "parent_id": "t1_hcxy9ti",
                            "score": 1,
                            "created_utc": 1631709784.0,
                            "replies": [
                                {
                                    "body": "Again the goal remains the same.",
                                    "author": "1RonnieMund",
                                    "id": "hd2op9g",
                                    "parent_id": "t1_hcxzf02",
                                    "score": 1,
                                    "created_utc": 1631797717.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah",
            "author": "Starlight_Requiem_XD",
            "id": "hcvmftk",
            "parent_id": "t1_hcvden1",
            "score": 1,
            "created_utc": 1631658301.0,
            "replies": []
        },
        {
            "body": "Nice review. What bothers me is that danzo could have killed sasuke with that curse marrk but sasuke noped out of it another kishi bs writing.",
            "author": "steplaser",
            "id": "hcwnbh7",
            "parent_id": "t1_hcwetfu",
            "score": 2,
            "created_utc": 1631675499.0,
            "replies": [
                {
                    "body": "Yeah not many people in the world can break an MS user's genjutsu let alone counter it ftw but as you say he just screams it off and Danzo does his little soliloquy instead of just finishing it sooner lol very cliché writing. Still I'll acknowledge Danzo's ability to just brush that off and even taunt him. He's not a real Uchiha and really not even a genius. Has futon...that's actually it. He has no special abilities other than the ones he had to steal and just through sheer planning was able to even put up a fight with an actual reincarnation of a god Uchiha. He planned so long how to fight even the strongest of the Uchiha it's almost like he was prepping for Madara all along.",
                    "author": "1RonnieMund",
                    "id": "hcxx1dp",
                    "parent_id": "t1_hcwnbh7",
                    "score": 1,
                    "created_utc": 1631708463.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ahh I got it wrong then 😅 . Thanks for correcting",
            "author": "Tarkik_Vatsa",
            "id": "hcwmiwo",
            "parent_id": "t1_hcv320c",
            "score": 2,
            "created_utc": 1631675092.0,
            "replies": []
        },
        {
            "body": "Actually, his only drawback was that it used a lot of chakra and that it would blind him eventually. The time drawback was only for non uchiha users",
            "author": "julio2399",
            "id": "hcvxlv5",
            "parent_id": "t1_hcuzj1l",
            "score": 1,
            "created_utc": 1631663464.0,
            "replies": [
                {
                    "body": "Wut? You’re not understanding the situation at all.\n\nThe guy can mind control…anyone. This includes other uchihas to use izanagi for his benefit, collect or create sharingans, and just straight up create an EMS solving the blindness issue.\n\nWe already know what a person can do with a kage in their pocket like Obito and Yagura so imagine having all the kages under your thumb. Hardly a stretch to accomplish given what we’ve been told.",
                    "author": "ac714",
                    "id": "hcvym8i",
                    "parent_id": "t1_hcvxlv5",
                    "score": 0,
                    "created_utc": 1631663947.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean, it could've turned out that he was actually an outer for Kara and that's how he was getting resources. Plus we know that people like Sumire's dad were still loyal to Danzo even after his death, so it's not a stretch to say that he'd have some spies in Konoha",
            "author": "Tsynami",
            "id": "hcupw7m",
            "parent_id": "t1_hcuonbj",
            "score": 2,
            "created_utc": 1631645030.0,
            "replies": []
        },
        {
            "body": "Cartoon villains have more depth than whatever the hell the fillers were doing with Danzo",
            "author": "HateshWarkio",
            "id": "hd1jvxs",
            "parent_id": "t1_hcvvuqz",
            "score": 2,
            "created_utc": 1631767380.0,
            "replies": []
        },
        {
            "body": "He really wasn't supporting either of them only pretending to. The only real goal is to prevent the alliance.",
            "author": "1RonnieMund",
            "id": "hcxy9ti",
            "parent_id": "t1_hcw4h3y",
            "score": 1,
            "created_utc": 1631709161.0,
            "replies": [
                {
                    "body": "He lent a lot of ninjas to Hanzo, that's a big support, especially considering that the Rain is not that big village in a quite small country so they have a limited number of ninjas",
                    "author": "HateshWarkio",
                    "id": "hcxzf02",
                    "parent_id": "t1_hcxy9ti",
                    "score": 1,
                    "created_utc": 1631709784.0,
                    "replies": [
                        {
                            "body": "Again the goal remains the same.",
                            "author": "1RonnieMund",
                            "id": "hd2op9g",
                            "parent_id": "t1_hcxzf02",
                            "score": 1,
                            "created_utc": 1631797717.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah not many people in the world can break an MS user's genjutsu let alone counter it ftw but as you say he just screams it off and Danzo does his little soliloquy instead of just finishing it sooner lol very cliché writing. Still I'll acknowledge Danzo's ability to just brush that off and even taunt him. He's not a real Uchiha and really not even a genius. Has futon...that's actually it. He has no special abilities other than the ones he had to steal and just through sheer planning was able to even put up a fight with an actual reincarnation of a god Uchiha. He planned so long how to fight even the strongest of the Uchiha it's almost like he was prepping for Madara all along.",
            "author": "1RonnieMund",
            "id": "hcxx1dp",
            "parent_id": "t1_hcwnbh7",
            "score": 1,
            "created_utc": 1631708463.0,
            "replies": []
        },
        {
            "body": "Wut? You’re not understanding the situation at all.\n\nThe guy can mind control…anyone. This includes other uchihas to use izanagi for his benefit, collect or create sharingans, and just straight up create an EMS solving the blindness issue.\n\nWe already know what a person can do with a kage in their pocket like Obito and Yagura so imagine having all the kages under your thumb. Hardly a stretch to accomplish given what we’ve been told.",
            "author": "ac714",
            "id": "hcvym8i",
            "parent_id": "t1_hcvxlv5",
            "score": 0,
            "created_utc": 1631663947.0,
            "replies": []
        },
        {
            "body": "He lent a lot of ninjas to Hanzo, that's a big support, especially considering that the Rain is not that big village in a quite small country so they have a limited number of ninjas",
            "author": "HateshWarkio",
            "id": "hcxzf02",
            "parent_id": "t1_hcxy9ti",
            "score": 1,
            "created_utc": 1631709784.0,
            "replies": [
                {
                    "body": "Again the goal remains the same.",
                    "author": "1RonnieMund",
                    "id": "hd2op9g",
                    "parent_id": "t1_hcxzf02",
                    "score": 1,
                    "created_utc": 1631797717.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Again the goal remains the same.",
            "author": "1RonnieMund",
            "id": "hd2op9g",
            "parent_id": "t1_hcxzf02",
            "score": 1,
            "created_utc": 1631797717.0,
            "replies": []
        }
    ]
}