{
    "title": "My SD grossed me out and now I never want to see him again.",
    "post_id": "yqhr6a",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/yqhr6a/my_sd_grossed_me_out_and_now_i_never_want_to_see/",
    "author": "Inyoureyes_00",
    "body": "So I’ve been seeing this guy I meet off seeking for roughly 6 weeks. Allowance is decent, he’s super sweet and loves animals just like me however I feel he is too horny for me. I’ve been sugaring for about 2 years now and I pick and choose what I can tolerate and unfortunately he’s just not that tolerable due to his poor shape and overall appearance. However money is decent and personality is on point but he’s so hard to be around and literally takes up my entire afternoon. I just found out the reason he’s able to go non stop (like 3 hrs plus) is because he doesn’t lose his erection after ejaculation which is impressive… but not when you’re not pulling out. It’s disgusting I had no clue he was doing that the entire time and then he goes “it keeps lubrication” when I asked him if he’d been doing that the whole time without my permission just made me want to gag in that moment cause I don’t find him very attractive. I’m on birth control and we’re both clean but I still found that pretty gross. Plus he sweats way too much and wants me to cuddle with him in the sweat puddle. So gross to me the conversations are good until the sex comes. It makes me feel like I’m rather working a job I don’t want to work. He’s 52 years old and prob thought it would be okay to leave it in because he got fixed however it’s gross, it’s runny and made me feel icky. that just turned me completely off so now I’m debating on cutting him off and brainwashing him out of my memory but I’d feel bad cause he’s kind of obsessed With me in a way and it’s hard to find a sugar daddy that gives decent monthly allowance.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/yqhr6a/my_sd_grossed_me_out_and_now_i_never_want_to_see/",
    "score": 141,
    "upvote_ratio": 0.86,
    "created_utc": 1667997294.0,
    "num_comments": 108,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Life is too short to fuck people who gross you out. There's a better match out there for you somewhere, it's time to let this one go and find it.",
            "author": "roscoe7585",
            "id": "ivoddbi",
            "parent_id": "t3_yqhr6a",
            "score": 141,
            "created_utc": 1667998530.0,
            "replies": [
                {
                    "body": "What this guy said!",
                    "author": "MystressJessy",
                    "id": "ivohd7a",
                    "parent_id": "t1_ivoddbi",
                    "score": 10,
                    "created_utc": 1668000630.0,
                    "replies": []
                },
                {
                    "body": "A suggestion \n\nTry to imagine looking back on this in 20 years and think about how you will feel about the relationship.  Personal recommendation is that if you don't think you will assess the relationship as \" it was crazy but it was a good thing for me \"  it is probably time to say adios.  \n\nI'm probably far from alone in having met and dated wonderful women who were handicapped by the wounds of prior relationships to the extent that they had difficulty with relationships decades later. \n\nIt's  somewhat related to some of the best flying advice I ever received...\"Pinot, before doing something think about how stupid it might  sound in the accident report if it does not turn out well.\"\n\nThere's stuff that sounds dangerous but is really not and stuff that looks benign that is potentially very damaging",
                    "author": "pinotandsugar",
                    "id": "ivs2k6b",
                    "parent_id": "t1_ivoddbi",
                    "score": 0,
                    "created_utc": 1668055359.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You know what you need to do, you don’t need us to tell you.",
            "author": "BigPoppa3232",
            "id": "ivobfmh",
            "parent_id": "t3_yqhr6a",
            "score": 91,
            "created_utc": 1667997451.0,
            "replies": [
                {
                    "body": "Ik it’s just this small voice in the back of my head….",
                    "author": "Inyoureyes_00",
                    "id": "ivobo2v",
                    "parent_id": "t1_ivobfmh",
                    "score": 40,
                    "created_utc": 1667997585.0,
                    "replies": [
                        {
                            "body": "Always trust your gut.  Also, in the future, dont get into a SR with someone you don’t want to be with sexually.  Dont bring down your standards for money, it’s not worth it.",
                            "author": "BigPoppa3232",
                            "id": "ivobyd6",
                            "parent_id": "t1_ivobo2v",
                            "score": 66,
                            "created_utc": 1667997747.0,
                            "replies": []
                        },
                        {
                            "body": "Agree with all the other posters. If he’s grossing you out then move on. You’ll be able to find someone that attracts you unless you only like young guys. But plenty of SD are in their 30s",
                            "author": "SW1981",
                            "id": "ivprci1",
                            "parent_id": "t1_ivobo2v",
                            "score": 9,
                            "created_utc": 1668019404.0,
                            "replies": []
                        },
                        {
                            "body": "Babe. HE IS Icky AF. You deserve SO MUCH MORE! Straighten your 👑, you got this!",
                            "author": "Laciethewife",
                            "id": "ivoxpg0",
                            "parent_id": "t1_ivobo2v",
                            "score": 21,
                            "created_utc": 1668007809.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My first thought — what a skill, could that be priapism?, and then after thinking for a minute: he has an implant!",
            "author": "daddoms",
            "id": "ivod254",
            "parent_id": "t3_yqhr6a",
            "score": 58,
            "created_utc": 1667998361.0,
            "replies": [
                {
                    "body": "My ex had the same ability, he had his foot attached to his ballsack in utero and they had to do surgery. As a result, he's got half a nut, but can go for hours and still be hard even after 3 nuts.",
                    "author": "sbgonebroke",
                    "id": "ivonr55",
                    "parent_id": "t1_ivod254",
                    "score": 48,
                    "created_utc": 1668003633.0,
                    "replies": [
                        {
                            "body": "Can you please elaborate on this? because I’ve never read a combination of sentences and words quite like it.\n\nEdit: nvm I get it. I feel bad for being entertained by that, but I never knew a uterus could end up like that.",
                            "author": "Steelstrike309",
                            "id": "ivpcfpu",
                            "parent_id": "t1_ivonr55",
                            "score": 47,
                            "created_utc": 1668013649.0,
                            "replies": [
                                {
                                    "body": "Oh sorry! In simple terms, when my ex was born, he had somehow had his foot fused into his nuts. They did surgery. He has lopsided balls, but is a fuck champion as a result.",
                                    "author": "sbgonebroke",
                                    "id": "ivq04jl",
                                    "parent_id": "t1_ivpcfpu",
                                    "score": 24,
                                    "created_utc": 1668022840.0,
                                    "replies": []
                                },
                                {
                                    "body": "In utero, not a uterus. It means during pregnancy/gestation",
                                    "author": "BrownEyed-Susan",
                                    "id": "ivpg5qf",
                                    "parent_id": "t1_ivpcfpu",
                                    "score": 13,
                                    "created_utc": 1668015080.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "what",
                            "author": "_Duriel_1000_",
                            "id": "ivpqkqg",
                            "parent_id": "t1_ivonr55",
                            "score": 6,
                            "created_utc": 1668019100.0,
                            "replies": [
                                {
                                    "body": "ex was born with foot attached to his nuts. they did surgery, he's fine aside from lopsided balls and can bang for eternity",
                                    "author": "sbgonebroke",
                                    "id": "ivq08jw",
                                    "parent_id": "t1_ivpqkqg",
                                    "score": 9,
                                    "created_utc": 1668022884.0,
                                    "replies": [
                                        {
                                            "body": "> ex was born with foot attached to his nuts. \n\nnever heard of such a thing in my life",
                                            "author": "_Duriel_1000_",
                                            "id": "ivq287d",
                                            "parent_id": "t1_ivq08jw",
                                            "score": 8,
                                            "created_utc": 1668023652.0,
                                            "replies": [
                                                {
                                                    "body": "me neither frankly until him. was a helluva time when i was ovulating",
                                                    "author": "sbgonebroke",
                                                    "id": "ivqetuz",
                                                    "parent_id": "t1_ivq287d",
                                                    "score": 9,
                                                    "created_utc": 1668028447.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Not necessarily, my ex husband had the same thing, no implant, no surgery, just the way his junk works.   It came as quite the surprise.",
                    "author": "Akavinceblack",
                    "id": "ivpbubz",
                    "parent_id": "t1_ivod254",
                    "score": 9,
                    "created_utc": 1668013416.0,
                    "replies": []
                },
                {
                    "body": "Implants can be fun, if the guys with them are respectful + know how to properly use them. This guy clearly does not.",
                    "author": "curly_spice",
                    "id": "ivp5hz3",
                    "parent_id": "t1_ivod254",
                    "score": 12,
                    "created_utc": 1668010915.0,
                    "replies": [
                        {
                            "body": "Implants?",
                            "author": "SW1981",
                            "id": "ivpr30o",
                            "parent_id": "t1_ivp5hz3",
                            "score": 3,
                            "created_utc": 1668019301.0,
                            "replies": []
                        },
                        {
                            "body": "TIL!",
                            "author": "daddoms",
                            "id": "ivpd2if",
                            "parent_id": "t1_ivp5hz3",
                            "score": 2,
                            "created_utc": 1668013895.0,
                            "replies": []
                        },
                        {
                            "body": "> This guy clearly does not.\n\nhe got more bang for his buck... tf",
                            "author": "_Duriel_1000_",
                            "id": "ivpqoxf",
                            "parent_id": "t1_ivp5hz3",
                            "score": 0,
                            "created_utc": 1668019146.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Haha yeah an implant was my first thought",
                    "author": "whatsupmynameisSofia",
                    "id": "ivp9twu",
                    "parent_id": "t1_ivod254",
                    "score": 3,
                    "created_utc": 1668012634.0,
                    "replies": []
                },
                {
                    "body": "Naw, it's real... I can do it too.\n\nSometimes it sucks cuz you can't get dressed easily.",
                    "author": "itcouldbeme_3",
                    "id": "ivqf4xg",
                    "parent_id": "t1_ivod254",
                    "score": 2,
                    "created_utc": 1668028564.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Also the whole finishing instead of you, without telling you, even if it was my boyfriend … I would not be okay with that. \n\nOnce we established it was okay, then fine, but maybe it’s just me but I like to know when it’s happening. Just something intimate about it.. there for it to be a SD, without the discussion … ugh makes my skin crawl! \n\nAnd three hours?! Thirty minutes max my friend. Then we can go again. After some desert or another bottle of wine. I’m all for sex sesh weekends or full nights, where it’s all about sex but include a gorgeous skyline or view, and some take out, popping some bubbly, a break for another bottle of wine or dessert … it just doesn’t sound that fun. And it’s suppose to be fun right???",
            "author": "BlondieSamm",
            "id": "ivq8331",
            "parent_id": "t3_yqhr6a",
            "score": 17,
            "created_utc": 1668025877.0,
            "replies": []
        },
        {
            "body": "If you don't like the sex then it's probably a good idea not to continue. \n\nI can do maybe 30min, even 45min and I would be out. No way for 3 hours.",
            "author": "Majesticpork",
            "id": "ivp80yx",
            "parent_id": "t3_yqhr6a",
            "score": 30,
            "created_utc": 1668011926.0,
            "replies": []
        },
        {
            "body": "If he's not pulling out without your permission that should be a serious red flag. It means he doesn't care about your boundaries or what makes you comfortable. Cut him off",
            "author": "Leeper90",
            "id": "ivokctw",
            "parent_id": "t3_yqhr6a",
            "score": 62,
            "created_utc": 1668002077.0,
            "replies": [
                {
                    "body": "Woah! I mean this isn’t a red flag per se as long as she doesn’t mind him cumming inside her. Everyone has their own likes and dislikes and need to discuss between two people.",
                    "author": "daddoms",
                    "id": "ivoqxou",
                    "parent_id": "t1_ivokctw",
                    "score": -18,
                    "created_utc": 1668005013.0,
                    "replies": [
                        {
                            "body": "The fact he did it without her permission is where it's a red flag. If he respected her he would have asked and communicated it.",
                            "author": "Leeper90",
                            "id": "ivowvb2",
                            "parent_id": "t1_ivoqxou",
                            "score": 37,
                            "created_utc": 1668007470.0,
                            "replies": [
                                {
                                    "body": "There is no respect anywhere in this story. The whole thing is a red flag.",
                                    "author": "daddoms",
                                    "id": "ivoyhn9",
                                    "parent_id": "t1_ivowvb2",
                                    "score": 5,
                                    "created_utc": 1668008125.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I felt gross reading this. The fact he finishes inside you without telling you, or having had the discussion is a huge no no & enough to cut him off. Find a SD you’re attracted to, gives you an allowance that’s better than “decent” and wouldn’t mind good sex with.",
            "author": null,
            "id": "ivp3nx5",
            "parent_id": "t3_yqhr6a",
            "score": 25,
            "created_utc": 1668010181.0,
            "replies": []
        },
        {
            "body": "If you're not feeling it, you're not feeling it. Intimacy is never something you should dread. If you don't want to stay you shouldn't, it's unkind to both of you. \n\n\nThat said, sometimes compromise is possible. I was with this guy who would sweat buckets, BUCKETS! It was like going through the carwash with the top down. I lost count of the times I encouraged that man to drink some Gatorade and see a doctor. But he was a nice guy and willing to use towels sheets or whatever so I wouldn't feel like his throat lozenge. We could joke about it and he would help me shower after while saying very complimentary things. It wasn't perfect, but it worked.",
            "author": "Ripeness2282",
            "id": "ivoj62i",
            "parent_id": "t3_yqhr6a",
            "score": 18,
            "created_utc": 1668001518.0,
            "replies": []
        },
        {
            "body": "I’d guess he’s taking viagra.  Is this his first SR?",
            "author": "Loves2Boat",
            "id": "ivodqht",
            "parent_id": "t3_yqhr6a",
            "score": 19,
            "created_utc": 1667998729.0,
            "replies": []
        },
        {
            "body": "Ok. Been with him 6 weeks and just found out that he's not pulling out? Question, 🤔 ❓️ how could you not know? Anyway if he's not for you, move on",
            "author": "Automatic_Joke_4414",
            "id": "ivp2ic7",
            "parent_id": "t3_yqhr6a",
            "score": 13,
            "created_utc": 1668009718.0,
            "replies": []
        },
        {
            "body": "To all those wondering how I didn’t “know” not to put my business out there but I get very very wet when I’m aroused. I never denied the fact that he could not turn me on what’s so ever but he did gross me out once i made that discovery He is a 52 year old man with a vasectomy his semen is literally clear and he shoots out the smallest amount at a time it had to build up for me to finally notice it isn’t just my lubrication. Either way to the rejected sugar daddies don’t project your feelings onto me. It’s gross cumming inside a woman with no warning period, fertile or not it’s far from sanitary and messes with your PH. This man and I discussed this through text I literally broke it down to him when he asked why when he first met so he knows I didn’t want his semen in me. If that wasn’t the case I wouldn’t feel grossed out and violated. How about instead of pointing fingers and assuming I’m financially hurting and desperate put yourself in a women’s shoes. It’s more than disrespect what that creep did to me doesn’t matter how you put it. It did nothing but remind me that how i felt didn’t matter. He’s able to control himself and chose not to so for that very reason I’m disgusted and want nothing else to do with him. I’m a people’s pleaser unintentionally due to being raped in several ways several times in my adolescent years (this also explains my ability to disassociate so well) It’s not always easy for me to confront people about their wrong doings cause somewhere in my head I feel like I’ve done something wrong. So i just blocked him and won’t be speaking to him again Hence why I got on here to vent about it but I do appreciate all women backing me and to the salty daddies how’s about try not to be so gross. It doesn’t matter if you’re paying for it, I was pushing it by letting him in without a condom because he provided updated paper work prior to us meeting. That was my silly mistake but I can’t control how that sick creep translated clean results and birth control = cum inside 🤢",
            "author": "Inyoureyes_00",
            "id": "ivpmsqe",
            "parent_id": "t3_yqhr6a",
            "score": 17,
            "created_utc": 1668017632.0,
            "replies": [
                {
                    "body": "I’m really sorry about your experience. You can message me if you would like some support. We have some similarities in our story as of late. You’re not wrong in your thinking and it messing up your ph and other bodily functions. The dissociation is something only those who do this understand. Being a woman and allowing someone into our temples is hard enough without all of the added compelities. The reason for the why we are doing it doesn’t matter- we are still allowed to feel these emotions and when we vent them we are\nNot necessarily looking for advice/instructions but rather acknowledgment of being heard and not alone in such experiences. Sending you love and light 🕊",
                    "author": "BellJar_Blues",
                    "id": "ivpxyu9",
                    "parent_id": "t1_ivpmsqe",
                    "score": 5,
                    "created_utc": 1668021989.0,
                    "replies": [
                        {
                            "body": "Yeah, men aren't great at providing empathy.",
                            "author": "SDinAsia",
                            "id": "ivqcot3",
                            "parent_id": "t1_ivpxyu9",
                            "score": 5,
                            "created_utc": 1668027631.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Always ask toaster strudel or twinkee \n\nIn all seriousness run",
            "author": "ifxnj",
            "id": "ivpmlh5",
            "parent_id": "t3_yqhr6a",
            "score": 7,
            "created_utc": 1668017552.0,
            "replies": []
        },
        {
            "body": "Are we ignoring that this dude is violating OP?? Just bc she’s protected from pregnancy doesn’t make this okay….it’s unconsensual sex. \n\nThis guy is a fucking creep for doing that, I’m sorry. I think it’s best to leave for many reasons",
            "author": "c0rnstarr",
            "id": "ivp6fi4",
            "parent_id": "t3_yqhr6a",
            "score": 18,
            "created_utc": 1668011287.0,
            "replies": [
                {
                    "body": "He stayed hard and kept going. That’s why I didn’t know.",
                    "author": "Inyoureyes_00",
                    "id": "ivpoj5w",
                    "parent_id": "t1_ivp6fi4",
                    "score": 5,
                    "created_utc": 1668018303.0,
                    "replies": [
                        {
                            "body": "That’s wild, it’s not your fault for not knowing. He should have communicated with you",
                            "author": "c0rnstarr",
                            "id": "ivpptyq",
                            "parent_id": "t1_ivpoj5w",
                            "score": 5,
                            "created_utc": 1668018810.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It depends if they have had a talk about if he could finish in her.",
                    "author": "MrRhoarke",
                    "id": "ivpgvyd",
                    "parent_id": "t1_ivp6fi4",
                    "score": 2,
                    "created_utc": 1668015358.0,
                    "replies": [
                        {
                            "body": "OP said she had no clue that he was doing it that entire time",
                            "author": "c0rnstarr",
                            "id": "ivpjwnu",
                            "parent_id": "t1_ivpgvyd",
                            "score": 3,
                            "created_utc": 1668016506.0,
                            "replies": [
                                {
                                    "body": "The issue with the way it was posted is that we can't say if it was that she had no clue he was orgasming in her, or if he stayed hard after orgasm and just kept on going.",
                                    "author": "MrRhoarke",
                                    "id": "ivpo9u4",
                                    "parent_id": "t1_ivpjwnu",
                                    "score": 3,
                                    "created_utc": 1668018203.0,
                                    "replies": [
                                        {
                                            "body": "She said he had been doing it the whole time without her permission",
                                            "author": "c0rnstarr",
                                            "id": "ivpok6x",
                                            "parent_id": "t1_ivpo9u4",
                                            "score": 4,
                                            "created_utc": 1668018313.0,
                                            "replies": [
                                                {
                                                    "body": "my bad.  I reread it and see where I oopsed.",
                                                    "author": "MrRhoarke",
                                                    "id": "ivpphk9",
                                                    "parent_id": "t1_ivpok6x",
                                                    "score": 3,
                                                    "created_utc": 1668018675.0,
                                                    "replies": [
                                                        {
                                                            "body": "All good, I can’t copy and paste on my phone lol otherwise I would’ve",
                                                            "author": "c0rnstarr",
                                                            "id": "ivppprk",
                                                            "parent_id": "t1_ivpphk9",
                                                            "score": 3,
                                                            "created_utc": 1668018763.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "YUCK girl I felt sick just reading this. Gross nothing worse than the ones that keep going for ages... except what you just described.\n\nAm I understanding that he's cumming in you without your consent? Like you told him to pull out? Cos that's assault. \n\nIdk how you can put up with it for 3 hrs, you must be a master at dissociation. \n\nI say it's not worth any amount of money.",
            "author": "Esotericccca",
            "id": "ivoks2f",
            "parent_id": "t3_yqhr6a",
            "score": 18,
            "created_utc": 1668002275.0,
            "replies": [
                {
                    "body": "\"you must be a master at dissociation\". Lol. I also thought that when I read it. Which makes sense she is just putting it all together just now. OP...i am glad you wrote this to vent to people willing to listen. We feel your pain. Do what you need to do to keep your sanity. No average normie is going to listen to this vent without puking so I am glad we are here for you to listen to the vents.",
                    "author": null,
                    "id": "ivpftjo",
                    "parent_id": "t1_ivoks2f",
                    "score": 4,
                    "created_utc": 1668014953.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well you grossed out your grossed out I get that. I am confused with the fact that him ejaculating in you is fine but your grossed out he keeps fucking you after he ejaculates? \nQuestion to other SB, imagine a guy you like and actually attracted to does this. Does that fact gross you out? I often fuck a girl I’m with multiple times and each time I’m cumming in her. I didn’t know this was a bad thing.",
            "author": "SW1981",
            "id": "ivop38p",
            "parent_id": "t3_yqhr6a",
            "score": 9,
            "created_utc": 1668004216.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ivp94qk",
                    "parent_id": "t1_ivop38p",
                    "score": 8,
                    "created_utc": 1668012362.0,
                    "replies": [
                        {
                            "body": "Yeah I get the OP is grossed out for other reason and for this specific reason as well. I’m asking other SB opinion based on a scenario that it’s with someone they are sexually attracted too",
                            "author": "SW1981",
                            "id": "ivpqw99",
                            "parent_id": "t1_ivp94qk",
                            "score": 2,
                            "created_utc": 1668019226.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "“he’s just not that tolerable due to his poor shape and overall appearance. However money is decent and personality is on point but he’s so hard to be around and literally takes up my entire afternoon”\n\nMost genuine civilian SBs will not indulge with such guys! Clearly sweaty fat dude is paying the fugly premium tax to sugar.",
            "author": null,
            "id": "ivojiqq",
            "parent_id": "t3_yqhr6a",
            "score": 12,
            "created_utc": 1668001687.0,
            "replies": []
        },
        {
            "body": "Hang on, you’re not using condoms is that right?  He’s inside for 3 hours having cum without a condom on??\n\nAnd you say you ‘pick and choose what I can tolerate’ sounds like this is a job for you, and not a pleasant one. You sure you should be doing this??",
            "author": null,
            "id": "ivp01vg",
            "parent_id": "t3_yqhr6a",
            "score": 7,
            "created_utc": 1668008747.0,
            "replies": []
        },
        {
            "body": "Someone cumming in you without consent is a violation of a serious boundary.\n\nDon’t blame you for being grossed out at all. It happened to me once in the vanilla dating scene and it really did bother me for a long time after that. I felt so vile. I’m sorry that happened to you.",
            "author": "EssenceOfAphrodite",
            "id": "ivqcz5v",
            "parent_id": "t3_yqhr6a",
            "score": 9,
            "created_utc": 1668027740.0,
            "replies": []
        },
        {
            "body": "IMO, good sex should be messy and sweaty. But of course you're not me and you have your own preferences.",
            "author": "gaxxzz",
            "id": "ivon3cg",
            "parent_id": "t3_yqhr6a",
            "score": 11,
            "created_utc": 1668003338.0,
            "replies": [
                {
                    "body": "i dont think its about that for OP… he didnt inform her of what he was doing. he should of def discussed before. plus they are just not attracted to him which can overall create disgust blinders and everything about that person annoys them.",
                    "author": "Stickicky69",
                    "id": "ivpxacn",
                    "parent_id": "t1_ivon3cg",
                    "score": 6,
                    "created_utc": 1668021722.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I felt most disgusted with you ALLOWING him to raw dog you. You said you’re both clean , but if he’s having sex with you without a condom then he’s definitely doing that with every SB he sleeps with.. please stop doing this and practice safe sex for your own well being.",
            "author": "Background_Lychee713",
            "id": "ivp9dua",
            "parent_id": "t3_yqhr6a",
            "score": 8,
            "created_utc": 1668012461.0,
            "replies": [
                {
                    "body": "You literally blanked out everything Nd responded to a bit of my post if you can’t even take the time to read the post I’d advise to not comment. The point is he came in me without my permission. Me standing the chance of catching an std would have been on me because that’s what I consented to. Plz Stay on topic you’re dizzy as fuck 😩",
                    "author": "Inyoureyes_00",
                    "id": "ivq3j9w",
                    "parent_id": "t1_ivp9dua",
                    "score": 2,
                    "created_utc": 1668024154.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s not just a red flag, it’s literally illegal, you never consented to that part of the deal, imagine if you weren’t on birth control, he’s so fucking creepy and disgusting, may God break his back and paralyze him",
            "author": "No-Attention-2594",
            "id": "ivpub3g",
            "parent_id": "t3_yqhr6a",
            "score": 6,
            "created_utc": 1668020546.0,
            "replies": []
        },
        {
            "body": "Run baby, run.",
            "author": "lizardjizz",
            "id": "ivpeqls",
            "parent_id": "t3_yqhr6a",
            "score": 2,
            "created_utc": 1668014541.0,
            "replies": []
        },
        {
            "body": "I take it he’s not wearing condoms?",
            "author": "mikemac51973",
            "id": "ivpvl3f",
            "parent_id": "t3_yqhr6a",
            "score": 1,
            "created_utc": 1668021047.0,
            "replies": [
                {
                    "body": "I take it as you didn’t read the post and you also think cumming inside is okay just because there’s no condom. He didn’t have permission. Point. blank. The end.",
                    "author": "Inyoureyes_00",
                    "id": "ivpvtsy",
                    "parent_id": "t1_ivpvl3f",
                    "score": -1,
                    "created_utc": 1668021144.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The problem with sugar daddies is you guys  think sex shouldn’t have limitations just because you’re paying. Why not work it out with your wife or find a chick your age to be as wreckless as you want with your sexual behaviors. Sugar babies are to be cherished. Not degraded. Why not just be respectful? If there was absolutely nothing wrong with you as a man why are you paying in the first place? Think about it I know this is a ego buster but If you were truly desired enough then why pay to sleep with someone young and hot? Sugaring is more beneficial to men than it is to women. Get it through your old wrinkly ass head. Not one female (whose young and hot)  wants to sit around an old creep just to do it. Lmaooo it’s the entitlement you gross fucks feel. Believe me this will be my last time sugaring.",
            "author": "Inyoureyes_00",
            "id": "ivpqgp1",
            "parent_id": "t3_yqhr6a",
            "score": 5,
            "created_utc": 1668019056.0,
            "replies": [
                {
                    "body": "It's your right, I mean it's not like no one will take your place, but we've cherished our first babies and been mistreated and disrespected too. Just because one guy was disrespectful to you means we're all assholes? cause we're not. But if you were doing it with a guy you appreciated, none of this would be a problem. He's fixed, so what if you get cum inside, what about precum is that gross?",
                    "author": "sugardad123",
                    "id": "ivqatu4",
                    "parent_id": "t1_ivpqgp1",
                    "score": 2,
                    "created_utc": 1668026927.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So you are sticking because of money. C'mon,have some self respect and dump this gross pig.\n\nBTW, he stays erect because he injects his penis with prostaglandins.",
            "author": "GSSD",
            "id": "ivomxbo",
            "parent_id": "t3_yqhr6a",
            "score": 4,
            "created_utc": 1668003262.0,
            "replies": []
        },
        {
            "body": "A relationship works both ways, sugar or not. You have to take some responsibility ob it as well. \nFrom what you described there are ways to circumvent. If he is sweaty after sex, taking him for a shower together and finish it with some massage. Talk to him about using a condom or discuss with him about cunning inside you, and be creative you can ask him to cum ob your tits or if you like, swallow his seed. This can be very arousal. \nUse your wit and make it work. A nice allowance is not un abundance. Trust you can make it work.",
            "author": "gapaf",
            "id": "ivou4zl",
            "parent_id": "t3_yqhr6a",
            "score": 4,
            "created_utc": 1668006361.0,
            "replies": []
        },
        {
            "body": ">I’m debating on cutting him off\n\nThis is why you don't sugar if you're financially desperate",
            "author": null,
            "id": "ivoqhgt",
            "parent_id": "t3_yqhr6a",
            "score": 3,
            "created_utc": 1668004820.0,
            "replies": [
                {
                    "body": "this this this. i firmly believe all sex work shouldn't be started out of desperation because it will cause a person to ditch their morals and boundaries.",
                    "author": "thegeniuswhore",
                    "id": "ivpb24m",
                    "parent_id": "t1_ivoqhgt",
                    "score": 5,
                    "created_utc": 1668013109.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So he's been going in you without your consent? That's assault.",
            "author": "urgoodgirl93",
            "id": "ivp1w7z",
            "parent_id": "t3_yqhr6a",
            "score": 4,
            "created_utc": 1668009474.0,
            "replies": [
                {
                    "body": "Yuuuuup why is no one bringing THIS part up lol",
                    "author": "c0rnstarr",
                    "id": "ivp6z8q",
                    "parent_id": "t1_ivp1w7z",
                    "score": 9,
                    "created_utc": 1668011506.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Are you not using protection ?",
            "author": "polycat28",
            "id": "ivpzjj8",
            "parent_id": "t3_yqhr6a",
            "score": 2,
            "created_utc": 1668022610.0,
            "replies": []
        },
        {
            "body": "Id leave because strong disgust isn’t something you should endure - but I also wouldnt find it to be a huge betrayal if you already allow him to cum in you. \n\nBut maybe it is - I mean over months, unless there was terrible sexual communication, how could it not come up?  Maybe because he wants to do this and thought he should be sly at first",
            "author": "JDMultralight",
            "id": "ivpe3g1",
            "parent_id": "t3_yqhr6a",
            "score": 2,
            "created_utc": 1668014294.0,
            "replies": []
        },
        {
            "body": "You know he deserves to be with someone who wants him too, I would  fucking hate to fuck a girl and find her complaining in a public forum, just end the arrangement if you're grossed. It's so stupid to do this for cash, what a waste of everyone's time and energy. \n\nI bet you told him it was only one round per meet and that's it, that's why he does that, relax the rules a little, and do this with someone you actually want!",
            "author": "sugardad123",
            "id": "ivozgdo",
            "parent_id": "t3_yqhr6a",
            "score": 2,
            "created_utc": 1668008510.0,
            "replies": [
                {
                    "body": "I'm sorry, I lold. \nAlso, isn't the cash the whole reason?",
                    "author": "Quick-Adhesiveness-2",
                    "id": "ivp2o5l",
                    "parent_id": "t1_ivozgdo",
                    "score": 10,
                    "created_utc": 1668009783.0,
                    "replies": []
                },
                {
                    "body": "lol. yeah, sure.",
                    "author": null,
                    "id": "ivpfwuk",
                    "parent_id": "t1_ivozgdo",
                    "score": 4,
                    "created_utc": 1668014988.0,
                    "replies": []
                },
                {
                    "body": "Are you fucking serious, this guy has been violating her for weeks now. It’s unconsensual sex. What this guy “deserves” is to be castrated good night",
                    "author": "c0rnstarr",
                    "id": "ivp6ufh",
                    "parent_id": "t1_ivozgdo",
                    "score": 9,
                    "created_utc": 1668011452.0,
                    "replies": [
                        {
                            "body": "No it's not, it's like saying to a man you can only cum with the left nut, how castrating is that!?? Is there no end to toxic feminity?",
                            "author": "sugardad123",
                            "id": "ivpgjs2",
                            "parent_id": "t1_ivp6ufh",
                            "score": -11,
                            "created_utc": 1668015231.0,
                            "replies": [
                                {
                                    "body": "I’m dying lol “toxic femininity” \n\nOP said she had no idea he was nutting in her that whole time. That is sexual assault. Period",
                                    "author": "c0rnstarr",
                                    "id": "ivpk77v",
                                    "parent_id": "t1_ivpgjs2",
                                    "score": 12,
                                    "created_utc": 1668016619.0,
                                    "replies": [
                                        {
                                            "body": "No, she wrote she 'tolerated' it because he's fixed and they are both clean. It's learning that he cums multiple time that's grossed her out. \n\nHow would it be possible that she let's him rawdog her, and he never cums? Clearly she was okay with one shot of cum, or at least precum.\n\nIf you ask me, this SB is full of cum, I mean shit.",
                                            "author": "sugardad123",
                                            "id": "ivpn38d",
                                            "parent_id": "t1_ivpk77v",
                                            "score": -3,
                                            "created_utc": 1668017745.0,
                                            "replies": [
                                                {
                                                    "body": "Read it again dude",
                                                    "author": "c0rnstarr",
                                                    "id": "ivpnb72",
                                                    "parent_id": "t1_ivpn38d",
                                                    "score": 11,
                                                    "created_utc": 1668017830.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "OP clarifies it in other comments. They discussed the topic over text and she was clear about her boundaries. He was not to come inside her. He did anyway. He kept going because he was still hard, so she didn’t figure it out until afterward.",
                                                    "author": "PlugItWithaBeer",
                                                    "id": "ivpu6m0",
                                                    "parent_id": "t1_ivpn38d",
                                                    "score": 11,
                                                    "created_utc": 1668020497.0,
                                                    "replies": [
                                                        {
                                                            "body": "Right. It sounded like an ongoing habit when I read it at first but that she was okay with one load. \n\nIs not cool what he did then, and it's even against the law where I live, it's a form of stealthing at least.",
                                                            "author": "sugardad123",
                                                            "id": "ivq8d07",
                                                            "parent_id": "t1_ivpu6m0",
                                                            "score": 4,
                                                            "created_utc": 1668025982.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Homie has been coming inside of her without her knowledge. Doing anything sexual with out full and complete consent is sexual assault. \n\nEnd. Of. Discussion.",
                                                    "author": "GlitterAndSugar",
                                                    "id": "ivptjps",
                                                    "parent_id": "t1_ivpn38d",
                                                    "score": 9,
                                                    "created_utc": 1668020254.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I agree. I'm sure he'll have no problem finding another SB that'll be glad to have him.",
                    "author": "Automatic_Joke_4414",
                    "id": "ivp3woi",
                    "parent_id": "t1_ivozgdo",
                    "score": 3,
                    "created_utc": 1668010278.0,
                    "replies": [
                        {
                            "body": "I love the daddies rallying behind other daddies. As if some of you all aren't gross af.",
                            "author": null,
                            "id": "ivpg44j",
                            "parent_id": "t1_ivp3woi",
                            "score": 16,
                            "created_utc": 1668015063.0,
                            "replies": [
                                {
                                    "body": "Gross are in the eyes of the beholder.",
                                    "author": "Automatic_Joke_4414",
                                    "id": "ivpnqcq",
                                    "parent_id": "t1_ivpg44j",
                                    "score": -2,
                                    "created_utc": 1668017994.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "wtf? \"I want to leave but I like the money\"- then dont fucking leave. Or leave. \n\nAnd you are one of the first women Ive read to not be able to feel cum inside as a man ejaculates. \n\nIf hes been going in raw, regardless of full ejaculkation, there is always precum or small cum. \n\nThis post cant be serious.",
            "author": "_Duriel_1000_",
            "id": "ivpqf6b",
            "parent_id": "t3_yqhr6a",
            "score": 0,
            "created_utc": 1668019039.0,
            "replies": []
        },
        {
            "body": "It’s not about how long it took for me to realize it. It’s the fact that he did it. It’s the narcissism for me 🤢 Like no my feelings are valid as fuck, doesn’t matter if you can relate or not. Dont try to tell me how I should feel. Or make me feel shitty. This was a personal experience for me that made me uncomfortable.",
            "author": "Inyoureyes_00",
            "id": "ivpob24",
            "parent_id": "t3_yqhr6a",
            "score": 1,
            "created_utc": 1668018215.0,
            "replies": []
        },
        {
            "body": "Just to clarify OP, you were willing to go raw but you did tell him ahead of time not to cum in you, right?\n\nIn that case, obviously the man is wrong.\n\nBut it's also kind of a weird boundary, does anyone else think so?",
            "author": "SDinAsia",
            "id": "ivq7y5y",
            "parent_id": "t3_yqhr6a",
            "score": 1,
            "created_utc": 1668025825.0,
            "replies": []
        },
        {
            "body": "If you don't find him attractive, why are you even sleeping with him? No amount of $$ would make me sleep with someone, let alone bareback......",
            "author": "Richb70",
            "id": "ivq3al7",
            "parent_id": "t3_yqhr6a",
            "score": -1,
            "created_utc": 1668024062.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "ivq50id",
                    "parent_id": "t1_ivq3al7",
                    "score": -2,
                    "created_utc": 1668024719.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "ivq5mo5",
                            "parent_id": "t1_ivq50id",
                            "score": 2,
                            "created_utc": 1668024953.0,
                            "replies": [
                                {
                                    "body": "Rule #1: Remember the human\n\nBe respectful to other posters. No name calling, personal attacks, etc. We are all humans here.",
                                    "author": "sugarlifestyleforum-ModTeam",
                                    "id": "ivqbxar",
                                    "parent_id": "t1_ivq5mo5",
                                    "score": 3,
                                    "created_utc": 1668027341.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There’s always going to be someone better and richer out there.",
            "author": "kandiikittenx",
            "id": "ivow4jg",
            "parent_id": "t3_yqhr6a",
            "score": 0,
            "created_utc": 1668007174.0,
            "replies": []
        },
        {
            "body": "Regardless if you’re on the pill and he’s fixed, cumming inside of you is a big deal, especially without your permission. That is so odd to me that he never mentioned it to you. It would gross me out, someone doing it without my permission. It’s just super intimate.",
            "author": "BlondieSamm",
            "id": "ivpi4d0",
            "parent_id": "t3_yqhr6a",
            "score": 3,
            "created_utc": 1668015828.0,
            "replies": []
        },
        {
            "body": "Yeah I’ll tweak the thermostat setting just a little just to ensure we get good and sweaty. Nothing like the feel of sweaty skin on skin.\n\nBut you don’t like this guy, so end it already. If it were me I’d *want* you to dump me. This is why I won’t make arrangements with girls who would become dependent on me. I like to believe she’s with me because she likes me and could afford to dump me if she didn’t. \n\nWhat’s the point of having sex without a condom if he can’t come inside you? Did you actually *tell* him he had to pull out? I mean he’s had a vasectomy *and*\nyou’re on BC so…",
            "author": "Stickley1",
            "id": "ivovj5f",
            "parent_id": "t3_yqhr6a",
            "score": -5,
            "created_utc": 1668006937.0,
            "replies": [
                {
                    "body": "If you’re not an animal, surely you’re capable of asking the lady ahead of time before you come inside her.",
                    "author": "paroxysmique",
                    "id": "ivp4ou6",
                    "parent_id": "t1_ivovj5f",
                    "score": 3,
                    "created_utc": 1668010590.0,
                    "replies": [
                        {
                            "body": "I guess I’m an animal. Whenever I’ve had sex with any woman without a condom (which was done with free consent and full discussion ahead of time — no surprises, no “stealthing,” knowing that I’ve had a vasectomy, yadda yadda) it was assumed that that, of course, meant I was coming inside her. They seem to assume it’s happening. None have ever been surprised when I came inside her. Nobody ever said, “what? You came inside me?”\n\nDo you seriously assume he’s pulling out, by default, if you’ve had this discussion about sex without a condom with a vasectomied SD?\n\nPoint well taken I guess. The next time I have this discussion with a new girl (hopefully not anytime soon, knock on wood, because I’m very happy with the current SB) I’ll make it crystal clear that sex without a condom means I’m coming inside her.",
                            "author": "Stickley1",
                            "id": "ivpawnv",
                            "parent_id": "t1_ivp4ou6",
                            "score": 0,
                            "created_utc": 1668013050.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Gross.",
                    "author": null,
                    "id": "ivox9l7",
                    "parent_id": "t1_ivovj5f",
                    "score": 5,
                    "created_utc": 1668007631.0,
                    "replies": []
                },
                {
                    "body": "Idk man I’m with her… vasectomy jizz is just something else entirely. My SD is 52 and maybe it’s just his but It’s watery, irritates my skin, AND stains my sheets. I made my SD switch to wearing condoms cuz it’s just that much of an issue",
                    "author": "ExcellentSherbet3178",
                    "id": "ivp5z7s",
                    "parent_id": "t1_ivovj5f",
                    "score": 3,
                    "created_utc": 1668011106.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You didn’t feel the wetness from the cum?! Ugh so gross and sorry you’re dealing with that 🥹",
            "author": "Unlikely_Garbage_861",
            "id": "ivp2mkv",
            "parent_id": "t3_yqhr6a",
            "score": 0,
            "created_utc": 1668009765.0,
            "replies": []
        },
        {
            "body": "Ive heard accounts of this ability a bunch of times - been able to do it myself for the first time a month or so ago.  The unifying thread was that the guys were Filipino.  Since I live in an area with a high Filipino population, this is possibly small sample error.",
            "author": "JDMultralight",
            "id": "ivpd56q",
            "parent_id": "t3_yqhr6a",
            "score": 0,
            "created_utc": 1668013925.0,
            "replies": [
                {
                    "body": "When I was younger, I was this way.",
                    "author": "MrRhoarke",
                    "id": "ivpgnhb",
                    "parent_id": "t1_ivpd56q",
                    "score": 1,
                    "created_utc": 1668015270.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Replace his Viagra with sugar pills and your problem will be solved.",
            "author": "ChapterRelative",
            "id": "ivpyq0f",
            "parent_id": "t3_yqhr6a",
            "score": 0,
            "created_utc": 1668022285.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ivowunw",
            "parent_id": "t3_yqhr6a",
            "score": 0,
            "created_utc": 1668007463.0,
            "replies": [
                {
                    "body": "Rule #4: No \"value for money\" discussion\n\nDiscussions about how to get the most value for your money are not allowed. Posts asking for or assigning a monetary value to sexual acts are not allowed. **Assigning a monetary worth to individuals based on race, age, size,looks, etc., are not allowed.** Posts about how much allowance/ppm to ask for, give, is average, for such and such area or situation, are no longer be allowed on SLF. Any posts with dollar amounts that are in reference to PPMs and/or allowances are no longer allowed.\n\nAlso see the [Allowance Master Thread](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/).",
                    "author": "sugarlifestyleforum-ModTeam",
                    "id": "ivozh6m",
                    "parent_id": "t1_ivowunw",
                    "score": 1,
                    "created_utc": 1668008519.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What this guy said!",
            "author": "MystressJessy",
            "id": "ivohd7a",
            "parent_id": "t1_ivoddbi",
            "score": 10,
            "created_utc": 1668000630.0,
            "replies": []
        },
        {
            "body": "A suggestion \n\nTry to imagine looking back on this in 20 years and think about how you will feel about the relationship.  Personal recommendation is that if you don't think you will assess the relationship as \" it was crazy but it was a good thing for me \"  it is probably time to say adios.  \n\nI'm probably far from alone in having met and dated wonderful women who were handicapped by the wounds of prior relationships to the extent that they had difficulty with relationships decades later. \n\nIt's  somewhat related to some of the best flying advice I ever received...\"Pinot, before doing something think about how stupid it might  sound in the accident report if it does not turn out well.\"\n\nThere's stuff that sounds dangerous but is really not and stuff that looks benign that is potentially very damaging",
            "author": "pinotandsugar",
            "id": "ivs2k6b",
            "parent_id": "t1_ivoddbi",
            "score": 0,
            "created_utc": 1668055359.0,
            "replies": []
        },
        {
            "body": "Ik it’s just this small voice in the back of my head….",
            "author": "Inyoureyes_00",
            "id": "ivobo2v",
            "parent_id": "t1_ivobfmh",
            "score": 40,
            "created_utc": 1667997585.0,
            "replies": [
                {
                    "body": "Always trust your gut.  Also, in the future, dont get into a SR with someone you don’t want to be with sexually.  Dont bring down your standards for money, it’s not worth it.",
                    "author": "BigPoppa3232",
                    "id": "ivobyd6",
                    "parent_id": "t1_ivobo2v",
                    "score": 66,
                    "created_utc": 1667997747.0,
                    "replies": []
                },
                {
                    "body": "Agree with all the other posters. If he’s grossing you out then move on. You’ll be able to find someone that attracts you unless you only like young guys. But plenty of SD are in their 30s",
                    "author": "SW1981",
                    "id": "ivprci1",
                    "parent_id": "t1_ivobo2v",
                    "score": 9,
                    "created_utc": 1668019404.0,
                    "replies": []
                },
                {
                    "body": "Babe. HE IS Icky AF. You deserve SO MUCH MORE! Straighten your 👑, you got this!",
                    "author": "Laciethewife",
                    "id": "ivoxpg0",
                    "parent_id": "t1_ivobo2v",
                    "score": 21,
                    "created_utc": 1668007809.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My ex had the same ability, he had his foot attached to his ballsack in utero and they had to do surgery. As a result, he's got half a nut, but can go for hours and still be hard even after 3 nuts.",
            "author": "sbgonebroke",
            "id": "ivonr55",
            "parent_id": "t1_ivod254",
            "score": 48,
            "created_utc": 1668003633.0,
            "replies": [
                {
                    "body": "Can you please elaborate on this? because I’ve never read a combination of sentences and words quite like it.\n\nEdit: nvm I get it. I feel bad for being entertained by that, but I never knew a uterus could end up like that.",
                    "author": "Steelstrike309",
                    "id": "ivpcfpu",
                    "parent_id": "t1_ivonr55",
                    "score": 47,
                    "created_utc": 1668013649.0,
                    "replies": [
                        {
                            "body": "Oh sorry! In simple terms, when my ex was born, he had somehow had his foot fused into his nuts. They did surgery. He has lopsided balls, but is a fuck champion as a result.",
                            "author": "sbgonebroke",
                            "id": "ivq04jl",
                            "parent_id": "t1_ivpcfpu",
                            "score": 24,
                            "created_utc": 1668022840.0,
                            "replies": []
                        },
                        {
                            "body": "In utero, not a uterus. It means during pregnancy/gestation",
                            "author": "BrownEyed-Susan",
                            "id": "ivpg5qf",
                            "parent_id": "t1_ivpcfpu",
                            "score": 13,
                            "created_utc": 1668015080.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "what",
                    "author": "_Duriel_1000_",
                    "id": "ivpqkqg",
                    "parent_id": "t1_ivonr55",
                    "score": 6,
                    "created_utc": 1668019100.0,
                    "replies": [
                        {
                            "body": "ex was born with foot attached to his nuts. they did surgery, he's fine aside from lopsided balls and can bang for eternity",
                            "author": "sbgonebroke",
                            "id": "ivq08jw",
                            "parent_id": "t1_ivpqkqg",
                            "score": 9,
                            "created_utc": 1668022884.0,
                            "replies": [
                                {
                                    "body": "> ex was born with foot attached to his nuts. \n\nnever heard of such a thing in my life",
                                    "author": "_Duriel_1000_",
                                    "id": "ivq287d",
                                    "parent_id": "t1_ivq08jw",
                                    "score": 8,
                                    "created_utc": 1668023652.0,
                                    "replies": [
                                        {
                                            "body": "me neither frankly until him. was a helluva time when i was ovulating",
                                            "author": "sbgonebroke",
                                            "id": "ivqetuz",
                                            "parent_id": "t1_ivq287d",
                                            "score": 9,
                                            "created_utc": 1668028447.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not necessarily, my ex husband had the same thing, no implant, no surgery, just the way his junk works.   It came as quite the surprise.",
            "author": "Akavinceblack",
            "id": "ivpbubz",
            "parent_id": "t1_ivod254",
            "score": 9,
            "created_utc": 1668013416.0,
            "replies": []
        },
        {
            "body": "Implants can be fun, if the guys with them are respectful + know how to properly use them. This guy clearly does not.",
            "author": "curly_spice",
            "id": "ivp5hz3",
            "parent_id": "t1_ivod254",
            "score": 12,
            "created_utc": 1668010915.0,
            "replies": [
                {
                    "body": "Implants?",
                    "author": "SW1981",
                    "id": "ivpr30o",
                    "parent_id": "t1_ivp5hz3",
                    "score": 3,
                    "created_utc": 1668019301.0,
                    "replies": []
                },
                {
                    "body": "TIL!",
                    "author": "daddoms",
                    "id": "ivpd2if",
                    "parent_id": "t1_ivp5hz3",
                    "score": 2,
                    "created_utc": 1668013895.0,
                    "replies": []
                },
                {
                    "body": "> This guy clearly does not.\n\nhe got more bang for his buck... tf",
                    "author": "_Duriel_1000_",
                    "id": "ivpqoxf",
                    "parent_id": "t1_ivp5hz3",
                    "score": 0,
                    "created_utc": 1668019146.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haha yeah an implant was my first thought",
            "author": "whatsupmynameisSofia",
            "id": "ivp9twu",
            "parent_id": "t1_ivod254",
            "score": 3,
            "created_utc": 1668012634.0,
            "replies": []
        },
        {
            "body": "Naw, it's real... I can do it too.\n\nSometimes it sucks cuz you can't get dressed easily.",
            "author": "itcouldbeme_3",
            "id": "ivqf4xg",
            "parent_id": "t1_ivod254",
            "score": 2,
            "created_utc": 1668028564.0,
            "replies": []
        },
        {
            "body": "Woah! I mean this isn’t a red flag per se as long as she doesn’t mind him cumming inside her. Everyone has their own likes and dislikes and need to discuss between two people.",
            "author": "daddoms",
            "id": "ivoqxou",
            "parent_id": "t1_ivokctw",
            "score": -18,
            "created_utc": 1668005013.0,
            "replies": [
                {
                    "body": "The fact he did it without her permission is where it's a red flag. If he respected her he would have asked and communicated it.",
                    "author": "Leeper90",
                    "id": "ivowvb2",
                    "parent_id": "t1_ivoqxou",
                    "score": 37,
                    "created_utc": 1668007470.0,
                    "replies": [
                        {
                            "body": "There is no respect anywhere in this story. The whole thing is a red flag.",
                            "author": "daddoms",
                            "id": "ivoyhn9",
                            "parent_id": "t1_ivowvb2",
                            "score": 5,
                            "created_utc": 1668008125.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m really sorry about your experience. You can message me if you would like some support. We have some similarities in our story as of late. You’re not wrong in your thinking and it messing up your ph and other bodily functions. The dissociation is something only those who do this understand. Being a woman and allowing someone into our temples is hard enough without all of the added compelities. The reason for the why we are doing it doesn’t matter- we are still allowed to feel these emotions and when we vent them we are\nNot necessarily looking for advice/instructions but rather acknowledgment of being heard and not alone in such experiences. Sending you love and light 🕊",
            "author": "BellJar_Blues",
            "id": "ivpxyu9",
            "parent_id": "t1_ivpmsqe",
            "score": 5,
            "created_utc": 1668021989.0,
            "replies": [
                {
                    "body": "Yeah, men aren't great at providing empathy.",
                    "author": "SDinAsia",
                    "id": "ivqcot3",
                    "parent_id": "t1_ivpxyu9",
                    "score": 5,
                    "created_utc": 1668027631.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He stayed hard and kept going. That’s why I didn’t know.",
            "author": "Inyoureyes_00",
            "id": "ivpoj5w",
            "parent_id": "t1_ivp6fi4",
            "score": 5,
            "created_utc": 1668018303.0,
            "replies": [
                {
                    "body": "That’s wild, it’s not your fault for not knowing. He should have communicated with you",
                    "author": "c0rnstarr",
                    "id": "ivpptyq",
                    "parent_id": "t1_ivpoj5w",
                    "score": 5,
                    "created_utc": 1668018810.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It depends if they have had a talk about if he could finish in her.",
            "author": "MrRhoarke",
            "id": "ivpgvyd",
            "parent_id": "t1_ivp6fi4",
            "score": 2,
            "created_utc": 1668015358.0,
            "replies": [
                {
                    "body": "OP said she had no clue that he was doing it that entire time",
                    "author": "c0rnstarr",
                    "id": "ivpjwnu",
                    "parent_id": "t1_ivpgvyd",
                    "score": 3,
                    "created_utc": 1668016506.0,
                    "replies": [
                        {
                            "body": "The issue with the way it was posted is that we can't say if it was that she had no clue he was orgasming in her, or if he stayed hard after orgasm and just kept on going.",
                            "author": "MrRhoarke",
                            "id": "ivpo9u4",
                            "parent_id": "t1_ivpjwnu",
                            "score": 3,
                            "created_utc": 1668018203.0,
                            "replies": [
                                {
                                    "body": "She said he had been doing it the whole time without her permission",
                                    "author": "c0rnstarr",
                                    "id": "ivpok6x",
                                    "parent_id": "t1_ivpo9u4",
                                    "score": 4,
                                    "created_utc": 1668018313.0,
                                    "replies": [
                                        {
                                            "body": "my bad.  I reread it and see where I oopsed.",
                                            "author": "MrRhoarke",
                                            "id": "ivpphk9",
                                            "parent_id": "t1_ivpok6x",
                                            "score": 3,
                                            "created_utc": 1668018675.0,
                                            "replies": [
                                                {
                                                    "body": "All good, I can’t copy and paste on my phone lol otherwise I would’ve",
                                                    "author": "c0rnstarr",
                                                    "id": "ivppprk",
                                                    "parent_id": "t1_ivpphk9",
                                                    "score": 3,
                                                    "created_utc": 1668018763.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"you must be a master at dissociation\". Lol. I also thought that when I read it. Which makes sense she is just putting it all together just now. OP...i am glad you wrote this to vent to people willing to listen. We feel your pain. Do what you need to do to keep your sanity. No average normie is going to listen to this vent without puking so I am glad we are here for you to listen to the vents.",
            "author": null,
            "id": "ivpftjo",
            "parent_id": "t1_ivoks2f",
            "score": 4,
            "created_utc": 1668014953.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ivp94qk",
            "parent_id": "t1_ivop38p",
            "score": 8,
            "created_utc": 1668012362.0,
            "replies": [
                {
                    "body": "Yeah I get the OP is grossed out for other reason and for this specific reason as well. I’m asking other SB opinion based on a scenario that it’s with someone they are sexually attracted too",
                    "author": "SW1981",
                    "id": "ivpqw99",
                    "parent_id": "t1_ivp94qk",
                    "score": 2,
                    "created_utc": 1668019226.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "i dont think its about that for OP… he didnt inform her of what he was doing. he should of def discussed before. plus they are just not attracted to him which can overall create disgust blinders and everything about that person annoys them.",
            "author": "Stickicky69",
            "id": "ivpxacn",
            "parent_id": "t1_ivon3cg",
            "score": 6,
            "created_utc": 1668021722.0,
            "replies": []
        },
        {
            "body": "You literally blanked out everything Nd responded to a bit of my post if you can’t even take the time to read the post I’d advise to not comment. The point is he came in me without my permission. Me standing the chance of catching an std would have been on me because that’s what I consented to. Plz Stay on topic you’re dizzy as fuck 😩",
            "author": "Inyoureyes_00",
            "id": "ivq3j9w",
            "parent_id": "t1_ivp9dua",
            "score": 2,
            "created_utc": 1668024154.0,
            "replies": []
        },
        {
            "body": "I take it as you didn’t read the post and you also think cumming inside is okay just because there’s no condom. He didn’t have permission. Point. blank. The end.",
            "author": "Inyoureyes_00",
            "id": "ivpvtsy",
            "parent_id": "t1_ivpvl3f",
            "score": -1,
            "created_utc": 1668021144.0,
            "replies": []
        },
        {
            "body": "It's your right, I mean it's not like no one will take your place, but we've cherished our first babies and been mistreated and disrespected too. Just because one guy was disrespectful to you means we're all assholes? cause we're not. But if you were doing it with a guy you appreciated, none of this would be a problem. He's fixed, so what if you get cum inside, what about precum is that gross?",
            "author": "sugardad123",
            "id": "ivqatu4",
            "parent_id": "t1_ivpqgp1",
            "score": 2,
            "created_utc": 1668026927.0,
            "replies": []
        },
        {
            "body": "this this this. i firmly believe all sex work shouldn't be started out of desperation because it will cause a person to ditch their morals and boundaries.",
            "author": "thegeniuswhore",
            "id": "ivpb24m",
            "parent_id": "t1_ivoqhgt",
            "score": 5,
            "created_utc": 1668013109.0,
            "replies": []
        },
        {
            "body": "Yuuuuup why is no one bringing THIS part up lol",
            "author": "c0rnstarr",
            "id": "ivp6z8q",
            "parent_id": "t1_ivp1w7z",
            "score": 9,
            "created_utc": 1668011506.0,
            "replies": []
        },
        {
            "body": "I'm sorry, I lold. \nAlso, isn't the cash the whole reason?",
            "author": "Quick-Adhesiveness-2",
            "id": "ivp2o5l",
            "parent_id": "t1_ivozgdo",
            "score": 10,
            "created_utc": 1668009783.0,
            "replies": []
        },
        {
            "body": "lol. yeah, sure.",
            "author": null,
            "id": "ivpfwuk",
            "parent_id": "t1_ivozgdo",
            "score": 4,
            "created_utc": 1668014988.0,
            "replies": []
        },
        {
            "body": "Are you fucking serious, this guy has been violating her for weeks now. It’s unconsensual sex. What this guy “deserves” is to be castrated good night",
            "author": "c0rnstarr",
            "id": "ivp6ufh",
            "parent_id": "t1_ivozgdo",
            "score": 9,
            "created_utc": 1668011452.0,
            "replies": [
                {
                    "body": "No it's not, it's like saying to a man you can only cum with the left nut, how castrating is that!?? Is there no end to toxic feminity?",
                    "author": "sugardad123",
                    "id": "ivpgjs2",
                    "parent_id": "t1_ivp6ufh",
                    "score": -11,
                    "created_utc": 1668015231.0,
                    "replies": [
                        {
                            "body": "I’m dying lol “toxic femininity” \n\nOP said she had no idea he was nutting in her that whole time. That is sexual assault. Period",
                            "author": "c0rnstarr",
                            "id": "ivpk77v",
                            "parent_id": "t1_ivpgjs2",
                            "score": 12,
                            "created_utc": 1668016619.0,
                            "replies": [
                                {
                                    "body": "No, she wrote she 'tolerated' it because he's fixed and they are both clean. It's learning that he cums multiple time that's grossed her out. \n\nHow would it be possible that she let's him rawdog her, and he never cums? Clearly she was okay with one shot of cum, or at least precum.\n\nIf you ask me, this SB is full of cum, I mean shit.",
                                    "author": "sugardad123",
                                    "id": "ivpn38d",
                                    "parent_id": "t1_ivpk77v",
                                    "score": -3,
                                    "created_utc": 1668017745.0,
                                    "replies": [
                                        {
                                            "body": "Read it again dude",
                                            "author": "c0rnstarr",
                                            "id": "ivpnb72",
                                            "parent_id": "t1_ivpn38d",
                                            "score": 11,
                                            "created_utc": 1668017830.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "OP clarifies it in other comments. They discussed the topic over text and she was clear about her boundaries. He was not to come inside her. He did anyway. He kept going because he was still hard, so she didn’t figure it out until afterward.",
                                            "author": "PlugItWithaBeer",
                                            "id": "ivpu6m0",
                                            "parent_id": "t1_ivpn38d",
                                            "score": 11,
                                            "created_utc": 1668020497.0,
                                            "replies": [
                                                {
                                                    "body": "Right. It sounded like an ongoing habit when I read it at first but that she was okay with one load. \n\nIs not cool what he did then, and it's even against the law where I live, it's a form of stealthing at least.",
                                                    "author": "sugardad123",
                                                    "id": "ivq8d07",
                                                    "parent_id": "t1_ivpu6m0",
                                                    "score": 4,
                                                    "created_utc": 1668025982.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Homie has been coming inside of her without her knowledge. Doing anything sexual with out full and complete consent is sexual assault. \n\nEnd. Of. Discussion.",
                                            "author": "GlitterAndSugar",
                                            "id": "ivptjps",
                                            "parent_id": "t1_ivpn38d",
                                            "score": 9,
                                            "created_utc": 1668020254.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree. I'm sure he'll have no problem finding another SB that'll be glad to have him.",
            "author": "Automatic_Joke_4414",
            "id": "ivp3woi",
            "parent_id": "t1_ivozgdo",
            "score": 3,
            "created_utc": 1668010278.0,
            "replies": [
                {
                    "body": "I love the daddies rallying behind other daddies. As if some of you all aren't gross af.",
                    "author": null,
                    "id": "ivpg44j",
                    "parent_id": "t1_ivp3woi",
                    "score": 16,
                    "created_utc": 1668015063.0,
                    "replies": [
                        {
                            "body": "Gross are in the eyes of the beholder.",
                            "author": "Automatic_Joke_4414",
                            "id": "ivpnqcq",
                            "parent_id": "t1_ivpg44j",
                            "score": -2,
                            "created_utc": 1668017994.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ivq50id",
            "parent_id": "t1_ivq3al7",
            "score": -2,
            "created_utc": 1668024719.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "ivq5mo5",
                    "parent_id": "t1_ivq50id",
                    "score": 2,
                    "created_utc": 1668024953.0,
                    "replies": [
                        {
                            "body": "Rule #1: Remember the human\n\nBe respectful to other posters. No name calling, personal attacks, etc. We are all humans here.",
                            "author": "sugarlifestyleforum-ModTeam",
                            "id": "ivqbxar",
                            "parent_id": "t1_ivq5mo5",
                            "score": 3,
                            "created_utc": 1668027341.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you’re not an animal, surely you’re capable of asking the lady ahead of time before you come inside her.",
            "author": "paroxysmique",
            "id": "ivp4ou6",
            "parent_id": "t1_ivovj5f",
            "score": 3,
            "created_utc": 1668010590.0,
            "replies": [
                {
                    "body": "I guess I’m an animal. Whenever I’ve had sex with any woman without a condom (which was done with free consent and full discussion ahead of time — no surprises, no “stealthing,” knowing that I’ve had a vasectomy, yadda yadda) it was assumed that that, of course, meant I was coming inside her. They seem to assume it’s happening. None have ever been surprised when I came inside her. Nobody ever said, “what? You came inside me?”\n\nDo you seriously assume he’s pulling out, by default, if you’ve had this discussion about sex without a condom with a vasectomied SD?\n\nPoint well taken I guess. The next time I have this discussion with a new girl (hopefully not anytime soon, knock on wood, because I’m very happy with the current SB) I’ll make it crystal clear that sex without a condom means I’m coming inside her.",
                    "author": "Stickley1",
                    "id": "ivpawnv",
                    "parent_id": "t1_ivp4ou6",
                    "score": 0,
                    "created_utc": 1668013050.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Gross.",
            "author": null,
            "id": "ivox9l7",
            "parent_id": "t1_ivovj5f",
            "score": 5,
            "created_utc": 1668007631.0,
            "replies": []
        },
        {
            "body": "Idk man I’m with her… vasectomy jizz is just something else entirely. My SD is 52 and maybe it’s just his but It’s watery, irritates my skin, AND stains my sheets. I made my SD switch to wearing condoms cuz it’s just that much of an issue",
            "author": "ExcellentSherbet3178",
            "id": "ivp5z7s",
            "parent_id": "t1_ivovj5f",
            "score": 3,
            "created_utc": 1668011106.0,
            "replies": []
        },
        {
            "body": "When I was younger, I was this way.",
            "author": "MrRhoarke",
            "id": "ivpgnhb",
            "parent_id": "t1_ivpd56q",
            "score": 1,
            "created_utc": 1668015270.0,
            "replies": []
        },
        {
            "body": "Rule #4: No \"value for money\" discussion\n\nDiscussions about how to get the most value for your money are not allowed. Posts asking for or assigning a monetary value to sexual acts are not allowed. **Assigning a monetary worth to individuals based on race, age, size,looks, etc., are not allowed.** Posts about how much allowance/ppm to ask for, give, is average, for such and such area or situation, are no longer be allowed on SLF. Any posts with dollar amounts that are in reference to PPMs and/or allowances are no longer allowed.\n\nAlso see the [Allowance Master Thread](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/).",
            "author": "sugarlifestyleforum-ModTeam",
            "id": "ivozh6m",
            "parent_id": "t1_ivowunw",
            "score": 1,
            "created_utc": 1668008519.0,
            "replies": []
        },
        {
            "body": "Always trust your gut.  Also, in the future, dont get into a SR with someone you don’t want to be with sexually.  Dont bring down your standards for money, it’s not worth it.",
            "author": "BigPoppa3232",
            "id": "ivobyd6",
            "parent_id": "t1_ivobo2v",
            "score": 66,
            "created_utc": 1667997747.0,
            "replies": []
        },
        {
            "body": "Agree with all the other posters. If he’s grossing you out then move on. You’ll be able to find someone that attracts you unless you only like young guys. But plenty of SD are in their 30s",
            "author": "SW1981",
            "id": "ivprci1",
            "parent_id": "t1_ivobo2v",
            "score": 9,
            "created_utc": 1668019404.0,
            "replies": []
        },
        {
            "body": "Babe. HE IS Icky AF. You deserve SO MUCH MORE! Straighten your 👑, you got this!",
            "author": "Laciethewife",
            "id": "ivoxpg0",
            "parent_id": "t1_ivobo2v",
            "score": 21,
            "created_utc": 1668007809.0,
            "replies": []
        },
        {
            "body": "Can you please elaborate on this? because I’ve never read a combination of sentences and words quite like it.\n\nEdit: nvm I get it. I feel bad for being entertained by that, but I never knew a uterus could end up like that.",
            "author": "Steelstrike309",
            "id": "ivpcfpu",
            "parent_id": "t1_ivonr55",
            "score": 47,
            "created_utc": 1668013649.0,
            "replies": [
                {
                    "body": "Oh sorry! In simple terms, when my ex was born, he had somehow had his foot fused into his nuts. They did surgery. He has lopsided balls, but is a fuck champion as a result.",
                    "author": "sbgonebroke",
                    "id": "ivq04jl",
                    "parent_id": "t1_ivpcfpu",
                    "score": 24,
                    "created_utc": 1668022840.0,
                    "replies": []
                },
                {
                    "body": "In utero, not a uterus. It means during pregnancy/gestation",
                    "author": "BrownEyed-Susan",
                    "id": "ivpg5qf",
                    "parent_id": "t1_ivpcfpu",
                    "score": 13,
                    "created_utc": 1668015080.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "what",
            "author": "_Duriel_1000_",
            "id": "ivpqkqg",
            "parent_id": "t1_ivonr55",
            "score": 6,
            "created_utc": 1668019100.0,
            "replies": [
                {
                    "body": "ex was born with foot attached to his nuts. they did surgery, he's fine aside from lopsided balls and can bang for eternity",
                    "author": "sbgonebroke",
                    "id": "ivq08jw",
                    "parent_id": "t1_ivpqkqg",
                    "score": 9,
                    "created_utc": 1668022884.0,
                    "replies": [
                        {
                            "body": "> ex was born with foot attached to his nuts. \n\nnever heard of such a thing in my life",
                            "author": "_Duriel_1000_",
                            "id": "ivq287d",
                            "parent_id": "t1_ivq08jw",
                            "score": 8,
                            "created_utc": 1668023652.0,
                            "replies": [
                                {
                                    "body": "me neither frankly until him. was a helluva time when i was ovulating",
                                    "author": "sbgonebroke",
                                    "id": "ivqetuz",
                                    "parent_id": "t1_ivq287d",
                                    "score": 9,
                                    "created_utc": 1668028447.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Implants?",
            "author": "SW1981",
            "id": "ivpr30o",
            "parent_id": "t1_ivp5hz3",
            "score": 3,
            "created_utc": 1668019301.0,
            "replies": []
        },
        {
            "body": "TIL!",
            "author": "daddoms",
            "id": "ivpd2if",
            "parent_id": "t1_ivp5hz3",
            "score": 2,
            "created_utc": 1668013895.0,
            "replies": []
        },
        {
            "body": "> This guy clearly does not.\n\nhe got more bang for his buck... tf",
            "author": "_Duriel_1000_",
            "id": "ivpqoxf",
            "parent_id": "t1_ivp5hz3",
            "score": 0,
            "created_utc": 1668019146.0,
            "replies": []
        },
        {
            "body": "The fact he did it without her permission is where it's a red flag. If he respected her he would have asked and communicated it.",
            "author": "Leeper90",
            "id": "ivowvb2",
            "parent_id": "t1_ivoqxou",
            "score": 37,
            "created_utc": 1668007470.0,
            "replies": [
                {
                    "body": "There is no respect anywhere in this story. The whole thing is a red flag.",
                    "author": "daddoms",
                    "id": "ivoyhn9",
                    "parent_id": "t1_ivowvb2",
                    "score": 5,
                    "created_utc": 1668008125.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, men aren't great at providing empathy.",
            "author": "SDinAsia",
            "id": "ivqcot3",
            "parent_id": "t1_ivpxyu9",
            "score": 5,
            "created_utc": 1668027631.0,
            "replies": []
        },
        {
            "body": "That’s wild, it’s not your fault for not knowing. He should have communicated with you",
            "author": "c0rnstarr",
            "id": "ivpptyq",
            "parent_id": "t1_ivpoj5w",
            "score": 5,
            "created_utc": 1668018810.0,
            "replies": []
        },
        {
            "body": "OP said she had no clue that he was doing it that entire time",
            "author": "c0rnstarr",
            "id": "ivpjwnu",
            "parent_id": "t1_ivpgvyd",
            "score": 3,
            "created_utc": 1668016506.0,
            "replies": [
                {
                    "body": "The issue with the way it was posted is that we can't say if it was that she had no clue he was orgasming in her, or if he stayed hard after orgasm and just kept on going.",
                    "author": "MrRhoarke",
                    "id": "ivpo9u4",
                    "parent_id": "t1_ivpjwnu",
                    "score": 3,
                    "created_utc": 1668018203.0,
                    "replies": [
                        {
                            "body": "She said he had been doing it the whole time without her permission",
                            "author": "c0rnstarr",
                            "id": "ivpok6x",
                            "parent_id": "t1_ivpo9u4",
                            "score": 4,
                            "created_utc": 1668018313.0,
                            "replies": [
                                {
                                    "body": "my bad.  I reread it and see where I oopsed.",
                                    "author": "MrRhoarke",
                                    "id": "ivpphk9",
                                    "parent_id": "t1_ivpok6x",
                                    "score": 3,
                                    "created_utc": 1668018675.0,
                                    "replies": [
                                        {
                                            "body": "All good, I can’t copy and paste on my phone lol otherwise I would’ve",
                                            "author": "c0rnstarr",
                                            "id": "ivppprk",
                                            "parent_id": "t1_ivpphk9",
                                            "score": 3,
                                            "created_utc": 1668018763.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah I get the OP is grossed out for other reason and for this specific reason as well. I’m asking other SB opinion based on a scenario that it’s with someone they are sexually attracted too",
            "author": "SW1981",
            "id": "ivpqw99",
            "parent_id": "t1_ivp94qk",
            "score": 2,
            "created_utc": 1668019226.0,
            "replies": []
        },
        {
            "body": "No it's not, it's like saying to a man you can only cum with the left nut, how castrating is that!?? Is there no end to toxic feminity?",
            "author": "sugardad123",
            "id": "ivpgjs2",
            "parent_id": "t1_ivp6ufh",
            "score": -11,
            "created_utc": 1668015231.0,
            "replies": [
                {
                    "body": "I’m dying lol “toxic femininity” \n\nOP said she had no idea he was nutting in her that whole time. That is sexual assault. Period",
                    "author": "c0rnstarr",
                    "id": "ivpk77v",
                    "parent_id": "t1_ivpgjs2",
                    "score": 12,
                    "created_utc": 1668016619.0,
                    "replies": [
                        {
                            "body": "No, she wrote she 'tolerated' it because he's fixed and they are both clean. It's learning that he cums multiple time that's grossed her out. \n\nHow would it be possible that she let's him rawdog her, and he never cums? Clearly she was okay with one shot of cum, or at least precum.\n\nIf you ask me, this SB is full of cum, I mean shit.",
                            "author": "sugardad123",
                            "id": "ivpn38d",
                            "parent_id": "t1_ivpk77v",
                            "score": -3,
                            "created_utc": 1668017745.0,
                            "replies": [
                                {
                                    "body": "Read it again dude",
                                    "author": "c0rnstarr",
                                    "id": "ivpnb72",
                                    "parent_id": "t1_ivpn38d",
                                    "score": 11,
                                    "created_utc": 1668017830.0,
                                    "replies": []
                                },
                                {
                                    "body": "OP clarifies it in other comments. They discussed the topic over text and she was clear about her boundaries. He was not to come inside her. He did anyway. He kept going because he was still hard, so she didn’t figure it out until afterward.",
                                    "author": "PlugItWithaBeer",
                                    "id": "ivpu6m0",
                                    "parent_id": "t1_ivpn38d",
                                    "score": 11,
                                    "created_utc": 1668020497.0,
                                    "replies": [
                                        {
                                            "body": "Right. It sounded like an ongoing habit when I read it at first but that she was okay with one load. \n\nIs not cool what he did then, and it's even against the law where I live, it's a form of stealthing at least.",
                                            "author": "sugardad123",
                                            "id": "ivq8d07",
                                            "parent_id": "t1_ivpu6m0",
                                            "score": 4,
                                            "created_utc": 1668025982.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Homie has been coming inside of her without her knowledge. Doing anything sexual with out full and complete consent is sexual assault. \n\nEnd. Of. Discussion.",
                                    "author": "GlitterAndSugar",
                                    "id": "ivptjps",
                                    "parent_id": "t1_ivpn38d",
                                    "score": 9,
                                    "created_utc": 1668020254.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love the daddies rallying behind other daddies. As if some of you all aren't gross af.",
            "author": null,
            "id": "ivpg44j",
            "parent_id": "t1_ivp3woi",
            "score": 16,
            "created_utc": 1668015063.0,
            "replies": [
                {
                    "body": "Gross are in the eyes of the beholder.",
                    "author": "Automatic_Joke_4414",
                    "id": "ivpnqcq",
                    "parent_id": "t1_ivpg44j",
                    "score": -2,
                    "created_utc": 1668017994.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ivq5mo5",
            "parent_id": "t1_ivq50id",
            "score": 2,
            "created_utc": 1668024953.0,
            "replies": [
                {
                    "body": "Rule #1: Remember the human\n\nBe respectful to other posters. No name calling, personal attacks, etc. We are all humans here.",
                    "author": "sugarlifestyleforum-ModTeam",
                    "id": "ivqbxar",
                    "parent_id": "t1_ivq5mo5",
                    "score": 3,
                    "created_utc": 1668027341.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I guess I’m an animal. Whenever I’ve had sex with any woman without a condom (which was done with free consent and full discussion ahead of time — no surprises, no “stealthing,” knowing that I’ve had a vasectomy, yadda yadda) it was assumed that that, of course, meant I was coming inside her. They seem to assume it’s happening. None have ever been surprised when I came inside her. Nobody ever said, “what? You came inside me?”\n\nDo you seriously assume he’s pulling out, by default, if you’ve had this discussion about sex without a condom with a vasectomied SD?\n\nPoint well taken I guess. The next time I have this discussion with a new girl (hopefully not anytime soon, knock on wood, because I’m very happy with the current SB) I’ll make it crystal clear that sex without a condom means I’m coming inside her.",
            "author": "Stickley1",
            "id": "ivpawnv",
            "parent_id": "t1_ivp4ou6",
            "score": 0,
            "created_utc": 1668013050.0,
            "replies": []
        },
        {
            "body": "Oh sorry! In simple terms, when my ex was born, he had somehow had his foot fused into his nuts. They did surgery. He has lopsided balls, but is a fuck champion as a result.",
            "author": "sbgonebroke",
            "id": "ivq04jl",
            "parent_id": "t1_ivpcfpu",
            "score": 24,
            "created_utc": 1668022840.0,
            "replies": []
        },
        {
            "body": "In utero, not a uterus. It means during pregnancy/gestation",
            "author": "BrownEyed-Susan",
            "id": "ivpg5qf",
            "parent_id": "t1_ivpcfpu",
            "score": 13,
            "created_utc": 1668015080.0,
            "replies": []
        },
        {
            "body": "ex was born with foot attached to his nuts. they did surgery, he's fine aside from lopsided balls and can bang for eternity",
            "author": "sbgonebroke",
            "id": "ivq08jw",
            "parent_id": "t1_ivpqkqg",
            "score": 9,
            "created_utc": 1668022884.0,
            "replies": [
                {
                    "body": "> ex was born with foot attached to his nuts. \n\nnever heard of such a thing in my life",
                    "author": "_Duriel_1000_",
                    "id": "ivq287d",
                    "parent_id": "t1_ivq08jw",
                    "score": 8,
                    "created_utc": 1668023652.0,
                    "replies": [
                        {
                            "body": "me neither frankly until him. was a helluva time when i was ovulating",
                            "author": "sbgonebroke",
                            "id": "ivqetuz",
                            "parent_id": "t1_ivq287d",
                            "score": 9,
                            "created_utc": 1668028447.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There is no respect anywhere in this story. The whole thing is a red flag.",
            "author": "daddoms",
            "id": "ivoyhn9",
            "parent_id": "t1_ivowvb2",
            "score": 5,
            "created_utc": 1668008125.0,
            "replies": []
        },
        {
            "body": "The issue with the way it was posted is that we can't say if it was that she had no clue he was orgasming in her, or if he stayed hard after orgasm and just kept on going.",
            "author": "MrRhoarke",
            "id": "ivpo9u4",
            "parent_id": "t1_ivpjwnu",
            "score": 3,
            "created_utc": 1668018203.0,
            "replies": [
                {
                    "body": "She said he had been doing it the whole time without her permission",
                    "author": "c0rnstarr",
                    "id": "ivpok6x",
                    "parent_id": "t1_ivpo9u4",
                    "score": 4,
                    "created_utc": 1668018313.0,
                    "replies": [
                        {
                            "body": "my bad.  I reread it and see where I oopsed.",
                            "author": "MrRhoarke",
                            "id": "ivpphk9",
                            "parent_id": "t1_ivpok6x",
                            "score": 3,
                            "created_utc": 1668018675.0,
                            "replies": [
                                {
                                    "body": "All good, I can’t copy and paste on my phone lol otherwise I would’ve",
                                    "author": "c0rnstarr",
                                    "id": "ivppprk",
                                    "parent_id": "t1_ivpphk9",
                                    "score": 3,
                                    "created_utc": 1668018763.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m dying lol “toxic femininity” \n\nOP said she had no idea he was nutting in her that whole time. That is sexual assault. Period",
            "author": "c0rnstarr",
            "id": "ivpk77v",
            "parent_id": "t1_ivpgjs2",
            "score": 12,
            "created_utc": 1668016619.0,
            "replies": [
                {
                    "body": "No, she wrote she 'tolerated' it because he's fixed and they are both clean. It's learning that he cums multiple time that's grossed her out. \n\nHow would it be possible that she let's him rawdog her, and he never cums? Clearly she was okay with one shot of cum, or at least precum.\n\nIf you ask me, this SB is full of cum, I mean shit.",
                    "author": "sugardad123",
                    "id": "ivpn38d",
                    "parent_id": "t1_ivpk77v",
                    "score": -3,
                    "created_utc": 1668017745.0,
                    "replies": [
                        {
                            "body": "Read it again dude",
                            "author": "c0rnstarr",
                            "id": "ivpnb72",
                            "parent_id": "t1_ivpn38d",
                            "score": 11,
                            "created_utc": 1668017830.0,
                            "replies": []
                        },
                        {
                            "body": "OP clarifies it in other comments. They discussed the topic over text and she was clear about her boundaries. He was not to come inside her. He did anyway. He kept going because he was still hard, so she didn’t figure it out until afterward.",
                            "author": "PlugItWithaBeer",
                            "id": "ivpu6m0",
                            "parent_id": "t1_ivpn38d",
                            "score": 11,
                            "created_utc": 1668020497.0,
                            "replies": [
                                {
                                    "body": "Right. It sounded like an ongoing habit when I read it at first but that she was okay with one load. \n\nIs not cool what he did then, and it's even against the law where I live, it's a form of stealthing at least.",
                                    "author": "sugardad123",
                                    "id": "ivq8d07",
                                    "parent_id": "t1_ivpu6m0",
                                    "score": 4,
                                    "created_utc": 1668025982.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Homie has been coming inside of her without her knowledge. Doing anything sexual with out full and complete consent is sexual assault. \n\nEnd. Of. Discussion.",
                            "author": "GlitterAndSugar",
                            "id": "ivptjps",
                            "parent_id": "t1_ivpn38d",
                            "score": 9,
                            "created_utc": 1668020254.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Gross are in the eyes of the beholder.",
            "author": "Automatic_Joke_4414",
            "id": "ivpnqcq",
            "parent_id": "t1_ivpg44j",
            "score": -2,
            "created_utc": 1668017994.0,
            "replies": []
        },
        {
            "body": "Rule #1: Remember the human\n\nBe respectful to other posters. No name calling, personal attacks, etc. We are all humans here.",
            "author": "sugarlifestyleforum-ModTeam",
            "id": "ivqbxar",
            "parent_id": "t1_ivq5mo5",
            "score": 3,
            "created_utc": 1668027341.0,
            "replies": []
        },
        {
            "body": "> ex was born with foot attached to his nuts. \n\nnever heard of such a thing in my life",
            "author": "_Duriel_1000_",
            "id": "ivq287d",
            "parent_id": "t1_ivq08jw",
            "score": 8,
            "created_utc": 1668023652.0,
            "replies": [
                {
                    "body": "me neither frankly until him. was a helluva time when i was ovulating",
                    "author": "sbgonebroke",
                    "id": "ivqetuz",
                    "parent_id": "t1_ivq287d",
                    "score": 9,
                    "created_utc": 1668028447.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She said he had been doing it the whole time without her permission",
            "author": "c0rnstarr",
            "id": "ivpok6x",
            "parent_id": "t1_ivpo9u4",
            "score": 4,
            "created_utc": 1668018313.0,
            "replies": [
                {
                    "body": "my bad.  I reread it and see where I oopsed.",
                    "author": "MrRhoarke",
                    "id": "ivpphk9",
                    "parent_id": "t1_ivpok6x",
                    "score": 3,
                    "created_utc": 1668018675.0,
                    "replies": [
                        {
                            "body": "All good, I can’t copy and paste on my phone lol otherwise I would’ve",
                            "author": "c0rnstarr",
                            "id": "ivppprk",
                            "parent_id": "t1_ivpphk9",
                            "score": 3,
                            "created_utc": 1668018763.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No, she wrote she 'tolerated' it because he's fixed and they are both clean. It's learning that he cums multiple time that's grossed her out. \n\nHow would it be possible that she let's him rawdog her, and he never cums? Clearly she was okay with one shot of cum, or at least precum.\n\nIf you ask me, this SB is full of cum, I mean shit.",
            "author": "sugardad123",
            "id": "ivpn38d",
            "parent_id": "t1_ivpk77v",
            "score": -3,
            "created_utc": 1668017745.0,
            "replies": [
                {
                    "body": "Read it again dude",
                    "author": "c0rnstarr",
                    "id": "ivpnb72",
                    "parent_id": "t1_ivpn38d",
                    "score": 11,
                    "created_utc": 1668017830.0,
                    "replies": []
                },
                {
                    "body": "OP clarifies it in other comments. They discussed the topic over text and she was clear about her boundaries. He was not to come inside her. He did anyway. He kept going because he was still hard, so she didn’t figure it out until afterward.",
                    "author": "PlugItWithaBeer",
                    "id": "ivpu6m0",
                    "parent_id": "t1_ivpn38d",
                    "score": 11,
                    "created_utc": 1668020497.0,
                    "replies": [
                        {
                            "body": "Right. It sounded like an ongoing habit when I read it at first but that she was okay with one load. \n\nIs not cool what he did then, and it's even against the law where I live, it's a form of stealthing at least.",
                            "author": "sugardad123",
                            "id": "ivq8d07",
                            "parent_id": "t1_ivpu6m0",
                            "score": 4,
                            "created_utc": 1668025982.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Homie has been coming inside of her without her knowledge. Doing anything sexual with out full and complete consent is sexual assault. \n\nEnd. Of. Discussion.",
                    "author": "GlitterAndSugar",
                    "id": "ivptjps",
                    "parent_id": "t1_ivpn38d",
                    "score": 9,
                    "created_utc": 1668020254.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "me neither frankly until him. was a helluva time when i was ovulating",
            "author": "sbgonebroke",
            "id": "ivqetuz",
            "parent_id": "t1_ivq287d",
            "score": 9,
            "created_utc": 1668028447.0,
            "replies": []
        },
        {
            "body": "my bad.  I reread it and see where I oopsed.",
            "author": "MrRhoarke",
            "id": "ivpphk9",
            "parent_id": "t1_ivpok6x",
            "score": 3,
            "created_utc": 1668018675.0,
            "replies": [
                {
                    "body": "All good, I can’t copy and paste on my phone lol otherwise I would’ve",
                    "author": "c0rnstarr",
                    "id": "ivppprk",
                    "parent_id": "t1_ivpphk9",
                    "score": 3,
                    "created_utc": 1668018763.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Read it again dude",
            "author": "c0rnstarr",
            "id": "ivpnb72",
            "parent_id": "t1_ivpn38d",
            "score": 11,
            "created_utc": 1668017830.0,
            "replies": []
        },
        {
            "body": "OP clarifies it in other comments. They discussed the topic over text and she was clear about her boundaries. He was not to come inside her. He did anyway. He kept going because he was still hard, so she didn’t figure it out until afterward.",
            "author": "PlugItWithaBeer",
            "id": "ivpu6m0",
            "parent_id": "t1_ivpn38d",
            "score": 11,
            "created_utc": 1668020497.0,
            "replies": [
                {
                    "body": "Right. It sounded like an ongoing habit when I read it at first but that she was okay with one load. \n\nIs not cool what he did then, and it's even against the law where I live, it's a form of stealthing at least.",
                    "author": "sugardad123",
                    "id": "ivq8d07",
                    "parent_id": "t1_ivpu6m0",
                    "score": 4,
                    "created_utc": 1668025982.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Homie has been coming inside of her without her knowledge. Doing anything sexual with out full and complete consent is sexual assault. \n\nEnd. Of. Discussion.",
            "author": "GlitterAndSugar",
            "id": "ivptjps",
            "parent_id": "t1_ivpn38d",
            "score": 9,
            "created_utc": 1668020254.0,
            "replies": []
        },
        {
            "body": "All good, I can’t copy and paste on my phone lol otherwise I would’ve",
            "author": "c0rnstarr",
            "id": "ivppprk",
            "parent_id": "t1_ivpphk9",
            "score": 3,
            "created_utc": 1668018763.0,
            "replies": []
        },
        {
            "body": "Right. It sounded like an ongoing habit when I read it at first but that she was okay with one load. \n\nIs not cool what he did then, and it's even against the law where I live, it's a form of stealthing at least.",
            "author": "sugardad123",
            "id": "ivq8d07",
            "parent_id": "t1_ivpu6m0",
            "score": 4,
            "created_utc": 1668025982.0,
            "replies": []
        }
    ]
}