{
    "title": "SD’s & overnights: annoying behavior",
    "post_id": "112bsq6",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/112bsq6/sds_overnights_annoying_behavior/",
    "author": "noneya3333",
    "body": "I’m posting this so SD’s can realize their behavior and stop. We’ve discussed this on the other forum, so I know other women experience this and either 1) grin and bear it because she can’t afford to risk the financial support by saying anything 2) your SB will start making excuses so she doesn’t have to stay the night. \n\n1. Snoring like a grizzly bear. How many hours do you think you can tolerate sleeping next to a bear? I understand this isn’t something you can necessarily “fix”, but there are things you can do to make it more tolerable for her. Offer solutions. \n\n2. Waking her up multiple times in the middle of the night pestering for sex. Let the girl sleep!! Especially if she came over after work, or you guys went out the night before & had a great dinner followed by sex. Allow her beauty sleep, and caress her back and neck, and she will show appreciation and be well rested for morning sex. \n\n3. Smothering her. She just catered to you for the last 12+ hours, if she wants to shower alone, let her! Most women have morning skin/hair routines, want to shave, or like to gather our daily thoughts.\n\n4. When she’s ready to leave, don’t make it hard. You don’t need to passive aggressively ask what other plans she has.. Maybe she just misses the comfort of her own bed or her dog/cat.\n\nI enjoy overnights with my SD’s, and think they allow 1-on-1 time to get to know each other and have intimate moments, but that behavior honestly takes the joy right out of it.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/112bsq6/sds_overnights_annoying_behavior/",
    "score": 132,
    "upvote_ratio": 0.85,
    "created_utc": 1676397781.0,
    "num_comments": 132,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Oh boy, I fall heavily into the #1 group. It's why I am very timid about overnights. I warn them ahead of time, offer the SB a different room if she prefers, and use a customized mouthguard that helps eliminate snoring. I also make sure that while she is welcome, overnights are not necessity (unless we are traveling, of course).",
            "author": "Hot_Selection3626",
            "id": "j8j42rv",
            "parent_id": "t3_112bsq6",
            "score": 52,
            "created_utc": 1676398150.0,
            "replies": [
                {
                    "body": "One of my exes was hardcore #1 -- undiagnosed sleep apnea. After getting a cpap machine, it was perfect! Before then, I just had to move to a different room as soon as the bear snores began hahaha",
                    "author": "HarvardLawSB",
                    "id": "j8jnp47",
                    "parent_id": "t1_j8j42rv",
                    "score": 20,
                    "created_utc": 1676405779.0,
                    "replies": [
                        {
                            "body": "I am a heavy snorer.  I introduced my CPAP as not \"sexy\" but it will make sure we are rested for when we need the energy. 😉 Surprisingly, when I've fallen asleep without putting on my mask I don't get beaten awake to put it back on. I usually woke myself up and threw it on. I would recommend it to anyone as a way to improve their health and their relationship.",
                            "author": "manninc2000",
                            "id": "j8lg4e2",
                            "parent_id": "t1_j8jnp47",
                            "score": 7,
                            "created_utc": 1676434204.0,
                            "replies": []
                        },
                        {
                            "body": "LOL I can imagine. I thought I had apnea when someone pointed out my snoring to me (I was oblivious, of course), but as it turns out it's a different medical issue. I would say its about 50/50 since then on whether an SB I was seeing would choose the spare room rather than bunk with Snorasaurus Rex. I don't blame them at all, although the mouthguard has significantly reduced it.",
                            "author": "Hot_Selection3626",
                            "id": "j8jpjt6",
                            "parent_id": "t1_j8jnp47",
                            "score": 7,
                            "created_utc": 1676406495.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Trying to be considerate is what really matters, you’re a good man.",
                    "author": "PrettyGirlSpicy",
                    "id": "j8jq5q6",
                    "parent_id": "t1_j8j42rv",
                    "score": 14,
                    "created_utc": 1676406733.0,
                    "replies": [
                        {
                            "body": "Aww thanks!",
                            "author": "Hot_Selection3626",
                            "id": "j8jt69z",
                            "parent_id": "t1_j8jq5q6",
                            "score": 7,
                            "created_utc": 1676407892.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "To me, this is the best way to handle it.",
                    "author": "FLRAdvocate",
                    "id": "j8jgyo6",
                    "parent_id": "t1_j8j42rv",
                    "score": 12,
                    "created_utc": 1676403147.0,
                    "replies": []
                },
                {
                    "body": "Can you send me more info about this customized mouth guard?",
                    "author": "eurosd",
                    "id": "j8k9e8k",
                    "parent_id": "t1_j8j42rv",
                    "score": 6,
                    "created_utc": 1676414267.0,
                    "replies": [
                        {
                            "body": "Sure, it’s an OTC device:\n\nhttps://smartguardrx.com/products/anti-snore-device?sscid=21k7_jh019&",
                            "author": "Hot_Selection3626",
                            "id": "j8kcp4q",
                            "parent_id": "t1_j8k9e8k",
                            "score": 6,
                            "created_utc": 1676415665.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You sir, are a class act!",
                    "author": "TaylorNicholeXO",
                    "id": "j8njzf9",
                    "parent_id": "t1_j8j42rv",
                    "score": 3,
                    "created_utc": 1676480219.0,
                    "replies": [
                        {
                            "body": "You are sweet. I just understand how unbearable it can be to sleep with someone who snores loudly, or if the mouthguard is in, snores softly. As others have pointed out, sleeping alone tends to result in the best sleep, particularly once you get the oxytocin flowing post-sex.   \n\n\nWhile I do enjoy falling asleep and cuddling, the practical side of it is that some cannot tolerate any snoring. At least if my SB stays over, I can make breakfast in the morning (which is one of my favorite activities). So it's a good enticement to stay. :)",
                            "author": "Hot_Selection3626",
                            "id": "j8nmghm",
                            "parent_id": "t1_j8njzf9",
                            "score": 3,
                            "created_utc": 1676481186.0,
                            "replies": [
                                {
                                    "body": "Breakfast and a mimosa are always a good way to wake up!",
                                    "author": "TaylorNicholeXO",
                                    "id": "j8nncq2",
                                    "parent_id": "t1_j8nmghm",
                                    "score": 3,
                                    "created_utc": 1676481534.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Regarding #1 (medical expert here):\n\nSleep apnea is one of the most common undiagnosed conditions in men over 50. He should get checked for apnea, if he's snoring that much.",
            "author": "Nomad_Bill",
            "id": "j8j7bkl",
            "parent_id": "t3_112bsq6",
            "score": 29,
            "created_utc": 1676399406.0,
            "replies": [
                {
                    "body": "This is indeed accurate, but having to sleep with a CPAP machine is not the most incredible experience.",
                    "author": "FLRAdvocate",
                    "id": "j8jg89g",
                    "parent_id": "t1_j8j7bkl",
                    "score": 9,
                    "created_utc": 1676402864.0,
                    "replies": [
                        {
                            "body": "True. But it's not an option. Sleep apnea is worse than being a heavy cigarette smoker, with respect to heart health. Leaving it untreated is Russian Roulette.\n\nThere are other approaches that can work over the long term .... e.g. inclined bed therapy, weight loss, etc.",
                            "author": "Nomad_Bill",
                            "id": "j8jmdpj",
                            "parent_id": "t1_j8jg89g",
                            "score": 12,
                            "created_utc": 1676405260.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "\"Hey, SB, do you mind helping me put my CPAP on?\"",
                    "author": "Beginning_Pear_2231",
                    "id": "j8j9hsx",
                    "parent_id": "t1_j8j7bkl",
                    "score": 11,
                    "created_utc": 1676400251.0,
                    "replies": [
                        {
                            "body": "It’s better than you dying.",
                            "author": "Sunny_Heather",
                            "id": "j8ktds4",
                            "parent_id": "t1_j8j9hsx",
                            "score": 11,
                            "created_utc": 1676423147.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "☝🏼",
                    "author": "night-gloss",
                    "id": "j8j7xum",
                    "parent_id": "t1_j8j7bkl",
                    "score": 5,
                    "created_utc": 1676399648.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I always give exclusive use of my guest bathroom to an SB staying over. Girls appreciate a clean shower, sink and closet of their own with fluffy towels and shampoos etc. \n\nOne of my past SB’s couldn’t sleep sharing a bed (and most research shows the vast majority of people sleep better alone) so she took my spare room. The appreciation she showed me was always more emphatic when she rejoined me next morning!",
            "author": "Regular_Lettuce_9064",
            "id": "j8jgv7i",
            "parent_id": "t3_112bsq6",
            "score": 32,
            "created_utc": 1676403109.0,
            "replies": []
        },
        {
            "body": "I’ll add to this with something positive you can do, it’s something I saw someone mention in another thread and I took to doing it myself:\n\nGet some stuff for her to keep at your place so she can deal with an unexpected overnight gracefully.  A fresh unopened toothbrush, some women’s deodorant, some fancier women’s shampoo/conditioner (for those of us who just use 3-in-one body wash for everything ourselves), make sure there’s an extra fresh towel, etc.",
            "author": "SugarlifeAlt",
            "id": "j8j4urd",
            "parent_id": "t3_112bsq6",
            "score": 48,
            "created_utc": 1676398452.0,
            "replies": [
                {
                    "body": "⬆️ this...plus I always offer my guest bedroom and bathroom for her (upsides of being a single SD).  Only once have I had a SB chose the guest room, but all seem to appreciate having their own bathroom.  It's a little private space.  I also keep a woman's razor, shave gel makeup remover, tampons...etc...They're my guest.  I try to be as prepared as possible for anything that they might need.",
                    "author": "Aquaman949",
                    "id": "j8jawxj",
                    "parent_id": "t1_j8j4urd",
                    "score": 31,
                    "created_utc": 1676400802.0,
                    "replies": [
                        {
                            "body": "I did not there are guys like you guys. Seriously, how heart warming ❤️‍🔥",
                            "author": "curlybabygirly",
                            "id": "j8mo81n",
                            "parent_id": "t1_j8jawxj",
                            "score": 3,
                            "created_utc": 1676466415.0,
                            "replies": []
                        },
                        {
                            "body": "Your place is better stocked than mine. I'd be in heaven",
                            "author": "mladytoyou",
                            "id": "j8o1mi7",
                            "parent_id": "t1_j8jawxj",
                            "score": 3,
                            "created_utc": 1676487044.0,
                            "replies": [
                                {
                                    "body": "😁",
                                    "author": "Aquaman949",
                                    "id": "j8o2ce6",
                                    "parent_id": "t1_j8o1mi7",
                                    "score": 2,
                                    "created_utc": 1676487320.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "it's amazing how appreciative (and surprised) she is when you have a few of these things handy. also some new underwear in her size- always good when she spends the night unexpectedly",
                    "author": "davitech73",
                    "id": "j8jasuz",
                    "parent_id": "t1_j8j4urd",
                    "score": 18,
                    "created_utc": 1676400758.0,
                    "replies": [
                        {
                            "body": "OMG yesssss!!! How thoughtful!!",
                            "author": "mladytoyou",
                            "id": "j8o1r0u",
                            "parent_id": "t1_j8jasuz",
                            "score": 3,
                            "created_utc": 1676487092.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Napkins or tampons also 👌👌",
                    "author": "ccii22",
                    "id": "j8jhdwh",
                    "parent_id": "t1_j8j4urd",
                    "score": 8,
                    "created_utc": 1676403311.0,
                    "replies": []
                },
                {
                    "body": "Love this for you. We SB’s love a considerate and thoughtful daddy 🤍",
                    "author": "noneya3333",
                    "id": "j8jjydb",
                    "parent_id": "t1_j8j4urd",
                    "score": 10,
                    "created_utc": 1676404303.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We do weekend overnights. My SGF has her own bathroom in my house always set up with her toothbrush, toothpaste, shampoo/conditioner, body wash, shower cap, towels, body lotion, hair dryer, tampons, and god knows what else she needs to feel comfortable.",
            "author": "EuropeanDaddyDom",
            "id": "j8jcwa8",
            "parent_id": "t3_112bsq6",
            "score": 14,
            "created_utc": 1676401568.0,
            "replies": []
        },
        {
            "body": "I’ve only had overnights with a few SGF’s because they insisted on it. I don’t like overnights and prefer to sleep alone since it’s hard for me to sleep next to someone.",
            "author": "NewYorkSD",
            "id": "j8jbjir",
            "parent_id": "t3_112bsq6",
            "score": 13,
            "created_utc": 1676401043.0,
            "replies": [
                {
                    "body": "Same! When I’ve gone out of town with my SDs I always insist on a two bedroom AirBNB or two room hotel suite.",
                    "author": "mysticalheavensawait",
                    "id": "j8jlr4c",
                    "parent_id": "t1_j8jbjir",
                    "score": 7,
                    "created_utc": 1676405012.0,
                    "replies": [
                        {
                            "body": "Me too… Adjoining hotel rooms are a great solution.",
                            "author": "RealEarthAngel",
                            "id": "j8n37aq",
                            "parent_id": "t1_j8jlr4c",
                            "score": 3,
                            "created_utc": 1676473460.0,
                            "replies": [
                                {
                                    "body": "I love hotel rooms like that! I can actually get a good nights sleep and that makes me a lot more enjoyable to be around the next morning🤣",
                                    "author": "mysticalheavensawait",
                                    "id": "j8oovbm",
                                    "parent_id": "t1_j8n37aq",
                                    "score": 2,
                                    "created_utc": 1676495851.0,
                                    "replies": [
                                        {
                                            "body": "Totally, good sleep is essential!",
                                            "author": "RealEarthAngel",
                                            "id": "j8p1bit",
                                            "parent_id": "t1_j8oovbm",
                                            "score": 1,
                                            "created_utc": 1676500723.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sleepovers are not worth it. Let the girl go home",
            "author": "Realistic_Scratch912",
            "id": "j8jstb4",
            "parent_id": "t3_112bsq6",
            "score": 22,
            "created_utc": 1676407757.0,
            "replies": []
        },
        {
            "body": "I always get a second hotel room for her.... I like my space... my fav is she comes in early am/have fun/ work out in gym while she has breakfast / have fun again... back to our own lives...",
            "author": "tony1the1tiger",
            "id": "j8jjxp0",
            "parent_id": "t3_112bsq6",
            "score": 9,
            "created_utc": 1676404296.0,
            "replies": [
                {
                    "body": "Like this idea or a 2 bedroom Airbnb",
                    "author": "Hungboy6969420",
                    "id": "j8jn71v",
                    "parent_id": "t1_j8jjxp0",
                    "score": 2,
                    "created_utc": 1676405581.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Feeling triggered rn\n\nMen (sugar or otherwise) who wake me from a pleasant sleep to ask for sex... that won't end well. The rest of the post is good too.",
            "author": "NoLimitLexa",
            "id": "j8j43f2",
            "parent_id": "t3_112bsq6",
            "score": 36,
            "created_utc": 1676398157.0,
            "replies": [
                {
                    "body": "I actually dumped a SD in November for this very reason. I couldn’t tolerate it anymore! I used to dread overnights with him, and always left feeling disrespected & exhausted.",
                    "author": "noneya3333",
                    "id": "j8jlb47",
                    "parent_id": "t1_j8j43f2",
                    "score": 19,
                    "created_utc": 1676404837.0,
                    "replies": [
                        {
                            "body": "So why didn't you decline the overnight after the first incident?",
                            "author": "ThrowawaySDAugust21",
                            "id": "j8ksj3k",
                            "parent_id": "t1_j8jlb47",
                            "score": -1,
                            "created_utc": 1676422746.0,
                            "replies": [
                                {
                                    "body": "The same reason why half the men on this forum don’t divorce their wives.. because I actually liked him and the way he treated me outside certain behaviors. There came a point where he requested more overnights, and I just couldn’t tolerate it anymore regardless of his good qualities.",
                                    "author": "noneya3333",
                                    "id": "j8s69xf",
                                    "parent_id": "t1_j8ksj3k",
                                    "score": 3,
                                    "created_utc": 1676563294.0,
                                    "replies": []
                                },
                                {
                                    "body": "$$$$$ and they can’t replace them easily",
                                    "author": "bbmg69",
                                    "id": "j8lwhn4",
                                    "parent_id": "t1_j8ksj3k",
                                    "score": 0,
                                    "created_utc": 1676445068.0,
                                    "replies": [
                                        {
                                            "body": "So I'll take boat loads of cash and be miserable, but complain on the internet.",
                                            "author": "ThrowawaySDAugust21",
                                            "id": "j8p1v8a",
                                            "parent_id": "t1_j8lwhn4",
                                            "score": 1,
                                            "created_utc": 1676500949.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Number 1 is so true! Nothing, I mean nothing is as loud as chubby 50+ man snoring.\n\nI have spend a lot of my youth traveling Europe and Asia sleeping in hostels. I would sleep better during a night were 4 Italians coming home drunk and a few people getting up to pack at 4am, and someone fall out of their bunk screaming.\n\nI would actually prefer it over a full night with a man with untreated sleep apnea/loud snoring. \n\nJust go to the doctor you guys, taking care of your heath is not embarrassing.",
            "author": "PicturePerfectPotato",
            "id": "j8k767z",
            "parent_id": "t3_112bsq6",
            "score": 5,
            "created_utc": 1676413338.0,
            "replies": []
        },
        {
            "body": "I’m occasionally in Group 1.  Just spent the first overnight with my baby.  Just asked about snoring, she said it put her to sleep.  Yup, she’s a keeper lol.",
            "author": "RedHeavyG603",
            "id": "j8le2af",
            "parent_id": "t3_112bsq6",
            "score": 5,
            "created_utc": 1676433115.0,
            "replies": [
                {
                    "body": "That happens to me too! 😹☺️ it lulls some of us to sleep 🤷‍♀️",
                    "author": "curlybabygirly",
                    "id": "j8mp72g",
                    "parent_id": "t1_j8le2af",
                    "score": 3,
                    "created_utc": 1676466938.0,
                    "replies": [
                        {
                            "body": "Should put that right on your profile! 😂.  I was a little worried she wasn’t sleeping, she barely made a sound unless I hugged her a little (we fell asleep spooning).  I went to get out of bed quietly in the morning and she sleepily said “where are you going? We need to have morning sex!”.  So of course I got right back in!",
                            "author": "RedHeavyG603",
                            "id": "j8mwkyf",
                            "parent_id": "t1_j8mp72g",
                            "score": 1,
                            "created_utc": 1676470584.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm a big snorer and feel guilty about overnights, but most women say it's ok. Either they are being *very* nice or it's not as bad as I think it is.",
            "author": "NinCarolina",
            "id": "j8li8nc",
            "parent_id": "t3_112bsq6",
            "score": 4,
            "created_utc": 1676435382.0,
            "replies": [
                {
                    "body": "I think if they have a problem with it, they will expressly tell you. No one can hide that if it’s a problem! \nMy SBF snores like a tractor sometimes, he’s broken his nose twice so it’s not fixable. It genuinely doesn’t bother me at all. It can get super loud, but if I’m asleep, I’ll sleep through anything. It has probably only bothered me twice but that was because I myself couldn’t get to sleep. \nUsually it lulls me to sleep though! If I could change it, I wouldn’t 💕",
                    "author": "curlybabygirly",
                    "id": "j8mp405",
                    "parent_id": "t1_j8li8nc",
                    "score": 2,
                    "created_utc": 1676466891.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fair points. Does anyone actually wake someone in the middle of the night for sex? That's pretty terrible...",
            "author": "SDinAsia",
            "id": "j8jsxx5",
            "parent_id": "t3_112bsq6",
            "score": 10,
            "created_utc": 1676407805.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j8k9bfw",
                    "parent_id": "t1_j8jsxx5",
                    "score": 7,
                    "created_utc": 1676414235.0,
                    "replies": [
                        {
                            "body": "That’s sexual coercion and is sexual assault…",
                            "author": "Revolutionary-Elk390",
                            "id": "j8lv0nl",
                            "parent_id": "t1_j8k9bfw",
                            "score": 2,
                            "created_utc": 1676443927.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Odd contrast to vanilla dating,...\n\nWhen having a vanilla relationship, I ask my partner if they mind. More often than not their answer is \"you better.\"  They appreciate being wanted, mentally, emotionally, and physically.\n\nif we're not going to have sex at night, the middle of the night, and in the morning, what's the purpose of staying over?",
                    "author": "Spirited-Sun-5924",
                    "id": "j8mg1lm",
                    "parent_id": "t1_j8jsxx5",
                    "score": -1,
                    "created_utc": 1676461323.0,
                    "replies": [
                        {
                            "body": "I dunno man. I work hard so need my beauty sleep. Night and morning yes, but not waking up at 3am for a sesh.",
                            "author": "SDinAsia",
                            "id": "j8mgxal",
                            "parent_id": "t1_j8mg1lm",
                            "score": 4,
                            "created_utc": 1676461942.0,
                            "replies": []
                        },
                        {
                            "body": "I get this same response from the women I sugar date. they look at multiple opportunities for sex as something to look forward to, not as an obligation they would prefer not to be bothered with",
                            "author": "joc13",
                            "id": "j8o9bim",
                            "parent_id": "t1_j8mg1lm",
                            "score": 1,
                            "created_utc": 1676490038.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I don't know about waking her up in the middle of the night, but who doesn't enjoy a second round of sex in the middle of the night or in the morning? \n\nI'm not having her stay over just so I can bring her breakfast in bed the next morning.",
                    "author": "ThrowawaySDAugust21",
                    "id": "j8ksgx5",
                    "parent_id": "t1_j8jsxx5",
                    "score": -13,
                    "created_utc": 1676422718.0,
                    "replies": []
                },
                {
                    "body": "my long term SRs usually become long term SRs because of the fact that we both enjoy the same aspects of sleepovers: cuddling, falling asleep watching movies/TV,  middle of the night sex, morning sex, occasional showers together (even a guy needs to shower alone at times), going to breakfast the next morning, lounging until afternoon checkout, etc\n\nif I'm seeing someone that doesn't enjoy all that, then we won't do overnights, or end up ending the SR",
                    "author": "joc13",
                    "id": "j8o8o9m",
                    "parent_id": "t1_j8jsxx5",
                    "score": 1,
                    "created_utc": 1676489788.0,
                    "replies": [
                        {
                            "body": "Fair point. I envy your stamina.",
                            "author": "SDinAsia",
                            "id": "j8o91lr",
                            "parent_id": "t1_j8o8o9m",
                            "score": 1,
                            "created_utc": 1676489931.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I straight up wouldn’t want to over night with any partner vanilla or sugar. We all need alone time sometimes. And a lot of people are not respectful of personal time when co habituating",
            "author": "Equivalent_Newt_6969",
            "id": "j8jz93k",
            "parent_id": "t3_112bsq6",
            "score": 7,
            "created_utc": 1676410215.0,
            "replies": []
        },
        {
            "body": "One of the gals complained about my snoring.  When I told her she snored too she denied it and got angry.  So that night I recorded a little movie for her, of her sawing logs as she slept.  When I showed it to her the next day it was a little mean, the snoring face she made was not her most attractive look.",
            "author": "NiceGuy737",
            "id": "j8jejxj",
            "parent_id": "t3_112bsq6",
            "score": 9,
            "created_utc": 1676402214.0,
            "replies": [
                {
                    "body": "I will admit, I’m capable of snoring when I’m drunk or sick. I’ve been told it’s very minor and still easy to fall asleep next to me. Now let’s compare that to a grown man grizzly bear snore that happens every single overnight 🙃",
                    "author": "noneya3333",
                    "id": "j8jjsw6",
                    "parent_id": "t1_j8jejxj",
                    "score": 8,
                    "created_utc": 1676404243.0,
                    "replies": [
                        {
                            "body": "Hey now... I think this whole situation can be approached with a bit more balance. Many humans of all genders have nighttime habits (snoring, tossing & turning, etc) which can take adapting from the other partner.",
                            "author": "DisposableDextrose",
                            "id": "j8jmojf",
                            "parent_id": "t1_j8jjsw6",
                            "score": 0,
                            "created_utc": 1676405379.0,
                            "replies": [
                                {
                                    "body": "Very true. I’m less hung up on 1 and even stated im aware it can’t really be “fixed”. 2,3 & 4 are more important behaviors I’ve seen in too many SD’s that request overnights.",
                                    "author": "noneya3333",
                                    "id": "j8jnntg",
                                    "parent_id": "t1_j8jmojf",
                                    "score": 2,
                                    "created_utc": 1676405765.0,
                                    "replies": [
                                        {
                                            "body": "yeah, those are definitely fair game for complaints.  Kind of a combination of lack of human decency, but also a need for establishing/communicating ground rules for the sleepover.",
                                            "author": "DisposableDextrose",
                                            "id": "j8jpvv5",
                                            "parent_id": "t1_j8jnntg",
                                            "score": 2,
                                            "created_utc": 1676406625.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "To date, all my SB's have lived at least an hour's drive away; some up to two.  I entertain at home at least 50% of dates. And I'm not sending her home in the middle of the night, nor do they want to leave, obviously. My goal from the outset is to make my home as comfortable and inviting as possible for my overnight SB guest; which in part includes exclusive use of a well stocked guest bathroom. I want her to feel as comfortable and cared for as possible in my space.  Why wouldn't any legit SD want that for his SB?  Believe me, I know how difficult it can be sharing sleeping quarters and bathrooms with other people after a career spent sharing fire station barracks, fire camp group sleeping spaces and hotel rooms, with guys who snore like chainsaws, thrash and grunt and fart all night like cows.  Fortunately, I don't snore ( guys take note: one of the benefits of staying fit one's entire life)  What was originally intended as a 2nd bedroom is my home office. So I don't have a guestroom to offer up in the rare instance of incompatible sleep habits/needs. But in order to make it work, on a couple of occasions I've moved to the couch - it's no sacrifice. It's a simple concept... A comfortable and well rested SB is a happy appreciative SB. And that's always a good thing. Often first thing in the morning,  if ya know what I mean 😉",
            "author": "CaptBrewster",
            "id": "j8k6f9r",
            "parent_id": "t3_112bsq6",
            "score": 7,
            "created_utc": 1676413031.0,
            "replies": [
                {
                    "body": "Well said. This made me laugh 😹",
                    "author": "curlybabygirly",
                    "id": "j8momq0",
                    "parent_id": "t1_j8k6f9r",
                    "score": 1,
                    "created_utc": 1676466635.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't do well on overnights either. I think if I ever did another one, highly doubtful, I would request separate beds, or rooms that adjoin into a common area, in a hotel suite. I need my space. \n\nMy last overnight, I slept on the couch. I couldn't handle sharing a bed. Plus, he farted in his sleep. Just no. Morning breath is the worst. \n\nI was so tired the next morning. I hated it. I said things I didn't mean. I just do not do well before 10am.",
            "author": "MapleSappling",
            "id": "j8lm1r8",
            "parent_id": "t3_112bsq6",
            "score": 6,
            "created_utc": 1676437620.0,
            "replies": []
        },
        {
            "body": "I refuse to do overnights anymore. It keeps some mystery in the arrangement. No more pawing at me for morning sex when you have bad breath and snored all night 🤮",
            "author": "mysticalheavensawait",
            "id": "j8jlkfp",
            "parent_id": "t3_112bsq6",
            "score": 9,
            "created_utc": 1676404939.0,
            "replies": []
        },
        {
            "body": "SB please stop farting while you sleep…",
            "author": "Serge_banker",
            "id": "j8jb6jq",
            "parent_id": "t3_112bsq6",
            "score": 10,
            "created_utc": 1676400905.0,
            "replies": [
                {
                    "body": "😂🤣",
                    "author": "Puzzleheaded_Baby570",
                    "id": "j8k337j",
                    "parent_id": "t1_j8jb6jq",
                    "score": 0,
                    "created_utc": 1676411694.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Flashbacks to that fateful night when I legit thought the SD had died because he didn't take a breath for 2 minutes straight.",
            "author": "MimiRodriguez",
            "id": "j8ma1pf",
            "parent_id": "t3_112bsq6",
            "score": 2,
            "created_utc": 1676456563.0,
            "replies": []
        },
        {
            "body": "I'm so self conscious about snoring on overnights 😂 One thing I can't stand is being touched while sleeping. I think it may not be a bad idea to just take the couch, but I fear losing some of the intimacy and specialness of the overnight experience by hauling off out of bed as it's getting late. \n\nGood post OP. Things to think about.",
            "author": "Worldly-wanderer",
            "id": "j8n0xle",
            "parent_id": "t3_112bsq6",
            "score": 2,
            "created_utc": 1676472494.0,
            "replies": []
        },
        {
            "body": "Lol, you’re with someone who has been in very cold bedroom in his marriage or hasn’t had fire in his sexual life.  It has nothing to do with SB staying overnight.  I regularly have my SB sleep over and I don’t have that kind of behavior.  It’s more of a convenience to spend time overnight watching Netflix and having conversations, sipping wine, and video gaming then just being used as a sex doll.",
            "author": "MKTekke",
            "id": "j8jvix3",
            "parent_id": "t3_112bsq6",
            "score": 6,
            "created_utc": 1676408785.0,
            "replies": [
                {
                    "body": "You could be right, and I like your way of thinking on the last sentence! A few SD’s in the comments aren’t handling the constructive criticism very well and probably disregard their SB’s comfort. It will soon lead to her dumping them, or her finding excuses to not stay the night anymore. Notice how every SB that commented understood the post? I can’t be lying or making this stuff up.",
                    "author": "noneya3333",
                    "id": "j8jwgt8",
                    "parent_id": "t1_j8jvix3",
                    "score": 8,
                    "created_utc": 1676409141.0,
                    "replies": [
                        {
                            "body": "PREACH SISTa!!!!",
                            "author": "lanena__",
                            "id": "j8lbovj",
                            "parent_id": "t1_j8jwgt8",
                            "score": 1,
                            "created_utc": 1676431900.0,
                            "replies": []
                        },
                        {
                            "body": "the women who disagree with you aren't going to comment, for fear of being labeled as \"pick me\"s and brigade downvoted",
                            "author": "joc13",
                            "id": "j8o9nhu",
                            "parent_id": "t1_j8jwgt8",
                            "score": 0,
                            "created_utc": 1676490165.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "1. Yes I snore. Some of the ladies have snored too ! But I use the breathing strips now if doing an overnight.\n2. This \"to me\" is a case by case thing. I've had sb's who were just as game as I was. While others may do one late late night round. We fall asleep. Then get another one in early in the morning.\n3. I've never showered with a sb before. If she asked me to I would.\n4. She usually leaves around 7am. I'm not far behind her leaving the room.\n\nAs I always say, it's what you discuss and negotiate. I've been lucky enough to have more ladies who like 3am rounds than not.",
            "author": "southernslick",
            "id": "j8kt09o",
            "parent_id": "t3_112bsq6",
            "score": 4,
            "created_utc": 1676422969.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j8j6m9m",
            "parent_id": "t3_112bsq6",
            "score": 6,
            "created_utc": 1676399138.0,
            "replies": [
                {
                    "body": "lol no\n\nSleepovers with kind and respectful men that care about my needs are amazing.",
                    "author": "NoLimitLexa",
                    "id": "j8j9alr",
                    "parent_id": "t1_j8j6m9m",
                    "score": 15,
                    "created_utc": 1676400173.0,
                    "replies": []
                },
                {
                    "body": "cool siri bruh 😎",
                    "author": "NickPfromYuma",
                    "id": "j8jb1uf",
                    "parent_id": "t1_j8j6m9m",
                    "score": 1,
                    "created_utc": 1676400855.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "1. Do I snore?  Doesn't she?\n2. Who would do such a thing?\n3. I just catered to her for the last 12+ hours.\n4. Who would do such a thing?",
            "author": "Beginning_Pear_2231",
            "id": "j8j61y4",
            "parent_id": "t3_112bsq6",
            "score": 0,
            "created_utc": 1676398921.0,
            "replies": [
                {
                    "body": "2 & 4 almost every SD I had overnights with did, and it drove me absolutely batshit. You’d think older men would know better. I made the post to let men know they’re subconsciously driving their SB up the wall, and she will gossip to her girlfriends about how annoying you are.",
                    "author": "noneya3333",
                    "id": "j8jistl",
                    "parent_id": "t1_j8j61y4",
                    "score": 12,
                    "created_utc": 1676403853.0,
                    "replies": [
                        {
                            "body": "2 & 4 are nuts, but who is confident that they snore like a buzz saw, and why do they know this?   Because their mattress partner tells them.\n\nAside from informing, there are ways to mitigate snoring such as sleeping on one's side or sleeping with the shoulders elevated (sleep number bed snore mode, for instance).",
                            "author": "Beginning_Pear_2231",
                            "id": "j8jjgep",
                            "parent_id": "t1_j8jistl",
                            "score": 1,
                            "created_utc": 1676404108.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "💗",
                    "author": "P0sitiveViibes777",
                    "id": "j8j6v4v",
                    "parent_id": "t1_j8j61y4",
                    "score": 2,
                    "created_utc": 1676399232.0,
                    "replies": []
                },
                {
                    "body": "Sounds like she thinks she is doing a big favor by sleeping over. A caring person would give some feedback directly to the SD in a nice way\n\nTBH, I do prefer sleeping in separate beds as my own uninterrupted sleep is precious to me and I would want to give the other person the same comfort and space",
                    "author": "OCbird22",
                    "id": "j8jidh2",
                    "parent_id": "t1_j8j61y4",
                    "score": 2,
                    "created_utc": 1676403690.0,
                    "replies": []
                },
                {
                    "body": "2. As a single guy in his mid-50s, that also dates vanilla, most of my partners appreciated being woke up in the middle of the night for that. I've actually asked if it's okay with them, most of the time it's an enthusiastic \"yes.\"",
                    "author": "Spirited-Sun-5924",
                    "id": "j8mguya",
                    "parent_id": "t1_j8j61y4",
                    "score": -1,
                    "created_utc": 1676461898.0,
                    "replies": [
                        {
                            "body": "I hear you, but just because one woman likes something, doesn’t mean the rest will. Imo the SD should let the SB initiate middle-of-the night sex. I’ve done it on my own after SD jokingly suggested it but detest when it’s pushed on me.",
                            "author": "noneya3333",
                            "id": "j8no2aa",
                            "parent_id": "t1_j8mguya",
                            "score": 1,
                            "created_utc": 1676481808.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "OMG I literally can’t with the wanting to shower with me like honestly when I go to the bathroom even if it’s for a minute or two to even wash my hands I’m collecting myself and I don’t do many overnights, but even my hour or three bookings they are so annoying with wanting to shower with me. As I’ve gotten older, I’m now 24 it’s been a lot easier to set boundaries and I honestly have to get very bitchy with some butt. I am very assertive and I don’t regret it because I need my space if I’ve been with you the past two hours and wanna shower, leave me alone and take your own goddamn shower",
            "author": "lanena__",
            "id": "j8lbajy",
            "parent_id": "t3_112bsq6",
            "score": 3,
            "created_utc": 1676431698.0,
            "replies": [
                {
                    "body": "> but even my hour or three bookings they are so annoying with wanting to shower with me.\n\nThat's an interesting turn of phrase.  Not exactly the sort of phrase that I would expect an SB to use - \"bookings\".  That sounds a lot more like sex work.\n\n>... if I’ve been with you the past two hours and wanna shower, leave me alone and take your own goddamn shower.\n\nMost times that I've seen SBs we haven't even got back to my home within two hours as we've been out having a great time together.  \n\nI would perhaps suggest that your line of work is rather different to the experience that a lot of SBs and SDs have.",
                    "author": "HecatesCats",
                    "id": "j8ocgks",
                    "parent_id": "t1_j8lbajy",
                    "score": 1,
                    "created_utc": 1676491214.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "RE #1.......get a 2 BR AirBnB.  Sleep time is for sleeping anyway. 😉",
            "author": "Harpua1",
            "id": "j8js11w",
            "parent_id": "t3_112bsq6",
            "score": 2,
            "created_utc": 1676407458.0,
            "replies": []
        },
        {
            "body": "A mild fear of being overbearing is why I get purposely get a suite during the hotel phase. That way my SB can have her own little lounge-ish zone outside of the bedroom where I purposely don’t intrude.",
            "author": "fleeingdivision",
            "id": "j8lpzib",
            "parent_id": "t3_112bsq6",
            "score": 2,
            "created_utc": 1676440197.0,
            "replies": []
        },
        {
            "body": "Sleeping over with SB? Isn't that what your wife is for😂🤣",
            "author": "Puzzleheaded_Baby570",
            "id": "j8k3bz6",
            "parent_id": "t3_112bsq6",
            "score": 3,
            "created_utc": 1676411790.0,
            "replies": [
                {
                    "body": "Because we are all married right?  Username checks out.",
                    "author": "DarthDaddius",
                    "id": "j8k5csp",
                    "parent_id": "t1_j8k3bz6",
                    "score": 1,
                    "created_utc": 1676412596.0,
                    "replies": []
                },
                {
                    "body": "Why do you assume that most SDs are married?",
                    "author": "HecatesCats",
                    "id": "j8oczb3",
                    "parent_id": "t1_j8k3bz6",
                    "score": 1,
                    "created_utc": 1676491413.0,
                    "replies": [
                        {
                            "body": "It was a joke.  Should i put more emojis next time?",
                            "author": "Puzzleheaded_Baby570",
                            "id": "j8od8at",
                            "parent_id": "t1_j8oczb3",
                            "score": 1,
                            "created_utc": 1676491508.0,
                            "replies": [
                                {
                                    "body": "Sorry, from reading your comment it appeared that you were laughing *at* guys who sleep over with an SB, suggesting that they were lesser than SDs who don't sleep over with their SB.\n\nThe presence of the emojis didn't affect the meaning, it just seemed to emphasise that you were laughing *at* SDs that did this.",
                                    "author": "HecatesCats",
                                    "id": "j8ogd1f",
                                    "parent_id": "t1_j8od8at",
                                    "score": 2,
                                    "created_utc": 1676492669.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve had #2 happen to me as well. Not only did he wake me up numerous times throughout the night, but every time we would finish a round, he would try to prevent me from falling asleep when we cuddled afterwards by jerking his limbs so that he could eventually initiate AGAIN. It was miserable.",
            "author": "kaptainkrunchie",
            "id": "j8m5ixf",
            "parent_id": "t3_112bsq6",
            "score": 1,
            "created_utc": 1676452647.0,
            "replies": []
        },
        {
            "body": "Ah, yes the \"other forum\" report made it here. Thank goodness.",
            "author": "JohnnyKemmer009",
            "id": "j8ncvyd",
            "parent_id": "t3_112bsq6",
            "score": 1,
            "created_utc": 1676477404.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j8jovfg",
            "parent_id": "t3_112bsq6",
            "score": -1,
            "created_utc": 1676406235.0,
            "replies": [
                {
                    "body": "Im not a SD, so why would a make a post entailing annoying behaviors from SB’s? If you want to do that to enlighten us, I’d actually love that. I can handle constructive criticism and would hope I’m not subconsciously driving my SD up the wall.",
                    "author": "noneya3333",
                    "id": "j8jpc2l",
                    "parent_id": "t1_j8jovfg",
                    "score": 8,
                    "created_utc": 1676406412.0,
                    "replies": []
                },
                {
                    "body": ">Dumping on others, but I can assure you women toss and turn just as much and snore just as often.\n\nAnd the drooling, and the stealing of the blankets....",
                    "author": "ThrowawaySDAugust21",
                    "id": "j8ksq9w",
                    "parent_id": "t1_j8jovfg",
                    "score": 1,
                    "created_utc": 1676422839.0,
                    "replies": [
                        {
                            "body": "And makeup all over your pillows and sheets that don't always come out lmao. \n\nI think the point is, plenty ALL sides can complain about so doing so just comes off... Well... Just saying lol.",
                            "author": "Far_Introduction527",
                            "id": "j8kuq05",
                            "parent_id": "t1_j8ksq9w",
                            "score": 2,
                            "created_utc": 1676423793.0,
                            "replies": [
                                {
                                    "body": "lol I see your guy’s point, but I always take my makeup off before bed and sometimes guilty for hogging the blankets. I don’t think either behavior is annoying enough to upset my two SD’s though. The point in the post were a few staples that could absolutely cause your SB to dump you.. Smothering and not respecting her boundaries are a bit different.",
                                    "author": "noneya3333",
                                    "id": "j8s4m19",
                                    "parent_id": "t1_j8kuq05",
                                    "score": 0,
                                    "created_utc": 1676562636.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "*the other forum*\n\n???",
            "author": "BinghamtonSD",
            "id": "j8j8kca",
            "parent_id": "t3_112bsq6",
            "score": 0,
            "created_utc": 1676399893.0,
            "replies": []
        },
        {
            "body": "\n1.\t Oh, really?  And here all the wealthy older men of the world thought that women love snoring. \n2.\t Really?  You don’t want to be woken up for sex multiple times during a night?   If you have an SD who wakes you up for sex, find a new SD.  \n3.\tMost of the girls on “the other forum” wouldn’t be caught dead with an SD for 12 hours, but with that point aside, use your big girl voice and ask him for privacy if you’ve just spent that long together. \n4.\tIf I just spent an entire overnight date with someone, it’s not “passive aggressive” to ask what her plans are.   The only reason you’re interpreting it that way is if you are seeing 3 other dudes and lying to him about it.\n\n\n*further* *edit* Since the misandrist dictator who has unfortunately become the head moderator on this sub has banned me from further posting, I’ll defend my unwarranted ban here.  My comment above did not say a damned thing in violation of sub rules.  She may label me as toxic, but allows toxic posts all of the time, as long as they happen to be from her preferred gender.  Meanwhile I have 1600 karma in a 5 week old account, which the last time I checked is the metric that Reddit put in place to determine if someone was \"adding anything positive to the community.\"  But, again, her modding is about she likes, not what's best for the community.\n\nAnyway, peace ya’ll.  Have fun dealing with the escorts and Johns that, by her own admission, have taken over the sub under her “leadership.”",
            "author": "DarthDaddius",
            "id": "j8k4s4l",
            "parent_id": "t3_112bsq6",
            "score": -9,
            "created_utc": 1676412367.0,
            "replies": [
                {
                    "body": "Why is your every interaction here confrontational and antagonistic? Find a better way to communicate. Your presence here is contributing nothing positive to this community and is really toxic. If you need to take a break take it before you receive a permanent one.",
                    "author": "LaSirene23",
                    "id": "j8khnvs",
                    "parent_id": "t1_j8k4s4l",
                    "score": 21,
                    "created_utc": 1676417828.0,
                    "replies": [
                        {
                            "body": "Thank you for acknowledging his borderline abusive tendencies. I notice his comments here & there on this forum, and he actually NEVER says anything positive, enriching, nor does he offer any advice. He only comments to say negative things and insult people. I’m honestly surprised he hasn’t been banned from this forum yet. I take his words with a grain of salt, and don’t expect anything less from him. It’s funny how he doesn’t even acknowledge this behavior exists until he’s presented with advice from other men & he’s threatened with permanent banning. He’s actively insulted women who are on the sugarbabyonly forum multiple times too. I’ve actually started to ponder if he’s even in the sugar community, or just a troll. If he is, it seems his SB doesn’t do her job with leaving him satisfied, otherwise he wouldn’t be so salty all the time. This post was constructive criticism for SD’s to optimize their SB’s experiences with overnights.",
                            "author": "noneya3333",
                            "id": "j8lod5w",
                            "parent_id": "t1_j8khnvs",
                            "score": 10,
                            "created_utc": 1676439101.0,
                            "replies": []
                        },
                        {
                            "body": "Omg thank you LaSirene.",
                            "author": null,
                            "id": "j8kpshy",
                            "parent_id": "t1_j8khnvs",
                            "score": 7,
                            "created_utc": 1676421488.0,
                            "replies": []
                        },
                        {
                            "body": "🤍",
                            "author": "manninc2000",
                            "id": "j8lh9ug",
                            "parent_id": "t1_j8khnvs",
                            "score": 2,
                            "created_utc": 1676434840.0,
                            "replies": []
                        },
                        {
                            "body": "*Every* interaction I have here is not, but, yes, I am more likely to comment on something I disagree with than something I agree with.  You are welcome to your opinion that I’m not adding anything positive to the community, but I disagree, and if you want to ban people for being toxic there are a *lot* of people that you should be banning.\n\n*eta* It’s also incredibly ironic that you’d post this on a ridiculously negative post that I commented on.  What SD needs to be informed of any of the things OP was talking about?  Who is reading that saying “oh damn I had no idea my SB wouldn’t like it if I snore in her ear all night then wake her up for sex and then follow her into the bathroom?”",
                            "author": "DarthDaddius",
                            "id": "j8kipk1",
                            "parent_id": "t1_j8khnvs",
                            "score": -4,
                            "created_utc": 1676418294.0,
                            "replies": [
                                {
                                    "body": "Unfortunately, you would be surprised.  When I introduced  my CPAP to my last SB, she mentioned her previous SD had one but barely used it and his snoring was awful. I've had incidents described to me of agreed upon boundaries like #2 and #3 not being respected.  While you may be a quality man where those issues would never occur there are lesser \"SDs\" not following the same code.",
                                    "author": "manninc2000",
                                    "id": "j8lhvqy",
                                    "parent_id": "t1_j8kipk1",
                                    "score": 9,
                                    "created_utc": 1676435176.0,
                                    "replies": [
                                        {
                                            "body": "Snoring is, as the OP said, something that you can only do so much about, so I’ll leave that aside. \n\nA man who is waking up his partner for sex in the middle of the night, multiple times, is not an SD, or at least not a good one.  I would bet in most cases it’s a John who’s seeing an escort calling herself and SB or treating an actual SB like an escort.  You don’t wake up your partner from a sound sleep to fuck unless you’re trying to get the most bang for your buck (literally) which isn’t something you’d do in a relationship.   Regardless, no one is going to read that post and say “oh shit I should be a decent human and not treat this girl like a sex toy.”\n\nAs to number 3, as I said in my prior comment, it comes down to a conversation and no decent guy is going to give her a hard time.  Again, maybe some escort charging a client a normal PPM per hour is going to experience something differently, but a decent SD is not going to behave that way, and no one reading her post is going to change their behavior.",
                                            "author": "DarthDaddius",
                                            "id": "j8ln932",
                                            "parent_id": "t1_j8lhvqy",
                                            "score": 1,
                                            "created_utc": 1676438376.0,
                                            "replies": [
                                                {
                                                    "body": "Some people need this post. More than you know. Maybe some SB’s lurking in the corner exhibit this behaviour too and are realising they need to fix it. \n\nThe post is constructive. Just because you don’t need this doesn’t mean no one else does either?\nThat’s like going into primary school and screaming everyone knows this!!\nWell some people don’t. \n\nI have seen a few guys admitting to their snoring in the comments. Some people just need incentive to take action. \nIf guys are doing the other things on the post, why on earth would they out themselves? It’s embarrassing.\n\nRespectfully, as an SD, you have no idea what it’s like to be with other SDs. As an SB, I can’t say I don’t react like X so NO OTHER SB’s react like X.\n\nClearly if OP went through the trouble of writing the post, it’s safe to say that SOME men acted like that. If SB’s have discussed the topic before, clearly it’s an issue. Why’s that so hard to understand? It may be a negative post but I’m SURE experiencing that is negative as well.\n\nHow delusional do you have to be for someone to outline their experience and counter it with **ACTUALLY, that doesn’t exist**\n\nLook how many women are in agreement in the comments. It obviously needed to be said. Now some guys can see why their relationship may not have worked out. Some people are not self aware, and it’s an insult to those who are changing their behaviour to say “no one needs this”.\n\nPersonally, I’ve only experienced snoring. But I’m not an experienced SB. NEITHER ARE YOU.",
                                                    "author": "curlybabygirly",
                                                    "id": "j8mrkuv",
                                                    "parent_id": "t1_j8ln932",
                                                    "score": 7,
                                                    "created_utc": 1676468180.0,
                                                    "replies": [
                                                        {
                                                            "body": ">> How delusional do you have to be for someone to outline their experience and counter it with ACTUALLY, that doesn’t exist\n\nHow delusional do you have to be to think that I wrote that when I didn’t say anything like that?\n\nAs to the rest of your rant, as I said before, yes, many if not most older men snore.  As do a lot of younger women, especially if they drink, but it’s certainly more common with older men.  That’s not news and it’s not that men are “admitting” it and realizing “omg I had no idea.”   \n\nAs to the other behaviors, my point is that the men doing them are not behaving as SDs and that the SBs should not stay with them.  Sounds like a pro-SB argument to me, yet I’m lableles as the negative toxic SD.  🤷‍♂️",
                                                            "author": "DarthDaddius",
                                                            "id": "j8mts9h",
                                                            "parent_id": "t1_j8mrkuv",
                                                            "score": -2,
                                                            "created_utc": 1676469264.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I have no idea how wanting to sleep through the night makes you a pro SB   but from reading through this thread you clearly  didn't take my warning seriously. You need to find another community that's a better fit for you.",
                                                                    "author": "LaSirene23",
                                                                    "id": "j8n9dzr",
                                                                    "parent_id": "t1_j8mts9h",
                                                                    "score": 6,
                                                                    "created_utc": 1676476005.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "and why wasn't this post deleted to begin with when it self proclaimed that it was brought here from another subreddit? with an obvious anti-SD agenda?",
                                                                            "author": "joc13",
                                                                            "id": "j8obkn2",
                                                                            "parent_id": "t1_j8n9dzr",
                                                                            "score": -1,
                                                                            "created_utc": 1676490891.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "What part of it is an anti SD agenda? \n\n* wanting to sleep through the night without being woken up multiple times for sex?\n\n* Some personal time alone to take a shower after spending multiple hours together\n\n* Or not being guilt tripped/manipulated the morning after an overnight when a Sb wants to leave and go home?\n\nShould I assume from your comment that a Sb has no right to expect these things and that by her creating this post  she's advocating taking advantage of SDs and this post should be removed?",
                                                                                    "author": "LaSirene23",
                                                                                    "id": "j8olwsr",
                                                                                    "parent_id": "t1_j8obkn2",
                                                                                    "score": 4,
                                                                                    "created_utc": 1676494743.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "Strawman.",
                                                                            "author": "OldschoolSD",
                                                                            "id": "j8pl0x8",
                                                                            "parent_id": "t1_j8n9dzr",
                                                                            "score": 1,
                                                                            "created_utc": 1676509306.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Lol u sound miserable yikes....its ok to be happy sometimes",
                                    "author": "ballerina-",
                                    "id": "j8lfgr6",
                                    "parent_id": "t1_j8kipk1",
                                    "score": 4,
                                    "created_utc": 1676433851.0,
                                    "replies": [
                                        {
                                            "body": "LOL I’m quite happy.   Why is it that both you and our esteemed leader are calling me out for negativity and not the OP who is being incredibly negative and acting like all SDs are buffoons who don’t know women like to sleep and not be treating like sex toys?   Dare I say you are both faster to criticize a man (like OP is) than a woman?!?",
                                            "author": "DarthDaddius",
                                            "id": "j8lmie7",
                                            "parent_id": "t1_j8lfgr6",
                                            "score": -6,
                                            "created_utc": 1676437905.0,
                                            "replies": [
                                                {
                                                    "body": "it's the same double standard that's been going on for a while now. women can come on here and bash men all they want, but if the men are critical, or God forbid just humorously sarcastic, we are evil.",
                                                    "author": "joc13",
                                                    "id": "j8oabbq",
                                                    "parent_id": "t1_j8lmie7",
                                                    "score": -2,
                                                    "created_utc": 1676490417.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I stopped reading after this female painted all men into the same box.\n\nGood riddance.",
            "author": null,
            "id": "j8klm1p",
            "parent_id": "t3_112bsq6",
            "score": -6,
            "created_utc": 1676419596.0,
            "replies": []
        },
        {
            "body": "These are all fair, but toss a guy a bone sometimes and shower together. It's nice.",
            "author": "whatever-tata",
            "id": "j8j6thm",
            "parent_id": "t3_112bsq6",
            "score": -3,
            "created_utc": 1676399214.0,
            "replies": [
                {
                    "body": "That’s definitely not a big deal and fine to shower together sometimes but some guys literally want to do it every time I’ve literally had to dump a guy because one didn’t respect my boundaries at all and I literally had to ask him with everything between literally laying on me in bed And other things “do you literally want to get in my skin? I am literally right next to you. I’m never on my phone I pay attention to you and you have my undivided if I want to lay on the bed and not be smothered you have to respect that quotes and he didn’t “ some people literally think they on you and some people are totally cool, decent human beings, and some just because they pay money want to get their moneys worth. I hate it.",
                    "author": "lanena__",
                    "id": "j8lc3ar",
                    "parent_id": "t1_j8j6thm",
                    "score": 4,
                    "created_utc": 1676432109.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "1, 3 and 4 from the original post are not an issue with me, fortunately. \n\nBut 2, waking up for sex, that just happens in many good sexual relationships.   I'm surprised to hear it spoken of in such a negative way by multiple posters.   And yes, of course you shouldn't wake up your partner if they have to wake up early.\n\nI guess I was fortunate with the previous,  7 year SB.   Sometimes she woke me up and sometimes I woke her up.   I would guess it was roughly an equal number of times as far as who woke who up.   The majority of the time, the other was interested.   Occasionally,  the other was not, and their wishes were respected with no whining or anything.    \n\nIt comes down to communicating with your partner.    But someone waking you up for sex is not usually an annoying thing, IMHO.   Me, I found it flattering even if I was worn out from multiple rounds.",
            "author": "irlandais9000",
            "id": "j8s0zb6",
            "parent_id": "t3_112bsq6",
            "score": 0,
            "created_utc": 1676561190.0,
            "replies": []
        },
        {
            "body": "I thought these were all good things to do?",
            "author": "Odd-Luck7658",
            "id": "j8k4lf2",
            "parent_id": "t3_112bsq6",
            "score": -4,
            "created_utc": 1676412290.0,
            "replies": []
        },
        {
            "body": "You snorers are so lucky. I talk in my sleep. I thought I grew out of it but, as I have been recently informed, I have not.",
            "author": "dontkillmejustkinkme",
            "id": "j8ld8o7",
            "parent_id": "t3_112bsq6",
            "score": 1,
            "created_utc": 1676432692.0,
            "replies": [
                {
                    "body": "I stayed the night at my friends recently and she caught me doing math in my sleep",
                    "author": "TryHard-POPS",
                    "id": "j8lj65p",
                    "parent_id": "t1_j8ld8o7",
                    "score": 4,
                    "created_utc": 1676435915.0,
                    "replies": [
                        {
                            "body": "Did you get the answer right?",
                            "author": "dontkillmejustkinkme",
                            "id": "j8ljlvp",
                            "parent_id": "t1_j8lj65p",
                            "score": 1,
                            "created_utc": 1676436169.0,
                            "replies": [
                                {
                                    "body": "I hope so otherwise I’m in deep trouble",
                                    "author": "TryHard-POPS",
                                    "id": "j8ljobb",
                                    "parent_id": "t1_j8ljlvp",
                                    "score": 3,
                                    "created_utc": 1676436208.0,
                                    "replies": [
                                        {
                                            "body": "The implications of this comment are limitless. Why are you in trouble? What was the math for? What happens if the math is _wrong??_  My mind is reeling.",
                                            "author": "dontkillmejustkinkme",
                                            "id": "j8ll1o5",
                                            "parent_id": "t1_j8ljobb",
                                            "score": 2,
                                            "created_utc": 1676437006.0,
                                            "replies": [
                                                {
                                                    "body": "I do math out loud for my business while awake, so if I’m getting it wrong in my sleep then I must not be doing it right and the IRS will come after me, I guess it’s a good thing I didn’t file my taxes in my sleep though",
                                                    "author": "TryHard-POPS",
                                                    "id": "j8ll6f6",
                                                    "parent_id": "t1_j8ll1o5",
                                                    "score": 3,
                                                    "created_utc": 1676437086.0,
                                                    "replies": [
                                                        {
                                                            "body": "if it's the IRS you're worried about, you're not doing *math*, you're doing arithmetic 😉",
                                                            "author": "joc13",
                                                            "id": "j8ob53b",
                                                            "parent_id": "t1_j8ll6f6",
                                                            "score": 3,
                                                            "created_utc": 1676490732.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Partners tolerate annoying habits if they love them. For a non love sugar arrangement annoying is just --annoying. Don't do ONs if it doesn't make you happy.\n\nFor the ladies, are there ANY men over 40 who don't snore?",
            "author": "GSSD",
            "id": "j8muc37",
            "parent_id": "t3_112bsq6",
            "score": 1,
            "created_utc": 1676469525.0,
            "replies": []
        },
        {
            "body": "One of my exes was hardcore #1 -- undiagnosed sleep apnea. After getting a cpap machine, it was perfect! Before then, I just had to move to a different room as soon as the bear snores began hahaha",
            "author": "HarvardLawSB",
            "id": "j8jnp47",
            "parent_id": "t1_j8j42rv",
            "score": 20,
            "created_utc": 1676405779.0,
            "replies": [
                {
                    "body": "I am a heavy snorer.  I introduced my CPAP as not \"sexy\" but it will make sure we are rested for when we need the energy. 😉 Surprisingly, when I've fallen asleep without putting on my mask I don't get beaten awake to put it back on. I usually woke myself up and threw it on. I would recommend it to anyone as a way to improve their health and their relationship.",
                    "author": "manninc2000",
                    "id": "j8lg4e2",
                    "parent_id": "t1_j8jnp47",
                    "score": 7,
                    "created_utc": 1676434204.0,
                    "replies": []
                },
                {
                    "body": "LOL I can imagine. I thought I had apnea when someone pointed out my snoring to me (I was oblivious, of course), but as it turns out it's a different medical issue. I would say its about 50/50 since then on whether an SB I was seeing would choose the spare room rather than bunk with Snorasaurus Rex. I don't blame them at all, although the mouthguard has significantly reduced it.",
                    "author": "Hot_Selection3626",
                    "id": "j8jpjt6",
                    "parent_id": "t1_j8jnp47",
                    "score": 7,
                    "created_utc": 1676406495.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Trying to be considerate is what really matters, you’re a good man.",
            "author": "PrettyGirlSpicy",
            "id": "j8jq5q6",
            "parent_id": "t1_j8j42rv",
            "score": 14,
            "created_utc": 1676406733.0,
            "replies": [
                {
                    "body": "Aww thanks!",
                    "author": "Hot_Selection3626",
                    "id": "j8jt69z",
                    "parent_id": "t1_j8jq5q6",
                    "score": 7,
                    "created_utc": 1676407892.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "To me, this is the best way to handle it.",
            "author": "FLRAdvocate",
            "id": "j8jgyo6",
            "parent_id": "t1_j8j42rv",
            "score": 12,
            "created_utc": 1676403147.0,
            "replies": []
        },
        {
            "body": "Can you send me more info about this customized mouth guard?",
            "author": "eurosd",
            "id": "j8k9e8k",
            "parent_id": "t1_j8j42rv",
            "score": 6,
            "created_utc": 1676414267.0,
            "replies": [
                {
                    "body": "Sure, it’s an OTC device:\n\nhttps://smartguardrx.com/products/anti-snore-device?sscid=21k7_jh019&",
                    "author": "Hot_Selection3626",
                    "id": "j8kcp4q",
                    "parent_id": "t1_j8k9e8k",
                    "score": 6,
                    "created_utc": 1676415665.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You sir, are a class act!",
            "author": "TaylorNicholeXO",
            "id": "j8njzf9",
            "parent_id": "t1_j8j42rv",
            "score": 3,
            "created_utc": 1676480219.0,
            "replies": [
                {
                    "body": "You are sweet. I just understand how unbearable it can be to sleep with someone who snores loudly, or if the mouthguard is in, snores softly. As others have pointed out, sleeping alone tends to result in the best sleep, particularly once you get the oxytocin flowing post-sex.   \n\n\nWhile I do enjoy falling asleep and cuddling, the practical side of it is that some cannot tolerate any snoring. At least if my SB stays over, I can make breakfast in the morning (which is one of my favorite activities). So it's a good enticement to stay. :)",
                    "author": "Hot_Selection3626",
                    "id": "j8nmghm",
                    "parent_id": "t1_j8njzf9",
                    "score": 3,
                    "created_utc": 1676481186.0,
                    "replies": [
                        {
                            "body": "Breakfast and a mimosa are always a good way to wake up!",
                            "author": "TaylorNicholeXO",
                            "id": "j8nncq2",
                            "parent_id": "t1_j8nmghm",
                            "score": 3,
                            "created_utc": 1676481534.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is indeed accurate, but having to sleep with a CPAP machine is not the most incredible experience.",
            "author": "FLRAdvocate",
            "id": "j8jg89g",
            "parent_id": "t1_j8j7bkl",
            "score": 9,
            "created_utc": 1676402864.0,
            "replies": [
                {
                    "body": "True. But it's not an option. Sleep apnea is worse than being a heavy cigarette smoker, with respect to heart health. Leaving it untreated is Russian Roulette.\n\nThere are other approaches that can work over the long term .... e.g. inclined bed therapy, weight loss, etc.",
                    "author": "Nomad_Bill",
                    "id": "j8jmdpj",
                    "parent_id": "t1_j8jg89g",
                    "score": 12,
                    "created_utc": 1676405260.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"Hey, SB, do you mind helping me put my CPAP on?\"",
            "author": "Beginning_Pear_2231",
            "id": "j8j9hsx",
            "parent_id": "t1_j8j7bkl",
            "score": 11,
            "created_utc": 1676400251.0,
            "replies": [
                {
                    "body": "It’s better than you dying.",
                    "author": "Sunny_Heather",
                    "id": "j8ktds4",
                    "parent_id": "t1_j8j9hsx",
                    "score": 11,
                    "created_utc": 1676423147.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "☝🏼",
            "author": "night-gloss",
            "id": "j8j7xum",
            "parent_id": "t1_j8j7bkl",
            "score": 5,
            "created_utc": 1676399648.0,
            "replies": []
        },
        {
            "body": "⬆️ this...plus I always offer my guest bedroom and bathroom for her (upsides of being a single SD).  Only once have I had a SB chose the guest room, but all seem to appreciate having their own bathroom.  It's a little private space.  I also keep a woman's razor, shave gel makeup remover, tampons...etc...They're my guest.  I try to be as prepared as possible for anything that they might need.",
            "author": "Aquaman949",
            "id": "j8jawxj",
            "parent_id": "t1_j8j4urd",
            "score": 31,
            "created_utc": 1676400802.0,
            "replies": [
                {
                    "body": "I did not there are guys like you guys. Seriously, how heart warming ❤️‍🔥",
                    "author": "curlybabygirly",
                    "id": "j8mo81n",
                    "parent_id": "t1_j8jawxj",
                    "score": 3,
                    "created_utc": 1676466415.0,
                    "replies": []
                },
                {
                    "body": "Your place is better stocked than mine. I'd be in heaven",
                    "author": "mladytoyou",
                    "id": "j8o1mi7",
                    "parent_id": "t1_j8jawxj",
                    "score": 3,
                    "created_utc": 1676487044.0,
                    "replies": [
                        {
                            "body": "😁",
                            "author": "Aquaman949",
                            "id": "j8o2ce6",
                            "parent_id": "t1_j8o1mi7",
                            "score": 2,
                            "created_utc": 1676487320.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "it's amazing how appreciative (and surprised) she is when you have a few of these things handy. also some new underwear in her size- always good when she spends the night unexpectedly",
            "author": "davitech73",
            "id": "j8jasuz",
            "parent_id": "t1_j8j4urd",
            "score": 18,
            "created_utc": 1676400758.0,
            "replies": [
                {
                    "body": "OMG yesssss!!! How thoughtful!!",
                    "author": "mladytoyou",
                    "id": "j8o1r0u",
                    "parent_id": "t1_j8jasuz",
                    "score": 3,
                    "created_utc": 1676487092.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Napkins or tampons also 👌👌",
            "author": "ccii22",
            "id": "j8jhdwh",
            "parent_id": "t1_j8j4urd",
            "score": 8,
            "created_utc": 1676403311.0,
            "replies": []
        },
        {
            "body": "Love this for you. We SB’s love a considerate and thoughtful daddy 🤍",
            "author": "noneya3333",
            "id": "j8jjydb",
            "parent_id": "t1_j8j4urd",
            "score": 10,
            "created_utc": 1676404303.0,
            "replies": []
        },
        {
            "body": "Same! When I’ve gone out of town with my SDs I always insist on a two bedroom AirBNB or two room hotel suite.",
            "author": "mysticalheavensawait",
            "id": "j8jlr4c",
            "parent_id": "t1_j8jbjir",
            "score": 7,
            "created_utc": 1676405012.0,
            "replies": [
                {
                    "body": "Me too… Adjoining hotel rooms are a great solution.",
                    "author": "RealEarthAngel",
                    "id": "j8n37aq",
                    "parent_id": "t1_j8jlr4c",
                    "score": 3,
                    "created_utc": 1676473460.0,
                    "replies": [
                        {
                            "body": "I love hotel rooms like that! I can actually get a good nights sleep and that makes me a lot more enjoyable to be around the next morning🤣",
                            "author": "mysticalheavensawait",
                            "id": "j8oovbm",
                            "parent_id": "t1_j8n37aq",
                            "score": 2,
                            "created_utc": 1676495851.0,
                            "replies": [
                                {
                                    "body": "Totally, good sleep is essential!",
                                    "author": "RealEarthAngel",
                                    "id": "j8p1bit",
                                    "parent_id": "t1_j8oovbm",
                                    "score": 1,
                                    "created_utc": 1676500723.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Like this idea or a 2 bedroom Airbnb",
            "author": "Hungboy6969420",
            "id": "j8jn71v",
            "parent_id": "t1_j8jjxp0",
            "score": 2,
            "created_utc": 1676405581.0,
            "replies": []
        },
        {
            "body": "I actually dumped a SD in November for this very reason. I couldn’t tolerate it anymore! I used to dread overnights with him, and always left feeling disrespected & exhausted.",
            "author": "noneya3333",
            "id": "j8jlb47",
            "parent_id": "t1_j8j43f2",
            "score": 19,
            "created_utc": 1676404837.0,
            "replies": [
                {
                    "body": "So why didn't you decline the overnight after the first incident?",
                    "author": "ThrowawaySDAugust21",
                    "id": "j8ksj3k",
                    "parent_id": "t1_j8jlb47",
                    "score": -1,
                    "created_utc": 1676422746.0,
                    "replies": [
                        {
                            "body": "The same reason why half the men on this forum don’t divorce their wives.. because I actually liked him and the way he treated me outside certain behaviors. There came a point where he requested more overnights, and I just couldn’t tolerate it anymore regardless of his good qualities.",
                            "author": "noneya3333",
                            "id": "j8s69xf",
                            "parent_id": "t1_j8ksj3k",
                            "score": 3,
                            "created_utc": 1676563294.0,
                            "replies": []
                        },
                        {
                            "body": "$$$$$ and they can’t replace them easily",
                            "author": "bbmg69",
                            "id": "j8lwhn4",
                            "parent_id": "t1_j8ksj3k",
                            "score": 0,
                            "created_utc": 1676445068.0,
                            "replies": [
                                {
                                    "body": "So I'll take boat loads of cash and be miserable, but complain on the internet.",
                                    "author": "ThrowawaySDAugust21",
                                    "id": "j8p1v8a",
                                    "parent_id": "t1_j8lwhn4",
                                    "score": 1,
                                    "created_utc": 1676500949.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That happens to me too! 😹☺️ it lulls some of us to sleep 🤷‍♀️",
            "author": "curlybabygirly",
            "id": "j8mp72g",
            "parent_id": "t1_j8le2af",
            "score": 3,
            "created_utc": 1676466938.0,
            "replies": [
                {
                    "body": "Should put that right on your profile! 😂.  I was a little worried she wasn’t sleeping, she barely made a sound unless I hugged her a little (we fell asleep spooning).  I went to get out of bed quietly in the morning and she sleepily said “where are you going? We need to have morning sex!”.  So of course I got right back in!",
                    "author": "RedHeavyG603",
                    "id": "j8mwkyf",
                    "parent_id": "t1_j8mp72g",
                    "score": 1,
                    "created_utc": 1676470584.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think if they have a problem with it, they will expressly tell you. No one can hide that if it’s a problem! \nMy SBF snores like a tractor sometimes, he’s broken his nose twice so it’s not fixable. It genuinely doesn’t bother me at all. It can get super loud, but if I’m asleep, I’ll sleep through anything. It has probably only bothered me twice but that was because I myself couldn’t get to sleep. \nUsually it lulls me to sleep though! If I could change it, I wouldn’t 💕",
            "author": "curlybabygirly",
            "id": "j8mp405",
            "parent_id": "t1_j8li8nc",
            "score": 2,
            "created_utc": 1676466891.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j8k9bfw",
            "parent_id": "t1_j8jsxx5",
            "score": 7,
            "created_utc": 1676414235.0,
            "replies": [
                {
                    "body": "That’s sexual coercion and is sexual assault…",
                    "author": "Revolutionary-Elk390",
                    "id": "j8lv0nl",
                    "parent_id": "t1_j8k9bfw",
                    "score": 2,
                    "created_utc": 1676443927.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Odd contrast to vanilla dating,...\n\nWhen having a vanilla relationship, I ask my partner if they mind. More often than not their answer is \"you better.\"  They appreciate being wanted, mentally, emotionally, and physically.\n\nif we're not going to have sex at night, the middle of the night, and in the morning, what's the purpose of staying over?",
            "author": "Spirited-Sun-5924",
            "id": "j8mg1lm",
            "parent_id": "t1_j8jsxx5",
            "score": -1,
            "created_utc": 1676461323.0,
            "replies": [
                {
                    "body": "I dunno man. I work hard so need my beauty sleep. Night and morning yes, but not waking up at 3am for a sesh.",
                    "author": "SDinAsia",
                    "id": "j8mgxal",
                    "parent_id": "t1_j8mg1lm",
                    "score": 4,
                    "created_utc": 1676461942.0,
                    "replies": []
                },
                {
                    "body": "I get this same response from the women I sugar date. they look at multiple opportunities for sex as something to look forward to, not as an obligation they would prefer not to be bothered with",
                    "author": "joc13",
                    "id": "j8o9bim",
                    "parent_id": "t1_j8mg1lm",
                    "score": 1,
                    "created_utc": 1676490038.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't know about waking her up in the middle of the night, but who doesn't enjoy a second round of sex in the middle of the night or in the morning? \n\nI'm not having her stay over just so I can bring her breakfast in bed the next morning.",
            "author": "ThrowawaySDAugust21",
            "id": "j8ksgx5",
            "parent_id": "t1_j8jsxx5",
            "score": -13,
            "created_utc": 1676422718.0,
            "replies": []
        },
        {
            "body": "my long term SRs usually become long term SRs because of the fact that we both enjoy the same aspects of sleepovers: cuddling, falling asleep watching movies/TV,  middle of the night sex, morning sex, occasional showers together (even a guy needs to shower alone at times), going to breakfast the next morning, lounging until afternoon checkout, etc\n\nif I'm seeing someone that doesn't enjoy all that, then we won't do overnights, or end up ending the SR",
            "author": "joc13",
            "id": "j8o8o9m",
            "parent_id": "t1_j8jsxx5",
            "score": 1,
            "created_utc": 1676489788.0,
            "replies": [
                {
                    "body": "Fair point. I envy your stamina.",
                    "author": "SDinAsia",
                    "id": "j8o91lr",
                    "parent_id": "t1_j8o8o9m",
                    "score": 1,
                    "created_utc": 1676489931.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I will admit, I’m capable of snoring when I’m drunk or sick. I’ve been told it’s very minor and still easy to fall asleep next to me. Now let’s compare that to a grown man grizzly bear snore that happens every single overnight 🙃",
            "author": "noneya3333",
            "id": "j8jjsw6",
            "parent_id": "t1_j8jejxj",
            "score": 8,
            "created_utc": 1676404243.0,
            "replies": [
                {
                    "body": "Hey now... I think this whole situation can be approached with a bit more balance. Many humans of all genders have nighttime habits (snoring, tossing & turning, etc) which can take adapting from the other partner.",
                    "author": "DisposableDextrose",
                    "id": "j8jmojf",
                    "parent_id": "t1_j8jjsw6",
                    "score": 0,
                    "created_utc": 1676405379.0,
                    "replies": [
                        {
                            "body": "Very true. I’m less hung up on 1 and even stated im aware it can’t really be “fixed”. 2,3 & 4 are more important behaviors I’ve seen in too many SD’s that request overnights.",
                            "author": "noneya3333",
                            "id": "j8jnntg",
                            "parent_id": "t1_j8jmojf",
                            "score": 2,
                            "created_utc": 1676405765.0,
                            "replies": [
                                {
                                    "body": "yeah, those are definitely fair game for complaints.  Kind of a combination of lack of human decency, but also a need for establishing/communicating ground rules for the sleepover.",
                                    "author": "DisposableDextrose",
                                    "id": "j8jpvv5",
                                    "parent_id": "t1_j8jnntg",
                                    "score": 2,
                                    "created_utc": 1676406625.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well said. This made me laugh 😹",
            "author": "curlybabygirly",
            "id": "j8momq0",
            "parent_id": "t1_j8k6f9r",
            "score": 1,
            "created_utc": 1676466635.0,
            "replies": []
        },
        {
            "body": "😂🤣",
            "author": "Puzzleheaded_Baby570",
            "id": "j8k337j",
            "parent_id": "t1_j8jb6jq",
            "score": 0,
            "created_utc": 1676411694.0,
            "replies": []
        },
        {
            "body": "You could be right, and I like your way of thinking on the last sentence! A few SD’s in the comments aren’t handling the constructive criticism very well and probably disregard their SB’s comfort. It will soon lead to her dumping them, or her finding excuses to not stay the night anymore. Notice how every SB that commented understood the post? I can’t be lying or making this stuff up.",
            "author": "noneya3333",
            "id": "j8jwgt8",
            "parent_id": "t1_j8jvix3",
            "score": 8,
            "created_utc": 1676409141.0,
            "replies": [
                {
                    "body": "PREACH SISTa!!!!",
                    "author": "lanena__",
                    "id": "j8lbovj",
                    "parent_id": "t1_j8jwgt8",
                    "score": 1,
                    "created_utc": 1676431900.0,
                    "replies": []
                },
                {
                    "body": "the women who disagree with you aren't going to comment, for fear of being labeled as \"pick me\"s and brigade downvoted",
                    "author": "joc13",
                    "id": "j8o9nhu",
                    "parent_id": "t1_j8jwgt8",
                    "score": 0,
                    "created_utc": 1676490165.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "lol no\n\nSleepovers with kind and respectful men that care about my needs are amazing.",
            "author": "NoLimitLexa",
            "id": "j8j9alr",
            "parent_id": "t1_j8j6m9m",
            "score": 15,
            "created_utc": 1676400173.0,
            "replies": []
        },
        {
            "body": "cool siri bruh 😎",
            "author": "NickPfromYuma",
            "id": "j8jb1uf",
            "parent_id": "t1_j8j6m9m",
            "score": 1,
            "created_utc": 1676400855.0,
            "replies": []
        },
        {
            "body": "2 & 4 almost every SD I had overnights with did, and it drove me absolutely batshit. You’d think older men would know better. I made the post to let men know they’re subconsciously driving their SB up the wall, and she will gossip to her girlfriends about how annoying you are.",
            "author": "noneya3333",
            "id": "j8jistl",
            "parent_id": "t1_j8j61y4",
            "score": 12,
            "created_utc": 1676403853.0,
            "replies": [
                {
                    "body": "2 & 4 are nuts, but who is confident that they snore like a buzz saw, and why do they know this?   Because their mattress partner tells them.\n\nAside from informing, there are ways to mitigate snoring such as sleeping on one's side or sleeping with the shoulders elevated (sleep number bed snore mode, for instance).",
                    "author": "Beginning_Pear_2231",
                    "id": "j8jjgep",
                    "parent_id": "t1_j8jistl",
                    "score": 1,
                    "created_utc": 1676404108.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "💗",
            "author": "P0sitiveViibes777",
            "id": "j8j6v4v",
            "parent_id": "t1_j8j61y4",
            "score": 2,
            "created_utc": 1676399232.0,
            "replies": []
        },
        {
            "body": "Sounds like she thinks she is doing a big favor by sleeping over. A caring person would give some feedback directly to the SD in a nice way\n\nTBH, I do prefer sleeping in separate beds as my own uninterrupted sleep is precious to me and I would want to give the other person the same comfort and space",
            "author": "OCbird22",
            "id": "j8jidh2",
            "parent_id": "t1_j8j61y4",
            "score": 2,
            "created_utc": 1676403690.0,
            "replies": []
        },
        {
            "body": "2. As a single guy in his mid-50s, that also dates vanilla, most of my partners appreciated being woke up in the middle of the night for that. I've actually asked if it's okay with them, most of the time it's an enthusiastic \"yes.\"",
            "author": "Spirited-Sun-5924",
            "id": "j8mguya",
            "parent_id": "t1_j8j61y4",
            "score": -1,
            "created_utc": 1676461898.0,
            "replies": [
                {
                    "body": "I hear you, but just because one woman likes something, doesn’t mean the rest will. Imo the SD should let the SB initiate middle-of-the night sex. I’ve done it on my own after SD jokingly suggested it but detest when it’s pushed on me.",
                    "author": "noneya3333",
                    "id": "j8no2aa",
                    "parent_id": "t1_j8mguya",
                    "score": 1,
                    "created_utc": 1676481808.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> but even my hour or three bookings they are so annoying with wanting to shower with me.\n\nThat's an interesting turn of phrase.  Not exactly the sort of phrase that I would expect an SB to use - \"bookings\".  That sounds a lot more like sex work.\n\n>... if I’ve been with you the past two hours and wanna shower, leave me alone and take your own goddamn shower.\n\nMost times that I've seen SBs we haven't even got back to my home within two hours as we've been out having a great time together.  \n\nI would perhaps suggest that your line of work is rather different to the experience that a lot of SBs and SDs have.",
            "author": "HecatesCats",
            "id": "j8ocgks",
            "parent_id": "t1_j8lbajy",
            "score": 1,
            "created_utc": 1676491214.0,
            "replies": []
        },
        {
            "body": "Because we are all married right?  Username checks out.",
            "author": "DarthDaddius",
            "id": "j8k5csp",
            "parent_id": "t1_j8k3bz6",
            "score": 1,
            "created_utc": 1676412596.0,
            "replies": []
        },
        {
            "body": "Why do you assume that most SDs are married?",
            "author": "HecatesCats",
            "id": "j8oczb3",
            "parent_id": "t1_j8k3bz6",
            "score": 1,
            "created_utc": 1676491413.0,
            "replies": [
                {
                    "body": "It was a joke.  Should i put more emojis next time?",
                    "author": "Puzzleheaded_Baby570",
                    "id": "j8od8at",
                    "parent_id": "t1_j8oczb3",
                    "score": 1,
                    "created_utc": 1676491508.0,
                    "replies": [
                        {
                            "body": "Sorry, from reading your comment it appeared that you were laughing *at* guys who sleep over with an SB, suggesting that they were lesser than SDs who don't sleep over with their SB.\n\nThe presence of the emojis didn't affect the meaning, it just seemed to emphasise that you were laughing *at* SDs that did this.",
                            "author": "HecatesCats",
                            "id": "j8ogd1f",
                            "parent_id": "t1_j8od8at",
                            "score": 2,
                            "created_utc": 1676492669.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Im not a SD, so why would a make a post entailing annoying behaviors from SB’s? If you want to do that to enlighten us, I’d actually love that. I can handle constructive criticism and would hope I’m not subconsciously driving my SD up the wall.",
            "author": "noneya3333",
            "id": "j8jpc2l",
            "parent_id": "t1_j8jovfg",
            "score": 8,
            "created_utc": 1676406412.0,
            "replies": []
        },
        {
            "body": ">Dumping on others, but I can assure you women toss and turn just as much and snore just as often.\n\nAnd the drooling, and the stealing of the blankets....",
            "author": "ThrowawaySDAugust21",
            "id": "j8ksq9w",
            "parent_id": "t1_j8jovfg",
            "score": 1,
            "created_utc": 1676422839.0,
            "replies": [
                {
                    "body": "And makeup all over your pillows and sheets that don't always come out lmao. \n\nI think the point is, plenty ALL sides can complain about so doing so just comes off... Well... Just saying lol.",
                    "author": "Far_Introduction527",
                    "id": "j8kuq05",
                    "parent_id": "t1_j8ksq9w",
                    "score": 2,
                    "created_utc": 1676423793.0,
                    "replies": [
                        {
                            "body": "lol I see your guy’s point, but I always take my makeup off before bed and sometimes guilty for hogging the blankets. I don’t think either behavior is annoying enough to upset my two SD’s though. The point in the post were a few staples that could absolutely cause your SB to dump you.. Smothering and not respecting her boundaries are a bit different.",
                            "author": "noneya3333",
                            "id": "j8s4m19",
                            "parent_id": "t1_j8kuq05",
                            "score": 0,
                            "created_utc": 1676562636.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why is your every interaction here confrontational and antagonistic? Find a better way to communicate. Your presence here is contributing nothing positive to this community and is really toxic. If you need to take a break take it before you receive a permanent one.",
            "author": "LaSirene23",
            "id": "j8khnvs",
            "parent_id": "t1_j8k4s4l",
            "score": 21,
            "created_utc": 1676417828.0,
            "replies": [
                {
                    "body": "Thank you for acknowledging his borderline abusive tendencies. I notice his comments here & there on this forum, and he actually NEVER says anything positive, enriching, nor does he offer any advice. He only comments to say negative things and insult people. I’m honestly surprised he hasn’t been banned from this forum yet. I take his words with a grain of salt, and don’t expect anything less from him. It’s funny how he doesn’t even acknowledge this behavior exists until he’s presented with advice from other men & he’s threatened with permanent banning. He’s actively insulted women who are on the sugarbabyonly forum multiple times too. I’ve actually started to ponder if he’s even in the sugar community, or just a troll. If he is, it seems his SB doesn’t do her job with leaving him satisfied, otherwise he wouldn’t be so salty all the time. This post was constructive criticism for SD’s to optimize their SB’s experiences with overnights.",
                    "author": "noneya3333",
                    "id": "j8lod5w",
                    "parent_id": "t1_j8khnvs",
                    "score": 10,
                    "created_utc": 1676439101.0,
                    "replies": []
                },
                {
                    "body": "Omg thank you LaSirene.",
                    "author": null,
                    "id": "j8kpshy",
                    "parent_id": "t1_j8khnvs",
                    "score": 7,
                    "created_utc": 1676421488.0,
                    "replies": []
                },
                {
                    "body": "🤍",
                    "author": "manninc2000",
                    "id": "j8lh9ug",
                    "parent_id": "t1_j8khnvs",
                    "score": 2,
                    "created_utc": 1676434840.0,
                    "replies": []
                },
                {
                    "body": "*Every* interaction I have here is not, but, yes, I am more likely to comment on something I disagree with than something I agree with.  You are welcome to your opinion that I’m not adding anything positive to the community, but I disagree, and if you want to ban people for being toxic there are a *lot* of people that you should be banning.\n\n*eta* It’s also incredibly ironic that you’d post this on a ridiculously negative post that I commented on.  What SD needs to be informed of any of the things OP was talking about?  Who is reading that saying “oh damn I had no idea my SB wouldn’t like it if I snore in her ear all night then wake her up for sex and then follow her into the bathroom?”",
                    "author": "DarthDaddius",
                    "id": "j8kipk1",
                    "parent_id": "t1_j8khnvs",
                    "score": -4,
                    "created_utc": 1676418294.0,
                    "replies": [
                        {
                            "body": "Unfortunately, you would be surprised.  When I introduced  my CPAP to my last SB, she mentioned her previous SD had one but barely used it and his snoring was awful. I've had incidents described to me of agreed upon boundaries like #2 and #3 not being respected.  While you may be a quality man where those issues would never occur there are lesser \"SDs\" not following the same code.",
                            "author": "manninc2000",
                            "id": "j8lhvqy",
                            "parent_id": "t1_j8kipk1",
                            "score": 9,
                            "created_utc": 1676435176.0,
                            "replies": [
                                {
                                    "body": "Snoring is, as the OP said, something that you can only do so much about, so I’ll leave that aside. \n\nA man who is waking up his partner for sex in the middle of the night, multiple times, is not an SD, or at least not a good one.  I would bet in most cases it’s a John who’s seeing an escort calling herself and SB or treating an actual SB like an escort.  You don’t wake up your partner from a sound sleep to fuck unless you’re trying to get the most bang for your buck (literally) which isn’t something you’d do in a relationship.   Regardless, no one is going to read that post and say “oh shit I should be a decent human and not treat this girl like a sex toy.”\n\nAs to number 3, as I said in my prior comment, it comes down to a conversation and no decent guy is going to give her a hard time.  Again, maybe some escort charging a client a normal PPM per hour is going to experience something differently, but a decent SD is not going to behave that way, and no one reading her post is going to change their behavior.",
                                    "author": "DarthDaddius",
                                    "id": "j8ln932",
                                    "parent_id": "t1_j8lhvqy",
                                    "score": 1,
                                    "created_utc": 1676438376.0,
                                    "replies": [
                                        {
                                            "body": "Some people need this post. More than you know. Maybe some SB’s lurking in the corner exhibit this behaviour too and are realising they need to fix it. \n\nThe post is constructive. Just because you don’t need this doesn’t mean no one else does either?\nThat’s like going into primary school and screaming everyone knows this!!\nWell some people don’t. \n\nI have seen a few guys admitting to their snoring in the comments. Some people just need incentive to take action. \nIf guys are doing the other things on the post, why on earth would they out themselves? It’s embarrassing.\n\nRespectfully, as an SD, you have no idea what it’s like to be with other SDs. As an SB, I can’t say I don’t react like X so NO OTHER SB’s react like X.\n\nClearly if OP went through the trouble of writing the post, it’s safe to say that SOME men acted like that. If SB’s have discussed the topic before, clearly it’s an issue. Why’s that so hard to understand? It may be a negative post but I’m SURE experiencing that is negative as well.\n\nHow delusional do you have to be for someone to outline their experience and counter it with **ACTUALLY, that doesn’t exist**\n\nLook how many women are in agreement in the comments. It obviously needed to be said. Now some guys can see why their relationship may not have worked out. Some people are not self aware, and it’s an insult to those who are changing their behaviour to say “no one needs this”.\n\nPersonally, I’ve only experienced snoring. But I’m not an experienced SB. NEITHER ARE YOU.",
                                            "author": "curlybabygirly",
                                            "id": "j8mrkuv",
                                            "parent_id": "t1_j8ln932",
                                            "score": 7,
                                            "created_utc": 1676468180.0,
                                            "replies": [
                                                {
                                                    "body": ">> How delusional do you have to be for someone to outline their experience and counter it with ACTUALLY, that doesn’t exist\n\nHow delusional do you have to be to think that I wrote that when I didn’t say anything like that?\n\nAs to the rest of your rant, as I said before, yes, many if not most older men snore.  As do a lot of younger women, especially if they drink, but it’s certainly more common with older men.  That’s not news and it’s not that men are “admitting” it and realizing “omg I had no idea.”   \n\nAs to the other behaviors, my point is that the men doing them are not behaving as SDs and that the SBs should not stay with them.  Sounds like a pro-SB argument to me, yet I’m lableles as the negative toxic SD.  🤷‍♂️",
                                                    "author": "DarthDaddius",
                                                    "id": "j8mts9h",
                                                    "parent_id": "t1_j8mrkuv",
                                                    "score": -2,
                                                    "created_utc": 1676469264.0,
                                                    "replies": [
                                                        {
                                                            "body": "I have no idea how wanting to sleep through the night makes you a pro SB   but from reading through this thread you clearly  didn't take my warning seriously. You need to find another community that's a better fit for you.",
                                                            "author": "LaSirene23",
                                                            "id": "j8n9dzr",
                                                            "parent_id": "t1_j8mts9h",
                                                            "score": 6,
                                                            "created_utc": 1676476005.0,
                                                            "replies": [
                                                                {
                                                                    "body": "and why wasn't this post deleted to begin with when it self proclaimed that it was brought here from another subreddit? with an obvious anti-SD agenda?",
                                                                    "author": "joc13",
                                                                    "id": "j8obkn2",
                                                                    "parent_id": "t1_j8n9dzr",
                                                                    "score": -1,
                                                                    "created_utc": 1676490891.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "What part of it is an anti SD agenda? \n\n* wanting to sleep through the night without being woken up multiple times for sex?\n\n* Some personal time alone to take a shower after spending multiple hours together\n\n* Or not being guilt tripped/manipulated the morning after an overnight when a Sb wants to leave and go home?\n\nShould I assume from your comment that a Sb has no right to expect these things and that by her creating this post  she's advocating taking advantage of SDs and this post should be removed?",
                                                                            "author": "LaSirene23",
                                                                            "id": "j8olwsr",
                                                                            "parent_id": "t1_j8obkn2",
                                                                            "score": 4,
                                                                            "created_utc": 1676494743.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Strawman.",
                                                                    "author": "OldschoolSD",
                                                                    "id": "j8pl0x8",
                                                                    "parent_id": "t1_j8n9dzr",
                                                                    "score": 1,
                                                                    "created_utc": 1676509306.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Lol u sound miserable yikes....its ok to be happy sometimes",
                            "author": "ballerina-",
                            "id": "j8lfgr6",
                            "parent_id": "t1_j8kipk1",
                            "score": 4,
                            "created_utc": 1676433851.0,
                            "replies": [
                                {
                                    "body": "LOL I’m quite happy.   Why is it that both you and our esteemed leader are calling me out for negativity and not the OP who is being incredibly negative and acting like all SDs are buffoons who don’t know women like to sleep and not be treating like sex toys?   Dare I say you are both faster to criticize a man (like OP is) than a woman?!?",
                                    "author": "DarthDaddius",
                                    "id": "j8lmie7",
                                    "parent_id": "t1_j8lfgr6",
                                    "score": -6,
                                    "created_utc": 1676437905.0,
                                    "replies": [
                                        {
                                            "body": "it's the same double standard that's been going on for a while now. women can come on here and bash men all they want, but if the men are critical, or God forbid just humorously sarcastic, we are evil.",
                                            "author": "joc13",
                                            "id": "j8oabbq",
                                            "parent_id": "t1_j8lmie7",
                                            "score": -2,
                                            "created_utc": 1676490417.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s definitely not a big deal and fine to shower together sometimes but some guys literally want to do it every time I’ve literally had to dump a guy because one didn’t respect my boundaries at all and I literally had to ask him with everything between literally laying on me in bed And other things “do you literally want to get in my skin? I am literally right next to you. I’m never on my phone I pay attention to you and you have my undivided if I want to lay on the bed and not be smothered you have to respect that quotes and he didn’t “ some people literally think they on you and some people are totally cool, decent human beings, and some just because they pay money want to get their moneys worth. I hate it.",
            "author": "lanena__",
            "id": "j8lc3ar",
            "parent_id": "t1_j8j6thm",
            "score": 4,
            "created_utc": 1676432109.0,
            "replies": []
        },
        {
            "body": "I stayed the night at my friends recently and she caught me doing math in my sleep",
            "author": "TryHard-POPS",
            "id": "j8lj65p",
            "parent_id": "t1_j8ld8o7",
            "score": 4,
            "created_utc": 1676435915.0,
            "replies": [
                {
                    "body": "Did you get the answer right?",
                    "author": "dontkillmejustkinkme",
                    "id": "j8ljlvp",
                    "parent_id": "t1_j8lj65p",
                    "score": 1,
                    "created_utc": 1676436169.0,
                    "replies": [
                        {
                            "body": "I hope so otherwise I’m in deep trouble",
                            "author": "TryHard-POPS",
                            "id": "j8ljobb",
                            "parent_id": "t1_j8ljlvp",
                            "score": 3,
                            "created_utc": 1676436208.0,
                            "replies": [
                                {
                                    "body": "The implications of this comment are limitless. Why are you in trouble? What was the math for? What happens if the math is _wrong??_  My mind is reeling.",
                                    "author": "dontkillmejustkinkme",
                                    "id": "j8ll1o5",
                                    "parent_id": "t1_j8ljobb",
                                    "score": 2,
                                    "created_utc": 1676437006.0,
                                    "replies": [
                                        {
                                            "body": "I do math out loud for my business while awake, so if I’m getting it wrong in my sleep then I must not be doing it right and the IRS will come after me, I guess it’s a good thing I didn’t file my taxes in my sleep though",
                                            "author": "TryHard-POPS",
                                            "id": "j8ll6f6",
                                            "parent_id": "t1_j8ll1o5",
                                            "score": 3,
                                            "created_utc": 1676437086.0,
                                            "replies": [
                                                {
                                                    "body": "if it's the IRS you're worried about, you're not doing *math*, you're doing arithmetic 😉",
                                                    "author": "joc13",
                                                    "id": "j8ob53b",
                                                    "parent_id": "t1_j8ll6f6",
                                                    "score": 3,
                                                    "created_utc": 1676490732.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am a heavy snorer.  I introduced my CPAP as not \"sexy\" but it will make sure we are rested for when we need the energy. 😉 Surprisingly, when I've fallen asleep without putting on my mask I don't get beaten awake to put it back on. I usually woke myself up and threw it on. I would recommend it to anyone as a way to improve their health and their relationship.",
            "author": "manninc2000",
            "id": "j8lg4e2",
            "parent_id": "t1_j8jnp47",
            "score": 7,
            "created_utc": 1676434204.0,
            "replies": []
        },
        {
            "body": "LOL I can imagine. I thought I had apnea when someone pointed out my snoring to me (I was oblivious, of course), but as it turns out it's a different medical issue. I would say its about 50/50 since then on whether an SB I was seeing would choose the spare room rather than bunk with Snorasaurus Rex. I don't blame them at all, although the mouthguard has significantly reduced it.",
            "author": "Hot_Selection3626",
            "id": "j8jpjt6",
            "parent_id": "t1_j8jnp47",
            "score": 7,
            "created_utc": 1676406495.0,
            "replies": []
        },
        {
            "body": "Aww thanks!",
            "author": "Hot_Selection3626",
            "id": "j8jt69z",
            "parent_id": "t1_j8jq5q6",
            "score": 7,
            "created_utc": 1676407892.0,
            "replies": []
        },
        {
            "body": "Sure, it’s an OTC device:\n\nhttps://smartguardrx.com/products/anti-snore-device?sscid=21k7_jh019&",
            "author": "Hot_Selection3626",
            "id": "j8kcp4q",
            "parent_id": "t1_j8k9e8k",
            "score": 6,
            "created_utc": 1676415665.0,
            "replies": []
        },
        {
            "body": "You are sweet. I just understand how unbearable it can be to sleep with someone who snores loudly, or if the mouthguard is in, snores softly. As others have pointed out, sleeping alone tends to result in the best sleep, particularly once you get the oxytocin flowing post-sex.   \n\n\nWhile I do enjoy falling asleep and cuddling, the practical side of it is that some cannot tolerate any snoring. At least if my SB stays over, I can make breakfast in the morning (which is one of my favorite activities). So it's a good enticement to stay. :)",
            "author": "Hot_Selection3626",
            "id": "j8nmghm",
            "parent_id": "t1_j8njzf9",
            "score": 3,
            "created_utc": 1676481186.0,
            "replies": [
                {
                    "body": "Breakfast and a mimosa are always a good way to wake up!",
                    "author": "TaylorNicholeXO",
                    "id": "j8nncq2",
                    "parent_id": "t1_j8nmghm",
                    "score": 3,
                    "created_utc": 1676481534.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "True. But it's not an option. Sleep apnea is worse than being a heavy cigarette smoker, with respect to heart health. Leaving it untreated is Russian Roulette.\n\nThere are other approaches that can work over the long term .... e.g. inclined bed therapy, weight loss, etc.",
            "author": "Nomad_Bill",
            "id": "j8jmdpj",
            "parent_id": "t1_j8jg89g",
            "score": 12,
            "created_utc": 1676405260.0,
            "replies": []
        },
        {
            "body": "It’s better than you dying.",
            "author": "Sunny_Heather",
            "id": "j8ktds4",
            "parent_id": "t1_j8j9hsx",
            "score": 11,
            "created_utc": 1676423147.0,
            "replies": []
        },
        {
            "body": "I did not there are guys like you guys. Seriously, how heart warming ❤️‍🔥",
            "author": "curlybabygirly",
            "id": "j8mo81n",
            "parent_id": "t1_j8jawxj",
            "score": 3,
            "created_utc": 1676466415.0,
            "replies": []
        },
        {
            "body": "Your place is better stocked than mine. I'd be in heaven",
            "author": "mladytoyou",
            "id": "j8o1mi7",
            "parent_id": "t1_j8jawxj",
            "score": 3,
            "created_utc": 1676487044.0,
            "replies": [
                {
                    "body": "😁",
                    "author": "Aquaman949",
                    "id": "j8o2ce6",
                    "parent_id": "t1_j8o1mi7",
                    "score": 2,
                    "created_utc": 1676487320.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OMG yesssss!!! How thoughtful!!",
            "author": "mladytoyou",
            "id": "j8o1r0u",
            "parent_id": "t1_j8jasuz",
            "score": 3,
            "created_utc": 1676487092.0,
            "replies": []
        },
        {
            "body": "Me too… Adjoining hotel rooms are a great solution.",
            "author": "RealEarthAngel",
            "id": "j8n37aq",
            "parent_id": "t1_j8jlr4c",
            "score": 3,
            "created_utc": 1676473460.0,
            "replies": [
                {
                    "body": "I love hotel rooms like that! I can actually get a good nights sleep and that makes me a lot more enjoyable to be around the next morning🤣",
                    "author": "mysticalheavensawait",
                    "id": "j8oovbm",
                    "parent_id": "t1_j8n37aq",
                    "score": 2,
                    "created_utc": 1676495851.0,
                    "replies": [
                        {
                            "body": "Totally, good sleep is essential!",
                            "author": "RealEarthAngel",
                            "id": "j8p1bit",
                            "parent_id": "t1_j8oovbm",
                            "score": 1,
                            "created_utc": 1676500723.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So why didn't you decline the overnight after the first incident?",
            "author": "ThrowawaySDAugust21",
            "id": "j8ksj3k",
            "parent_id": "t1_j8jlb47",
            "score": -1,
            "created_utc": 1676422746.0,
            "replies": [
                {
                    "body": "The same reason why half the men on this forum don’t divorce their wives.. because I actually liked him and the way he treated me outside certain behaviors. There came a point where he requested more overnights, and I just couldn’t tolerate it anymore regardless of his good qualities.",
                    "author": "noneya3333",
                    "id": "j8s69xf",
                    "parent_id": "t1_j8ksj3k",
                    "score": 3,
                    "created_utc": 1676563294.0,
                    "replies": []
                },
                {
                    "body": "$$$$$ and they can’t replace them easily",
                    "author": "bbmg69",
                    "id": "j8lwhn4",
                    "parent_id": "t1_j8ksj3k",
                    "score": 0,
                    "created_utc": 1676445068.0,
                    "replies": [
                        {
                            "body": "So I'll take boat loads of cash and be miserable, but complain on the internet.",
                            "author": "ThrowawaySDAugust21",
                            "id": "j8p1v8a",
                            "parent_id": "t1_j8lwhn4",
                            "score": 1,
                            "created_utc": 1676500949.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Should put that right on your profile! 😂.  I was a little worried she wasn’t sleeping, she barely made a sound unless I hugged her a little (we fell asleep spooning).  I went to get out of bed quietly in the morning and she sleepily said “where are you going? We need to have morning sex!”.  So of course I got right back in!",
            "author": "RedHeavyG603",
            "id": "j8mwkyf",
            "parent_id": "t1_j8mp72g",
            "score": 1,
            "created_utc": 1676470584.0,
            "replies": []
        },
        {
            "body": "That’s sexual coercion and is sexual assault…",
            "author": "Revolutionary-Elk390",
            "id": "j8lv0nl",
            "parent_id": "t1_j8k9bfw",
            "score": 2,
            "created_utc": 1676443927.0,
            "replies": []
        },
        {
            "body": "I dunno man. I work hard so need my beauty sleep. Night and morning yes, but not waking up at 3am for a sesh.",
            "author": "SDinAsia",
            "id": "j8mgxal",
            "parent_id": "t1_j8mg1lm",
            "score": 4,
            "created_utc": 1676461942.0,
            "replies": []
        },
        {
            "body": "I get this same response from the women I sugar date. they look at multiple opportunities for sex as something to look forward to, not as an obligation they would prefer not to be bothered with",
            "author": "joc13",
            "id": "j8o9bim",
            "parent_id": "t1_j8mg1lm",
            "score": 1,
            "created_utc": 1676490038.0,
            "replies": []
        },
        {
            "body": "Fair point. I envy your stamina.",
            "author": "SDinAsia",
            "id": "j8o91lr",
            "parent_id": "t1_j8o8o9m",
            "score": 1,
            "created_utc": 1676489931.0,
            "replies": []
        },
        {
            "body": "Hey now... I think this whole situation can be approached with a bit more balance. Many humans of all genders have nighttime habits (snoring, tossing & turning, etc) which can take adapting from the other partner.",
            "author": "DisposableDextrose",
            "id": "j8jmojf",
            "parent_id": "t1_j8jjsw6",
            "score": 0,
            "created_utc": 1676405379.0,
            "replies": [
                {
                    "body": "Very true. I’m less hung up on 1 and even stated im aware it can’t really be “fixed”. 2,3 & 4 are more important behaviors I’ve seen in too many SD’s that request overnights.",
                    "author": "noneya3333",
                    "id": "j8jnntg",
                    "parent_id": "t1_j8jmojf",
                    "score": 2,
                    "created_utc": 1676405765.0,
                    "replies": [
                        {
                            "body": "yeah, those are definitely fair game for complaints.  Kind of a combination of lack of human decency, but also a need for establishing/communicating ground rules for the sleepover.",
                            "author": "DisposableDextrose",
                            "id": "j8jpvv5",
                            "parent_id": "t1_j8jnntg",
                            "score": 2,
                            "created_utc": 1676406625.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "PREACH SISTa!!!!",
            "author": "lanena__",
            "id": "j8lbovj",
            "parent_id": "t1_j8jwgt8",
            "score": 1,
            "created_utc": 1676431900.0,
            "replies": []
        },
        {
            "body": "the women who disagree with you aren't going to comment, for fear of being labeled as \"pick me\"s and brigade downvoted",
            "author": "joc13",
            "id": "j8o9nhu",
            "parent_id": "t1_j8jwgt8",
            "score": 0,
            "created_utc": 1676490165.0,
            "replies": []
        },
        {
            "body": "2 & 4 are nuts, but who is confident that they snore like a buzz saw, and why do they know this?   Because their mattress partner tells them.\n\nAside from informing, there are ways to mitigate snoring such as sleeping on one's side or sleeping with the shoulders elevated (sleep number bed snore mode, for instance).",
            "author": "Beginning_Pear_2231",
            "id": "j8jjgep",
            "parent_id": "t1_j8jistl",
            "score": 1,
            "created_utc": 1676404108.0,
            "replies": []
        },
        {
            "body": "I hear you, but just because one woman likes something, doesn’t mean the rest will. Imo the SD should let the SB initiate middle-of-the night sex. I’ve done it on my own after SD jokingly suggested it but detest when it’s pushed on me.",
            "author": "noneya3333",
            "id": "j8no2aa",
            "parent_id": "t1_j8mguya",
            "score": 1,
            "created_utc": 1676481808.0,
            "replies": []
        },
        {
            "body": "It was a joke.  Should i put more emojis next time?",
            "author": "Puzzleheaded_Baby570",
            "id": "j8od8at",
            "parent_id": "t1_j8oczb3",
            "score": 1,
            "created_utc": 1676491508.0,
            "replies": [
                {
                    "body": "Sorry, from reading your comment it appeared that you were laughing *at* guys who sleep over with an SB, suggesting that they were lesser than SDs who don't sleep over with their SB.\n\nThe presence of the emojis didn't affect the meaning, it just seemed to emphasise that you were laughing *at* SDs that did this.",
                    "author": "HecatesCats",
                    "id": "j8ogd1f",
                    "parent_id": "t1_j8od8at",
                    "score": 2,
                    "created_utc": 1676492669.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And makeup all over your pillows and sheets that don't always come out lmao. \n\nI think the point is, plenty ALL sides can complain about so doing so just comes off... Well... Just saying lol.",
            "author": "Far_Introduction527",
            "id": "j8kuq05",
            "parent_id": "t1_j8ksq9w",
            "score": 2,
            "created_utc": 1676423793.0,
            "replies": [
                {
                    "body": "lol I see your guy’s point, but I always take my makeup off before bed and sometimes guilty for hogging the blankets. I don’t think either behavior is annoying enough to upset my two SD’s though. The point in the post were a few staples that could absolutely cause your SB to dump you.. Smothering and not respecting her boundaries are a bit different.",
                    "author": "noneya3333",
                    "id": "j8s4m19",
                    "parent_id": "t1_j8kuq05",
                    "score": 0,
                    "created_utc": 1676562636.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for acknowledging his borderline abusive tendencies. I notice his comments here & there on this forum, and he actually NEVER says anything positive, enriching, nor does he offer any advice. He only comments to say negative things and insult people. I’m honestly surprised he hasn’t been banned from this forum yet. I take his words with a grain of salt, and don’t expect anything less from him. It’s funny how he doesn’t even acknowledge this behavior exists until he’s presented with advice from other men & he’s threatened with permanent banning. He’s actively insulted women who are on the sugarbabyonly forum multiple times too. I’ve actually started to ponder if he’s even in the sugar community, or just a troll. If he is, it seems his SB doesn’t do her job with leaving him satisfied, otherwise he wouldn’t be so salty all the time. This post was constructive criticism for SD’s to optimize their SB’s experiences with overnights.",
            "author": "noneya3333",
            "id": "j8lod5w",
            "parent_id": "t1_j8khnvs",
            "score": 10,
            "created_utc": 1676439101.0,
            "replies": []
        },
        {
            "body": "Omg thank you LaSirene.",
            "author": null,
            "id": "j8kpshy",
            "parent_id": "t1_j8khnvs",
            "score": 7,
            "created_utc": 1676421488.0,
            "replies": []
        },
        {
            "body": "🤍",
            "author": "manninc2000",
            "id": "j8lh9ug",
            "parent_id": "t1_j8khnvs",
            "score": 2,
            "created_utc": 1676434840.0,
            "replies": []
        },
        {
            "body": "*Every* interaction I have here is not, but, yes, I am more likely to comment on something I disagree with than something I agree with.  You are welcome to your opinion that I’m not adding anything positive to the community, but I disagree, and if you want to ban people for being toxic there are a *lot* of people that you should be banning.\n\n*eta* It’s also incredibly ironic that you’d post this on a ridiculously negative post that I commented on.  What SD needs to be informed of any of the things OP was talking about?  Who is reading that saying “oh damn I had no idea my SB wouldn’t like it if I snore in her ear all night then wake her up for sex and then follow her into the bathroom?”",
            "author": "DarthDaddius",
            "id": "j8kipk1",
            "parent_id": "t1_j8khnvs",
            "score": -4,
            "created_utc": 1676418294.0,
            "replies": [
                {
                    "body": "Unfortunately, you would be surprised.  When I introduced  my CPAP to my last SB, she mentioned her previous SD had one but barely used it and his snoring was awful. I've had incidents described to me of agreed upon boundaries like #2 and #3 not being respected.  While you may be a quality man where those issues would never occur there are lesser \"SDs\" not following the same code.",
                    "author": "manninc2000",
                    "id": "j8lhvqy",
                    "parent_id": "t1_j8kipk1",
                    "score": 9,
                    "created_utc": 1676435176.0,
                    "replies": [
                        {
                            "body": "Snoring is, as the OP said, something that you can only do so much about, so I’ll leave that aside. \n\nA man who is waking up his partner for sex in the middle of the night, multiple times, is not an SD, or at least not a good one.  I would bet in most cases it’s a John who’s seeing an escort calling herself and SB or treating an actual SB like an escort.  You don’t wake up your partner from a sound sleep to fuck unless you’re trying to get the most bang for your buck (literally) which isn’t something you’d do in a relationship.   Regardless, no one is going to read that post and say “oh shit I should be a decent human and not treat this girl like a sex toy.”\n\nAs to number 3, as I said in my prior comment, it comes down to a conversation and no decent guy is going to give her a hard time.  Again, maybe some escort charging a client a normal PPM per hour is going to experience something differently, but a decent SD is not going to behave that way, and no one reading her post is going to change their behavior.",
                            "author": "DarthDaddius",
                            "id": "j8ln932",
                            "parent_id": "t1_j8lhvqy",
                            "score": 1,
                            "created_utc": 1676438376.0,
                            "replies": [
                                {
                                    "body": "Some people need this post. More than you know. Maybe some SB’s lurking in the corner exhibit this behaviour too and are realising they need to fix it. \n\nThe post is constructive. Just because you don’t need this doesn’t mean no one else does either?\nThat’s like going into primary school and screaming everyone knows this!!\nWell some people don’t. \n\nI have seen a few guys admitting to their snoring in the comments. Some people just need incentive to take action. \nIf guys are doing the other things on the post, why on earth would they out themselves? It’s embarrassing.\n\nRespectfully, as an SD, you have no idea what it’s like to be with other SDs. As an SB, I can’t say I don’t react like X so NO OTHER SB’s react like X.\n\nClearly if OP went through the trouble of writing the post, it’s safe to say that SOME men acted like that. If SB’s have discussed the topic before, clearly it’s an issue. Why’s that so hard to understand? It may be a negative post but I’m SURE experiencing that is negative as well.\n\nHow delusional do you have to be for someone to outline their experience and counter it with **ACTUALLY, that doesn’t exist**\n\nLook how many women are in agreement in the comments. It obviously needed to be said. Now some guys can see why their relationship may not have worked out. Some people are not self aware, and it’s an insult to those who are changing their behaviour to say “no one needs this”.\n\nPersonally, I’ve only experienced snoring. But I’m not an experienced SB. NEITHER ARE YOU.",
                                    "author": "curlybabygirly",
                                    "id": "j8mrkuv",
                                    "parent_id": "t1_j8ln932",
                                    "score": 7,
                                    "created_utc": 1676468180.0,
                                    "replies": [
                                        {
                                            "body": ">> How delusional do you have to be for someone to outline their experience and counter it with ACTUALLY, that doesn’t exist\n\nHow delusional do you have to be to think that I wrote that when I didn’t say anything like that?\n\nAs to the rest of your rant, as I said before, yes, many if not most older men snore.  As do a lot of younger women, especially if they drink, but it’s certainly more common with older men.  That’s not news and it’s not that men are “admitting” it and realizing “omg I had no idea.”   \n\nAs to the other behaviors, my point is that the men doing them are not behaving as SDs and that the SBs should not stay with them.  Sounds like a pro-SB argument to me, yet I’m lableles as the negative toxic SD.  🤷‍♂️",
                                            "author": "DarthDaddius",
                                            "id": "j8mts9h",
                                            "parent_id": "t1_j8mrkuv",
                                            "score": -2,
                                            "created_utc": 1676469264.0,
                                            "replies": [
                                                {
                                                    "body": "I have no idea how wanting to sleep through the night makes you a pro SB   but from reading through this thread you clearly  didn't take my warning seriously. You need to find another community that's a better fit for you.",
                                                    "author": "LaSirene23",
                                                    "id": "j8n9dzr",
                                                    "parent_id": "t1_j8mts9h",
                                                    "score": 6,
                                                    "created_utc": 1676476005.0,
                                                    "replies": [
                                                        {
                                                            "body": "and why wasn't this post deleted to begin with when it self proclaimed that it was brought here from another subreddit? with an obvious anti-SD agenda?",
                                                            "author": "joc13",
                                                            "id": "j8obkn2",
                                                            "parent_id": "t1_j8n9dzr",
                                                            "score": -1,
                                                            "created_utc": 1676490891.0,
                                                            "replies": [
                                                                {
                                                                    "body": "What part of it is an anti SD agenda? \n\n* wanting to sleep through the night without being woken up multiple times for sex?\n\n* Some personal time alone to take a shower after spending multiple hours together\n\n* Or not being guilt tripped/manipulated the morning after an overnight when a Sb wants to leave and go home?\n\nShould I assume from your comment that a Sb has no right to expect these things and that by her creating this post  she's advocating taking advantage of SDs and this post should be removed?",
                                                                    "author": "LaSirene23",
                                                                    "id": "j8olwsr",
                                                                    "parent_id": "t1_j8obkn2",
                                                                    "score": 4,
                                                                    "created_utc": 1676494743.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Strawman.",
                                                            "author": "OldschoolSD",
                                                            "id": "j8pl0x8",
                                                            "parent_id": "t1_j8n9dzr",
                                                            "score": 1,
                                                            "created_utc": 1676509306.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Lol u sound miserable yikes....its ok to be happy sometimes",
                    "author": "ballerina-",
                    "id": "j8lfgr6",
                    "parent_id": "t1_j8kipk1",
                    "score": 4,
                    "created_utc": 1676433851.0,
                    "replies": [
                        {
                            "body": "LOL I’m quite happy.   Why is it that both you and our esteemed leader are calling me out for negativity and not the OP who is being incredibly negative and acting like all SDs are buffoons who don’t know women like to sleep and not be treating like sex toys?   Dare I say you are both faster to criticize a man (like OP is) than a woman?!?",
                            "author": "DarthDaddius",
                            "id": "j8lmie7",
                            "parent_id": "t1_j8lfgr6",
                            "score": -6,
                            "created_utc": 1676437905.0,
                            "replies": [
                                {
                                    "body": "it's the same double standard that's been going on for a while now. women can come on here and bash men all they want, but if the men are critical, or God forbid just humorously sarcastic, we are evil.",
                                    "author": "joc13",
                                    "id": "j8oabbq",
                                    "parent_id": "t1_j8lmie7",
                                    "score": -2,
                                    "created_utc": 1676490417.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did you get the answer right?",
            "author": "dontkillmejustkinkme",
            "id": "j8ljlvp",
            "parent_id": "t1_j8lj65p",
            "score": 1,
            "created_utc": 1676436169.0,
            "replies": [
                {
                    "body": "I hope so otherwise I’m in deep trouble",
                    "author": "TryHard-POPS",
                    "id": "j8ljobb",
                    "parent_id": "t1_j8ljlvp",
                    "score": 3,
                    "created_utc": 1676436208.0,
                    "replies": [
                        {
                            "body": "The implications of this comment are limitless. Why are you in trouble? What was the math for? What happens if the math is _wrong??_  My mind is reeling.",
                            "author": "dontkillmejustkinkme",
                            "id": "j8ll1o5",
                            "parent_id": "t1_j8ljobb",
                            "score": 2,
                            "created_utc": 1676437006.0,
                            "replies": [
                                {
                                    "body": "I do math out loud for my business while awake, so if I’m getting it wrong in my sleep then I must not be doing it right and the IRS will come after me, I guess it’s a good thing I didn’t file my taxes in my sleep though",
                                    "author": "TryHard-POPS",
                                    "id": "j8ll6f6",
                                    "parent_id": "t1_j8ll1o5",
                                    "score": 3,
                                    "created_utc": 1676437086.0,
                                    "replies": [
                                        {
                                            "body": "if it's the IRS you're worried about, you're not doing *math*, you're doing arithmetic 😉",
                                            "author": "joc13",
                                            "id": "j8ob53b",
                                            "parent_id": "t1_j8ll6f6",
                                            "score": 3,
                                            "created_utc": 1676490732.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Breakfast and a mimosa are always a good way to wake up!",
            "author": "TaylorNicholeXO",
            "id": "j8nncq2",
            "parent_id": "t1_j8nmghm",
            "score": 3,
            "created_utc": 1676481534.0,
            "replies": []
        },
        {
            "body": "😁",
            "author": "Aquaman949",
            "id": "j8o2ce6",
            "parent_id": "t1_j8o1mi7",
            "score": 2,
            "created_utc": 1676487320.0,
            "replies": []
        },
        {
            "body": "I love hotel rooms like that! I can actually get a good nights sleep and that makes me a lot more enjoyable to be around the next morning🤣",
            "author": "mysticalheavensawait",
            "id": "j8oovbm",
            "parent_id": "t1_j8n37aq",
            "score": 2,
            "created_utc": 1676495851.0,
            "replies": [
                {
                    "body": "Totally, good sleep is essential!",
                    "author": "RealEarthAngel",
                    "id": "j8p1bit",
                    "parent_id": "t1_j8oovbm",
                    "score": 1,
                    "created_utc": 1676500723.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The same reason why half the men on this forum don’t divorce their wives.. because I actually liked him and the way he treated me outside certain behaviors. There came a point where he requested more overnights, and I just couldn’t tolerate it anymore regardless of his good qualities.",
            "author": "noneya3333",
            "id": "j8s69xf",
            "parent_id": "t1_j8ksj3k",
            "score": 3,
            "created_utc": 1676563294.0,
            "replies": []
        },
        {
            "body": "$$$$$ and they can’t replace them easily",
            "author": "bbmg69",
            "id": "j8lwhn4",
            "parent_id": "t1_j8ksj3k",
            "score": 0,
            "created_utc": 1676445068.0,
            "replies": [
                {
                    "body": "So I'll take boat loads of cash and be miserable, but complain on the internet.",
                    "author": "ThrowawaySDAugust21",
                    "id": "j8p1v8a",
                    "parent_id": "t1_j8lwhn4",
                    "score": 1,
                    "created_utc": 1676500949.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Very true. I’m less hung up on 1 and even stated im aware it can’t really be “fixed”. 2,3 & 4 are more important behaviors I’ve seen in too many SD’s that request overnights.",
            "author": "noneya3333",
            "id": "j8jnntg",
            "parent_id": "t1_j8jmojf",
            "score": 2,
            "created_utc": 1676405765.0,
            "replies": [
                {
                    "body": "yeah, those are definitely fair game for complaints.  Kind of a combination of lack of human decency, but also a need for establishing/communicating ground rules for the sleepover.",
                    "author": "DisposableDextrose",
                    "id": "j8jpvv5",
                    "parent_id": "t1_j8jnntg",
                    "score": 2,
                    "created_utc": 1676406625.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry, from reading your comment it appeared that you were laughing *at* guys who sleep over with an SB, suggesting that they were lesser than SDs who don't sleep over with their SB.\n\nThe presence of the emojis didn't affect the meaning, it just seemed to emphasise that you were laughing *at* SDs that did this.",
            "author": "HecatesCats",
            "id": "j8ogd1f",
            "parent_id": "t1_j8od8at",
            "score": 2,
            "created_utc": 1676492669.0,
            "replies": []
        },
        {
            "body": "lol I see your guy’s point, but I always take my makeup off before bed and sometimes guilty for hogging the blankets. I don’t think either behavior is annoying enough to upset my two SD’s though. The point in the post were a few staples that could absolutely cause your SB to dump you.. Smothering and not respecting her boundaries are a bit different.",
            "author": "noneya3333",
            "id": "j8s4m19",
            "parent_id": "t1_j8kuq05",
            "score": 0,
            "created_utc": 1676562636.0,
            "replies": []
        },
        {
            "body": "Unfortunately, you would be surprised.  When I introduced  my CPAP to my last SB, she mentioned her previous SD had one but barely used it and his snoring was awful. I've had incidents described to me of agreed upon boundaries like #2 and #3 not being respected.  While you may be a quality man where those issues would never occur there are lesser \"SDs\" not following the same code.",
            "author": "manninc2000",
            "id": "j8lhvqy",
            "parent_id": "t1_j8kipk1",
            "score": 9,
            "created_utc": 1676435176.0,
            "replies": [
                {
                    "body": "Snoring is, as the OP said, something that you can only do so much about, so I’ll leave that aside. \n\nA man who is waking up his partner for sex in the middle of the night, multiple times, is not an SD, or at least not a good one.  I would bet in most cases it’s a John who’s seeing an escort calling herself and SB or treating an actual SB like an escort.  You don’t wake up your partner from a sound sleep to fuck unless you’re trying to get the most bang for your buck (literally) which isn’t something you’d do in a relationship.   Regardless, no one is going to read that post and say “oh shit I should be a decent human and not treat this girl like a sex toy.”\n\nAs to number 3, as I said in my prior comment, it comes down to a conversation and no decent guy is going to give her a hard time.  Again, maybe some escort charging a client a normal PPM per hour is going to experience something differently, but a decent SD is not going to behave that way, and no one reading her post is going to change their behavior.",
                    "author": "DarthDaddius",
                    "id": "j8ln932",
                    "parent_id": "t1_j8lhvqy",
                    "score": 1,
                    "created_utc": 1676438376.0,
                    "replies": [
                        {
                            "body": "Some people need this post. More than you know. Maybe some SB’s lurking in the corner exhibit this behaviour too and are realising they need to fix it. \n\nThe post is constructive. Just because you don’t need this doesn’t mean no one else does either?\nThat’s like going into primary school and screaming everyone knows this!!\nWell some people don’t. \n\nI have seen a few guys admitting to their snoring in the comments. Some people just need incentive to take action. \nIf guys are doing the other things on the post, why on earth would they out themselves? It’s embarrassing.\n\nRespectfully, as an SD, you have no idea what it’s like to be with other SDs. As an SB, I can’t say I don’t react like X so NO OTHER SB’s react like X.\n\nClearly if OP went through the trouble of writing the post, it’s safe to say that SOME men acted like that. If SB’s have discussed the topic before, clearly it’s an issue. Why’s that so hard to understand? It may be a negative post but I’m SURE experiencing that is negative as well.\n\nHow delusional do you have to be for someone to outline their experience and counter it with **ACTUALLY, that doesn’t exist**\n\nLook how many women are in agreement in the comments. It obviously needed to be said. Now some guys can see why their relationship may not have worked out. Some people are not self aware, and it’s an insult to those who are changing their behaviour to say “no one needs this”.\n\nPersonally, I’ve only experienced snoring. But I’m not an experienced SB. NEITHER ARE YOU.",
                            "author": "curlybabygirly",
                            "id": "j8mrkuv",
                            "parent_id": "t1_j8ln932",
                            "score": 7,
                            "created_utc": 1676468180.0,
                            "replies": [
                                {
                                    "body": ">> How delusional do you have to be for someone to outline their experience and counter it with ACTUALLY, that doesn’t exist\n\nHow delusional do you have to be to think that I wrote that when I didn’t say anything like that?\n\nAs to the rest of your rant, as I said before, yes, many if not most older men snore.  As do a lot of younger women, especially if they drink, but it’s certainly more common with older men.  That’s not news and it’s not that men are “admitting” it and realizing “omg I had no idea.”   \n\nAs to the other behaviors, my point is that the men doing them are not behaving as SDs and that the SBs should not stay with them.  Sounds like a pro-SB argument to me, yet I’m lableles as the negative toxic SD.  🤷‍♂️",
                                    "author": "DarthDaddius",
                                    "id": "j8mts9h",
                                    "parent_id": "t1_j8mrkuv",
                                    "score": -2,
                                    "created_utc": 1676469264.0,
                                    "replies": [
                                        {
                                            "body": "I have no idea how wanting to sleep through the night makes you a pro SB   but from reading through this thread you clearly  didn't take my warning seriously. You need to find another community that's a better fit for you.",
                                            "author": "LaSirene23",
                                            "id": "j8n9dzr",
                                            "parent_id": "t1_j8mts9h",
                                            "score": 6,
                                            "created_utc": 1676476005.0,
                                            "replies": [
                                                {
                                                    "body": "and why wasn't this post deleted to begin with when it self proclaimed that it was brought here from another subreddit? with an obvious anti-SD agenda?",
                                                    "author": "joc13",
                                                    "id": "j8obkn2",
                                                    "parent_id": "t1_j8n9dzr",
                                                    "score": -1,
                                                    "created_utc": 1676490891.0,
                                                    "replies": [
                                                        {
                                                            "body": "What part of it is an anti SD agenda? \n\n* wanting to sleep through the night without being woken up multiple times for sex?\n\n* Some personal time alone to take a shower after spending multiple hours together\n\n* Or not being guilt tripped/manipulated the morning after an overnight when a Sb wants to leave and go home?\n\nShould I assume from your comment that a Sb has no right to expect these things and that by her creating this post  she's advocating taking advantage of SDs and this post should be removed?",
                                                            "author": "LaSirene23",
                                                            "id": "j8olwsr",
                                                            "parent_id": "t1_j8obkn2",
                                                            "score": 4,
                                                            "created_utc": 1676494743.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Strawman.",
                                                    "author": "OldschoolSD",
                                                    "id": "j8pl0x8",
                                                    "parent_id": "t1_j8n9dzr",
                                                    "score": 1,
                                                    "created_utc": 1676509306.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol u sound miserable yikes....its ok to be happy sometimes",
            "author": "ballerina-",
            "id": "j8lfgr6",
            "parent_id": "t1_j8kipk1",
            "score": 4,
            "created_utc": 1676433851.0,
            "replies": [
                {
                    "body": "LOL I’m quite happy.   Why is it that both you and our esteemed leader are calling me out for negativity and not the OP who is being incredibly negative and acting like all SDs are buffoons who don’t know women like to sleep and not be treating like sex toys?   Dare I say you are both faster to criticize a man (like OP is) than a woman?!?",
                    "author": "DarthDaddius",
                    "id": "j8lmie7",
                    "parent_id": "t1_j8lfgr6",
                    "score": -6,
                    "created_utc": 1676437905.0,
                    "replies": [
                        {
                            "body": "it's the same double standard that's been going on for a while now. women can come on here and bash men all they want, but if the men are critical, or God forbid just humorously sarcastic, we are evil.",
                            "author": "joc13",
                            "id": "j8oabbq",
                            "parent_id": "t1_j8lmie7",
                            "score": -2,
                            "created_utc": 1676490417.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I hope so otherwise I’m in deep trouble",
            "author": "TryHard-POPS",
            "id": "j8ljobb",
            "parent_id": "t1_j8ljlvp",
            "score": 3,
            "created_utc": 1676436208.0,
            "replies": [
                {
                    "body": "The implications of this comment are limitless. Why are you in trouble? What was the math for? What happens if the math is _wrong??_  My mind is reeling.",
                    "author": "dontkillmejustkinkme",
                    "id": "j8ll1o5",
                    "parent_id": "t1_j8ljobb",
                    "score": 2,
                    "created_utc": 1676437006.0,
                    "replies": [
                        {
                            "body": "I do math out loud for my business while awake, so if I’m getting it wrong in my sleep then I must not be doing it right and the IRS will come after me, I guess it’s a good thing I didn’t file my taxes in my sleep though",
                            "author": "TryHard-POPS",
                            "id": "j8ll6f6",
                            "parent_id": "t1_j8ll1o5",
                            "score": 3,
                            "created_utc": 1676437086.0,
                            "replies": [
                                {
                                    "body": "if it's the IRS you're worried about, you're not doing *math*, you're doing arithmetic 😉",
                                    "author": "joc13",
                                    "id": "j8ob53b",
                                    "parent_id": "t1_j8ll6f6",
                                    "score": 3,
                                    "created_utc": 1676490732.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Totally, good sleep is essential!",
            "author": "RealEarthAngel",
            "id": "j8p1bit",
            "parent_id": "t1_j8oovbm",
            "score": 1,
            "created_utc": 1676500723.0,
            "replies": []
        },
        {
            "body": "So I'll take boat loads of cash and be miserable, but complain on the internet.",
            "author": "ThrowawaySDAugust21",
            "id": "j8p1v8a",
            "parent_id": "t1_j8lwhn4",
            "score": 1,
            "created_utc": 1676500949.0,
            "replies": []
        },
        {
            "body": "yeah, those are definitely fair game for complaints.  Kind of a combination of lack of human decency, but also a need for establishing/communicating ground rules for the sleepover.",
            "author": "DisposableDextrose",
            "id": "j8jpvv5",
            "parent_id": "t1_j8jnntg",
            "score": 2,
            "created_utc": 1676406625.0,
            "replies": []
        },
        {
            "body": "Snoring is, as the OP said, something that you can only do so much about, so I’ll leave that aside. \n\nA man who is waking up his partner for sex in the middle of the night, multiple times, is not an SD, or at least not a good one.  I would bet in most cases it’s a John who’s seeing an escort calling herself and SB or treating an actual SB like an escort.  You don’t wake up your partner from a sound sleep to fuck unless you’re trying to get the most bang for your buck (literally) which isn’t something you’d do in a relationship.   Regardless, no one is going to read that post and say “oh shit I should be a decent human and not treat this girl like a sex toy.”\n\nAs to number 3, as I said in my prior comment, it comes down to a conversation and no decent guy is going to give her a hard time.  Again, maybe some escort charging a client a normal PPM per hour is going to experience something differently, but a decent SD is not going to behave that way, and no one reading her post is going to change their behavior.",
            "author": "DarthDaddius",
            "id": "j8ln932",
            "parent_id": "t1_j8lhvqy",
            "score": 1,
            "created_utc": 1676438376.0,
            "replies": [
                {
                    "body": "Some people need this post. More than you know. Maybe some SB’s lurking in the corner exhibit this behaviour too and are realising they need to fix it. \n\nThe post is constructive. Just because you don’t need this doesn’t mean no one else does either?\nThat’s like going into primary school and screaming everyone knows this!!\nWell some people don’t. \n\nI have seen a few guys admitting to their snoring in the comments. Some people just need incentive to take action. \nIf guys are doing the other things on the post, why on earth would they out themselves? It’s embarrassing.\n\nRespectfully, as an SD, you have no idea what it’s like to be with other SDs. As an SB, I can’t say I don’t react like X so NO OTHER SB’s react like X.\n\nClearly if OP went through the trouble of writing the post, it’s safe to say that SOME men acted like that. If SB’s have discussed the topic before, clearly it’s an issue. Why’s that so hard to understand? It may be a negative post but I’m SURE experiencing that is negative as well.\n\nHow delusional do you have to be for someone to outline their experience and counter it with **ACTUALLY, that doesn’t exist**\n\nLook how many women are in agreement in the comments. It obviously needed to be said. Now some guys can see why their relationship may not have worked out. Some people are not self aware, and it’s an insult to those who are changing their behaviour to say “no one needs this”.\n\nPersonally, I’ve only experienced snoring. But I’m not an experienced SB. NEITHER ARE YOU.",
                    "author": "curlybabygirly",
                    "id": "j8mrkuv",
                    "parent_id": "t1_j8ln932",
                    "score": 7,
                    "created_utc": 1676468180.0,
                    "replies": [
                        {
                            "body": ">> How delusional do you have to be for someone to outline their experience and counter it with ACTUALLY, that doesn’t exist\n\nHow delusional do you have to be to think that I wrote that when I didn’t say anything like that?\n\nAs to the rest of your rant, as I said before, yes, many if not most older men snore.  As do a lot of younger women, especially if they drink, but it’s certainly more common with older men.  That’s not news and it’s not that men are “admitting” it and realizing “omg I had no idea.”   \n\nAs to the other behaviors, my point is that the men doing them are not behaving as SDs and that the SBs should not stay with them.  Sounds like a pro-SB argument to me, yet I’m lableles as the negative toxic SD.  🤷‍♂️",
                            "author": "DarthDaddius",
                            "id": "j8mts9h",
                            "parent_id": "t1_j8mrkuv",
                            "score": -2,
                            "created_utc": 1676469264.0,
                            "replies": [
                                {
                                    "body": "I have no idea how wanting to sleep through the night makes you a pro SB   but from reading through this thread you clearly  didn't take my warning seriously. You need to find another community that's a better fit for you.",
                                    "author": "LaSirene23",
                                    "id": "j8n9dzr",
                                    "parent_id": "t1_j8mts9h",
                                    "score": 6,
                                    "created_utc": 1676476005.0,
                                    "replies": [
                                        {
                                            "body": "and why wasn't this post deleted to begin with when it self proclaimed that it was brought here from another subreddit? with an obvious anti-SD agenda?",
                                            "author": "joc13",
                                            "id": "j8obkn2",
                                            "parent_id": "t1_j8n9dzr",
                                            "score": -1,
                                            "created_utc": 1676490891.0,
                                            "replies": [
                                                {
                                                    "body": "What part of it is an anti SD agenda? \n\n* wanting to sleep through the night without being woken up multiple times for sex?\n\n* Some personal time alone to take a shower after spending multiple hours together\n\n* Or not being guilt tripped/manipulated the morning after an overnight when a Sb wants to leave and go home?\n\nShould I assume from your comment that a Sb has no right to expect these things and that by her creating this post  she's advocating taking advantage of SDs and this post should be removed?",
                                                    "author": "LaSirene23",
                                                    "id": "j8olwsr",
                                                    "parent_id": "t1_j8obkn2",
                                                    "score": 4,
                                                    "created_utc": 1676494743.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Strawman.",
                                            "author": "OldschoolSD",
                                            "id": "j8pl0x8",
                                            "parent_id": "t1_j8n9dzr",
                                            "score": 1,
                                            "created_utc": 1676509306.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "LOL I’m quite happy.   Why is it that both you and our esteemed leader are calling me out for negativity and not the OP who is being incredibly negative and acting like all SDs are buffoons who don’t know women like to sleep and not be treating like sex toys?   Dare I say you are both faster to criticize a man (like OP is) than a woman?!?",
            "author": "DarthDaddius",
            "id": "j8lmie7",
            "parent_id": "t1_j8lfgr6",
            "score": -6,
            "created_utc": 1676437905.0,
            "replies": [
                {
                    "body": "it's the same double standard that's been going on for a while now. women can come on here and bash men all they want, but if the men are critical, or God forbid just humorously sarcastic, we are evil.",
                    "author": "joc13",
                    "id": "j8oabbq",
                    "parent_id": "t1_j8lmie7",
                    "score": -2,
                    "created_utc": 1676490417.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The implications of this comment are limitless. Why are you in trouble? What was the math for? What happens if the math is _wrong??_  My mind is reeling.",
            "author": "dontkillmejustkinkme",
            "id": "j8ll1o5",
            "parent_id": "t1_j8ljobb",
            "score": 2,
            "created_utc": 1676437006.0,
            "replies": [
                {
                    "body": "I do math out loud for my business while awake, so if I’m getting it wrong in my sleep then I must not be doing it right and the IRS will come after me, I guess it’s a good thing I didn’t file my taxes in my sleep though",
                    "author": "TryHard-POPS",
                    "id": "j8ll6f6",
                    "parent_id": "t1_j8ll1o5",
                    "score": 3,
                    "created_utc": 1676437086.0,
                    "replies": [
                        {
                            "body": "if it's the IRS you're worried about, you're not doing *math*, you're doing arithmetic 😉",
                            "author": "joc13",
                            "id": "j8ob53b",
                            "parent_id": "t1_j8ll6f6",
                            "score": 3,
                            "created_utc": 1676490732.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some people need this post. More than you know. Maybe some SB’s lurking in the corner exhibit this behaviour too and are realising they need to fix it. \n\nThe post is constructive. Just because you don’t need this doesn’t mean no one else does either?\nThat’s like going into primary school and screaming everyone knows this!!\nWell some people don’t. \n\nI have seen a few guys admitting to their snoring in the comments. Some people just need incentive to take action. \nIf guys are doing the other things on the post, why on earth would they out themselves? It’s embarrassing.\n\nRespectfully, as an SD, you have no idea what it’s like to be with other SDs. As an SB, I can’t say I don’t react like X so NO OTHER SB’s react like X.\n\nClearly if OP went through the trouble of writing the post, it’s safe to say that SOME men acted like that. If SB’s have discussed the topic before, clearly it’s an issue. Why’s that so hard to understand? It may be a negative post but I’m SURE experiencing that is negative as well.\n\nHow delusional do you have to be for someone to outline their experience and counter it with **ACTUALLY, that doesn’t exist**\n\nLook how many women are in agreement in the comments. It obviously needed to be said. Now some guys can see why their relationship may not have worked out. Some people are not self aware, and it’s an insult to those who are changing their behaviour to say “no one needs this”.\n\nPersonally, I’ve only experienced snoring. But I’m not an experienced SB. NEITHER ARE YOU.",
            "author": "curlybabygirly",
            "id": "j8mrkuv",
            "parent_id": "t1_j8ln932",
            "score": 7,
            "created_utc": 1676468180.0,
            "replies": [
                {
                    "body": ">> How delusional do you have to be for someone to outline their experience and counter it with ACTUALLY, that doesn’t exist\n\nHow delusional do you have to be to think that I wrote that when I didn’t say anything like that?\n\nAs to the rest of your rant, as I said before, yes, many if not most older men snore.  As do a lot of younger women, especially if they drink, but it’s certainly more common with older men.  That’s not news and it’s not that men are “admitting” it and realizing “omg I had no idea.”   \n\nAs to the other behaviors, my point is that the men doing them are not behaving as SDs and that the SBs should not stay with them.  Sounds like a pro-SB argument to me, yet I’m lableles as the negative toxic SD.  🤷‍♂️",
                    "author": "DarthDaddius",
                    "id": "j8mts9h",
                    "parent_id": "t1_j8mrkuv",
                    "score": -2,
                    "created_utc": 1676469264.0,
                    "replies": [
                        {
                            "body": "I have no idea how wanting to sleep through the night makes you a pro SB   but from reading through this thread you clearly  didn't take my warning seriously. You need to find another community that's a better fit for you.",
                            "author": "LaSirene23",
                            "id": "j8n9dzr",
                            "parent_id": "t1_j8mts9h",
                            "score": 6,
                            "created_utc": 1676476005.0,
                            "replies": [
                                {
                                    "body": "and why wasn't this post deleted to begin with when it self proclaimed that it was brought here from another subreddit? with an obvious anti-SD agenda?",
                                    "author": "joc13",
                                    "id": "j8obkn2",
                                    "parent_id": "t1_j8n9dzr",
                                    "score": -1,
                                    "created_utc": 1676490891.0,
                                    "replies": [
                                        {
                                            "body": "What part of it is an anti SD agenda? \n\n* wanting to sleep through the night without being woken up multiple times for sex?\n\n* Some personal time alone to take a shower after spending multiple hours together\n\n* Or not being guilt tripped/manipulated the morning after an overnight when a Sb wants to leave and go home?\n\nShould I assume from your comment that a Sb has no right to expect these things and that by her creating this post  she's advocating taking advantage of SDs and this post should be removed?",
                                            "author": "LaSirene23",
                                            "id": "j8olwsr",
                                            "parent_id": "t1_j8obkn2",
                                            "score": 4,
                                            "created_utc": 1676494743.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Strawman.",
                                    "author": "OldschoolSD",
                                    "id": "j8pl0x8",
                                    "parent_id": "t1_j8n9dzr",
                                    "score": 1,
                                    "created_utc": 1676509306.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "it's the same double standard that's been going on for a while now. women can come on here and bash men all they want, but if the men are critical, or God forbid just humorously sarcastic, we are evil.",
            "author": "joc13",
            "id": "j8oabbq",
            "parent_id": "t1_j8lmie7",
            "score": -2,
            "created_utc": 1676490417.0,
            "replies": []
        },
        {
            "body": "I do math out loud for my business while awake, so if I’m getting it wrong in my sleep then I must not be doing it right and the IRS will come after me, I guess it’s a good thing I didn’t file my taxes in my sleep though",
            "author": "TryHard-POPS",
            "id": "j8ll6f6",
            "parent_id": "t1_j8ll1o5",
            "score": 3,
            "created_utc": 1676437086.0,
            "replies": [
                {
                    "body": "if it's the IRS you're worried about, you're not doing *math*, you're doing arithmetic 😉",
                    "author": "joc13",
                    "id": "j8ob53b",
                    "parent_id": "t1_j8ll6f6",
                    "score": 3,
                    "created_utc": 1676490732.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">> How delusional do you have to be for someone to outline their experience and counter it with ACTUALLY, that doesn’t exist\n\nHow delusional do you have to be to think that I wrote that when I didn’t say anything like that?\n\nAs to the rest of your rant, as I said before, yes, many if not most older men snore.  As do a lot of younger women, especially if they drink, but it’s certainly more common with older men.  That’s not news and it’s not that men are “admitting” it and realizing “omg I had no idea.”   \n\nAs to the other behaviors, my point is that the men doing them are not behaving as SDs and that the SBs should not stay with them.  Sounds like a pro-SB argument to me, yet I’m lableles as the negative toxic SD.  🤷‍♂️",
            "author": "DarthDaddius",
            "id": "j8mts9h",
            "parent_id": "t1_j8mrkuv",
            "score": -2,
            "created_utc": 1676469264.0,
            "replies": [
                {
                    "body": "I have no idea how wanting to sleep through the night makes you a pro SB   but from reading through this thread you clearly  didn't take my warning seriously. You need to find another community that's a better fit for you.",
                    "author": "LaSirene23",
                    "id": "j8n9dzr",
                    "parent_id": "t1_j8mts9h",
                    "score": 6,
                    "created_utc": 1676476005.0,
                    "replies": [
                        {
                            "body": "and why wasn't this post deleted to begin with when it self proclaimed that it was brought here from another subreddit? with an obvious anti-SD agenda?",
                            "author": "joc13",
                            "id": "j8obkn2",
                            "parent_id": "t1_j8n9dzr",
                            "score": -1,
                            "created_utc": 1676490891.0,
                            "replies": [
                                {
                                    "body": "What part of it is an anti SD agenda? \n\n* wanting to sleep through the night without being woken up multiple times for sex?\n\n* Some personal time alone to take a shower after spending multiple hours together\n\n* Or not being guilt tripped/manipulated the morning after an overnight when a Sb wants to leave and go home?\n\nShould I assume from your comment that a Sb has no right to expect these things and that by her creating this post  she's advocating taking advantage of SDs and this post should be removed?",
                                    "author": "LaSirene23",
                                    "id": "j8olwsr",
                                    "parent_id": "t1_j8obkn2",
                                    "score": 4,
                                    "created_utc": 1676494743.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Strawman.",
                            "author": "OldschoolSD",
                            "id": "j8pl0x8",
                            "parent_id": "t1_j8n9dzr",
                            "score": 1,
                            "created_utc": 1676509306.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "if it's the IRS you're worried about, you're not doing *math*, you're doing arithmetic 😉",
            "author": "joc13",
            "id": "j8ob53b",
            "parent_id": "t1_j8ll6f6",
            "score": 3,
            "created_utc": 1676490732.0,
            "replies": []
        },
        {
            "body": "I have no idea how wanting to sleep through the night makes you a pro SB   but from reading through this thread you clearly  didn't take my warning seriously. You need to find another community that's a better fit for you.",
            "author": "LaSirene23",
            "id": "j8n9dzr",
            "parent_id": "t1_j8mts9h",
            "score": 6,
            "created_utc": 1676476005.0,
            "replies": [
                {
                    "body": "and why wasn't this post deleted to begin with when it self proclaimed that it was brought here from another subreddit? with an obvious anti-SD agenda?",
                    "author": "joc13",
                    "id": "j8obkn2",
                    "parent_id": "t1_j8n9dzr",
                    "score": -1,
                    "created_utc": 1676490891.0,
                    "replies": [
                        {
                            "body": "What part of it is an anti SD agenda? \n\n* wanting to sleep through the night without being woken up multiple times for sex?\n\n* Some personal time alone to take a shower after spending multiple hours together\n\n* Or not being guilt tripped/manipulated the morning after an overnight when a Sb wants to leave and go home?\n\nShould I assume from your comment that a Sb has no right to expect these things and that by her creating this post  she's advocating taking advantage of SDs and this post should be removed?",
                            "author": "LaSirene23",
                            "id": "j8olwsr",
                            "parent_id": "t1_j8obkn2",
                            "score": 4,
                            "created_utc": 1676494743.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Strawman.",
                    "author": "OldschoolSD",
                    "id": "j8pl0x8",
                    "parent_id": "t1_j8n9dzr",
                    "score": 1,
                    "created_utc": 1676509306.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "and why wasn't this post deleted to begin with when it self proclaimed that it was brought here from another subreddit? with an obvious anti-SD agenda?",
            "author": "joc13",
            "id": "j8obkn2",
            "parent_id": "t1_j8n9dzr",
            "score": -1,
            "created_utc": 1676490891.0,
            "replies": [
                {
                    "body": "What part of it is an anti SD agenda? \n\n* wanting to sleep through the night without being woken up multiple times for sex?\n\n* Some personal time alone to take a shower after spending multiple hours together\n\n* Or not being guilt tripped/manipulated the morning after an overnight when a Sb wants to leave and go home?\n\nShould I assume from your comment that a Sb has no right to expect these things and that by her creating this post  she's advocating taking advantage of SDs and this post should be removed?",
                    "author": "LaSirene23",
                    "id": "j8olwsr",
                    "parent_id": "t1_j8obkn2",
                    "score": 4,
                    "created_utc": 1676494743.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Strawman.",
            "author": "OldschoolSD",
            "id": "j8pl0x8",
            "parent_id": "t1_j8n9dzr",
            "score": 1,
            "created_utc": 1676509306.0,
            "replies": []
        },
        {
            "body": "What part of it is an anti SD agenda? \n\n* wanting to sleep through the night without being woken up multiple times for sex?\n\n* Some personal time alone to take a shower after spending multiple hours together\n\n* Or not being guilt tripped/manipulated the morning after an overnight when a Sb wants to leave and go home?\n\nShould I assume from your comment that a Sb has no right to expect these things and that by her creating this post  she's advocating taking advantage of SDs and this post should be removed?",
            "author": "LaSirene23",
            "id": "j8olwsr",
            "parent_id": "t1_j8obkn2",
            "score": 4,
            "created_utc": 1676494743.0,
            "replies": []
        }
    ]
}