{
    "title": "A year out of the bowl and still having unintended side effects...",
    "post_id": "bj03fx",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/bj03fx/a_year_out_of_the_bowl_and_still_having/",
    "author": "sugarholic_",
    "body": "Just went on a first date with a guy from one of those swiping apps. His profile seemed pretty generic and half his photos were hot so I thought I'd give it a shot and see how he looks/acts in person. Well, as the date goes on, it slowly starts coming out that he's rich. Granted, he's around my age, so this might not seem a ton to someone decades older than us, but he's somewhere in high 6 figures, low 7 figures annual income plus owning several different properties.  \n\nI didn't even realize it until it was over, but the more I picked up on his wealth, the more I subconsciously slid back into SB mode. Be *extra* charming. Be *extra* playful when laughing at his jokes. Let him touch me even if I'm not sure how I feel about it. Fantasize about future trips we might take together. And it was *fun*. \n\nBut now I'm sitting here thinking \"Wait a second do I actually like him? Or did I just enjoy that memory trip down SB lane? Or maybe this mean I miss the thrill from sugaring? But also, do I like him?!\" I am very confused. \n\nThis happen to any other SBs? Maybe even SDs lol?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/bj03fx/a_year_out_of_the_bowl_and_still_having/",
    "score": 96,
    "upvote_ratio": 0.97,
    "created_utc": 1556605728.0,
    "num_comments": 43,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I felt like I wrote this post. \n\nI am looking for both SD and vanilla relationship simultaneously. The wires keep getting crossed...\n\nI had a date over the weekend with a young guy in tech. And the rest read like your post.\n\nExcept that paying half of the bill at the end of the date was quite the wake up call hahahah.\n\nHonestly once you go sugar.... I don’t think you ever go back to vanilla thinking.",
            "author": "MinxBagCoin",
            "id": "em4dph5",
            "parent_id": "t3_bj03fx",
            "score": 42,
            "created_utc": 1556606744.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "em4yn49",
                    "parent_id": "t1_em4dph5",
                    "score": 10,
                    "created_utc": 1556632247.0,
                    "replies": [
                        {
                            "body": "So much for equal rights.",
                            "author": "JBWentworth",
                            "id": "em5ljdb",
                            "parent_id": "t1_em4yn49",
                            "score": -4,
                            "created_utc": 1556646740.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "em4mrbk",
                    "parent_id": "t1_em4dph5",
                    "score": 17,
                    "created_utc": 1556621237.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "em4nszw",
                            "parent_id": "t1_em4mrbk",
                            "score": 10,
                            "created_utc": 1556622532.0,
                            "replies": [
                                {
                                    "body": "I don’t know when this became true. But I went on a vanilla “date”...I don’t know if I can even call it that this weekend. He picked the restaurant. We start of with appetizers and I’m looking at the entrees ($25-30) and decide what I want. Waiter comes back and this guy looks at me and says, “Oh you weren’t really hungry right?” \n\nWhy invite someone to a dinner date to a restaurant you can’t afford? \n\nI was incredulous and hungry. I couldn’t get with the program and left 20 mins after. I got Shake Shack.",
                                    "author": null,
                                    "id": "em4yohf",
                                    "parent_id": "t1_em4nszw",
                                    "score": 11,
                                    "created_utc": 1556632273.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I’ve hilariously run into a girl who insisted on paying the entire tab the first few dates.   I had to bring it up at lunch and then she agreed to spilt the tab.   It’s cute, and definitely one way to tell someone you are not looking for sugar, or a super long-game digging the hooks deep.  Regardless, I’m smitten:)",
                            "author": "FlexEconGuy",
                            "id": "em4o07t",
                            "parent_id": "t1_em4mrbk",
                            "score": 9,
                            "created_utc": 1556622771.0,
                            "replies": [
                                {
                                    "body": "No SB EVER does this. She must be looking for a trophy wife position.",
                                    "author": "GSSD",
                                    "id": "em4zz3l",
                                    "parent_id": "t1_em4o07t",
                                    "score": 12,
                                    "created_utc": 1556633185.0,
                                    "replies": [
                                        {
                                            "body": "100%.   Though it is appropriate for a SB to at least occasionally make a show of picking up the tab.  Same dynamic as a son-in-law trying to pay his father-in-law’s tab.",
                                            "author": "FlexEconGuy",
                                            "id": "em52snl",
                                            "parent_id": "t1_em4zz3l",
                                            "score": 3,
                                            "created_utc": 1556635109.0,
                                            "replies": [
                                                {
                                                    "body": "Who does that? Lol",
                                                    "author": "GSSD",
                                                    "id": "em534xu",
                                                    "parent_id": "t1_em52snl",
                                                    "score": 4,
                                                    "created_utc": 1556635341.0,
                                                    "replies": [
                                                        {
                                                            "body": "Again, it’s messaging.  This girl used to work so far underneath me, I was not aware we had ever worked at the same company in the past until she mentioned it at lunch; Despite always having a curiosity when we bumped into each other at industry functions.  \n\nShe wanting to prove a point that she is not sugar.",
                                                            "author": "FlexEconGuy",
                                                            "id": "em549rz",
                                                            "parent_id": "t1_em534xu",
                                                            "score": 4,
                                                            "created_utc": 1556636078.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Me until my marriage started falling apart.  It was nefarious messaging “I don’t need your money.”   Dick measuring, if you will.  \n\nAlas, when the union began to crumble, I dropped any thoughts of reaching for my wallet at dinner.",
                                                            "author": "FlexEconGuy",
                                                            "id": "em53tec",
                                                            "parent_id": "t1_em534xu",
                                                            "score": 2,
                                                            "created_utc": 1556635787.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "My first SB insisted on paying for my dinner every-other-date for a while. Finally I insisted it was getting ridiculous: she was 21 and making $10.50/hr.  She just didn't want to make me feel like she was \"using\" me.",
                                                            "author": "ziffert",
                                                            "id": "em5k0tp",
                                                            "parent_id": "t1_em534xu",
                                                            "score": 1,
                                                            "created_utc": 1556645784.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "For my first date with my first real BF, I had to pay for both our tickets. He \"forgot\" his wallet. Hahahaha",
                            "author": "snake_pod",
                            "id": "em58xs6",
                            "parent_id": "t1_em4mrbk",
                            "score": 2,
                            "created_utc": 1556639105.0,
                            "replies": [
                                {
                                    "body": "having raised a son and seen, in person, him leave the house without his wallet on many occasions I can sympathize.\n\nafter a certain age, it stops being a cute quirky trait and becomes plain ole irresponsibility",
                                    "author": "joc13",
                                    "id": "em5si8y",
                                    "parent_id": "t1_em58xs6",
                                    "score": 4,
                                    "created_utc": 1556650963.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I've been at the lunch table with a bunch of guys talking about their horrible dates suggesting they pay for the meal or uber more than once and yea it's always very [awkwaaaard](https://media.tenor.com/images/2d4acce9125a6a099d589c701ef4b6a0/tenor.gif). Actually even doing the fake offering to pay is considered \"gold digging.\"",
                            "author": "adequatelay",
                            "id": "em65erx",
                            "parent_id": "t1_em4mrbk",
                            "score": 2,
                            "created_utc": 1556658415.0,
                            "replies": []
                        },
                        {
                            "body": "A version of this happened to me recently. Been on a few dates with a guy, he makes great money. owns property in 2 states and is single, never married, no kids. We went to breakfast, check is less than $30 and he asks me if I can pay the tip.",
                            "author": "Lizzy1223",
                            "id": "emfdvoa",
                            "parent_id": "t1_em4mrbk",
                            "score": 1,
                            "created_utc": 1556906295.0,
                            "replies": []
                        },
                        {
                            "body": "I prefer in my vanilla life. I think it leads to a more equal partnership. \n\nAnd I get to see how the man reacts to a “no”.",
                            "author": "Rosa_Velvet",
                            "id": "em5245n",
                            "parent_id": "t1_em4mrbk",
                            "score": 1,
                            "created_utc": 1556634648.0,
                            "replies": []
                        },
                        {
                            "body": "But if he’s looking for a life partner, then best to find someone independent and able to take care of herself. I don’t want to come off as cheap, but if both the parties are in similar income group, no need for the man to pick up the tab all the time.",
                            "author": "supportiveceo",
                            "id": "em4zudg",
                            "parent_id": "t1_em4mrbk",
                            "score": 0,
                            "created_utc": 1556633093.0,
                            "replies": []
                        },
                        {
                            "body": "In the short answer is  equality,women’s Lib women being assertive The 21st-century and more equality between the genders. I’m not sure we can have it both ways to be fair to both genders. I suppose it’s possible and each individual relationship to decide. That would certainly require a lot of flexibility from both people but there are some that I think could pull it off.",
                            "author": "puckhead4",
                            "id": "em4sakm",
                            "parent_id": "t1_em4mrbk",
                            "score": -2,
                            "created_utc": 1556627135.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can completely relate. I recently got back into vanilla dating world after being out of it for over a year due to being in school full-time. At the same time I have sugar arrangements and I'm in the hunt for a new SD to replace mine that are too busy to meet. \n\nI recently had two vanilla dates that went well. Early on in the dates I could tell that he made a lot of money. Immediately my mind went into sugar mode. Just like you said, \"Be extra charming, casually touch his arm or leg, laugh a lot, fantasize about trips and fancy meals.\" \n\nI have to say, it was also nice to be out with guys closer to my age whom I was physically attracted to for once.  But even that was difficult...the one guy and I totally hit it off. I found him very attractive and it was nice to have that feeling of pure lust and attraction that I rarely feel in the sugar bowl. We spent 5 or 6 hours together on the date and when I gave him a goodnight kiss in his car, I was much more sexually brazen than I usually am on the first date. I asked him about kinks and fetishes and I grabbed his dick as I left, things I've never done on a vanilla first date!\n\n I had to constantly remind myself of why I'm vanilla dating: because I'm in my 30s and need to find a life partner and because I've been single for many years and want to find a boyfriend or girlfriend. NOT to be a companion to someone because they are rich. That's what sugaring is for. It can be really tough to compartmentalize and keep the two separate. Some days, I fear that I'll never be able to fully return to vanilla dating. 😕",
            "author": "sweetk412",
            "id": "em4sgpg",
            "parent_id": "t3_bj03fx",
            "score": 13,
            "created_utc": 1556627287.0,
            "replies": [
                {
                    "body": "I'm wondering if the first step in the process is to limit yourself to SD who treat you , across the relationship, as well as your target IRL vanilla .",
                    "author": "pinotandsugar",
                    "id": "em4zwty",
                    "parent_id": "t1_em4sgpg",
                    "score": 1,
                    "created_utc": 1556633140.0,
                    "replies": [
                        {
                            "body": "My SDs do. I only date people who treat me well, whether sugar or vanilla.",
                            "author": "sweetk412",
                            "id": "em538hk",
                            "parent_id": "t1_em4zwty",
                            "score": 5,
                            "created_utc": 1556635406.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Good that at least you realize it though that is certainly a positive first step I think it might just take some time but the fact that you are self-aware I think is a great start. I also love the fact that you had the self-confidence to be physically forward with the man you were attracted to way to go Miss",
                    "author": "puckhead4",
                    "id": "em4txj2",
                    "parent_id": "t1_em4sgpg",
                    "score": -2,
                    "created_utc": 1556628587.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup. Happens to us too. Every time i see a young woman, i picture myself asking her out, and thinking of ways to offer helping her with her bills wothout sounding like a creep lmao.",
            "author": "dade_murphy1",
            "id": "em4dnfh",
            "parent_id": "t3_bj03fx",
            "score": 35,
            "created_utc": 1556606663.0,
            "replies": []
        },
        {
            "body": "I don’t know why i read this thinking you sound like Michaela Pratt from how to get away with murder 😂",
            "author": "omfgimupsssssset",
            "id": "em4m8lt",
            "parent_id": "t3_bj03fx",
            "score": 5,
            "created_utc": 1556620539.0,
            "replies": [
                {
                    "body": "Especially when she was into Marcus with the Scandal crossover!",
                    "author": null,
                    "id": "em4ytc2",
                    "parent_id": "t1_em4m8lt",
                    "score": 3,
                    "created_utc": 1556632367.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Kinda, yeah. Not so much SB mode but just, \"I want to be spoiled / pampered\" or \"I want a man who WANTS to pamper me\" mode. This is why I somewhat stay away from vanilla dating. At this point I only want generous men, nothing less lol. I tried to do vanilla dating not too long ago, guy was great, but I know he's  not the SD type so I bounced early on. Sigh.",
            "author": "snake_pod",
            "id": "em58upo",
            "parent_id": "t3_bj03fx",
            "score": 5,
            "created_utc": 1556639049.0,
            "replies": []
        },
        {
            "body": "Ha, I understand this as a SD. Two months ago I  went on a non sugar date with a lady near my age (I'm 53) and I realized I was getting annoyed because she wasn't being overly nice and flirty with me. She didn't even laugh at all my jokes. \n\nSugar dating has spoiled me. Some say sugar dating is a lie. I don't see it as a lie because everyone knows the situation going in. I look at it as a movie. We're all playing our part. *And in my movie all my jokes are funny!*",
            "author": null,
            "id": "em60k10",
            "parent_id": "t3_bj03fx",
            "score": 4,
            "created_utc": 1556655580.0,
            "replies": []
        },
        {
            "body": "Thank you for this post. I started sugaring at the end of last year and I keep wondering what the impact will be. I have a crush on a guy at work and it's so nice to feel the flutter of excitement again when I see him in the kitchen, I'm going to ask him out soon because life is short but I wonder also about how my sugaring will impact on our date if he says yes...",
            "author": null,
            "id": "em4ej99",
            "parent_id": "t3_bj03fx",
            "score": 3,
            "created_utc": 1556607964.0,
            "replies": [
                {
                    "body": "So glad to see this woman with the confidence to ask a man out",
                    "author": "puckhead4",
                    "id": "em4tibc",
                    "parent_id": "t1_em4ej99",
                    "score": 2,
                    "created_utc": 1556628227.0,
                    "replies": []
                },
                {
                    "body": "Your enhanced sugar skills will enchant him",
                    "author": "CheckPlease-",
                    "id": "em4ycx6",
                    "parent_id": "t1_em4ej99",
                    "score": 1,
                    "created_utc": 1556632040.0,
                    "replies": [
                        {
                            "body": "Haha maybe I'm just becoming dangerously charismatic. This is an upside of sugaring, I find myself much more confident making conversation. However, also want to make sure I can still be authentic.",
                            "author": null,
                            "id": "em4zhdi",
                            "parent_id": "t1_em4ycx6",
                            "score": 4,
                            "created_utc": 1556632833.0,
                            "replies": [
                                {
                                    "body": "Great that there are benefits other than financial/materialistic for one side and physical/biological for the other I think! Sincere congrats on a growing level of confidence.",
                                    "author": "puckhead4",
                                    "id": "em57bal",
                                    "parent_id": "t1_em4zhdi",
                                    "score": 0,
                                    "created_utc": 1556638061.0,
                                    "replies": [
                                        {
                                            "body": "I think I offer more than physical / biological!",
                                            "author": null,
                                            "id": "em57fmp",
                                            "parent_id": "t1_em57bal",
                                            "score": 2,
                                            "created_utc": 1556638138.0,
                                            "replies": [
                                                {
                                                    "body": "You probably do, I in no way meant to imply that you don't and if my script/ choice of words lead you to that conclusion I sincerely apologize.",
                                                    "author": "puckhead4",
                                                    "id": "em59nor",
                                                    "parent_id": "t1_em57fmp",
                                                    "score": 2,
                                                    "created_utc": 1556639571.0,
                                                    "replies": [
                                                        {
                                                            "body": "Haha it's OK!",
                                                            "author": null,
                                                            "id": "em59pwz",
                                                            "parent_id": "t1_em59nor",
                                                            "score": 2,
                                                            "created_utc": 1556639613.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "yes it happens. I was hiring a person for some part time book keeping, Casual interiew at a coffee shop.   Upon meeting her my  reflex was \"you look lovely\" .  . . .duh   I can't imagine what she thought. She drifted to some chatting about travel. Another reflex: \"sounds like you need  rich boyfriend\" . . duh",
            "author": "TooOldForSD",
            "id": "em4exnj",
            "parent_id": "t3_bj03fx",
            "score": 6,
            "created_utc": 1556608569.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "em4mg9r",
                    "parent_id": "t1_em4exnj",
                    "score": 15,
                    "created_utc": 1556620832.0,
                    "replies": [
                        {
                            "body": "Kind of agree DG I have hiring authority but I am very traditional I would never have a job interview of any type in anything but a professional environment with professional demeanor. What’s that old saying sanitized. Don’t defecate where you dine.",
                            "author": "puckhead4",
                            "id": "em4sixh",
                            "parent_id": "t1_em4mg9r",
                            "score": 4,
                            "created_utc": 1556627343.0,
                            "replies": [
                                {
                                    "body": "Ahhh, stories from the battleground. I’ve tried it in vanilla and it was a fecal storm. I don’t even want to know how horrid it could be in sugar. I’ll be using that last line instead of usual crass vocabulary.",
                                    "author": null,
                                    "id": "em4z75r",
                                    "parent_id": "t1_em4sixh",
                                    "score": 2,
                                    "created_utc": 1556632639.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Oh God, please say you didn't actually say these things and it was just a mental impulse. You're entering dangerous territory here.",
                    "author": "sexviewer",
                    "id": "em51pjv",
                    "parent_id": "t1_em4exnj",
                    "score": 4,
                    "created_utc": 1556634375.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This reminds me of a rule I used to have about dating. Would you still like her (I would ask myself) if she didn't have big tits or that perfect ass? And if the answer was \"probably not,\" I was smart enough to let it go.",
            "author": "doctorcoolpop",
            "id": "em6866m",
            "parent_id": "t3_bj03fx",
            "score": 2,
            "created_utc": 1556660073.0,
            "replies": []
        },
        {
            "body": "I can relate 100000%.  Never quite goes away.",
            "author": "lolal0l",
            "id": "em6accz",
            "parent_id": "t3_bj03fx",
            "score": 2,
            "created_utc": 1556661363.0,
            "replies": []
        },
        {
            "body": "Sugar ruins vanilla-period. You can't/won't ever go back.  On this forum there are no escapes to vanilla by definition, because you are here. If you did escape you would not need to creep back to daydream about the \"good ole days\"",
            "author": "GSSD",
            "id": "em50bvv",
            "parent_id": "t3_bj03fx",
            "score": 4,
            "created_utc": 1556633430.0,
            "replies": []
        },
        {
            "body": "To turn this around (since you invited SDs to the thread!).\n\nMy mom knows I do this.  She said to me recently, \"why not find yourself a nice girl your own age? Maybe a doctor who's got her life together and makes good money?\"  \nI immediately said, \"what would she need me for?\"\n\nThat's SD thinking ... it's embedded in me now.",
            "author": "ziffert",
            "id": "em5ke7o",
            "parent_id": "t3_bj03fx",
            "score": 2,
            "created_utc": 1556646015.0,
            "replies": []
        },
        {
            "body": "Reminds me, in one of my pillow talks with a former SB she told me how she felt about dating in general and why if at all she would date someone vanilla when she could date a older guy with (& for) money. We had gotten close by then and as her well wisher I started to think of where she would go next and at 31, I was hoping she was on the verge of moving on from her SB life. Well not even close, she was hooked and it seemed could not figure out how to see or date men if there was no financial incentive to do that.",
            "author": null,
            "id": "em581nd",
            "parent_id": "t3_bj03fx",
            "score": 0,
            "created_utc": 1556638529.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "em4yn49",
            "parent_id": "t1_em4dph5",
            "score": 10,
            "created_utc": 1556632247.0,
            "replies": [
                {
                    "body": "So much for equal rights.",
                    "author": "JBWentworth",
                    "id": "em5ljdb",
                    "parent_id": "t1_em4yn49",
                    "score": -4,
                    "created_utc": 1556646740.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "em4mrbk",
            "parent_id": "t1_em4dph5",
            "score": 17,
            "created_utc": 1556621237.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "em4nszw",
                    "parent_id": "t1_em4mrbk",
                    "score": 10,
                    "created_utc": 1556622532.0,
                    "replies": [
                        {
                            "body": "I don’t know when this became true. But I went on a vanilla “date”...I don’t know if I can even call it that this weekend. He picked the restaurant. We start of with appetizers and I’m looking at the entrees ($25-30) and decide what I want. Waiter comes back and this guy looks at me and says, “Oh you weren’t really hungry right?” \n\nWhy invite someone to a dinner date to a restaurant you can’t afford? \n\nI was incredulous and hungry. I couldn’t get with the program and left 20 mins after. I got Shake Shack.",
                            "author": null,
                            "id": "em4yohf",
                            "parent_id": "t1_em4nszw",
                            "score": 11,
                            "created_utc": 1556632273.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I’ve hilariously run into a girl who insisted on paying the entire tab the first few dates.   I had to bring it up at lunch and then she agreed to spilt the tab.   It’s cute, and definitely one way to tell someone you are not looking for sugar, or a super long-game digging the hooks deep.  Regardless, I’m smitten:)",
                    "author": "FlexEconGuy",
                    "id": "em4o07t",
                    "parent_id": "t1_em4mrbk",
                    "score": 9,
                    "created_utc": 1556622771.0,
                    "replies": [
                        {
                            "body": "No SB EVER does this. She must be looking for a trophy wife position.",
                            "author": "GSSD",
                            "id": "em4zz3l",
                            "parent_id": "t1_em4o07t",
                            "score": 12,
                            "created_utc": 1556633185.0,
                            "replies": [
                                {
                                    "body": "100%.   Though it is appropriate for a SB to at least occasionally make a show of picking up the tab.  Same dynamic as a son-in-law trying to pay his father-in-law’s tab.",
                                    "author": "FlexEconGuy",
                                    "id": "em52snl",
                                    "parent_id": "t1_em4zz3l",
                                    "score": 3,
                                    "created_utc": 1556635109.0,
                                    "replies": [
                                        {
                                            "body": "Who does that? Lol",
                                            "author": "GSSD",
                                            "id": "em534xu",
                                            "parent_id": "t1_em52snl",
                                            "score": 4,
                                            "created_utc": 1556635341.0,
                                            "replies": [
                                                {
                                                    "body": "Again, it’s messaging.  This girl used to work so far underneath me, I was not aware we had ever worked at the same company in the past until she mentioned it at lunch; Despite always having a curiosity when we bumped into each other at industry functions.  \n\nShe wanting to prove a point that she is not sugar.",
                                                    "author": "FlexEconGuy",
                                                    "id": "em549rz",
                                                    "parent_id": "t1_em534xu",
                                                    "score": 4,
                                                    "created_utc": 1556636078.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Me until my marriage started falling apart.  It was nefarious messaging “I don’t need your money.”   Dick measuring, if you will.  \n\nAlas, when the union began to crumble, I dropped any thoughts of reaching for my wallet at dinner.",
                                                    "author": "FlexEconGuy",
                                                    "id": "em53tec",
                                                    "parent_id": "t1_em534xu",
                                                    "score": 2,
                                                    "created_utc": 1556635787.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "My first SB insisted on paying for my dinner every-other-date for a while. Finally I insisted it was getting ridiculous: she was 21 and making $10.50/hr.  She just didn't want to make me feel like she was \"using\" me.",
                                                    "author": "ziffert",
                                                    "id": "em5k0tp",
                                                    "parent_id": "t1_em534xu",
                                                    "score": 1,
                                                    "created_utc": 1556645784.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "For my first date with my first real BF, I had to pay for both our tickets. He \"forgot\" his wallet. Hahahaha",
                    "author": "snake_pod",
                    "id": "em58xs6",
                    "parent_id": "t1_em4mrbk",
                    "score": 2,
                    "created_utc": 1556639105.0,
                    "replies": [
                        {
                            "body": "having raised a son and seen, in person, him leave the house without his wallet on many occasions I can sympathize.\n\nafter a certain age, it stops being a cute quirky trait and becomes plain ole irresponsibility",
                            "author": "joc13",
                            "id": "em5si8y",
                            "parent_id": "t1_em58xs6",
                            "score": 4,
                            "created_utc": 1556650963.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I've been at the lunch table with a bunch of guys talking about their horrible dates suggesting they pay for the meal or uber more than once and yea it's always very [awkwaaaard](https://media.tenor.com/images/2d4acce9125a6a099d589c701ef4b6a0/tenor.gif). Actually even doing the fake offering to pay is considered \"gold digging.\"",
                    "author": "adequatelay",
                    "id": "em65erx",
                    "parent_id": "t1_em4mrbk",
                    "score": 2,
                    "created_utc": 1556658415.0,
                    "replies": []
                },
                {
                    "body": "A version of this happened to me recently. Been on a few dates with a guy, he makes great money. owns property in 2 states and is single, never married, no kids. We went to breakfast, check is less than $30 and he asks me if I can pay the tip.",
                    "author": "Lizzy1223",
                    "id": "emfdvoa",
                    "parent_id": "t1_em4mrbk",
                    "score": 1,
                    "created_utc": 1556906295.0,
                    "replies": []
                },
                {
                    "body": "I prefer in my vanilla life. I think it leads to a more equal partnership. \n\nAnd I get to see how the man reacts to a “no”.",
                    "author": "Rosa_Velvet",
                    "id": "em5245n",
                    "parent_id": "t1_em4mrbk",
                    "score": 1,
                    "created_utc": 1556634648.0,
                    "replies": []
                },
                {
                    "body": "But if he’s looking for a life partner, then best to find someone independent and able to take care of herself. I don’t want to come off as cheap, but if both the parties are in similar income group, no need for the man to pick up the tab all the time.",
                    "author": "supportiveceo",
                    "id": "em4zudg",
                    "parent_id": "t1_em4mrbk",
                    "score": 0,
                    "created_utc": 1556633093.0,
                    "replies": []
                },
                {
                    "body": "In the short answer is  equality,women’s Lib women being assertive The 21st-century and more equality between the genders. I’m not sure we can have it both ways to be fair to both genders. I suppose it’s possible and each individual relationship to decide. That would certainly require a lot of flexibility from both people but there are some that I think could pull it off.",
                    "author": "puckhead4",
                    "id": "em4sakm",
                    "parent_id": "t1_em4mrbk",
                    "score": -2,
                    "created_utc": 1556627135.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm wondering if the first step in the process is to limit yourself to SD who treat you , across the relationship, as well as your target IRL vanilla .",
            "author": "pinotandsugar",
            "id": "em4zwty",
            "parent_id": "t1_em4sgpg",
            "score": 1,
            "created_utc": 1556633140.0,
            "replies": [
                {
                    "body": "My SDs do. I only date people who treat me well, whether sugar or vanilla.",
                    "author": "sweetk412",
                    "id": "em538hk",
                    "parent_id": "t1_em4zwty",
                    "score": 5,
                    "created_utc": 1556635406.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good that at least you realize it though that is certainly a positive first step I think it might just take some time but the fact that you are self-aware I think is a great start. I also love the fact that you had the self-confidence to be physically forward with the man you were attracted to way to go Miss",
            "author": "puckhead4",
            "id": "em4txj2",
            "parent_id": "t1_em4sgpg",
            "score": -2,
            "created_utc": 1556628587.0,
            "replies": []
        },
        {
            "body": "Especially when she was into Marcus with the Scandal crossover!",
            "author": null,
            "id": "em4ytc2",
            "parent_id": "t1_em4m8lt",
            "score": 3,
            "created_utc": 1556632367.0,
            "replies": []
        },
        {
            "body": "So glad to see this woman with the confidence to ask a man out",
            "author": "puckhead4",
            "id": "em4tibc",
            "parent_id": "t1_em4ej99",
            "score": 2,
            "created_utc": 1556628227.0,
            "replies": []
        },
        {
            "body": "Your enhanced sugar skills will enchant him",
            "author": "CheckPlease-",
            "id": "em4ycx6",
            "parent_id": "t1_em4ej99",
            "score": 1,
            "created_utc": 1556632040.0,
            "replies": [
                {
                    "body": "Haha maybe I'm just becoming dangerously charismatic. This is an upside of sugaring, I find myself much more confident making conversation. However, also want to make sure I can still be authentic.",
                    "author": null,
                    "id": "em4zhdi",
                    "parent_id": "t1_em4ycx6",
                    "score": 4,
                    "created_utc": 1556632833.0,
                    "replies": [
                        {
                            "body": "Great that there are benefits other than financial/materialistic for one side and physical/biological for the other I think! Sincere congrats on a growing level of confidence.",
                            "author": "puckhead4",
                            "id": "em57bal",
                            "parent_id": "t1_em4zhdi",
                            "score": 0,
                            "created_utc": 1556638061.0,
                            "replies": [
                                {
                                    "body": "I think I offer more than physical / biological!",
                                    "author": null,
                                    "id": "em57fmp",
                                    "parent_id": "t1_em57bal",
                                    "score": 2,
                                    "created_utc": 1556638138.0,
                                    "replies": [
                                        {
                                            "body": "You probably do, I in no way meant to imply that you don't and if my script/ choice of words lead you to that conclusion I sincerely apologize.",
                                            "author": "puckhead4",
                                            "id": "em59nor",
                                            "parent_id": "t1_em57fmp",
                                            "score": 2,
                                            "created_utc": 1556639571.0,
                                            "replies": [
                                                {
                                                    "body": "Haha it's OK!",
                                                    "author": null,
                                                    "id": "em59pwz",
                                                    "parent_id": "t1_em59nor",
                                                    "score": 2,
                                                    "created_utc": 1556639613.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "em4mg9r",
            "parent_id": "t1_em4exnj",
            "score": 15,
            "created_utc": 1556620832.0,
            "replies": [
                {
                    "body": "Kind of agree DG I have hiring authority but I am very traditional I would never have a job interview of any type in anything but a professional environment with professional demeanor. What’s that old saying sanitized. Don’t defecate where you dine.",
                    "author": "puckhead4",
                    "id": "em4sixh",
                    "parent_id": "t1_em4mg9r",
                    "score": 4,
                    "created_utc": 1556627343.0,
                    "replies": [
                        {
                            "body": "Ahhh, stories from the battleground. I’ve tried it in vanilla and it was a fecal storm. I don’t even want to know how horrid it could be in sugar. I’ll be using that last line instead of usual crass vocabulary.",
                            "author": null,
                            "id": "em4z75r",
                            "parent_id": "t1_em4sixh",
                            "score": 2,
                            "created_utc": 1556632639.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh God, please say you didn't actually say these things and it was just a mental impulse. You're entering dangerous territory here.",
            "author": "sexviewer",
            "id": "em51pjv",
            "parent_id": "t1_em4exnj",
            "score": 4,
            "created_utc": 1556634375.0,
            "replies": []
        },
        {
            "body": "So much for equal rights.",
            "author": "JBWentworth",
            "id": "em5ljdb",
            "parent_id": "t1_em4yn49",
            "score": -4,
            "created_utc": 1556646740.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "em4nszw",
            "parent_id": "t1_em4mrbk",
            "score": 10,
            "created_utc": 1556622532.0,
            "replies": [
                {
                    "body": "I don’t know when this became true. But I went on a vanilla “date”...I don’t know if I can even call it that this weekend. He picked the restaurant. We start of with appetizers and I’m looking at the entrees ($25-30) and decide what I want. Waiter comes back and this guy looks at me and says, “Oh you weren’t really hungry right?” \n\nWhy invite someone to a dinner date to a restaurant you can’t afford? \n\nI was incredulous and hungry. I couldn’t get with the program and left 20 mins after. I got Shake Shack.",
                    "author": null,
                    "id": "em4yohf",
                    "parent_id": "t1_em4nszw",
                    "score": 11,
                    "created_utc": 1556632273.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ve hilariously run into a girl who insisted on paying the entire tab the first few dates.   I had to bring it up at lunch and then she agreed to spilt the tab.   It’s cute, and definitely one way to tell someone you are not looking for sugar, or a super long-game digging the hooks deep.  Regardless, I’m smitten:)",
            "author": "FlexEconGuy",
            "id": "em4o07t",
            "parent_id": "t1_em4mrbk",
            "score": 9,
            "created_utc": 1556622771.0,
            "replies": [
                {
                    "body": "No SB EVER does this. She must be looking for a trophy wife position.",
                    "author": "GSSD",
                    "id": "em4zz3l",
                    "parent_id": "t1_em4o07t",
                    "score": 12,
                    "created_utc": 1556633185.0,
                    "replies": [
                        {
                            "body": "100%.   Though it is appropriate for a SB to at least occasionally make a show of picking up the tab.  Same dynamic as a son-in-law trying to pay his father-in-law’s tab.",
                            "author": "FlexEconGuy",
                            "id": "em52snl",
                            "parent_id": "t1_em4zz3l",
                            "score": 3,
                            "created_utc": 1556635109.0,
                            "replies": [
                                {
                                    "body": "Who does that? Lol",
                                    "author": "GSSD",
                                    "id": "em534xu",
                                    "parent_id": "t1_em52snl",
                                    "score": 4,
                                    "created_utc": 1556635341.0,
                                    "replies": [
                                        {
                                            "body": "Again, it’s messaging.  This girl used to work so far underneath me, I was not aware we had ever worked at the same company in the past until she mentioned it at lunch; Despite always having a curiosity when we bumped into each other at industry functions.  \n\nShe wanting to prove a point that she is not sugar.",
                                            "author": "FlexEconGuy",
                                            "id": "em549rz",
                                            "parent_id": "t1_em534xu",
                                            "score": 4,
                                            "created_utc": 1556636078.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Me until my marriage started falling apart.  It was nefarious messaging “I don’t need your money.”   Dick measuring, if you will.  \n\nAlas, when the union began to crumble, I dropped any thoughts of reaching for my wallet at dinner.",
                                            "author": "FlexEconGuy",
                                            "id": "em53tec",
                                            "parent_id": "t1_em534xu",
                                            "score": 2,
                                            "created_utc": 1556635787.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "My first SB insisted on paying for my dinner every-other-date for a while. Finally I insisted it was getting ridiculous: she was 21 and making $10.50/hr.  She just didn't want to make me feel like she was \"using\" me.",
                                            "author": "ziffert",
                                            "id": "em5k0tp",
                                            "parent_id": "t1_em534xu",
                                            "score": 1,
                                            "created_utc": 1556645784.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "For my first date with my first real BF, I had to pay for both our tickets. He \"forgot\" his wallet. Hahahaha",
            "author": "snake_pod",
            "id": "em58xs6",
            "parent_id": "t1_em4mrbk",
            "score": 2,
            "created_utc": 1556639105.0,
            "replies": [
                {
                    "body": "having raised a son and seen, in person, him leave the house without his wallet on many occasions I can sympathize.\n\nafter a certain age, it stops being a cute quirky trait and becomes plain ole irresponsibility",
                    "author": "joc13",
                    "id": "em5si8y",
                    "parent_id": "t1_em58xs6",
                    "score": 4,
                    "created_utc": 1556650963.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've been at the lunch table with a bunch of guys talking about their horrible dates suggesting they pay for the meal or uber more than once and yea it's always very [awkwaaaard](https://media.tenor.com/images/2d4acce9125a6a099d589c701ef4b6a0/tenor.gif). Actually even doing the fake offering to pay is considered \"gold digging.\"",
            "author": "adequatelay",
            "id": "em65erx",
            "parent_id": "t1_em4mrbk",
            "score": 2,
            "created_utc": 1556658415.0,
            "replies": []
        },
        {
            "body": "A version of this happened to me recently. Been on a few dates with a guy, he makes great money. owns property in 2 states and is single, never married, no kids. We went to breakfast, check is less than $30 and he asks me if I can pay the tip.",
            "author": "Lizzy1223",
            "id": "emfdvoa",
            "parent_id": "t1_em4mrbk",
            "score": 1,
            "created_utc": 1556906295.0,
            "replies": []
        },
        {
            "body": "I prefer in my vanilla life. I think it leads to a more equal partnership. \n\nAnd I get to see how the man reacts to a “no”.",
            "author": "Rosa_Velvet",
            "id": "em5245n",
            "parent_id": "t1_em4mrbk",
            "score": 1,
            "created_utc": 1556634648.0,
            "replies": []
        },
        {
            "body": "But if he’s looking for a life partner, then best to find someone independent and able to take care of herself. I don’t want to come off as cheap, but if both the parties are in similar income group, no need for the man to pick up the tab all the time.",
            "author": "supportiveceo",
            "id": "em4zudg",
            "parent_id": "t1_em4mrbk",
            "score": 0,
            "created_utc": 1556633093.0,
            "replies": []
        },
        {
            "body": "In the short answer is  equality,women’s Lib women being assertive The 21st-century and more equality between the genders. I’m not sure we can have it both ways to be fair to both genders. I suppose it’s possible and each individual relationship to decide. That would certainly require a lot of flexibility from both people but there are some that I think could pull it off.",
            "author": "puckhead4",
            "id": "em4sakm",
            "parent_id": "t1_em4mrbk",
            "score": -2,
            "created_utc": 1556627135.0,
            "replies": []
        },
        {
            "body": "My SDs do. I only date people who treat me well, whether sugar or vanilla.",
            "author": "sweetk412",
            "id": "em538hk",
            "parent_id": "t1_em4zwty",
            "score": 5,
            "created_utc": 1556635406.0,
            "replies": []
        },
        {
            "body": "Haha maybe I'm just becoming dangerously charismatic. This is an upside of sugaring, I find myself much more confident making conversation. However, also want to make sure I can still be authentic.",
            "author": null,
            "id": "em4zhdi",
            "parent_id": "t1_em4ycx6",
            "score": 4,
            "created_utc": 1556632833.0,
            "replies": [
                {
                    "body": "Great that there are benefits other than financial/materialistic for one side and physical/biological for the other I think! Sincere congrats on a growing level of confidence.",
                    "author": "puckhead4",
                    "id": "em57bal",
                    "parent_id": "t1_em4zhdi",
                    "score": 0,
                    "created_utc": 1556638061.0,
                    "replies": [
                        {
                            "body": "I think I offer more than physical / biological!",
                            "author": null,
                            "id": "em57fmp",
                            "parent_id": "t1_em57bal",
                            "score": 2,
                            "created_utc": 1556638138.0,
                            "replies": [
                                {
                                    "body": "You probably do, I in no way meant to imply that you don't and if my script/ choice of words lead you to that conclusion I sincerely apologize.",
                                    "author": "puckhead4",
                                    "id": "em59nor",
                                    "parent_id": "t1_em57fmp",
                                    "score": 2,
                                    "created_utc": 1556639571.0,
                                    "replies": [
                                        {
                                            "body": "Haha it's OK!",
                                            "author": null,
                                            "id": "em59pwz",
                                            "parent_id": "t1_em59nor",
                                            "score": 2,
                                            "created_utc": 1556639613.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Kind of agree DG I have hiring authority but I am very traditional I would never have a job interview of any type in anything but a professional environment with professional demeanor. What’s that old saying sanitized. Don’t defecate where you dine.",
            "author": "puckhead4",
            "id": "em4sixh",
            "parent_id": "t1_em4mg9r",
            "score": 4,
            "created_utc": 1556627343.0,
            "replies": [
                {
                    "body": "Ahhh, stories from the battleground. I’ve tried it in vanilla and it was a fecal storm. I don’t even want to know how horrid it could be in sugar. I’ll be using that last line instead of usual crass vocabulary.",
                    "author": null,
                    "id": "em4z75r",
                    "parent_id": "t1_em4sixh",
                    "score": 2,
                    "created_utc": 1556632639.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t know when this became true. But I went on a vanilla “date”...I don’t know if I can even call it that this weekend. He picked the restaurant. We start of with appetizers and I’m looking at the entrees ($25-30) and decide what I want. Waiter comes back and this guy looks at me and says, “Oh you weren’t really hungry right?” \n\nWhy invite someone to a dinner date to a restaurant you can’t afford? \n\nI was incredulous and hungry. I couldn’t get with the program and left 20 mins after. I got Shake Shack.",
            "author": null,
            "id": "em4yohf",
            "parent_id": "t1_em4nszw",
            "score": 11,
            "created_utc": 1556632273.0,
            "replies": []
        },
        {
            "body": "No SB EVER does this. She must be looking for a trophy wife position.",
            "author": "GSSD",
            "id": "em4zz3l",
            "parent_id": "t1_em4o07t",
            "score": 12,
            "created_utc": 1556633185.0,
            "replies": [
                {
                    "body": "100%.   Though it is appropriate for a SB to at least occasionally make a show of picking up the tab.  Same dynamic as a son-in-law trying to pay his father-in-law’s tab.",
                    "author": "FlexEconGuy",
                    "id": "em52snl",
                    "parent_id": "t1_em4zz3l",
                    "score": 3,
                    "created_utc": 1556635109.0,
                    "replies": [
                        {
                            "body": "Who does that? Lol",
                            "author": "GSSD",
                            "id": "em534xu",
                            "parent_id": "t1_em52snl",
                            "score": 4,
                            "created_utc": 1556635341.0,
                            "replies": [
                                {
                                    "body": "Again, it’s messaging.  This girl used to work so far underneath me, I was not aware we had ever worked at the same company in the past until she mentioned it at lunch; Despite always having a curiosity when we bumped into each other at industry functions.  \n\nShe wanting to prove a point that she is not sugar.",
                                    "author": "FlexEconGuy",
                                    "id": "em549rz",
                                    "parent_id": "t1_em534xu",
                                    "score": 4,
                                    "created_utc": 1556636078.0,
                                    "replies": []
                                },
                                {
                                    "body": "Me until my marriage started falling apart.  It was nefarious messaging “I don’t need your money.”   Dick measuring, if you will.  \n\nAlas, when the union began to crumble, I dropped any thoughts of reaching for my wallet at dinner.",
                                    "author": "FlexEconGuy",
                                    "id": "em53tec",
                                    "parent_id": "t1_em534xu",
                                    "score": 2,
                                    "created_utc": 1556635787.0,
                                    "replies": []
                                },
                                {
                                    "body": "My first SB insisted on paying for my dinner every-other-date for a while. Finally I insisted it was getting ridiculous: she was 21 and making $10.50/hr.  She just didn't want to make me feel like she was \"using\" me.",
                                    "author": "ziffert",
                                    "id": "em5k0tp",
                                    "parent_id": "t1_em534xu",
                                    "score": 1,
                                    "created_utc": 1556645784.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "having raised a son and seen, in person, him leave the house without his wallet on many occasions I can sympathize.\n\nafter a certain age, it stops being a cute quirky trait and becomes plain ole irresponsibility",
            "author": "joc13",
            "id": "em5si8y",
            "parent_id": "t1_em58xs6",
            "score": 4,
            "created_utc": 1556650963.0,
            "replies": []
        },
        {
            "body": "Great that there are benefits other than financial/materialistic for one side and physical/biological for the other I think! Sincere congrats on a growing level of confidence.",
            "author": "puckhead4",
            "id": "em57bal",
            "parent_id": "t1_em4zhdi",
            "score": 0,
            "created_utc": 1556638061.0,
            "replies": [
                {
                    "body": "I think I offer more than physical / biological!",
                    "author": null,
                    "id": "em57fmp",
                    "parent_id": "t1_em57bal",
                    "score": 2,
                    "created_utc": 1556638138.0,
                    "replies": [
                        {
                            "body": "You probably do, I in no way meant to imply that you don't and if my script/ choice of words lead you to that conclusion I sincerely apologize.",
                            "author": "puckhead4",
                            "id": "em59nor",
                            "parent_id": "t1_em57fmp",
                            "score": 2,
                            "created_utc": 1556639571.0,
                            "replies": [
                                {
                                    "body": "Haha it's OK!",
                                    "author": null,
                                    "id": "em59pwz",
                                    "parent_id": "t1_em59nor",
                                    "score": 2,
                                    "created_utc": 1556639613.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ahhh, stories from the battleground. I’ve tried it in vanilla and it was a fecal storm. I don’t even want to know how horrid it could be in sugar. I’ll be using that last line instead of usual crass vocabulary.",
            "author": null,
            "id": "em4z75r",
            "parent_id": "t1_em4sixh",
            "score": 2,
            "created_utc": 1556632639.0,
            "replies": []
        },
        {
            "body": "100%.   Though it is appropriate for a SB to at least occasionally make a show of picking up the tab.  Same dynamic as a son-in-law trying to pay his father-in-law’s tab.",
            "author": "FlexEconGuy",
            "id": "em52snl",
            "parent_id": "t1_em4zz3l",
            "score": 3,
            "created_utc": 1556635109.0,
            "replies": [
                {
                    "body": "Who does that? Lol",
                    "author": "GSSD",
                    "id": "em534xu",
                    "parent_id": "t1_em52snl",
                    "score": 4,
                    "created_utc": 1556635341.0,
                    "replies": [
                        {
                            "body": "Again, it’s messaging.  This girl used to work so far underneath me, I was not aware we had ever worked at the same company in the past until she mentioned it at lunch; Despite always having a curiosity when we bumped into each other at industry functions.  \n\nShe wanting to prove a point that she is not sugar.",
                            "author": "FlexEconGuy",
                            "id": "em549rz",
                            "parent_id": "t1_em534xu",
                            "score": 4,
                            "created_utc": 1556636078.0,
                            "replies": []
                        },
                        {
                            "body": "Me until my marriage started falling apart.  It was nefarious messaging “I don’t need your money.”   Dick measuring, if you will.  \n\nAlas, when the union began to crumble, I dropped any thoughts of reaching for my wallet at dinner.",
                            "author": "FlexEconGuy",
                            "id": "em53tec",
                            "parent_id": "t1_em534xu",
                            "score": 2,
                            "created_utc": 1556635787.0,
                            "replies": []
                        },
                        {
                            "body": "My first SB insisted on paying for my dinner every-other-date for a while. Finally I insisted it was getting ridiculous: she was 21 and making $10.50/hr.  She just didn't want to make me feel like she was \"using\" me.",
                            "author": "ziffert",
                            "id": "em5k0tp",
                            "parent_id": "t1_em534xu",
                            "score": 1,
                            "created_utc": 1556645784.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think I offer more than physical / biological!",
            "author": null,
            "id": "em57fmp",
            "parent_id": "t1_em57bal",
            "score": 2,
            "created_utc": 1556638138.0,
            "replies": [
                {
                    "body": "You probably do, I in no way meant to imply that you don't and if my script/ choice of words lead you to that conclusion I sincerely apologize.",
                    "author": "puckhead4",
                    "id": "em59nor",
                    "parent_id": "t1_em57fmp",
                    "score": 2,
                    "created_utc": 1556639571.0,
                    "replies": [
                        {
                            "body": "Haha it's OK!",
                            "author": null,
                            "id": "em59pwz",
                            "parent_id": "t1_em59nor",
                            "score": 2,
                            "created_utc": 1556639613.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Who does that? Lol",
            "author": "GSSD",
            "id": "em534xu",
            "parent_id": "t1_em52snl",
            "score": 4,
            "created_utc": 1556635341.0,
            "replies": [
                {
                    "body": "Again, it’s messaging.  This girl used to work so far underneath me, I was not aware we had ever worked at the same company in the past until she mentioned it at lunch; Despite always having a curiosity when we bumped into each other at industry functions.  \n\nShe wanting to prove a point that she is not sugar.",
                    "author": "FlexEconGuy",
                    "id": "em549rz",
                    "parent_id": "t1_em534xu",
                    "score": 4,
                    "created_utc": 1556636078.0,
                    "replies": []
                },
                {
                    "body": "Me until my marriage started falling apart.  It was nefarious messaging “I don’t need your money.”   Dick measuring, if you will.  \n\nAlas, when the union began to crumble, I dropped any thoughts of reaching for my wallet at dinner.",
                    "author": "FlexEconGuy",
                    "id": "em53tec",
                    "parent_id": "t1_em534xu",
                    "score": 2,
                    "created_utc": 1556635787.0,
                    "replies": []
                },
                {
                    "body": "My first SB insisted on paying for my dinner every-other-date for a while. Finally I insisted it was getting ridiculous: she was 21 and making $10.50/hr.  She just didn't want to make me feel like she was \"using\" me.",
                    "author": "ziffert",
                    "id": "em5k0tp",
                    "parent_id": "t1_em534xu",
                    "score": 1,
                    "created_utc": 1556645784.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You probably do, I in no way meant to imply that you don't and if my script/ choice of words lead you to that conclusion I sincerely apologize.",
            "author": "puckhead4",
            "id": "em59nor",
            "parent_id": "t1_em57fmp",
            "score": 2,
            "created_utc": 1556639571.0,
            "replies": [
                {
                    "body": "Haha it's OK!",
                    "author": null,
                    "id": "em59pwz",
                    "parent_id": "t1_em59nor",
                    "score": 2,
                    "created_utc": 1556639613.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Again, it’s messaging.  This girl used to work so far underneath me, I was not aware we had ever worked at the same company in the past until she mentioned it at lunch; Despite always having a curiosity when we bumped into each other at industry functions.  \n\nShe wanting to prove a point that she is not sugar.",
            "author": "FlexEconGuy",
            "id": "em549rz",
            "parent_id": "t1_em534xu",
            "score": 4,
            "created_utc": 1556636078.0,
            "replies": []
        },
        {
            "body": "Me until my marriage started falling apart.  It was nefarious messaging “I don’t need your money.”   Dick measuring, if you will.  \n\nAlas, when the union began to crumble, I dropped any thoughts of reaching for my wallet at dinner.",
            "author": "FlexEconGuy",
            "id": "em53tec",
            "parent_id": "t1_em534xu",
            "score": 2,
            "created_utc": 1556635787.0,
            "replies": []
        },
        {
            "body": "My first SB insisted on paying for my dinner every-other-date for a while. Finally I insisted it was getting ridiculous: she was 21 and making $10.50/hr.  She just didn't want to make me feel like she was \"using\" me.",
            "author": "ziffert",
            "id": "em5k0tp",
            "parent_id": "t1_em534xu",
            "score": 1,
            "created_utc": 1556645784.0,
            "replies": []
        },
        {
            "body": "Haha it's OK!",
            "author": null,
            "id": "em59pwz",
            "parent_id": "t1_em59nor",
            "score": 2,
            "created_utc": 1556639613.0,
            "replies": []
        }
    ]
}