{
    "title": "Koreans Vote On Stars They Most Want To Meet On Christmas. Yoo Jae Suk took first place overall, with Gong Yoo in second, IU in third, Im Young Woong in fourth, and BTS in fifth.",
    "post_id": "kd98tc",
    "post_url": "https://www.reddit.com/r/runningman/comments/kd98tc/koreans_vote_on_stars_they_most_want_to_meet_on/",
    "author": "-vj",
    "body": "",
    "url": "https://www.soompi.com/article/1443512wpp/koreans-vote-on-stars-they-most-want-to-meet-on-christmas",
    "score": 216,
    "upvote_ratio": 1.0,
    "created_utc": 1607988082.0,
    "num_comments": 2,
    "links": [
        []
    ],
    "comments": [
        {
            "body": ">  \n>  \n>A survey shows which stars people would like to meet as a Christmas present!  \n>  \n>The ratings survey company TNMS asked viewers over the age of 20 to share which celebrity they’d like to meet as a surprise Christmas gift. The mobile survey took place over two days starting on December 10, with the respondents being viewers who were taking part in TNMS’s ratings survey. 580 people in each age group were asked (2,900 people overall), and 766 people responded to the short-answer question.  \n>  \n>Yoo Jae Suk took first place overall, with Gong Yoo in second, IU in third, Im Young Woong in fourth, and BTS in fifth.  \n>  \n>There were also different first place winners for each age range. People in their 20s voted Kim Seon Ho and IU into a tie for first place. IU was the most popular answer among people in their 30s, Gong Yoo among people in their 40s, Im Young Woong among people in their 50s, and Na Hoon Ah among people over 60.",
            "author": "-vj",
            "id": "gfv43lb",
            "parent_id": "t3_kd98tc",
            "score": 21,
            "created_utc": 1607988112.0,
            "replies": []
        },
        {
            "body": "Yoo Jae Suk 😍\n\nIU 😍😍😍😍😍😍\n\nOn a more serious note, Yoo Jae Suk’s programs got me through a really rough time in my life when I was suicidal. \n\nA decade later, I’m living a great life and in an amazing relationship. I still fondly remember my darker days when Running Man, Family Outing, and Infinity Challenge gave me enough laughs to get through",
            "author": "TimothyOhdin",
            "id": "gfxjvgw",
            "parent_id": "t3_kd98tc",
            "score": 12,
            "created_utc": 1608048217.0,
            "replies": []
        }
    ]
}