{
    "title": "Meeting the man of my dreams after losing my ‘high flying’ job in the midst of the pandemic!",
    "post_id": "m9oxej",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/m9oxej/meeting_the_man_of_my_dreams_after_losing_my_high/",
    "author": "evethedelicate",
    "body": "Hi everyone! This is my first post ever on here. I’ve been reading many of the stories that have been shared here and I want to share mine, as it’s not something I get a chance to be open about so often in my personal life. \n\nI will be turning 22 this year. Straight after high school at the age of 18, I worked as a flight attendant for an international airline. During such time I was in a rather intense relationship with my ex-boyfriend who was much older than me. We broke up after 2 years just before I lost my job as a result of retrenchment. I had 3 months left to my work permit to decide whether I’d move back to my home country, or find a different job here where I was based. \n\nI had set myself on finding a job here. I became active once again on SA after I made an account out of curiosity when I was 18, but never made use of. I met a couple guys from SA who I was seeing for a couple months each. The arrangement normally being a PPM after sharing some company. But there was no chemistry other than purely sexual. It felt empty, almost jarring at times. Then one day I came across my current SD.\n\nHe was straightforward with what he wanted. Meeting twice a week, at this gorgeous hotel in the city centre. A very substantial allowance given every week, no further discussion required between us after our initial online chat. He is this amazingly sweet, kind and soft spoken man. Who treated me with utmost respect ever since the very beginning. We could both tell how much we adored each other and felt something was way different, as we cuddled and laughed in bed. Endless kisses and bliss. He loved the same novels and films I did and we could discuss about absolutely rubbish for hours! I felt spoilt silly as I could even mumble about something I liked, and the next time we meet he’d have exactly that as a gift for me. \n\nIt was about a month into our blossoming relationship. As I was lying in his arms, gently peppering his face with kisses. I was talking about my housemates (one of which was craaaazy!), to which he asked “Do you enjoy staying there?”. I replied “If I had a choice, I’d honestly love to live alone.” Then he said “Well why didn’t you mention it sooner? Let’s look for a nice apartment for you!”. Fast forward a few months until today, I have been living in a beautiful studio apartment in the city centre right in the business district. I wake up every day wondering if this is real.\n\nAfter settling into my new job and months of discussion, we have decided on myself pursuing a degree which is sponsored entirely. I am extremely excited to go on this new path in my life, totally different and so much more promising than what I had initially pictured. And it is all thanks to him. He coaches me and encourages me to be the best version of myself by getting an education and increasing my opportunities in life. I never expected him to make me feel so appreciated and loved, and above all believed in my inner potential. \n\nThanks for listening to my story. I wish you all a happy weekend wherever you are!",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/m9oxej/meeting_the_man_of_my_dreams_after_losing_my_high/",
    "score": 128,
    "upvote_ratio": 0.96,
    "created_utc": 1616302921.0,
    "num_comments": 37,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "This is so cute! 🥺",
            "author": "curly_spice",
            "id": "gro79kv",
            "parent_id": "t3_m9oxej",
            "score": 17,
            "created_utc": 1616303257.0,
            "replies": [
                {
                    "body": "Making sugar an investment rather than an expense.",
                    "author": "pinotandsugar",
                    "id": "gro891m",
                    "parent_id": "t1_gro79kv",
                    "score": 13,
                    "created_utc": 1616303971.0,
                    "replies": [
                        {
                            "body": "When she leaves him and moves on to a new dude she finds in college, is it still an investment or an expense :)?",
                            "author": "Weezyf7",
                            "id": "groxgwc",
                            "parent_id": "t1_gro891m",
                            "score": 0,
                            "created_utc": 1616327174.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "grofbtk",
            "parent_id": "t3_m9oxej",
            "score": 10,
            "created_utc": 1616309766.0,
            "replies": [
                {
                    "body": "Thank you for that!",
                    "author": "evethedelicate",
                    "id": "grpjicp",
                    "parent_id": "t1_grofbtk",
                    "score": 1,
                    "created_utc": 1616340819.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gro7bqr",
            "parent_id": "t3_m9oxej",
            "score": 20,
            "created_utc": 1616303300.0,
            "replies": [
                {
                    "body": "Yeah, there are a lot of details here that don't sound right. \n\n\"Flight attendant for an international airline\". So if she is not in her home country (she needed to decide if she was going back home when her work permit expires in 3 months) that's not in the U.S. She needs a Green Card to work for a US based airline, and if she were just flying here with an international airline, she would not be on a work permit. She says \"find a different job where I was based\", so if it was a foreign base for a non-domestic airline she wouldn't have a non-job specific work permit in most countries I can think of, so it doesn't make much sense. \n\nIf not the US, I am still not sure where she'd get a work permit as a foreign 18 year old HS graduate that allows her to switch jobs at will after getting laid off by her airline. For instance, foreigners working for Emirates and residing in Dubai- pilots too, not just flight attendants, had to leave the UAE after they got laid off. \n\nSo she only has 3 months left in this magical work permit that isn't tied to her job at an international airline as a flight attendant, she spends several months with other SDs before Mr. Wonderful turns up, and in that time she's found a job that lets her stay in that country as a 21 year old who didn't go to uni (since we're now believing that the work permit exists) moved in with flatmates etc. All in a big city (which isn't cheap even if it's in Asia) since international airlines don't fly into small towns. \n\nDoesn't really pass the sniff test with me either. But maybe in the People's Republic of Fantasia all of these things are commonplace.",
                    "author": "SLF921019",
                    "id": "grohz91",
                    "parent_id": "t1_gro7bqr",
                    "score": 10,
                    "created_utc": 1616312207.0,
                    "replies": [
                        {
                            "body": "Hi there! I must say I was quite amused reading this knowing I am as real as can be haha.\n\nTo explain it a little further, (not that I feel I need to, but out of curiosity some might have) I was a stewardess specifically under a Singaporean based international airlines. The minimum joining age is 18 (as well as in most if not all Asian airlines apart from Emirates/Qatar Airways). Secondly, Singapore allows for several different types of work passes. For someone with a degree/higher education it would normally be an EP (employment pass) etc. For myself it’s a WP (work permit) which is work pass generally given to those who apply without degrees/higher education like myself who are to work in the service/labour industry. And Singaporean laws are such that I could and was in fact encouraged by my former company to seek a different job and remain in Singapore. This is so the airline would more easily be able to rehire foreign crew once all the travel restrictions are gone and kick off again!\n\nI hope that can clear up some things. 😊",
                            "author": "evethedelicate",
                            "id": "groj18b",
                            "parent_id": "t1_grohz91",
                            "score": 19,
                            "created_utc": 1616313232.0,
                            "replies": [
                                {
                                    "body": "LOL\n\nThis Post rang true to me for sure & good for you...\n\nWhat you failed to mention (out of modesty), which I’m 99% sure is the case, is that you are drop dead gorgeous, smart  and have a genuine thing for much older, established men. \n\n18-25 year olds like you are extremely rare in life and even rarer on SA.  Most relationships like yours happen in real life..not online.",
                                    "author": "BGDDDY1",
                                    "id": "growoz9",
                                    "parent_id": "t1_groj18b",
                                    "score": 7,
                                    "created_utc": 1616326531.0,
                                    "replies": []
                                },
                                {
                                    "body": "Glad to amuse you on a Sunday evening. Well if you are genuine,  then good for you. I have several friends who married SIA cabin crew.\n\nI have family and friends in high places in Singapore and have flown with SIA often for 4 decades and even partied with some SIA cabin crew back in my younger days. I know they hire from Malaysia, Indonesia, China, Taiwan, Thailand etc., and that you can be hired at 18 if you're tall (and attractive) enough. I know they had a major retrenchment last Fall, and that as part of the early departure program they were releasing laid off cabin crew from bond/loan obligations, but I was unaware that the government and SIA management were allowing you to stay in the Republic. \n\nIsn't a work pass for a max of 2 years though?\n\nGoing to school is a great idea for your future. And if your story is true, I apologize for doubting you and wish you all the best. There are a lot of people who tell tall tales- and not just on the internet! I once met a young lady who boasted about her whale boyfriend,  and how she flew on his Gulfstream all the time when my mate told her I had a Gulfstream. I said, \"Well then surely you can tell me what a FBO is?\", to which she replied, \"Of course I know! You think I'm making all this up?! FBO is Food and Beverage Operator!\" *Bzzzzzzzzzz* Sorry, wrong answer! Thank you for playing.",
                                    "author": "SLF921019",
                                    "id": "grom2m3",
                                    "parent_id": "t1_groj18b",
                                    "score": 1,
                                    "created_utc": 1616316216.0,
                                    "replies": [
                                        {
                                            "body": "Thank you! Lovely to hear that. I enjoyed my career while I was there for sure, all the amazing destinations! All of which I would have never travelled to having not been in the company. And what you’ve heard about the retrenchment is accurate too. It was in August! Although for the entirety of 6 months before that happened I did only 2 FLIGHTS as at some point we were barely operating at 2% which is mad considering the volume of flights prior to COVID. It was a lot of uncertainty but we felt it was coming soon anyway. However! Shit happens as they say. And I hope to have an entirely different path lined up. \n\nAnd yes the work permits do last for two years! As I was retrenched, the validity was cut short to 3 months after I received my notice.\n\nThanks for that last story though! I had a little giggle by myself at work. I figured at least know your shit if you’re gonna tell a hell of a story like that. Haha. Have a great evening ahead! I hope you’re having a relaxing one. Xo",
                                            "author": "evethedelicate",
                                            "id": "growqi9",
                                            "parent_id": "t1_grom2m3",
                                            "score": 5,
                                            "created_utc": 1616326567.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Beep. Boop. I'm a robot.\nHere's a copy of \n\n###[The Republic](https://snewd.com/ebooks/the-republic/)\n\nWas I a good bot? | [info](https://www.reddit.com/user/Reddit-Book-Bot/) | [More Books](https://old.reddit.com/user/Reddit-Book-Bot/comments/i15x1d/full_list_of_books_and_commands/)",
                                            "author": "Reddit-Book-Bot",
                                            "id": "grom32b",
                                            "parent_id": "t1_grom2m3",
                                            "score": 0,
                                            "created_utc": 1616316228.0,
                                            "replies": [
                                                {
                                                    "body": " bad bot",
                                                    "author": null,
                                                    "id": "gros59c",
                                                    "parent_id": "t1_grom32b",
                                                    "score": 1,
                                                    "created_utc": 1616322336.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good luck girl, so happy for you",
            "author": "Tomboysisi",
            "id": "grohvhm",
            "parent_id": "t3_m9oxej",
            "score": 5,
            "created_utc": 1616312107.0,
            "replies": [
                {
                    "body": "Thank you!’",
                    "author": "evethedelicate",
                    "id": "grpk3h3",
                    "parent_id": "t1_grohvhm",
                    "score": 4,
                    "created_utc": 1616341098.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow. This is amazing. I hope there are more SD like this out there!",
            "author": "ozmafox",
            "id": "groqh05",
            "parent_id": "t3_m9oxej",
            "score": 3,
            "created_utc": 1616320657.0,
            "replies": [
                {
                    "body": "I hope so too! I love this more traditional side to some men, who seek to help and provide for the women they love and adore.",
                    "author": "evethedelicate",
                    "id": "grpk7vm",
                    "parent_id": "t1_groqh05",
                    "score": 3,
                    "created_utc": 1616341162.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This melts me!🖤",
            "author": null,
            "id": "grq4e5j",
            "parent_id": "t3_m9oxej",
            "score": 3,
            "created_utc": 1616350764.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "grq6339",
            "parent_id": "t3_m9oxej",
            "score": 3,
            "created_utc": 1616351591.0,
            "replies": [
                {
                    "body": "Thank you for your concern! Not being a spoilsport at all, just being realistic as I am too. Frugal mindset is key as nothing is forever! Do take care babe, have a safe flight. 😘",
                    "author": "evethedelicate",
                    "id": "grsib1o",
                    "parent_id": "t1_grq6339",
                    "score": 2,
                    "created_utc": 1616402364.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "groh2rc",
            "parent_id": "t3_m9oxej",
            "score": 2,
            "created_utc": 1616311358.0,
            "replies": [
                {
                    "body": "Thank you! I am a lucky girl. And hope other girls can be just as lucky",
                    "author": "evethedelicate",
                    "id": "grpk2w6",
                    "parent_id": "t1_groh2rc",
                    "score": 4,
                    "created_utc": 1616341090.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How did you get the visa to stay in country you in?",
            "author": "steelmanfallacy",
            "id": "grp12hv",
            "parent_id": "t3_m9oxej",
            "score": 2,
            "created_utc": 1616329938.0,
            "replies": [
                {
                    "body": "By landing a new job and swapping over my work pass to be registered under a new employer. 😊",
                    "author": "evethedelicate",
                    "id": "grp4j20",
                    "parent_id": "t1_grp12hv",
                    "score": 5,
                    "created_utc": 1616332299.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol at all the salty replies claiming this is fake.  It might be, it might not be, but there are some underlying motives for this disbelief:\n\nSaying that you genuinely like and appreciate your SD sets off a nerve for camp \"that's impossible\"\n\nSaying your SD spoils you well above and beyond typical ppm/allowance touches a nerve for \"average\" SDs that don't have the means to do something like that.\n\nAs for me, all I have to say is: good for you, enjoy the ride while it lasts.",
            "author": "Gemini-Fox",
            "id": "grqs8wc",
            "parent_id": "t3_m9oxej",
            "score": 2,
            "created_utc": 1616362698.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "grtkb7l",
            "parent_id": "t3_m9oxej",
            "score": 2,
            "created_utc": 1616427156.0,
            "replies": [
                {
                    "body": "Girl are you an FSS? Gotta tell me your story too in the dms! Maybe we can link up one day haha",
                    "author": "evethedelicate",
                    "id": "grw808c",
                    "parent_id": "t1_grtkb7l",
                    "score": 1,
                    "created_utc": 1616473644.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hahaha you two sound adorable.  I'm happy for you to have found such a nice SD that takes care of you without batting an eye.  Good Luck on furthering your education 🤓",
            "author": "KittenReigns",
            "id": "gro8nff",
            "parent_id": "t3_m9oxej",
            "score": 3,
            "created_utc": 1616304263.0,
            "replies": [
                {
                    "body": "Thank you so much babe! I’m super grateful every day. Let’s hope I can get through it! Haha",
                    "author": "evethedelicate",
                    "id": "grpkhoj",
                    "parent_id": "t1_gro8nff",
                    "score": 5,
                    "created_utc": 1616341302.0,
                    "replies": [
                        {
                            "body": "You'll do fine I'm sure never underestimate good note taking.  🤓",
                            "author": "KittenReigns",
                            "id": "grprhq4",
                            "parent_id": "t1_grpkhoj",
                            "score": 4,
                            "created_utc": 1616344666.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow, I don't believe for a moment that this is a genuine post.  This is ghost written by a professional writer.  This is NOT written by a 22 yo sugar baby, I guarantee it.  Posts like these make me question the entire authenticity of this reddit group.  I've been in the sugar bowl for well over 10 years.  I am VERY well educated and accomplished.  I am CERTAIN that not one real sugar baby in 1000 could have written this post.  Come clean reddit.  Really.  This is ridiculous.",
            "author": "ptetteroo",
            "id": "grof01d",
            "parent_id": "t3_m9oxej",
            "score": -1,
            "created_utc": 1616309466.0,
            "replies": [
                {
                    "body": "I must say this is extremely flattering and must mean that I can write really well for someone with only a high school diploma and barely has the attention span to read more than 4 pages of a book at a time. 🤣",
                    "author": "evethedelicate",
                    "id": "grpir5m",
                    "parent_id": "t1_grof01d",
                    "score": 8,
                    "created_utc": 1616340448.0,
                    "replies": []
                },
                {
                    "body": "Bro... seriously? You sound like a peach\n\nI am also “VERY well educated and accomplished” but I generally don’t feel the need to point that out to other people. \n\nMy SGF, who I met on SA and who actually introduced me to this sub, graduated early with a degree in molecular biology and is in the process of submitting her grad school applications.  She is smart, and ambitious and probably writes better than me. \n\nThis just comes off as insecure. Congrats on all your success tho 🤡",
                    "author": "rw1970x",
                    "id": "grqpmic",
                    "parent_id": "t1_grof01d",
                    "score": 4,
                    "created_utc": 1616361375.0,
                    "replies": []
                },
                {
                    "body": "A professional writer? Seriously??! 🤣🤣",
                    "author": "Ghanaiantoffee",
                    "id": "grqgka1",
                    "parent_id": "t1_grof01d",
                    "score": 3,
                    "created_utc": 1616356831.0,
                    "replies": []
                },
                {
                    "body": "Hmm I don't know about your experience with SBs but there are quite a few of us that are also on the road to well educated and accomplished. The only difference between you and I is that you're older and have completed your schooling, while SB's are in the process of receiving mentoring, applying to graduate schools, etc. I don't see why it's so hard to believe that a sugar baby can write a grammatically correct and well-flowing post on Reddit. 🤦‍♀️",
                    "author": "galactosegirl",
                    "id": "grqgwle",
                    "parent_id": "t1_grof01d",
                    "score": 3,
                    "created_utc": 1616357004.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like you landed an amazing guy.\n\nFlight stewardesses are hot.  Need to check that off my bucket list.",
            "author": "wb19081908",
            "id": "grob6dm",
            "parent_id": "t3_m9oxej",
            "score": -2,
            "created_utc": 1616306220.0,
            "replies": [
                {
                    "body": "Whatever you do, do not hit on them when you are inflight. \n\nThis is from my past experience.\n\n😝",
                    "author": "eurosd",
                    "id": "grohamq",
                    "parent_id": "t1_grob6dm",
                    "score": 3,
                    "created_utc": 1616311567.0,
                    "replies": [
                        {
                            "body": "Im always a coward.  Had a few flirting hard.  But I hate talking to girls with loads of civilians around.",
                            "author": "wb19081908",
                            "id": "grohuhz",
                            "parent_id": "t1_grohamq",
                            "score": 0,
                            "created_utc": 1616312080.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Go get it!! I’ve heard some naughty stories from my colleagues with passengers 😌",
                    "author": "evethedelicate",
                    "id": "grpkcu0",
                    "parent_id": "t1_grob6dm",
                    "score": 1,
                    "created_utc": 1616341234.0,
                    "replies": [
                        {
                            "body": "🙈🙉😻",
                            "author": "wb19081908",
                            "id": "grpkkcz",
                            "parent_id": "t1_grpkcu0",
                            "score": 1,
                            "created_utc": 1616341338.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "grpu6my",
            "parent_id": "t3_m9oxej",
            "score": 1,
            "created_utc": 1616345922.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "grpu6nz",
                    "parent_id": "t1_grpu6my",
                    "score": 1,
                    "created_utc": 1616345922.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Making sugar an investment rather than an expense.",
            "author": "pinotandsugar",
            "id": "gro891m",
            "parent_id": "t1_gro79kv",
            "score": 13,
            "created_utc": 1616303971.0,
            "replies": [
                {
                    "body": "When she leaves him and moves on to a new dude she finds in college, is it still an investment or an expense :)?",
                    "author": "Weezyf7",
                    "id": "groxgwc",
                    "parent_id": "t1_gro891m",
                    "score": 0,
                    "created_utc": 1616327174.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for that!",
            "author": "evethedelicate",
            "id": "grpjicp",
            "parent_id": "t1_grofbtk",
            "score": 1,
            "created_utc": 1616340819.0,
            "replies": []
        },
        {
            "body": "Yeah, there are a lot of details here that don't sound right. \n\n\"Flight attendant for an international airline\". So if she is not in her home country (she needed to decide if she was going back home when her work permit expires in 3 months) that's not in the U.S. She needs a Green Card to work for a US based airline, and if she were just flying here with an international airline, she would not be on a work permit. She says \"find a different job where I was based\", so if it was a foreign base for a non-domestic airline she wouldn't have a non-job specific work permit in most countries I can think of, so it doesn't make much sense. \n\nIf not the US, I am still not sure where she'd get a work permit as a foreign 18 year old HS graduate that allows her to switch jobs at will after getting laid off by her airline. For instance, foreigners working for Emirates and residing in Dubai- pilots too, not just flight attendants, had to leave the UAE after they got laid off. \n\nSo she only has 3 months left in this magical work permit that isn't tied to her job at an international airline as a flight attendant, she spends several months with other SDs before Mr. Wonderful turns up, and in that time she's found a job that lets her stay in that country as a 21 year old who didn't go to uni (since we're now believing that the work permit exists) moved in with flatmates etc. All in a big city (which isn't cheap even if it's in Asia) since international airlines don't fly into small towns. \n\nDoesn't really pass the sniff test with me either. But maybe in the People's Republic of Fantasia all of these things are commonplace.",
            "author": "SLF921019",
            "id": "grohz91",
            "parent_id": "t1_gro7bqr",
            "score": 10,
            "created_utc": 1616312207.0,
            "replies": [
                {
                    "body": "Hi there! I must say I was quite amused reading this knowing I am as real as can be haha.\n\nTo explain it a little further, (not that I feel I need to, but out of curiosity some might have) I was a stewardess specifically under a Singaporean based international airlines. The minimum joining age is 18 (as well as in most if not all Asian airlines apart from Emirates/Qatar Airways). Secondly, Singapore allows for several different types of work passes. For someone with a degree/higher education it would normally be an EP (employment pass) etc. For myself it’s a WP (work permit) which is work pass generally given to those who apply without degrees/higher education like myself who are to work in the service/labour industry. And Singaporean laws are such that I could and was in fact encouraged by my former company to seek a different job and remain in Singapore. This is so the airline would more easily be able to rehire foreign crew once all the travel restrictions are gone and kick off again!\n\nI hope that can clear up some things. 😊",
                    "author": "evethedelicate",
                    "id": "groj18b",
                    "parent_id": "t1_grohz91",
                    "score": 19,
                    "created_utc": 1616313232.0,
                    "replies": [
                        {
                            "body": "LOL\n\nThis Post rang true to me for sure & good for you...\n\nWhat you failed to mention (out of modesty), which I’m 99% sure is the case, is that you are drop dead gorgeous, smart  and have a genuine thing for much older, established men. \n\n18-25 year olds like you are extremely rare in life and even rarer on SA.  Most relationships like yours happen in real life..not online.",
                            "author": "BGDDDY1",
                            "id": "growoz9",
                            "parent_id": "t1_groj18b",
                            "score": 7,
                            "created_utc": 1616326531.0,
                            "replies": []
                        },
                        {
                            "body": "Glad to amuse you on a Sunday evening. Well if you are genuine,  then good for you. I have several friends who married SIA cabin crew.\n\nI have family and friends in high places in Singapore and have flown with SIA often for 4 decades and even partied with some SIA cabin crew back in my younger days. I know they hire from Malaysia, Indonesia, China, Taiwan, Thailand etc., and that you can be hired at 18 if you're tall (and attractive) enough. I know they had a major retrenchment last Fall, and that as part of the early departure program they were releasing laid off cabin crew from bond/loan obligations, but I was unaware that the government and SIA management were allowing you to stay in the Republic. \n\nIsn't a work pass for a max of 2 years though?\n\nGoing to school is a great idea for your future. And if your story is true, I apologize for doubting you and wish you all the best. There are a lot of people who tell tall tales- and not just on the internet! I once met a young lady who boasted about her whale boyfriend,  and how she flew on his Gulfstream all the time when my mate told her I had a Gulfstream. I said, \"Well then surely you can tell me what a FBO is?\", to which she replied, \"Of course I know! You think I'm making all this up?! FBO is Food and Beverage Operator!\" *Bzzzzzzzzzz* Sorry, wrong answer! Thank you for playing.",
                            "author": "SLF921019",
                            "id": "grom2m3",
                            "parent_id": "t1_groj18b",
                            "score": 1,
                            "created_utc": 1616316216.0,
                            "replies": [
                                {
                                    "body": "Thank you! Lovely to hear that. I enjoyed my career while I was there for sure, all the amazing destinations! All of which I would have never travelled to having not been in the company. And what you’ve heard about the retrenchment is accurate too. It was in August! Although for the entirety of 6 months before that happened I did only 2 FLIGHTS as at some point we were barely operating at 2% which is mad considering the volume of flights prior to COVID. It was a lot of uncertainty but we felt it was coming soon anyway. However! Shit happens as they say. And I hope to have an entirely different path lined up. \n\nAnd yes the work permits do last for two years! As I was retrenched, the validity was cut short to 3 months after I received my notice.\n\nThanks for that last story though! I had a little giggle by myself at work. I figured at least know your shit if you’re gonna tell a hell of a story like that. Haha. Have a great evening ahead! I hope you’re having a relaxing one. Xo",
                                    "author": "evethedelicate",
                                    "id": "growqi9",
                                    "parent_id": "t1_grom2m3",
                                    "score": 5,
                                    "created_utc": 1616326567.0,
                                    "replies": []
                                },
                                {
                                    "body": "Beep. Boop. I'm a robot.\nHere's a copy of \n\n###[The Republic](https://snewd.com/ebooks/the-republic/)\n\nWas I a good bot? | [info](https://www.reddit.com/user/Reddit-Book-Bot/) | [More Books](https://old.reddit.com/user/Reddit-Book-Bot/comments/i15x1d/full_list_of_books_and_commands/)",
                                    "author": "Reddit-Book-Bot",
                                    "id": "grom32b",
                                    "parent_id": "t1_grom2m3",
                                    "score": 0,
                                    "created_utc": 1616316228.0,
                                    "replies": [
                                        {
                                            "body": " bad bot",
                                            "author": null,
                                            "id": "gros59c",
                                            "parent_id": "t1_grom32b",
                                            "score": 1,
                                            "created_utc": 1616322336.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you!’",
            "author": "evethedelicate",
            "id": "grpk3h3",
            "parent_id": "t1_grohvhm",
            "score": 4,
            "created_utc": 1616341098.0,
            "replies": []
        },
        {
            "body": "I hope so too! I love this more traditional side to some men, who seek to help and provide for the women they love and adore.",
            "author": "evethedelicate",
            "id": "grpk7vm",
            "parent_id": "t1_groqh05",
            "score": 3,
            "created_utc": 1616341162.0,
            "replies": []
        },
        {
            "body": "Thank you for your concern! Not being a spoilsport at all, just being realistic as I am too. Frugal mindset is key as nothing is forever! Do take care babe, have a safe flight. 😘",
            "author": "evethedelicate",
            "id": "grsib1o",
            "parent_id": "t1_grq6339",
            "score": 2,
            "created_utc": 1616402364.0,
            "replies": []
        },
        {
            "body": "Thank you! I am a lucky girl. And hope other girls can be just as lucky",
            "author": "evethedelicate",
            "id": "grpk2w6",
            "parent_id": "t1_groh2rc",
            "score": 4,
            "created_utc": 1616341090.0,
            "replies": []
        },
        {
            "body": "By landing a new job and swapping over my work pass to be registered under a new employer. 😊",
            "author": "evethedelicate",
            "id": "grp4j20",
            "parent_id": "t1_grp12hv",
            "score": 5,
            "created_utc": 1616332299.0,
            "replies": []
        },
        {
            "body": "Girl are you an FSS? Gotta tell me your story too in the dms! Maybe we can link up one day haha",
            "author": "evethedelicate",
            "id": "grw808c",
            "parent_id": "t1_grtkb7l",
            "score": 1,
            "created_utc": 1616473644.0,
            "replies": []
        },
        {
            "body": "Thank you so much babe! I’m super grateful every day. Let’s hope I can get through it! Haha",
            "author": "evethedelicate",
            "id": "grpkhoj",
            "parent_id": "t1_gro8nff",
            "score": 5,
            "created_utc": 1616341302.0,
            "replies": [
                {
                    "body": "You'll do fine I'm sure never underestimate good note taking.  🤓",
                    "author": "KittenReigns",
                    "id": "grprhq4",
                    "parent_id": "t1_grpkhoj",
                    "score": 4,
                    "created_utc": 1616344666.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I must say this is extremely flattering and must mean that I can write really well for someone with only a high school diploma and barely has the attention span to read more than 4 pages of a book at a time. 🤣",
            "author": "evethedelicate",
            "id": "grpir5m",
            "parent_id": "t1_grof01d",
            "score": 8,
            "created_utc": 1616340448.0,
            "replies": []
        },
        {
            "body": "Bro... seriously? You sound like a peach\n\nI am also “VERY well educated and accomplished” but I generally don’t feel the need to point that out to other people. \n\nMy SGF, who I met on SA and who actually introduced me to this sub, graduated early with a degree in molecular biology and is in the process of submitting her grad school applications.  She is smart, and ambitious and probably writes better than me. \n\nThis just comes off as insecure. Congrats on all your success tho 🤡",
            "author": "rw1970x",
            "id": "grqpmic",
            "parent_id": "t1_grof01d",
            "score": 4,
            "created_utc": 1616361375.0,
            "replies": []
        },
        {
            "body": "A professional writer? Seriously??! 🤣🤣",
            "author": "Ghanaiantoffee",
            "id": "grqgka1",
            "parent_id": "t1_grof01d",
            "score": 3,
            "created_utc": 1616356831.0,
            "replies": []
        },
        {
            "body": "Hmm I don't know about your experience with SBs but there are quite a few of us that are also on the road to well educated and accomplished. The only difference between you and I is that you're older and have completed your schooling, while SB's are in the process of receiving mentoring, applying to graduate schools, etc. I don't see why it's so hard to believe that a sugar baby can write a grammatically correct and well-flowing post on Reddit. 🤦‍♀️",
            "author": "galactosegirl",
            "id": "grqgwle",
            "parent_id": "t1_grof01d",
            "score": 3,
            "created_utc": 1616357004.0,
            "replies": []
        },
        {
            "body": "Whatever you do, do not hit on them when you are inflight. \n\nThis is from my past experience.\n\n😝",
            "author": "eurosd",
            "id": "grohamq",
            "parent_id": "t1_grob6dm",
            "score": 3,
            "created_utc": 1616311567.0,
            "replies": [
                {
                    "body": "Im always a coward.  Had a few flirting hard.  But I hate talking to girls with loads of civilians around.",
                    "author": "wb19081908",
                    "id": "grohuhz",
                    "parent_id": "t1_grohamq",
                    "score": 0,
                    "created_utc": 1616312080.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Go get it!! I’ve heard some naughty stories from my colleagues with passengers 😌",
            "author": "evethedelicate",
            "id": "grpkcu0",
            "parent_id": "t1_grob6dm",
            "score": 1,
            "created_utc": 1616341234.0,
            "replies": [
                {
                    "body": "🙈🙉😻",
                    "author": "wb19081908",
                    "id": "grpkkcz",
                    "parent_id": "t1_grpkcu0",
                    "score": 1,
                    "created_utc": 1616341338.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "grpu6nz",
            "parent_id": "t1_grpu6my",
            "score": 1,
            "created_utc": 1616345922.0,
            "replies": []
        },
        {
            "body": "When she leaves him and moves on to a new dude she finds in college, is it still an investment or an expense :)?",
            "author": "Weezyf7",
            "id": "groxgwc",
            "parent_id": "t1_gro891m",
            "score": 0,
            "created_utc": 1616327174.0,
            "replies": []
        },
        {
            "body": "Hi there! I must say I was quite amused reading this knowing I am as real as can be haha.\n\nTo explain it a little further, (not that I feel I need to, but out of curiosity some might have) I was a stewardess specifically under a Singaporean based international airlines. The minimum joining age is 18 (as well as in most if not all Asian airlines apart from Emirates/Qatar Airways). Secondly, Singapore allows for several different types of work passes. For someone with a degree/higher education it would normally be an EP (employment pass) etc. For myself it’s a WP (work permit) which is work pass generally given to those who apply without degrees/higher education like myself who are to work in the service/labour industry. And Singaporean laws are such that I could and was in fact encouraged by my former company to seek a different job and remain in Singapore. This is so the airline would more easily be able to rehire foreign crew once all the travel restrictions are gone and kick off again!\n\nI hope that can clear up some things. 😊",
            "author": "evethedelicate",
            "id": "groj18b",
            "parent_id": "t1_grohz91",
            "score": 19,
            "created_utc": 1616313232.0,
            "replies": [
                {
                    "body": "LOL\n\nThis Post rang true to me for sure & good for you...\n\nWhat you failed to mention (out of modesty), which I’m 99% sure is the case, is that you are drop dead gorgeous, smart  and have a genuine thing for much older, established men. \n\n18-25 year olds like you are extremely rare in life and even rarer on SA.  Most relationships like yours happen in real life..not online.",
                    "author": "BGDDDY1",
                    "id": "growoz9",
                    "parent_id": "t1_groj18b",
                    "score": 7,
                    "created_utc": 1616326531.0,
                    "replies": []
                },
                {
                    "body": "Glad to amuse you on a Sunday evening. Well if you are genuine,  then good for you. I have several friends who married SIA cabin crew.\n\nI have family and friends in high places in Singapore and have flown with SIA often for 4 decades and even partied with some SIA cabin crew back in my younger days. I know they hire from Malaysia, Indonesia, China, Taiwan, Thailand etc., and that you can be hired at 18 if you're tall (and attractive) enough. I know they had a major retrenchment last Fall, and that as part of the early departure program they were releasing laid off cabin crew from bond/loan obligations, but I was unaware that the government and SIA management were allowing you to stay in the Republic. \n\nIsn't a work pass for a max of 2 years though?\n\nGoing to school is a great idea for your future. And if your story is true, I apologize for doubting you and wish you all the best. There are a lot of people who tell tall tales- and not just on the internet! I once met a young lady who boasted about her whale boyfriend,  and how she flew on his Gulfstream all the time when my mate told her I had a Gulfstream. I said, \"Well then surely you can tell me what a FBO is?\", to which she replied, \"Of course I know! You think I'm making all this up?! FBO is Food and Beverage Operator!\" *Bzzzzzzzzzz* Sorry, wrong answer! Thank you for playing.",
                    "author": "SLF921019",
                    "id": "grom2m3",
                    "parent_id": "t1_groj18b",
                    "score": 1,
                    "created_utc": 1616316216.0,
                    "replies": [
                        {
                            "body": "Thank you! Lovely to hear that. I enjoyed my career while I was there for sure, all the amazing destinations! All of which I would have never travelled to having not been in the company. And what you’ve heard about the retrenchment is accurate too. It was in August! Although for the entirety of 6 months before that happened I did only 2 FLIGHTS as at some point we were barely operating at 2% which is mad considering the volume of flights prior to COVID. It was a lot of uncertainty but we felt it was coming soon anyway. However! Shit happens as they say. And I hope to have an entirely different path lined up. \n\nAnd yes the work permits do last for two years! As I was retrenched, the validity was cut short to 3 months after I received my notice.\n\nThanks for that last story though! I had a little giggle by myself at work. I figured at least know your shit if you’re gonna tell a hell of a story like that. Haha. Have a great evening ahead! I hope you’re having a relaxing one. Xo",
                            "author": "evethedelicate",
                            "id": "growqi9",
                            "parent_id": "t1_grom2m3",
                            "score": 5,
                            "created_utc": 1616326567.0,
                            "replies": []
                        },
                        {
                            "body": "Beep. Boop. I'm a robot.\nHere's a copy of \n\n###[The Republic](https://snewd.com/ebooks/the-republic/)\n\nWas I a good bot? | [info](https://www.reddit.com/user/Reddit-Book-Bot/) | [More Books](https://old.reddit.com/user/Reddit-Book-Bot/comments/i15x1d/full_list_of_books_and_commands/)",
                            "author": "Reddit-Book-Bot",
                            "id": "grom32b",
                            "parent_id": "t1_grom2m3",
                            "score": 0,
                            "created_utc": 1616316228.0,
                            "replies": [
                                {
                                    "body": " bad bot",
                                    "author": null,
                                    "id": "gros59c",
                                    "parent_id": "t1_grom32b",
                                    "score": 1,
                                    "created_utc": 1616322336.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You'll do fine I'm sure never underestimate good note taking.  🤓",
            "author": "KittenReigns",
            "id": "grprhq4",
            "parent_id": "t1_grpkhoj",
            "score": 4,
            "created_utc": 1616344666.0,
            "replies": []
        },
        {
            "body": "Im always a coward.  Had a few flirting hard.  But I hate talking to girls with loads of civilians around.",
            "author": "wb19081908",
            "id": "grohuhz",
            "parent_id": "t1_grohamq",
            "score": 0,
            "created_utc": 1616312080.0,
            "replies": []
        },
        {
            "body": "🙈🙉😻",
            "author": "wb19081908",
            "id": "grpkkcz",
            "parent_id": "t1_grpkcu0",
            "score": 1,
            "created_utc": 1616341338.0,
            "replies": []
        },
        {
            "body": "LOL\n\nThis Post rang true to me for sure & good for you...\n\nWhat you failed to mention (out of modesty), which I’m 99% sure is the case, is that you are drop dead gorgeous, smart  and have a genuine thing for much older, established men. \n\n18-25 year olds like you are extremely rare in life and even rarer on SA.  Most relationships like yours happen in real life..not online.",
            "author": "BGDDDY1",
            "id": "growoz9",
            "parent_id": "t1_groj18b",
            "score": 7,
            "created_utc": 1616326531.0,
            "replies": []
        },
        {
            "body": "Glad to amuse you on a Sunday evening. Well if you are genuine,  then good for you. I have several friends who married SIA cabin crew.\n\nI have family and friends in high places in Singapore and have flown with SIA often for 4 decades and even partied with some SIA cabin crew back in my younger days. I know they hire from Malaysia, Indonesia, China, Taiwan, Thailand etc., and that you can be hired at 18 if you're tall (and attractive) enough. I know they had a major retrenchment last Fall, and that as part of the early departure program they were releasing laid off cabin crew from bond/loan obligations, but I was unaware that the government and SIA management were allowing you to stay in the Republic. \n\nIsn't a work pass for a max of 2 years though?\n\nGoing to school is a great idea for your future. And if your story is true, I apologize for doubting you and wish you all the best. There are a lot of people who tell tall tales- and not just on the internet! I once met a young lady who boasted about her whale boyfriend,  and how she flew on his Gulfstream all the time when my mate told her I had a Gulfstream. I said, \"Well then surely you can tell me what a FBO is?\", to which she replied, \"Of course I know! You think I'm making all this up?! FBO is Food and Beverage Operator!\" *Bzzzzzzzzzz* Sorry, wrong answer! Thank you for playing.",
            "author": "SLF921019",
            "id": "grom2m3",
            "parent_id": "t1_groj18b",
            "score": 1,
            "created_utc": 1616316216.0,
            "replies": [
                {
                    "body": "Thank you! Lovely to hear that. I enjoyed my career while I was there for sure, all the amazing destinations! All of which I would have never travelled to having not been in the company. And what you’ve heard about the retrenchment is accurate too. It was in August! Although for the entirety of 6 months before that happened I did only 2 FLIGHTS as at some point we were barely operating at 2% which is mad considering the volume of flights prior to COVID. It was a lot of uncertainty but we felt it was coming soon anyway. However! Shit happens as they say. And I hope to have an entirely different path lined up. \n\nAnd yes the work permits do last for two years! As I was retrenched, the validity was cut short to 3 months after I received my notice.\n\nThanks for that last story though! I had a little giggle by myself at work. I figured at least know your shit if you’re gonna tell a hell of a story like that. Haha. Have a great evening ahead! I hope you’re having a relaxing one. Xo",
                    "author": "evethedelicate",
                    "id": "growqi9",
                    "parent_id": "t1_grom2m3",
                    "score": 5,
                    "created_utc": 1616326567.0,
                    "replies": []
                },
                {
                    "body": "Beep. Boop. I'm a robot.\nHere's a copy of \n\n###[The Republic](https://snewd.com/ebooks/the-republic/)\n\nWas I a good bot? | [info](https://www.reddit.com/user/Reddit-Book-Bot/) | [More Books](https://old.reddit.com/user/Reddit-Book-Bot/comments/i15x1d/full_list_of_books_and_commands/)",
                    "author": "Reddit-Book-Bot",
                    "id": "grom32b",
                    "parent_id": "t1_grom2m3",
                    "score": 0,
                    "created_utc": 1616316228.0,
                    "replies": [
                        {
                            "body": " bad bot",
                            "author": null,
                            "id": "gros59c",
                            "parent_id": "t1_grom32b",
                            "score": 1,
                            "created_utc": 1616322336.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you! Lovely to hear that. I enjoyed my career while I was there for sure, all the amazing destinations! All of which I would have never travelled to having not been in the company. And what you’ve heard about the retrenchment is accurate too. It was in August! Although for the entirety of 6 months before that happened I did only 2 FLIGHTS as at some point we were barely operating at 2% which is mad considering the volume of flights prior to COVID. It was a lot of uncertainty but we felt it was coming soon anyway. However! Shit happens as they say. And I hope to have an entirely different path lined up. \n\nAnd yes the work permits do last for two years! As I was retrenched, the validity was cut short to 3 months after I received my notice.\n\nThanks for that last story though! I had a little giggle by myself at work. I figured at least know your shit if you’re gonna tell a hell of a story like that. Haha. Have a great evening ahead! I hope you’re having a relaxing one. Xo",
            "author": "evethedelicate",
            "id": "growqi9",
            "parent_id": "t1_grom2m3",
            "score": 5,
            "created_utc": 1616326567.0,
            "replies": []
        },
        {
            "body": "Beep. Boop. I'm a robot.\nHere's a copy of \n\n###[The Republic](https://snewd.com/ebooks/the-republic/)\n\nWas I a good bot? | [info](https://www.reddit.com/user/Reddit-Book-Bot/) | [More Books](https://old.reddit.com/user/Reddit-Book-Bot/comments/i15x1d/full_list_of_books_and_commands/)",
            "author": "Reddit-Book-Bot",
            "id": "grom32b",
            "parent_id": "t1_grom2m3",
            "score": 0,
            "created_utc": 1616316228.0,
            "replies": [
                {
                    "body": " bad bot",
                    "author": null,
                    "id": "gros59c",
                    "parent_id": "t1_grom32b",
                    "score": 1,
                    "created_utc": 1616322336.0,
                    "replies": []
                }
            ]
        },
        {
            "body": " bad bot",
            "author": null,
            "id": "gros59c",
            "parent_id": "t1_grom32b",
            "score": 1,
            "created_utc": 1616322336.0,
            "replies": []
        }
    ]
}