{
    "title": "Kim Jong Kook falling in love with Jessi over the use of toilet paper 😂",
    "post_id": "jjjlsi",
    "post_url": "https://www.reddit.com/r/runningman/comments/jjjlsi/kim_jong_kook_falling_in_love_with_jessi_over_the/",
    "author": null,
    "body": "",
    "url": "https://v.redd.it/5itl9y4fjsv51",
    "score": 306,
    "upvote_ratio": 0.98,
    "created_utc": 1603871392.0,
    "num_comments": 30,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "You can watch the whole segment on My little old boy's latest episode last segment. Its hilarious how the two hyungs try to matchmake kjk and jessi.",
            "author": null,
            "id": "gad1ncd",
            "parent_id": "t3_jjjlsi",
            "score": 40,
            "created_utc": 1603872974.0,
            "replies": []
        },
        {
            "body": "KJK was probably amazed that someone finally agrees with his mindset about toilet paper.. I'm surprised people actually find that as a laughingstock when we should really live that way..",
            "author": null,
            "id": "gad2tl0",
            "parent_id": "t3_jjjlsi",
            "score": 46,
            "created_utc": 1603874335.0,
            "replies": [
                {
                    "body": "Yes,his way of thinking is good though. He did say before,he is doing this for the environment and future generations.",
                    "author": null,
                    "id": "gad334t",
                    "parent_id": "t1_gad2tl0",
                    "score": 27,
                    "created_utc": 1603874649.0,
                    "replies": []
                },
                {
                    "body": "its good but sometimes it became too much, i sometimes disagree or agree about his saved the enviroment, btw im just hope, he became lenient just a little bit",
                    "author": "NBA606",
                    "id": "gadaqpd",
                    "parent_id": "t1_gad2tl0",
                    "score": 12,
                    "created_utc": 1603883016.0,
                    "replies": [
                        {
                            "body": "Isn't he just cheap then? (nothing wrong with it) His fan mentioned below that he uses water and tissues freely on shows where he's not personally paying for it (like Dragon Club or RM). But when it's water at his house or tissues he bought, he's suddenly frugal about it. So he might just be cheap.\n\nAnd you gotta wonder about the \"environment\" excuse because plane rides send so many toxic gases into the atmosphere but he's constantly heading to LA on expensive trips. I don't care either way because I don't keep up with his shows but the conflicting actions and statements are kinda interesting.",
                            "author": "ultggb",
                            "id": "gae839c",
                            "parent_id": "t1_gadaqpd",
                            "score": 8,
                            "created_utc": 1603902529.0,
                            "replies": [
                                {
                                    "body": "Maybe? But I think he just grew up in that generation where everyone were pinching pennies to save money, that it's become part of his personality.\n\nAnyway, like you've said he travels to LA a lot, so it's not like he doesn't spend any money.",
                                    "author": "kukumarq",
                                    "id": "gaejit5",
                                    "parent_id": "t1_gae839c",
                                    "score": 12,
                                    "created_utc": 1603907736.0,
                                    "replies": [
                                        {
                                            "body": "As someone who grew up in S. Korea and has family there, penny pinching is common for people in Korea. Its only been around 70 years since the Korean War and the country was decimated afterwards. Plenty of people, including my grandma, lived in poverty during this period. Its why if you eat with people there, you're always encouraged to eat more as that was the mentality back then; eat as much as you can because you might not know when or where the next meal will come. As S. Korea's economy developed and population grew, more people from the country moved to the city, but that poor country mentality still persisted. Recently this feeling is dwindling down as the last 20-30 years have seen the economic growth boom and less people are being raised in humble situations. I would say KJK's generation will be one of the last that has this kind of sentiment as most people born after him will have been raised in a developed S. Korea",
                                            "author": "RyanG7",
                                            "id": "gaff360",
                                            "parent_id": "t1_gaejit5",
                                            "score": 10,
                                            "created_utc": 1603922681.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "VERY POOR comprehension..\n\n\n>he uses water and tissues freely on shows where he's not personally paying for it (like Dragon Club or RM). But when it's water at his house or tissues he bought, he's suddenly frugal about it. So he might just be cheap.\n\nIn variety shows where his frugal character is not capitalized, he needs not to play the character that he plays on Mom's Diary.. heck, you call him cheap?? Tell that to his friends whom he pays for their foods, clothes, plane tickets for..\n\n\n>\"environment\" excuse because plane rides send so many toxic gases into the atmosphere but he's constantly heading to LA on expensive trips\n\nAre u serious?? Such a dumb query.. His own stand about the environment is to try to save on things by using only what he needs.. It's not like the plane he uses to LA is private that it would not operate if he decides not to go.. it's a public transportation if you are not aware..\n\n>I don't care either way because I don't keep up with his shows but the conflicting actions and statements are kinda interesting.\n\nIt's just your poor comprehension and trying to be nosy with things that apparently, you do not have a full understanding about..",
                                    "author": null,
                                    "id": "gakovo7",
                                    "parent_id": "t1_gae839c",
                                    "score": 2,
                                    "created_utc": 1604036091.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "If he wishes to get married,yes he have to change. Unless he can find someone similar to him.",
                            "author": null,
                            "id": "gadc7el",
                            "parent_id": "t1_gadaqpd",
                            "score": 1,
                            "created_utc": 1603884352.0,
                            "replies": [
                                {
                                    "body": "yup, he need to change, some of his fans, say that his act like that only for variety, but at doubt it, because his mom always about his frugality, at the end, men always be men, find a good woman, and he will change completely",
                                    "author": "NBA606",
                                    "id": "gadetnj",
                                    "parent_id": "t1_gadc7el",
                                    "score": -3,
                                    "created_utc": 1603886513.0,
                                    "replies": [
                                        {
                                            "body": "That will work for about first 1-2 years of marriage. After that he will revert to his old self. Its hard to change a particular habit when you're already 40+ years old. \n\nYes, he might exaggerate for variety. But his core principles is the same off camera. \n\nAnd this whole thing of \"oh he is going to change after marriage\" is more of a fantasy than reality. The number of people that totally change their character after marriage is small. \n\nYou can change a person's attitude. Character is something that is ingrained in him since he was small. Its easier if he is a teen or 20+ years old.",
                                            "author": null,
                                            "id": "gadfa5g",
                                            "parent_id": "t1_gadetnj",
                                            "score": 18,
                                            "created_utc": 1603886869.0,
                                            "replies": []
                                        },
                                        {
                                            "body": ">some of his fans, say that his act like that only for variety\n\nI am part of that fan you are talking about, and yes it is only for variety.. have you seen if he's really that thrifty in Running Man?? No. in his show with his own friends titled Dragon Club, you can actually watch him using water on the maximum pressure and use tissues decently (if thats how you call it).. bottomline, he only acts his capitalized characters on certain shows..",
                                            "author": null,
                                            "id": "gae0vpi",
                                            "parent_id": "t1_gadetnj",
                                            "score": 3,
                                            "created_utc": 1603899146.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you for the info. Will watch it. I guess his mom is a liar than. Since she said on MUD that kjk will scold her if she uses excessive water and tissue. Every single friend of his must be a liar too. Since all of them said the same thing. Including cha tae hyun. \n\nOn a side note,he is a great actor if it is all a lie. Regardless,asking a fan for a flaw in his fav celeb is like asking a hater to praise the celeb he hates. Neither will be objective.",
                                                    "author": null,
                                                    "id": "gae4zor",
                                                    "parent_id": "t1_gae0vpi",
                                                    "score": 4,
                                                    "created_utc": 1603901089.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don't think anyone is saying his mother and his close friends are liars??\n\nIf you watched his MUD episode where his father appears, you will realise that he is EXACTLY like his father, he just doesn't want to admit it lol.\n\nBut since it's a variety show, he does play up that that character. But all in all, everyone's concept and character on MUD is based on their personalities or their lives. Just a little more exaggerated.",
                                                            "author": "kukumarq",
                                                            "id": "gaeif86",
                                                            "parent_id": "t1_gae4zor",
                                                            "score": 7,
                                                            "created_utc": 1603907229.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yes. That is what i said. It is exaggerated. But his core principles is the same. I was replying to a fan of his that dismissed kjk character on screen by saying that is not him.",
                                                                    "author": null,
                                                                    "id": "gagivo9",
                                                                    "parent_id": "t1_gaeif86",
                                                                    "score": 2,
                                                                    "created_utc": 1603944120.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Just wanted to add some insight. Not sure where or what show I watched, but from what I remember, when he went on a trip with some friends, they said KJK did not let them pay for anything. Maybe somebody else knows what I'm talking about. There's also an episode of MUD where he and his friends go inside a clothing store, and he says buy whatever you want. There are also a few headlines of him donating a hefty amount to charity. So imho, his personality is more of a preserving what you can, rather than being cheap.",
                                                                            "author": "babushka142",
                                                                            "id": "gah4hrr",
                                                                            "parent_id": "t1_gagivo9",
                                                                            "score": 3,
                                                                            "created_utc": 1603965514.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "The only way his way will work if he find someone born in the same generation as his that understand why he lives this way.\n\nIf he find someone in the early 30s,they might not be ok with it.",
                                    "author": null,
                                    "id": "gau9ghe",
                                    "parent_id": "t1_gadc7el",
                                    "score": 1,
                                    "created_utc": 1604271461.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "There's actually a sad backstory why KJK is the way that he is.\nhe's used to living like that because of his dad being much stricter than he is, but his dad's life was so hard in the past and it's so sad. KJK's dad have 8 or 7 siblings and a single mother who took care of them all, they were so poor, and one day they couldn't afford food.\n\nKJK's dad watched one of his brother died slowly of hunger.\ni guess it traumatized him, no matter how much he has now he can't bring himself to waste anything not knowing what could happen in the future.\nHe teared up when he told that story. it was in one of the episode of little old boy when kjk and his dad traveled together.",
                    "author": "ilobeaa2",
                    "id": "gaxm3ee",
                    "parent_id": "t1_gad2tl0",
                    "score": 2,
                    "created_utc": 1604349312.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Considering Jessi lived on the streets at one point, i'm not surprised xD",
            "author": "RoyDaren",
            "id": "gadd4gz",
            "parent_id": "t3_jjjlsi",
            "score": 13,
            "created_utc": 1603885145.0,
            "replies": []
        },
        {
            "body": "That would be a really awesome power couple.",
            "author": "bbbbbap",
            "id": "gadau9k",
            "parent_id": "t3_jjjlsi",
            "score": 11,
            "created_utc": 1603883109.0,
            "replies": [
                {
                    "body": "Too powerful. Their children will probably unite Korea 😂😂",
                    "author": null,
                    "id": "gadc9hm",
                    "parent_id": "t1_gadau9k",
                    "score": 16,
                    "created_utc": 1603884403.0,
                    "replies": [
                        {
                            "body": "foreals haha! he also loves LA so much 😂",
                            "author": null,
                            "id": "gady0hg",
                            "parent_id": "t1_gadc9hm",
                            "score": 3,
                            "created_utc": 1603897774.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "They would terrorize Yoo Jae Suk to no end. :)",
                    "author": "bluebirdgm",
                    "id": "gag9pgd",
                    "parent_id": "t1_gadau9k",
                    "score": 5,
                    "created_utc": 1603938310.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I won't lie. At first, I was, enough with the shipping. But slowly through the episode, I started thinking, they would definitely be lovely together. Although, I don't think either of them considered each other in that regard.",
            "author": "Wandering_Queen",
            "id": "gaef27z",
            "parent_id": "t3_jjjlsi",
            "score": 11,
            "created_utc": 1603905706.0,
            "replies": []
        },
        {
            "body": "That one square better be quadruple ply...",
            "author": "EYLive",
            "id": "gaed3vv",
            "parent_id": "t3_jjjlsi",
            "score": 7,
            "created_utc": 1603904821.0,
            "replies": []
        },
        {
            "body": "If they’re talking about pre-moistened “flushable” wipes (and she does look like she’s holding a packet of those rather than a standard roll), then using one at a time *is* the recommended amount; more than that and the toilet is liable to clog.  Also, bidets and similar devices are more common in South Korea, so even if it’s conventional TP, one can get by on much less toilet paper.",
            "author": "bluebirdgm",
            "id": "gag8fn8",
            "parent_id": "t3_jjjlsi",
            "score": 4,
            "created_utc": 1603937581.0,
            "replies": [
                {
                    "body": "Base on MUD, they are talking about toilet rolls.",
                    "author": null,
                    "id": "gagio43",
                    "parent_id": "t1_gag8fn8",
                    "score": 3,
                    "created_utc": 1603943972.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh no, not another one",
            "author": null,
            "id": "gae2b8h",
            "parent_id": "t3_jjjlsi",
            "score": 2,
            "created_utc": 1603899828.0,
            "replies": []
        },
        {
            "body": "OT: SBS is having a trot competition?",
            "author": "yeontura",
            "id": "gafx3zk",
            "parent_id": "t3_jjjlsi",
            "score": 1,
            "created_utc": 1603931321.0,
            "replies": []
        },
        {
            "body": "Yes,his way of thinking is good though. He did say before,he is doing this for the environment and future generations.",
            "author": null,
            "id": "gad334t",
            "parent_id": "t1_gad2tl0",
            "score": 27,
            "created_utc": 1603874649.0,
            "replies": []
        },
        {
            "body": "its good but sometimes it became too much, i sometimes disagree or agree about his saved the enviroment, btw im just hope, he became lenient just a little bit",
            "author": "NBA606",
            "id": "gadaqpd",
            "parent_id": "t1_gad2tl0",
            "score": 12,
            "created_utc": 1603883016.0,
            "replies": [
                {
                    "body": "Isn't he just cheap then? (nothing wrong with it) His fan mentioned below that he uses water and tissues freely on shows where he's not personally paying for it (like Dragon Club or RM). But when it's water at his house or tissues he bought, he's suddenly frugal about it. So he might just be cheap.\n\nAnd you gotta wonder about the \"environment\" excuse because plane rides send so many toxic gases into the atmosphere but he's constantly heading to LA on expensive trips. I don't care either way because I don't keep up with his shows but the conflicting actions and statements are kinda interesting.",
                    "author": "ultggb",
                    "id": "gae839c",
                    "parent_id": "t1_gadaqpd",
                    "score": 8,
                    "created_utc": 1603902529.0,
                    "replies": [
                        {
                            "body": "Maybe? But I think he just grew up in that generation where everyone were pinching pennies to save money, that it's become part of his personality.\n\nAnyway, like you've said he travels to LA a lot, so it's not like he doesn't spend any money.",
                            "author": "kukumarq",
                            "id": "gaejit5",
                            "parent_id": "t1_gae839c",
                            "score": 12,
                            "created_utc": 1603907736.0,
                            "replies": [
                                {
                                    "body": "As someone who grew up in S. Korea and has family there, penny pinching is common for people in Korea. Its only been around 70 years since the Korean War and the country was decimated afterwards. Plenty of people, including my grandma, lived in poverty during this period. Its why if you eat with people there, you're always encouraged to eat more as that was the mentality back then; eat as much as you can because you might not know when or where the next meal will come. As S. Korea's economy developed and population grew, more people from the country moved to the city, but that poor country mentality still persisted. Recently this feeling is dwindling down as the last 20-30 years have seen the economic growth boom and less people are being raised in humble situations. I would say KJK's generation will be one of the last that has this kind of sentiment as most people born after him will have been raised in a developed S. Korea",
                                    "author": "RyanG7",
                                    "id": "gaff360",
                                    "parent_id": "t1_gaejit5",
                                    "score": 10,
                                    "created_utc": 1603922681.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "VERY POOR comprehension..\n\n\n>he uses water and tissues freely on shows where he's not personally paying for it (like Dragon Club or RM). But when it's water at his house or tissues he bought, he's suddenly frugal about it. So he might just be cheap.\n\nIn variety shows where his frugal character is not capitalized, he needs not to play the character that he plays on Mom's Diary.. heck, you call him cheap?? Tell that to his friends whom he pays for their foods, clothes, plane tickets for..\n\n\n>\"environment\" excuse because plane rides send so many toxic gases into the atmosphere but he's constantly heading to LA on expensive trips\n\nAre u serious?? Such a dumb query.. His own stand about the environment is to try to save on things by using only what he needs.. It's not like the plane he uses to LA is private that it would not operate if he decides not to go.. it's a public transportation if you are not aware..\n\n>I don't care either way because I don't keep up with his shows but the conflicting actions and statements are kinda interesting.\n\nIt's just your poor comprehension and trying to be nosy with things that apparently, you do not have a full understanding about..",
                            "author": null,
                            "id": "gakovo7",
                            "parent_id": "t1_gae839c",
                            "score": 2,
                            "created_utc": 1604036091.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "If he wishes to get married,yes he have to change. Unless he can find someone similar to him.",
                    "author": null,
                    "id": "gadc7el",
                    "parent_id": "t1_gadaqpd",
                    "score": 1,
                    "created_utc": 1603884352.0,
                    "replies": [
                        {
                            "body": "yup, he need to change, some of his fans, say that his act like that only for variety, but at doubt it, because his mom always about his frugality, at the end, men always be men, find a good woman, and he will change completely",
                            "author": "NBA606",
                            "id": "gadetnj",
                            "parent_id": "t1_gadc7el",
                            "score": -3,
                            "created_utc": 1603886513.0,
                            "replies": [
                                {
                                    "body": "That will work for about first 1-2 years of marriage. After that he will revert to his old self. Its hard to change a particular habit when you're already 40+ years old. \n\nYes, he might exaggerate for variety. But his core principles is the same off camera. \n\nAnd this whole thing of \"oh he is going to change after marriage\" is more of a fantasy than reality. The number of people that totally change their character after marriage is small. \n\nYou can change a person's attitude. Character is something that is ingrained in him since he was small. Its easier if he is a teen or 20+ years old.",
                                    "author": null,
                                    "id": "gadfa5g",
                                    "parent_id": "t1_gadetnj",
                                    "score": 18,
                                    "created_utc": 1603886869.0,
                                    "replies": []
                                },
                                {
                                    "body": ">some of his fans, say that his act like that only for variety\n\nI am part of that fan you are talking about, and yes it is only for variety.. have you seen if he's really that thrifty in Running Man?? No. in his show with his own friends titled Dragon Club, you can actually watch him using water on the maximum pressure and use tissues decently (if thats how you call it).. bottomline, he only acts his capitalized characters on certain shows..",
                                    "author": null,
                                    "id": "gae0vpi",
                                    "parent_id": "t1_gadetnj",
                                    "score": 3,
                                    "created_utc": 1603899146.0,
                                    "replies": [
                                        {
                                            "body": "Thank you for the info. Will watch it. I guess his mom is a liar than. Since she said on MUD that kjk will scold her if she uses excessive water and tissue. Every single friend of his must be a liar too. Since all of them said the same thing. Including cha tae hyun. \n\nOn a side note,he is a great actor if it is all a lie. Regardless,asking a fan for a flaw in his fav celeb is like asking a hater to praise the celeb he hates. Neither will be objective.",
                                            "author": null,
                                            "id": "gae4zor",
                                            "parent_id": "t1_gae0vpi",
                                            "score": 4,
                                            "created_utc": 1603901089.0,
                                            "replies": [
                                                {
                                                    "body": "I don't think anyone is saying his mother and his close friends are liars??\n\nIf you watched his MUD episode where his father appears, you will realise that he is EXACTLY like his father, he just doesn't want to admit it lol.\n\nBut since it's a variety show, he does play up that that character. But all in all, everyone's concept and character on MUD is based on their personalities or their lives. Just a little more exaggerated.",
                                                    "author": "kukumarq",
                                                    "id": "gaeif86",
                                                    "parent_id": "t1_gae4zor",
                                                    "score": 7,
                                                    "created_utc": 1603907229.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes. That is what i said. It is exaggerated. But his core principles is the same. I was replying to a fan of his that dismissed kjk character on screen by saying that is not him.",
                                                            "author": null,
                                                            "id": "gagivo9",
                                                            "parent_id": "t1_gaeif86",
                                                            "score": 2,
                                                            "created_utc": 1603944120.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Just wanted to add some insight. Not sure where or what show I watched, but from what I remember, when he went on a trip with some friends, they said KJK did not let them pay for anything. Maybe somebody else knows what I'm talking about. There's also an episode of MUD where he and his friends go inside a clothing store, and he says buy whatever you want. There are also a few headlines of him donating a hefty amount to charity. So imho, his personality is more of a preserving what you can, rather than being cheap.",
                                                                    "author": "babushka142",
                                                                    "id": "gah4hrr",
                                                                    "parent_id": "t1_gagivo9",
                                                                    "score": 3,
                                                                    "created_utc": 1603965514.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "The only way his way will work if he find someone born in the same generation as his that understand why he lives this way.\n\nIf he find someone in the early 30s,they might not be ok with it.",
                            "author": null,
                            "id": "gau9ghe",
                            "parent_id": "t1_gadc7el",
                            "score": 1,
                            "created_utc": 1604271461.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There's actually a sad backstory why KJK is the way that he is.\nhe's used to living like that because of his dad being much stricter than he is, but his dad's life was so hard in the past and it's so sad. KJK's dad have 8 or 7 siblings and a single mother who took care of them all, they were so poor, and one day they couldn't afford food.\n\nKJK's dad watched one of his brother died slowly of hunger.\ni guess it traumatized him, no matter how much he has now he can't bring himself to waste anything not knowing what could happen in the future.\nHe teared up when he told that story. it was in one of the episode of little old boy when kjk and his dad traveled together.",
            "author": "ilobeaa2",
            "id": "gaxm3ee",
            "parent_id": "t1_gad2tl0",
            "score": 2,
            "created_utc": 1604349312.0,
            "replies": []
        },
        {
            "body": "Too powerful. Their children will probably unite Korea 😂😂",
            "author": null,
            "id": "gadc9hm",
            "parent_id": "t1_gadau9k",
            "score": 16,
            "created_utc": 1603884403.0,
            "replies": [
                {
                    "body": "foreals haha! he also loves LA so much 😂",
                    "author": null,
                    "id": "gady0hg",
                    "parent_id": "t1_gadc9hm",
                    "score": 3,
                    "created_utc": 1603897774.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They would terrorize Yoo Jae Suk to no end. :)",
            "author": "bluebirdgm",
            "id": "gag9pgd",
            "parent_id": "t1_gadau9k",
            "score": 5,
            "created_utc": 1603938310.0,
            "replies": []
        },
        {
            "body": "Base on MUD, they are talking about toilet rolls.",
            "author": null,
            "id": "gagio43",
            "parent_id": "t1_gag8fn8",
            "score": 3,
            "created_utc": 1603943972.0,
            "replies": []
        },
        {
            "body": "Isn't he just cheap then? (nothing wrong with it) His fan mentioned below that he uses water and tissues freely on shows where he's not personally paying for it (like Dragon Club or RM). But when it's water at his house or tissues he bought, he's suddenly frugal about it. So he might just be cheap.\n\nAnd you gotta wonder about the \"environment\" excuse because plane rides send so many toxic gases into the atmosphere but he's constantly heading to LA on expensive trips. I don't care either way because I don't keep up with his shows but the conflicting actions and statements are kinda interesting.",
            "author": "ultggb",
            "id": "gae839c",
            "parent_id": "t1_gadaqpd",
            "score": 8,
            "created_utc": 1603902529.0,
            "replies": [
                {
                    "body": "Maybe? But I think he just grew up in that generation where everyone were pinching pennies to save money, that it's become part of his personality.\n\nAnyway, like you've said he travels to LA a lot, so it's not like he doesn't spend any money.",
                    "author": "kukumarq",
                    "id": "gaejit5",
                    "parent_id": "t1_gae839c",
                    "score": 12,
                    "created_utc": 1603907736.0,
                    "replies": [
                        {
                            "body": "As someone who grew up in S. Korea and has family there, penny pinching is common for people in Korea. Its only been around 70 years since the Korean War and the country was decimated afterwards. Plenty of people, including my grandma, lived in poverty during this period. Its why if you eat with people there, you're always encouraged to eat more as that was the mentality back then; eat as much as you can because you might not know when or where the next meal will come. As S. Korea's economy developed and population grew, more people from the country moved to the city, but that poor country mentality still persisted. Recently this feeling is dwindling down as the last 20-30 years have seen the economic growth boom and less people are being raised in humble situations. I would say KJK's generation will be one of the last that has this kind of sentiment as most people born after him will have been raised in a developed S. Korea",
                            "author": "RyanG7",
                            "id": "gaff360",
                            "parent_id": "t1_gaejit5",
                            "score": 10,
                            "created_utc": 1603922681.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "VERY POOR comprehension..\n\n\n>he uses water and tissues freely on shows where he's not personally paying for it (like Dragon Club or RM). But when it's water at his house or tissues he bought, he's suddenly frugal about it. So he might just be cheap.\n\nIn variety shows where his frugal character is not capitalized, he needs not to play the character that he plays on Mom's Diary.. heck, you call him cheap?? Tell that to his friends whom he pays for their foods, clothes, plane tickets for..\n\n\n>\"environment\" excuse because plane rides send so many toxic gases into the atmosphere but he's constantly heading to LA on expensive trips\n\nAre u serious?? Such a dumb query.. His own stand about the environment is to try to save on things by using only what he needs.. It's not like the plane he uses to LA is private that it would not operate if he decides not to go.. it's a public transportation if you are not aware..\n\n>I don't care either way because I don't keep up with his shows but the conflicting actions and statements are kinda interesting.\n\nIt's just your poor comprehension and trying to be nosy with things that apparently, you do not have a full understanding about..",
                    "author": null,
                    "id": "gakovo7",
                    "parent_id": "t1_gae839c",
                    "score": 2,
                    "created_utc": 1604036091.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If he wishes to get married,yes he have to change. Unless he can find someone similar to him.",
            "author": null,
            "id": "gadc7el",
            "parent_id": "t1_gadaqpd",
            "score": 1,
            "created_utc": 1603884352.0,
            "replies": [
                {
                    "body": "yup, he need to change, some of his fans, say that his act like that only for variety, but at doubt it, because his mom always about his frugality, at the end, men always be men, find a good woman, and he will change completely",
                    "author": "NBA606",
                    "id": "gadetnj",
                    "parent_id": "t1_gadc7el",
                    "score": -3,
                    "created_utc": 1603886513.0,
                    "replies": [
                        {
                            "body": "That will work for about first 1-2 years of marriage. After that he will revert to his old self. Its hard to change a particular habit when you're already 40+ years old. \n\nYes, he might exaggerate for variety. But his core principles is the same off camera. \n\nAnd this whole thing of \"oh he is going to change after marriage\" is more of a fantasy than reality. The number of people that totally change their character after marriage is small. \n\nYou can change a person's attitude. Character is something that is ingrained in him since he was small. Its easier if he is a teen or 20+ years old.",
                            "author": null,
                            "id": "gadfa5g",
                            "parent_id": "t1_gadetnj",
                            "score": 18,
                            "created_utc": 1603886869.0,
                            "replies": []
                        },
                        {
                            "body": ">some of his fans, say that his act like that only for variety\n\nI am part of that fan you are talking about, and yes it is only for variety.. have you seen if he's really that thrifty in Running Man?? No. in his show with his own friends titled Dragon Club, you can actually watch him using water on the maximum pressure and use tissues decently (if thats how you call it).. bottomline, he only acts his capitalized characters on certain shows..",
                            "author": null,
                            "id": "gae0vpi",
                            "parent_id": "t1_gadetnj",
                            "score": 3,
                            "created_utc": 1603899146.0,
                            "replies": [
                                {
                                    "body": "Thank you for the info. Will watch it. I guess his mom is a liar than. Since she said on MUD that kjk will scold her if she uses excessive water and tissue. Every single friend of his must be a liar too. Since all of them said the same thing. Including cha tae hyun. \n\nOn a side note,he is a great actor if it is all a lie. Regardless,asking a fan for a flaw in his fav celeb is like asking a hater to praise the celeb he hates. Neither will be objective.",
                                    "author": null,
                                    "id": "gae4zor",
                                    "parent_id": "t1_gae0vpi",
                                    "score": 4,
                                    "created_utc": 1603901089.0,
                                    "replies": [
                                        {
                                            "body": "I don't think anyone is saying his mother and his close friends are liars??\n\nIf you watched his MUD episode where his father appears, you will realise that he is EXACTLY like his father, he just doesn't want to admit it lol.\n\nBut since it's a variety show, he does play up that that character. But all in all, everyone's concept and character on MUD is based on their personalities or their lives. Just a little more exaggerated.",
                                            "author": "kukumarq",
                                            "id": "gaeif86",
                                            "parent_id": "t1_gae4zor",
                                            "score": 7,
                                            "created_utc": 1603907229.0,
                                            "replies": [
                                                {
                                                    "body": "Yes. That is what i said. It is exaggerated. But his core principles is the same. I was replying to a fan of his that dismissed kjk character on screen by saying that is not him.",
                                                    "author": null,
                                                    "id": "gagivo9",
                                                    "parent_id": "t1_gaeif86",
                                                    "score": 2,
                                                    "created_utc": 1603944120.0,
                                                    "replies": [
                                                        {
                                                            "body": "Just wanted to add some insight. Not sure where or what show I watched, but from what I remember, when he went on a trip with some friends, they said KJK did not let them pay for anything. Maybe somebody else knows what I'm talking about. There's also an episode of MUD where he and his friends go inside a clothing store, and he says buy whatever you want. There are also a few headlines of him donating a hefty amount to charity. So imho, his personality is more of a preserving what you can, rather than being cheap.",
                                                            "author": "babushka142",
                                                            "id": "gah4hrr",
                                                            "parent_id": "t1_gagivo9",
                                                            "score": 3,
                                                            "created_utc": 1603965514.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "The only way his way will work if he find someone born in the same generation as his that understand why he lives this way.\n\nIf he find someone in the early 30s,they might not be ok with it.",
                    "author": null,
                    "id": "gau9ghe",
                    "parent_id": "t1_gadc7el",
                    "score": 1,
                    "created_utc": 1604271461.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "foreals haha! he also loves LA so much 😂",
            "author": null,
            "id": "gady0hg",
            "parent_id": "t1_gadc9hm",
            "score": 3,
            "created_utc": 1603897774.0,
            "replies": []
        },
        {
            "body": "Maybe? But I think he just grew up in that generation where everyone were pinching pennies to save money, that it's become part of his personality.\n\nAnyway, like you've said he travels to LA a lot, so it's not like he doesn't spend any money.",
            "author": "kukumarq",
            "id": "gaejit5",
            "parent_id": "t1_gae839c",
            "score": 12,
            "created_utc": 1603907736.0,
            "replies": [
                {
                    "body": "As someone who grew up in S. Korea and has family there, penny pinching is common for people in Korea. Its only been around 70 years since the Korean War and the country was decimated afterwards. Plenty of people, including my grandma, lived in poverty during this period. Its why if you eat with people there, you're always encouraged to eat more as that was the mentality back then; eat as much as you can because you might not know when or where the next meal will come. As S. Korea's economy developed and population grew, more people from the country moved to the city, but that poor country mentality still persisted. Recently this feeling is dwindling down as the last 20-30 years have seen the economic growth boom and less people are being raised in humble situations. I would say KJK's generation will be one of the last that has this kind of sentiment as most people born after him will have been raised in a developed S. Korea",
                    "author": "RyanG7",
                    "id": "gaff360",
                    "parent_id": "t1_gaejit5",
                    "score": 10,
                    "created_utc": 1603922681.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "VERY POOR comprehension..\n\n\n>he uses water and tissues freely on shows where he's not personally paying for it (like Dragon Club or RM). But when it's water at his house or tissues he bought, he's suddenly frugal about it. So he might just be cheap.\n\nIn variety shows where his frugal character is not capitalized, he needs not to play the character that he plays on Mom's Diary.. heck, you call him cheap?? Tell that to his friends whom he pays for their foods, clothes, plane tickets for..\n\n\n>\"environment\" excuse because plane rides send so many toxic gases into the atmosphere but he's constantly heading to LA on expensive trips\n\nAre u serious?? Such a dumb query.. His own stand about the environment is to try to save on things by using only what he needs.. It's not like the plane he uses to LA is private that it would not operate if he decides not to go.. it's a public transportation if you are not aware..\n\n>I don't care either way because I don't keep up with his shows but the conflicting actions and statements are kinda interesting.\n\nIt's just your poor comprehension and trying to be nosy with things that apparently, you do not have a full understanding about..",
            "author": null,
            "id": "gakovo7",
            "parent_id": "t1_gae839c",
            "score": 2,
            "created_utc": 1604036091.0,
            "replies": []
        },
        {
            "body": "yup, he need to change, some of his fans, say that his act like that only for variety, but at doubt it, because his mom always about his frugality, at the end, men always be men, find a good woman, and he will change completely",
            "author": "NBA606",
            "id": "gadetnj",
            "parent_id": "t1_gadc7el",
            "score": -3,
            "created_utc": 1603886513.0,
            "replies": [
                {
                    "body": "That will work for about first 1-2 years of marriage. After that he will revert to his old self. Its hard to change a particular habit when you're already 40+ years old. \n\nYes, he might exaggerate for variety. But his core principles is the same off camera. \n\nAnd this whole thing of \"oh he is going to change after marriage\" is more of a fantasy than reality. The number of people that totally change their character after marriage is small. \n\nYou can change a person's attitude. Character is something that is ingrained in him since he was small. Its easier if he is a teen or 20+ years old.",
                    "author": null,
                    "id": "gadfa5g",
                    "parent_id": "t1_gadetnj",
                    "score": 18,
                    "created_utc": 1603886869.0,
                    "replies": []
                },
                {
                    "body": ">some of his fans, say that his act like that only for variety\n\nI am part of that fan you are talking about, and yes it is only for variety.. have you seen if he's really that thrifty in Running Man?? No. in his show with his own friends titled Dragon Club, you can actually watch him using water on the maximum pressure and use tissues decently (if thats how you call it).. bottomline, he only acts his capitalized characters on certain shows..",
                    "author": null,
                    "id": "gae0vpi",
                    "parent_id": "t1_gadetnj",
                    "score": 3,
                    "created_utc": 1603899146.0,
                    "replies": [
                        {
                            "body": "Thank you for the info. Will watch it. I guess his mom is a liar than. Since she said on MUD that kjk will scold her if she uses excessive water and tissue. Every single friend of his must be a liar too. Since all of them said the same thing. Including cha tae hyun. \n\nOn a side note,he is a great actor if it is all a lie. Regardless,asking a fan for a flaw in his fav celeb is like asking a hater to praise the celeb he hates. Neither will be objective.",
                            "author": null,
                            "id": "gae4zor",
                            "parent_id": "t1_gae0vpi",
                            "score": 4,
                            "created_utc": 1603901089.0,
                            "replies": [
                                {
                                    "body": "I don't think anyone is saying his mother and his close friends are liars??\n\nIf you watched his MUD episode where his father appears, you will realise that he is EXACTLY like his father, he just doesn't want to admit it lol.\n\nBut since it's a variety show, he does play up that that character. But all in all, everyone's concept and character on MUD is based on their personalities or their lives. Just a little more exaggerated.",
                                    "author": "kukumarq",
                                    "id": "gaeif86",
                                    "parent_id": "t1_gae4zor",
                                    "score": 7,
                                    "created_utc": 1603907229.0,
                                    "replies": [
                                        {
                                            "body": "Yes. That is what i said. It is exaggerated. But his core principles is the same. I was replying to a fan of his that dismissed kjk character on screen by saying that is not him.",
                                            "author": null,
                                            "id": "gagivo9",
                                            "parent_id": "t1_gaeif86",
                                            "score": 2,
                                            "created_utc": 1603944120.0,
                                            "replies": [
                                                {
                                                    "body": "Just wanted to add some insight. Not sure where or what show I watched, but from what I remember, when he went on a trip with some friends, they said KJK did not let them pay for anything. Maybe somebody else knows what I'm talking about. There's also an episode of MUD where he and his friends go inside a clothing store, and he says buy whatever you want. There are also a few headlines of him donating a hefty amount to charity. So imho, his personality is more of a preserving what you can, rather than being cheap.",
                                                    "author": "babushka142",
                                                    "id": "gah4hrr",
                                                    "parent_id": "t1_gagivo9",
                                                    "score": 3,
                                                    "created_utc": 1603965514.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The only way his way will work if he find someone born in the same generation as his that understand why he lives this way.\n\nIf he find someone in the early 30s,they might not be ok with it.",
            "author": null,
            "id": "gau9ghe",
            "parent_id": "t1_gadc7el",
            "score": 1,
            "created_utc": 1604271461.0,
            "replies": []
        },
        {
            "body": "As someone who grew up in S. Korea and has family there, penny pinching is common for people in Korea. Its only been around 70 years since the Korean War and the country was decimated afterwards. Plenty of people, including my grandma, lived in poverty during this period. Its why if you eat with people there, you're always encouraged to eat more as that was the mentality back then; eat as much as you can because you might not know when or where the next meal will come. As S. Korea's economy developed and population grew, more people from the country moved to the city, but that poor country mentality still persisted. Recently this feeling is dwindling down as the last 20-30 years have seen the economic growth boom and less people are being raised in humble situations. I would say KJK's generation will be one of the last that has this kind of sentiment as most people born after him will have been raised in a developed S. Korea",
            "author": "RyanG7",
            "id": "gaff360",
            "parent_id": "t1_gaejit5",
            "score": 10,
            "created_utc": 1603922681.0,
            "replies": []
        },
        {
            "body": "That will work for about first 1-2 years of marriage. After that he will revert to his old self. Its hard to change a particular habit when you're already 40+ years old. \n\nYes, he might exaggerate for variety. But his core principles is the same off camera. \n\nAnd this whole thing of \"oh he is going to change after marriage\" is more of a fantasy than reality. The number of people that totally change their character after marriage is small. \n\nYou can change a person's attitude. Character is something that is ingrained in him since he was small. Its easier if he is a teen or 20+ years old.",
            "author": null,
            "id": "gadfa5g",
            "parent_id": "t1_gadetnj",
            "score": 18,
            "created_utc": 1603886869.0,
            "replies": []
        },
        {
            "body": ">some of his fans, say that his act like that only for variety\n\nI am part of that fan you are talking about, and yes it is only for variety.. have you seen if he's really that thrifty in Running Man?? No. in his show with his own friends titled Dragon Club, you can actually watch him using water on the maximum pressure and use tissues decently (if thats how you call it).. bottomline, he only acts his capitalized characters on certain shows..",
            "author": null,
            "id": "gae0vpi",
            "parent_id": "t1_gadetnj",
            "score": 3,
            "created_utc": 1603899146.0,
            "replies": [
                {
                    "body": "Thank you for the info. Will watch it. I guess his mom is a liar than. Since she said on MUD that kjk will scold her if she uses excessive water and tissue. Every single friend of his must be a liar too. Since all of them said the same thing. Including cha tae hyun. \n\nOn a side note,he is a great actor if it is all a lie. Regardless,asking a fan for a flaw in his fav celeb is like asking a hater to praise the celeb he hates. Neither will be objective.",
                    "author": null,
                    "id": "gae4zor",
                    "parent_id": "t1_gae0vpi",
                    "score": 4,
                    "created_utc": 1603901089.0,
                    "replies": [
                        {
                            "body": "I don't think anyone is saying his mother and his close friends are liars??\n\nIf you watched his MUD episode where his father appears, you will realise that he is EXACTLY like his father, he just doesn't want to admit it lol.\n\nBut since it's a variety show, he does play up that that character. But all in all, everyone's concept and character on MUD is based on their personalities or their lives. Just a little more exaggerated.",
                            "author": "kukumarq",
                            "id": "gaeif86",
                            "parent_id": "t1_gae4zor",
                            "score": 7,
                            "created_utc": 1603907229.0,
                            "replies": [
                                {
                                    "body": "Yes. That is what i said. It is exaggerated. But his core principles is the same. I was replying to a fan of his that dismissed kjk character on screen by saying that is not him.",
                                    "author": null,
                                    "id": "gagivo9",
                                    "parent_id": "t1_gaeif86",
                                    "score": 2,
                                    "created_utc": 1603944120.0,
                                    "replies": [
                                        {
                                            "body": "Just wanted to add some insight. Not sure where or what show I watched, but from what I remember, when he went on a trip with some friends, they said KJK did not let them pay for anything. Maybe somebody else knows what I'm talking about. There's also an episode of MUD where he and his friends go inside a clothing store, and he says buy whatever you want. There are also a few headlines of him donating a hefty amount to charity. So imho, his personality is more of a preserving what you can, rather than being cheap.",
                                            "author": "babushka142",
                                            "id": "gah4hrr",
                                            "parent_id": "t1_gagivo9",
                                            "score": 3,
                                            "created_utc": 1603965514.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for the info. Will watch it. I guess his mom is a liar than. Since she said on MUD that kjk will scold her if she uses excessive water and tissue. Every single friend of his must be a liar too. Since all of them said the same thing. Including cha tae hyun. \n\nOn a side note,he is a great actor if it is all a lie. Regardless,asking a fan for a flaw in his fav celeb is like asking a hater to praise the celeb he hates. Neither will be objective.",
            "author": null,
            "id": "gae4zor",
            "parent_id": "t1_gae0vpi",
            "score": 4,
            "created_utc": 1603901089.0,
            "replies": [
                {
                    "body": "I don't think anyone is saying his mother and his close friends are liars??\n\nIf you watched his MUD episode where his father appears, you will realise that he is EXACTLY like his father, he just doesn't want to admit it lol.\n\nBut since it's a variety show, he does play up that that character. But all in all, everyone's concept and character on MUD is based on their personalities or their lives. Just a little more exaggerated.",
                    "author": "kukumarq",
                    "id": "gaeif86",
                    "parent_id": "t1_gae4zor",
                    "score": 7,
                    "created_utc": 1603907229.0,
                    "replies": [
                        {
                            "body": "Yes. That is what i said. It is exaggerated. But his core principles is the same. I was replying to a fan of his that dismissed kjk character on screen by saying that is not him.",
                            "author": null,
                            "id": "gagivo9",
                            "parent_id": "t1_gaeif86",
                            "score": 2,
                            "created_utc": 1603944120.0,
                            "replies": [
                                {
                                    "body": "Just wanted to add some insight. Not sure where or what show I watched, but from what I remember, when he went on a trip with some friends, they said KJK did not let them pay for anything. Maybe somebody else knows what I'm talking about. There's also an episode of MUD where he and his friends go inside a clothing store, and he says buy whatever you want. There are also a few headlines of him donating a hefty amount to charity. So imho, his personality is more of a preserving what you can, rather than being cheap.",
                                    "author": "babushka142",
                                    "id": "gah4hrr",
                                    "parent_id": "t1_gagivo9",
                                    "score": 3,
                                    "created_utc": 1603965514.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't think anyone is saying his mother and his close friends are liars??\n\nIf you watched his MUD episode where his father appears, you will realise that he is EXACTLY like his father, he just doesn't want to admit it lol.\n\nBut since it's a variety show, he does play up that that character. But all in all, everyone's concept and character on MUD is based on their personalities or their lives. Just a little more exaggerated.",
            "author": "kukumarq",
            "id": "gaeif86",
            "parent_id": "t1_gae4zor",
            "score": 7,
            "created_utc": 1603907229.0,
            "replies": [
                {
                    "body": "Yes. That is what i said. It is exaggerated. But his core principles is the same. I was replying to a fan of his that dismissed kjk character on screen by saying that is not him.",
                    "author": null,
                    "id": "gagivo9",
                    "parent_id": "t1_gaeif86",
                    "score": 2,
                    "created_utc": 1603944120.0,
                    "replies": [
                        {
                            "body": "Just wanted to add some insight. Not sure where or what show I watched, but from what I remember, when he went on a trip with some friends, they said KJK did not let them pay for anything. Maybe somebody else knows what I'm talking about. There's also an episode of MUD where he and his friends go inside a clothing store, and he says buy whatever you want. There are also a few headlines of him donating a hefty amount to charity. So imho, his personality is more of a preserving what you can, rather than being cheap.",
                            "author": "babushka142",
                            "id": "gah4hrr",
                            "parent_id": "t1_gagivo9",
                            "score": 3,
                            "created_utc": 1603965514.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes. That is what i said. It is exaggerated. But his core principles is the same. I was replying to a fan of his that dismissed kjk character on screen by saying that is not him.",
            "author": null,
            "id": "gagivo9",
            "parent_id": "t1_gaeif86",
            "score": 2,
            "created_utc": 1603944120.0,
            "replies": [
                {
                    "body": "Just wanted to add some insight. Not sure where or what show I watched, but from what I remember, when he went on a trip with some friends, they said KJK did not let them pay for anything. Maybe somebody else knows what I'm talking about. There's also an episode of MUD where he and his friends go inside a clothing store, and he says buy whatever you want. There are also a few headlines of him donating a hefty amount to charity. So imho, his personality is more of a preserving what you can, rather than being cheap.",
                    "author": "babushka142",
                    "id": "gah4hrr",
                    "parent_id": "t1_gagivo9",
                    "score": 3,
                    "created_utc": 1603965514.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just wanted to add some insight. Not sure where or what show I watched, but from what I remember, when he went on a trip with some friends, they said KJK did not let them pay for anything. Maybe somebody else knows what I'm talking about. There's also an episode of MUD where he and his friends go inside a clothing store, and he says buy whatever you want. There are also a few headlines of him donating a hefty amount to charity. So imho, his personality is more of a preserving what you can, rather than being cheap.",
            "author": "babushka142",
            "id": "gah4hrr",
            "parent_id": "t1_gagivo9",
            "score": 3,
            "created_utc": 1603965514.0,
            "replies": []
        }
    ]
}