{
    "title": "Update: Long term SD “ghosted” me for no reason. (Horrible outcome)",
    "post_id": "k80jdj",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/k80jdj/update_long_term_sd_ghosted_me_for_no_reason/",
    "author": "FoxyFreckles1989",
    "body": "My first post can be read [here.](https://www.reddit.com/r/sugarlifestyleforum/comments/k6sv1c/long_term_sd_ghosted_me_without_any_warning/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\nEdit: I removed the original post. I felt bad after finding out what happened. \n\nI cannot believe I am making this post. I don’t have a lot to say, right now, as I am sorting out my own emotions and am quite numb, at the moment. \n\nMy SD died. There isn’t any poetic way to sugarcoat it, nor is there much else for me to report, because I got the most minimal version of the events possible. His great niece contacted me after seeing the missed calls and texts from me in his phone. She knew about his sugar involvement and was very kind to me. She also told me I would have been more than welcome at the services, but they have already come and gone. She said she will be in touch to let me know if he left anything for me, because apparently she feels it’s something he might have done, but that isn’t something I’m expecting nor am I sure I’d even feel comfortable with. He was not married, and has one adult child. Everything he told me about his life was true. \n\nI am feeling a great deal of sorrow for his family, friends and coworkers. He was truly an understanding, kind, compassionate, empathetic and incredible person. He will be mourned and sorely missed. \n\nThank you all for your support on my last post and for any given here. I appreciate your kind words and the guessing games you were playing with me. I feel terrible for even momentarily thinking he was bad, a liar or anything other than what he’d presented himself to be with me. I am going to do my best to honor my sadness and move on.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/k80jdj/update_long_term_sd_ghosted_me_for_no_reason/",
    "score": 323,
    "upvote_ratio": 0.98,
    "created_utc": 1607283911.0,
    "num_comments": 58,
    "links": [
        [
            "https://www.reddit.com/r/sugarlifestyleforum/comments/k6sv1c/long_term_sd_ghosted_me_without_any_warning/?utm_source=share&utm_medium=ios_app&utm_name=iossmf"
        ]
    ],
    "comments": [
        {
            "body": "So sorry to hear!  Every time I read something like this, it reminds me to go check with my buddy who is entrusted to let my SB (and some special ex-SBs) know if I pass away.  Make sure he has all the info, etc",
            "author": "Azurecole",
            "id": "geva3z5",
            "parent_id": "t3_k80jdj",
            "score": 88,
            "created_utc": 1607285471.0,
            "replies": [
                {
                    "body": "My ex SD got mad at me when I asked if he had a friend who could contact me should he end up in the hospital. He said I was just as likely as him to die (he was 59 at the time), and I said regardless I’d feel bettter knowing someone could loop me in. After a 3 day argument he conceded. I’m glad you are proactive about it.",
                    "author": "urbanhippy123",
                    "id": "gew3d7s",
                    "parent_id": "t1_geva3z5",
                    "score": 33,
                    "created_utc": 1607300011.0,
                    "replies": []
                },
                {
                    "body": "That is a really decent thing of you to do.",
                    "author": "FoxyFreckles1989",
                    "id": "gevc8xq",
                    "parent_id": "t1_geva3z5",
                    "score": 28,
                    "created_utc": 1607286519.0,
                    "replies": [
                        {
                            "body": "Some years ago my then long term SB announced that was staying overnight and driving me to the hospital where I had a zero dark thirty arrival time for low risk surgery.  A male friend (retired USAF col)   would come to get me late morning.  My SB lived across LA and her (she and partner) entrepreneurial startup needed her for another 18 hour day and she would start 3 hours late. \n\nI came back to consciousness to a very bright light and very intrusive questioning   what's my name, what's 5 x 7 ......  my groggy brain knew they would not be asking these questions unless my heart had stopped.  It was just as the plastic surgeon  was packing up his gear and taking photos of his handiwork. \n\nAfter an hour or so they shipped me off  observation and monitoring. My cardiologist stopped by and I got some much needed sleep....  \n\nWhen I woke my SB and friend were sitting by my bed quietly talking. Unknown to me she had parked after she dropped me off, snuck in and had the desk add her name and number as a contact. My friend had never met her but was the one person who knew of the relationship. \n\nOur 5 year sugar relationship ended when she started a serious IRL relationship.  My most treasured Christmas gift last year was a card with a long note from her expressing her continued thanks for the wonderful relationship and how it benefited her.",
                            "author": "pinotandsugar",
                            "id": "gf212nq",
                            "parent_id": "t1_gevc8xq",
                            "score": 8,
                            "created_utc": 1607438292.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I always thought I was crazy for thinking this. It’s really a considerate thing to do",
                    "author": null,
                    "id": "gevkmq9",
                    "parent_id": "t1_geva3z5",
                    "score": 14,
                    "created_utc": 1607290453.0,
                    "replies": [
                        {
                            "body": "Not crazy!  I was doing that before I ever read slf, but this isn't the first heartbreaking \"haven't heard from my SD in weeks\" story I've read on slf.",
                            "author": "Azurecole",
                            "id": "gevr702",
                            "parent_id": "t1_gevkmq9",
                            "score": 9,
                            "created_utc": 1607293742.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I will do this today.. thanks for the idea..  but this raises another question.. a rather morbid one at that.. I have a wife and family and they dont know about my SRs.  I meet my 3 of my SBs in hotel and one in her apt.  what I die there ?  I know it may be stupid question.. but is there a way to avoid family knowing that you died while with an SB?",
                    "author": "rect1977",
                    "id": "gevtam1",
                    "parent_id": "t1_geva3z5",
                    "score": -6,
                    "created_utc": 1607294836.0,
                    "replies": [
                        {
                            "body": "I’m sorry to say, but. This thread is about the death of my SD, not advice on how to cover up your own SRs once you’re dead. Maybe I’m over sensitive right now, but I feel like your questions are inappropriate here.",
                            "author": "FoxyFreckles1989",
                            "id": "gexcour",
                            "parent_id": "t1_gevtam1",
                            "score": 15,
                            "created_utc": 1607330918.0,
                            "replies": []
                        },
                        {
                            "body": "No. Not really.",
                            "author": "SpectraLPN",
                            "id": "gew1cre",
                            "parent_id": "t1_gevtam1",
                            "score": 8,
                            "created_utc": 1607299000.0,
                            "replies": []
                        },
                        {
                            "body": "You could try not being a cheating fuckhead. That would prevent you from ever having to worry about it!",
                            "author": "ulose2piranha",
                            "id": "grnh7wm",
                            "parent_id": "t1_gevtam1",
                            "score": 1,
                            "created_utc": 1616287640.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So, so sorry for your loss.\n\nThere’s worse things than being a highlight of his life in this last chapter.\n\nI know it doesn’t help right now, but maybe you’ll find some solace in that.",
            "author": "DFWCouple4SB",
            "id": "gew2co4",
            "parent_id": "t3_k80jdj",
            "score": 23,
            "created_utc": 1607299499.0,
            "replies": [
                {
                    "body": "Actually, that *did* help a little bit just now. Thank you for giving me a different perspective to consider.",
                    "author": "FoxyFreckles1989",
                    "id": "gew378k",
                    "parent_id": "t1_gew2co4",
                    "score": 16,
                    "created_utc": 1607299929.0,
                    "replies": [
                        {
                            "body": "You’re welcome.  Good luck healing.",
                            "author": "DFWCouple4SB",
                            "id": "gew3myl",
                            "parent_id": "t1_gew378k",
                            "score": 5,
                            "created_utc": 1607300154.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That is a great thought. It seems so appropriate in this case. The impact and importance that these relationships have in our lives can not easily be measured.",
                    "author": "Teejaynj",
                    "id": "gew7iob",
                    "parent_id": "t1_gew2co4",
                    "score": 6,
                    "created_utc": 1607302260.0,
                    "replies": [
                        {
                            "body": "Well said sir.",
                            "author": "DFWCouple4SB",
                            "id": "gew7mc8",
                            "parent_id": "t1_gew7iob",
                            "score": 6,
                            "created_utc": 1607302316.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can't update my will to take care of my SB. We've been together 6 years. But I'm going to check with the lawyer who prepared the will to see if I could write a separate letter that would leave something substantial for her in case something unexpected happens. I'm hoping I can do something legally binding without modifying the will.",
            "author": "longknight8883",
            "id": "gewmp92",
            "parent_id": "t3_k80jdj",
            "score": 11,
            "created_utc": 1607310775.0,
            "replies": [
                {
                    "body": "I’m sure there is something you can set up, even if it’s a CD in her name she can access if something happens to you. That is very thoughtful of you.",
                    "author": "FoxyFreckles1989",
                    "id": "gewrn6z",
                    "parent_id": "t1_gewmp92",
                    "score": 3,
                    "created_utc": 1607313752.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sending you hugs. And hey, don't feel guilty for doubting him because it's natural. You were mature through all of this because you didn't send the \"how could you\" text even though you wanted to and in hindsight, a good decision. Take time to heal and for self-care.",
            "author": "InnocentSweetTooth",
            "id": "gevz6ps",
            "parent_id": "t3_k80jdj",
            "score": 12,
            "created_utc": 1607297874.0,
            "replies": [
                {
                    "body": "Thanks for that. Really.",
                    "author": "FoxyFreckles1989",
                    "id": "gew7q17",
                    "parent_id": "t1_gevz6ps",
                    "score": 3,
                    "created_utc": 1607302375.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh no, I'm so very sorry. :(",
            "author": "mraspencer",
            "id": "gev6tee",
            "parent_id": "t3_k80jdj",
            "score": 7,
            "created_utc": 1607284091.0,
            "replies": [
                {
                    "body": "Thank you.",
                    "author": "FoxyFreckles1989",
                    "id": "gevcbcc",
                    "parent_id": "t1_gev6tee",
                    "score": 2,
                    "created_utc": 1607286551.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hey lady, \nIm going through the same thing. I actually made a post about it on here not too long ago. I'm so sorry you have to go through this too. We meet these beautiful people in our lives and the cruel unfortunate truth is they can be taken away from us any second. I forgot where I read this or heard this but it said  grief is a small price to pay for the happiness they brought you in life. Things will get better. I'm thinking of you in this hard time. Again please feel free to message me.",
            "author": "veronicagoodday",
            "id": "gewnyjo",
            "parent_id": "t3_k80jdj",
            "score": 7,
            "created_utc": 1607311512.0,
            "replies": [
                {
                    "body": "I’m so very sorry that you lost someone, too. It’s such a strange thing, this kind of mourning. I have a vanilla partner of three years that I love to pieces (whom was aware of my SR and the SD was aware of my partner). It isn’t like I’m alone, but it still feels like a piece of me is gone. It’s almost like I’m grieving someone that wasn’t really mine, which makes the grief a little confusing and harder to get under control. I also feel everything really deeply, am seriously empathic and just overall emotionally in touch as a person, which is useful a lot of the time but makes this kind of thing more painful in general. I also know my SD had another SB and I know nothing about how to reach her or whether or not she knows. She was more of a now and then fling that he had, but sounded like a sweet girl. I’m sure she’s wondering if he’s okay as well. Maybe she’ll see this post and recognize familiarities and message me. Ugh.",
                    "author": "FoxyFreckles1989",
                    "id": "gewretc",
                    "parent_id": "t1_gewnyjo",
                    "score": 4,
                    "created_utc": 1607313609.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gevjn0p",
            "parent_id": "t3_k80jdj",
            "score": 13,
            "created_utc": 1607289971.0,
            "replies": [
                {
                    "body": "Please do. It was so painful wondering what had happened for three weeks, and even more so to find out after the services were done. ❤️",
                    "author": "FoxyFreckles1989",
                    "id": "gevljz2",
                    "parent_id": "t1_gevjn0p",
                    "score": 5,
                    "created_utc": 1607290903.0,
                    "replies": [
                        {
                            "body": "I definitely will. Thanks",
                            "author": null,
                            "id": "gew3mq0",
                            "parent_id": "t1_gevljz2",
                            "score": 3,
                            "created_utc": 1607300150.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gev87ia",
            "parent_id": "t3_k80jdj",
            "score": 4,
            "created_utc": 1607284555.0,
            "replies": [
                {
                    "body": "Thank you.",
                    "author": "FoxyFreckles1989",
                    "id": "gevcayf",
                    "parent_id": "t1_gev87ia",
                    "score": 2,
                    "created_utc": 1607286546.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So sorry for your loss🙏🏾",
            "author": null,
            "id": "gevknzw",
            "parent_id": "t3_k80jdj",
            "score": 5,
            "created_utc": 1607290470.0,
            "replies": []
        },
        {
            "body": "My Biggest fear in the bowl. I’m so sorry you’re dealing with this. Take care of yourself, and if you need and ear or shoulder please don’t hesitate to reach out ♥️",
            "author": "sweetXsubmissiveSB",
            "id": "gew5hu8",
            "parent_id": "t3_k80jdj",
            "score": 6,
            "created_utc": 1607301132.0,
            "replies": [
                {
                    "body": "Thanks, babe.",
                    "author": "FoxyFreckles1989",
                    "id": "gew7j9w",
                    "parent_id": "t1_gew5hu8",
                    "score": 2,
                    "created_utc": 1607302269.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ughh, I'm so sorry to hear this but when I read your original post this was my immediate gut feeling.   Based on what you had written,  and the fact that you were in touch (mid conversation) with presumably no major SR issues and had been together for awhile, it seemed highly unlikely he would flat out ghost.  Ghosting is a thing in this world but very rarely under the above circumstances.\n\nYou mentioned that you felt bad for his family, friends,  etc. but YOU were an important part of his life as well.  You lost someone suddenly that mattered to you and that's difficult.  Not a SR thing, but I lost a close friend (45yo, fit as a 20 something) to a sudden cardiac arrest in July. All deaths are very difficult but sudden, unexpected deaths are even more so in my opinion.   Allow yourself to mourn this loss.  If you can, visit his gravesite if there is one and talk to him.  Whatever helps you move on.  Just take comfort in the fact that you brightened his life while you were in it.",
            "author": "Mister_BossMan",
            "id": "gey9njq",
            "parent_id": "t3_k80jdj",
            "score": 5,
            "created_utc": 1607356970.0,
            "replies": [
                {
                    "body": "I’m sincerely sorry about your friend. If it helps, I can assure you from experience that the way they died is peaceful. You just sorta... go. No pain. \n\nThank you for that. I think this is all triggering the incredibly sudden loss of my own dad in 2010, and with the holidays and everything, I’m just numb.",
                    "author": "FoxyFreckles1989",
                    "id": "gey9zav",
                    "parent_id": "t1_gey9njq",
                    "score": 2,
                    "created_utc": 1607357136.0,
                    "replies": [
                        {
                            "body": "I'm so sorry to hear that and I'm sure you are right.   That's extremely traumatic for anyone.  And it's very insightful of you to recognize as well.  I lost my dad several years ago to Parkinson's so had plenty of time to say goodbye but losing a parent is very hard.  And sudden deaths are extremely difficult for the loved ones left (though I'd prefer to go this way when my time is up but I'd be the one going, not left lol). I sense you are very self aware and will be just fine.  There is no shortcut to morning a loss, we all do it a bit differently.  Just allow yourself time to process this so you can move on with great memories.",
                            "author": "Mister_BossMan",
                            "id": "geydr66",
                            "parent_id": "t1_gey9zav",
                            "score": 2,
                            "created_utc": 1607358999.0,
                            "replies": [
                                {
                                    "body": "Thank you. My dad died when his house burned down in 2010. He went to bed early that night and never woke up. The suddenness absolutely made it harder, and this event is 100% triggering that, as well as being upsetting all on its own. I’m doing my best to honor my emotions and just let them exist. I appreciate your kind words. A lot.",
                                    "author": "FoxyFreckles1989",
                                    "id": "geyfj5n",
                                    "parent_id": "t1_geydr66",
                                    "score": 2,
                                    "created_utc": 1607359864.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am so sorry for your loss.\n\nMy thoughts and prayers are with you - I hope that in time, you will find a way to deal with the grief and have the happy life your partner would have wished for you.",
            "author": "GDarn",
            "id": "gevkx9r",
            "parent_id": "t3_k80jdj",
            "score": 4,
            "created_utc": 1607290598.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gewnv2a",
            "parent_id": "t3_k80jdj",
            "score": 5,
            "created_utc": 1607311457.0,
            "replies": [
                {
                    "body": "I’m so sorry you had to find out something like that in such a harsh way!!! I am glad you’re going to talk to your current SD about plans for such a tragedy. It’s a conversation most of us probably don’t want to have, but should.",
                    "author": "FoxyFreckles1989",
                    "id": "gewrkht",
                    "parent_id": "t1_gewnv2a",
                    "score": 4,
                    "created_utc": 1607313706.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Damn...",
            "author": "BGDDDY1",
            "id": "gev78ny",
            "parent_id": "t3_k80jdj",
            "score": 3,
            "created_utc": 1607284227.0,
            "replies": []
        },
        {
            "body": "Wow I pray you find peace",
            "author": "ItsOnlyRizzy",
            "id": "gevfswo",
            "parent_id": "t3_k80jdj",
            "score": 3,
            "created_utc": 1607288198.0,
            "replies": []
        },
        {
            "body": "That's heartbreaking. Very sorry for your loss.",
            "author": "SugarandSunshineFLA",
            "id": "gew4q20",
            "parent_id": "t3_k80jdj",
            "score": 3,
            "created_utc": 1607300717.0,
            "replies": []
        },
        {
            "body": "I am so, so sorry to hear that. Take some solace in the light you brought to each other's worlds while you had the opportunity, and give yourself time and space to grieve and process this tragic loss. Be well.",
            "author": "roscoe7585",
            "id": "gewaoqk",
            "parent_id": "t3_k80jdj",
            "score": 3,
            "created_utc": 1607304048.0,
            "replies": []
        },
        {
            "body": "I’m very sorry for the loss.",
            "author": "sunlightonthewater",
            "id": "gevmzyz",
            "parent_id": "t3_k80jdj",
            "score": 2,
            "created_utc": 1607291610.0,
            "replies": []
        },
        {
            "body": "I am so, so sorry. It breaks my heart to hear this.",
            "author": "helios4fun",
            "id": "gevzfvw",
            "parent_id": "t3_k80jdj",
            "score": 2,
            "created_utc": 1607298006.0,
            "replies": []
        },
        {
            "body": "Keeping you in my thoughts. All will be better with time",
            "author": null,
            "id": "gevzthk",
            "parent_id": "t3_k80jdj",
            "score": 2,
            "created_utc": 1607298208.0,
            "replies": []
        },
        {
            "body": "Sending you some love. That is a terrible loss and I’m so sorry.",
            "author": "urbanhippy123",
            "id": "gew3im5",
            "parent_id": "t3_k80jdj",
            "score": 2,
            "created_utc": 1607300089.0,
            "replies": []
        },
        {
            "body": "I’m so sorry for your loss",
            "author": "Pyt_jaja",
            "id": "gewa44c",
            "parent_id": "t3_k80jdj",
            "score": 2,
            "created_utc": 1607303729.0,
            "replies": []
        },
        {
            "body": "Sending you lots of love",
            "author": "w4termelonsug4r",
            "id": "gewdic2",
            "parent_id": "t3_k80jdj",
            "score": 2,
            "created_utc": 1607305631.0,
            "replies": []
        },
        {
            "body": "I'm very sorry for your lost.",
            "author": "NeitherStranger_976",
            "id": "gewklbg",
            "parent_id": "t3_k80jdj",
            "score": 2,
            "created_utc": 1607309560.0,
            "replies": []
        },
        {
            "body": "So sorry for your loss. Please, do honour yourself.",
            "author": "chakrub",
            "id": "gewkm11",
            "parent_id": "t3_k80jdj",
            "score": 2,
            "created_utc": 1607309571.0,
            "replies": []
        },
        {
            "body": "I'm very sorry for your loss. I'm sure you were closer to him than many of his relatives.",
            "author": "longknight8883",
            "id": "gewmlad",
            "parent_id": "t3_k80jdj",
            "score": 2,
            "created_utc": 1607310709.0,
            "replies": []
        },
        {
            "body": "I’m so sorry about your loss 😢",
            "author": "xoJadeEclipsexo",
            "id": "gewpy8b",
            "parent_id": "t3_k80jdj",
            "score": 2,
            "created_utc": 1607312713.0,
            "replies": []
        },
        {
            "body": "This brought tears to my eyes, that is so sad and I’m so sorry for your loss.",
            "author": null,
            "id": "gewqas4",
            "parent_id": "t3_k80jdj",
            "score": 2,
            "created_utc": 1607312928.0,
            "replies": []
        },
        {
            "body": "Prayers, healing vibes, and huge *hugs*",
            "author": "Layla_Fox2",
            "id": "gexupxg",
            "parent_id": "t3_k80jdj",
            "score": 2,
            "created_utc": 1607348420.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gev8hpe",
            "parent_id": "t3_k80jdj",
            "score": 3,
            "created_utc": 1607284694.0,
            "replies": [
                {
                    "body": "Thank you.",
                    "author": "FoxyFreckles1989",
                    "id": "gevcala",
                    "parent_id": "t1_gev8hpe",
                    "score": 1,
                    "created_utc": 1607286541.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Im sorry. If you need somone to vent or talk to im here",
            "author": null,
            "id": "gev76zu",
            "parent_id": "t3_k80jdj",
            "score": 2,
            "created_utc": 1607284212.0,
            "replies": [
                {
                    "body": "Thank you.",
                    "author": "FoxyFreckles1989",
                    "id": "gevc9wc",
                    "parent_id": "t1_gev76zu",
                    "score": 2,
                    "created_utc": 1607286531.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So sorry for you",
            "author": "dontcallmechristian",
            "id": "gev9n3t",
            "parent_id": "t3_k80jdj",
            "score": 1,
            "created_utc": 1607285248.0,
            "replies": [
                {
                    "body": "Thank you.",
                    "author": "FoxyFreckles1989",
                    "id": "gevca8w",
                    "parent_id": "t1_gev9n3t",
                    "score": 0,
                    "created_utc": 1607286536.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's terrible, I'm so sorry to hear.\n\nMaybe you could write a letter to his niece sympathizing.  Or if you don't feel that's appropriate, write a letter and don't send it (simply process your own grief).",
            "author": "throwawayrdu71",
            "id": "gewcjrq",
            "parent_id": "t3_k80jdj",
            "score": 1,
            "created_utc": 1607305088.0,
            "replies": []
        },
        {
            "body": "I'm so sorry to read this post and have read similar posts here just in the last few weeks. We are all here for a short while, all we have are memories to take with us. I hope you find solace in the fact that you meant a lot to him in his last months on earth and brought him a lot of happiness and joy.   \n\n\nBe well.",
            "author": "ExExpectations",
            "id": "geyalsx",
            "parent_id": "t3_k80jdj",
            "score": 1,
            "created_utc": 1607357449.0,
            "replies": []
        },
        {
            "body": "My ex SD got mad at me when I asked if he had a friend who could contact me should he end up in the hospital. He said I was just as likely as him to die (he was 59 at the time), and I said regardless I’d feel bettter knowing someone could loop me in. After a 3 day argument he conceded. I’m glad you are proactive about it.",
            "author": "urbanhippy123",
            "id": "gew3d7s",
            "parent_id": "t1_geva3z5",
            "score": 33,
            "created_utc": 1607300011.0,
            "replies": []
        },
        {
            "body": "That is a really decent thing of you to do.",
            "author": "FoxyFreckles1989",
            "id": "gevc8xq",
            "parent_id": "t1_geva3z5",
            "score": 28,
            "created_utc": 1607286519.0,
            "replies": [
                {
                    "body": "Some years ago my then long term SB announced that was staying overnight and driving me to the hospital where I had a zero dark thirty arrival time for low risk surgery.  A male friend (retired USAF col)   would come to get me late morning.  My SB lived across LA and her (she and partner) entrepreneurial startup needed her for another 18 hour day and she would start 3 hours late. \n\nI came back to consciousness to a very bright light and very intrusive questioning   what's my name, what's 5 x 7 ......  my groggy brain knew they would not be asking these questions unless my heart had stopped.  It was just as the plastic surgeon  was packing up his gear and taking photos of his handiwork. \n\nAfter an hour or so they shipped me off  observation and monitoring. My cardiologist stopped by and I got some much needed sleep....  \n\nWhen I woke my SB and friend were sitting by my bed quietly talking. Unknown to me she had parked after she dropped me off, snuck in and had the desk add her name and number as a contact. My friend had never met her but was the one person who knew of the relationship. \n\nOur 5 year sugar relationship ended when she started a serious IRL relationship.  My most treasured Christmas gift last year was a card with a long note from her expressing her continued thanks for the wonderful relationship and how it benefited her.",
                    "author": "pinotandsugar",
                    "id": "gf212nq",
                    "parent_id": "t1_gevc8xq",
                    "score": 8,
                    "created_utc": 1607438292.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I always thought I was crazy for thinking this. It’s really a considerate thing to do",
            "author": null,
            "id": "gevkmq9",
            "parent_id": "t1_geva3z5",
            "score": 14,
            "created_utc": 1607290453.0,
            "replies": [
                {
                    "body": "Not crazy!  I was doing that before I ever read slf, but this isn't the first heartbreaking \"haven't heard from my SD in weeks\" story I've read on slf.",
                    "author": "Azurecole",
                    "id": "gevr702",
                    "parent_id": "t1_gevkmq9",
                    "score": 9,
                    "created_utc": 1607293742.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I will do this today.. thanks for the idea..  but this raises another question.. a rather morbid one at that.. I have a wife and family and they dont know about my SRs.  I meet my 3 of my SBs in hotel and one in her apt.  what I die there ?  I know it may be stupid question.. but is there a way to avoid family knowing that you died while with an SB?",
            "author": "rect1977",
            "id": "gevtam1",
            "parent_id": "t1_geva3z5",
            "score": -6,
            "created_utc": 1607294836.0,
            "replies": [
                {
                    "body": "I’m sorry to say, but. This thread is about the death of my SD, not advice on how to cover up your own SRs once you’re dead. Maybe I’m over sensitive right now, but I feel like your questions are inappropriate here.",
                    "author": "FoxyFreckles1989",
                    "id": "gexcour",
                    "parent_id": "t1_gevtam1",
                    "score": 15,
                    "created_utc": 1607330918.0,
                    "replies": []
                },
                {
                    "body": "No. Not really.",
                    "author": "SpectraLPN",
                    "id": "gew1cre",
                    "parent_id": "t1_gevtam1",
                    "score": 8,
                    "created_utc": 1607299000.0,
                    "replies": []
                },
                {
                    "body": "You could try not being a cheating fuckhead. That would prevent you from ever having to worry about it!",
                    "author": "ulose2piranha",
                    "id": "grnh7wm",
                    "parent_id": "t1_gevtam1",
                    "score": 1,
                    "created_utc": 1616287640.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Actually, that *did* help a little bit just now. Thank you for giving me a different perspective to consider.",
            "author": "FoxyFreckles1989",
            "id": "gew378k",
            "parent_id": "t1_gew2co4",
            "score": 16,
            "created_utc": 1607299929.0,
            "replies": [
                {
                    "body": "You’re welcome.  Good luck healing.",
                    "author": "DFWCouple4SB",
                    "id": "gew3myl",
                    "parent_id": "t1_gew378k",
                    "score": 5,
                    "created_utc": 1607300154.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is a great thought. It seems so appropriate in this case. The impact and importance that these relationships have in our lives can not easily be measured.",
            "author": "Teejaynj",
            "id": "gew7iob",
            "parent_id": "t1_gew2co4",
            "score": 6,
            "created_utc": 1607302260.0,
            "replies": [
                {
                    "body": "Well said sir.",
                    "author": "DFWCouple4SB",
                    "id": "gew7mc8",
                    "parent_id": "t1_gew7iob",
                    "score": 6,
                    "created_utc": 1607302316.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m sure there is something you can set up, even if it’s a CD in her name she can access if something happens to you. That is very thoughtful of you.",
            "author": "FoxyFreckles1989",
            "id": "gewrn6z",
            "parent_id": "t1_gewmp92",
            "score": 3,
            "created_utc": 1607313752.0,
            "replies": []
        },
        {
            "body": "Thanks for that. Really.",
            "author": "FoxyFreckles1989",
            "id": "gew7q17",
            "parent_id": "t1_gevz6ps",
            "score": 3,
            "created_utc": 1607302375.0,
            "replies": []
        },
        {
            "body": "Thank you.",
            "author": "FoxyFreckles1989",
            "id": "gevcbcc",
            "parent_id": "t1_gev6tee",
            "score": 2,
            "created_utc": 1607286551.0,
            "replies": []
        },
        {
            "body": "I’m so very sorry that you lost someone, too. It’s such a strange thing, this kind of mourning. I have a vanilla partner of three years that I love to pieces (whom was aware of my SR and the SD was aware of my partner). It isn’t like I’m alone, but it still feels like a piece of me is gone. It’s almost like I’m grieving someone that wasn’t really mine, which makes the grief a little confusing and harder to get under control. I also feel everything really deeply, am seriously empathic and just overall emotionally in touch as a person, which is useful a lot of the time but makes this kind of thing more painful in general. I also know my SD had another SB and I know nothing about how to reach her or whether or not she knows. She was more of a now and then fling that he had, but sounded like a sweet girl. I’m sure she’s wondering if he’s okay as well. Maybe she’ll see this post and recognize familiarities and message me. Ugh.",
            "author": "FoxyFreckles1989",
            "id": "gewretc",
            "parent_id": "t1_gewnyjo",
            "score": 4,
            "created_utc": 1607313609.0,
            "replies": []
        },
        {
            "body": "Please do. It was so painful wondering what had happened for three weeks, and even more so to find out after the services were done. ❤️",
            "author": "FoxyFreckles1989",
            "id": "gevljz2",
            "parent_id": "t1_gevjn0p",
            "score": 5,
            "created_utc": 1607290903.0,
            "replies": [
                {
                    "body": "I definitely will. Thanks",
                    "author": null,
                    "id": "gew3mq0",
                    "parent_id": "t1_gevljz2",
                    "score": 3,
                    "created_utc": 1607300150.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you.",
            "author": "FoxyFreckles1989",
            "id": "gevcayf",
            "parent_id": "t1_gev87ia",
            "score": 2,
            "created_utc": 1607286546.0,
            "replies": []
        },
        {
            "body": "Thanks, babe.",
            "author": "FoxyFreckles1989",
            "id": "gew7j9w",
            "parent_id": "t1_gew5hu8",
            "score": 2,
            "created_utc": 1607302269.0,
            "replies": []
        },
        {
            "body": "I’m sincerely sorry about your friend. If it helps, I can assure you from experience that the way they died is peaceful. You just sorta... go. No pain. \n\nThank you for that. I think this is all triggering the incredibly sudden loss of my own dad in 2010, and with the holidays and everything, I’m just numb.",
            "author": "FoxyFreckles1989",
            "id": "gey9zav",
            "parent_id": "t1_gey9njq",
            "score": 2,
            "created_utc": 1607357136.0,
            "replies": [
                {
                    "body": "I'm so sorry to hear that and I'm sure you are right.   That's extremely traumatic for anyone.  And it's very insightful of you to recognize as well.  I lost my dad several years ago to Parkinson's so had plenty of time to say goodbye but losing a parent is very hard.  And sudden deaths are extremely difficult for the loved ones left (though I'd prefer to go this way when my time is up but I'd be the one going, not left lol). I sense you are very self aware and will be just fine.  There is no shortcut to morning a loss, we all do it a bit differently.  Just allow yourself time to process this so you can move on with great memories.",
                    "author": "Mister_BossMan",
                    "id": "geydr66",
                    "parent_id": "t1_gey9zav",
                    "score": 2,
                    "created_utc": 1607358999.0,
                    "replies": [
                        {
                            "body": "Thank you. My dad died when his house burned down in 2010. He went to bed early that night and never woke up. The suddenness absolutely made it harder, and this event is 100% triggering that, as well as being upsetting all on its own. I’m doing my best to honor my emotions and just let them exist. I appreciate your kind words. A lot.",
                            "author": "FoxyFreckles1989",
                            "id": "geyfj5n",
                            "parent_id": "t1_geydr66",
                            "score": 2,
                            "created_utc": 1607359864.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m so sorry you had to find out something like that in such a harsh way!!! I am glad you’re going to talk to your current SD about plans for such a tragedy. It’s a conversation most of us probably don’t want to have, but should.",
            "author": "FoxyFreckles1989",
            "id": "gewrkht",
            "parent_id": "t1_gewnv2a",
            "score": 4,
            "created_utc": 1607313706.0,
            "replies": []
        },
        {
            "body": "Thank you.",
            "author": "FoxyFreckles1989",
            "id": "gevcala",
            "parent_id": "t1_gev8hpe",
            "score": 1,
            "created_utc": 1607286541.0,
            "replies": []
        },
        {
            "body": "Thank you.",
            "author": "FoxyFreckles1989",
            "id": "gevc9wc",
            "parent_id": "t1_gev76zu",
            "score": 2,
            "created_utc": 1607286531.0,
            "replies": []
        },
        {
            "body": "Thank you.",
            "author": "FoxyFreckles1989",
            "id": "gevca8w",
            "parent_id": "t1_gev9n3t",
            "score": 0,
            "created_utc": 1607286536.0,
            "replies": []
        },
        {
            "body": "Some years ago my then long term SB announced that was staying overnight and driving me to the hospital where I had a zero dark thirty arrival time for low risk surgery.  A male friend (retired USAF col)   would come to get me late morning.  My SB lived across LA and her (she and partner) entrepreneurial startup needed her for another 18 hour day and she would start 3 hours late. \n\nI came back to consciousness to a very bright light and very intrusive questioning   what's my name, what's 5 x 7 ......  my groggy brain knew they would not be asking these questions unless my heart had stopped.  It was just as the plastic surgeon  was packing up his gear and taking photos of his handiwork. \n\nAfter an hour or so they shipped me off  observation and monitoring. My cardiologist stopped by and I got some much needed sleep....  \n\nWhen I woke my SB and friend were sitting by my bed quietly talking. Unknown to me she had parked after she dropped me off, snuck in and had the desk add her name and number as a contact. My friend had never met her but was the one person who knew of the relationship. \n\nOur 5 year sugar relationship ended when she started a serious IRL relationship.  My most treasured Christmas gift last year was a card with a long note from her expressing her continued thanks for the wonderful relationship and how it benefited her.",
            "author": "pinotandsugar",
            "id": "gf212nq",
            "parent_id": "t1_gevc8xq",
            "score": 8,
            "created_utc": 1607438292.0,
            "replies": []
        },
        {
            "body": "Not crazy!  I was doing that before I ever read slf, but this isn't the first heartbreaking \"haven't heard from my SD in weeks\" story I've read on slf.",
            "author": "Azurecole",
            "id": "gevr702",
            "parent_id": "t1_gevkmq9",
            "score": 9,
            "created_utc": 1607293742.0,
            "replies": []
        },
        {
            "body": "I’m sorry to say, but. This thread is about the death of my SD, not advice on how to cover up your own SRs once you’re dead. Maybe I’m over sensitive right now, but I feel like your questions are inappropriate here.",
            "author": "FoxyFreckles1989",
            "id": "gexcour",
            "parent_id": "t1_gevtam1",
            "score": 15,
            "created_utc": 1607330918.0,
            "replies": []
        },
        {
            "body": "No. Not really.",
            "author": "SpectraLPN",
            "id": "gew1cre",
            "parent_id": "t1_gevtam1",
            "score": 8,
            "created_utc": 1607299000.0,
            "replies": []
        },
        {
            "body": "You could try not being a cheating fuckhead. That would prevent you from ever having to worry about it!",
            "author": "ulose2piranha",
            "id": "grnh7wm",
            "parent_id": "t1_gevtam1",
            "score": 1,
            "created_utc": 1616287640.0,
            "replies": []
        },
        {
            "body": "You’re welcome.  Good luck healing.",
            "author": "DFWCouple4SB",
            "id": "gew3myl",
            "parent_id": "t1_gew378k",
            "score": 5,
            "created_utc": 1607300154.0,
            "replies": []
        },
        {
            "body": "Well said sir.",
            "author": "DFWCouple4SB",
            "id": "gew7mc8",
            "parent_id": "t1_gew7iob",
            "score": 6,
            "created_utc": 1607302316.0,
            "replies": []
        },
        {
            "body": "I definitely will. Thanks",
            "author": null,
            "id": "gew3mq0",
            "parent_id": "t1_gevljz2",
            "score": 3,
            "created_utc": 1607300150.0,
            "replies": []
        },
        {
            "body": "I'm so sorry to hear that and I'm sure you are right.   That's extremely traumatic for anyone.  And it's very insightful of you to recognize as well.  I lost my dad several years ago to Parkinson's so had plenty of time to say goodbye but losing a parent is very hard.  And sudden deaths are extremely difficult for the loved ones left (though I'd prefer to go this way when my time is up but I'd be the one going, not left lol). I sense you are very self aware and will be just fine.  There is no shortcut to morning a loss, we all do it a bit differently.  Just allow yourself time to process this so you can move on with great memories.",
            "author": "Mister_BossMan",
            "id": "geydr66",
            "parent_id": "t1_gey9zav",
            "score": 2,
            "created_utc": 1607358999.0,
            "replies": [
                {
                    "body": "Thank you. My dad died when his house burned down in 2010. He went to bed early that night and never woke up. The suddenness absolutely made it harder, and this event is 100% triggering that, as well as being upsetting all on its own. I’m doing my best to honor my emotions and just let them exist. I appreciate your kind words. A lot.",
                    "author": "FoxyFreckles1989",
                    "id": "geyfj5n",
                    "parent_id": "t1_geydr66",
                    "score": 2,
                    "created_utc": 1607359864.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you. My dad died when his house burned down in 2010. He went to bed early that night and never woke up. The suddenness absolutely made it harder, and this event is 100% triggering that, as well as being upsetting all on its own. I’m doing my best to honor my emotions and just let them exist. I appreciate your kind words. A lot.",
            "author": "FoxyFreckles1989",
            "id": "geyfj5n",
            "parent_id": "t1_geydr66",
            "score": 2,
            "created_utc": 1607359864.0,
            "replies": []
        }
    ]
}