{
    "title": "Stop saying that SBs who aren’t attracted to their SDs “should just be escorts instead”",
    "post_id": "t46wh7",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/t46wh7/stop_saying_that_sbs_who_arent_attracted_to_their/",
    "author": null,
    "body": "“SBs who aren’t attracted to their SDs should just go be escorts, because a sugar relationship is supposed to be like a real relationship and you can make more money escorting.” I’ve seen this sentiment multiple times on this board and it’s willfully ignorant. Not everything is about money. Escorts regularly have sex with random dudes they don’t know, an activity that runs an extremely high risk of being raped/murdered/abused/catching STDs. The advantage of a sugar relationship is that you know and trust the person you are sleeping with. Not everyone wants to put their life on the line. \n\nExpecting all SBs to be genuinely attracted to their SDs is insanely unrealistic, and no, it’s not at all “like a real relationship” for many people. Many people, both SDs and SBs, are looking for NSA relationships, and it’s not your place to say those “aren’t real sugar relationships.”",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/t46wh7/stop_saying_that_sbs_who_arent_attracted_to_their/",
    "score": 98,
    "upvote_ratio": 0.78,
    "created_utc": 1646137922.0,
    "num_comments": 71,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "hywlmea",
            "parent_id": "t3_t46wh7",
            "score": 89,
            "created_utc": 1646138662.0,
            "replies": [
                {
                    "body": "This. OP clearly doesn’t understand the difference between an escort and a prostitute. There are escorts with multiple regulars and they can limit their intimacy strictly to that set of regulars, if they choose. Having intimacy with multiple strange men is not the norm for a lot of them. The “many people” you speak of, fit that bill.\n\nThere’s a girl on YouTube who calls herself an SB but she’s an escort with regulars (she says SB for views). If you look on her website, the veil gets lifted as she advertises as an escort. She only takes new clients when she chooses and also has a close relationship with one of the guys and he calls her his SGF.\n\nSo while you’re making this post for them to stop saying that, there’s a reason they are. The bottom line is, there’s very little reason for an SD to stay with you if there isn’t a genuine attraction and solid relationship. There’s far too many other options out there for them.",
                    "author": "TX_SB",
                    "id": "hywnsgo",
                    "parent_id": "t1_hywlmea",
                    "score": 36,
                    "created_utc": 1646139901.0,
                    "replies": [
                        {
                            "body": "The reason is, again, that you know and trust the person and would rather not be having this type of dynamic with multiple people and having to vet new “clients.” You might also want to do things with your SD other than just have sex—talk, go on outings, just hang out—rather than having an entirely sex-based relationship. None of these things require a genuine attraction.",
                            "author": null,
                            "id": "hywoctj",
                            "parent_id": "t1_hywnsgo",
                            "score": -5,
                            "created_utc": 1646140214.0,
                            "replies": [
                                {
                                    "body": "Escorts get to know and trust their clients. Heck in their screening process they know WAY more upfront about them than any SB would about a POT SD. \n\n>*You might also want to do things with your SD other than just have sex—talk, go on outings, just hang out—rather than having an entirely sex-based relationship. None of these things require a genuine attraction.*\n\nIf an SD wants a genuine connection and not a friend to hang out with, they do.",
                                    "author": "TX_SB",
                                    "id": "hywoje2",
                                    "parent_id": "t1_hywoctj",
                                    "score": 18,
                                    "created_utc": 1646140313.0,
                                    "replies": [
                                        {
                                            "body": "Excellent replies. These are accurate insights into escorts.",
                                            "author": "JohnnyKemmer009",
                                            "id": "hyxgr3s",
                                            "parent_id": "t1_hywoje2",
                                            "score": 2,
                                            "created_utc": 1646152817.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Excellent replies. These are accurate insights into escorts.",
                                            "author": "JohnnyKemmer009",
                                            "id": "hyxgszd",
                                            "parent_id": "t1_hywoje2",
                                            "score": 2,
                                            "created_utc": 1646152837.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hywosj1",
                                            "parent_id": "t1_hywoje2",
                                            "score": 0,
                                            "created_utc": 1646140456.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "It doesn’t matter though. When multiple people are involved, your risk of STDs, as well as your risk of something going wrong and someone you thought you “trusted” becoming abusive, increases a hundredfold. I already don’t know if my SD is having sex with other people. Why would I increase my risk by having multiple “clients”?",
                                            "author": null,
                                            "id": "hywp8qa",
                                            "parent_id": "t1_hywoje2",
                                            "score": -15,
                                            "created_utc": 1646140701.0,
                                            "replies": [
                                                {
                                                    "body": "I’m not sure why you’re debating with me. Is it because I’m a female? You said nothing to the men who made the exact same comment that I did. Let’s agree to disagree but feel free to defend your position.",
                                                    "author": "TX_SB",
                                                    "id": "hywpjg4",
                                                    "parent_id": "t1_hywp8qa",
                                                    "score": 11,
                                                    "created_utc": 1646140858.0,
                                                    "replies": [
                                                        {
                                                            "body": "I didn’t even know you were female, I didn’t look at your username. I responded to you because it was the most recent comment.",
                                                            "author": null,
                                                            "id": "hywpm0h",
                                                            "parent_id": "t1_hywpjg4",
                                                            "score": -2,
                                                            "created_utc": 1646140896.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "If it talks like a duck, walks like a duck, ...",
                    "author": "TorontoCash",
                    "id": "hywso1z",
                    "parent_id": "t1_hywlmea",
                    "score": 16,
                    "created_utc": 1646142471.0,
                    "replies": []
                },
                {
                    "body": "> A girl who sees multiple guys on the regular for PPM is really no different from an escort.\n\nAgreed 100%",
                    "author": "GSSD",
                    "id": "hywvlre",
                    "parent_id": "t1_hywlmea",
                    "score": 7,
                    "created_utc": 1646143894.0,
                    "replies": []
                },
                {
                    "body": "couldn't have said it better,Thank you xo",
                    "author": "DiscreetlyYours2",
                    "id": "hywzgfv",
                    "parent_id": "t1_hywlmea",
                    "score": 3,
                    "created_utc": 1646145646.0,
                    "replies": []
                },
                {
                    "body": "If you just have one SD whom you see frequently and are not attracted to/wouldn’t vanilla date, that’s not the same as escorting at all, and is still a sugar relationship. I agree that the line is blurred when multiple SDs are involved.",
                    "author": null,
                    "id": "hywnv9u",
                    "parent_id": "t1_hywlmea",
                    "score": 0,
                    "created_utc": 1646139945.0,
                    "replies": [
                        {
                            "body": "As an SD, it’s fairly easy to tell if a woman/SB is faking her attraction and physical interest.  Some SDs may not care, maybe they just want a dick garage and nothing more; all I can tell you is that sexual chemistry is important to me in my SRs, as is sincerity.  If or when I detect that she is just faking any real interest and/or attraction, the magic tends to dissipate rather quickly.",
                            "author": "txjerome",
                            "id": "hyx2429",
                            "parent_id": "t1_hywnv9u",
                            "score": 14,
                            "created_utc": 1646146809.0,
                            "replies": [
                                {
                                    "body": "Well said. I'd double up-vote if I could. Men want affection as part of the experience.",
                                    "author": "JohnnyKemmer009",
                                    "id": "hyxh0pj",
                                    "parent_id": "t1_hyx2429",
                                    "score": 5,
                                    "created_utc": 1646152920.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You make a solid point and I have to agree especially about SBs who see multiple SDs.",
                    "author": null,
                    "id": "hywn0ik",
                    "parent_id": "t1_hywlmea",
                    "score": 0,
                    "created_utc": 1646139463.0,
                    "replies": []
                },
                {
                    "body": "Bullshit.\n\nIts a nice line and all, but an escort will have sex with any guy, unless he's blacklisted or she has a bad experience with him.",
                    "author": "Athensbirds",
                    "id": "hywmgml",
                    "parent_id": "t1_hywlmea",
                    "score": -13,
                    "created_utc": 1646139148.0,
                    "replies": [
                        {
                            "body": "I think the sugar world is filled with men and women who want to be escorts and johns without the label.",
                            "author": "Sugar-Monkey",
                            "id": "hywnr07",
                            "parent_id": "t1_hywmgml",
                            "score": 18,
                            "created_utc": 1646139879.0,
                            "replies": [
                                {
                                    "body": "Nailed it.",
                                    "author": null,
                                    "id": "hyxc15p",
                                    "parent_id": "t1_hywnr07",
                                    "score": 10,
                                    "created_utc": 1646150934.0,
                                    "replies": []
                                },
                                {
                                    "body": "Nah, I disagree.\n\nI'm not saying there aren't SDs and SBs who act like they're escorts and johns, but I think the majority want actual relationships with people who give a shit about them.\n\nJust about any SB even if she's on PPM could have an actual emergency, message her SD, and ask for help. Most of the time she'd get help, unless she had a habit of abusing the guy's good will. (The help she'd need might not even be financial in nature).\n\nI very much doubt an escort would call a john for help. Maybe she would/could if she'd had a client for 5-10 years. It's the difference between a FWB and your doctor. A FWB would totally ask you for help moving, your drycleaner wont.\n\nThere is a difference, even in the most transactional SRs, unless the guy is an actual john.",
                                    "author": "Athensbirds",
                                    "id": "hywp02r",
                                    "parent_id": "t1_hywnr07",
                                    "score": -3,
                                    "created_utc": 1646140570.0,
                                    "replies": [
                                        {
                                            "body": "You need to get on YouTube. There’s an absolute example if an escort (openly advertises as an escort) who has regulars she calls on for emergencies, help (hell even one of them walks her dog for her) and calls them her SDs.",
                                            "author": "TX_SB",
                                            "id": "hywqhxz",
                                            "parent_id": "t1_hywp02r",
                                            "score": 10,
                                            "created_utc": 1646141363.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I think you're being naive. Your argument sounds strangely like something I would have said before I had more experience in the sugar bowl. It's such an idealized version of what the sugar world actually is. I'm not saying the type of relationship you describe doesn't exist but it's laughable to think that's what most are seeking and what most find. It's simply not the case.",
                                            "author": "Sugar-Monkey",
                                            "id": "hywqfob",
                                            "parent_id": "t1_hywp02r",
                                            "score": 12,
                                            "created_utc": 1646141330.0,
                                            "replies": [
                                                {
                                                    "body": "Well, I make an effort to filter out people who come across as escorts, so maybe that plays into it.",
                                                    "author": "Athensbirds",
                                                    "id": "hyws3d0",
                                                    "parent_id": "t1_hywqfob",
                                                    "score": -3,
                                                    "created_utc": 1646142182.0,
                                                    "replies": [
                                                        {
                                                            "body": "Maybe you're right. I don't know but I do know that a lot of the women who market themselves as the ideal version of an SB aren't really being truthful about what they're doing behind the scenes. The same goes for SDs. I don't want to make this out as an issue for only one side.",
                                                            "author": "Sugar-Monkey",
                                                            "id": "hywsoqn",
                                                            "parent_id": "t1_hyws3d0",
                                                            "score": 9,
                                                            "created_utc": 1646142480.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": ">Just about any SB even if she's on PPM could have an actual emergency, message her SD, and ask for help. Most of the time she'd get help, unless she had a habit of abusing the guy's good will. (The help she'd need might not even be financial in nature).\n\nThis is a good point. If my SB called or texted me that she needed a ride because of car trouble, I'd help out and give her a ride. And I'm sure she would do the same for me. \n\nThat's not something I would expect in an escort-john relationship. But maybe I'm wrong.",
                                            "author": "BinghamtonSD",
                                            "id": "hyx5rfm",
                                            "parent_id": "t1_hywp02r",
                                            "score": 2,
                                            "created_utc": 1646148358.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">  but an escort will have sex with any guy\n\nThat is *literally* not true. I know people like to believe that, but anyone who is familiar with the world of SWs know that's not even close to being true. Some are certainly less discriminating than others, but they learn quickly to trust their gut when it comes to deciding who they'll engage with.",
                            "author": "Y_4Z44",
                            "id": "hyxfajs",
                            "parent_id": "t1_hywmgml",
                            "score": 13,
                            "created_utc": 1646152242.0,
                            "replies": []
                        },
                        {
                            "body": "Now you’re speaking for all escorts?",
                            "author": "TX_SB",
                            "id": "hywq4ss",
                            "parent_id": "t1_hywmgml",
                            "score": 12,
                            "created_utc": 1646141172.0,
                            "replies": [
                                {
                                    "body": "Call a hundred, see what percentage say no.",
                                    "author": "Athensbirds",
                                    "id": "hywrpk2",
                                    "parent_id": "t1_hywq4ss",
                                    "score": -1,
                                    "created_utc": 1646141986.0,
                                    "replies": [
                                        {
                                            "body": "If I was one and you called me, I would say no.",
                                            "author": "TX_SB",
                                            "id": "hywujcr",
                                            "parent_id": "t1_hywrpk2",
                                            "score": 10,
                                            "created_utc": 1646143383.0,
                                            "replies": [
                                                {
                                                    "body": "I’m falling in love with you lol",
                                                    "author": "Kevinburnz",
                                                    "id": "hywymmj",
                                                    "parent_id": "t1_hywujcr",
                                                    "score": 3,
                                                    "created_utc": 1646145276.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Yeah, but if I found your number in the phone book and called you, you wouldn't know squat about me, you'd say no based on what? Even if you genuinely dislike people like me to your core, how would you know? You wouldn't have a nice long M&G to get to know me, you'd just have me knocking on your hotel room door or vice versa.\n\nKinda proves my point.",
                                                    "author": "Athensbirds",
                                                    "id": "hyx70mi",
                                                    "parent_id": "t1_hywujcr",
                                                    "score": -1,
                                                    "created_utc": 1646148882.0,
                                                    "replies": [
                                                        {
                                                            "body": "The man doth protest too much, methinks. \n\nIt’s entertaining that you don’t understand why I wouldn’t see you.",
                                                            "author": "TX_SB",
                                                            "id": "hyxge36",
                                                            "parent_id": "t1_hyx70mi",
                                                            "score": 9,
                                                            "created_utc": 1646152676.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I have never heard of an escort turning down a man for any reason other than concern he’s LE.   In countries where prostitution is legal, they don’t ask for any information at all. N",
                    "author": "UseTheForceRey",
                    "id": "hywwtze",
                    "parent_id": "t1_hywlmea",
                    "score": -9,
                    "created_utc": 1646144465.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As a SB and escort I find these conversations mind numbing. Escorts talk shit about SB and vice versa, and neither side has any fucking idea what they are talking about 😐😐  fucking dumb",
            "author": "ModdedDoll",
            "id": "hywxnxe",
            "parent_id": "t3_t46wh7",
            "score": 39,
            "created_utc": 1646144839.0,
            "replies": [
                {
                    "body": "Here here!\nI 100 agree!",
                    "author": null,
                    "id": "hyx3nw2",
                    "parent_id": "t1_hywxnxe",
                    "score": 7,
                    "created_utc": 1646147472.0,
                    "replies": []
                },
                {
                    "body": "Same! Was an escort for a couple years on and off :) pros and cons to both - I definitely view both as \"sex work\" in the most non judgemental of ways. You're right that both shit talk the other. All the hate is dumb.\n\nedit: I wanted to add that the experience you have with an escort or a SB is entirely dependent on the woman. Just because a woman is an escort, doesn't mean that she's super cold and interested in only the money. And vice versa.",
                    "author": null,
                    "id": "hyxnhp7",
                    "parent_id": "t1_hywxnxe",
                    "score": 12,
                    "created_utc": 1646155419.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I pick SBs who are attracted to me and I consider myself to be a good looking and attractive guy. My SBs are also older and with 10 - 15 years age gap. \n\nBut that weren’t the case I would not expect the lady to be attracted to me and likely in a few years as I age that will be my mindset. Not every SB ought to be attracted to a guy who is 30 - 50 years older and her doing so should not make her an escort. \n\nTake a stroll in vegas or in Manhattan where plenty of sugar couples hang out and it’s not east to spot then given the glaringly obvious age and looks gap.",
            "author": null,
            "id": "hywmmen",
            "parent_id": "t3_t46wh7",
            "score": 17,
            "created_utc": 1646139240.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hyws4yt",
            "parent_id": "t3_t46wh7",
            "score": 16,
            "created_utc": 1646142204.0,
            "replies": [
                {
                    "body": "I was only somewhat with you to the point where you gave your quote *legal perspective* unquote comparing PPM to escorting. IANAL, but I’m 99.999999% certain that nobody doing PPM discusses services in the context of it’ll be XXX for a HJ, XXX for a BJ, XXX for PIV. That kind of conversation, imho, defines escorting or prostitution. \n\nPlease note I have no axe to grind wrt SWs, I just disagree with your “clear” line.",
                    "author": "Chill_SD1974",
                    "id": "hyww918",
                    "parent_id": "t1_hyws4yt",
                    "score": 4,
                    "created_utc": 1646144196.0,
                    "replies": [
                        {
                            "body": "What you describe is not how escorts operate. Their is no “menu”. That might be how it works in the streets or in a brothel but that is not how a high end GFE escort operates.\n\nTheir is a price defined for time and what happens happens. They will have a yes / no list of activities that they are comfortable with but they don’t have prices for activities.",
                            "author": null,
                            "id": "hyx3kzf",
                            "parent_id": "t1_hyww918",
                            "score": 7,
                            "created_utc": 1646147439.0,
                            "replies": [
                                {
                                    "body": "Agreed that I did not describe a high end escort. I was establishing a definition of prostitution. \n\nThe comment I replied to essentially was *does PPM in and of itself “clearly and legally” define an “SR” as in fact being an escorting situation. I say nope. \n\nOTOH, if a woman calling herself an “SB” told you if you want to be with her it’s gonna be X for every hour you’re together with her, I don’t think that’s an SR. \n\nEven in vanilla dating there’s a point where the daters agree to say goodnight and go home, if they didn’t plan to have a sleepover. \n\n🤷🏻‍♂️",
                                    "author": "Chill_SD1974",
                                    "id": "hyx7i8n",
                                    "parent_id": "t1_hyx3kzf",
                                    "score": 2,
                                    "created_utc": 1646149081.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I believe that as long as the individuals give their informed consent and the arrangement is  mutually beneficial, it is not anyone's else's place to j6dge the nature of their relationship. It is also my belief that sugaring is a form of SW, akin to stripping, web camming, porn creation, and all others. It's an agreement to exchange financial for physical.\n\nWhat i disagree with is the shame and judgment you place on SW. SW itself is not inherently dangerous. The criminalization of SW is what makes it dangerous.  Also,  you would have to define what kind is SW you're are talking about.  Street workers will be more exposed than indoor workers. Research has shown that consensually non monogamous people are more likely to practice safer sex continually and get regular testing. There is no increase in the STD rates between consentually non-monogamous people and monogamous people.  \n\nSugaring, escorts, strippers, OF, porn creators, etc....all are fine if all are providing their informed consent, practicing safer sex, and getting tested regularly.",
            "author": "LadyMorgan2018",
            "id": "hyx14f3",
            "parent_id": "t3_t46wh7",
            "score": 16,
            "created_utc": 1646146378.0,
            "replies": [
                {
                    "body": "Sugaring is sex work in my mind as well. No doubt about it. The stigma around all kinds of SW needs to be demolished.",
                    "author": null,
                    "id": "hyxnaws",
                    "parent_id": "t1_hyx14f3",
                    "score": 17,
                    "created_utc": 1646155346.0,
                    "replies": []
                },
                {
                    "body": "Do you think sugaring or Tinder or going to a club is equally dangerous for women? risks of stealthing, sexual assault/non-consensual activities, PUA?",
                    "author": "daddoms",
                    "id": "hyx4imd",
                    "parent_id": "t1_hyx14f3",
                    "score": 4,
                    "created_utc": 1646147834.0,
                    "replies": [
                        {
                            "body": "That happens regardless of sugar, regardless of venue. 1 in 3 women worldwide experience sexual violence. 1 in 4 in the US alone. This was the basis of the #metoo movement. We are taught from childhood to fear all men unless they have given us a reason not to fear them. It's called \"living while female.\" \n\nhttps://ncadv.org/STATISTICS",
                            "author": "LadyMorgan2018",
                            "id": "hyx5ap1",
                            "parent_id": "t1_hyx4imd",
                            "score": 13,
                            "created_utc": 1646148160.0,
                            "replies": [
                                {
                                    "body": "OP distinguishes SB (when not attracted) vs escort as inherently less dangerous. Is this true?",
                                    "author": "daddoms",
                                    "id": "hyx6lug",
                                    "parent_id": "t1_hyx5ap1",
                                    "score": 0,
                                    "created_utc": 1646148712.0,
                                    "replies": [
                                        {
                                            "body": "It depends on the type of escort. As I mentioned, it's the criminalization that makes SW more dangerous than anything else. \n\nTherefore, the type of SW will determine the exposure. Street workers are inherently more exposed than indoor workers. Higher end escorts are less exposed than lower end-and even many sugar workers. Many SW practice regular safer sex and get tested regularly, so they are as safe, if not more, as any monogamous SB. Then there are other types of SW-like OF, web camming, stripping, and pro-Domme work that is much safer than sugaring-because there is less intimate sexual interaction. \n\nTristan Terimino has an excellent podcast called Sex Out Loud. She's a leader in the sex positive movement. I just finished listening to episode 96, where she had two long time scholars on SW rights were speaking to this very subject.\n https://sexoutloud.libsyn.com/scientists-for-sex-worker-rights-with-barb-and-ron",
                                            "author": "LadyMorgan2018",
                                            "id": "hyx8tbp",
                                            "parent_id": "t1_hyx6lug",
                                            "score": 8,
                                            "created_utc": 1646149621.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think there are too many people on this forum that judge and shame others for acting differently than they do. I don't judge Escorts, Online Only girls, etc. but I'm not looking for an Escort or an Online Only arrangement.  \n\nThe important point is that the best practices for safety, security and success is VERY DIFFERENT for Escorts, Online Only Girls and Sugar Babies.  If someone wants to be an Escort, they should seek advice from Escort forums.  If someone wants to have an online arrangement, they should seek advice from a Cam Girl forum. If they want to be a Sugar Baby, they should seek advice from a Sugar Dating forum. \n\nThe challenge is that the dividing line between Escorting and Sugar Dating can be blurred so the best practices can also be blurry with a blend of both dependent on the type of arrangement.",
            "author": "willfromvb",
            "id": "hywsr0m",
            "parent_id": "t3_t46wh7",
            "score": 17,
            "created_utc": 1646142511.0,
            "replies": []
        },
        {
            "body": "My sugar Babe would not be fucking me. If not for the money.  Does she like me? Yes.  Is she physically attracted to me no. I'm 58 she's 21.  Now if I was fit like Tom Brady and his age.  Even without his money. She would be willing to do me for free.  Now is my girl an escort. Not by any chance.",
            "author": null,
            "id": "hywylm2",
            "parent_id": "t3_t46wh7",
            "score": 7,
            "created_utc": 1646145262.0,
            "replies": []
        },
        {
            "body": "blechhh @ the low key demeaning sentiment towards escorts expressed by OP \n\nif its tinder, hinge, or bumble, or if its eros or slixa, either way you are still risking your life when you go meet a stranger.  Same same.\n\nI agree NSA SRs can and do exist.  They have a place.\n\nHowever - I also feel like this conversation never, ever happens:\n\nSD: I am looking for a lasting arrangement with genuine attraction and a strong emotional connection on both sides.  This is important to me.\n\nSB: Right.  So, about that attraction part.......\n\nAfter a statement like this from an SD, it's typically left to the SD to play Sherlock Holmes and deduce if his SB is walking some kind of fine line where she neither rejects nor accepts what he said he wants and is looking for.",
            "author": "Gemini-Fox",
            "id": "hyxh82o",
            "parent_id": "t3_t46wh7",
            "score": 16,
            "created_utc": 1646153001.0,
            "replies": []
        },
        {
            "body": "This is really a case of “ to each, their own”. I like it when we are in a “relationship”, as you put it. And have rejected people if I didn’t “like” them or felt they were not in the same boat.\n\nOne more thing, I have never known money to come without strings attached.",
            "author": "Bigvee-to",
            "id": "hywn9sv",
            "parent_id": "t3_t46wh7",
            "score": 5,
            "created_utc": 1646139611.0,
            "replies": []
        },
        {
            "body": "Lol I feel like you would have more of a chance catching an STD in the bowl because a lot of SDs are actually johns blacklisted from escorting services. And from the posts I see a lot of these SDs that engage in these forums also frequent other forums boasting about how every sb goes raw or accept lower amounts of payments than an escort…aka I think more sbs should cover until trust is established, and be wary of those SDs that manipulate you into lowering your ppm/allowance number! But rays just me",
            "author": "Sugarcookie54321",
            "id": "hywsxu3",
            "parent_id": "t3_t46wh7",
            "score": 20,
            "created_utc": 1646142604.0,
            "replies": []
        },
        {
            "body": "Stop… telling me what to do.",
            "author": "MountWestSD",
            "id": "hyx7v3g",
            "parent_id": "t3_t46wh7",
            "score": 8,
            "created_utc": 1646149229.0,
            "replies": []
        },
        {
            "body": "I have been doing some sort of 'pay for play' since 1994. Much longer than most of yall have been alive. I have been in every realm. Swingers, Escorts, Providers, Red Light Districts in EU, Gangbang Groups, Sugar Dating, FWB, Adult Friend Finder, CL, Backpage,  and all the above. Even did amateur porn. This is how I see it.\n\nA Provider sees who she wants to see with screening. A Provider is a hybrid type Escort. She 'provides' a variety of fantasy options. She is not all about the $$$. She wants you to enjoy it an come back. Providers prefer regs.\n\nAn Escort sees pretty much any guy that passes screening. May or may not be looking for regs.\n\nA Street Walker or Sex Worker pretty much sees anyone, screening or not.\n\nA real Sugar Baby likes her SD, is attracted to her SD, wants to have sex with her SD.\n\nA fake Sugar Baby might tolerate her SD for the $$ or whatever the arrangement is.\n\nThe rest I do not know as I do not have experience in other forms of pay for play.",
            "author": "CenTexFunGuy",
            "id": "hyx0tr7",
            "parent_id": "t3_t46wh7",
            "score": 8,
            "created_utc": 1646146249.0,
            "replies": [
                {
                    "body": "I think this is a solid explanation of the spectrum.\nVin diagram is needed :)",
                    "author": null,
                    "id": "hyx3vhl",
                    "parent_id": "t1_hyx0tr7",
                    "score": 6,
                    "created_utc": 1646147562.0,
                    "replies": [
                        {
                            "body": "Thank you!",
                            "author": "CenTexFunGuy",
                            "id": "hyx4cfe",
                            "parent_id": "t1_hyx3vhl",
                            "score": 3,
                            "created_utc": 1646147762.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Seems that you have good material for an interesting book! :)",
                    "author": null,
                    "id": "hyxa826",
                    "parent_id": "t1_hyx0tr7",
                    "score": 6,
                    "created_utc": 1646150198.0,
                    "replies": [
                        {
                            "body": "I should have written it all down. I have hundreds of stories! I had a fun time!! I did most of that in my late 20's to early 40's. The gangbang parties were some of the most fun I had. Nothing like banging 5-7 women in one night. I think my best week or month was June 2005 when I fuked 15 different women in like a 10 day window. Cannot do that now.",
                            "author": "CenTexFunGuy",
                            "id": "hyxm0ap",
                            "parent_id": "t1_hyxa826",
                            "score": 2,
                            "created_utc": 1646154846.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not everyone likes everyone. Not everyone is attracted to everyone. I think that's fair.\n\nDo I expect and require my SB and I to have mutual attraction and chemistry and interest? Yes.\n\nI've found its rarely \"about the money\". I have had great early starts to an SR, provided agreed upon allowance or PPM and the SB \"loses interest.\" It's not even a rinsing. I am not even mad about it. But the money wasn't enough to keep her \"interested or attracted to me\". On the flip side some women (and yes SB caliber) can't stop messaging me, wanting to find ways to hang out, etc. and don't require money.\n\nIf the attraction and mutual interest isn't there, then I am not interested and there is no SR. That's a page from my book.\n\nWith that being said, I agree with you. Nobody should escort-shame the way you described. Its often a tactic to try to manipulate a SB and not pay agreed on PPM/allowance. But many SBs treat the game as an escort-type situation. Moving from guy to guy, collecting PPM, and having no interest of finding a sustainable SR with an SD - and then they decry escorts. That's their business.\n\nAlso, plenty of men and women have sex with strangers in vanilla dating and practice the same \"dangerous\" lifestyle you describe.\n\nSet your own filters. If \"escorts shaming\" is a deal breaker, its a deal breaker. Move on. If attraction isn't a criteria you care about, that is ok. But, if you are not attracted to me, its a deal breaker for me.\n\nTL:DR - There are all sorts of antics in the bowl. The great intersection of money and sex. While the bowl has \"no rules\" and you can make it what you want, there are some best practices guidelines that increase odds of success.",
            "author": "archhatter",
            "id": "hywneb7",
            "parent_id": "t3_t46wh7",
            "score": 9,
            "created_utc": 1646139681.0,
            "replies": []
        },
        {
            "body": "I think the language of the bowl is an enabler for many women who would never consider themselves \"escorts\" or \"hookers\" or \"prostitutes\" or \"sex workers.\" I'm sure some would say that men came up with \"sugar baby\" etc as a means to prey on the naive. And that probably goes both ways - I'd rather refer to my SB to someone else as my girlfriend or friend or lover, not \"my favorite hooker.\"\n\nI will make one comment:\n\n>...you know and trust the person you are sleeping with\n\nFor me personally, if I trust somebody I'm intimate with, I'm trusting that they're also attracted to me and not faking it.\n\nI guess the thought experiment here for the attractive women is what would it be like to sleep with somebody you find attracted, but who is just going through the motions with you?",
            "author": "quietgrey1",
            "id": "hyxf46m",
            "parent_id": "t3_t46wh7",
            "score": 3,
            "created_utc": 1646152172.0,
            "replies": []
        },
        {
            "body": "I agree with this to a degree. As a man though I can tell when someone isn't attracted to me, so I just move on from her at this point. I guess in those situations maybe the SD doesn't care if the woman is attracted to him, as long as he is very attracted to her and having fun with him. \n\nBut for me I look for shared mutual chemistry and attraction.",
            "author": "BigBearSD",
            "id": "hywku44",
            "parent_id": "t3_t46wh7",
            "score": 5,
            "created_utc": 1646138199.0,
            "replies": []
        },
        {
            "body": "Agreed. \n\nHave I felt attracted to all my SDs? Nope. Big nope.\n\nHave I felt attracted to certain qualities of all my SDs? Yes, big yes.\n\nHave I felt physically attracted/emotionally attached? Yes, but it's only happened with one SD out of many and not from the get go. Happened gradually after 1 year plus more for me and I never expected it to happen.",
            "author": null,
            "id": "hyxn0gw",
            "parent_id": "t3_t46wh7",
            "score": 2,
            "created_utc": 1646155235.0,
            "replies": []
        },
        {
            "body": "I call Bullshit!! I have to be attractive to my SD who I am 100% pleasing! I can't have a sexual relationship with a SD, that is not attractive ewhh, no matter how wealthy he is, how big his cock is, or his millions he claims to have or not. When I scroll through the pages, I look at the face/body and location. You need to look up the difference between an escort and a prostitute BIG difference BIG. Majority of P's are curb side pick-ups, have pimps, abused and are forced to fuck anyone and everyone. Go watch on Netflix \\*Girlfriend Experience \\* lmao",
            "author": "DiscreetlyYours2",
            "id": "hywy2qh",
            "parent_id": "t3_t46wh7",
            "score": 4,
            "created_utc": 1646145024.0,
            "replies": []
        },
        {
            "body": "Everyone says what they want, doesn't make it true for everyone, but maybe this is true for them.\n\nFor me I could care less if a SB is attracted to me. As long as they find me pleasent enough to spend time with and have sex with, I'm good. They don't have to be sexually interested in me, that's what the money is for",
            "author": "SDNH79",
            "id": "hyx7kyw",
            "parent_id": "t3_t46wh7",
            "score": 3,
            "created_utc": 1646149113.0,
            "replies": []
        },
        {
            "body": "An SB who isn't attracted to her SD is the same as an SD who is solely seeing his SB for sex and nothing more. It really isn't an SR in my opinion. An sB should keep looking until she finds the right guy that she can connect with and is attracted to, even if it's a little bit.",
            "author": "malcolm_reyn0lds",
            "id": "hyxk0cu",
            "parent_id": "t3_t46wh7",
            "score": 2,
            "created_utc": 1646154075.0,
            "replies": []
        },
        {
            "body": "Aaaaand let's not all forget that long-term relationships do start when men first meet a woman as an escort or as an SB (online or freestyle). I'd be surprised if most women who do remain in an SB or escort world for a while do not find a long-term partner.",
            "author": "JohnnyKemmer009",
            "id": "hyxhme6",
            "parent_id": "t3_t46wh7",
            "score": 1,
            "created_utc": 1646153156.0,
            "replies": []
        },
        {
            "body": "If you not attracted to the person paying you you should probably find one you are attracted to because eventually.... Lol shit ain't gon go your way.",
            "author": "DusseStraight",
            "id": "hyx4i7l",
            "parent_id": "t3_t46wh7",
            "score": -1,
            "created_utc": 1646147829.0,
            "replies": []
        },
        {
            "body": "SBs don’t necessarily need to be *physically* attracted to their SDs, but if you’re fucking someone you have *no* attraction to other than money… you’re a prostitution.  Period.",
            "author": "UseTheForceRey",
            "id": "hywwnx6",
            "parent_id": "t3_t46wh7",
            "score": -4,
            "created_utc": 1646144389.0,
            "replies": []
        },
        {
            "body": "Sbs are extremely different from escorts. Escorts always try to be sbs but fail hard. I've had both. Trust me a solid sugar relationship is vanilla at its best. This happens because with an sb I treat her exactly like I would a spoiled gf. Meets are not timed, they sneak out and lie to their bfs and family for me. Sex is wonderful and we explore new things. Mutual respect is there. Than again im a real sd. Giving a young girl a rich male ally and tutor does wonders for them. You build that trust. You don't be controlling and enjoy them for them and not only the sex. The reward is they truly appreciate you and will fight to keep you in their lives until real world hits fantasy world. I vet hard and I've found 3 great sb relationships over the years. And they are extremely different as the girls stopped using seeking normally looking for 1 guy or 2 they can trust and like. Escorts will fuck anyone that passes the screening process. Sex is impersonal and connection 0. Please escorts stop comparing the 2. Not even on the same level.",
            "author": "No-Pin-9988",
            "id": "hyx1182",
            "parent_id": "t3_t46wh7",
            "score": -3,
            "created_utc": 1646146340.0,
            "replies": []
        },
        {
            "body": "Well your post is kind of missing the point \n\nIt doesn’t mean she has to be really physically attracted to her sd.  Maybe it’s a mental attraction.  Or she likes being spoiled \n\nBut an sb should be enjoying sex somewhat with her sd.\n\nThe opposite is largely the case with escorts.  They fake orgasms and interest in their clients \n\nIf a girl is cringing having sex with her sd then she should stop it.  The whole faking it isn’t what guys want in the bowl",
            "author": "wb19081908",
            "id": "hywpvir",
            "parent_id": "t3_t46wh7",
            "score": -2,
            "created_utc": 1646141037.0,
            "replies": [
                {
                    "body": ">isn’t what guys want\n\nActually, some SDs are perfectly fine with it because they know it isn’t reasonable for them to expect an attractive girl to be attracted to them, due to physical or other circumstances.",
                    "author": null,
                    "id": "hywqb2b",
                    "parent_id": "t1_hywpvir",
                    "score": 3,
                    "created_utc": 1646141263.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hywwz02",
                            "parent_id": "t1_hywqb2b",
                            "score": 0,
                            "created_utc": 1646144528.0,
                            "replies": [
                                {
                                    "body": "Sounds like someone with an agenda which doesn’t really fit in with the bowl",
                                    "author": "wb19081908",
                                    "id": "hywy855",
                                    "parent_id": "t1_hywwz02",
                                    "score": -2,
                                    "created_utc": 1646145092.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There's no logic in seeing the same escort over and over again. Regular clients are either deluded or being led on, or both obviously. \n\nSo a sugar baby is a con artist who uses her vagina and her brains to trap and exploit older men? \n\nShit, the TikTok lady was right and were old fools to fall for it.",
            "author": "throwaway31479",
            "id": "hyww62h",
            "parent_id": "t3_t46wh7",
            "score": -1,
            "created_utc": 1646144158.0,
            "replies": []
        },
        {
            "body": "This. OP clearly doesn’t understand the difference between an escort and a prostitute. There are escorts with multiple regulars and they can limit their intimacy strictly to that set of regulars, if they choose. Having intimacy with multiple strange men is not the norm for a lot of them. The “many people” you speak of, fit that bill.\n\nThere’s a girl on YouTube who calls herself an SB but she’s an escort with regulars (she says SB for views). If you look on her website, the veil gets lifted as she advertises as an escort. She only takes new clients when she chooses and also has a close relationship with one of the guys and he calls her his SGF.\n\nSo while you’re making this post for them to stop saying that, there’s a reason they are. The bottom line is, there’s very little reason for an SD to stay with you if there isn’t a genuine attraction and solid relationship. There’s far too many other options out there for them.",
            "author": "TX_SB",
            "id": "hywnsgo",
            "parent_id": "t1_hywlmea",
            "score": 36,
            "created_utc": 1646139901.0,
            "replies": [
                {
                    "body": "The reason is, again, that you know and trust the person and would rather not be having this type of dynamic with multiple people and having to vet new “clients.” You might also want to do things with your SD other than just have sex—talk, go on outings, just hang out—rather than having an entirely sex-based relationship. None of these things require a genuine attraction.",
                    "author": null,
                    "id": "hywoctj",
                    "parent_id": "t1_hywnsgo",
                    "score": -5,
                    "created_utc": 1646140214.0,
                    "replies": [
                        {
                            "body": "Escorts get to know and trust their clients. Heck in their screening process they know WAY more upfront about them than any SB would about a POT SD. \n\n>*You might also want to do things with your SD other than just have sex—talk, go on outings, just hang out—rather than having an entirely sex-based relationship. None of these things require a genuine attraction.*\n\nIf an SD wants a genuine connection and not a friend to hang out with, they do.",
                            "author": "TX_SB",
                            "id": "hywoje2",
                            "parent_id": "t1_hywoctj",
                            "score": 18,
                            "created_utc": 1646140313.0,
                            "replies": [
                                {
                                    "body": "Excellent replies. These are accurate insights into escorts.",
                                    "author": "JohnnyKemmer009",
                                    "id": "hyxgr3s",
                                    "parent_id": "t1_hywoje2",
                                    "score": 2,
                                    "created_utc": 1646152817.0,
                                    "replies": []
                                },
                                {
                                    "body": "Excellent replies. These are accurate insights into escorts.",
                                    "author": "JohnnyKemmer009",
                                    "id": "hyxgszd",
                                    "parent_id": "t1_hywoje2",
                                    "score": 2,
                                    "created_utc": 1646152837.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hywosj1",
                                    "parent_id": "t1_hywoje2",
                                    "score": 0,
                                    "created_utc": 1646140456.0,
                                    "replies": []
                                },
                                {
                                    "body": "It doesn’t matter though. When multiple people are involved, your risk of STDs, as well as your risk of something going wrong and someone you thought you “trusted” becoming abusive, increases a hundredfold. I already don’t know if my SD is having sex with other people. Why would I increase my risk by having multiple “clients”?",
                                    "author": null,
                                    "id": "hywp8qa",
                                    "parent_id": "t1_hywoje2",
                                    "score": -15,
                                    "created_utc": 1646140701.0,
                                    "replies": [
                                        {
                                            "body": "I’m not sure why you’re debating with me. Is it because I’m a female? You said nothing to the men who made the exact same comment that I did. Let’s agree to disagree but feel free to defend your position.",
                                            "author": "TX_SB",
                                            "id": "hywpjg4",
                                            "parent_id": "t1_hywp8qa",
                                            "score": 11,
                                            "created_utc": 1646140858.0,
                                            "replies": [
                                                {
                                                    "body": "I didn’t even know you were female, I didn’t look at your username. I responded to you because it was the most recent comment.",
                                                    "author": null,
                                                    "id": "hywpm0h",
                                                    "parent_id": "t1_hywpjg4",
                                                    "score": -2,
                                                    "created_utc": 1646140896.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If it talks like a duck, walks like a duck, ...",
            "author": "TorontoCash",
            "id": "hywso1z",
            "parent_id": "t1_hywlmea",
            "score": 16,
            "created_utc": 1646142471.0,
            "replies": []
        },
        {
            "body": "> A girl who sees multiple guys on the regular for PPM is really no different from an escort.\n\nAgreed 100%",
            "author": "GSSD",
            "id": "hywvlre",
            "parent_id": "t1_hywlmea",
            "score": 7,
            "created_utc": 1646143894.0,
            "replies": []
        },
        {
            "body": "couldn't have said it better,Thank you xo",
            "author": "DiscreetlyYours2",
            "id": "hywzgfv",
            "parent_id": "t1_hywlmea",
            "score": 3,
            "created_utc": 1646145646.0,
            "replies": []
        },
        {
            "body": "If you just have one SD whom you see frequently and are not attracted to/wouldn’t vanilla date, that’s not the same as escorting at all, and is still a sugar relationship. I agree that the line is blurred when multiple SDs are involved.",
            "author": null,
            "id": "hywnv9u",
            "parent_id": "t1_hywlmea",
            "score": 0,
            "created_utc": 1646139945.0,
            "replies": [
                {
                    "body": "As an SD, it’s fairly easy to tell if a woman/SB is faking her attraction and physical interest.  Some SDs may not care, maybe they just want a dick garage and nothing more; all I can tell you is that sexual chemistry is important to me in my SRs, as is sincerity.  If or when I detect that she is just faking any real interest and/or attraction, the magic tends to dissipate rather quickly.",
                    "author": "txjerome",
                    "id": "hyx2429",
                    "parent_id": "t1_hywnv9u",
                    "score": 14,
                    "created_utc": 1646146809.0,
                    "replies": [
                        {
                            "body": "Well said. I'd double up-vote if I could. Men want affection as part of the experience.",
                            "author": "JohnnyKemmer009",
                            "id": "hyxh0pj",
                            "parent_id": "t1_hyx2429",
                            "score": 5,
                            "created_utc": 1646152920.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You make a solid point and I have to agree especially about SBs who see multiple SDs.",
            "author": null,
            "id": "hywn0ik",
            "parent_id": "t1_hywlmea",
            "score": 0,
            "created_utc": 1646139463.0,
            "replies": []
        },
        {
            "body": "Bullshit.\n\nIts a nice line and all, but an escort will have sex with any guy, unless he's blacklisted or she has a bad experience with him.",
            "author": "Athensbirds",
            "id": "hywmgml",
            "parent_id": "t1_hywlmea",
            "score": -13,
            "created_utc": 1646139148.0,
            "replies": [
                {
                    "body": "I think the sugar world is filled with men and women who want to be escorts and johns without the label.",
                    "author": "Sugar-Monkey",
                    "id": "hywnr07",
                    "parent_id": "t1_hywmgml",
                    "score": 18,
                    "created_utc": 1646139879.0,
                    "replies": [
                        {
                            "body": "Nailed it.",
                            "author": null,
                            "id": "hyxc15p",
                            "parent_id": "t1_hywnr07",
                            "score": 10,
                            "created_utc": 1646150934.0,
                            "replies": []
                        },
                        {
                            "body": "Nah, I disagree.\n\nI'm not saying there aren't SDs and SBs who act like they're escorts and johns, but I think the majority want actual relationships with people who give a shit about them.\n\nJust about any SB even if she's on PPM could have an actual emergency, message her SD, and ask for help. Most of the time she'd get help, unless she had a habit of abusing the guy's good will. (The help she'd need might not even be financial in nature).\n\nI very much doubt an escort would call a john for help. Maybe she would/could if she'd had a client for 5-10 years. It's the difference between a FWB and your doctor. A FWB would totally ask you for help moving, your drycleaner wont.\n\nThere is a difference, even in the most transactional SRs, unless the guy is an actual john.",
                            "author": "Athensbirds",
                            "id": "hywp02r",
                            "parent_id": "t1_hywnr07",
                            "score": -3,
                            "created_utc": 1646140570.0,
                            "replies": [
                                {
                                    "body": "You need to get on YouTube. There’s an absolute example if an escort (openly advertises as an escort) who has regulars she calls on for emergencies, help (hell even one of them walks her dog for her) and calls them her SDs.",
                                    "author": "TX_SB",
                                    "id": "hywqhxz",
                                    "parent_id": "t1_hywp02r",
                                    "score": 10,
                                    "created_utc": 1646141363.0,
                                    "replies": []
                                },
                                {
                                    "body": "I think you're being naive. Your argument sounds strangely like something I would have said before I had more experience in the sugar bowl. It's such an idealized version of what the sugar world actually is. I'm not saying the type of relationship you describe doesn't exist but it's laughable to think that's what most are seeking and what most find. It's simply not the case.",
                                    "author": "Sugar-Monkey",
                                    "id": "hywqfob",
                                    "parent_id": "t1_hywp02r",
                                    "score": 12,
                                    "created_utc": 1646141330.0,
                                    "replies": [
                                        {
                                            "body": "Well, I make an effort to filter out people who come across as escorts, so maybe that plays into it.",
                                            "author": "Athensbirds",
                                            "id": "hyws3d0",
                                            "parent_id": "t1_hywqfob",
                                            "score": -3,
                                            "created_utc": 1646142182.0,
                                            "replies": [
                                                {
                                                    "body": "Maybe you're right. I don't know but I do know that a lot of the women who market themselves as the ideal version of an SB aren't really being truthful about what they're doing behind the scenes. The same goes for SDs. I don't want to make this out as an issue for only one side.",
                                                    "author": "Sugar-Monkey",
                                                    "id": "hywsoqn",
                                                    "parent_id": "t1_hyws3d0",
                                                    "score": 9,
                                                    "created_utc": 1646142480.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": ">Just about any SB even if she's on PPM could have an actual emergency, message her SD, and ask for help. Most of the time she'd get help, unless she had a habit of abusing the guy's good will. (The help she'd need might not even be financial in nature).\n\nThis is a good point. If my SB called or texted me that she needed a ride because of car trouble, I'd help out and give her a ride. And I'm sure she would do the same for me. \n\nThat's not something I would expect in an escort-john relationship. But maybe I'm wrong.",
                                    "author": "BinghamtonSD",
                                    "id": "hyx5rfm",
                                    "parent_id": "t1_hywp02r",
                                    "score": 2,
                                    "created_utc": 1646148358.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">  but an escort will have sex with any guy\n\nThat is *literally* not true. I know people like to believe that, but anyone who is familiar with the world of SWs know that's not even close to being true. Some are certainly less discriminating than others, but they learn quickly to trust their gut when it comes to deciding who they'll engage with.",
                    "author": "Y_4Z44",
                    "id": "hyxfajs",
                    "parent_id": "t1_hywmgml",
                    "score": 13,
                    "created_utc": 1646152242.0,
                    "replies": []
                },
                {
                    "body": "Now you’re speaking for all escorts?",
                    "author": "TX_SB",
                    "id": "hywq4ss",
                    "parent_id": "t1_hywmgml",
                    "score": 12,
                    "created_utc": 1646141172.0,
                    "replies": [
                        {
                            "body": "Call a hundred, see what percentage say no.",
                            "author": "Athensbirds",
                            "id": "hywrpk2",
                            "parent_id": "t1_hywq4ss",
                            "score": -1,
                            "created_utc": 1646141986.0,
                            "replies": [
                                {
                                    "body": "If I was one and you called me, I would say no.",
                                    "author": "TX_SB",
                                    "id": "hywujcr",
                                    "parent_id": "t1_hywrpk2",
                                    "score": 10,
                                    "created_utc": 1646143383.0,
                                    "replies": [
                                        {
                                            "body": "I’m falling in love with you lol",
                                            "author": "Kevinburnz",
                                            "id": "hywymmj",
                                            "parent_id": "t1_hywujcr",
                                            "score": 3,
                                            "created_utc": 1646145276.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Yeah, but if I found your number in the phone book and called you, you wouldn't know squat about me, you'd say no based on what? Even if you genuinely dislike people like me to your core, how would you know? You wouldn't have a nice long M&G to get to know me, you'd just have me knocking on your hotel room door or vice versa.\n\nKinda proves my point.",
                                            "author": "Athensbirds",
                                            "id": "hyx70mi",
                                            "parent_id": "t1_hywujcr",
                                            "score": -1,
                                            "created_utc": 1646148882.0,
                                            "replies": [
                                                {
                                                    "body": "The man doth protest too much, methinks. \n\nIt’s entertaining that you don’t understand why I wouldn’t see you.",
                                                    "author": "TX_SB",
                                                    "id": "hyxge36",
                                                    "parent_id": "t1_hyx70mi",
                                                    "score": 9,
                                                    "created_utc": 1646152676.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have never heard of an escort turning down a man for any reason other than concern he’s LE.   In countries where prostitution is legal, they don’t ask for any information at all. N",
            "author": "UseTheForceRey",
            "id": "hywwtze",
            "parent_id": "t1_hywlmea",
            "score": -9,
            "created_utc": 1646144465.0,
            "replies": []
        },
        {
            "body": "Here here!\nI 100 agree!",
            "author": null,
            "id": "hyx3nw2",
            "parent_id": "t1_hywxnxe",
            "score": 7,
            "created_utc": 1646147472.0,
            "replies": []
        },
        {
            "body": "Same! Was an escort for a couple years on and off :) pros and cons to both - I definitely view both as \"sex work\" in the most non judgemental of ways. You're right that both shit talk the other. All the hate is dumb.\n\nedit: I wanted to add that the experience you have with an escort or a SB is entirely dependent on the woman. Just because a woman is an escort, doesn't mean that she's super cold and interested in only the money. And vice versa.",
            "author": null,
            "id": "hyxnhp7",
            "parent_id": "t1_hywxnxe",
            "score": 12,
            "created_utc": 1646155419.0,
            "replies": []
        },
        {
            "body": "I was only somewhat with you to the point where you gave your quote *legal perspective* unquote comparing PPM to escorting. IANAL, but I’m 99.999999% certain that nobody doing PPM discusses services in the context of it’ll be XXX for a HJ, XXX for a BJ, XXX for PIV. That kind of conversation, imho, defines escorting or prostitution. \n\nPlease note I have no axe to grind wrt SWs, I just disagree with your “clear” line.",
            "author": "Chill_SD1974",
            "id": "hyww918",
            "parent_id": "t1_hyws4yt",
            "score": 4,
            "created_utc": 1646144196.0,
            "replies": [
                {
                    "body": "What you describe is not how escorts operate. Their is no “menu”. That might be how it works in the streets or in a brothel but that is not how a high end GFE escort operates.\n\nTheir is a price defined for time and what happens happens. They will have a yes / no list of activities that they are comfortable with but they don’t have prices for activities.",
                    "author": null,
                    "id": "hyx3kzf",
                    "parent_id": "t1_hyww918",
                    "score": 7,
                    "created_utc": 1646147439.0,
                    "replies": [
                        {
                            "body": "Agreed that I did not describe a high end escort. I was establishing a definition of prostitution. \n\nThe comment I replied to essentially was *does PPM in and of itself “clearly and legally” define an “SR” as in fact being an escorting situation. I say nope. \n\nOTOH, if a woman calling herself an “SB” told you if you want to be with her it’s gonna be X for every hour you’re together with her, I don’t think that’s an SR. \n\nEven in vanilla dating there’s a point where the daters agree to say goodnight and go home, if they didn’t plan to have a sleepover. \n\n🤷🏻‍♂️",
                            "author": "Chill_SD1974",
                            "id": "hyx7i8n",
                            "parent_id": "t1_hyx3kzf",
                            "score": 2,
                            "created_utc": 1646149081.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sugaring is sex work in my mind as well. No doubt about it. The stigma around all kinds of SW needs to be demolished.",
            "author": null,
            "id": "hyxnaws",
            "parent_id": "t1_hyx14f3",
            "score": 17,
            "created_utc": 1646155346.0,
            "replies": []
        },
        {
            "body": "Do you think sugaring or Tinder or going to a club is equally dangerous for women? risks of stealthing, sexual assault/non-consensual activities, PUA?",
            "author": "daddoms",
            "id": "hyx4imd",
            "parent_id": "t1_hyx14f3",
            "score": 4,
            "created_utc": 1646147834.0,
            "replies": [
                {
                    "body": "That happens regardless of sugar, regardless of venue. 1 in 3 women worldwide experience sexual violence. 1 in 4 in the US alone. This was the basis of the #metoo movement. We are taught from childhood to fear all men unless they have given us a reason not to fear them. It's called \"living while female.\" \n\nhttps://ncadv.org/STATISTICS",
                    "author": "LadyMorgan2018",
                    "id": "hyx5ap1",
                    "parent_id": "t1_hyx4imd",
                    "score": 13,
                    "created_utc": 1646148160.0,
                    "replies": [
                        {
                            "body": "OP distinguishes SB (when not attracted) vs escort as inherently less dangerous. Is this true?",
                            "author": "daddoms",
                            "id": "hyx6lug",
                            "parent_id": "t1_hyx5ap1",
                            "score": 0,
                            "created_utc": 1646148712.0,
                            "replies": [
                                {
                                    "body": "It depends on the type of escort. As I mentioned, it's the criminalization that makes SW more dangerous than anything else. \n\nTherefore, the type of SW will determine the exposure. Street workers are inherently more exposed than indoor workers. Higher end escorts are less exposed than lower end-and even many sugar workers. Many SW practice regular safer sex and get tested regularly, so they are as safe, if not more, as any monogamous SB. Then there are other types of SW-like OF, web camming, stripping, and pro-Domme work that is much safer than sugaring-because there is less intimate sexual interaction. \n\nTristan Terimino has an excellent podcast called Sex Out Loud. She's a leader in the sex positive movement. I just finished listening to episode 96, where she had two long time scholars on SW rights were speaking to this very subject.\n https://sexoutloud.libsyn.com/scientists-for-sex-worker-rights-with-barb-and-ron",
                                    "author": "LadyMorgan2018",
                                    "id": "hyx8tbp",
                                    "parent_id": "t1_hyx6lug",
                                    "score": 8,
                                    "created_utc": 1646149621.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think this is a solid explanation of the spectrum.\nVin diagram is needed :)",
            "author": null,
            "id": "hyx3vhl",
            "parent_id": "t1_hyx0tr7",
            "score": 6,
            "created_utc": 1646147562.0,
            "replies": [
                {
                    "body": "Thank you!",
                    "author": "CenTexFunGuy",
                    "id": "hyx4cfe",
                    "parent_id": "t1_hyx3vhl",
                    "score": 3,
                    "created_utc": 1646147762.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Seems that you have good material for an interesting book! :)",
            "author": null,
            "id": "hyxa826",
            "parent_id": "t1_hyx0tr7",
            "score": 6,
            "created_utc": 1646150198.0,
            "replies": [
                {
                    "body": "I should have written it all down. I have hundreds of stories! I had a fun time!! I did most of that in my late 20's to early 40's. The gangbang parties were some of the most fun I had. Nothing like banging 5-7 women in one night. I think my best week or month was June 2005 when I fuked 15 different women in like a 10 day window. Cannot do that now.",
                    "author": "CenTexFunGuy",
                    "id": "hyxm0ap",
                    "parent_id": "t1_hyxa826",
                    "score": 2,
                    "created_utc": 1646154846.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">isn’t what guys want\n\nActually, some SDs are perfectly fine with it because they know it isn’t reasonable for them to expect an attractive girl to be attracted to them, due to physical or other circumstances.",
            "author": null,
            "id": "hywqb2b",
            "parent_id": "t1_hywpvir",
            "score": 3,
            "created_utc": 1646141263.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hywwz02",
                    "parent_id": "t1_hywqb2b",
                    "score": 0,
                    "created_utc": 1646144528.0,
                    "replies": [
                        {
                            "body": "Sounds like someone with an agenda which doesn’t really fit in with the bowl",
                            "author": "wb19081908",
                            "id": "hywy855",
                            "parent_id": "t1_hywwz02",
                            "score": -2,
                            "created_utc": 1646145092.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The reason is, again, that you know and trust the person and would rather not be having this type of dynamic with multiple people and having to vet new “clients.” You might also want to do things with your SD other than just have sex—talk, go on outings, just hang out—rather than having an entirely sex-based relationship. None of these things require a genuine attraction.",
            "author": null,
            "id": "hywoctj",
            "parent_id": "t1_hywnsgo",
            "score": -5,
            "created_utc": 1646140214.0,
            "replies": [
                {
                    "body": "Escorts get to know and trust their clients. Heck in their screening process they know WAY more upfront about them than any SB would about a POT SD. \n\n>*You might also want to do things with your SD other than just have sex—talk, go on outings, just hang out—rather than having an entirely sex-based relationship. None of these things require a genuine attraction.*\n\nIf an SD wants a genuine connection and not a friend to hang out with, they do.",
                    "author": "TX_SB",
                    "id": "hywoje2",
                    "parent_id": "t1_hywoctj",
                    "score": 18,
                    "created_utc": 1646140313.0,
                    "replies": [
                        {
                            "body": "Excellent replies. These are accurate insights into escorts.",
                            "author": "JohnnyKemmer009",
                            "id": "hyxgr3s",
                            "parent_id": "t1_hywoje2",
                            "score": 2,
                            "created_utc": 1646152817.0,
                            "replies": []
                        },
                        {
                            "body": "Excellent replies. These are accurate insights into escorts.",
                            "author": "JohnnyKemmer009",
                            "id": "hyxgszd",
                            "parent_id": "t1_hywoje2",
                            "score": 2,
                            "created_utc": 1646152837.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hywosj1",
                            "parent_id": "t1_hywoje2",
                            "score": 0,
                            "created_utc": 1646140456.0,
                            "replies": []
                        },
                        {
                            "body": "It doesn’t matter though. When multiple people are involved, your risk of STDs, as well as your risk of something going wrong and someone you thought you “trusted” becoming abusive, increases a hundredfold. I already don’t know if my SD is having sex with other people. Why would I increase my risk by having multiple “clients”?",
                            "author": null,
                            "id": "hywp8qa",
                            "parent_id": "t1_hywoje2",
                            "score": -15,
                            "created_utc": 1646140701.0,
                            "replies": [
                                {
                                    "body": "I’m not sure why you’re debating with me. Is it because I’m a female? You said nothing to the men who made the exact same comment that I did. Let’s agree to disagree but feel free to defend your position.",
                                    "author": "TX_SB",
                                    "id": "hywpjg4",
                                    "parent_id": "t1_hywp8qa",
                                    "score": 11,
                                    "created_utc": 1646140858.0,
                                    "replies": [
                                        {
                                            "body": "I didn’t even know you were female, I didn’t look at your username. I responded to you because it was the most recent comment.",
                                            "author": null,
                                            "id": "hywpm0h",
                                            "parent_id": "t1_hywpjg4",
                                            "score": -2,
                                            "created_utc": 1646140896.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "As an SD, it’s fairly easy to tell if a woman/SB is faking her attraction and physical interest.  Some SDs may not care, maybe they just want a dick garage and nothing more; all I can tell you is that sexual chemistry is important to me in my SRs, as is sincerity.  If or when I detect that she is just faking any real interest and/or attraction, the magic tends to dissipate rather quickly.",
            "author": "txjerome",
            "id": "hyx2429",
            "parent_id": "t1_hywnv9u",
            "score": 14,
            "created_utc": 1646146809.0,
            "replies": [
                {
                    "body": "Well said. I'd double up-vote if I could. Men want affection as part of the experience.",
                    "author": "JohnnyKemmer009",
                    "id": "hyxh0pj",
                    "parent_id": "t1_hyx2429",
                    "score": 5,
                    "created_utc": 1646152920.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think the sugar world is filled with men and women who want to be escorts and johns without the label.",
            "author": "Sugar-Monkey",
            "id": "hywnr07",
            "parent_id": "t1_hywmgml",
            "score": 18,
            "created_utc": 1646139879.0,
            "replies": [
                {
                    "body": "Nailed it.",
                    "author": null,
                    "id": "hyxc15p",
                    "parent_id": "t1_hywnr07",
                    "score": 10,
                    "created_utc": 1646150934.0,
                    "replies": []
                },
                {
                    "body": "Nah, I disagree.\n\nI'm not saying there aren't SDs and SBs who act like they're escorts and johns, but I think the majority want actual relationships with people who give a shit about them.\n\nJust about any SB even if she's on PPM could have an actual emergency, message her SD, and ask for help. Most of the time she'd get help, unless she had a habit of abusing the guy's good will. (The help she'd need might not even be financial in nature).\n\nI very much doubt an escort would call a john for help. Maybe she would/could if she'd had a client for 5-10 years. It's the difference between a FWB and your doctor. A FWB would totally ask you for help moving, your drycleaner wont.\n\nThere is a difference, even in the most transactional SRs, unless the guy is an actual john.",
                    "author": "Athensbirds",
                    "id": "hywp02r",
                    "parent_id": "t1_hywnr07",
                    "score": -3,
                    "created_utc": 1646140570.0,
                    "replies": [
                        {
                            "body": "You need to get on YouTube. There’s an absolute example if an escort (openly advertises as an escort) who has regulars she calls on for emergencies, help (hell even one of them walks her dog for her) and calls them her SDs.",
                            "author": "TX_SB",
                            "id": "hywqhxz",
                            "parent_id": "t1_hywp02r",
                            "score": 10,
                            "created_utc": 1646141363.0,
                            "replies": []
                        },
                        {
                            "body": "I think you're being naive. Your argument sounds strangely like something I would have said before I had more experience in the sugar bowl. It's such an idealized version of what the sugar world actually is. I'm not saying the type of relationship you describe doesn't exist but it's laughable to think that's what most are seeking and what most find. It's simply not the case.",
                            "author": "Sugar-Monkey",
                            "id": "hywqfob",
                            "parent_id": "t1_hywp02r",
                            "score": 12,
                            "created_utc": 1646141330.0,
                            "replies": [
                                {
                                    "body": "Well, I make an effort to filter out people who come across as escorts, so maybe that plays into it.",
                                    "author": "Athensbirds",
                                    "id": "hyws3d0",
                                    "parent_id": "t1_hywqfob",
                                    "score": -3,
                                    "created_utc": 1646142182.0,
                                    "replies": [
                                        {
                                            "body": "Maybe you're right. I don't know but I do know that a lot of the women who market themselves as the ideal version of an SB aren't really being truthful about what they're doing behind the scenes. The same goes for SDs. I don't want to make this out as an issue for only one side.",
                                            "author": "Sugar-Monkey",
                                            "id": "hywsoqn",
                                            "parent_id": "t1_hyws3d0",
                                            "score": 9,
                                            "created_utc": 1646142480.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">Just about any SB even if she's on PPM could have an actual emergency, message her SD, and ask for help. Most of the time she'd get help, unless she had a habit of abusing the guy's good will. (The help she'd need might not even be financial in nature).\n\nThis is a good point. If my SB called or texted me that she needed a ride because of car trouble, I'd help out and give her a ride. And I'm sure she would do the same for me. \n\nThat's not something I would expect in an escort-john relationship. But maybe I'm wrong.",
                            "author": "BinghamtonSD",
                            "id": "hyx5rfm",
                            "parent_id": "t1_hywp02r",
                            "score": 2,
                            "created_utc": 1646148358.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">  but an escort will have sex with any guy\n\nThat is *literally* not true. I know people like to believe that, but anyone who is familiar with the world of SWs know that's not even close to being true. Some are certainly less discriminating than others, but they learn quickly to trust their gut when it comes to deciding who they'll engage with.",
            "author": "Y_4Z44",
            "id": "hyxfajs",
            "parent_id": "t1_hywmgml",
            "score": 13,
            "created_utc": 1646152242.0,
            "replies": []
        },
        {
            "body": "Now you’re speaking for all escorts?",
            "author": "TX_SB",
            "id": "hywq4ss",
            "parent_id": "t1_hywmgml",
            "score": 12,
            "created_utc": 1646141172.0,
            "replies": [
                {
                    "body": "Call a hundred, see what percentage say no.",
                    "author": "Athensbirds",
                    "id": "hywrpk2",
                    "parent_id": "t1_hywq4ss",
                    "score": -1,
                    "created_utc": 1646141986.0,
                    "replies": [
                        {
                            "body": "If I was one and you called me, I would say no.",
                            "author": "TX_SB",
                            "id": "hywujcr",
                            "parent_id": "t1_hywrpk2",
                            "score": 10,
                            "created_utc": 1646143383.0,
                            "replies": [
                                {
                                    "body": "I’m falling in love with you lol",
                                    "author": "Kevinburnz",
                                    "id": "hywymmj",
                                    "parent_id": "t1_hywujcr",
                                    "score": 3,
                                    "created_utc": 1646145276.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yeah, but if I found your number in the phone book and called you, you wouldn't know squat about me, you'd say no based on what? Even if you genuinely dislike people like me to your core, how would you know? You wouldn't have a nice long M&G to get to know me, you'd just have me knocking on your hotel room door or vice versa.\n\nKinda proves my point.",
                                    "author": "Athensbirds",
                                    "id": "hyx70mi",
                                    "parent_id": "t1_hywujcr",
                                    "score": -1,
                                    "created_utc": 1646148882.0,
                                    "replies": [
                                        {
                                            "body": "The man doth protest too much, methinks. \n\nIt’s entertaining that you don’t understand why I wouldn’t see you.",
                                            "author": "TX_SB",
                                            "id": "hyxge36",
                                            "parent_id": "t1_hyx70mi",
                                            "score": 9,
                                            "created_utc": 1646152676.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What you describe is not how escorts operate. Their is no “menu”. That might be how it works in the streets or in a brothel but that is not how a high end GFE escort operates.\n\nTheir is a price defined for time and what happens happens. They will have a yes / no list of activities that they are comfortable with but they don’t have prices for activities.",
            "author": null,
            "id": "hyx3kzf",
            "parent_id": "t1_hyww918",
            "score": 7,
            "created_utc": 1646147439.0,
            "replies": [
                {
                    "body": "Agreed that I did not describe a high end escort. I was establishing a definition of prostitution. \n\nThe comment I replied to essentially was *does PPM in and of itself “clearly and legally” define an “SR” as in fact being an escorting situation. I say nope. \n\nOTOH, if a woman calling herself an “SB” told you if you want to be with her it’s gonna be X for every hour you’re together with her, I don’t think that’s an SR. \n\nEven in vanilla dating there’s a point where the daters agree to say goodnight and go home, if they didn’t plan to have a sleepover. \n\n🤷🏻‍♂️",
                    "author": "Chill_SD1974",
                    "id": "hyx7i8n",
                    "parent_id": "t1_hyx3kzf",
                    "score": 2,
                    "created_utc": 1646149081.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That happens regardless of sugar, regardless of venue. 1 in 3 women worldwide experience sexual violence. 1 in 4 in the US alone. This was the basis of the #metoo movement. We are taught from childhood to fear all men unless they have given us a reason not to fear them. It's called \"living while female.\" \n\nhttps://ncadv.org/STATISTICS",
            "author": "LadyMorgan2018",
            "id": "hyx5ap1",
            "parent_id": "t1_hyx4imd",
            "score": 13,
            "created_utc": 1646148160.0,
            "replies": [
                {
                    "body": "OP distinguishes SB (when not attracted) vs escort as inherently less dangerous. Is this true?",
                    "author": "daddoms",
                    "id": "hyx6lug",
                    "parent_id": "t1_hyx5ap1",
                    "score": 0,
                    "created_utc": 1646148712.0,
                    "replies": [
                        {
                            "body": "It depends on the type of escort. As I mentioned, it's the criminalization that makes SW more dangerous than anything else. \n\nTherefore, the type of SW will determine the exposure. Street workers are inherently more exposed than indoor workers. Higher end escorts are less exposed than lower end-and even many sugar workers. Many SW practice regular safer sex and get tested regularly, so they are as safe, if not more, as any monogamous SB. Then there are other types of SW-like OF, web camming, stripping, and pro-Domme work that is much safer than sugaring-because there is less intimate sexual interaction. \n\nTristan Terimino has an excellent podcast called Sex Out Loud. She's a leader in the sex positive movement. I just finished listening to episode 96, where she had two long time scholars on SW rights were speaking to this very subject.\n https://sexoutloud.libsyn.com/scientists-for-sex-worker-rights-with-barb-and-ron",
                            "author": "LadyMorgan2018",
                            "id": "hyx8tbp",
                            "parent_id": "t1_hyx6lug",
                            "score": 8,
                            "created_utc": 1646149621.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you!",
            "author": "CenTexFunGuy",
            "id": "hyx4cfe",
            "parent_id": "t1_hyx3vhl",
            "score": 3,
            "created_utc": 1646147762.0,
            "replies": []
        },
        {
            "body": "I should have written it all down. I have hundreds of stories! I had a fun time!! I did most of that in my late 20's to early 40's. The gangbang parties were some of the most fun I had. Nothing like banging 5-7 women in one night. I think my best week or month was June 2005 when I fuked 15 different women in like a 10 day window. Cannot do that now.",
            "author": "CenTexFunGuy",
            "id": "hyxm0ap",
            "parent_id": "t1_hyxa826",
            "score": 2,
            "created_utc": 1646154846.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hywwz02",
            "parent_id": "t1_hywqb2b",
            "score": 0,
            "created_utc": 1646144528.0,
            "replies": [
                {
                    "body": "Sounds like someone with an agenda which doesn’t really fit in with the bowl",
                    "author": "wb19081908",
                    "id": "hywy855",
                    "parent_id": "t1_hywwz02",
                    "score": -2,
                    "created_utc": 1646145092.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Escorts get to know and trust their clients. Heck in their screening process they know WAY more upfront about them than any SB would about a POT SD. \n\n>*You might also want to do things with your SD other than just have sex—talk, go on outings, just hang out—rather than having an entirely sex-based relationship. None of these things require a genuine attraction.*\n\nIf an SD wants a genuine connection and not a friend to hang out with, they do.",
            "author": "TX_SB",
            "id": "hywoje2",
            "parent_id": "t1_hywoctj",
            "score": 18,
            "created_utc": 1646140313.0,
            "replies": [
                {
                    "body": "Excellent replies. These are accurate insights into escorts.",
                    "author": "JohnnyKemmer009",
                    "id": "hyxgr3s",
                    "parent_id": "t1_hywoje2",
                    "score": 2,
                    "created_utc": 1646152817.0,
                    "replies": []
                },
                {
                    "body": "Excellent replies. These are accurate insights into escorts.",
                    "author": "JohnnyKemmer009",
                    "id": "hyxgszd",
                    "parent_id": "t1_hywoje2",
                    "score": 2,
                    "created_utc": 1646152837.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hywosj1",
                    "parent_id": "t1_hywoje2",
                    "score": 0,
                    "created_utc": 1646140456.0,
                    "replies": []
                },
                {
                    "body": "It doesn’t matter though. When multiple people are involved, your risk of STDs, as well as your risk of something going wrong and someone you thought you “trusted” becoming abusive, increases a hundredfold. I already don’t know if my SD is having sex with other people. Why would I increase my risk by having multiple “clients”?",
                    "author": null,
                    "id": "hywp8qa",
                    "parent_id": "t1_hywoje2",
                    "score": -15,
                    "created_utc": 1646140701.0,
                    "replies": [
                        {
                            "body": "I’m not sure why you’re debating with me. Is it because I’m a female? You said nothing to the men who made the exact same comment that I did. Let’s agree to disagree but feel free to defend your position.",
                            "author": "TX_SB",
                            "id": "hywpjg4",
                            "parent_id": "t1_hywp8qa",
                            "score": 11,
                            "created_utc": 1646140858.0,
                            "replies": [
                                {
                                    "body": "I didn’t even know you were female, I didn’t look at your username. I responded to you because it was the most recent comment.",
                                    "author": null,
                                    "id": "hywpm0h",
                                    "parent_id": "t1_hywpjg4",
                                    "score": -2,
                                    "created_utc": 1646140896.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well said. I'd double up-vote if I could. Men want affection as part of the experience.",
            "author": "JohnnyKemmer009",
            "id": "hyxh0pj",
            "parent_id": "t1_hyx2429",
            "score": 5,
            "created_utc": 1646152920.0,
            "replies": []
        },
        {
            "body": "Nailed it.",
            "author": null,
            "id": "hyxc15p",
            "parent_id": "t1_hywnr07",
            "score": 10,
            "created_utc": 1646150934.0,
            "replies": []
        },
        {
            "body": "Nah, I disagree.\n\nI'm not saying there aren't SDs and SBs who act like they're escorts and johns, but I think the majority want actual relationships with people who give a shit about them.\n\nJust about any SB even if she's on PPM could have an actual emergency, message her SD, and ask for help. Most of the time she'd get help, unless she had a habit of abusing the guy's good will. (The help she'd need might not even be financial in nature).\n\nI very much doubt an escort would call a john for help. Maybe she would/could if she'd had a client for 5-10 years. It's the difference between a FWB and your doctor. A FWB would totally ask you for help moving, your drycleaner wont.\n\nThere is a difference, even in the most transactional SRs, unless the guy is an actual john.",
            "author": "Athensbirds",
            "id": "hywp02r",
            "parent_id": "t1_hywnr07",
            "score": -3,
            "created_utc": 1646140570.0,
            "replies": [
                {
                    "body": "You need to get on YouTube. There’s an absolute example if an escort (openly advertises as an escort) who has regulars she calls on for emergencies, help (hell even one of them walks her dog for her) and calls them her SDs.",
                    "author": "TX_SB",
                    "id": "hywqhxz",
                    "parent_id": "t1_hywp02r",
                    "score": 10,
                    "created_utc": 1646141363.0,
                    "replies": []
                },
                {
                    "body": "I think you're being naive. Your argument sounds strangely like something I would have said before I had more experience in the sugar bowl. It's such an idealized version of what the sugar world actually is. I'm not saying the type of relationship you describe doesn't exist but it's laughable to think that's what most are seeking and what most find. It's simply not the case.",
                    "author": "Sugar-Monkey",
                    "id": "hywqfob",
                    "parent_id": "t1_hywp02r",
                    "score": 12,
                    "created_utc": 1646141330.0,
                    "replies": [
                        {
                            "body": "Well, I make an effort to filter out people who come across as escorts, so maybe that plays into it.",
                            "author": "Athensbirds",
                            "id": "hyws3d0",
                            "parent_id": "t1_hywqfob",
                            "score": -3,
                            "created_utc": 1646142182.0,
                            "replies": [
                                {
                                    "body": "Maybe you're right. I don't know but I do know that a lot of the women who market themselves as the ideal version of an SB aren't really being truthful about what they're doing behind the scenes. The same goes for SDs. I don't want to make this out as an issue for only one side.",
                                    "author": "Sugar-Monkey",
                                    "id": "hywsoqn",
                                    "parent_id": "t1_hyws3d0",
                                    "score": 9,
                                    "created_utc": 1646142480.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">Just about any SB even if she's on PPM could have an actual emergency, message her SD, and ask for help. Most of the time she'd get help, unless she had a habit of abusing the guy's good will. (The help she'd need might not even be financial in nature).\n\nThis is a good point. If my SB called or texted me that she needed a ride because of car trouble, I'd help out and give her a ride. And I'm sure she would do the same for me. \n\nThat's not something I would expect in an escort-john relationship. But maybe I'm wrong.",
                    "author": "BinghamtonSD",
                    "id": "hyx5rfm",
                    "parent_id": "t1_hywp02r",
                    "score": 2,
                    "created_utc": 1646148358.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Call a hundred, see what percentage say no.",
            "author": "Athensbirds",
            "id": "hywrpk2",
            "parent_id": "t1_hywq4ss",
            "score": -1,
            "created_utc": 1646141986.0,
            "replies": [
                {
                    "body": "If I was one and you called me, I would say no.",
                    "author": "TX_SB",
                    "id": "hywujcr",
                    "parent_id": "t1_hywrpk2",
                    "score": 10,
                    "created_utc": 1646143383.0,
                    "replies": [
                        {
                            "body": "I’m falling in love with you lol",
                            "author": "Kevinburnz",
                            "id": "hywymmj",
                            "parent_id": "t1_hywujcr",
                            "score": 3,
                            "created_utc": 1646145276.0,
                            "replies": []
                        },
                        {
                            "body": "Yeah, but if I found your number in the phone book and called you, you wouldn't know squat about me, you'd say no based on what? Even if you genuinely dislike people like me to your core, how would you know? You wouldn't have a nice long M&G to get to know me, you'd just have me knocking on your hotel room door or vice versa.\n\nKinda proves my point.",
                            "author": "Athensbirds",
                            "id": "hyx70mi",
                            "parent_id": "t1_hywujcr",
                            "score": -1,
                            "created_utc": 1646148882.0,
                            "replies": [
                                {
                                    "body": "The man doth protest too much, methinks. \n\nIt’s entertaining that you don’t understand why I wouldn’t see you.",
                                    "author": "TX_SB",
                                    "id": "hyxge36",
                                    "parent_id": "t1_hyx70mi",
                                    "score": 9,
                                    "created_utc": 1646152676.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed that I did not describe a high end escort. I was establishing a definition of prostitution. \n\nThe comment I replied to essentially was *does PPM in and of itself “clearly and legally” define an “SR” as in fact being an escorting situation. I say nope. \n\nOTOH, if a woman calling herself an “SB” told you if you want to be with her it’s gonna be X for every hour you’re together with her, I don’t think that’s an SR. \n\nEven in vanilla dating there’s a point where the daters agree to say goodnight and go home, if they didn’t plan to have a sleepover. \n\n🤷🏻‍♂️",
            "author": "Chill_SD1974",
            "id": "hyx7i8n",
            "parent_id": "t1_hyx3kzf",
            "score": 2,
            "created_utc": 1646149081.0,
            "replies": []
        },
        {
            "body": "OP distinguishes SB (when not attracted) vs escort as inherently less dangerous. Is this true?",
            "author": "daddoms",
            "id": "hyx6lug",
            "parent_id": "t1_hyx5ap1",
            "score": 0,
            "created_utc": 1646148712.0,
            "replies": [
                {
                    "body": "It depends on the type of escort. As I mentioned, it's the criminalization that makes SW more dangerous than anything else. \n\nTherefore, the type of SW will determine the exposure. Street workers are inherently more exposed than indoor workers. Higher end escorts are less exposed than lower end-and even many sugar workers. Many SW practice regular safer sex and get tested regularly, so they are as safe, if not more, as any monogamous SB. Then there are other types of SW-like OF, web camming, stripping, and pro-Domme work that is much safer than sugaring-because there is less intimate sexual interaction. \n\nTristan Terimino has an excellent podcast called Sex Out Loud. She's a leader in the sex positive movement. I just finished listening to episode 96, where she had two long time scholars on SW rights were speaking to this very subject.\n https://sexoutloud.libsyn.com/scientists-for-sex-worker-rights-with-barb-and-ron",
                    "author": "LadyMorgan2018",
                    "id": "hyx8tbp",
                    "parent_id": "t1_hyx6lug",
                    "score": 8,
                    "created_utc": 1646149621.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like someone with an agenda which doesn’t really fit in with the bowl",
            "author": "wb19081908",
            "id": "hywy855",
            "parent_id": "t1_hywwz02",
            "score": -2,
            "created_utc": 1646145092.0,
            "replies": []
        },
        {
            "body": "Excellent replies. These are accurate insights into escorts.",
            "author": "JohnnyKemmer009",
            "id": "hyxgr3s",
            "parent_id": "t1_hywoje2",
            "score": 2,
            "created_utc": 1646152817.0,
            "replies": []
        },
        {
            "body": "Excellent replies. These are accurate insights into escorts.",
            "author": "JohnnyKemmer009",
            "id": "hyxgszd",
            "parent_id": "t1_hywoje2",
            "score": 2,
            "created_utc": 1646152837.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hywosj1",
            "parent_id": "t1_hywoje2",
            "score": 0,
            "created_utc": 1646140456.0,
            "replies": []
        },
        {
            "body": "It doesn’t matter though. When multiple people are involved, your risk of STDs, as well as your risk of something going wrong and someone you thought you “trusted” becoming abusive, increases a hundredfold. I already don’t know if my SD is having sex with other people. Why would I increase my risk by having multiple “clients”?",
            "author": null,
            "id": "hywp8qa",
            "parent_id": "t1_hywoje2",
            "score": -15,
            "created_utc": 1646140701.0,
            "replies": [
                {
                    "body": "I’m not sure why you’re debating with me. Is it because I’m a female? You said nothing to the men who made the exact same comment that I did. Let’s agree to disagree but feel free to defend your position.",
                    "author": "TX_SB",
                    "id": "hywpjg4",
                    "parent_id": "t1_hywp8qa",
                    "score": 11,
                    "created_utc": 1646140858.0,
                    "replies": [
                        {
                            "body": "I didn’t even know you were female, I didn’t look at your username. I responded to you because it was the most recent comment.",
                            "author": null,
                            "id": "hywpm0h",
                            "parent_id": "t1_hywpjg4",
                            "score": -2,
                            "created_utc": 1646140896.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You need to get on YouTube. There’s an absolute example if an escort (openly advertises as an escort) who has regulars she calls on for emergencies, help (hell even one of them walks her dog for her) and calls them her SDs.",
            "author": "TX_SB",
            "id": "hywqhxz",
            "parent_id": "t1_hywp02r",
            "score": 10,
            "created_utc": 1646141363.0,
            "replies": []
        },
        {
            "body": "I think you're being naive. Your argument sounds strangely like something I would have said before I had more experience in the sugar bowl. It's such an idealized version of what the sugar world actually is. I'm not saying the type of relationship you describe doesn't exist but it's laughable to think that's what most are seeking and what most find. It's simply not the case.",
            "author": "Sugar-Monkey",
            "id": "hywqfob",
            "parent_id": "t1_hywp02r",
            "score": 12,
            "created_utc": 1646141330.0,
            "replies": [
                {
                    "body": "Well, I make an effort to filter out people who come across as escorts, so maybe that plays into it.",
                    "author": "Athensbirds",
                    "id": "hyws3d0",
                    "parent_id": "t1_hywqfob",
                    "score": -3,
                    "created_utc": 1646142182.0,
                    "replies": [
                        {
                            "body": "Maybe you're right. I don't know but I do know that a lot of the women who market themselves as the ideal version of an SB aren't really being truthful about what they're doing behind the scenes. The same goes for SDs. I don't want to make this out as an issue for only one side.",
                            "author": "Sugar-Monkey",
                            "id": "hywsoqn",
                            "parent_id": "t1_hyws3d0",
                            "score": 9,
                            "created_utc": 1646142480.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Just about any SB even if she's on PPM could have an actual emergency, message her SD, and ask for help. Most of the time she'd get help, unless she had a habit of abusing the guy's good will. (The help she'd need might not even be financial in nature).\n\nThis is a good point. If my SB called or texted me that she needed a ride because of car trouble, I'd help out and give her a ride. And I'm sure she would do the same for me. \n\nThat's not something I would expect in an escort-john relationship. But maybe I'm wrong.",
            "author": "BinghamtonSD",
            "id": "hyx5rfm",
            "parent_id": "t1_hywp02r",
            "score": 2,
            "created_utc": 1646148358.0,
            "replies": []
        },
        {
            "body": "If I was one and you called me, I would say no.",
            "author": "TX_SB",
            "id": "hywujcr",
            "parent_id": "t1_hywrpk2",
            "score": 10,
            "created_utc": 1646143383.0,
            "replies": [
                {
                    "body": "I’m falling in love with you lol",
                    "author": "Kevinburnz",
                    "id": "hywymmj",
                    "parent_id": "t1_hywujcr",
                    "score": 3,
                    "created_utc": 1646145276.0,
                    "replies": []
                },
                {
                    "body": "Yeah, but if I found your number in the phone book and called you, you wouldn't know squat about me, you'd say no based on what? Even if you genuinely dislike people like me to your core, how would you know? You wouldn't have a nice long M&G to get to know me, you'd just have me knocking on your hotel room door or vice versa.\n\nKinda proves my point.",
                    "author": "Athensbirds",
                    "id": "hyx70mi",
                    "parent_id": "t1_hywujcr",
                    "score": -1,
                    "created_utc": 1646148882.0,
                    "replies": [
                        {
                            "body": "The man doth protest too much, methinks. \n\nIt’s entertaining that you don’t understand why I wouldn’t see you.",
                            "author": "TX_SB",
                            "id": "hyxge36",
                            "parent_id": "t1_hyx70mi",
                            "score": 9,
                            "created_utc": 1646152676.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It depends on the type of escort. As I mentioned, it's the criminalization that makes SW more dangerous than anything else. \n\nTherefore, the type of SW will determine the exposure. Street workers are inherently more exposed than indoor workers. Higher end escorts are less exposed than lower end-and even many sugar workers. Many SW practice regular safer sex and get tested regularly, so they are as safe, if not more, as any monogamous SB. Then there are other types of SW-like OF, web camming, stripping, and pro-Domme work that is much safer than sugaring-because there is less intimate sexual interaction. \n\nTristan Terimino has an excellent podcast called Sex Out Loud. She's a leader in the sex positive movement. I just finished listening to episode 96, where she had two long time scholars on SW rights were speaking to this very subject.\n https://sexoutloud.libsyn.com/scientists-for-sex-worker-rights-with-barb-and-ron",
            "author": "LadyMorgan2018",
            "id": "hyx8tbp",
            "parent_id": "t1_hyx6lug",
            "score": 8,
            "created_utc": 1646149621.0,
            "replies": []
        },
        {
            "body": "I’m not sure why you’re debating with me. Is it because I’m a female? You said nothing to the men who made the exact same comment that I did. Let’s agree to disagree but feel free to defend your position.",
            "author": "TX_SB",
            "id": "hywpjg4",
            "parent_id": "t1_hywp8qa",
            "score": 11,
            "created_utc": 1646140858.0,
            "replies": [
                {
                    "body": "I didn’t even know you were female, I didn’t look at your username. I responded to you because it was the most recent comment.",
                    "author": null,
                    "id": "hywpm0h",
                    "parent_id": "t1_hywpjg4",
                    "score": -2,
                    "created_utc": 1646140896.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, I make an effort to filter out people who come across as escorts, so maybe that plays into it.",
            "author": "Athensbirds",
            "id": "hyws3d0",
            "parent_id": "t1_hywqfob",
            "score": -3,
            "created_utc": 1646142182.0,
            "replies": [
                {
                    "body": "Maybe you're right. I don't know but I do know that a lot of the women who market themselves as the ideal version of an SB aren't really being truthful about what they're doing behind the scenes. The same goes for SDs. I don't want to make this out as an issue for only one side.",
                    "author": "Sugar-Monkey",
                    "id": "hywsoqn",
                    "parent_id": "t1_hyws3d0",
                    "score": 9,
                    "created_utc": 1646142480.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m falling in love with you lol",
            "author": "Kevinburnz",
            "id": "hywymmj",
            "parent_id": "t1_hywujcr",
            "score": 3,
            "created_utc": 1646145276.0,
            "replies": []
        },
        {
            "body": "Yeah, but if I found your number in the phone book and called you, you wouldn't know squat about me, you'd say no based on what? Even if you genuinely dislike people like me to your core, how would you know? You wouldn't have a nice long M&G to get to know me, you'd just have me knocking on your hotel room door or vice versa.\n\nKinda proves my point.",
            "author": "Athensbirds",
            "id": "hyx70mi",
            "parent_id": "t1_hywujcr",
            "score": -1,
            "created_utc": 1646148882.0,
            "replies": [
                {
                    "body": "The man doth protest too much, methinks. \n\nIt’s entertaining that you don’t understand why I wouldn’t see you.",
                    "author": "TX_SB",
                    "id": "hyxge36",
                    "parent_id": "t1_hyx70mi",
                    "score": 9,
                    "created_utc": 1646152676.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I didn’t even know you were female, I didn’t look at your username. I responded to you because it was the most recent comment.",
            "author": null,
            "id": "hywpm0h",
            "parent_id": "t1_hywpjg4",
            "score": -2,
            "created_utc": 1646140896.0,
            "replies": []
        },
        {
            "body": "Maybe you're right. I don't know but I do know that a lot of the women who market themselves as the ideal version of an SB aren't really being truthful about what they're doing behind the scenes. The same goes for SDs. I don't want to make this out as an issue for only one side.",
            "author": "Sugar-Monkey",
            "id": "hywsoqn",
            "parent_id": "t1_hyws3d0",
            "score": 9,
            "created_utc": 1646142480.0,
            "replies": []
        },
        {
            "body": "The man doth protest too much, methinks. \n\nIt’s entertaining that you don’t understand why I wouldn’t see you.",
            "author": "TX_SB",
            "id": "hyxge36",
            "parent_id": "t1_hyx70mi",
            "score": 9,
            "created_utc": 1646152676.0,
            "replies": []
        }
    ]
}