{
    "title": "Always go with your gut",
    "post_id": "nvhrm1",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/nvhrm1/always_go_with_your_gut/",
    "author": "skyandsunshine123",
    "body": "This is gonna be controversial but I’m saying it for my SB’s who need to hear it!! So today I went and saw an SD I haven’t seen since last year...only seen him 4 times prior (he’s from out of town) and always got super drunk around him because I really didn’t like being around him. He was just really rude and selfish. Anyways today, I didn’t want to get drunk and I definitely didn’t want to see him, but I wanted money. So I drove out to see him and the second I saw him everything in my body told me to leave, so you know what I did, I left. I didn’t say anything besides “Oh I forgot something in my car” to avoid any confrontation and more importantly for my safety too. And texted him saying “Sorry I can’t do this, goodbye.” I felt really bad for him but I also felt a huge relief. I felt like I had more control over my body and life than ever. That I can put my mental health before my bank account. I no longer will give my body to someone to someone who I don’t like being around. Someone who I feel uneasy about, someone I simply don’t feel connected to, no matter the amount of money. It’s very easy to be kind and unfortunately, it’s not very easy to find genuinely kind SD’s. You know, a real gentlemen! Just remember ladies, you are in control. You set your own rules and your own values. Life is too short to be around people you cant stand. You deserve to be around someone who makes you happy! End of rant!",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/nvhrm1/always_go_with_your_gut/",
    "score": 331,
    "upvote_ratio": 0.98,
    "created_utc": 1623195115.0,
    "num_comments": 64,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "You’re absolutely right, real and genuine SD’s are few and far between. The unfortunate truth is that many men take advantage of SA as a platform to manipulate and abuse young women. \n\nRespect yourself and value your body. No amount of money is worth comprising your personal boundaries. You should be proud of yourself OP, sending *hugs*!",
            "author": "sugar_and_spice1",
            "id": "h13ac0q",
            "parent_id": "t3_nvhrm1",
            "score": 73,
            "created_utc": 1623195918.0,
            "replies": [
                {
                    "body": "I think you nailed it, I have definitely felt manipulated by SD’s in the past. Thankfully, I’m a lot wiser now and know better from experience. *sending hugs back*",
                    "author": "skyandsunshine123",
                    "id": "h13avx0",
                    "parent_id": "t1_h13ac0q",
                    "score": 22,
                    "created_utc": 1623196193.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's just an instant upvote from me.",
            "author": "ChapterRelative",
            "id": "h139hqy",
            "parent_id": "t3_nvhrm1",
            "score": 45,
            "created_utc": 1623195491.0,
            "replies": [
                {
                    "body": "The fact that you as an aspiring SD can respect OP's post shows you're a good man and will likely make future SBs very happy. Good luck :)",
                    "author": "Youllneverguess777",
                    "id": "h2zaih1",
                    "parent_id": "t1_h139hqy",
                    "score": 3,
                    "created_utc": 1624616016.0,
                    "replies": [
                        {
                            "body": "Thanks. Hopefully I'm making current SBs 😊",
                            "author": "ChapterRelative",
                            "id": "h2zaqyz",
                            "parent_id": "t1_h2zaih1",
                            "score": 3,
                            "created_utc": 1624616226.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes go with you gut!! \nMy horrible situation:\nCalled/ texted a SD he bought me plane tickets out to him\nLong story short as soon as we met I instantly wanted to go home but I was “stuck there for the weekend” \nHe made a few weird uncomfortable comments so I waited until he fell asleep snuck my stuff out of his house caught a cab at 3:30 AM  to the airport got my tickets changed and got on a flight home! \n\nAnd then HE got MAD at me for leaving. \nI didn’t get any money but money wasn’t worth my comfort or safety!",
            "author": "MariaMay0",
            "id": "h140u7v",
            "parent_id": "t3_nvhrm1",
            "score": 38,
            "created_utc": 1623209555.0,
            "replies": [
                {
                    "body": "WOW. I’ve done this in my city, I couldn’t imagine a flight though! You got guts ❤️❤️",
                    "author": "tryingtobehappii",
                    "id": "h146nws",
                    "parent_id": "t1_h140u7v",
                    "score": 13,
                    "created_utc": 1623212954.0,
                    "replies": [
                        {
                            "body": "After that I told me myself never again!! Unless we’ve met and hung out multiple times",
                            "author": "MariaMay0",
                            "id": "h15r7un",
                            "parent_id": "t1_h146nws",
                            "score": 3,
                            "created_utc": 1623250519.0,
                            "replies": [
                                {
                                    "body": "No, sorry I meant you had guts to leave & get on a flight without him knowing! Very inspriring!💕",
                                    "author": "tryingtobehappii",
                                    "id": "h15rso6",
                                    "parent_id": "t1_h15r7un",
                                    "score": 4,
                                    "created_utc": 1623250760.0,
                                    "replies": [
                                        {
                                            "body": "It was horrible. When it came bed time I was falling asleep on the couch so moved to his room\n\n(that being said I faked being tired to not have to sleep with him 😂) \n\nWithout asking or anything he grabs me from behind to cuddle and instantly puts his hand up my shirt and holds onto my boobs. \nThen when I said I was so tired and already asleep on the couch not in the mood he makes a comment:\nI hope I don’t molest you in the morning\n\nWho TF says that! \n\nThen I said “no thank you”\nHe asked if can put music on to fall asleep I say: sure what ever helps you fall asleep\n\nHis reply: A blow job always helps \n\nAll I said was oh ya\nAnd kept facing the wall",
                                            "author": "MariaMay0",
                                            "id": "h1618wf",
                                            "parent_id": "t1_h15rso6",
                                            "score": 5,
                                            "created_utc": 1623254560.0,
                                            "replies": [
                                                {
                                                    "body": "Ew omg",
                                                    "author": "tryingtobehappii",
                                                    "id": "h17q0um",
                                                    "parent_id": "t1_h1618wf",
                                                    "score": 5,
                                                    "created_utc": 1623279656.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Omg I thought this was going to be another one of those “my intuition was screaming no! BUT I went ahead anyway…. and now I regret it” kind of stories. \nThanks so much for listening to your intuition AND acting on it!\n\nThanks for sharing ❤️",
            "author": "natayy",
            "id": "h13m7ow",
            "parent_id": "t3_nvhrm1",
            "score": 29,
            "created_utc": 1623201995.0,
            "replies": [
                {
                    "body": "Even with intuition, just a gentle reminder that sometimes people are forced to do things they don't want to anyway... we definitely shouldn't victim-blame them.",
                    "author": "Youllneverguess777",
                    "id": "h2zapln",
                    "parent_id": "t1_h13m7ow",
                    "score": 2,
                    "created_utc": 1624616192.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The good SDs also feel that \"You deserve to be around someone who makes you happy!\" \n\nGood for you.",
            "author": null,
            "id": "h13bazu",
            "parent_id": "t3_nvhrm1",
            "score": 28,
            "created_utc": 1623196394.0,
            "replies": []
        },
        {
            "body": "I have been shocked to read so many of the posts here by SBs who go along with things that they despise and then feel disgusted with themselves. This is a very important post for all SBs, especially the inexperienced ones not to do anything they don't want to do.",
            "author": "Monte_Sailor",
            "id": "h14atsj",
            "parent_id": "t3_nvhrm1",
            "score": 7,
            "created_utc": 1623215650.0,
            "replies": [
                {
                    "body": "It's not always as simple as just leaving, though. You may not understand it but sometimes women feel they will be in even more danger if they try to leave and whole fight or flight is real, people also freeze when they're terrified as well.",
                    "author": "Youllneverguess777",
                    "id": "h2zatit",
                    "parent_id": "t1_h14atsj",
                    "score": 4,
                    "created_utc": 1624616290.0,
                    "replies": [
                        {
                            "body": "I do understand the vulnerable position women can find themselves in. So, how can SBs, or any women for that matter, prepare to deal with it, if and when it happens? \n\nI would think, first, gain the knowledge and judgment not to put yourself in that situation, right? Reading posts here is a great resource for SBs to know the importance of screening. I wish there is a class on how to screen for SBs. \n\nSecond, learn self defense techniques? Like a knee to the crotch? Simple martial arts, pepper sprays? \n\nI agree it is easy for me to say \"don't do anything you don't want to do.\" But given the high risks, I hope SBs will invest in preparing themselves for such bad situations. \n\nDoesn't it also depend upon building up your strength, self esteem and confidence to react to such situation with the attitude that \"I will not be exploited\"? \n\nThis is such a critical issue. I hope this forum can continue to be a great resource for SBs to gain the knowledge, skills and self confidence to handle bad situations. Thanks for your feedback.",
                            "author": "Monte_Sailor",
                            "id": "h31igny",
                            "parent_id": "t1_h2zatit",
                            "score": 2,
                            "created_utc": 1624656960.0,
                            "replies": [
                                {
                                    "body": "Saying things like, \"Putting themselves in the situation\" comes off rapey to me. Ofc a SB can look oit for herself and be smart, but again, it's not always that simple. And self-defense... you're joking right? Most SDs have easily 100lbs on a SB and they're men. That's almost laughable if it wasn't so problematic.",
                                    "author": "Youllneverguess777",
                                    "id": "h31iy4l",
                                    "parent_id": "t1_h31igny",
                                    "score": 2,
                                    "created_utc": 1624657202.0,
                                    "replies": [
                                        {
                                            "body": "So, you have some solutions to offer?",
                                            "author": "Monte_Sailor",
                                            "id": "h329ngy",
                                            "parent_id": "t1_h31iy4l",
                                            "score": 1,
                                            "created_utc": 1624671881.0,
                                            "replies": [
                                                {
                                                    "body": "All a SB can do is her best but we can't be held responsible for the actions of shitty men. It's the reality all women face, SB or not. A solution would be for rapists to stop raping people or murdering them or taking out their rejection issues on women...",
                                                    "author": "Youllneverguess777",
                                                    "id": "h32cxxy",
                                                    "parent_id": "t1_h329ngy",
                                                    "score": 2,
                                                    "created_utc": 1624673781.0,
                                                    "replies": [
                                                        {
                                                            "body": "Absolutely, no SB or any woman can be held responsible for the despicable act of rapists, murderers, abusers, fake SDs or obnoxious SDs, irrespective of what she did or did not do. As you say, the SB can only do her best. I was just trying to suggest a few things that could fall within the parameters of \"doing her best\", to protect them selves, given the risks they run being SBs, and as you point out, this world has those dangerous and/or obnoxious characters. But I agree with you, they can still be vulnerable against these characters even after taking prudent precautions.",
                                                            "author": "Monte_Sailor",
                                                            "id": "h36i10b",
                                                            "parent_id": "t1_h32cxxy",
                                                            "score": 1,
                                                            "created_utc": 1624768251.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You know what, I was on the other side of the equation about six weeks ago.\nA SB that I had seen a few times and I set a date, I booked a hotel and she confirmed that morning she was going to meet me.\nWhen the time arrived, she basically blocked me on everything.\nI was confused, she had seen me 4-5 times; she actually reached out to initiate (she needed money, I guess).... but then, she probably felt like you and ghosted.\n\nI agree, SBs need to follow their gut and if the guy doesn't work for them just move on.\n\n(I was never rude or bad, but, I may have brought tough memories of a time in her life she had problems at home....maybe I was a reminder of that time...)",
            "author": "Worldly_Forever_9353",
            "id": "h139byf",
            "parent_id": "t3_nvhrm1",
            "score": 13,
            "created_utc": 1623195407.0,
            "replies": [
                {
                    "body": "I’m sorry that happened, you might’ve done absolutely nothing wrong. Maybe she decided this lifestyle wasn’t for her anymore. Also, I will add that younger women in their early 20’s (me) can be very indecisive (also me)",
                    "author": "skyandsunshine123",
                    "id": "h139y4i",
                    "parent_id": "t1_h139byf",
                    "score": 9,
                    "created_utc": 1623195723.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h13it3l",
                            "parent_id": "t1_h139y4i",
                            "score": 10,
                            "created_utc": 1623200207.0,
                            "replies": [
                                {
                                    "body": "😀",
                                    "author": "wb19081908",
                                    "id": "h13mhci",
                                    "parent_id": "t1_h13it3l",
                                    "score": 2,
                                    "created_utc": 1623202132.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I would agree with skyandsunshine this is not necessarily something to do with you. In fact she may have liked you so much it was too much for her to deal with. Or her boyfriend may have found out, or her parents. Or a whole bunch of stuff not even related to the arrangement.",
                    "author": "Neither-Ad-2833",
                    "id": "h13ibpz",
                    "parent_id": "t1_h139byf",
                    "score": 4,
                    "created_utc": 1623199964.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "h150ud8",
                    "parent_id": "t1_h139byf",
                    "score": 1,
                    "created_utc": 1623237007.0,
                    "replies": [
                        {
                            "body": "It's not always that simple... women put themselves at risk when rejecting a man. Please be more understanding in the future.",
                            "author": "Youllneverguess777",
                            "id": "h2zayep",
                            "parent_id": "t1_h150ud8",
                            "score": 1,
                            "created_utc": 1624616408.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why would anyone find this controversial?    SDs don’t want you with us if you don’t want to be with us.",
            "author": null,
            "id": "h13953e",
            "parent_id": "t3_nvhrm1",
            "score": 19,
            "created_utc": 1623195311.0,
            "replies": [
                {
                    "body": "\\+1 here. I want my SB to enjoy her time with me.",
                    "author": "sfwinefan",
                    "id": "h13c6cu",
                    "parent_id": "t1_h13953e",
                    "score": 9,
                    "created_utc": 1623196831.0,
                    "replies": []
                },
                {
                    "body": "Yes!!!!! Nothing is worse than being with a SB who is only there because she needs the money, period.",
                    "author": "BusddhistDSM",
                    "id": "h13afcf",
                    "parent_id": "t1_h13953e",
                    "score": 14,
                    "created_utc": 1623195965.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Love this. When you listen to your instincts you gain more self trust & self love. Need to remember to do this more! Wow. 💗",
            "author": "tryingtobehappii",
            "id": "h146jeh",
            "parent_id": "t3_nvhrm1",
            "score": 4,
            "created_utc": 1623212875.0,
            "replies": []
        },
        {
            "body": "The amount of SD that are controlling and aggressive is so gross. I’m not one to down everyone but, I feel like the way an SR works is you get to know each other... and if there’s a click there’s a click. Could never go on a SR date  again if there was no clicking in the first one... FIRST DATES MATTER!",
            "author": "BushProbably-Did-911",
            "id": "h15jpw7",
            "parent_id": "t3_nvhrm1",
            "score": 3,
            "created_utc": 1623247330.0,
            "replies": []
        },
        {
            "body": "You said it , \"give my body\" this is so much more powerful than chump change PPMs qhen SDs whime about, but \"$$$\" gimme a break.",
            "author": "bookworm010101",
            "id": "h16g04d",
            "parent_id": "t3_nvhrm1",
            "score": 4,
            "created_utc": 1623260431.0,
            "replies": []
        },
        {
            "body": "Thanks for this, needed it TODAY!",
            "author": "FuckUDoin",
            "id": "h156z8h",
            "parent_id": "t3_nvhrm1",
            "score": 3,
            "created_utc": 1623240947.0,
            "replies": []
        },
        {
            "body": "Listening to your gut/intuition can actually save your life. Also biology says our gut rivals the brain with how intelligent it is, (I’m weirdly passionate about gut health). I’m glad you listened. A few hundred is not worth your life bb 💕",
            "author": "Annual_Echo9355",
            "id": "h16lj97",
            "parent_id": "t3_nvhrm1",
            "score": 3,
            "created_utc": 1623262708.0,
            "replies": []
        },
        {
            "body": "Amen to this 👌",
            "author": null,
            "id": "h13k4aw",
            "parent_id": "t3_nvhrm1",
            "score": 4,
            "created_utc": 1623200920.0,
            "replies": []
        },
        {
            "body": "You did the right thing. And you really don't need to feel bad for him if he's rude and selfish. He's getting what he deserves.",
            "author": "Aristocrafts",
            "id": "h14974n",
            "parent_id": "t3_nvhrm1",
            "score": 2,
            "created_utc": 1623214577.0,
            "replies": []
        },
        {
            "body": "If your gut said “I should of never done this to begin with since my past experiences were bad “ , then yes trust your gut.  Then you wouldn’t of had to do that horrible ghost out when you realized it was a bad idea to begin with.  No amount of money is worth it if the situation is bad.",
            "author": "RedHeavyG603",
            "id": "h1503oy",
            "parent_id": "t3_nvhrm1",
            "score": 2,
            "created_utc": 1623236468.0,
            "replies": []
        },
        {
            "body": "Yes thank you for this! It took me a while to stop just being nice and passive when I felt uncomfortable or potentially unsafe. If you creep me out, I don't care about hurting your feelings. Goodbye!",
            "author": null,
            "id": "h184szh",
            "parent_id": "t3_nvhrm1",
            "score": 2,
            "created_utc": 1623286931.0,
            "replies": []
        },
        {
            "body": "You were 1000% right. Nice.",
            "author": "goopy-goo",
            "id": "h18hcdl",
            "parent_id": "t3_nvhrm1",
            "score": 2,
            "created_utc": 1623293139.0,
            "replies": []
        },
        {
            "body": "This is such an important reminder, upvoted!",
            "author": "U_got_no_jams",
            "id": "h13qm5q",
            "parent_id": "t3_nvhrm1",
            "score": 3,
            "created_utc": 1623204185.0,
            "replies": []
        },
        {
            "body": "Fuck I'm sorry you had to go through that. I'm relieved to hear that you're okay and that you put your foot down",
            "author": null,
            "id": "h13vcgy",
            "parent_id": "t3_nvhrm1",
            "score": 2,
            "created_utc": 1623206622.0,
            "replies": []
        },
        {
            "body": "It’s controversial because you led him on and wasted his time. I would be mad if someone bailed on me like that. \n\nWe do the sugar arrangements because we don’t have time for the indecisiveness. Don’t plan a date if you are not sure.\n\nWhy would you meet him 4 times if you weren’t comfortable with him? I get one meeting but 4 times?",
            "author": "professorxc",
            "id": "h13eglz",
            "parent_id": "t3_nvhrm1",
            "score": -15,
            "created_utc": 1623197982.0,
            "replies": [
                {
                    "body": "It’s very annoying when it happens to you but she didn’t lead him on. \nA SB should feel free to flee at anytime and in fact if a SB is contemplating it she should definitely leave. \nIf a SD tricks or convinces a girl to see him and he is not a nice person, HE is the one at fault for leading HER on to believe he was a human being. And her realisation of that isn’t a reason to blame her for his loss. \nPeople tend to give the benefit of the doubt, and it can take overwhelming evidence in order for someone to take action. Young people are especially prone to this but even I still do it too much because I just don’t want to believe people are dicks.",
                    "author": "Neither-Ad-2833",
                    "id": "h13j97p",
                    "parent_id": "t1_h13eglz",
                    "score": 14,
                    "created_utc": 1623200453.0,
                    "replies": []
                },
                {
                    "body": "Dude fuck off. We should be encouraging women to consider their gut feelings for safety over some man’s comfort who doesn’t give a shit about her.",
                    "author": null,
                    "id": "h13iq5i",
                    "parent_id": "t1_h13eglz",
                    "score": 15,
                    "created_utc": 1623200166.0,
                    "replies": [
                        {
                            "body": "Did you read the OP? She met him 4 times already.",
                            "author": "professorxc",
                            "id": "h141vg5",
                            "parent_id": "t1_h13iq5i",
                            "score": 1,
                            "created_utc": 1623210124.0,
                            "replies": [
                                {
                                    "body": "Anyone has the right to leave a situation at any moment, sugar or not.",
                                    "author": "zinapallas",
                                    "id": "h146vf5",
                                    "parent_id": "t1_h141vg5",
                                    "score": 10,
                                    "created_utc": 1623213089.0,
                                    "replies": [
                                        {
                                            "body": "Oh the downvotes from the white knights and the flakers. \n\nAll I am saying is, it’s shitty to plan a date with someone who you have met a couple of times and then bail at the last minute.",
                                            "author": "professorxc",
                                            "id": "h15a47v",
                                            "parent_id": "t1_h146vf5",
                                            "score": 2,
                                            "created_utc": 1623242713.0,
                                            "replies": [
                                                {
                                                    "body": "It’s also shitty to force yourself to withstand an uncomfortable situation, have the other party under the wrong impression that you are enjoying yourself, and potentially dealing with the anxiety of worrying for your safety. I mean I get where you’re coming from in a way, but certainly you see elevated risk of danger when it comes to these relationships.",
                                                    "author": "zinapallas",
                                                    "id": "h1632wv",
                                                    "parent_id": "t1_h15a47v",
                                                    "score": 7,
                                                    "created_utc": 1623255290.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yeh you go encouraging her when she admitted what she did was shitty",
                            "author": "wb19081908",
                            "id": "h13mqfj",
                            "parent_id": "t1_h13iq5i",
                            "score": -4,
                            "created_utc": 1623202255.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Because my entire mindset changed on how I want to be an SB and how I value myself, that’s why.\n\nI do understand what I did was shitty though, too.",
                    "author": "skyandsunshine123",
                    "id": "h13h0wi",
                    "parent_id": "t1_h13eglz",
                    "score": 7,
                    "created_utc": 1623199273.0,
                    "replies": [
                        {
                            "body": "What you did was not shitty. Nobody should tolerate shitty people, that’s on him.",
                            "author": null,
                            "id": "h13im29",
                            "parent_id": "t1_h13h0wi",
                            "score": 9,
                            "created_utc": 1623200107.0,
                            "replies": [
                                {
                                    "body": "Don’t know the complete situation, but if the SD flew in from out of town specifically to meet OP and then OP bails, this seems more like a vindictive power play to me. “This guy liked me enough to fly out to me, but I just coincidentally remembered he was a shitty SD so I’m going to bail on him just for funsies.”",
                                    "author": "Wargasm69",
                                    "id": "h14cdu2",
                                    "parent_id": "t1_h13im29",
                                    "score": -2,
                                    "created_utc": 1623216730.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "So was he there on a business trip or did he fly from out of town specifically to meet you?",
                            "author": "Wargasm69",
                            "id": "h14bzlw",
                            "parent_id": "t1_h13h0wi",
                            "score": 2,
                            "created_utc": 1623216454.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nice guys also sometimes finish last. Also, don't give a SB too much benefit of the doubt. If you don’t feel it, it's fine to go next!",
            "author": "Oldergoodguy",
            "id": "h13adwc",
            "parent_id": "t3_nvhrm1",
            "score": -7,
            "created_utc": 1623195945.0,
            "replies": [
                {
                    "body": "I don’t think nice SD’s finish last at all! I have never ever EVER thought an SD was too kind. Lol. Most of the time, I’m always wondering why they’re so mean!",
                    "author": "skyandsunshine123",
                    "id": "h13arqt",
                    "parent_id": "t1_h13adwc",
                    "score": 16,
                    "created_utc": 1623196136.0,
                    "replies": [
                        {
                            "body": "I had a SB tell me that I was almost too nice and also generous. She said she hit the lottery etc. Dropped her for the bad vibe.",
                            "author": "Oldergoodguy",
                            "id": "h13bydu",
                            "parent_id": "t1_h13arqt",
                            "score": -11,
                            "created_utc": 1623196720.0,
                            "replies": [
                                {
                                    "body": "Idk how that would give you a bad vibe. Sounds like a pretty awesome compliment to me lol",
                                    "author": "skyandsunshine123",
                                    "id": "h13cny6",
                                    "parent_id": "t1_h13bydu",
                                    "score": 21,
                                    "created_utc": 1623197074.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The sugar bowl is not cut out for you.\n\nPlease leave.",
            "author": "Ray2020K",
            "id": "h16xu7j",
            "parent_id": "t3_nvhrm1",
            "score": -2,
            "created_utc": 1623267678.0,
            "replies": []
        },
        {
            "body": "We both are in control...not just hers.",
            "author": null,
            "id": "h14aiuv",
            "parent_id": "t3_nvhrm1",
            "score": 1,
            "created_utc": 1623215442.0,
            "replies": []
        },
        {
            "body": "Good girl 👏🏾👏🏾👏🏾👏🏾👏🏾",
            "author": "Zealousideal_Map8100",
            "id": "h17qs67",
            "parent_id": "t3_nvhrm1",
            "score": 1,
            "created_utc": 1623280023.0,
            "replies": []
        },
        {
            "body": "I think you nailed it, I have definitely felt manipulated by SD’s in the past. Thankfully, I’m a lot wiser now and know better from experience. *sending hugs back*",
            "author": "skyandsunshine123",
            "id": "h13avx0",
            "parent_id": "t1_h13ac0q",
            "score": 22,
            "created_utc": 1623196193.0,
            "replies": []
        },
        {
            "body": "The fact that you as an aspiring SD can respect OP's post shows you're a good man and will likely make future SBs very happy. Good luck :)",
            "author": "Youllneverguess777",
            "id": "h2zaih1",
            "parent_id": "t1_h139hqy",
            "score": 3,
            "created_utc": 1624616016.0,
            "replies": [
                {
                    "body": "Thanks. Hopefully I'm making current SBs 😊",
                    "author": "ChapterRelative",
                    "id": "h2zaqyz",
                    "parent_id": "t1_h2zaih1",
                    "score": 3,
                    "created_utc": 1624616226.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "WOW. I’ve done this in my city, I couldn’t imagine a flight though! You got guts ❤️❤️",
            "author": "tryingtobehappii",
            "id": "h146nws",
            "parent_id": "t1_h140u7v",
            "score": 13,
            "created_utc": 1623212954.0,
            "replies": [
                {
                    "body": "After that I told me myself never again!! Unless we’ve met and hung out multiple times",
                    "author": "MariaMay0",
                    "id": "h15r7un",
                    "parent_id": "t1_h146nws",
                    "score": 3,
                    "created_utc": 1623250519.0,
                    "replies": [
                        {
                            "body": "No, sorry I meant you had guts to leave & get on a flight without him knowing! Very inspriring!💕",
                            "author": "tryingtobehappii",
                            "id": "h15rso6",
                            "parent_id": "t1_h15r7un",
                            "score": 4,
                            "created_utc": 1623250760.0,
                            "replies": [
                                {
                                    "body": "It was horrible. When it came bed time I was falling asleep on the couch so moved to his room\n\n(that being said I faked being tired to not have to sleep with him 😂) \n\nWithout asking or anything he grabs me from behind to cuddle and instantly puts his hand up my shirt and holds onto my boobs. \nThen when I said I was so tired and already asleep on the couch not in the mood he makes a comment:\nI hope I don’t molest you in the morning\n\nWho TF says that! \n\nThen I said “no thank you”\nHe asked if can put music on to fall asleep I say: sure what ever helps you fall asleep\n\nHis reply: A blow job always helps \n\nAll I said was oh ya\nAnd kept facing the wall",
                                    "author": "MariaMay0",
                                    "id": "h1618wf",
                                    "parent_id": "t1_h15rso6",
                                    "score": 5,
                                    "created_utc": 1623254560.0,
                                    "replies": [
                                        {
                                            "body": "Ew omg",
                                            "author": "tryingtobehappii",
                                            "id": "h17q0um",
                                            "parent_id": "t1_h1618wf",
                                            "score": 5,
                                            "created_utc": 1623279656.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Even with intuition, just a gentle reminder that sometimes people are forced to do things they don't want to anyway... we definitely shouldn't victim-blame them.",
            "author": "Youllneverguess777",
            "id": "h2zapln",
            "parent_id": "t1_h13m7ow",
            "score": 2,
            "created_utc": 1624616192.0,
            "replies": []
        },
        {
            "body": "It's not always as simple as just leaving, though. You may not understand it but sometimes women feel they will be in even more danger if they try to leave and whole fight or flight is real, people also freeze when they're terrified as well.",
            "author": "Youllneverguess777",
            "id": "h2zatit",
            "parent_id": "t1_h14atsj",
            "score": 4,
            "created_utc": 1624616290.0,
            "replies": [
                {
                    "body": "I do understand the vulnerable position women can find themselves in. So, how can SBs, or any women for that matter, prepare to deal with it, if and when it happens? \n\nI would think, first, gain the knowledge and judgment not to put yourself in that situation, right? Reading posts here is a great resource for SBs to know the importance of screening. I wish there is a class on how to screen for SBs. \n\nSecond, learn self defense techniques? Like a knee to the crotch? Simple martial arts, pepper sprays? \n\nI agree it is easy for me to say \"don't do anything you don't want to do.\" But given the high risks, I hope SBs will invest in preparing themselves for such bad situations. \n\nDoesn't it also depend upon building up your strength, self esteem and confidence to react to such situation with the attitude that \"I will not be exploited\"? \n\nThis is such a critical issue. I hope this forum can continue to be a great resource for SBs to gain the knowledge, skills and self confidence to handle bad situations. Thanks for your feedback.",
                    "author": "Monte_Sailor",
                    "id": "h31igny",
                    "parent_id": "t1_h2zatit",
                    "score": 2,
                    "created_utc": 1624656960.0,
                    "replies": [
                        {
                            "body": "Saying things like, \"Putting themselves in the situation\" comes off rapey to me. Ofc a SB can look oit for herself and be smart, but again, it's not always that simple. And self-defense... you're joking right? Most SDs have easily 100lbs on a SB and they're men. That's almost laughable if it wasn't so problematic.",
                            "author": "Youllneverguess777",
                            "id": "h31iy4l",
                            "parent_id": "t1_h31igny",
                            "score": 2,
                            "created_utc": 1624657202.0,
                            "replies": [
                                {
                                    "body": "So, you have some solutions to offer?",
                                    "author": "Monte_Sailor",
                                    "id": "h329ngy",
                                    "parent_id": "t1_h31iy4l",
                                    "score": 1,
                                    "created_utc": 1624671881.0,
                                    "replies": [
                                        {
                                            "body": "All a SB can do is her best but we can't be held responsible for the actions of shitty men. It's the reality all women face, SB or not. A solution would be for rapists to stop raping people or murdering them or taking out their rejection issues on women...",
                                            "author": "Youllneverguess777",
                                            "id": "h32cxxy",
                                            "parent_id": "t1_h329ngy",
                                            "score": 2,
                                            "created_utc": 1624673781.0,
                                            "replies": [
                                                {
                                                    "body": "Absolutely, no SB or any woman can be held responsible for the despicable act of rapists, murderers, abusers, fake SDs or obnoxious SDs, irrespective of what she did or did not do. As you say, the SB can only do her best. I was just trying to suggest a few things that could fall within the parameters of \"doing her best\", to protect them selves, given the risks they run being SBs, and as you point out, this world has those dangerous and/or obnoxious characters. But I agree with you, they can still be vulnerable against these characters even after taking prudent precautions.",
                                                    "author": "Monte_Sailor",
                                                    "id": "h36i10b",
                                                    "parent_id": "t1_h32cxxy",
                                                    "score": 1,
                                                    "created_utc": 1624768251.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m sorry that happened, you might’ve done absolutely nothing wrong. Maybe she decided this lifestyle wasn’t for her anymore. Also, I will add that younger women in their early 20’s (me) can be very indecisive (also me)",
            "author": "skyandsunshine123",
            "id": "h139y4i",
            "parent_id": "t1_h139byf",
            "score": 9,
            "created_utc": 1623195723.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h13it3l",
                    "parent_id": "t1_h139y4i",
                    "score": 10,
                    "created_utc": 1623200207.0,
                    "replies": [
                        {
                            "body": "😀",
                            "author": "wb19081908",
                            "id": "h13mhci",
                            "parent_id": "t1_h13it3l",
                            "score": 2,
                            "created_utc": 1623202132.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would agree with skyandsunshine this is not necessarily something to do with you. In fact she may have liked you so much it was too much for her to deal with. Or her boyfriend may have found out, or her parents. Or a whole bunch of stuff not even related to the arrangement.",
            "author": "Neither-Ad-2833",
            "id": "h13ibpz",
            "parent_id": "t1_h139byf",
            "score": 4,
            "created_utc": 1623199964.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "h150ud8",
            "parent_id": "t1_h139byf",
            "score": 1,
            "created_utc": 1623237007.0,
            "replies": [
                {
                    "body": "It's not always that simple... women put themselves at risk when rejecting a man. Please be more understanding in the future.",
                    "author": "Youllneverguess777",
                    "id": "h2zayep",
                    "parent_id": "t1_h150ud8",
                    "score": 1,
                    "created_utc": 1624616408.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\\+1 here. I want my SB to enjoy her time with me.",
            "author": "sfwinefan",
            "id": "h13c6cu",
            "parent_id": "t1_h13953e",
            "score": 9,
            "created_utc": 1623196831.0,
            "replies": []
        },
        {
            "body": "Yes!!!!! Nothing is worse than being with a SB who is only there because she needs the money, period.",
            "author": "BusddhistDSM",
            "id": "h13afcf",
            "parent_id": "t1_h13953e",
            "score": 14,
            "created_utc": 1623195965.0,
            "replies": []
        },
        {
            "body": "It’s very annoying when it happens to you but she didn’t lead him on. \nA SB should feel free to flee at anytime and in fact if a SB is contemplating it she should definitely leave. \nIf a SD tricks or convinces a girl to see him and he is not a nice person, HE is the one at fault for leading HER on to believe he was a human being. And her realisation of that isn’t a reason to blame her for his loss. \nPeople tend to give the benefit of the doubt, and it can take overwhelming evidence in order for someone to take action. Young people are especially prone to this but even I still do it too much because I just don’t want to believe people are dicks.",
            "author": "Neither-Ad-2833",
            "id": "h13j97p",
            "parent_id": "t1_h13eglz",
            "score": 14,
            "created_utc": 1623200453.0,
            "replies": []
        },
        {
            "body": "Dude fuck off. We should be encouraging women to consider their gut feelings for safety over some man’s comfort who doesn’t give a shit about her.",
            "author": null,
            "id": "h13iq5i",
            "parent_id": "t1_h13eglz",
            "score": 15,
            "created_utc": 1623200166.0,
            "replies": [
                {
                    "body": "Did you read the OP? She met him 4 times already.",
                    "author": "professorxc",
                    "id": "h141vg5",
                    "parent_id": "t1_h13iq5i",
                    "score": 1,
                    "created_utc": 1623210124.0,
                    "replies": [
                        {
                            "body": "Anyone has the right to leave a situation at any moment, sugar or not.",
                            "author": "zinapallas",
                            "id": "h146vf5",
                            "parent_id": "t1_h141vg5",
                            "score": 10,
                            "created_utc": 1623213089.0,
                            "replies": [
                                {
                                    "body": "Oh the downvotes from the white knights and the flakers. \n\nAll I am saying is, it’s shitty to plan a date with someone who you have met a couple of times and then bail at the last minute.",
                                    "author": "professorxc",
                                    "id": "h15a47v",
                                    "parent_id": "t1_h146vf5",
                                    "score": 2,
                                    "created_utc": 1623242713.0,
                                    "replies": [
                                        {
                                            "body": "It’s also shitty to force yourself to withstand an uncomfortable situation, have the other party under the wrong impression that you are enjoying yourself, and potentially dealing with the anxiety of worrying for your safety. I mean I get where you’re coming from in a way, but certainly you see elevated risk of danger when it comes to these relationships.",
                                            "author": "zinapallas",
                                            "id": "h1632wv",
                                            "parent_id": "t1_h15a47v",
                                            "score": 7,
                                            "created_utc": 1623255290.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeh you go encouraging her when she admitted what she did was shitty",
                    "author": "wb19081908",
                    "id": "h13mqfj",
                    "parent_id": "t1_h13iq5i",
                    "score": -4,
                    "created_utc": 1623202255.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Because my entire mindset changed on how I want to be an SB and how I value myself, that’s why.\n\nI do understand what I did was shitty though, too.",
            "author": "skyandsunshine123",
            "id": "h13h0wi",
            "parent_id": "t1_h13eglz",
            "score": 7,
            "created_utc": 1623199273.0,
            "replies": [
                {
                    "body": "What you did was not shitty. Nobody should tolerate shitty people, that’s on him.",
                    "author": null,
                    "id": "h13im29",
                    "parent_id": "t1_h13h0wi",
                    "score": 9,
                    "created_utc": 1623200107.0,
                    "replies": [
                        {
                            "body": "Don’t know the complete situation, but if the SD flew in from out of town specifically to meet OP and then OP bails, this seems more like a vindictive power play to me. “This guy liked me enough to fly out to me, but I just coincidentally remembered he was a shitty SD so I’m going to bail on him just for funsies.”",
                            "author": "Wargasm69",
                            "id": "h14cdu2",
                            "parent_id": "t1_h13im29",
                            "score": -2,
                            "created_utc": 1623216730.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "So was he there on a business trip or did he fly from out of town specifically to meet you?",
                    "author": "Wargasm69",
                    "id": "h14bzlw",
                    "parent_id": "t1_h13h0wi",
                    "score": 2,
                    "created_utc": 1623216454.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t think nice SD’s finish last at all! I have never ever EVER thought an SD was too kind. Lol. Most of the time, I’m always wondering why they’re so mean!",
            "author": "skyandsunshine123",
            "id": "h13arqt",
            "parent_id": "t1_h13adwc",
            "score": 16,
            "created_utc": 1623196136.0,
            "replies": [
                {
                    "body": "I had a SB tell me that I was almost too nice and also generous. She said she hit the lottery etc. Dropped her for the bad vibe.",
                    "author": "Oldergoodguy",
                    "id": "h13bydu",
                    "parent_id": "t1_h13arqt",
                    "score": -11,
                    "created_utc": 1623196720.0,
                    "replies": [
                        {
                            "body": "Idk how that would give you a bad vibe. Sounds like a pretty awesome compliment to me lol",
                            "author": "skyandsunshine123",
                            "id": "h13cny6",
                            "parent_id": "t1_h13bydu",
                            "score": 21,
                            "created_utc": 1623197074.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks. Hopefully I'm making current SBs 😊",
            "author": "ChapterRelative",
            "id": "h2zaqyz",
            "parent_id": "t1_h2zaih1",
            "score": 3,
            "created_utc": 1624616226.0,
            "replies": []
        },
        {
            "body": "After that I told me myself never again!! Unless we’ve met and hung out multiple times",
            "author": "MariaMay0",
            "id": "h15r7un",
            "parent_id": "t1_h146nws",
            "score": 3,
            "created_utc": 1623250519.0,
            "replies": [
                {
                    "body": "No, sorry I meant you had guts to leave & get on a flight without him knowing! Very inspriring!💕",
                    "author": "tryingtobehappii",
                    "id": "h15rso6",
                    "parent_id": "t1_h15r7un",
                    "score": 4,
                    "created_utc": 1623250760.0,
                    "replies": [
                        {
                            "body": "It was horrible. When it came bed time I was falling asleep on the couch so moved to his room\n\n(that being said I faked being tired to not have to sleep with him 😂) \n\nWithout asking or anything he grabs me from behind to cuddle and instantly puts his hand up my shirt and holds onto my boobs. \nThen when I said I was so tired and already asleep on the couch not in the mood he makes a comment:\nI hope I don’t molest you in the morning\n\nWho TF says that! \n\nThen I said “no thank you”\nHe asked if can put music on to fall asleep I say: sure what ever helps you fall asleep\n\nHis reply: A blow job always helps \n\nAll I said was oh ya\nAnd kept facing the wall",
                            "author": "MariaMay0",
                            "id": "h1618wf",
                            "parent_id": "t1_h15rso6",
                            "score": 5,
                            "created_utc": 1623254560.0,
                            "replies": [
                                {
                                    "body": "Ew omg",
                                    "author": "tryingtobehappii",
                                    "id": "h17q0um",
                                    "parent_id": "t1_h1618wf",
                                    "score": 5,
                                    "created_utc": 1623279656.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I do understand the vulnerable position women can find themselves in. So, how can SBs, or any women for that matter, prepare to deal with it, if and when it happens? \n\nI would think, first, gain the knowledge and judgment not to put yourself in that situation, right? Reading posts here is a great resource for SBs to know the importance of screening. I wish there is a class on how to screen for SBs. \n\nSecond, learn self defense techniques? Like a knee to the crotch? Simple martial arts, pepper sprays? \n\nI agree it is easy for me to say \"don't do anything you don't want to do.\" But given the high risks, I hope SBs will invest in preparing themselves for such bad situations. \n\nDoesn't it also depend upon building up your strength, self esteem and confidence to react to such situation with the attitude that \"I will not be exploited\"? \n\nThis is such a critical issue. I hope this forum can continue to be a great resource for SBs to gain the knowledge, skills and self confidence to handle bad situations. Thanks for your feedback.",
            "author": "Monte_Sailor",
            "id": "h31igny",
            "parent_id": "t1_h2zatit",
            "score": 2,
            "created_utc": 1624656960.0,
            "replies": [
                {
                    "body": "Saying things like, \"Putting themselves in the situation\" comes off rapey to me. Ofc a SB can look oit for herself and be smart, but again, it's not always that simple. And self-defense... you're joking right? Most SDs have easily 100lbs on a SB and they're men. That's almost laughable if it wasn't so problematic.",
                    "author": "Youllneverguess777",
                    "id": "h31iy4l",
                    "parent_id": "t1_h31igny",
                    "score": 2,
                    "created_utc": 1624657202.0,
                    "replies": [
                        {
                            "body": "So, you have some solutions to offer?",
                            "author": "Monte_Sailor",
                            "id": "h329ngy",
                            "parent_id": "t1_h31iy4l",
                            "score": 1,
                            "created_utc": 1624671881.0,
                            "replies": [
                                {
                                    "body": "All a SB can do is her best but we can't be held responsible for the actions of shitty men. It's the reality all women face, SB or not. A solution would be for rapists to stop raping people or murdering them or taking out their rejection issues on women...",
                                    "author": "Youllneverguess777",
                                    "id": "h32cxxy",
                                    "parent_id": "t1_h329ngy",
                                    "score": 2,
                                    "created_utc": 1624673781.0,
                                    "replies": [
                                        {
                                            "body": "Absolutely, no SB or any woman can be held responsible for the despicable act of rapists, murderers, abusers, fake SDs or obnoxious SDs, irrespective of what she did or did not do. As you say, the SB can only do her best. I was just trying to suggest a few things that could fall within the parameters of \"doing her best\", to protect them selves, given the risks they run being SBs, and as you point out, this world has those dangerous and/or obnoxious characters. But I agree with you, they can still be vulnerable against these characters even after taking prudent precautions.",
                                            "author": "Monte_Sailor",
                                            "id": "h36i10b",
                                            "parent_id": "t1_h32cxxy",
                                            "score": 1,
                                            "created_utc": 1624768251.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h13it3l",
            "parent_id": "t1_h139y4i",
            "score": 10,
            "created_utc": 1623200207.0,
            "replies": [
                {
                    "body": "😀",
                    "author": "wb19081908",
                    "id": "h13mhci",
                    "parent_id": "t1_h13it3l",
                    "score": 2,
                    "created_utc": 1623202132.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's not always that simple... women put themselves at risk when rejecting a man. Please be more understanding in the future.",
            "author": "Youllneverguess777",
            "id": "h2zayep",
            "parent_id": "t1_h150ud8",
            "score": 1,
            "created_utc": 1624616408.0,
            "replies": []
        },
        {
            "body": "Did you read the OP? She met him 4 times already.",
            "author": "professorxc",
            "id": "h141vg5",
            "parent_id": "t1_h13iq5i",
            "score": 1,
            "created_utc": 1623210124.0,
            "replies": [
                {
                    "body": "Anyone has the right to leave a situation at any moment, sugar or not.",
                    "author": "zinapallas",
                    "id": "h146vf5",
                    "parent_id": "t1_h141vg5",
                    "score": 10,
                    "created_utc": 1623213089.0,
                    "replies": [
                        {
                            "body": "Oh the downvotes from the white knights and the flakers. \n\nAll I am saying is, it’s shitty to plan a date with someone who you have met a couple of times and then bail at the last minute.",
                            "author": "professorxc",
                            "id": "h15a47v",
                            "parent_id": "t1_h146vf5",
                            "score": 2,
                            "created_utc": 1623242713.0,
                            "replies": [
                                {
                                    "body": "It’s also shitty to force yourself to withstand an uncomfortable situation, have the other party under the wrong impression that you are enjoying yourself, and potentially dealing with the anxiety of worrying for your safety. I mean I get where you’re coming from in a way, but certainly you see elevated risk of danger when it comes to these relationships.",
                                    "author": "zinapallas",
                                    "id": "h1632wv",
                                    "parent_id": "t1_h15a47v",
                                    "score": 7,
                                    "created_utc": 1623255290.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeh you go encouraging her when she admitted what she did was shitty",
            "author": "wb19081908",
            "id": "h13mqfj",
            "parent_id": "t1_h13iq5i",
            "score": -4,
            "created_utc": 1623202255.0,
            "replies": []
        },
        {
            "body": "What you did was not shitty. Nobody should tolerate shitty people, that’s on him.",
            "author": null,
            "id": "h13im29",
            "parent_id": "t1_h13h0wi",
            "score": 9,
            "created_utc": 1623200107.0,
            "replies": [
                {
                    "body": "Don’t know the complete situation, but if the SD flew in from out of town specifically to meet OP and then OP bails, this seems more like a vindictive power play to me. “This guy liked me enough to fly out to me, but I just coincidentally remembered he was a shitty SD so I’m going to bail on him just for funsies.”",
                    "author": "Wargasm69",
                    "id": "h14cdu2",
                    "parent_id": "t1_h13im29",
                    "score": -2,
                    "created_utc": 1623216730.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So was he there on a business trip or did he fly from out of town specifically to meet you?",
            "author": "Wargasm69",
            "id": "h14bzlw",
            "parent_id": "t1_h13h0wi",
            "score": 2,
            "created_utc": 1623216454.0,
            "replies": []
        },
        {
            "body": "I had a SB tell me that I was almost too nice and also generous. She said she hit the lottery etc. Dropped her for the bad vibe.",
            "author": "Oldergoodguy",
            "id": "h13bydu",
            "parent_id": "t1_h13arqt",
            "score": -11,
            "created_utc": 1623196720.0,
            "replies": [
                {
                    "body": "Idk how that would give you a bad vibe. Sounds like a pretty awesome compliment to me lol",
                    "author": "skyandsunshine123",
                    "id": "h13cny6",
                    "parent_id": "t1_h13bydu",
                    "score": 21,
                    "created_utc": 1623197074.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No, sorry I meant you had guts to leave & get on a flight without him knowing! Very inspriring!💕",
            "author": "tryingtobehappii",
            "id": "h15rso6",
            "parent_id": "t1_h15r7un",
            "score": 4,
            "created_utc": 1623250760.0,
            "replies": [
                {
                    "body": "It was horrible. When it came bed time I was falling asleep on the couch so moved to his room\n\n(that being said I faked being tired to not have to sleep with him 😂) \n\nWithout asking or anything he grabs me from behind to cuddle and instantly puts his hand up my shirt and holds onto my boobs. \nThen when I said I was so tired and already asleep on the couch not in the mood he makes a comment:\nI hope I don’t molest you in the morning\n\nWho TF says that! \n\nThen I said “no thank you”\nHe asked if can put music on to fall asleep I say: sure what ever helps you fall asleep\n\nHis reply: A blow job always helps \n\nAll I said was oh ya\nAnd kept facing the wall",
                    "author": "MariaMay0",
                    "id": "h1618wf",
                    "parent_id": "t1_h15rso6",
                    "score": 5,
                    "created_utc": 1623254560.0,
                    "replies": [
                        {
                            "body": "Ew omg",
                            "author": "tryingtobehappii",
                            "id": "h17q0um",
                            "parent_id": "t1_h1618wf",
                            "score": 5,
                            "created_utc": 1623279656.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Saying things like, \"Putting themselves in the situation\" comes off rapey to me. Ofc a SB can look oit for herself and be smart, but again, it's not always that simple. And self-defense... you're joking right? Most SDs have easily 100lbs on a SB and they're men. That's almost laughable if it wasn't so problematic.",
            "author": "Youllneverguess777",
            "id": "h31iy4l",
            "parent_id": "t1_h31igny",
            "score": 2,
            "created_utc": 1624657202.0,
            "replies": [
                {
                    "body": "So, you have some solutions to offer?",
                    "author": "Monte_Sailor",
                    "id": "h329ngy",
                    "parent_id": "t1_h31iy4l",
                    "score": 1,
                    "created_utc": 1624671881.0,
                    "replies": [
                        {
                            "body": "All a SB can do is her best but we can't be held responsible for the actions of shitty men. It's the reality all women face, SB or not. A solution would be for rapists to stop raping people or murdering them or taking out their rejection issues on women...",
                            "author": "Youllneverguess777",
                            "id": "h32cxxy",
                            "parent_id": "t1_h329ngy",
                            "score": 2,
                            "created_utc": 1624673781.0,
                            "replies": [
                                {
                                    "body": "Absolutely, no SB or any woman can be held responsible for the despicable act of rapists, murderers, abusers, fake SDs or obnoxious SDs, irrespective of what she did or did not do. As you say, the SB can only do her best. I was just trying to suggest a few things that could fall within the parameters of \"doing her best\", to protect them selves, given the risks they run being SBs, and as you point out, this world has those dangerous and/or obnoxious characters. But I agree with you, they can still be vulnerable against these characters even after taking prudent precautions.",
                                    "author": "Monte_Sailor",
                                    "id": "h36i10b",
                                    "parent_id": "t1_h32cxxy",
                                    "score": 1,
                                    "created_utc": 1624768251.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "😀",
            "author": "wb19081908",
            "id": "h13mhci",
            "parent_id": "t1_h13it3l",
            "score": 2,
            "created_utc": 1623202132.0,
            "replies": []
        },
        {
            "body": "Anyone has the right to leave a situation at any moment, sugar or not.",
            "author": "zinapallas",
            "id": "h146vf5",
            "parent_id": "t1_h141vg5",
            "score": 10,
            "created_utc": 1623213089.0,
            "replies": [
                {
                    "body": "Oh the downvotes from the white knights and the flakers. \n\nAll I am saying is, it’s shitty to plan a date with someone who you have met a couple of times and then bail at the last minute.",
                    "author": "professorxc",
                    "id": "h15a47v",
                    "parent_id": "t1_h146vf5",
                    "score": 2,
                    "created_utc": 1623242713.0,
                    "replies": [
                        {
                            "body": "It’s also shitty to force yourself to withstand an uncomfortable situation, have the other party under the wrong impression that you are enjoying yourself, and potentially dealing with the anxiety of worrying for your safety. I mean I get where you’re coming from in a way, but certainly you see elevated risk of danger when it comes to these relationships.",
                            "author": "zinapallas",
                            "id": "h1632wv",
                            "parent_id": "t1_h15a47v",
                            "score": 7,
                            "created_utc": 1623255290.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don’t know the complete situation, but if the SD flew in from out of town specifically to meet OP and then OP bails, this seems more like a vindictive power play to me. “This guy liked me enough to fly out to me, but I just coincidentally remembered he was a shitty SD so I’m going to bail on him just for funsies.”",
            "author": "Wargasm69",
            "id": "h14cdu2",
            "parent_id": "t1_h13im29",
            "score": -2,
            "created_utc": 1623216730.0,
            "replies": []
        },
        {
            "body": "Idk how that would give you a bad vibe. Sounds like a pretty awesome compliment to me lol",
            "author": "skyandsunshine123",
            "id": "h13cny6",
            "parent_id": "t1_h13bydu",
            "score": 21,
            "created_utc": 1623197074.0,
            "replies": []
        },
        {
            "body": "It was horrible. When it came bed time I was falling asleep on the couch so moved to his room\n\n(that being said I faked being tired to not have to sleep with him 😂) \n\nWithout asking or anything he grabs me from behind to cuddle and instantly puts his hand up my shirt and holds onto my boobs. \nThen when I said I was so tired and already asleep on the couch not in the mood he makes a comment:\nI hope I don’t molest you in the morning\n\nWho TF says that! \n\nThen I said “no thank you”\nHe asked if can put music on to fall asleep I say: sure what ever helps you fall asleep\n\nHis reply: A blow job always helps \n\nAll I said was oh ya\nAnd kept facing the wall",
            "author": "MariaMay0",
            "id": "h1618wf",
            "parent_id": "t1_h15rso6",
            "score": 5,
            "created_utc": 1623254560.0,
            "replies": [
                {
                    "body": "Ew omg",
                    "author": "tryingtobehappii",
                    "id": "h17q0um",
                    "parent_id": "t1_h1618wf",
                    "score": 5,
                    "created_utc": 1623279656.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So, you have some solutions to offer?",
            "author": "Monte_Sailor",
            "id": "h329ngy",
            "parent_id": "t1_h31iy4l",
            "score": 1,
            "created_utc": 1624671881.0,
            "replies": [
                {
                    "body": "All a SB can do is her best but we can't be held responsible for the actions of shitty men. It's the reality all women face, SB or not. A solution would be for rapists to stop raping people or murdering them or taking out their rejection issues on women...",
                    "author": "Youllneverguess777",
                    "id": "h32cxxy",
                    "parent_id": "t1_h329ngy",
                    "score": 2,
                    "created_utc": 1624673781.0,
                    "replies": [
                        {
                            "body": "Absolutely, no SB or any woman can be held responsible for the despicable act of rapists, murderers, abusers, fake SDs or obnoxious SDs, irrespective of what she did or did not do. As you say, the SB can only do her best. I was just trying to suggest a few things that could fall within the parameters of \"doing her best\", to protect them selves, given the risks they run being SBs, and as you point out, this world has those dangerous and/or obnoxious characters. But I agree with you, they can still be vulnerable against these characters even after taking prudent precautions.",
                            "author": "Monte_Sailor",
                            "id": "h36i10b",
                            "parent_id": "t1_h32cxxy",
                            "score": 1,
                            "created_utc": 1624768251.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh the downvotes from the white knights and the flakers. \n\nAll I am saying is, it’s shitty to plan a date with someone who you have met a couple of times and then bail at the last minute.",
            "author": "professorxc",
            "id": "h15a47v",
            "parent_id": "t1_h146vf5",
            "score": 2,
            "created_utc": 1623242713.0,
            "replies": [
                {
                    "body": "It’s also shitty to force yourself to withstand an uncomfortable situation, have the other party under the wrong impression that you are enjoying yourself, and potentially dealing with the anxiety of worrying for your safety. I mean I get where you’re coming from in a way, but certainly you see elevated risk of danger when it comes to these relationships.",
                    "author": "zinapallas",
                    "id": "h1632wv",
                    "parent_id": "t1_h15a47v",
                    "score": 7,
                    "created_utc": 1623255290.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ew omg",
            "author": "tryingtobehappii",
            "id": "h17q0um",
            "parent_id": "t1_h1618wf",
            "score": 5,
            "created_utc": 1623279656.0,
            "replies": []
        },
        {
            "body": "All a SB can do is her best but we can't be held responsible for the actions of shitty men. It's the reality all women face, SB or not. A solution would be for rapists to stop raping people or murdering them or taking out their rejection issues on women...",
            "author": "Youllneverguess777",
            "id": "h32cxxy",
            "parent_id": "t1_h329ngy",
            "score": 2,
            "created_utc": 1624673781.0,
            "replies": [
                {
                    "body": "Absolutely, no SB or any woman can be held responsible for the despicable act of rapists, murderers, abusers, fake SDs or obnoxious SDs, irrespective of what she did or did not do. As you say, the SB can only do her best. I was just trying to suggest a few things that could fall within the parameters of \"doing her best\", to protect them selves, given the risks they run being SBs, and as you point out, this world has those dangerous and/or obnoxious characters. But I agree with you, they can still be vulnerable against these characters even after taking prudent precautions.",
                    "author": "Monte_Sailor",
                    "id": "h36i10b",
                    "parent_id": "t1_h32cxxy",
                    "score": 1,
                    "created_utc": 1624768251.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s also shitty to force yourself to withstand an uncomfortable situation, have the other party under the wrong impression that you are enjoying yourself, and potentially dealing with the anxiety of worrying for your safety. I mean I get where you’re coming from in a way, but certainly you see elevated risk of danger when it comes to these relationships.",
            "author": "zinapallas",
            "id": "h1632wv",
            "parent_id": "t1_h15a47v",
            "score": 7,
            "created_utc": 1623255290.0,
            "replies": []
        },
        {
            "body": "Absolutely, no SB or any woman can be held responsible for the despicable act of rapists, murderers, abusers, fake SDs or obnoxious SDs, irrespective of what she did or did not do. As you say, the SB can only do her best. I was just trying to suggest a few things that could fall within the parameters of \"doing her best\", to protect them selves, given the risks they run being SBs, and as you point out, this world has those dangerous and/or obnoxious characters. But I agree with you, they can still be vulnerable against these characters even after taking prudent precautions.",
            "author": "Monte_Sailor",
            "id": "h36i10b",
            "parent_id": "t1_h32cxxy",
            "score": 1,
            "created_utc": 1624768251.0,
            "replies": []
        }
    ]
}