{
    "title": "SD didn't tell me he was married, came to his house and wife opened the door",
    "post_id": "1203hcg",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/1203hcg/sd_didnt_tell_me_he_was_married_came_to_his_house/",
    "author": "lsowow",
    "body": "So ithis happened with my first SD, he was basically perfect. Huge allowance and also paying for my university tuition and gifts too! We also had same interests and hang out (just normal hanging out) often. The relationship got really serious after a while, he wanted to buy and apartment close to my uni so we could live together. I would come to his house unannounced often and he would always be happy, that's why it never crossed my mind if he was married or not. So one day i decided to go to his house because i had the afternoon free, i rang the doorbell and this woman answers the door, he mentioned he had a sister so i thought it was her, the convo went like this:\n\nWife: Oh hi there, are you in the right place?\n\nOP: Yeah I'm here to see SD, are you his sister?\n\nWife: No? I'm his wife, how do you know SD? \n\nSo yeah at that moment i didn't know what to do, so i just stood there dumbfounded, i saw SD in the window and he looked HORRIFIED. I was very hurt so i just told her there: \n\nOP: Sorry i didn't know he was married.\n\nlmao i was so petty back then, anyway that's what happened, but the wife was really nice about it, a few weeks after she reached out to me on Instagram and told me i didn't have to feel guilty because it was all SD fault. She told me he would pay for one more semester at uni and the allowance, this was because they were going to get a divorce and in her words she was going to get the most out of him. Also keep in mind she could have sued me and ask for compensation for ruining her marriage but she didn't, i really hope the best for her she's a queen 👑.\n\nAs for SD he still reaching out to me on insta, i blocked him many times but he keeps making insta accounts any advice on that? It's the typical stuff you know: I'm sorry, i want to get back together, you're the only one i try want blah blah blah.\n\nOverall this was an eyeopener, now i always their situation, but I'm still hurt about this. Anyway that's the story lol.\n\nEdit: Grammar errors haha, also someone dm me and told me the look of SD was the look of someone who knows they're about to be killed, pretty accurate! Thanks haha.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/1203hcg/sd_didnt_tell_me_he_was_married_came_to_his_house/",
    "score": 179,
    "upvote_ratio": 0.9,
    "created_utc": 1679618473.0,
    "num_comments": 82,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Honestly I feel like he really lost out there, his wife sounds like a queen. I hope she found happiness. I would have been mortified, it sounds like you handled it very well",
            "author": "Empressofthemall",
            "id": "jdfll8t",
            "parent_id": "t3_1203hcg",
            "score": 173,
            "created_utc": 1679619837.0,
            "replies": [
                {
                    "body": "She's doing well! I check her insta from time to time, and looks like she went back to uni to finish her PhD.",
                    "author": "lsowow",
                    "id": "jdfn0z5",
                    "parent_id": "t1_jdfll8t",
                    "score": 118,
                    "created_utc": 1679620470.0,
                    "replies": [
                        {
                            "body": ">and looks like she went back to uni to finish her PhD.\n\nGotta love strong women who turn misfortune into an opportunity!",
                            "author": "Quasimodo1974",
                            "id": "jdgyqao",
                            "parent_id": "t1_jdfn0z5",
                            "score": 45,
                            "created_utc": 1679651252.0,
                            "replies": [
                                {
                                    "body": "That's how bad ass bitches make a way!!!🤜🏻🤛🏼",
                                    "author": "JustAsk4Alice",
                                    "id": "jdiab4g",
                                    "parent_id": "t1_jdgyqao",
                                    "score": 10,
                                    "created_utc": 1679674646.0,
                                    "replies": [
                                        {
                                            "body": "Yes!",
                                            "author": "Quasimodo1974",
                                            "id": "jdic8c8",
                                            "parent_id": "t1_jdiab4g",
                                            "score": 2,
                                            "created_utc": 1679675369.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "The best revenge on someone is living well without them. Sounds like she’s doing great!",
                            "author": "olivinemultichrome",
                            "id": "jdhcbre",
                            "parent_id": "t1_jdfn0z5",
                            "score": 14,
                            "created_utc": 1679660340.0,
                            "replies": []
                        },
                        {
                            "body": "Love this for her!!",
                            "author": "Professional-Dirt856",
                            "id": "jdgbtdp",
                            "parent_id": "t1_jdfn0z5",
                            "score": 17,
                            "created_utc": 1679632827.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This scenario that played out with the OP at many levels can get played and replayed easily in the bowl where protagonists in most sugar stories have multiple partners. \n\nIn the SDs case, most of these guys are married. So poor opsec or risk management can easily trigger this type of accident between the SB and the wife as was in this case.\n\n Then let’s not forget similar risks on the SB side with them seeing multiple SDs, vanillas, other lovers etc.\n\n If the SB did not manage her opsec properly, she could run the risk of having the SD easily cross path with one of her other partners. \n\nRemember SBs take it as a betrayal that SD did not mention his marriage but think they are not accountable to disclosure of their romantic relationships outside of the SR.",
                    "author": null,
                    "id": "jdjg5cm",
                    "parent_id": "t1_jdfll8t",
                    "score": 6,
                    "created_utc": 1679690803.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There were NO family photos in the house? Did the wife travel a lot? So weird.",
            "author": "SD-47",
            "id": "jdfviob",
            "parent_id": "t3_1203hcg",
            "score": 34,
            "created_utc": 1679624305.0,
            "replies": [
                {
                    "body": "Now that you mention it his house had no pictures only paintings. But it's not that weird i don't have pictures of my family either, maybe it's a Peruvian thing? Idk never thought much of it",
                    "author": "lsowow",
                    "id": "jdfwm9r",
                    "parent_id": "t1_jdfviob",
                    "score": 42,
                    "created_utc": 1679624814.0,
                    "replies": []
                },
                {
                    "body": "You are trying to become too factual and accurate :). Yes I felt the same way. Also ladies especially on this forum often talk about their smart surveillance methods to know everything about the SD. Not sure how she missed this one.",
                    "author": null,
                    "id": "jdjhkst",
                    "parent_id": "t1_jdfviob",
                    "score": 2,
                    "created_utc": 1679691373.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Jesus christ 🤦🏽‍♀️ what an ass clown",
            "author": "candygirlcj",
            "id": "jdfou0w",
            "parent_id": "t3_1203hcg",
            "score": 28,
            "created_utc": 1679621269.0,
            "replies": []
        },
        {
            "body": "I have a feeling they may have been separated, living apart.  So he had zero op-sec, assuming that his love life would ever meet each other.  Seems like she was already out of the picture by her choice, you might have helped her get a better exit package.",
            "author": "geekinkc",
            "id": "jdg7m0z",
            "parent_id": "t3_1203hcg",
            "score": 27,
            "created_utc": 1679630382.0,
            "replies": []
        },
        {
            "body": "How does it even work that you came to his house unannounced often? How often? And in his house weren’t there any clues he was married? It’s usually clear when someone is living with someone of the opposite gender even assuming they kept no marital photos out.\n\nThis story doesn’t really seem too believable unless we get more details on how you were so clueless and why he was so reckless. Was his wife an ER nurse who spent days at the hospital or something?",
            "author": "JumboJetz",
            "id": "jdfsl3j",
            "parent_id": "t3_1203hcg",
            "score": 28,
            "created_utc": 1679622954.0,
            "replies": [
                {
                    "body": "The story adds up. I’ve been in this situation before myself. Men often underestimate just how reckless their fellow counterparts (other men) can be.",
                    "author": null,
                    "id": "jdi904d",
                    "parent_id": "t1_jdfsl3j",
                    "score": 10,
                    "created_utc": 1679674152.0,
                    "replies": []
                },
                {
                    "body": "I think she worked in healthcare but i'm not sure in what, i didn't dig into it you know? I didn't go all Sherlock Holmes on her i was just so over the whole situation",
                    "author": "lsowow",
                    "id": "jdfvrdx",
                    "parent_id": "t1_jdfsl3j",
                    "score": 13,
                    "created_utc": 1679624417.0,
                    "replies": [
                        {
                            "body": "Doesn’t add up for me either.  If you went to his house multiple times without meeting her or him being concerned means she wasn’t living with him and must have just been on a random visit.   So they were separated and divorce was well on its way.  She was probably nice to you because that chance encounter allowed her to take him to the cleaners in the divorce.   So this is hardly married man playing away and much more separated but not yet divorced man building himself a new relationship.   Don’t see any trust issues with that.",
                            "author": "Dazzling_Truth6472",
                            "id": "jdgka49",
                            "parent_id": "t1_jdfvrdx",
                            "score": 11,
                            "created_utc": 1679638865.0,
                            "replies": [
                                {
                                    "body": "Yeah… this story seems like it’s made up and fake. “a few weeks after she reached out to me on instagram”? What kinda wife does that and is all chill about it?\n\nAgain, I’m just getting a vibe that this is something the poster completely fabricated … it reads almost like a bad romance novella.",
                                    "author": "lukeSkywalker2061",
                                    "id": "jdh70n3",
                                    "parent_id": "t1_jdgka49",
                                    "score": 3,
                                    "created_utc": 1679657253.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Some men get sloppy when they think they can’t get caught & get too comfortable.",
                    "author": "femblvd",
                    "id": "jdkecwp",
                    "parent_id": "t1_jdfsl3j",
                    "score": 3,
                    "created_utc": 1679705714.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SO GLAD I’m doing this while single…. \n\nIf I ever get married again, this is a good reminder to LEAVE it I’m unhappy instead of cheating. \n\nThe reason I left my first wife was because she cheated after 14 years.",
            "author": "Salty-Investigator17",
            "id": "jdfzu5z",
            "parent_id": "t3_1203hcg",
            "score": 27,
            "created_utc": 1679626356.0,
            "replies": [
                {
                    "body": "Open relationship is also an option. Doesn't have to be cheating to date outside of your marriage.",
                    "author": "Taco_Daddy_99",
                    "id": "jdhv23c",
                    "parent_id": "t1_jdfzu5z",
                    "score": 5,
                    "created_utc": 1679668787.0,
                    "replies": [
                        {
                            "body": "Rare and often complicated.  Any SB with a SD claiming this should verify.",
                            "author": "TXPolyDaddy",
                            "id": "jdi0exf",
                            "parent_id": "t1_jdhv23c",
                            "score": 7,
                            "created_utc": 1679670878.0,
                            "replies": [
                                {
                                    "body": "I prefer medium rare and uncomplicated, thanks 😂. Yeah, non monaganous relationships can be considered rare since it's not the norm. My point was that a SD doesn't necessarily need to be un-partnered in order to enjoy a SD/SB relationship without cheating. As long as their partner agrees to being open of course. As to whether a SB can and should verify is a different conversation.",
                                    "author": "Taco_Daddy_99",
                                    "id": "jdi2zr3",
                                    "parent_id": "t1_jdi0exf",
                                    "score": 4,
                                    "created_utc": 1679671870.0,
                                    "replies": []
                                },
                                {
                                    "body": "Assuming they care enough to check 😉",
                                    "author": "Terrible-Fix-9798",
                                    "id": "jezobwy",
                                    "parent_id": "t1_jdi0exf",
                                    "score": 1,
                                    "created_utc": 1680654793.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Absolutely agree!\nIf the marriage is dead, but your freedom back and enjoy life!  It took a long time to detox from my bad marriage but having a great SB sure helped.\nOnce I told the wife we were done and she moved to a rental house of mine I felt better and started looking for a SB.",
                    "author": "TXPolyDaddy",
                    "id": "jdi0s39",
                    "parent_id": "t1_jdfzu5z",
                    "score": 5,
                    "created_utc": 1679671021.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "jditd5a",
                            "parent_id": "t1_jdi0s39",
                            "score": 4,
                            "created_utc": 1679681871.0,
                            "replies": [
                                {
                                    "body": "True\nHard conversations for sure.\nHowever she knows and feels the same distance and gap.  Likely she is no happier about it.",
                                    "author": "TXPolyDaddy",
                                    "id": "jdkq4vf",
                                    "parent_id": "t1_jditd5a",
                                    "score": 2,
                                    "created_utc": 1679711382.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ll take things that never happened for two hundo Alex.",
            "author": "LotBuilder",
            "id": "jdge9h4",
            "parent_id": "t3_1203hcg",
            "score": 19,
            "created_utc": 1679634405.0,
            "replies": []
        },
        {
            "body": ">she could have sued me and ask for compensation for ruining her marriage\n\nI don't think so",
            "author": "ILikeTheHobby",
            "id": "jdj6m51",
            "parent_id": "t3_1203hcg",
            "score": 4,
            "created_utc": 1679687034.0,
            "replies": []
        },
        {
            "body": "Wait a sec, ... so he still tries to reach out and you are no longer interested in a \"huge allowance, paid tuition, gifts, and having an apartment to live in for free?\" GIRL are you feeling  okay? Obvi you 2 were really into each other w/ how much you hung out too and he deff cared about you. I'd be re-thinking ignoring him/keeping him blocked. ESP now since he's getting divorced. WHY throw all of that way. He messed up by not telling you but forgiveness and compassion would go a long way for both him and you (/your future). Someone that cares that much about you to take care of you and spend so much time with you like he did... there's something very real there that isn't done yet. The divorce was probably a long time coming between him and his ex(/soon to be ex), most likely in the works, or at the very least, dealing with severe marital unhappiness, wayyy before you came into the picture. Keep us posted on the reconciliation. Rooting for you both.",
            "author": "KYogini",
            "id": "jdg13mu",
            "parent_id": "t3_1203hcg",
            "score": 23,
            "created_utc": 1679626987.0,
            "replies": [
                {
                    "body": "When trust is gone, everything feels different.",
                    "author": "Numerous-Ad3709",
                    "id": "jdgfsm6",
                    "parent_id": "t1_jdg13mu",
                    "score": 25,
                    "created_utc": 1679635458.0,
                    "replies": [
                        {
                            "body": "I feel like forgiveness would bring the trust right back. At least for me, anyways.",
                            "author": "KYogini",
                            "id": "jdgjfmf",
                            "parent_id": "t1_jdgfsm6",
                            "score": 3,
                            "created_utc": 1679638192.0,
                            "replies": [
                                {
                                    "body": "That, and a wad of cash! 😜",
                                    "author": "Ok-Yogurt-2743",
                                    "id": "jdhsmud",
                                    "parent_id": "t1_jdgjfmf",
                                    "score": 9,
                                    "created_utc": 1679667814.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "His ex sounds like an absolute class act of a woman.  Love it when people realize where the blame belongs and act accordingly.",
            "author": null,
            "id": "jdkc3nu",
            "parent_id": "t3_1203hcg",
            "score": 3,
            "created_utc": 1679704680.0,
            "replies": []
        },
        {
            "body": "Men ☕️",
            "author": null,
            "id": "jdg551j",
            "parent_id": "t3_1203hcg",
            "score": 9,
            "created_utc": 1679629057.0,
            "replies": [
                {
                    "body": "I too agree sometimes men in blatantly made up stories like OPs are villainous.",
                    "author": "JumboJetz",
                    "id": "jdhb48j",
                    "parent_id": "t1_jdg551j",
                    "score": 6,
                    "created_utc": 1679659680.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SD is/was a moron. Sorry you got surprised like that and it IS all on him.  Hopefully the wife got him what he deserved.",
            "author": "GSSD",
            "id": "jdhjvh7",
            "parent_id": "t3_1203hcg",
            "score": 3,
            "created_utc": 1679664068.0,
            "replies": [
                {
                    "body": "It isn’t all on him.  Why would she show up unannounced?  He could have been divorced or single, and her showing up like that could still have caused all kinds of trouble.  If this story is true, it’s on both of them.",
                    "author": "MrBuzzard",
                    "id": "jdi42qz",
                    "parent_id": "t1_jdhjvh7",
                    "score": 3,
                    "created_utc": 1679672285.0,
                    "replies": [
                        {
                            "body": "if the SD didn't want her to show up unannounced, he would've said after she did that once. OP said he was always happy to see her when she showed up, never made any other comments. that's totally on him.",
                            "author": "just4subfun__",
                            "id": "jdioghn",
                            "parent_id": "t1_jdi42qz",
                            "score": 5,
                            "created_utc": 1679679982.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ah the pop-in. Guys, this one is just one too far for me. \n\nWe've reached the part of the movie *Idiocracy* where Dwight Elizondo Mountain Dew Herbert Camacho would be a political upgrade, and yet starbucks does not sell handjobs and I cannot yell \"Go away, Bait'N\" to whoever comes to my door. The future was far more dystopian than imagined.",
            "author": "TastySpermDevice",
            "id": "jdfk1xo",
            "parent_id": "t3_1203hcg",
            "score": 11,
            "created_utc": 1679619173.0,
            "replies": [
                {
                    "body": "Maybe this sub needs a fiction flare. It can be called \"A letter to Penthouse\".\n\nDear Penthouse, I never thought I would be writing one of these letters, but...",
                    "author": "geeky-sd",
                    "id": "jdh4jqu",
                    "parent_id": "t1_jdfk1xo",
                    "score": 6,
                    "created_utc": 1679655646.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I gotta know how u found this SD who pays for ur tuition 😩",
            "author": "Flat_Box_8023",
            "id": "jdhbs6x",
            "parent_id": "t3_1203hcg",
            "score": 2,
            "created_utc": 1679660046.0,
            "replies": [
                {
                    "body": "Mine pays for my daughter’s tuition lol - they’re out there!",
                    "author": "ronitabonita",
                    "id": "jdho6vo",
                    "parent_id": "t1_jdhbs6x",
                    "score": 7,
                    "created_utc": 1679665975.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wait… in the US you can sue someone for having an affair with one’s partner?\n\nI know your legal system is kinda… f’ed, but please tell me that’s not true!",
            "author": "Additional-Hornet-81",
            "id": "jdhhwm6",
            "parent_id": "t3_1203hcg",
            "score": 2,
            "created_utc": 1679663144.0,
            "replies": [
                {
                    "body": "Depends on the state. But yes some have what are called home wrecker laws.",
                    "author": "Leeper90",
                    "id": "jdhr5pp",
                    "parent_id": "t1_jdhhwm6",
                    "score": 4,
                    "created_utc": 1679667214.0,
                    "replies": [
                        {
                            "body": "Okay, thanks I must Google that before my next visit 🤔",
                            "author": "Additional-Hornet-81",
                            "id": "jdi7adj",
                            "parent_id": "t1_jdhr5pp",
                            "score": 1,
                            "created_utc": 1679673503.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yup. Alienation of Affection and Home Wrecker. North Carolina and Utah are the biggest ones, but there’s 5 or 6 others. Alienated spouse can sue the affair partner(s) as part of the divorce.",
                    "author": "MedicGirl",
                    "id": "jdivsd5",
                    "parent_id": "t1_jdhhwm6",
                    "score": 2,
                    "created_utc": 1679682814.0,
                    "replies": [
                        {
                            "body": "Hmmm fair enough but to me that sounds insane 🤔.\n\nOn the other hand it would have been nice to sue the living shit out of the guy that sleept with my ex-wife. That’s what I get for living in a socialist country 😂😂😂",
                            "author": "Additional-Hornet-81",
                            "id": "jdjb5h6",
                            "parent_id": "t1_jdivsd5",
                            "score": 3,
                            "created_utc": 1679688815.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "No one in the US says Uni for university. OP is most likely in Europe.",
                    "author": "Blacktieintherain",
                    "id": "jdimo7c",
                    "parent_id": "t1_jdhhwm6",
                    "score": 2,
                    "created_utc": 1679679310.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow, I hope he figures his shit out. Sounds like it was bound to happen 🤷‍♀️ Good on the wife though! She's the GOAT!",
            "author": "Medical-Spinach-2208",
            "id": "jdj51hk",
            "parent_id": "t3_1203hcg",
            "score": 2,
            "created_utc": 1679686416.0,
            "replies": []
        },
        {
            "body": "Not cool, SD’s and SB’s have to be honest with one another",
            "author": "txtaco_vato",
            "id": "jdjbiy6",
            "parent_id": "t3_1203hcg",
            "score": 2,
            "created_utc": 1679688962.0,
            "replies": []
        },
        {
            "body": "Silver lining: at least this went kinda classy, the wife didn't go berserk and try to attack you. I've heard some wild angry wife stories.",
            "author": "damselinadress187",
            "id": "jdjxpd9",
            "parent_id": "t3_1203hcg",
            "score": 2,
            "created_utc": 1679698237.0,
            "replies": []
        },
        {
            "body": "Something just isn’t adding up with this story.  Either it’s another married SD bashing troll post or this guy was a complete idiot.  He never reached back out after this?  I’d never want anyone randomly showing up at my house for any reason.",
            "author": "RedHeavyG603",
            "id": "jdgt8ow",
            "parent_id": "t3_1203hcg",
            "score": 6,
            "created_utc": 1679646449.0,
            "replies": []
        },
        {
            "body": "Guy was an idiot, not for having you over, but for not making certain that visits would be scheduled to when his wife was away. Also, he should have told you upfront.",
            "author": "SDInLeather",
            "id": "jdhdyr5",
            "parent_id": "t3_1203hcg",
            "score": 3,
            "created_utc": 1679661197.0,
            "replies": []
        },
        {
            "body": "Never show up unannounced at someone’s house, SD or not",
            "author": "Hope_for_tendies",
            "id": "jdit7nf",
            "parent_id": "t3_1203hcg",
            "score": 3,
            "created_utc": 1679681810.0,
            "replies": [
                {
                    "body": "EVER!",
                    "author": "Important-Eye-5241",
                    "id": "jdjzrow",
                    "parent_id": "t1_jdit7nf",
                    "score": 1,
                    "created_utc": 1679699144.0,
                    "replies": [
                        {
                            "body": "Right ! I wont even let the person in",
                            "author": "Hope_for_tendies",
                            "id": "jdk1x2z",
                            "parent_id": "t1_jdjzrow",
                            "score": 1,
                            "created_utc": 1679700107.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Fan fiction",
            "author": "YourSugarFather",
            "id": "jdhdb7o",
            "parent_id": "t3_1203hcg",
            "score": 4,
            "created_utc": 1679660851.0,
            "replies": []
        },
        {
            "body": "his fault 100%",
            "author": "kerfluffle99",
            "id": "jdg65x1",
            "parent_id": "t3_1203hcg",
            "score": 3,
            "created_utc": 1679629594.0,
            "replies": [
                {
                    "body": "also Im not sure if she could have sued you.\nI looked up alienation of affection, and that appears to be an intentional tort.  In your case, Im not even sure it counts as negligence.  \n\nculpability usually goes \nnegligence -> reckless -> intentional\n\nplus, as a student you have no assets.  She could sue and would be unable to collect if you simply declared bankruptcy",
                    "author": "kerfluffle99",
                    "id": "jdg6nj7",
                    "parent_id": "t1_jdg65x1",
                    "score": 5,
                    "created_utc": 1679629856.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Doesn’t sound like you’re an SB if you give up all that he was offering. I think you strayed into vanilla territory big time. More worryingly, as your first SD, I presume you think there’s another similar one just waiting around the corner. Good luck with that.",
            "author": "chairman212121",
            "id": "jdh8264",
            "parent_id": "t3_1203hcg",
            "score": 2,
            "created_utc": 1679657904.0,
            "replies": []
        },
        {
            "body": "I have an unorthodox suggestion.  \nOther than the big elephant in the room, this has been a very good arrangement for you.   \nWhen the semester is over you will be single and on the hook to pay the rest of the tuition, and then go and find another SD. but... the odds of bagging another one who will pay your tuition and earn your affection, even though he's a fucking liar, are pretty slim.  \nTherefore my advice is to tell him something that keeps the door open in case you want him back in half a year. tell him you are very hurt and that he should write an apology letter or something and when the time comes you might forgive him.",
            "author": "JeaneyBowl",
            "id": "jdiykhi",
            "parent_id": "t3_1203hcg",
            "score": 3,
            "created_utc": 1679683883.0,
            "replies": []
        },
        {
            "body": "That's on him. He should've been honest with you. But he's cheating on his wife, so there's that. I'm not judging, just pointing out facts.",
            "author": "Automatic_Joke_4414",
            "id": "jdgp601",
            "parent_id": "t3_1203hcg",
            "score": 2,
            "created_utc": 1679642900.0,
            "replies": []
        },
        {
            "body": "Totally HIS fault for not keeping his address protected !!!   Dumbass !!!",
            "author": "Lefty354",
            "id": "jdh4mr1",
            "parent_id": "t3_1203hcg",
            "score": 2,
            "created_utc": 1679655703.0,
            "replies": [
                {
                    "body": ">Totally HIS fault for not ~~keeping his address protected~~ being honest about his marital status!!! Dumbass !!!\n\nFTFI.",
                    "author": "A-touchofreality",
                    "id": "jdh7j7q",
                    "parent_id": "t1_jdh4mr1",
                    "score": 3,
                    "created_utc": 1679657580.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm sorry but..\n\nLook. The vast majority of SD's are gonna be married. It's a given.\n\nYou should Ask next time, if it's an issue for you.\n\nAnd I'd never drop by a SD's house unannounced. Or anyone else's, unless they specifically verbalized it was ok, and we had a plan for how we should proceed if they had company. \n\nIt was dumb of him not to plan accordingly, or to not bar you from doing that after the first instance, without sending a text that you're on your way or something.\n\nIf you don't want the man, I'm happy to take him. I have no issue with SD's being married.",
            "author": "Additional-Ability99",
            "id": "jdh9qah",
            "parent_id": "t3_1203hcg",
            "score": 1,
            "created_utc": 1679658889.0,
            "replies": []
        },
        {
            "body": "so, how is it even remotely possibly that you went to his house many times and there was no sign of a wife? there are just so many obvious signs that someone else lives in a house. are you sure they weren’t already separated? no married guy in his right mind, no matter how delusional he is, would be repeatedly “happy” that you came over unannounced if he was married.",
            "author": "sdsf9",
            "id": "jdi2g8j",
            "parent_id": "t3_1203hcg",
            "score": 2,
            "created_utc": 1679671663.0,
            "replies": []
        },
        {
            "body": "I live on my own, and a SB would never show up unannounced.   I could easily have friends or family over when she arrived. This seems like a dumb-ass move for both sides.  If it is actually true.",
            "author": "MrBuzzard",
            "id": "jdi3oqj",
            "parent_id": "t3_1203hcg",
            "score": 2,
            "created_utc": 1679672136.0,
            "replies": []
        },
        {
            "body": "The double standard in the bowl is surreal.\n\nSo if I get this right, a SB can have multiple SDs AND a boyfriend and it's all good morals, but the married SD can't have just one SB he takes very good care of? The morals make no sense at all in such an immoral practice to begin with.\n\nThis poor SB who was duped by this atrocious SD 😂\n\nGirl you are taking cash for pussy. Perhaps if your morals were more developed you wouldn't have to deal with immoral people to begin with. \n\nYou should be thankful he's not a psychopath, and that his wife didn't beat you up or worse. And we don't know yet about his psychopathy, him stalking you is just not good at all. \n\nGo dark on social media unless you want this to escalate even more. He probably is torn between you wrecking his marriage and possibly his life we don't know, and the severed attachment from you that occurred at the same time. This guy is a ticking time bomb imo.",
            "author": "sugardad123",
            "id": "jdij59x",
            "parent_id": "t3_1203hcg",
            "score": 2,
            "created_utc": 1679677981.0,
            "replies": [
                {
                    "body": "Are you purposely being obtuse? The issue isn’t who can have multiple partners. An SD can have multiple SBs or a married SD can have an SB if everyone is open and honest (lol). This man wasn’t honest about being married. That’s the fucking issue, but yes, please phrase this as some sort of double standard. 🙄\n\nAlso, cash for pussy? That’s rich coming from you. Where do you fall in this equation yourself? You’re telling OP to develop morals in order to avoid dealing with immoral people, but wouldn’t that make you immoral since by your own admission, you pay for pussy?",
                    "author": "GoodyGoobert",
                    "id": "jdl41rf",
                    "parent_id": "t1_jdij59x",
                    "score": 3,
                    "created_utc": 1679719017.0,
                    "replies": []
                },
                {
                    "body": "It’s more than just pussy or it would be escorting . You didn’t have to go that hard 🤯",
                    "author": "Hope_for_tendies",
                    "id": "jditpb2",
                    "parent_id": "t1_jdij59x",
                    "score": 1,
                    "created_utc": 1679682004.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "jdfixqd",
            "parent_id": "t3_1203hcg",
            "score": 1,
            "created_utc": 1679618692.0,
            "replies": [
                {
                    "body": "Oh his wife drained most of his money lol, and also I'm still mad and hurt. \n\nHe was more than horrified, i wish there was a word for it, like traumatized I'm the moment? Lol idk he looked like he saw a biblically accurate angel and or something.",
                    "author": "lsowow",
                    "id": "jdfjmdh",
                    "parent_id": "t1_jdfixqd",
                    "score": 8,
                    "created_utc": 1679618988.0,
                    "replies": []
                },
                {
                    "body": "Because he lied to her? That’s not something people just get over.",
                    "author": "GoodyGoobert",
                    "id": "jdfjmly",
                    "parent_id": "t1_jdfixqd",
                    "score": 8,
                    "created_utc": 1679618990.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't think either of you come out with any credit or kudos.\n\nYou both did stupid things and the person who suffered was his wife.\n\nMadness",
            "author": "ChasB61",
            "id": "jdhop9v",
            "parent_id": "t3_1203hcg",
            "score": 1,
            "created_utc": 1679666188.0,
            "replies": []
        },
        {
            "body": "If he was getting a divorce, I can understand his need for seeking someone else. If she still had a ring on it, then yea it’s bad.",
            "author": "shuabrazy",
            "id": "jdh2cmx",
            "parent_id": "t3_1203hcg",
            "score": 0,
            "created_utc": 1679654083.0,
            "replies": []
        },
        {
            "body": "Maybe I’m just toxic but…me?! I probably would still saw him after the whole ordeal ended 😭 \n\nI also would never show up unannounced ANYWHERE. Now you’ve got to find someone else to cover what he has to stop paying. I know that gut feeling when you think it’s going perfect and boom, your world clashes. It’s not fun.\n\nCheers to the wife, for allowing him to keep paying your uni!",
            "author": "Important-Eye-5241",
            "id": "jdk01ry",
            "parent_id": "t3_1203hcg",
            "score": 0,
            "created_utc": 1679699268.0,
            "replies": []
        },
        {
            "body": "So, just to get this straight, this woman is his EX-wife with whom he is going through the divorce process, which can take a year on sheer technicality, and now that you think about it, there was zero presence of her living with him or being in his life, but because you are scared of being sued for having an affair, you never want to talk to him again because he didn't tell you about his ex-wife? \n\nWhat DID the two of you discuss about your dating history? Did either of you talk about your pasts? What did you know at all about his family? \n\nAnd I can understand that you may not consider her \"the past\" because he had to wait for a court date to sign a few more pieces of paper to be fully separated from her, but I'd like to pin down a specific complaint. Are you more angry that he didn't confide his problems and personal details to you? Because it sounds like you wanted this man to be your boyfriend, so you are hurt he didn't tell you anything. And you would have dumped him just as hard if he'd started sleeping with you on the other side of that final document signing... But didn't tell you anything vulnerable about himself.",
            "author": "ProserpinaFC",
            "id": "jdkat5t",
            "parent_id": "t3_1203hcg",
            "score": 0,
            "created_utc": 1679704095.0,
            "replies": []
        },
        {
            "body": "I swear this was one of the click bait ads on Twitter or something. \"Wife suspected husband had been cheating but was both shocked and suprised when she found out the truth\".\n\nI do wonder if he wanted to get caught. Can only explain why he was so brazen about it.",
            "author": "C12H22O11-EU",
            "id": "jdi2wgy",
            "parent_id": "t3_1203hcg",
            "score": -1,
            "created_utc": 1679671835.0,
            "replies": []
        },
        {
            "body": "Ouch",
            "author": "kevinbudd69",
            "id": "jdhj5kd",
            "parent_id": "t3_1203hcg",
            "score": 1,
            "created_utc": 1679663729.0,
            "replies": []
        },
        {
            "body": "A lot of SDs are married, and a lot of SBs are fine with it, but this guy was playing with fire and he knew it. 100% stupid.",
            "author": "my_NSFW_posts",
            "id": "jdhvhoz",
            "parent_id": "t3_1203hcg",
            "score": 1,
            "created_utc": 1679668960.0,
            "replies": []
        },
        {
            "body": "How long were you together? it's crazy that he allowed unannounced drop ins at all since he was married!",
            "author": "sugarappl3s",
            "id": "jdixv92",
            "parent_id": "t3_1203hcg",
            "score": 1,
            "created_utc": 1679683616.0,
            "replies": []
        },
        {
            "body": "Your SD was not very savvy and is living with the consequences.",
            "author": "Odd-Luck7658",
            "id": "jdj4dbu",
            "parent_id": "t3_1203hcg",
            "score": 1,
            "created_utc": 1679686149.0,
            "replies": []
        },
        {
            "body": "She's doing well! I check her insta from time to time, and looks like she went back to uni to finish her PhD.",
            "author": "lsowow",
            "id": "jdfn0z5",
            "parent_id": "t1_jdfll8t",
            "score": 118,
            "created_utc": 1679620470.0,
            "replies": [
                {
                    "body": ">and looks like she went back to uni to finish her PhD.\n\nGotta love strong women who turn misfortune into an opportunity!",
                    "author": "Quasimodo1974",
                    "id": "jdgyqao",
                    "parent_id": "t1_jdfn0z5",
                    "score": 45,
                    "created_utc": 1679651252.0,
                    "replies": [
                        {
                            "body": "That's how bad ass bitches make a way!!!🤜🏻🤛🏼",
                            "author": "JustAsk4Alice",
                            "id": "jdiab4g",
                            "parent_id": "t1_jdgyqao",
                            "score": 10,
                            "created_utc": 1679674646.0,
                            "replies": [
                                {
                                    "body": "Yes!",
                                    "author": "Quasimodo1974",
                                    "id": "jdic8c8",
                                    "parent_id": "t1_jdiab4g",
                                    "score": 2,
                                    "created_utc": 1679675369.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "The best revenge on someone is living well without them. Sounds like she’s doing great!",
                    "author": "olivinemultichrome",
                    "id": "jdhcbre",
                    "parent_id": "t1_jdfn0z5",
                    "score": 14,
                    "created_utc": 1679660340.0,
                    "replies": []
                },
                {
                    "body": "Love this for her!!",
                    "author": "Professional-Dirt856",
                    "id": "jdgbtdp",
                    "parent_id": "t1_jdfn0z5",
                    "score": 17,
                    "created_utc": 1679632827.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This scenario that played out with the OP at many levels can get played and replayed easily in the bowl where protagonists in most sugar stories have multiple partners. \n\nIn the SDs case, most of these guys are married. So poor opsec or risk management can easily trigger this type of accident between the SB and the wife as was in this case.\n\n Then let’s not forget similar risks on the SB side with them seeing multiple SDs, vanillas, other lovers etc.\n\n If the SB did not manage her opsec properly, she could run the risk of having the SD easily cross path with one of her other partners. \n\nRemember SBs take it as a betrayal that SD did not mention his marriage but think they are not accountable to disclosure of their romantic relationships outside of the SR.",
            "author": null,
            "id": "jdjg5cm",
            "parent_id": "t1_jdfll8t",
            "score": 6,
            "created_utc": 1679690803.0,
            "replies": []
        },
        {
            "body": "Now that you mention it his house had no pictures only paintings. But it's not that weird i don't have pictures of my family either, maybe it's a Peruvian thing? Idk never thought much of it",
            "author": "lsowow",
            "id": "jdfwm9r",
            "parent_id": "t1_jdfviob",
            "score": 42,
            "created_utc": 1679624814.0,
            "replies": []
        },
        {
            "body": "You are trying to become too factual and accurate :). Yes I felt the same way. Also ladies especially on this forum often talk about their smart surveillance methods to know everything about the SD. Not sure how she missed this one.",
            "author": null,
            "id": "jdjhkst",
            "parent_id": "t1_jdfviob",
            "score": 2,
            "created_utc": 1679691373.0,
            "replies": []
        },
        {
            "body": "The story adds up. I’ve been in this situation before myself. Men often underestimate just how reckless their fellow counterparts (other men) can be.",
            "author": null,
            "id": "jdi904d",
            "parent_id": "t1_jdfsl3j",
            "score": 10,
            "created_utc": 1679674152.0,
            "replies": []
        },
        {
            "body": "I think she worked in healthcare but i'm not sure in what, i didn't dig into it you know? I didn't go all Sherlock Holmes on her i was just so over the whole situation",
            "author": "lsowow",
            "id": "jdfvrdx",
            "parent_id": "t1_jdfsl3j",
            "score": 13,
            "created_utc": 1679624417.0,
            "replies": [
                {
                    "body": "Doesn’t add up for me either.  If you went to his house multiple times without meeting her or him being concerned means she wasn’t living with him and must have just been on a random visit.   So they were separated and divorce was well on its way.  She was probably nice to you because that chance encounter allowed her to take him to the cleaners in the divorce.   So this is hardly married man playing away and much more separated but not yet divorced man building himself a new relationship.   Don’t see any trust issues with that.",
                    "author": "Dazzling_Truth6472",
                    "id": "jdgka49",
                    "parent_id": "t1_jdfvrdx",
                    "score": 11,
                    "created_utc": 1679638865.0,
                    "replies": [
                        {
                            "body": "Yeah… this story seems like it’s made up and fake. “a few weeks after she reached out to me on instagram”? What kinda wife does that and is all chill about it?\n\nAgain, I’m just getting a vibe that this is something the poster completely fabricated … it reads almost like a bad romance novella.",
                            "author": "lukeSkywalker2061",
                            "id": "jdh70n3",
                            "parent_id": "t1_jdgka49",
                            "score": 3,
                            "created_utc": 1679657253.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some men get sloppy when they think they can’t get caught & get too comfortable.",
            "author": "femblvd",
            "id": "jdkecwp",
            "parent_id": "t1_jdfsl3j",
            "score": 3,
            "created_utc": 1679705714.0,
            "replies": []
        },
        {
            "body": "Open relationship is also an option. Doesn't have to be cheating to date outside of your marriage.",
            "author": "Taco_Daddy_99",
            "id": "jdhv23c",
            "parent_id": "t1_jdfzu5z",
            "score": 5,
            "created_utc": 1679668787.0,
            "replies": [
                {
                    "body": "Rare and often complicated.  Any SB with a SD claiming this should verify.",
                    "author": "TXPolyDaddy",
                    "id": "jdi0exf",
                    "parent_id": "t1_jdhv23c",
                    "score": 7,
                    "created_utc": 1679670878.0,
                    "replies": [
                        {
                            "body": "I prefer medium rare and uncomplicated, thanks 😂. Yeah, non monaganous relationships can be considered rare since it's not the norm. My point was that a SD doesn't necessarily need to be un-partnered in order to enjoy a SD/SB relationship without cheating. As long as their partner agrees to being open of course. As to whether a SB can and should verify is a different conversation.",
                            "author": "Taco_Daddy_99",
                            "id": "jdi2zr3",
                            "parent_id": "t1_jdi0exf",
                            "score": 4,
                            "created_utc": 1679671870.0,
                            "replies": []
                        },
                        {
                            "body": "Assuming they care enough to check 😉",
                            "author": "Terrible-Fix-9798",
                            "id": "jezobwy",
                            "parent_id": "t1_jdi0exf",
                            "score": 1,
                            "created_utc": 1680654793.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Absolutely agree!\nIf the marriage is dead, but your freedom back and enjoy life!  It took a long time to detox from my bad marriage but having a great SB sure helped.\nOnce I told the wife we were done and she moved to a rental house of mine I felt better and started looking for a SB.",
            "author": "TXPolyDaddy",
            "id": "jdi0s39",
            "parent_id": "t1_jdfzu5z",
            "score": 5,
            "created_utc": 1679671021.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "jditd5a",
                    "parent_id": "t1_jdi0s39",
                    "score": 4,
                    "created_utc": 1679681871.0,
                    "replies": [
                        {
                            "body": "True\nHard conversations for sure.\nHowever she knows and feels the same distance and gap.  Likely she is no happier about it.",
                            "author": "TXPolyDaddy",
                            "id": "jdkq4vf",
                            "parent_id": "t1_jditd5a",
                            "score": 2,
                            "created_utc": 1679711382.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "When trust is gone, everything feels different.",
            "author": "Numerous-Ad3709",
            "id": "jdgfsm6",
            "parent_id": "t1_jdg13mu",
            "score": 25,
            "created_utc": 1679635458.0,
            "replies": [
                {
                    "body": "I feel like forgiveness would bring the trust right back. At least for me, anyways.",
                    "author": "KYogini",
                    "id": "jdgjfmf",
                    "parent_id": "t1_jdgfsm6",
                    "score": 3,
                    "created_utc": 1679638192.0,
                    "replies": [
                        {
                            "body": "That, and a wad of cash! 😜",
                            "author": "Ok-Yogurt-2743",
                            "id": "jdhsmud",
                            "parent_id": "t1_jdgjfmf",
                            "score": 9,
                            "created_utc": 1679667814.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I too agree sometimes men in blatantly made up stories like OPs are villainous.",
            "author": "JumboJetz",
            "id": "jdhb48j",
            "parent_id": "t1_jdg551j",
            "score": 6,
            "created_utc": 1679659680.0,
            "replies": []
        },
        {
            "body": "It isn’t all on him.  Why would she show up unannounced?  He could have been divorced or single, and her showing up like that could still have caused all kinds of trouble.  If this story is true, it’s on both of them.",
            "author": "MrBuzzard",
            "id": "jdi42qz",
            "parent_id": "t1_jdhjvh7",
            "score": 3,
            "created_utc": 1679672285.0,
            "replies": [
                {
                    "body": "if the SD didn't want her to show up unannounced, he would've said after she did that once. OP said he was always happy to see her when she showed up, never made any other comments. that's totally on him.",
                    "author": "just4subfun__",
                    "id": "jdioghn",
                    "parent_id": "t1_jdi42qz",
                    "score": 5,
                    "created_utc": 1679679982.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe this sub needs a fiction flare. It can be called \"A letter to Penthouse\".\n\nDear Penthouse, I never thought I would be writing one of these letters, but...",
            "author": "geeky-sd",
            "id": "jdh4jqu",
            "parent_id": "t1_jdfk1xo",
            "score": 6,
            "created_utc": 1679655646.0,
            "replies": []
        },
        {
            "body": "Mine pays for my daughter’s tuition lol - they’re out there!",
            "author": "ronitabonita",
            "id": "jdho6vo",
            "parent_id": "t1_jdhbs6x",
            "score": 7,
            "created_utc": 1679665975.0,
            "replies": []
        },
        {
            "body": "Depends on the state. But yes some have what are called home wrecker laws.",
            "author": "Leeper90",
            "id": "jdhr5pp",
            "parent_id": "t1_jdhhwm6",
            "score": 4,
            "created_utc": 1679667214.0,
            "replies": [
                {
                    "body": "Okay, thanks I must Google that before my next visit 🤔",
                    "author": "Additional-Hornet-81",
                    "id": "jdi7adj",
                    "parent_id": "t1_jdhr5pp",
                    "score": 1,
                    "created_utc": 1679673503.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup. Alienation of Affection and Home Wrecker. North Carolina and Utah are the biggest ones, but there’s 5 or 6 others. Alienated spouse can sue the affair partner(s) as part of the divorce.",
            "author": "MedicGirl",
            "id": "jdivsd5",
            "parent_id": "t1_jdhhwm6",
            "score": 2,
            "created_utc": 1679682814.0,
            "replies": [
                {
                    "body": "Hmmm fair enough but to me that sounds insane 🤔.\n\nOn the other hand it would have been nice to sue the living shit out of the guy that sleept with my ex-wife. That’s what I get for living in a socialist country 😂😂😂",
                    "author": "Additional-Hornet-81",
                    "id": "jdjb5h6",
                    "parent_id": "t1_jdivsd5",
                    "score": 3,
                    "created_utc": 1679688815.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No one in the US says Uni for university. OP is most likely in Europe.",
            "author": "Blacktieintherain",
            "id": "jdimo7c",
            "parent_id": "t1_jdhhwm6",
            "score": 2,
            "created_utc": 1679679310.0,
            "replies": []
        },
        {
            "body": "EVER!",
            "author": "Important-Eye-5241",
            "id": "jdjzrow",
            "parent_id": "t1_jdit7nf",
            "score": 1,
            "created_utc": 1679699144.0,
            "replies": [
                {
                    "body": "Right ! I wont even let the person in",
                    "author": "Hope_for_tendies",
                    "id": "jdk1x2z",
                    "parent_id": "t1_jdjzrow",
                    "score": 1,
                    "created_utc": 1679700107.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "also Im not sure if she could have sued you.\nI looked up alienation of affection, and that appears to be an intentional tort.  In your case, Im not even sure it counts as negligence.  \n\nculpability usually goes \nnegligence -> reckless -> intentional\n\nplus, as a student you have no assets.  She could sue and would be unable to collect if you simply declared bankruptcy",
            "author": "kerfluffle99",
            "id": "jdg6nj7",
            "parent_id": "t1_jdg65x1",
            "score": 5,
            "created_utc": 1679629856.0,
            "replies": []
        },
        {
            "body": ">Totally HIS fault for not ~~keeping his address protected~~ being honest about his marital status!!! Dumbass !!!\n\nFTFI.",
            "author": "A-touchofreality",
            "id": "jdh7j7q",
            "parent_id": "t1_jdh4mr1",
            "score": 3,
            "created_utc": 1679657580.0,
            "replies": []
        },
        {
            "body": "Are you purposely being obtuse? The issue isn’t who can have multiple partners. An SD can have multiple SBs or a married SD can have an SB if everyone is open and honest (lol). This man wasn’t honest about being married. That’s the fucking issue, but yes, please phrase this as some sort of double standard. 🙄\n\nAlso, cash for pussy? That’s rich coming from you. Where do you fall in this equation yourself? You’re telling OP to develop morals in order to avoid dealing with immoral people, but wouldn’t that make you immoral since by your own admission, you pay for pussy?",
            "author": "GoodyGoobert",
            "id": "jdl41rf",
            "parent_id": "t1_jdij59x",
            "score": 3,
            "created_utc": 1679719017.0,
            "replies": []
        },
        {
            "body": "It’s more than just pussy or it would be escorting . You didn’t have to go that hard 🤯",
            "author": "Hope_for_tendies",
            "id": "jditpb2",
            "parent_id": "t1_jdij59x",
            "score": 1,
            "created_utc": 1679682004.0,
            "replies": []
        },
        {
            "body": "Oh his wife drained most of his money lol, and also I'm still mad and hurt. \n\nHe was more than horrified, i wish there was a word for it, like traumatized I'm the moment? Lol idk he looked like he saw a biblically accurate angel and or something.",
            "author": "lsowow",
            "id": "jdfjmdh",
            "parent_id": "t1_jdfixqd",
            "score": 8,
            "created_utc": 1679618988.0,
            "replies": []
        },
        {
            "body": "Because he lied to her? That’s not something people just get over.",
            "author": "GoodyGoobert",
            "id": "jdfjmly",
            "parent_id": "t1_jdfixqd",
            "score": 8,
            "created_utc": 1679618990.0,
            "replies": []
        },
        {
            "body": ">and looks like she went back to uni to finish her PhD.\n\nGotta love strong women who turn misfortune into an opportunity!",
            "author": "Quasimodo1974",
            "id": "jdgyqao",
            "parent_id": "t1_jdfn0z5",
            "score": 45,
            "created_utc": 1679651252.0,
            "replies": [
                {
                    "body": "That's how bad ass bitches make a way!!!🤜🏻🤛🏼",
                    "author": "JustAsk4Alice",
                    "id": "jdiab4g",
                    "parent_id": "t1_jdgyqao",
                    "score": 10,
                    "created_utc": 1679674646.0,
                    "replies": [
                        {
                            "body": "Yes!",
                            "author": "Quasimodo1974",
                            "id": "jdic8c8",
                            "parent_id": "t1_jdiab4g",
                            "score": 2,
                            "created_utc": 1679675369.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The best revenge on someone is living well without them. Sounds like she’s doing great!",
            "author": "olivinemultichrome",
            "id": "jdhcbre",
            "parent_id": "t1_jdfn0z5",
            "score": 14,
            "created_utc": 1679660340.0,
            "replies": []
        },
        {
            "body": "Love this for her!!",
            "author": "Professional-Dirt856",
            "id": "jdgbtdp",
            "parent_id": "t1_jdfn0z5",
            "score": 17,
            "created_utc": 1679632827.0,
            "replies": []
        },
        {
            "body": "Doesn’t add up for me either.  If you went to his house multiple times without meeting her or him being concerned means she wasn’t living with him and must have just been on a random visit.   So they were separated and divorce was well on its way.  She was probably nice to you because that chance encounter allowed her to take him to the cleaners in the divorce.   So this is hardly married man playing away and much more separated but not yet divorced man building himself a new relationship.   Don’t see any trust issues with that.",
            "author": "Dazzling_Truth6472",
            "id": "jdgka49",
            "parent_id": "t1_jdfvrdx",
            "score": 11,
            "created_utc": 1679638865.0,
            "replies": [
                {
                    "body": "Yeah… this story seems like it’s made up and fake. “a few weeks after she reached out to me on instagram”? What kinda wife does that and is all chill about it?\n\nAgain, I’m just getting a vibe that this is something the poster completely fabricated … it reads almost like a bad romance novella.",
                    "author": "lukeSkywalker2061",
                    "id": "jdh70n3",
                    "parent_id": "t1_jdgka49",
                    "score": 3,
                    "created_utc": 1679657253.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Rare and often complicated.  Any SB with a SD claiming this should verify.",
            "author": "TXPolyDaddy",
            "id": "jdi0exf",
            "parent_id": "t1_jdhv23c",
            "score": 7,
            "created_utc": 1679670878.0,
            "replies": [
                {
                    "body": "I prefer medium rare and uncomplicated, thanks 😂. Yeah, non monaganous relationships can be considered rare since it's not the norm. My point was that a SD doesn't necessarily need to be un-partnered in order to enjoy a SD/SB relationship without cheating. As long as their partner agrees to being open of course. As to whether a SB can and should verify is a different conversation.",
                    "author": "Taco_Daddy_99",
                    "id": "jdi2zr3",
                    "parent_id": "t1_jdi0exf",
                    "score": 4,
                    "created_utc": 1679671870.0,
                    "replies": []
                },
                {
                    "body": "Assuming they care enough to check 😉",
                    "author": "Terrible-Fix-9798",
                    "id": "jezobwy",
                    "parent_id": "t1_jdi0exf",
                    "score": 1,
                    "created_utc": 1680654793.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "jditd5a",
            "parent_id": "t1_jdi0s39",
            "score": 4,
            "created_utc": 1679681871.0,
            "replies": [
                {
                    "body": "True\nHard conversations for sure.\nHowever she knows and feels the same distance and gap.  Likely she is no happier about it.",
                    "author": "TXPolyDaddy",
                    "id": "jdkq4vf",
                    "parent_id": "t1_jditd5a",
                    "score": 2,
                    "created_utc": 1679711382.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I feel like forgiveness would bring the trust right back. At least for me, anyways.",
            "author": "KYogini",
            "id": "jdgjfmf",
            "parent_id": "t1_jdgfsm6",
            "score": 3,
            "created_utc": 1679638192.0,
            "replies": [
                {
                    "body": "That, and a wad of cash! 😜",
                    "author": "Ok-Yogurt-2743",
                    "id": "jdhsmud",
                    "parent_id": "t1_jdgjfmf",
                    "score": 9,
                    "created_utc": 1679667814.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "if the SD didn't want her to show up unannounced, he would've said after she did that once. OP said he was always happy to see her when she showed up, never made any other comments. that's totally on him.",
            "author": "just4subfun__",
            "id": "jdioghn",
            "parent_id": "t1_jdi42qz",
            "score": 5,
            "created_utc": 1679679982.0,
            "replies": []
        },
        {
            "body": "Okay, thanks I must Google that before my next visit 🤔",
            "author": "Additional-Hornet-81",
            "id": "jdi7adj",
            "parent_id": "t1_jdhr5pp",
            "score": 1,
            "created_utc": 1679673503.0,
            "replies": []
        },
        {
            "body": "Hmmm fair enough but to me that sounds insane 🤔.\n\nOn the other hand it would have been nice to sue the living shit out of the guy that sleept with my ex-wife. That’s what I get for living in a socialist country 😂😂😂",
            "author": "Additional-Hornet-81",
            "id": "jdjb5h6",
            "parent_id": "t1_jdivsd5",
            "score": 3,
            "created_utc": 1679688815.0,
            "replies": []
        },
        {
            "body": "Right ! I wont even let the person in",
            "author": "Hope_for_tendies",
            "id": "jdk1x2z",
            "parent_id": "t1_jdjzrow",
            "score": 1,
            "created_utc": 1679700107.0,
            "replies": []
        },
        {
            "body": "That's how bad ass bitches make a way!!!🤜🏻🤛🏼",
            "author": "JustAsk4Alice",
            "id": "jdiab4g",
            "parent_id": "t1_jdgyqao",
            "score": 10,
            "created_utc": 1679674646.0,
            "replies": [
                {
                    "body": "Yes!",
                    "author": "Quasimodo1974",
                    "id": "jdic8c8",
                    "parent_id": "t1_jdiab4g",
                    "score": 2,
                    "created_utc": 1679675369.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah… this story seems like it’s made up and fake. “a few weeks after she reached out to me on instagram”? What kinda wife does that and is all chill about it?\n\nAgain, I’m just getting a vibe that this is something the poster completely fabricated … it reads almost like a bad romance novella.",
            "author": "lukeSkywalker2061",
            "id": "jdh70n3",
            "parent_id": "t1_jdgka49",
            "score": 3,
            "created_utc": 1679657253.0,
            "replies": []
        },
        {
            "body": "I prefer medium rare and uncomplicated, thanks 😂. Yeah, non monaganous relationships can be considered rare since it's not the norm. My point was that a SD doesn't necessarily need to be un-partnered in order to enjoy a SD/SB relationship without cheating. As long as their partner agrees to being open of course. As to whether a SB can and should verify is a different conversation.",
            "author": "Taco_Daddy_99",
            "id": "jdi2zr3",
            "parent_id": "t1_jdi0exf",
            "score": 4,
            "created_utc": 1679671870.0,
            "replies": []
        },
        {
            "body": "Assuming they care enough to check 😉",
            "author": "Terrible-Fix-9798",
            "id": "jezobwy",
            "parent_id": "t1_jdi0exf",
            "score": 1,
            "created_utc": 1680654793.0,
            "replies": []
        },
        {
            "body": "True\nHard conversations for sure.\nHowever she knows and feels the same distance and gap.  Likely she is no happier about it.",
            "author": "TXPolyDaddy",
            "id": "jdkq4vf",
            "parent_id": "t1_jditd5a",
            "score": 2,
            "created_utc": 1679711382.0,
            "replies": []
        },
        {
            "body": "That, and a wad of cash! 😜",
            "author": "Ok-Yogurt-2743",
            "id": "jdhsmud",
            "parent_id": "t1_jdgjfmf",
            "score": 9,
            "created_utc": 1679667814.0,
            "replies": []
        },
        {
            "body": "Yes!",
            "author": "Quasimodo1974",
            "id": "jdic8c8",
            "parent_id": "t1_jdiab4g",
            "score": 2,
            "created_utc": 1679675369.0,
            "replies": []
        }
    ]
}