{
    "title": "Platonic - for the love of all that's Holy - Rant",
    "post_id": "jvrz79",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/jvrz79/platonic_for_the_love_of_all_thats_holy_rant/",
    "author": "thereadinessisall",
    "body": "I'm triggered - I have seen rash of posts recently and its too much for me\n\nPlease stop. Platonic means NO sex. Of ANY kind. No hand jobs, no oral, no anal, no French kissing, no fondling. No Nothing. No exchanging of bodily fluids. Or any sexual activity.\n\nPlease stop trying to massage, finesse, corrupt, and/or re-define that word. Instead why don't *you* be clear and say I only do: X or anything but: Y - \n\n if you actually mean NO SEXUAL ACTIVITY AT ALL then yes, please feel free to use the word: Platonic.\n\nand I've also seen \"mostly platonic\" or \"a little platonic\" -- NOPE. No. Nyet!\n\nPlatonic, much like pregnant, is either you are or you are not. Can't be a little pregnant. Can't be mostly pregnant.\n\nIf you want to take it slow leading up to intimacy, then again, it's not platonic - it's taking it slow. You could say \" I want a platonic friendship until I feel comfortable to engage\" - but that's still not really platonic as your goal is to be intimate.\n\nSorry, I just can't take all these posts, and frankly I am a bit tired of the corruption of words. It's not an evolution of language.\n\nAnd lastly I would argue - if you can not clearly communicate exactly what you want and feel... you are going to have a harder time in the bowl and in life itself.\n\nFully prepared to get flamed but there you go. Party on.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/jvrz79/platonic_for_the_love_of_all_thats_holy_rant/",
    "score": 176,
    "upvote_ratio": 0.9,
    "created_utc": 1605615302.0,
    "num_comments": 59,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "gclu3q8",
            "parent_id": "t3_jvrz79",
            "score": 50,
            "created_utc": 1605618513.0,
            "replies": [
                {
                    "body": "They're absolutely radiant",
                    "author": "Church42",
                    "id": "gclujbz",
                    "parent_id": "t1_gclu3q8",
                    "score": 19,
                    "created_utc": 1605618824.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gcluqnm",
                            "parent_id": "t1_gclujbz",
                            "score": 13,
                            "created_utc": 1605618969.0,
                            "replies": [
                                {
                                    "body": "I had a plutonic SB once... I told her \"I am fascinated with Uranus.\"\n\n\\*ba dum ching\\*",
                                    "author": "BinghamtonSD",
                                    "id": "gclzw38",
                                    "parent_id": "t1_gcluqnm",
                                    "score": 29,
                                    "created_utc": 1605622311.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gcm18in",
                                            "parent_id": "t1_gclzw38",
                                            "score": 7,
                                            "created_utc": 1605623103.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you! Thank you! I'll be here all night. Tip your waitress. Enjoy the veal.",
                                                    "author": "BinghamtonSD",
                                                    "id": "gcm1nnq",
                                                    "parent_id": "t1_gcm18in",
                                                    "score": 17,
                                                    "created_utc": 1605623342.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Mine as well",
                    "author": "Elvishgirl",
                    "id": "gcobe15",
                    "parent_id": "t1_gclu3q8",
                    "score": 1,
                    "created_utc": 1605663621.0,
                    "replies": []
                },
                {
                    "body": "I like the plutocratic SBs!",
                    "author": "marker3000",
                    "id": "gcogwr5",
                    "parent_id": "t1_gclu3q8",
                    "score": 1,
                    "created_utc": 1605666720.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Corruption of language just bugs the hell out of me.  My oldest kid tried to convince his younger brother that it was okay to call himself \"asexual\" if he wanted to--the younger brother decided that \"asexual\" just means \"doesn't want to date\".  I had to explain that \"asexual\" means \"having no sexual feelings\" and that no one with that much porn stored on his phone AND his laptop could possibly be asexual.  \n\n\nHuge fight with the oldest, who kept insisting that \"he should be able to use that label if he wants to.\".  Um, no.  No he shouldn't.",
            "author": "MartinB75",
            "id": "gcm4a0s",
            "parent_id": "t3_jvrz79",
            "score": 48,
            "created_utc": 1605624810.0,
            "replies": [
                {
                    "body": "🤣🤣🤣 what did he say when he found out you knew he has porn stored on his phone/laptop?",
                    "author": "tamenwild",
                    "id": "gcm7f9h",
                    "parent_id": "t1_gcm4a0s",
                    "score": 15,
                    "created_utc": 1605626485.0,
                    "replies": [
                        {
                            "body": "He was momentarily shocked--and then remembered what Dad does for a living (I'm in IT).  I've told all the kids from the moment they got their first computer, tablet, or phone that if it happens on my network, I can see it, so don't even bother trying to lie to me about what you're up to.  \n\n\nSo far only the youngest has tried to find ways around me.  I gotta hand it to him, he's both clever and persistent.  I expect he'll have figured out how to edit my network logs in a couple of years if he keeps at it.  :-)",
                            "author": "MartinB75",
                            "id": "gcmwuxx",
                            "parent_id": "t1_gcm7f9h",
                            "score": 22,
                            "created_utc": 1605638387.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That’s one of my pet peeves as well.  My daughter was not amused by my attempt to do the same thing when I told her that I felt like $10 is the same as the she $40 she would typically get on Friday night.  Just take $10,  it’s only paper and value is subjective,  I can change my feelings about it, it can buy less or more depending on the day or location, etc.   suddenly $40 is $40,  imagine that.",
                    "author": "LotBuilder",
                    "id": "gcnlmq7",
                    "parent_id": "t1_gcm4a0s",
                    "score": 5,
                    "created_utc": 1605649802.0,
                    "replies": []
                },
                {
                    "body": ">\"he should be able to use that label if he wants to.\".  Um, no.  No he shouldn't.\n\nThis is an essential detail here.\n\nWords have meanings. We can't just pretend they mean different things. Language & communication literally depend on a common understanding of meaning.",
                    "author": "SD_in_training",
                    "id": "gcmf1p9",
                    "parent_id": "t1_gcm4a0s",
                    "score": 14,
                    "created_utc": 1605630216.0,
                    "replies": []
                },
                {
                    "body": "Oof. Yea, your kid is definitely not ace. \n\nFun way to call him out tho",
                    "author": "Elvishgirl",
                    "id": "gcobkah",
                    "parent_id": "t1_gcm4a0s",
                    "score": 3,
                    "created_utc": 1605663717.0,
                    "replies": [
                        {
                            "body": "We've had some pretty frank discussions about sexuality and masturbation since then, so it was a good conversation starter (he is thankfully nearly incapable of being embarrassed--makes him a real asset in drama club).  Once I explained the difference between \"sex\" and \"dating\" in this context, he immediately got it.  \n\nThe older sibling, though, kept arguing.  I've got half a mind to make that child sit in the corner and copy out the dictionary, one word at a time...",
                            "author": "MartinB75",
                            "id": "gcpthvq",
                            "parent_id": "t1_gcobkah",
                            "score": 2,
                            "created_utc": 1605706728.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "well, the word platonic comes from Plato and his Idealism, and the platonic ideal of a woman is not without sex, it's just the ideal form of love that goes beyond sex. But the type of platonic love sold on sugar sites is far from a platonic ideal of love, it's more akin to loneliness meeting a predatory love of lucre.",
                    "author": "_steady_hand_",
                    "id": "gcr3q6b",
                    "parent_id": "t1_gcm4a0s",
                    "score": 1,
                    "created_utc": 1605729676.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think you are preaching to the choir. The pots that are wanting a platonic or online SR are not reading anything as useful as your rant.",
            "author": "AFSMSgt",
            "id": "gclugdh",
            "parent_id": "t3_jvrz79",
            "score": 24,
            "created_utc": 1605618765.0,
            "replies": [
                {
                    "body": "mostly. probably but have seen a bunch of posts and replies from SDs too playing along with (or I should say entertaining)  this corruption.",
                    "author": "thereadinessisall",
                    "id": "gclusoo",
                    "parent_id": "t1_gclugdh",
                    "score": 3,
                    "created_utc": 1605619008.0,
                    "replies": [
                        {
                            "body": "Certain SDs are totally okay with certain naive SBs justifying things to themselves as “I’m different, I only do platonic!” if it means they ultimately will put out in some way despite that incorrect label. \n\nThis really boils down to people corrupting language because they couldn’t possibly judge themselves the way they judge others. “I’m only in platonic SRs! We don’t have sex so YOURE a slut, but I’m not!”(platonic meaning oral to completion 2x a week)",
                            "author": "Yourstruly0",
                            "id": "gcn0mot",
                            "parent_id": "t1_gclusoo",
                            "score": 0,
                            "created_utc": 1605640113.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Can we call “Experience-Only” “SDs” platonic daddies? They are not providing financial support, in any whatsoever. \n\nDinners. Drinks. MAYBE trips. MAYBE mani/pedi. MAYBE hair. MAYYYYYBE rent. \n\nI feel like this category of men ought to be called “platonic daddies” (I kid. They are just vanilla dating, not sugar dating!!!)",
            "author": "ExExpectations",
            "id": "gcmj7d0",
            "parent_id": "t3_jvrz79",
            "score": 15,
            "created_utc": 1605632147.0,
            "replies": [
                {
                    "body": "no. they'd be salt daddies, Splenda daddies, or faux daddies in that case.\n\nif there is any sexual activity involved it is not platonic ;) (I get your joke, I do... but somewhere somehow somebody is gonna take that and run with it...)",
                    "author": "thereadinessisall",
                    "id": "gcmjnba",
                    "parent_id": "t1_gcmj7d0",
                    "score": 14,
                    "created_utc": 1605632352.0,
                    "replies": [
                        {
                            "body": "Right. I’m kidding of course. \n\nSince the commodity on the SB side is sexual, and the commodity on the SD side is monetary. If there’s no commodity from the “SD” side, he cannot be an SD.\n\nVanilla dating. Boyfriend picking up the bills. That’s the extent of categorization.",
                            "author": "ExExpectations",
                            "id": "gcmjvga",
                            "parent_id": "t1_gcmjnba",
                            "score": 7,
                            "created_utc": 1605632457.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">Can we call “Experience-Only” “SDs” platonic daddies? They are not providing financial support, in any whatsoever.\n\nNo, you cannot.  The whole point of this post is that when a word has an established meaning that everyone understands, you shouldn't try to change it for no good reason.   Just call them \"experience-only SDs.\"",
                    "author": "UseTheForceRey",
                    "id": "gcmm0ec",
                    "parent_id": "t1_gcmj7d0",
                    "score": 1,
                    "created_utc": 1605633437.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">no anal\n\nOh, come on! I mean, now your just being silly. Next you'll be saying we can't even talk on a platonic date, or engage in untrained dry needling and breath play!",
            "author": null,
            "id": "gcnr3ip",
            "parent_id": "t3_jvrz79",
            "score": 3,
            "created_utc": 1605652516.0,
            "replies": []
        },
        {
            "body": "People will try all sorts of things online which are not accurate. They may misuse language. They may misrepresent intentions. They may try to trick you, scam you, ruin you etc. You can’t easily control how other people speak, how other people act, or what other people’s intentions are. \n\nYou can only control what you do, eg ignore or interact.",
            "author": "daddoms",
            "id": "gcm8tk9",
            "parent_id": "t3_jvrz79",
            "score": 3,
            "created_utc": 1605627197.0,
            "replies": [
                {
                    "body": "You can also teach, engage, enlighten.",
                    "author": "thereadinessisall",
                    "id": "gcm9vam",
                    "parent_id": "t1_gcm8tk9",
                    "score": 5,
                    "created_utc": 1605627728.0,
                    "replies": [
                        {
                            "body": "Of course. Just don’t be surprised if people don’t want to be enlightened — they may have another agenda. Words are most useful when there is a shared meaning. There are two meaning of the term platonic. I agree that in the context of an arrangement, the carnal meaning of the term is most useful, however the love between a daddy and his girl falls more into the other meaning, so there is room for confusion.",
                            "author": "daddoms",
                            "id": "gcmketz",
                            "parent_id": "t1_gcm9vam",
                            "score": 3,
                            "created_utc": 1605632708.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I will not go into details but I just got back from a lunch that had these qualities. Her light bulb went on when it became clear that she wasn't getting a PPM for \"getting closer to intimacy\".  Lots of other problems with the would be SB (not sugaring for good reasons IMHO) but not really connecting the dots was one of them.\n\n\"Look, I like you and I am not saying you would but that is often called rinsing - dangling the prospect of intimacy out there and it never happens.  When we sleep with each other than it kicks in.\"\n\nThanks SLF - probably saved myself several hundred dollars and bluish balls.",
            "author": null,
            "id": "gcnuuk4",
            "parent_id": "t3_jvrz79",
            "score": 3,
            "created_utc": 1605654448.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gclqrs7",
            "parent_id": "t3_jvrz79",
            "score": 8,
            "created_utc": 1605615903.0,
            "replies": [
                {
                    "body": "But(t) they love Jesus...",
                    "author": "curly_spice",
                    "id": "gclqydo",
                    "parent_id": "t1_gclqrs7",
                    "score": 12,
                    "created_utc": 1605616056.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gclri3f",
                            "parent_id": "t1_gclqydo",
                            "score": 2,
                            "created_utc": 1605616510.0,
                            "replies": []
                        },
                        {
                            "body": "Damn it now I got coffee on my iPad 😂😂😂",
                            "author": "BratinaHat",
                            "id": "gclxtur",
                            "parent_id": "t1_gclqydo",
                            "score": 1,
                            "created_utc": 1605621026.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "\"Eatin' ain't cheatin'\" - Bill Clinton",
                    "author": "Patrucio71",
                    "id": "gcm0qsz",
                    "parent_id": "t1_gclqrs7",
                    "score": 9,
                    "created_utc": 1605622821.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gcm336k",
                            "parent_id": "t1_gcm0qsz",
                            "score": 3,
                            "created_utc": 1605624159.0,
                            "replies": [
                                {
                                    "body": "That depends on what the meaning of the word 'is' is",
                                    "author": "Cledaddy23",
                                    "id": "gcmly7p",
                                    "parent_id": "t1_gcm336k",
                                    "score": 3,
                                    "created_utc": 1605633409.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "😀",
                            "author": null,
                            "id": "gcm2exb",
                            "parent_id": "t1_gcm0qsz",
                            "score": 1,
                            "created_utc": 1605623783.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> church for the 'virgins' who keep only one of the entrances shut.\n\nI'm not religious, but I do not know of a single church that preaches no PIV before marriage but allows other forms of sex.",
                    "author": "UseTheForceRey",
                    "id": "gcmlpjx",
                    "parent_id": "t1_gclqrs7",
                    "score": 0,
                    "created_utc": 1605633299.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gcmqnxu",
                            "parent_id": "t1_gcmlpjx",
                            "score": 4,
                            "created_utc": 1605635559.0,
                            "replies": [
                                {
                                    "body": ">There's as far as I know (but I'm an agnost) no church who preaches no piv and all the rest is allowed.\n\nThen you probably shouldn't blame \"the church....\"    Yes, I'm being nit-picky, but this is a post about proper use of language.",
                                    "author": "UseTheForceRey",
                                    "id": "gcmssv1",
                                    "parent_id": "t1_gcmqnxu",
                                    "score": 1,
                                    "created_utc": 1605636531.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I've read stories of religious couples who \"only\" had anal sex before marriage because then they'd still be \"virgins \" on their wedding night ( for \"real sex\", ie PIV )  Yes, it's fucked up.",
                            "author": "daisydawnie",
                            "id": "gcmx9az",
                            "parent_id": "t1_gcmlpjx",
                            "score": 2,
                            "created_utc": 1605638570.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for this post. \nIt was long overdue. .",
            "author": "dontcallmechristian",
            "id": "gcmdf9e",
            "parent_id": "t3_jvrz79",
            "score": 2,
            "created_utc": 1605629456.0,
            "replies": []
        },
        {
            "body": "Chill out and switch to decafe.",
            "author": "JoeMcKDaddy",
            "id": "gcndf1v",
            "parent_id": "t3_jvrz79",
            "score": 3,
            "created_utc": 1605645968.0,
            "replies": []
        },
        {
            "body": "The fact that anyone even tries to be a \"platonic\" SB at all is fucking hilarious. Like yeah, sure, she wants to get paid to just.....hang out? Yo, if I want to  just hang out with a chick I don't need to pay her for it lmao.",
            "author": "techtonic",
            "id": "gcm6dcf",
            "parent_id": "t3_jvrz79",
            "score": 4,
            "created_utc": 1605625939.0,
            "replies": [
                {
                    "body": "Based on what some of these \"platonic SBs\" actually seem to mean by platonic, they seem far more plausible than I would originally guess.",
                    "author": "SD_in_training",
                    "id": "gcmfa64",
                    "parent_id": "t1_gcm6dcf",
                    "score": 4,
                    "created_utc": 1605630325.0,
                    "replies": [
                        {
                            "body": "Yeah most of them I've been running across on SA specifically are like NO sexual or physical contact. I pretty much have a short answer that I copy/paste to them and then move on with my life. What a waste of time.",
                            "author": "techtonic",
                            "id": "gcmiyiv",
                            "parent_id": "t1_gcmfa64",
                            "score": 0,
                            "created_utc": 1605632035.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "There is a post in one of the \"be careful\" threads where the OP claims getting five figures without having sex and others claim over 1k PPM for platonic dates.",
                    "author": null,
                    "id": "gcmjmd8",
                    "parent_id": "t1_gcm6dcf",
                    "score": 4,
                    "created_utc": 1605632340.0,
                    "replies": [
                        {
                            "body": "haha if they're not lying/trolling, good for them. \n\nThe most unbelievable thing about that is generally, people who can afford that, are really smart with their money. Like myself.\n\nBut hey, who knows. Maybe they found some really old, successful guys who can't get it up anymore but they really enjoy the company and taking care of a pretty girl.\n\nIt could happen.",
                            "author": "techtonic",
                            "id": "gcmk6cw",
                            "parent_id": "t1_gcmjmd8",
                            "score": 5,
                            "created_utc": 1605632599.0,
                            "replies": [
                                {
                                    "body": "Every single girl on SA that has told me they were looking for something platonic eventually gave up because they came to the realization that every guy wants intimacy. Every single girl. I think a guy might consider taking a platonic girl out a few times but then stop after realizing he’s not going to get any action. \n\nI know a girl who had a sugar daddy that would give her a nice allowance just to go on dates with him. Nothing sexual, no nudes, just dates once a week. She said he was a lot older, his wife passed away, and was extremely lonely and desperate and just wanted company. There are men out there like this but they are the exception.",
                                    "author": "Fun_Focus8159",
                                    "id": "gcmzmun",
                                    "parent_id": "t1_gcmk6cw",
                                    "score": 2,
                                    "created_utc": 1605639650.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I mean, it happens, but the odds are so vanishingly small that no one should be building a strategy around it. That thousands of people have leaned into this idea and spend hours a day trying to make it work is pretty wild.",
                            "author": "TerribleMajor",
                            "id": "gcoi6sk",
                            "parent_id": "t1_gcmjmd8",
                            "score": 1,
                            "created_utc": 1605667438.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "honestly i had a platonic SD and it was so much work. i ended things!  we would meet and go for coffee - he was pretty socially awkward and i think he felt like he was \"saving\" me from the sugar bowl.  at first i was super suspicious that he was offering platonic only (i didnt ask for it) but as time went on, i think his idea was that we'd gradually get to know each other and i'd warm up to him and it would transition to a traditional vanilla relationship.  he was a nice enough person but his emotional needs were too much for me and it was easier to end things.",
                    "author": "jinjinb",
                    "id": "gcomwhm",
                    "parent_id": "t1_gcm6dcf",
                    "score": 1,
                    "created_utc": 1605670186.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When they tell me they only do platonic, I answer by offering Monopoly money.",
            "author": "Limitlesspappy",
            "id": "gcmdqcj",
            "parent_id": "t3_jvrz79",
            "score": 4,
            "created_utc": 1605629602.0,
            "replies": []
        },
        {
            "body": "I agree with you, but I think the boat has already sailed on the \"corruption of words\". Its become a new norm. \n\nLanguage has always been fluid and the meaning of words evolve over time and common use.  With the advent of Social Media , the rate of change has exploded. It's the whole reason UrbanDictionary exists.  A word that meant one thing last week is used by a celebrity or public figure in a new way and takes on a new \"trendy\" meaning almost instantly.",
            "author": "willfromvb",
            "id": "gcmalxj",
            "parent_id": "t3_jvrz79",
            "score": 4,
            "created_utc": 1605628096.0,
            "replies": [
                {
                    "body": "Becoming the new norm can only happen if we all allow it to. \n\nThere’s a big difference between evolution and corruption. \n\nUrban Dictionary is geared more towards slang use or new fangled abbreviations. Like Handy - in sex terms it means a hand job, but it has not corrupted the original and agreed upon term. Otherwise handymen would be people who go around giving hand jobs. Plus it’s usually spelt ie as in handie which also alerts the reader that it’s not the typical meaning. \n\nThe only way this stops is if we stop it. And we should. Without a common agreement to the meaning of words and language there is no society. \n\nEvery time someone posts about Platonic the very first question should be to please define that for us.",
                    "author": "thereadinessisall",
                    "id": "gcmgng5",
                    "parent_id": "t1_gcmalxj",
                    "score": 1,
                    "created_utc": 1605630961.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "useless comment warning.   \nGiven Plato's desires towards Alcibiades I always found this an interesting phrase.",
            "author": "jtroad",
            "id": "gcmqq2u",
            "parent_id": "t3_jvrz79",
            "score": 2,
            "created_utc": 1605635584.0,
            "replies": []
        },
        {
            "body": "What’s your point? It is what it is?",
            "author": null,
            "id": "gcltsbq",
            "parent_id": "t3_jvrz79",
            "score": 2,
            "created_utc": 1605618281.0,
            "replies": []
        },
        {
            "body": "You're not wrong. \n\nBut I'm triggered too. C'mon - in a post where you harp on the importance of language and meaning, at least capitalize all your letters at the beginning of sentences or you cut the legs right out from under any linguistic argument you are employing. Get on the right side of history against this lazy abomination against proper style and usage!",
            "author": "Cledaddy23",
            "id": "gcmmi4h",
            "parent_id": "t3_jvrz79",
            "score": 1,
            "created_utc": 1605633659.0,
            "replies": []
        },
        {
            "body": "What the fuck am I reading? \n\nPlatonic means platonic. \n\nPlease use it as much as possible so it’s easier to filter you out so we don’t have to deal with you or any confusion you might have with understanding terminology \n\nI’ve been on a M&G where the nice lady mentioned platonic and we didn’t make it to appetizers. Awesome! Thank you for saving me time!",
            "author": "KnocDown",
            "id": "gco3kns",
            "parent_id": "t3_jvrz79",
            "score": 1,
            "created_utc": 1605659241.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gclz6iz",
            "parent_id": "t3_jvrz79",
            "score": 1,
            "created_utc": 1605621874.0,
            "replies": [
                {
                    "body": ">\"Platonic\" is defined as \"intimate and affectionate but not sexual\". I think a reasonable person could include kissing in that definition, as well as perhaps an intimate massage that you might call fondling.\n\nA friendly peck type of kiss or a normal massage, sure that could be platonic.    Making out or massage that involves private parts is \"sexual\" which is defined as \"relating to the instincts, physiological processes, and activities connected with physical attraction or intimate physical contact between individuals. \"",
                    "author": "UseTheForceRey",
                    "id": "gcm6fkc",
                    "parent_id": "t1_gclz6iz",
                    "score": 3,
                    "created_utc": 1605625972.0,
                    "replies": []
                },
                {
                    "body": "No. \n\nI feel like your an ally and please excuse my reply as I’m on my cell and can’t do the quote reply thing. \n\nThere are a few issues I have with your response. The definition of platonic is accurate. Yes the world is Not black and white, but language is by definition. It defines how we communicate as a species - if we just change meaning Willy nilly then what’s the point of language. \n\nFor Unlawful Carnal Knowledge was a criminal charge dating back to the 1600’s. It was shortened and evolved to Fuck meaning intercourse (as well as its pejoratives). iF a small group stated using the word fuck to mean: sitting on a couch holding hands while we watch Netflix we’d all be in trouble understanding. This corruption of platonic isn’t much different. \n\nKissing is sexual. Have you never seen Monty Python’s Meaning Of Life?? (What’s wrong with a kiss? How about a kiss boy before you go stampeding off to the clitoris) \n\nI’m not talking about a kiss hello, get ice cream, walk in the park, and then a kiss goodbye. You using that is a strawman argument. Massages can be depending on the scenario and you used intimate to describe it. That is a scenario that I wouldn’t call platonic but I guess could be. I get massages all the time and it’s not intimate at the spa. \n\nBill Clinton’s bullshit excuse wasn’t a new one. Men have been using that to lessen their betrayals. It’s crap. Oh come on honey, I just put my dick in her mouth, it’s not like we had sex or anything. Utter and compete shite! \n\nYes there is space between casual acquaintance and lover— it’s called friend! And that’s what platonic is. A friendship without sexual activity. \n\nI have a friend, Jen. I have wanted to sleep with her since I’ve know her. She isn’t interested at all. Guess what? We have a platonic friendship. We’ve never kissed, made out, given each other a massage, etc. my best friend is Steve. Neither of us have ever kissed, made out, etc. guess what? Our friendship is platonic. That’s what platonic means. \n\nThe arguments that you made I think give way to that muddying up of the waters that I was speaking about. \n\nI understand your reply, I’m just saying that it leads to and helps the messiness that is a huge part of this board and it’s replies.",
                    "author": "thereadinessisall",
                    "id": "gcm3pjt",
                    "parent_id": "t1_gclz6iz",
                    "score": 3,
                    "created_utc": 1605624500.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Corruption of words, I’m stealing this!",
            "author": "Aphrodisiatic922",
            "id": "gclydyc",
            "parent_id": "t3_jvrz79",
            "score": 1,
            "created_utc": 1605621376.0,
            "replies": []
        },
        {
            "body": "Couldn’t agree more about what platonic means.  \n\nBut what about “video sex” 🥴\n\nI’m only 1/2 kidding.  \n\nThere are a shit ton of online camming going on that’s basically “interactive porn”.  \n\nIf you take that a little bit farther to the SR world, there is a percentage of the men that will go for this.",
            "author": "BGDDDY1",
            "id": "gclzi3h",
            "parent_id": "t3_jvrz79",
            "score": 1,
            "created_utc": 1605622074.0,
            "replies": [
                {
                    "body": "For me would fall under online only and still not platonic.",
                    "author": "thereadinessisall",
                    "id": "gcm1cxm",
                    "parent_id": "t1_gclzi3h",
                    "score": 1,
                    "created_utc": 1605623172.0,
                    "replies": [
                        {
                            "body": "I agree",
                            "author": "BGDDDY1",
                            "id": "gcm1fel",
                            "parent_id": "t1_gcm1cxm",
                            "score": 0,
                            "created_utc": 1605623210.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am with you. I have had some POTs favorite my profile, so I check them out and they have the platonic label. When I ask them about it, sometimes they say absolutely no physical, but some just say they want to start slow.",
            "author": "wasabiflavoredpeas",
            "id": "gcmy53j",
            "parent_id": "t3_jvrz79",
            "score": 0,
            "created_utc": 1605638971.0,
            "replies": []
        },
        {
            "body": "No flame for you from me. Just unconditional endorsement!\n\nPersonally, if I see Platonic on a profile I just next it automatically these days...",
            "author": "aesthete2061",
            "id": "gcniitn",
            "parent_id": "t3_jvrz79",
            "score": 0,
            "created_utc": 1605648327.0,
            "replies": []
        },
        {
            "body": "I dunno, the biggest kick I get are the ones that state \"nothing sexual\" and \"online only\" but I will be there for you and give you all the emotional support you want. \n\nReally? I am still trying to figure out how that even works? I've found I get a lot more bang for my buck by paying an actual therapist. Still trying to figure out where some of these people come from LOL",
            "author": "SDRippington",
            "id": "gcntifs",
            "parent_id": "t3_jvrz79",
            "score": 0,
            "created_utc": 1605653746.0,
            "replies": []
        },
        {
            "body": "They're absolutely radiant",
            "author": "Church42",
            "id": "gclujbz",
            "parent_id": "t1_gclu3q8",
            "score": 19,
            "created_utc": 1605618824.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gcluqnm",
                    "parent_id": "t1_gclujbz",
                    "score": 13,
                    "created_utc": 1605618969.0,
                    "replies": [
                        {
                            "body": "I had a plutonic SB once... I told her \"I am fascinated with Uranus.\"\n\n\\*ba dum ching\\*",
                            "author": "BinghamtonSD",
                            "id": "gclzw38",
                            "parent_id": "t1_gcluqnm",
                            "score": 29,
                            "created_utc": 1605622311.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gcm18in",
                                    "parent_id": "t1_gclzw38",
                                    "score": 7,
                                    "created_utc": 1605623103.0,
                                    "replies": [
                                        {
                                            "body": "Thank you! Thank you! I'll be here all night. Tip your waitress. Enjoy the veal.",
                                            "author": "BinghamtonSD",
                                            "id": "gcm1nnq",
                                            "parent_id": "t1_gcm18in",
                                            "score": 17,
                                            "created_utc": 1605623342.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Mine as well",
            "author": "Elvishgirl",
            "id": "gcobe15",
            "parent_id": "t1_gclu3q8",
            "score": 1,
            "created_utc": 1605663621.0,
            "replies": []
        },
        {
            "body": "I like the plutocratic SBs!",
            "author": "marker3000",
            "id": "gcogwr5",
            "parent_id": "t1_gclu3q8",
            "score": 1,
            "created_utc": 1605666720.0,
            "replies": []
        },
        {
            "body": "🤣🤣🤣 what did he say when he found out you knew he has porn stored on his phone/laptop?",
            "author": "tamenwild",
            "id": "gcm7f9h",
            "parent_id": "t1_gcm4a0s",
            "score": 15,
            "created_utc": 1605626485.0,
            "replies": [
                {
                    "body": "He was momentarily shocked--and then remembered what Dad does for a living (I'm in IT).  I've told all the kids from the moment they got their first computer, tablet, or phone that if it happens on my network, I can see it, so don't even bother trying to lie to me about what you're up to.  \n\n\nSo far only the youngest has tried to find ways around me.  I gotta hand it to him, he's both clever and persistent.  I expect he'll have figured out how to edit my network logs in a couple of years if he keeps at it.  :-)",
                    "author": "MartinB75",
                    "id": "gcmwuxx",
                    "parent_id": "t1_gcm7f9h",
                    "score": 22,
                    "created_utc": 1605638387.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s one of my pet peeves as well.  My daughter was not amused by my attempt to do the same thing when I told her that I felt like $10 is the same as the she $40 she would typically get on Friday night.  Just take $10,  it’s only paper and value is subjective,  I can change my feelings about it, it can buy less or more depending on the day or location, etc.   suddenly $40 is $40,  imagine that.",
            "author": "LotBuilder",
            "id": "gcnlmq7",
            "parent_id": "t1_gcm4a0s",
            "score": 5,
            "created_utc": 1605649802.0,
            "replies": []
        },
        {
            "body": ">\"he should be able to use that label if he wants to.\".  Um, no.  No he shouldn't.\n\nThis is an essential detail here.\n\nWords have meanings. We can't just pretend they mean different things. Language & communication literally depend on a common understanding of meaning.",
            "author": "SD_in_training",
            "id": "gcmf1p9",
            "parent_id": "t1_gcm4a0s",
            "score": 14,
            "created_utc": 1605630216.0,
            "replies": []
        },
        {
            "body": "Oof. Yea, your kid is definitely not ace. \n\nFun way to call him out tho",
            "author": "Elvishgirl",
            "id": "gcobkah",
            "parent_id": "t1_gcm4a0s",
            "score": 3,
            "created_utc": 1605663717.0,
            "replies": [
                {
                    "body": "We've had some pretty frank discussions about sexuality and masturbation since then, so it was a good conversation starter (he is thankfully nearly incapable of being embarrassed--makes him a real asset in drama club).  Once I explained the difference between \"sex\" and \"dating\" in this context, he immediately got it.  \n\nThe older sibling, though, kept arguing.  I've got half a mind to make that child sit in the corner and copy out the dictionary, one word at a time...",
                    "author": "MartinB75",
                    "id": "gcpthvq",
                    "parent_id": "t1_gcobkah",
                    "score": 2,
                    "created_utc": 1605706728.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "well, the word platonic comes from Plato and his Idealism, and the platonic ideal of a woman is not without sex, it's just the ideal form of love that goes beyond sex. But the type of platonic love sold on sugar sites is far from a platonic ideal of love, it's more akin to loneliness meeting a predatory love of lucre.",
            "author": "_steady_hand_",
            "id": "gcr3q6b",
            "parent_id": "t1_gcm4a0s",
            "score": 1,
            "created_utc": 1605729676.0,
            "replies": []
        },
        {
            "body": "mostly. probably but have seen a bunch of posts and replies from SDs too playing along with (or I should say entertaining)  this corruption.",
            "author": "thereadinessisall",
            "id": "gclusoo",
            "parent_id": "t1_gclugdh",
            "score": 3,
            "created_utc": 1605619008.0,
            "replies": [
                {
                    "body": "Certain SDs are totally okay with certain naive SBs justifying things to themselves as “I’m different, I only do platonic!” if it means they ultimately will put out in some way despite that incorrect label. \n\nThis really boils down to people corrupting language because they couldn’t possibly judge themselves the way they judge others. “I’m only in platonic SRs! We don’t have sex so YOURE a slut, but I’m not!”(platonic meaning oral to completion 2x a week)",
                    "author": "Yourstruly0",
                    "id": "gcn0mot",
                    "parent_id": "t1_gclusoo",
                    "score": 0,
                    "created_utc": 1605640113.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "no. they'd be salt daddies, Splenda daddies, or faux daddies in that case.\n\nif there is any sexual activity involved it is not platonic ;) (I get your joke, I do... but somewhere somehow somebody is gonna take that and run with it...)",
            "author": "thereadinessisall",
            "id": "gcmjnba",
            "parent_id": "t1_gcmj7d0",
            "score": 14,
            "created_utc": 1605632352.0,
            "replies": [
                {
                    "body": "Right. I’m kidding of course. \n\nSince the commodity on the SB side is sexual, and the commodity on the SD side is monetary. If there’s no commodity from the “SD” side, he cannot be an SD.\n\nVanilla dating. Boyfriend picking up the bills. That’s the extent of categorization.",
                    "author": "ExExpectations",
                    "id": "gcmjvga",
                    "parent_id": "t1_gcmjnba",
                    "score": 7,
                    "created_utc": 1605632457.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Can we call “Experience-Only” “SDs” platonic daddies? They are not providing financial support, in any whatsoever.\n\nNo, you cannot.  The whole point of this post is that when a word has an established meaning that everyone understands, you shouldn't try to change it for no good reason.   Just call them \"experience-only SDs.\"",
            "author": "UseTheForceRey",
            "id": "gcmm0ec",
            "parent_id": "t1_gcmj7d0",
            "score": 1,
            "created_utc": 1605633437.0,
            "replies": []
        },
        {
            "body": "You can also teach, engage, enlighten.",
            "author": "thereadinessisall",
            "id": "gcm9vam",
            "parent_id": "t1_gcm8tk9",
            "score": 5,
            "created_utc": 1605627728.0,
            "replies": [
                {
                    "body": "Of course. Just don’t be surprised if people don’t want to be enlightened — they may have another agenda. Words are most useful when there is a shared meaning. There are two meaning of the term platonic. I agree that in the context of an arrangement, the carnal meaning of the term is most useful, however the love between a daddy and his girl falls more into the other meaning, so there is room for confusion.",
                    "author": "daddoms",
                    "id": "gcmketz",
                    "parent_id": "t1_gcm9vam",
                    "score": 3,
                    "created_utc": 1605632708.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But(t) they love Jesus...",
            "author": "curly_spice",
            "id": "gclqydo",
            "parent_id": "t1_gclqrs7",
            "score": 12,
            "created_utc": 1605616056.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gclri3f",
                    "parent_id": "t1_gclqydo",
                    "score": 2,
                    "created_utc": 1605616510.0,
                    "replies": []
                },
                {
                    "body": "Damn it now I got coffee on my iPad 😂😂😂",
                    "author": "BratinaHat",
                    "id": "gclxtur",
                    "parent_id": "t1_gclqydo",
                    "score": 1,
                    "created_utc": 1605621026.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"Eatin' ain't cheatin'\" - Bill Clinton",
            "author": "Patrucio71",
            "id": "gcm0qsz",
            "parent_id": "t1_gclqrs7",
            "score": 9,
            "created_utc": 1605622821.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gcm336k",
                    "parent_id": "t1_gcm0qsz",
                    "score": 3,
                    "created_utc": 1605624159.0,
                    "replies": [
                        {
                            "body": "That depends on what the meaning of the word 'is' is",
                            "author": "Cledaddy23",
                            "id": "gcmly7p",
                            "parent_id": "t1_gcm336k",
                            "score": 3,
                            "created_utc": 1605633409.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "😀",
                    "author": null,
                    "id": "gcm2exb",
                    "parent_id": "t1_gcm0qsz",
                    "score": 1,
                    "created_utc": 1605623783.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> church for the 'virgins' who keep only one of the entrances shut.\n\nI'm not religious, but I do not know of a single church that preaches no PIV before marriage but allows other forms of sex.",
            "author": "UseTheForceRey",
            "id": "gcmlpjx",
            "parent_id": "t1_gclqrs7",
            "score": 0,
            "created_utc": 1605633299.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gcmqnxu",
                    "parent_id": "t1_gcmlpjx",
                    "score": 4,
                    "created_utc": 1605635559.0,
                    "replies": [
                        {
                            "body": ">There's as far as I know (but I'm an agnost) no church who preaches no piv and all the rest is allowed.\n\nThen you probably shouldn't blame \"the church....\"    Yes, I'm being nit-picky, but this is a post about proper use of language.",
                            "author": "UseTheForceRey",
                            "id": "gcmssv1",
                            "parent_id": "t1_gcmqnxu",
                            "score": 1,
                            "created_utc": 1605636531.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I've read stories of religious couples who \"only\" had anal sex before marriage because then they'd still be \"virgins \" on their wedding night ( for \"real sex\", ie PIV )  Yes, it's fucked up.",
                    "author": "daisydawnie",
                    "id": "gcmx9az",
                    "parent_id": "t1_gcmlpjx",
                    "score": 2,
                    "created_utc": 1605638570.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Based on what some of these \"platonic SBs\" actually seem to mean by platonic, they seem far more plausible than I would originally guess.",
            "author": "SD_in_training",
            "id": "gcmfa64",
            "parent_id": "t1_gcm6dcf",
            "score": 4,
            "created_utc": 1605630325.0,
            "replies": [
                {
                    "body": "Yeah most of them I've been running across on SA specifically are like NO sexual or physical contact. I pretty much have a short answer that I copy/paste to them and then move on with my life. What a waste of time.",
                    "author": "techtonic",
                    "id": "gcmiyiv",
                    "parent_id": "t1_gcmfa64",
                    "score": 0,
                    "created_utc": 1605632035.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There is a post in one of the \"be careful\" threads where the OP claims getting five figures without having sex and others claim over 1k PPM for platonic dates.",
            "author": null,
            "id": "gcmjmd8",
            "parent_id": "t1_gcm6dcf",
            "score": 4,
            "created_utc": 1605632340.0,
            "replies": [
                {
                    "body": "haha if they're not lying/trolling, good for them. \n\nThe most unbelievable thing about that is generally, people who can afford that, are really smart with their money. Like myself.\n\nBut hey, who knows. Maybe they found some really old, successful guys who can't get it up anymore but they really enjoy the company and taking care of a pretty girl.\n\nIt could happen.",
                    "author": "techtonic",
                    "id": "gcmk6cw",
                    "parent_id": "t1_gcmjmd8",
                    "score": 5,
                    "created_utc": 1605632599.0,
                    "replies": [
                        {
                            "body": "Every single girl on SA that has told me they were looking for something platonic eventually gave up because they came to the realization that every guy wants intimacy. Every single girl. I think a guy might consider taking a platonic girl out a few times but then stop after realizing he’s not going to get any action. \n\nI know a girl who had a sugar daddy that would give her a nice allowance just to go on dates with him. Nothing sexual, no nudes, just dates once a week. She said he was a lot older, his wife passed away, and was extremely lonely and desperate and just wanted company. There are men out there like this but they are the exception.",
                            "author": "Fun_Focus8159",
                            "id": "gcmzmun",
                            "parent_id": "t1_gcmk6cw",
                            "score": 2,
                            "created_utc": 1605639650.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I mean, it happens, but the odds are so vanishingly small that no one should be building a strategy around it. That thousands of people have leaned into this idea and spend hours a day trying to make it work is pretty wild.",
                    "author": "TerribleMajor",
                    "id": "gcoi6sk",
                    "parent_id": "t1_gcmjmd8",
                    "score": 1,
                    "created_utc": 1605667438.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "honestly i had a platonic SD and it was so much work. i ended things!  we would meet and go for coffee - he was pretty socially awkward and i think he felt like he was \"saving\" me from the sugar bowl.  at first i was super suspicious that he was offering platonic only (i didnt ask for it) but as time went on, i think his idea was that we'd gradually get to know each other and i'd warm up to him and it would transition to a traditional vanilla relationship.  he was a nice enough person but his emotional needs were too much for me and it was easier to end things.",
            "author": "jinjinb",
            "id": "gcomwhm",
            "parent_id": "t1_gcm6dcf",
            "score": 1,
            "created_utc": 1605670186.0,
            "replies": []
        },
        {
            "body": "Becoming the new norm can only happen if we all allow it to. \n\nThere’s a big difference between evolution and corruption. \n\nUrban Dictionary is geared more towards slang use or new fangled abbreviations. Like Handy - in sex terms it means a hand job, but it has not corrupted the original and agreed upon term. Otherwise handymen would be people who go around giving hand jobs. Plus it’s usually spelt ie as in handie which also alerts the reader that it’s not the typical meaning. \n\nThe only way this stops is if we stop it. And we should. Without a common agreement to the meaning of words and language there is no society. \n\nEvery time someone posts about Platonic the very first question should be to please define that for us.",
            "author": "thereadinessisall",
            "id": "gcmgng5",
            "parent_id": "t1_gcmalxj",
            "score": 1,
            "created_utc": 1605630961.0,
            "replies": []
        },
        {
            "body": ">\"Platonic\" is defined as \"intimate and affectionate but not sexual\". I think a reasonable person could include kissing in that definition, as well as perhaps an intimate massage that you might call fondling.\n\nA friendly peck type of kiss or a normal massage, sure that could be platonic.    Making out or massage that involves private parts is \"sexual\" which is defined as \"relating to the instincts, physiological processes, and activities connected with physical attraction or intimate physical contact between individuals. \"",
            "author": "UseTheForceRey",
            "id": "gcm6fkc",
            "parent_id": "t1_gclz6iz",
            "score": 3,
            "created_utc": 1605625972.0,
            "replies": []
        },
        {
            "body": "No. \n\nI feel like your an ally and please excuse my reply as I’m on my cell and can’t do the quote reply thing. \n\nThere are a few issues I have with your response. The definition of platonic is accurate. Yes the world is Not black and white, but language is by definition. It defines how we communicate as a species - if we just change meaning Willy nilly then what’s the point of language. \n\nFor Unlawful Carnal Knowledge was a criminal charge dating back to the 1600’s. It was shortened and evolved to Fuck meaning intercourse (as well as its pejoratives). iF a small group stated using the word fuck to mean: sitting on a couch holding hands while we watch Netflix we’d all be in trouble understanding. This corruption of platonic isn’t much different. \n\nKissing is sexual. Have you never seen Monty Python’s Meaning Of Life?? (What’s wrong with a kiss? How about a kiss boy before you go stampeding off to the clitoris) \n\nI’m not talking about a kiss hello, get ice cream, walk in the park, and then a kiss goodbye. You using that is a strawman argument. Massages can be depending on the scenario and you used intimate to describe it. That is a scenario that I wouldn’t call platonic but I guess could be. I get massages all the time and it’s not intimate at the spa. \n\nBill Clinton’s bullshit excuse wasn’t a new one. Men have been using that to lessen their betrayals. It’s crap. Oh come on honey, I just put my dick in her mouth, it’s not like we had sex or anything. Utter and compete shite! \n\nYes there is space between casual acquaintance and lover— it’s called friend! And that’s what platonic is. A friendship without sexual activity. \n\nI have a friend, Jen. I have wanted to sleep with her since I’ve know her. She isn’t interested at all. Guess what? We have a platonic friendship. We’ve never kissed, made out, given each other a massage, etc. my best friend is Steve. Neither of us have ever kissed, made out, etc. guess what? Our friendship is platonic. That’s what platonic means. \n\nThe arguments that you made I think give way to that muddying up of the waters that I was speaking about. \n\nI understand your reply, I’m just saying that it leads to and helps the messiness that is a huge part of this board and it’s replies.",
            "author": "thereadinessisall",
            "id": "gcm3pjt",
            "parent_id": "t1_gclz6iz",
            "score": 3,
            "created_utc": 1605624500.0,
            "replies": []
        },
        {
            "body": "For me would fall under online only and still not platonic.",
            "author": "thereadinessisall",
            "id": "gcm1cxm",
            "parent_id": "t1_gclzi3h",
            "score": 1,
            "created_utc": 1605623172.0,
            "replies": [
                {
                    "body": "I agree",
                    "author": "BGDDDY1",
                    "id": "gcm1fel",
                    "parent_id": "t1_gcm1cxm",
                    "score": 0,
                    "created_utc": 1605623210.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gcluqnm",
            "parent_id": "t1_gclujbz",
            "score": 13,
            "created_utc": 1605618969.0,
            "replies": [
                {
                    "body": "I had a plutonic SB once... I told her \"I am fascinated with Uranus.\"\n\n\\*ba dum ching\\*",
                    "author": "BinghamtonSD",
                    "id": "gclzw38",
                    "parent_id": "t1_gcluqnm",
                    "score": 29,
                    "created_utc": 1605622311.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gcm18in",
                            "parent_id": "t1_gclzw38",
                            "score": 7,
                            "created_utc": 1605623103.0,
                            "replies": [
                                {
                                    "body": "Thank you! Thank you! I'll be here all night. Tip your waitress. Enjoy the veal.",
                                    "author": "BinghamtonSD",
                                    "id": "gcm1nnq",
                                    "parent_id": "t1_gcm18in",
                                    "score": 17,
                                    "created_utc": 1605623342.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He was momentarily shocked--and then remembered what Dad does for a living (I'm in IT).  I've told all the kids from the moment they got their first computer, tablet, or phone that if it happens on my network, I can see it, so don't even bother trying to lie to me about what you're up to.  \n\n\nSo far only the youngest has tried to find ways around me.  I gotta hand it to him, he's both clever and persistent.  I expect he'll have figured out how to edit my network logs in a couple of years if he keeps at it.  :-)",
            "author": "MartinB75",
            "id": "gcmwuxx",
            "parent_id": "t1_gcm7f9h",
            "score": 22,
            "created_utc": 1605638387.0,
            "replies": []
        },
        {
            "body": "We've had some pretty frank discussions about sexuality and masturbation since then, so it was a good conversation starter (he is thankfully nearly incapable of being embarrassed--makes him a real asset in drama club).  Once I explained the difference between \"sex\" and \"dating\" in this context, he immediately got it.  \n\nThe older sibling, though, kept arguing.  I've got half a mind to make that child sit in the corner and copy out the dictionary, one word at a time...",
            "author": "MartinB75",
            "id": "gcpthvq",
            "parent_id": "t1_gcobkah",
            "score": 2,
            "created_utc": 1605706728.0,
            "replies": []
        },
        {
            "body": "Certain SDs are totally okay with certain naive SBs justifying things to themselves as “I’m different, I only do platonic!” if it means they ultimately will put out in some way despite that incorrect label. \n\nThis really boils down to people corrupting language because they couldn’t possibly judge themselves the way they judge others. “I’m only in platonic SRs! We don’t have sex so YOURE a slut, but I’m not!”(platonic meaning oral to completion 2x a week)",
            "author": "Yourstruly0",
            "id": "gcn0mot",
            "parent_id": "t1_gclusoo",
            "score": 0,
            "created_utc": 1605640113.0,
            "replies": []
        },
        {
            "body": "Right. I’m kidding of course. \n\nSince the commodity on the SB side is sexual, and the commodity on the SD side is monetary. If there’s no commodity from the “SD” side, he cannot be an SD.\n\nVanilla dating. Boyfriend picking up the bills. That’s the extent of categorization.",
            "author": "ExExpectations",
            "id": "gcmjvga",
            "parent_id": "t1_gcmjnba",
            "score": 7,
            "created_utc": 1605632457.0,
            "replies": []
        },
        {
            "body": "Of course. Just don’t be surprised if people don’t want to be enlightened — they may have another agenda. Words are most useful when there is a shared meaning. There are two meaning of the term platonic. I agree that in the context of an arrangement, the carnal meaning of the term is most useful, however the love between a daddy and his girl falls more into the other meaning, so there is room for confusion.",
            "author": "daddoms",
            "id": "gcmketz",
            "parent_id": "t1_gcm9vam",
            "score": 3,
            "created_utc": 1605632708.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gclri3f",
            "parent_id": "t1_gclqydo",
            "score": 2,
            "created_utc": 1605616510.0,
            "replies": []
        },
        {
            "body": "Damn it now I got coffee on my iPad 😂😂😂",
            "author": "BratinaHat",
            "id": "gclxtur",
            "parent_id": "t1_gclqydo",
            "score": 1,
            "created_utc": 1605621026.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gcm336k",
            "parent_id": "t1_gcm0qsz",
            "score": 3,
            "created_utc": 1605624159.0,
            "replies": [
                {
                    "body": "That depends on what the meaning of the word 'is' is",
                    "author": "Cledaddy23",
                    "id": "gcmly7p",
                    "parent_id": "t1_gcm336k",
                    "score": 3,
                    "created_utc": 1605633409.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😀",
            "author": null,
            "id": "gcm2exb",
            "parent_id": "t1_gcm0qsz",
            "score": 1,
            "created_utc": 1605623783.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gcmqnxu",
            "parent_id": "t1_gcmlpjx",
            "score": 4,
            "created_utc": 1605635559.0,
            "replies": [
                {
                    "body": ">There's as far as I know (but I'm an agnost) no church who preaches no piv and all the rest is allowed.\n\nThen you probably shouldn't blame \"the church....\"    Yes, I'm being nit-picky, but this is a post about proper use of language.",
                    "author": "UseTheForceRey",
                    "id": "gcmssv1",
                    "parent_id": "t1_gcmqnxu",
                    "score": 1,
                    "created_utc": 1605636531.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've read stories of religious couples who \"only\" had anal sex before marriage because then they'd still be \"virgins \" on their wedding night ( for \"real sex\", ie PIV )  Yes, it's fucked up.",
            "author": "daisydawnie",
            "id": "gcmx9az",
            "parent_id": "t1_gcmlpjx",
            "score": 2,
            "created_utc": 1605638570.0,
            "replies": []
        },
        {
            "body": "Yeah most of them I've been running across on SA specifically are like NO sexual or physical contact. I pretty much have a short answer that I copy/paste to them and then move on with my life. What a waste of time.",
            "author": "techtonic",
            "id": "gcmiyiv",
            "parent_id": "t1_gcmfa64",
            "score": 0,
            "created_utc": 1605632035.0,
            "replies": []
        },
        {
            "body": "haha if they're not lying/trolling, good for them. \n\nThe most unbelievable thing about that is generally, people who can afford that, are really smart with their money. Like myself.\n\nBut hey, who knows. Maybe they found some really old, successful guys who can't get it up anymore but they really enjoy the company and taking care of a pretty girl.\n\nIt could happen.",
            "author": "techtonic",
            "id": "gcmk6cw",
            "parent_id": "t1_gcmjmd8",
            "score": 5,
            "created_utc": 1605632599.0,
            "replies": [
                {
                    "body": "Every single girl on SA that has told me they were looking for something platonic eventually gave up because they came to the realization that every guy wants intimacy. Every single girl. I think a guy might consider taking a platonic girl out a few times but then stop after realizing he’s not going to get any action. \n\nI know a girl who had a sugar daddy that would give her a nice allowance just to go on dates with him. Nothing sexual, no nudes, just dates once a week. She said he was a lot older, his wife passed away, and was extremely lonely and desperate and just wanted company. There are men out there like this but they are the exception.",
                    "author": "Fun_Focus8159",
                    "id": "gcmzmun",
                    "parent_id": "t1_gcmk6cw",
                    "score": 2,
                    "created_utc": 1605639650.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean, it happens, but the odds are so vanishingly small that no one should be building a strategy around it. That thousands of people have leaned into this idea and spend hours a day trying to make it work is pretty wild.",
            "author": "TerribleMajor",
            "id": "gcoi6sk",
            "parent_id": "t1_gcmjmd8",
            "score": 1,
            "created_utc": 1605667438.0,
            "replies": []
        },
        {
            "body": "I agree",
            "author": "BGDDDY1",
            "id": "gcm1fel",
            "parent_id": "t1_gcm1cxm",
            "score": 0,
            "created_utc": 1605623210.0,
            "replies": []
        },
        {
            "body": "I had a plutonic SB once... I told her \"I am fascinated with Uranus.\"\n\n\\*ba dum ching\\*",
            "author": "BinghamtonSD",
            "id": "gclzw38",
            "parent_id": "t1_gcluqnm",
            "score": 29,
            "created_utc": 1605622311.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gcm18in",
                    "parent_id": "t1_gclzw38",
                    "score": 7,
                    "created_utc": 1605623103.0,
                    "replies": [
                        {
                            "body": "Thank you! Thank you! I'll be here all night. Tip your waitress. Enjoy the veal.",
                            "author": "BinghamtonSD",
                            "id": "gcm1nnq",
                            "parent_id": "t1_gcm18in",
                            "score": 17,
                            "created_utc": 1605623342.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That depends on what the meaning of the word 'is' is",
            "author": "Cledaddy23",
            "id": "gcmly7p",
            "parent_id": "t1_gcm336k",
            "score": 3,
            "created_utc": 1605633409.0,
            "replies": []
        },
        {
            "body": ">There's as far as I know (but I'm an agnost) no church who preaches no piv and all the rest is allowed.\n\nThen you probably shouldn't blame \"the church....\"    Yes, I'm being nit-picky, but this is a post about proper use of language.",
            "author": "UseTheForceRey",
            "id": "gcmssv1",
            "parent_id": "t1_gcmqnxu",
            "score": 1,
            "created_utc": 1605636531.0,
            "replies": []
        },
        {
            "body": "Every single girl on SA that has told me they were looking for something platonic eventually gave up because they came to the realization that every guy wants intimacy. Every single girl. I think a guy might consider taking a platonic girl out a few times but then stop after realizing he’s not going to get any action. \n\nI know a girl who had a sugar daddy that would give her a nice allowance just to go on dates with him. Nothing sexual, no nudes, just dates once a week. She said he was a lot older, his wife passed away, and was extremely lonely and desperate and just wanted company. There are men out there like this but they are the exception.",
            "author": "Fun_Focus8159",
            "id": "gcmzmun",
            "parent_id": "t1_gcmk6cw",
            "score": 2,
            "created_utc": 1605639650.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gcm18in",
            "parent_id": "t1_gclzw38",
            "score": 7,
            "created_utc": 1605623103.0,
            "replies": [
                {
                    "body": "Thank you! Thank you! I'll be here all night. Tip your waitress. Enjoy the veal.",
                    "author": "BinghamtonSD",
                    "id": "gcm1nnq",
                    "parent_id": "t1_gcm18in",
                    "score": 17,
                    "created_utc": 1605623342.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you! Thank you! I'll be here all night. Tip your waitress. Enjoy the veal.",
            "author": "BinghamtonSD",
            "id": "gcm1nnq",
            "parent_id": "t1_gcm18in",
            "score": 17,
            "created_utc": 1605623342.0,
            "replies": []
        }
    ]
}