{
    "title": "Advice I wish I could give myself when I first got in the bowl",
    "post_id": "aebug3",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/aebug3/advice_i_wish_i_could_give_myself_when_i_first/",
    "author": "thehoppiest",
    "body": "As the title states, these are just some random bits of advice that I wish I could tell myself back when I first got in the bowl. After having one short and one long term SR, I'm just starting to get back in the bowl and I can already tell my experience is going to be vastly different from last time. I've learned a ton, both from experience and from this sub, so I just thought I'd share some of these thoughts...this is not intended as a guide for new SB's, or as advice for all SB's, but just thoughts pertaining to my own experiences and goals. Feel free to share your own thoughts or experiences!\n\n&#x200B;\n\n\\*\\*You will come across scammers\\*\\*\n\n\\-In fact, most of the people you encounter in your search will be scammers, salt daddies, splenda daddies, etc.\n\n\\-If it seems like a scam, it is. Trust your gut.\n\n\\-Rather than assume everyone is a potential SD, be smart about it. Assume that most of them are not. Don't waste your time responding to every single message. Dismiss them at the first red flag.\n\n\\-A true SD will not: balk at the mention of payment; insist they don't want this to be transactional (as in, they don't want to pay you upfront, or after, or ever really but maybe at some point); immediately want to set up an \"arrangement\" before any sort of communication has occurred; be rude or demeaning\n\n\\-You will encounter men who just want to acquire sexy pictures of you. Men who want your bank info or for you to send them an itunes gift card to prove you are real before they're able to give you any payment. Men whose offers of excessive money for a platonic online relationship seem too good to be true, because they are. Young, attractive men, who are using the site for vanilla dating. Dismiss them all and move on.\n\n&#x200B;\n\n\\*\\*Protect Yourself\\*\\*\n\n\\-Do not give away any personal information including: phone number (use google voice), full name, exact location, bank account, location of job, etc\n\n\\-Let someone know where you are when you go on meet & greets, or other dates early in the relationship\n\n&#x200B;\n\n\\*\\*Know what you want, and be firm about it\\*\\*\n\n\\-Nobody can tell you what price is right for you. You have to decide for yourself. I found this hard initially because as soon as I'd pick a minimum price I would think \"well but of course higher is always better\". I think both parties should leave feeling as though they're the ones getting the better end of the bargain. Pick a number that will make you feel this way. Don't be totally unreasonable, but don't settle for less than what will make you happy. Be firm with your expectations and politely dismiss anyone who tries to talk you down. I was hesitant to have a number that was \"too high\" in the past because I didn't want to scare anyone away; now I'm more than happy to weed out the splenda's who find my number \"too high\".\n\n(edit to add:) -I now insist on using protection every time unless we are monogamous. That might be a deal breaker for many, but I just don't know where else they have been, regardless of up-to-date STI tests. Especially if they're cheating on their wives to be with me...do I really trust them that they're not also sleeping with someone else? In a way, by insisting on this, I am checking to see how respectful they are of me. Do they try to talk me out of it? Are they understanding if a little bummed out? Etc.\n\n&#x200B;\n\n\\*\\*Don't sleep with them on the first date\\*\\*\n\n\\-I don't know how many of you also abide by this rule, and its not universal, but I find it extremely helpful for a few reasons. First, I make it clear that this is how I operate before we have even met up. They are general still pushy at the M&G but since it's been discussed beforehand, I can comfortably and firmly tell them no. Second, it gives me time to think it over and decide if this is the type of arrangement I want and if we truly have chemistry. This is really true for both parties. Finally, that extra time to think it over has helped me avoid several scammers. I've operated by this rule since day one but I thought I'd include it in the list anyway. More than once, I've had a slightly strange feeling about a potential SD during our M&G, and while they wanted to sleep together immediately and insisted they would also start payment shortly thereafter, it fell apart right after the date. If you have a great M&G, and your new SD has an envelope of cash for you and a hotel room at the ready, and you feel safe and comfortable, by all means go for it. But in my experience I like to have a strictly platonic initial meeting.\n\n\\-Sort of ties into this \\^ but don't do anything until you have agreed on some form of payment AND received some form of payment. I encountered way too many men who insisted they didn't want it to feel transactional, and wanted to start sleeping together but would provide me with gifts/money down the line at some point. I was lucky to avoid this almost completely but I did experience one \"Pump and Dump\". The guy was young, attractive, and swore he would be generous with me. We slept together twice and when I sent him a reminder about my amazon wishlist, he disappeared. Don't let the p&d happen to you, get your money upfront!!\n\n&#x200B;\n\n\\*\\*You are not looking for a vanilla boyfriend\\*\\*\n\n\\-When I first got on the site I thought well of course the younger and better looking, the better! It was impossible to have a proper search because my mindset was equal parts looking for a sugar daddy and looking for someone whose company I would really enjoy. Ideally, of course, you do enjoy your SD's company. However the point of an SR is to find a mutually beneficial relationship--for you the benefit is monetary, and for him it is sexual/companionship. Your search will get wildly confusing if you start factoring in your own personal attraction to the SD's. On top of that, a large percentage of the young guys on there aren't really looking for an SR at all but are taking advantage of how many attractive women are on the site to hopefully reign one into vanilla dating.\n\n\\-Taking that into consideration, I now perform a search strictly on how well I think an SR would work. Sure, if a young attractive guy messages me and seems genuine about his interest in the lifestyle, I'll chat with him. But in general, I am looking for men who know what they want, aren't afraid to be upfront about it, are respectful and not overly pushy, and seem very generous. As long as they are kind, wealthy, healthy, and hygienic, I'll be happy to consider them. Before, I wasting weeks sifting through the attractive guys before \"settling\" for the real SD's. This time I'm not wasting that time.\n\n&#x200B;\n\n\\*\\*Profile tips--bear in mind these vary wildly from person to person\\*\\*\n\n\\-Be concise and straightforward. Skip the bullshit about being pretty and fun, everyone on the site is. How are you unique? Don't be afraid to be unconventional, many SD's have unique preferences and not everyone wants a conventionally attractive woman. Be yourself...to a point, you still want to protect your identity\n\n\\-Include pics revealing either your face or body or both, whatever you are comfortable with. Avoid filters. Ideally show a few sides of yourself (such as an adventurous picture, a formal one, a silly one, etc). Your pictures are the most important part of your profile. If you want to be discreet you certainly can be, but if you don't provide a general idea of what your face and/or figure look like you won't get much attention. Only use pictures that have never been posted anywhere else to avoid reverse image searching.\n\n&#x200B;\n\n\\*\\*Understand that it is a process\\*\\*\n\n\\-Don't rush into anything. Ideally don't treat this as a quick fix for financial problems. It can be a long, difficult, frustrating process but it is certainly worth it. If you are firm about what you want and efficiently able to communicate with potential SD's you can make the process easier but it will still take time. Don't settle, and take a break if you need to. Keep your guard up and don't ignore red flags just because you're sick of the search. Good luck!\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n...so much for following my own advice and being concise. I'm procrastinating right now so this was fun to type out, I'm curious to hear if you agree or disagree with anything or have anything to add!\n\n&#x200B;",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/aebug3/advice_i_wish_i_could_give_myself_when_i_first/",
    "score": 101,
    "upvote_ratio": 0.91,
    "created_utc": 1547070787.0,
    "num_comments": 18,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I'd like to add-\n \nsave your money ",
            "author": "gogosa",
            "id": "edo07q9",
            "parent_id": "t3_aebug3",
            "score": 41,
            "created_utc": 1547071246.0,
            "replies": [
                {
                    "body": "Great addition!! I still haven't quite figured that one out myself so I couldn't be the one to say it haha",
                    "author": "thehoppiest",
                    "id": "edo0oqw",
                    "parent_id": "t1_edo07q9",
                    "score": 13,
                    "created_utc": 1547071538.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great advice. I especially like the part about don't look for an attractive vanilla young boyfriend while you're sugaring. There are different factors that make for a good SD. Of course, different strokes for different folks.",
            "author": null,
            "id": "edo147g",
            "parent_id": "t3_aebug3",
            "score": 9,
            "created_utc": 1547071806.0,
            "replies": []
        },
        {
            "body": "The vast majority of your points are totally valid. However, I think some of your advice may be a little counter-productive, depending on how far you take it.\n\nOne of the main reasons I pass on SBs is because I  sense they aren't attracted to me. Sometimes I sense it on the first date or after a few, but sooner or later I sense she is faking it for money. That is the number one reason why things don't progress into a long-term arrangement. \n\nOf course, every couple is different, and I'm sure many SDs are completely clueless and just want \"arm candy.\" However, if you find an SD  you are attracted to, or at least, you think there is potential to become attracted, you'll find there is a much higher chance of long-term arrangement developing. The more business-oriented SBs tend to churn through a higher volume of men, using their looks to reel them in but only for a short time until the SD decides to move on to the next one.  Real chemistry that is mutual is more likely to lead to a long-term arrangement lasting years.\n\nSecond, I agree that the SD shouldn't baulk at discussing money. However, not on SA! For one thing, it's becoming increasingly difficult to discuss money on SA without getting your account suspended. Also, the SD wants to get to know you before discussing money. Of course, it should be discussed at least by the first date if over text. However, if your first message on SA is \"how much?\" that's going to turn off a lot of legit SDs. And believe me, I get a lot of those kinds of messages. \n\nOne final comment, not a disagreement with your post, more of an addition. Ultimately, yes, it is important to be selective and filter aggressively. However, also be careful not to convey an attitude of arrogance, jadedness and negativity in your profile or initial messages. I see a lot of \"veteran\" SBs on the site that are so negative and jaded, I won't go near them. The first thing in their profile is \"don't waste my time.\"  So, it's a delicate balance, being open and optimistic while at the same time being cautious and selective. \n\n&#x200B;\n\n&#x200B;",
            "author": "manlicksdog",
            "id": "edo7yju",
            "parent_id": "t3_aebug3",
            "score": 12,
            "created_utc": 1547076927.0,
            "replies": [
                {
                    "body": "You've made some great points! Although it of course varies depending on your preferences, I agree that genuine mutual attraction and chemistry are important. Sure some SD's are clueless, but it can be obvious when you fake this stuff. My point was more that this shouldn't be the focus of an SB's search. The focal point of your search should not be on how attracted you are to a guy. This should play a part, and you should never consider someone who you find repulsive, but you shouldn't be particularly concerned with an SD's physical appearance.\n\nAs far as discussing money is concerned, I agree that you don't want to be pushy or too upfront. I think the converse of this is men discussing intimacy. This often gets brought up very early on, and as soon as they discuss getting physical I start talking about money. I think it's only fair. If you want to know if I'm willing to get kinky, I want to know if you're willing to pay for it. Discussing money is still tricky for me, because I've wasted time on long conversations that end with incredibly meager offers, so I like to bring it up somewhat early just so we don't waste each other's time. While money certainly shouldn't be brought up immediately (unless sex is), I think at least a general discussion of it needs to happen before the first date. \n\nBeing jaded can go both ways, that's for sure. I see plenty of profiles that are more focused on the negative (don't scam me, I'm not a walking atm, if you're looking for platonic then get out) which, while I understand where they're coming from and agree with the sentiment, are a total turn-off. I agree, It's a fine line between being firm but friendly, and just appearing burnt out. ",
                    "author": "thehoppiest",
                    "id": "edoat08",
                    "parent_id": "t1_edo7yju",
                    "score": 9,
                    "created_utc": 1547079229.0,
                    "replies": [
                        {
                            "body": "Good conversation! The only refinement I would make is on the sex talk. My philosophy is that it's fine to talk sex on SA as long as I do it in a tasteful way that is respectful. I also show a genuine interest in what she is into or not into. The difference between money and sex talk is that money is just a number. It really doesn't take a lot of discussion, whereas it does take some discussion to see if there is sexual compatibility. If you remove both sex and money from SA conversations, then conversations can get a bit boring\n\nBut again, I never approach sex talk in a way that would feel degrading to the SB. I try to be flirtatious, indirect, witty, that kind of thing. I also try to feel her out to see what would genuinely turn her on. I certainly don't go into the discussion with the idea that I'm going to pay her to get kinky or for specific acts. I go into trying to figure out what her kinks are and what she would enjoy. The \"menu\" approach to coming up with a \"rate\" is a signal to me that she is an experienced sex worker. While there is absolutely nothing wrong with that, I personally find that a turn off. I don't want to pay her extra to do something kinky she is not really into. I'd rather do something kinky that she is into.\n\nHowever, I also agree in not wasting a lot of time with sex talk. Definitely not into sexting for days or weeks. A little bit of banter and a few compatibility questions are enough. The faster you can move to Google Voice, the better so that the censors aren't reading everything.\n\n&#x200B;\n\n&#x200B;",
                            "author": "manlicksdog",
                            "id": "edobwel",
                            "parent_id": "t1_edoat08",
                            "score": 2,
                            "created_utc": 1547080128.0,
                            "replies": [
                                {
                                    "body": "Great point, in my experience sex is often not brought up in a tasteful or respectful way. If it is brought up--and not immediately but after a few exchanges--the way that you're describing, that's totally fair and doesn't need to be countered with money talk. I think often sex is brought up quickly by splenda/salt daddies who want to just completely skip past the money side of the deal, and I guess my way of turning them down is by reminding them that I also expect something in return.\n\nThis is a huge reason why I really appreciate when an SD says right off the bat that they are happy to provide an allowance, or some other mention of them being comfortable with money. If they have given me no indication at any point that they understand their role in this arrangement, then I'm hesitant to discuss what I do and don't like in the bedroom. Real SD's often do seem to put my mind at ease in this regard early on. Do you have any suggestions on how to gently bring up the topic of money--simply to ensure that they do intend to pay/establish an arrangement at some point, even if details don't need to be hammered out immediately. ",
                                    "author": "thehoppiest",
                                    "id": "edoczwa",
                                    "parent_id": "t1_edobwel",
                                    "score": 5,
                                    "created_utc": 1547081041.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "To each their own indeed. I don't think ive ever been attracted to any of my past daddies but I did enjoy their company and we had fun. I'm not in the sugar bowel to find prince charming, rather for the experiences and I do enjoy meeting older men with knowledge that can indeed, teach me something. Also if he puts a high net worth and gawks at certain financial requests, salt! I dont mind if they aren't extremely wealthy but if they wanna front, then I'm gonna have a price to match. ",
                    "author": "inthemoodforsoup",
                    "id": "edo93c1",
                    "parent_id": "t1_edo7yju",
                    "score": 11,
                    "created_utc": 1547077843.0,
                    "replies": [
                        {
                            "body": "> sugar bowel\n\nThis may be my favourite typo ever.",
                            "author": null,
                            "id": "edp4kk4",
                            "parent_id": "t1_edo93c1",
                            "score": 13,
                            "created_utc": 1547107896.0,
                            "replies": []
                        },
                        {
                            "body": "Well, I suppose you are right. Each person has a different strategy and things they are looking for. From talking to many women on the site, may women value chemistry a lot but I can also imagine it hurts their bottom line. I'm just not sure that is advice all women should follow. Its advice that works for some women, not others. ",
                            "author": "manlicksdog",
                            "id": "edo9wtn",
                            "parent_id": "t1_edo93c1",
                            "score": 2,
                            "created_utc": 1547078502.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Excellent !! I would recommend that this be added to the WIKI for all new SBs.  Well done!",
            "author": "GSSD",
            "id": "edprg3k",
            "parent_id": "t3_aebug3",
            "score": 3,
            "created_utc": 1547133511.0,
            "replies": []
        },
        {
            "body": "Would love to see the same post from the SD perspective - “never the twain shall meet,” lol ",
            "author": null,
            "id": "edoqkfu",
            "parent_id": "t3_aebug3",
            "score": 3,
            "created_utc": 1547092169.0,
            "replies": [
                {
                    "body": "I would too!! You should write it yourself :)",
                    "author": "thehoppiest",
                    "id": "edoyyf1",
                    "parent_id": "t1_edoqkfu",
                    "score": 2,
                    "created_utc": 1547100261.0,
                    "replies": []
                },
                {
                    "body": "I would too—why don’t you start it yourself? :)",
                    "author": "thehoppiest",
                    "id": "edoz8d1",
                    "parent_id": "t1_edoqkfu",
                    "score": 2,
                    "created_utc": 1547100596.0,
                    "replies": []
                },
                {
                    "body": "The [MSR](https://www.reddit.com/r/sugarlifestyleforum/comments/916xmx/modern_sugar_relationship_msr_process/) post was my attempt to crystallize what I had learned as an SD, though I explicitly put it in terms that also applied to SBs because I don't think there's any inherent conflict.",
                    "author": "sugaritis",
                    "id": "edwqdd8",
                    "parent_id": "t1_edoqkfu",
                    "score": 1,
                    "created_utc": 1547316790.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love this advice, it should be pinned. The amount of scammers who think that we’re dumb is too cute. ",
            "author": null,
            "id": "edpbpq2",
            "parent_id": "t3_aebug3",
            "score": 2,
            "created_utc": 1547118538.0,
            "replies": []
        },
        {
            "body": "Excellent! You write below about wanting a similar outlook from an SD's perspective. Mine would track pretty closely to shat you've written above. Not sure if they're serious? Next. Pushy, unrealistic about the money part? Next. Genuinely interested and engaged in a mutually beneficial and enjoyable experience? Let's talk. Safe, respectful, smart and fun? Now we're talkin'. I'm not a walking ATM. You're not a piece of meat. This is an alternative relationship that can be an awful lot of fun for both of us, and each can get their needs addressed.",
            "author": "OlderSD",
            "id": "edpmjjd",
            "parent_id": "t3_aebug3",
            "score": 1,
            "created_utc": 1547129095.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ee05ofh",
            "parent_id": "t3_aebug3",
            "score": 1,
            "created_utc": 1547414178.0,
            "replies": [
                {
                    "body": "I agree with you, just oversimplified it a bit. My point was more that SD’s and SB’s get different things from an SR—and that if an SB is mainly looking for companionship she ought to stick to vanilla dating. ",
                    "author": "thehoppiest",
                    "id": "eeduu4q",
                    "parent_id": "t1_ee05ofh",
                    "score": 1,
                    "created_utc": 1547844413.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great addition!! I still haven't quite figured that one out myself so I couldn't be the one to say it haha",
            "author": "thehoppiest",
            "id": "edo0oqw",
            "parent_id": "t1_edo07q9",
            "score": 13,
            "created_utc": 1547071538.0,
            "replies": []
        },
        {
            "body": "You've made some great points! Although it of course varies depending on your preferences, I agree that genuine mutual attraction and chemistry are important. Sure some SD's are clueless, but it can be obvious when you fake this stuff. My point was more that this shouldn't be the focus of an SB's search. The focal point of your search should not be on how attracted you are to a guy. This should play a part, and you should never consider someone who you find repulsive, but you shouldn't be particularly concerned with an SD's physical appearance.\n\nAs far as discussing money is concerned, I agree that you don't want to be pushy or too upfront. I think the converse of this is men discussing intimacy. This often gets brought up very early on, and as soon as they discuss getting physical I start talking about money. I think it's only fair. If you want to know if I'm willing to get kinky, I want to know if you're willing to pay for it. Discussing money is still tricky for me, because I've wasted time on long conversations that end with incredibly meager offers, so I like to bring it up somewhat early just so we don't waste each other's time. While money certainly shouldn't be brought up immediately (unless sex is), I think at least a general discussion of it needs to happen before the first date. \n\nBeing jaded can go both ways, that's for sure. I see plenty of profiles that are more focused on the negative (don't scam me, I'm not a walking atm, if you're looking for platonic then get out) which, while I understand where they're coming from and agree with the sentiment, are a total turn-off. I agree, It's a fine line between being firm but friendly, and just appearing burnt out. ",
            "author": "thehoppiest",
            "id": "edoat08",
            "parent_id": "t1_edo7yju",
            "score": 9,
            "created_utc": 1547079229.0,
            "replies": [
                {
                    "body": "Good conversation! The only refinement I would make is on the sex talk. My philosophy is that it's fine to talk sex on SA as long as I do it in a tasteful way that is respectful. I also show a genuine interest in what she is into or not into. The difference between money and sex talk is that money is just a number. It really doesn't take a lot of discussion, whereas it does take some discussion to see if there is sexual compatibility. If you remove both sex and money from SA conversations, then conversations can get a bit boring\n\nBut again, I never approach sex talk in a way that would feel degrading to the SB. I try to be flirtatious, indirect, witty, that kind of thing. I also try to feel her out to see what would genuinely turn her on. I certainly don't go into the discussion with the idea that I'm going to pay her to get kinky or for specific acts. I go into trying to figure out what her kinks are and what she would enjoy. The \"menu\" approach to coming up with a \"rate\" is a signal to me that she is an experienced sex worker. While there is absolutely nothing wrong with that, I personally find that a turn off. I don't want to pay her extra to do something kinky she is not really into. I'd rather do something kinky that she is into.\n\nHowever, I also agree in not wasting a lot of time with sex talk. Definitely not into sexting for days or weeks. A little bit of banter and a few compatibility questions are enough. The faster you can move to Google Voice, the better so that the censors aren't reading everything.\n\n&#x200B;\n\n&#x200B;",
                    "author": "manlicksdog",
                    "id": "edobwel",
                    "parent_id": "t1_edoat08",
                    "score": 2,
                    "created_utc": 1547080128.0,
                    "replies": [
                        {
                            "body": "Great point, in my experience sex is often not brought up in a tasteful or respectful way. If it is brought up--and not immediately but after a few exchanges--the way that you're describing, that's totally fair and doesn't need to be countered with money talk. I think often sex is brought up quickly by splenda/salt daddies who want to just completely skip past the money side of the deal, and I guess my way of turning them down is by reminding them that I also expect something in return.\n\nThis is a huge reason why I really appreciate when an SD says right off the bat that they are happy to provide an allowance, or some other mention of them being comfortable with money. If they have given me no indication at any point that they understand their role in this arrangement, then I'm hesitant to discuss what I do and don't like in the bedroom. Real SD's often do seem to put my mind at ease in this regard early on. Do you have any suggestions on how to gently bring up the topic of money--simply to ensure that they do intend to pay/establish an arrangement at some point, even if details don't need to be hammered out immediately. ",
                            "author": "thehoppiest",
                            "id": "edoczwa",
                            "parent_id": "t1_edobwel",
                            "score": 5,
                            "created_utc": 1547081041.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "To each their own indeed. I don't think ive ever been attracted to any of my past daddies but I did enjoy their company and we had fun. I'm not in the sugar bowel to find prince charming, rather for the experiences and I do enjoy meeting older men with knowledge that can indeed, teach me something. Also if he puts a high net worth and gawks at certain financial requests, salt! I dont mind if they aren't extremely wealthy but if they wanna front, then I'm gonna have a price to match. ",
            "author": "inthemoodforsoup",
            "id": "edo93c1",
            "parent_id": "t1_edo7yju",
            "score": 11,
            "created_utc": 1547077843.0,
            "replies": [
                {
                    "body": "> sugar bowel\n\nThis may be my favourite typo ever.",
                    "author": null,
                    "id": "edp4kk4",
                    "parent_id": "t1_edo93c1",
                    "score": 13,
                    "created_utc": 1547107896.0,
                    "replies": []
                },
                {
                    "body": "Well, I suppose you are right. Each person has a different strategy and things they are looking for. From talking to many women on the site, may women value chemistry a lot but I can also imagine it hurts their bottom line. I'm just not sure that is advice all women should follow. Its advice that works for some women, not others. ",
                    "author": "manlicksdog",
                    "id": "edo9wtn",
                    "parent_id": "t1_edo93c1",
                    "score": 2,
                    "created_utc": 1547078502.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would too!! You should write it yourself :)",
            "author": "thehoppiest",
            "id": "edoyyf1",
            "parent_id": "t1_edoqkfu",
            "score": 2,
            "created_utc": 1547100261.0,
            "replies": []
        },
        {
            "body": "I would too—why don’t you start it yourself? :)",
            "author": "thehoppiest",
            "id": "edoz8d1",
            "parent_id": "t1_edoqkfu",
            "score": 2,
            "created_utc": 1547100596.0,
            "replies": []
        },
        {
            "body": "The [MSR](https://www.reddit.com/r/sugarlifestyleforum/comments/916xmx/modern_sugar_relationship_msr_process/) post was my attempt to crystallize what I had learned as an SD, though I explicitly put it in terms that also applied to SBs because I don't think there's any inherent conflict.",
            "author": "sugaritis",
            "id": "edwqdd8",
            "parent_id": "t1_edoqkfu",
            "score": 1,
            "created_utc": 1547316790.0,
            "replies": []
        },
        {
            "body": "I agree with you, just oversimplified it a bit. My point was more that SD’s and SB’s get different things from an SR—and that if an SB is mainly looking for companionship she ought to stick to vanilla dating. ",
            "author": "thehoppiest",
            "id": "eeduu4q",
            "parent_id": "t1_ee05ofh",
            "score": 1,
            "created_utc": 1547844413.0,
            "replies": []
        },
        {
            "body": "Good conversation! The only refinement I would make is on the sex talk. My philosophy is that it's fine to talk sex on SA as long as I do it in a tasteful way that is respectful. I also show a genuine interest in what she is into or not into. The difference between money and sex talk is that money is just a number. It really doesn't take a lot of discussion, whereas it does take some discussion to see if there is sexual compatibility. If you remove both sex and money from SA conversations, then conversations can get a bit boring\n\nBut again, I never approach sex talk in a way that would feel degrading to the SB. I try to be flirtatious, indirect, witty, that kind of thing. I also try to feel her out to see what would genuinely turn her on. I certainly don't go into the discussion with the idea that I'm going to pay her to get kinky or for specific acts. I go into trying to figure out what her kinks are and what she would enjoy. The \"menu\" approach to coming up with a \"rate\" is a signal to me that she is an experienced sex worker. While there is absolutely nothing wrong with that, I personally find that a turn off. I don't want to pay her extra to do something kinky she is not really into. I'd rather do something kinky that she is into.\n\nHowever, I also agree in not wasting a lot of time with sex talk. Definitely not into sexting for days or weeks. A little bit of banter and a few compatibility questions are enough. The faster you can move to Google Voice, the better so that the censors aren't reading everything.\n\n&#x200B;\n\n&#x200B;",
            "author": "manlicksdog",
            "id": "edobwel",
            "parent_id": "t1_edoat08",
            "score": 2,
            "created_utc": 1547080128.0,
            "replies": [
                {
                    "body": "Great point, in my experience sex is often not brought up in a tasteful or respectful way. If it is brought up--and not immediately but after a few exchanges--the way that you're describing, that's totally fair and doesn't need to be countered with money talk. I think often sex is brought up quickly by splenda/salt daddies who want to just completely skip past the money side of the deal, and I guess my way of turning them down is by reminding them that I also expect something in return.\n\nThis is a huge reason why I really appreciate when an SD says right off the bat that they are happy to provide an allowance, or some other mention of them being comfortable with money. If they have given me no indication at any point that they understand their role in this arrangement, then I'm hesitant to discuss what I do and don't like in the bedroom. Real SD's often do seem to put my mind at ease in this regard early on. Do you have any suggestions on how to gently bring up the topic of money--simply to ensure that they do intend to pay/establish an arrangement at some point, even if details don't need to be hammered out immediately. ",
                    "author": "thehoppiest",
                    "id": "edoczwa",
                    "parent_id": "t1_edobwel",
                    "score": 5,
                    "created_utc": 1547081041.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> sugar bowel\n\nThis may be my favourite typo ever.",
            "author": null,
            "id": "edp4kk4",
            "parent_id": "t1_edo93c1",
            "score": 13,
            "created_utc": 1547107896.0,
            "replies": []
        },
        {
            "body": "Well, I suppose you are right. Each person has a different strategy and things they are looking for. From talking to many women on the site, may women value chemistry a lot but I can also imagine it hurts their bottom line. I'm just not sure that is advice all women should follow. Its advice that works for some women, not others. ",
            "author": "manlicksdog",
            "id": "edo9wtn",
            "parent_id": "t1_edo93c1",
            "score": 2,
            "created_utc": 1547078502.0,
            "replies": []
        },
        {
            "body": "Great point, in my experience sex is often not brought up in a tasteful or respectful way. If it is brought up--and not immediately but after a few exchanges--the way that you're describing, that's totally fair and doesn't need to be countered with money talk. I think often sex is brought up quickly by splenda/salt daddies who want to just completely skip past the money side of the deal, and I guess my way of turning them down is by reminding them that I also expect something in return.\n\nThis is a huge reason why I really appreciate when an SD says right off the bat that they are happy to provide an allowance, or some other mention of them being comfortable with money. If they have given me no indication at any point that they understand their role in this arrangement, then I'm hesitant to discuss what I do and don't like in the bedroom. Real SD's often do seem to put my mind at ease in this regard early on. Do you have any suggestions on how to gently bring up the topic of money--simply to ensure that they do intend to pay/establish an arrangement at some point, even if details don't need to be hammered out immediately. ",
            "author": "thehoppiest",
            "id": "edoczwa",
            "parent_id": "t1_edobwel",
            "score": 5,
            "created_utc": 1547081041.0,
            "replies": []
        }
    ]
}