{
    "title": "Story time! I had a very unusual arrangement and want to hear about some other non-traditional and strange arrangements!",
    "post_id": "hakdqn",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hakdqn/story_time_i_had_a_very_unusual_arrangement_and/",
    "author": "lasswithaleash",
    "body": "One of the most interesting arrangements (and oddly one of the sweetest) was with a man who was completely unaware it was happening.\n\nI found a profile on SA that was so weird that I had to send a message. It was a woman, I’ll call her Sarah. So Sarah is the ex-wife of Tom (also a pseudonym to protect the truly innocent). They have several children and co-parent as well as they can from cities a three hour drive away. She still loves him and believes they will end up together in the end but need a few years to heal.\n\nVia video call she explained that she was concerned that Tom didn’t have much of a social life, and she had experience sugaring prior to their marriage, so she basically wanted to pay someone PPM plus expenses to go on dates with him and get him to have fun while also stepping out of his once-a-week-karaoke-night comfort zone. I thought it sounded sweet.\n\nWe got along great and agreed to terms. The PPM was low, but mostly because it would likely be completely platonic (we did discuss how we would proceed if that changed but it was unlikely) due to the fact that Tom is very conservative and doesn’t believe in sex before marriage.\n\nI know, it sounds made up. Stay with me, it gets weirder!\n\nShe didn’t want him to find out about this at all, so we had to figure out a way for me to meet him. There were a couple mishaps. For one, I was going to go try to introduce myself under the guise of complimenting his karaoke performance, but she texted me and said that through one of the kids she found out that he fell asleep on the couch and wouldn’t be going.\n\nFinally there was a breakthrough! They took their children on a family vacation for spring break (shoutout to healthy coparenting), and she was staying at his house with them that night before driving home, so she convinced him to go out for drinks at a nearby dive bar and texted me frantically to see if I could make it.\n\nI was free that night so while I was putting on a quick face, she hashed out a plan. They were sitting at a table so when I arrived she would meet me at the bar and we would “make friends” and she would bring the cute stray back to the table.\n\nWe drank, we all sang karaoke, we all danced with each other, and it was clear to me that not only was she still in love with him, he was still madly in love with her, and it would only ever be platonic between him and I. So Tom and I exchanged numbers, and Sarah and I pretended to while he paid the bar tab, so pleased that our plan finally worked, and in a way that she and I didn’t have to hide knowing each other, bonus!\n\nSarah said she could afford up to 5 monthly in our initial call. He and I went on 3-4 dates a month for four months. We had a lot of fun and I was able to pull him out of his shell to try new places. Sarah was happy that he was having such a good time, and that there was clearly nothing romantic between Tom and I.\n\nTwo major changes ended our lovely little triangle. He moved to the far south side of our city, whereas I am north of city limits, and we did hang out once or twice afterward, but it was a bit of a pain for both of us. Then Sarah fell ill and was hospitalized and I stepped back so they could focus on her health.\n\nShe is the picture of health now, and I’m still friends with and talk to both of them via social media regularly.\n\nIt’s still one of my favorite arrangements. 😊",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hakdqn/story_time_i_had_a_very_unusual_arrangement_and/",
    "score": 218,
    "upvote_ratio": 0.97,
    "created_utc": 1592369540.0,
    "num_comments": 30,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "This is some wholesome sugaring",
            "author": "veganhotdoggie",
            "id": "fv3cwkp",
            "parent_id": "t3_hakdqn",
            "score": 77,
            "created_utc": 1592369952.0,
            "replies": [
                {
                    "body": "I know. I literally found one of the only legit platonic arrangements on SA, and I am no prude, lol. Terribly ironic.",
                    "author": "lasswithaleash",
                    "id": "fv3d6et",
                    "parent_id": "t1_fv3cwkp",
                    "score": 36,
                    "created_utc": 1592370155.0,
                    "replies": [
                        {
                            "body": "Just as the saying goes that we tell all the wanna be Platonic SB on SLF... \"you dont find platonic arrangements, platonic arrangements find you.\" 🤣😜",
                            "author": "ruphun",
                            "id": "fv409aw",
                            "parent_id": "t1_fv3d6et",
                            "score": 21,
                            "created_utc": 1592391442.0,
                            "replies": [
                                {
                                    "body": "Pretty much!! It was definitely not what I was in the market for at the time. 😂",
                                    "author": "lasswithaleash",
                                    "id": "fv6imj9",
                                    "parent_id": "t1_fv409aw",
                                    "score": 3,
                                    "created_utc": 1592438825.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Now that’s a woman who really loves her man and wants the best for her husband. Even if that means letting him experience new things.",
            "author": null,
            "id": "fv41a2m",
            "parent_id": "t3_hakdqn",
            "score": 23,
            "created_utc": 1592392373.0,
            "replies": []
        },
        {
            "body": "Wait.. so much curiosity right now. Did they get back together? Will they ever? Why did they separate if they both still love each other?",
            "author": null,
            "id": "fv3e5r2",
            "parent_id": "t3_hakdqn",
            "score": 24,
            "created_utc": 1592370893.0,
            "replies": [
                {
                    "body": "I really believe that they will end up back together, just not yet. They owned a business so being together 24/7 was tough, and they divorced shortly after the business crumbled. There were a couple other difficult things that they were dealing with as a family at the time so it was all just very stressful. They co-parent so beautifully and there’s a lot of love there. I’m routing for them. 😊",
                    "author": "lasswithaleash",
                    "id": "fv3fpip",
                    "parent_id": "t1_fv3e5r2",
                    "score": 31,
                    "created_utc": 1592372081.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How cool is that ? Good work. That wife is a stud..",
            "author": "GSSD",
            "id": "fv46i6c",
            "parent_id": "t3_hakdqn",
            "score": 7,
            "created_utc": 1592396580.0,
            "replies": [
                {
                    "body": "She was a dynamic woman! I loved her from the start.",
                    "author": "lasswithaleash",
                    "id": "fv6j7o4",
                    "parent_id": "t1_fv46i6c",
                    "score": 1,
                    "created_utc": 1592439136.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I had something of the opposite happen when I was in high school and college back in the mid 80's. I grew up on a block in the midwest that consisted of mainly first generation greek imigrants. My best buddy Mark lived four doors down and his folks divorced when he was young but his Dad remarried a much younger lady named Amy. Amy's younger sister Carla came to live with them after she some kind of health issue ( I later learned it was an extended stay in re-hab for drugs). \n\nAnyway I had known Amy since I was in 3rd grade and she was always very nice to me. She was busy raising her two young children but was kind to me when I was around even though I could tell she hated her step son Mark. So one day the summer before my Senior year I walked down to see what Mark was up to and Amy answered the door and told me he wasn't home, but could I do her a favor? She said \"Hey, Jay...anyway you could spend some time with Carla, just get her out of the house, she can't drive and we just need some space....I'll pay you\". \n\nAnd that started a very interesting relationship that next 3 years until Carla moved back west after my sophomore year of college.....",
            "author": "FredCouplesBaby",
            "id": "fv4f9ob",
            "parent_id": "t3_hakdqn",
            "score": 6,
            "created_utc": 1592402110.0,
            "replies": []
        },
        {
            "body": "What a heart-warming story! Imagine a feel-good movie with this plot, starring young Miranda Kerr, Christian Bale and Cate Blanchett...   \nDoes Sarah intend to tell him the truth one day?",
            "author": "PleaseMoreCoffee",
            "id": "fv3hev8",
            "parent_id": "t3_hakdqn",
            "score": 10,
            "created_utc": 1592373422.0,
            "replies": [
                {
                    "body": "I have no idea. Maybe we’ll all laugh about it at karaoke after they’re back together. That would be so Hallmark, wouldn’t it? 😂",
                    "author": "lasswithaleash",
                    "id": "fv3iii2",
                    "parent_id": "t1_fv3hev8",
                    "score": 7,
                    "created_utc": 1592374320.0,
                    "replies": [
                        {
                            "body": "Is Danica McKeller or Lacey Chabert being cast?",
                            "author": "BinghamtonSD",
                            "id": "fv4237g",
                            "parent_id": "t1_fv3iii2",
                            "score": 6,
                            "created_utc": 1592393081.0,
                            "replies": [
                                {
                                    "body": "Lacey Chabert, I hope. 😂",
                                    "author": "lasswithaleash",
                                    "id": "fv6ip3f",
                                    "parent_id": "t1_fv4237g",
                                    "score": 2,
                                    "created_utc": 1592438865.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow. Could you imagine when they are old she spills the beans. Remember your old friend karen? Yeah i paid her to be your friend 😉",
            "author": "dade_murphy1",
            "id": "fv6iwl6",
            "parent_id": "t3_hakdqn",
            "score": 3,
            "created_utc": 1592438979.0,
            "replies": [
                {
                    "body": "That’s so funny, my name does start with a K, but I rarely ask for the manager. 😜",
                    "author": "lasswithaleash",
                    "id": "fv6j0gz",
                    "parent_id": "t1_fv6iwl6",
                    "score": 3,
                    "created_utc": 1592439040.0,
                    "replies": [
                        {
                            "body": "I just saw one today at a cell phone business. Refused to wear a mask and got irate lol.",
                            "author": "dade_murphy1",
                            "id": "fv6j420",
                            "parent_id": "t1_fv6j0gz",
                            "score": 2,
                            "created_utc": 1592439094.0,
                            "replies": [
                                {
                                    "body": "I’m even wearing a mask in my profile picture, lol.",
                                    "author": "lasswithaleash",
                                    "id": "fv6jp3s",
                                    "parent_id": "t1_fv6j420",
                                    "score": 2,
                                    "created_utc": 1592439322.0,
                                    "replies": [
                                        {
                                            "body": "Its like you do realize these are private businesses right? No shirt, no shoes, no mask, no business.",
                                            "author": "dade_murphy1",
                                            "id": "fv76n2t",
                                            "parent_id": "t1_fv6jp3s",
                                            "score": 1,
                                            "created_utc": 1592453083.0,
                                            "replies": [
                                                {
                                                    "body": "There’s a bar that made the local new in a small town near me that has decided to not allow masks. Such idiots.",
                                                    "author": "lasswithaleash",
                                                    "id": "fv783kc",
                                                    "parent_id": "t1_fv76n2t",
                                                    "score": 2,
                                                    "created_utc": 1592454070.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This most loving gesture by Sarah is also highly controlling.  There are likely many layers of enjoyment, curiosity,  and manipulativeness goin' on at once here for all involved—even the blissfully ignorant.  Everyone is in danger b/c of stealthiness and the risks of feelings developing unexpectedly.  But your titillation is understandable.  \n\nTom & Sarah sound like decent folks; as do you.  \n\nI hope everyone comes out a winner.",
            "author": null,
            "id": "fv3fihw",
            "parent_id": "t3_hakdqn",
            "score": 8,
            "created_utc": 1592371929.0,
            "replies": [
                {
                    "body": "After Tom and I were able to meet, the only thing that was kept from him was the payments. Sarah never tried to dictate any part of it or even ask me about our outings. It might have been a bit manipulative, but it never felt controlling.\n\nThere was never a risk of feelings developing though. He was adorable and very sweet, but I knew straight off that I wasn’t sexually attracted to him. And I could see when they danced he just had stars in his eyes for her.\n\nThey really are lovely people and I hope they do get back together someday. 😊",
                    "author": "lasswithaleash",
                    "id": "fv3h22q",
                    "parent_id": "t1_fv3fihw",
                    "score": 15,
                    "created_utc": 1592373140.0,
                    "replies": [
                        {
                            "body": "Thank you for the coda.  I get it,\n\nThis reminds me a **tiny** bit of a French movie adapted from an American novel, both titled ‘I sent a letter to my love.’  A poignant story about a lady who hires a theater actress to pretend to be romantically interested in her crippled brother.  The French title is ‘Chère Inconnue.’",
                            "author": null,
                            "id": "fv3iil4",
                            "parent_id": "t1_fv3h22q",
                            "score": 4,
                            "created_utc": 1592374321.0,
                            "replies": [
                                {
                                    "body": "I’ll have to check that one out, thanks!!",
                                    "author": "lasswithaleash",
                                    "id": "fv3iklv",
                                    "parent_id": "t1_fv3iil4",
                                    "score": 3,
                                    "created_utc": 1592374369.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Omg my heart!! So sweet!",
            "author": "Ipatchcat",
            "id": "fv5jr8q",
            "parent_id": "t3_hakdqn",
            "score": 2,
            "created_utc": 1592421782.0,
            "replies": []
        },
        {
            "body": "Oh wow this is so incredibly sweet. Can't say I would have gotten very far with her because I'd surely label it as some kind of scam and block her. It's so nice that you were able to help their relationship like that!",
            "author": "_Fortuna_",
            "id": "fv6vglt",
            "parent_id": "t3_hakdqn",
            "score": 2,
            "created_utc": 1592446124.0,
            "replies": []
        },
        {
            "body": "That's just how things pan out lol. My current SD just likes me turning his sexual advances constantly because he's never had anyone ever say no to him before. I wasn't even planning on him being my SD it just happened",
            "author": "veganhotdoggie",
            "id": "fv3dcrr",
            "parent_id": "t3_hakdqn",
            "score": 2,
            "created_utc": 1592370288.0,
            "replies": []
        },
        {
            "body": "I do wonder if maybe she was into some sort of vicarious, voyeuristic, or cuck-queening lifestyle lol.",
            "author": "haleykohr",
            "id": "fv3l9vy",
            "parent_id": "t3_hakdqn",
            "score": 2,
            "created_utc": 1592376664.0,
            "replies": [
                {
                    "body": "She never asked about what we did at all. They talked a lot, so maybe she asked him, lol.",
                    "author": "lasswithaleash",
                    "id": "fv6ivws",
                    "parent_id": "t1_fv3l9vy",
                    "score": 2,
                    "created_utc": 1592438969.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love this story 🥺🥺\nI wish I could write a story about it on your behalf",
            "author": null,
            "id": "fv3m6oi",
            "parent_id": "t3_hakdqn",
            "score": 1,
            "created_utc": 1592377461.0,
            "replies": []
        },
        {
            "body": "I know. I literally found one of the only legit platonic arrangements on SA, and I am no prude, lol. Terribly ironic.",
            "author": "lasswithaleash",
            "id": "fv3d6et",
            "parent_id": "t1_fv3cwkp",
            "score": 36,
            "created_utc": 1592370155.0,
            "replies": [
                {
                    "body": "Just as the saying goes that we tell all the wanna be Platonic SB on SLF... \"you dont find platonic arrangements, platonic arrangements find you.\" 🤣😜",
                    "author": "ruphun",
                    "id": "fv409aw",
                    "parent_id": "t1_fv3d6et",
                    "score": 21,
                    "created_utc": 1592391442.0,
                    "replies": [
                        {
                            "body": "Pretty much!! It was definitely not what I was in the market for at the time. 😂",
                            "author": "lasswithaleash",
                            "id": "fv6imj9",
                            "parent_id": "t1_fv409aw",
                            "score": 3,
                            "created_utc": 1592438825.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I really believe that they will end up back together, just not yet. They owned a business so being together 24/7 was tough, and they divorced shortly after the business crumbled. There were a couple other difficult things that they were dealing with as a family at the time so it was all just very stressful. They co-parent so beautifully and there’s a lot of love there. I’m routing for them. 😊",
            "author": "lasswithaleash",
            "id": "fv3fpip",
            "parent_id": "t1_fv3e5r2",
            "score": 31,
            "created_utc": 1592372081.0,
            "replies": []
        },
        {
            "body": "She was a dynamic woman! I loved her from the start.",
            "author": "lasswithaleash",
            "id": "fv6j7o4",
            "parent_id": "t1_fv46i6c",
            "score": 1,
            "created_utc": 1592439136.0,
            "replies": []
        },
        {
            "body": "I have no idea. Maybe we’ll all laugh about it at karaoke after they’re back together. That would be so Hallmark, wouldn’t it? 😂",
            "author": "lasswithaleash",
            "id": "fv3iii2",
            "parent_id": "t1_fv3hev8",
            "score": 7,
            "created_utc": 1592374320.0,
            "replies": [
                {
                    "body": "Is Danica McKeller or Lacey Chabert being cast?",
                    "author": "BinghamtonSD",
                    "id": "fv4237g",
                    "parent_id": "t1_fv3iii2",
                    "score": 6,
                    "created_utc": 1592393081.0,
                    "replies": [
                        {
                            "body": "Lacey Chabert, I hope. 😂",
                            "author": "lasswithaleash",
                            "id": "fv6ip3f",
                            "parent_id": "t1_fv4237g",
                            "score": 2,
                            "created_utc": 1592438865.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s so funny, my name does start with a K, but I rarely ask for the manager. 😜",
            "author": "lasswithaleash",
            "id": "fv6j0gz",
            "parent_id": "t1_fv6iwl6",
            "score": 3,
            "created_utc": 1592439040.0,
            "replies": [
                {
                    "body": "I just saw one today at a cell phone business. Refused to wear a mask and got irate lol.",
                    "author": "dade_murphy1",
                    "id": "fv6j420",
                    "parent_id": "t1_fv6j0gz",
                    "score": 2,
                    "created_utc": 1592439094.0,
                    "replies": [
                        {
                            "body": "I’m even wearing a mask in my profile picture, lol.",
                            "author": "lasswithaleash",
                            "id": "fv6jp3s",
                            "parent_id": "t1_fv6j420",
                            "score": 2,
                            "created_utc": 1592439322.0,
                            "replies": [
                                {
                                    "body": "Its like you do realize these are private businesses right? No shirt, no shoes, no mask, no business.",
                                    "author": "dade_murphy1",
                                    "id": "fv76n2t",
                                    "parent_id": "t1_fv6jp3s",
                                    "score": 1,
                                    "created_utc": 1592453083.0,
                                    "replies": [
                                        {
                                            "body": "There’s a bar that made the local new in a small town near me that has decided to not allow masks. Such idiots.",
                                            "author": "lasswithaleash",
                                            "id": "fv783kc",
                                            "parent_id": "t1_fv76n2t",
                                            "score": 2,
                                            "created_utc": 1592454070.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "After Tom and I were able to meet, the only thing that was kept from him was the payments. Sarah never tried to dictate any part of it or even ask me about our outings. It might have been a bit manipulative, but it never felt controlling.\n\nThere was never a risk of feelings developing though. He was adorable and very sweet, but I knew straight off that I wasn’t sexually attracted to him. And I could see when they danced he just had stars in his eyes for her.\n\nThey really are lovely people and I hope they do get back together someday. 😊",
            "author": "lasswithaleash",
            "id": "fv3h22q",
            "parent_id": "t1_fv3fihw",
            "score": 15,
            "created_utc": 1592373140.0,
            "replies": [
                {
                    "body": "Thank you for the coda.  I get it,\n\nThis reminds me a **tiny** bit of a French movie adapted from an American novel, both titled ‘I sent a letter to my love.’  A poignant story about a lady who hires a theater actress to pretend to be romantically interested in her crippled brother.  The French title is ‘Chère Inconnue.’",
                    "author": null,
                    "id": "fv3iil4",
                    "parent_id": "t1_fv3h22q",
                    "score": 4,
                    "created_utc": 1592374321.0,
                    "replies": [
                        {
                            "body": "I’ll have to check that one out, thanks!!",
                            "author": "lasswithaleash",
                            "id": "fv3iklv",
                            "parent_id": "t1_fv3iil4",
                            "score": 3,
                            "created_utc": 1592374369.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "She never asked about what we did at all. They talked a lot, so maybe she asked him, lol.",
            "author": "lasswithaleash",
            "id": "fv6ivws",
            "parent_id": "t1_fv3l9vy",
            "score": 2,
            "created_utc": 1592438969.0,
            "replies": []
        },
        {
            "body": "Just as the saying goes that we tell all the wanna be Platonic SB on SLF... \"you dont find platonic arrangements, platonic arrangements find you.\" 🤣😜",
            "author": "ruphun",
            "id": "fv409aw",
            "parent_id": "t1_fv3d6et",
            "score": 21,
            "created_utc": 1592391442.0,
            "replies": [
                {
                    "body": "Pretty much!! It was definitely not what I was in the market for at the time. 😂",
                    "author": "lasswithaleash",
                    "id": "fv6imj9",
                    "parent_id": "t1_fv409aw",
                    "score": 3,
                    "created_utc": 1592438825.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Is Danica McKeller or Lacey Chabert being cast?",
            "author": "BinghamtonSD",
            "id": "fv4237g",
            "parent_id": "t1_fv3iii2",
            "score": 6,
            "created_utc": 1592393081.0,
            "replies": [
                {
                    "body": "Lacey Chabert, I hope. 😂",
                    "author": "lasswithaleash",
                    "id": "fv6ip3f",
                    "parent_id": "t1_fv4237g",
                    "score": 2,
                    "created_utc": 1592438865.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I just saw one today at a cell phone business. Refused to wear a mask and got irate lol.",
            "author": "dade_murphy1",
            "id": "fv6j420",
            "parent_id": "t1_fv6j0gz",
            "score": 2,
            "created_utc": 1592439094.0,
            "replies": [
                {
                    "body": "I’m even wearing a mask in my profile picture, lol.",
                    "author": "lasswithaleash",
                    "id": "fv6jp3s",
                    "parent_id": "t1_fv6j420",
                    "score": 2,
                    "created_utc": 1592439322.0,
                    "replies": [
                        {
                            "body": "Its like you do realize these are private businesses right? No shirt, no shoes, no mask, no business.",
                            "author": "dade_murphy1",
                            "id": "fv76n2t",
                            "parent_id": "t1_fv6jp3s",
                            "score": 1,
                            "created_utc": 1592453083.0,
                            "replies": [
                                {
                                    "body": "There’s a bar that made the local new in a small town near me that has decided to not allow masks. Such idiots.",
                                    "author": "lasswithaleash",
                                    "id": "fv783kc",
                                    "parent_id": "t1_fv76n2t",
                                    "score": 2,
                                    "created_utc": 1592454070.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for the coda.  I get it,\n\nThis reminds me a **tiny** bit of a French movie adapted from an American novel, both titled ‘I sent a letter to my love.’  A poignant story about a lady who hires a theater actress to pretend to be romantically interested in her crippled brother.  The French title is ‘Chère Inconnue.’",
            "author": null,
            "id": "fv3iil4",
            "parent_id": "t1_fv3h22q",
            "score": 4,
            "created_utc": 1592374321.0,
            "replies": [
                {
                    "body": "I’ll have to check that one out, thanks!!",
                    "author": "lasswithaleash",
                    "id": "fv3iklv",
                    "parent_id": "t1_fv3iil4",
                    "score": 3,
                    "created_utc": 1592374369.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Pretty much!! It was definitely not what I was in the market for at the time. 😂",
            "author": "lasswithaleash",
            "id": "fv6imj9",
            "parent_id": "t1_fv409aw",
            "score": 3,
            "created_utc": 1592438825.0,
            "replies": []
        },
        {
            "body": "Lacey Chabert, I hope. 😂",
            "author": "lasswithaleash",
            "id": "fv6ip3f",
            "parent_id": "t1_fv4237g",
            "score": 2,
            "created_utc": 1592438865.0,
            "replies": []
        },
        {
            "body": "I’m even wearing a mask in my profile picture, lol.",
            "author": "lasswithaleash",
            "id": "fv6jp3s",
            "parent_id": "t1_fv6j420",
            "score": 2,
            "created_utc": 1592439322.0,
            "replies": [
                {
                    "body": "Its like you do realize these are private businesses right? No shirt, no shoes, no mask, no business.",
                    "author": "dade_murphy1",
                    "id": "fv76n2t",
                    "parent_id": "t1_fv6jp3s",
                    "score": 1,
                    "created_utc": 1592453083.0,
                    "replies": [
                        {
                            "body": "There’s a bar that made the local new in a small town near me that has decided to not allow masks. Such idiots.",
                            "author": "lasswithaleash",
                            "id": "fv783kc",
                            "parent_id": "t1_fv76n2t",
                            "score": 2,
                            "created_utc": 1592454070.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ll have to check that one out, thanks!!",
            "author": "lasswithaleash",
            "id": "fv3iklv",
            "parent_id": "t1_fv3iil4",
            "score": 3,
            "created_utc": 1592374369.0,
            "replies": []
        },
        {
            "body": "Its like you do realize these are private businesses right? No shirt, no shoes, no mask, no business.",
            "author": "dade_murphy1",
            "id": "fv76n2t",
            "parent_id": "t1_fv6jp3s",
            "score": 1,
            "created_utc": 1592453083.0,
            "replies": [
                {
                    "body": "There’s a bar that made the local new in a small town near me that has decided to not allow masks. Such idiots.",
                    "author": "lasswithaleash",
                    "id": "fv783kc",
                    "parent_id": "t1_fv76n2t",
                    "score": 2,
                    "created_utc": 1592454070.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There’s a bar that made the local new in a small town near me that has decided to not allow masks. Such idiots.",
            "author": "lasswithaleash",
            "id": "fv783kc",
            "parent_id": "t1_fv76n2t",
            "score": 2,
            "created_utc": 1592454070.0,
            "replies": []
        }
    ]
}