{
    "title": "Ladies, I implore you to not put up deceptive or filtered pics",
    "post_id": "efh8ye",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/efh8ye/ladies_i_implore_you_to_not_put_up_deceptive_or/",
    "author": "throwawaysdaccount22",
    "body": "Honestly...because if I get to a M&G and you don’t really look anything like your pics portrayed I’ll probably leave.\n\nDon’t put up filters. Don’t put up pics that hide your body type. Just be honest...every guy has their preference and you can likely still find someone. \n\nBeing deceptive, or lying about what you look like though is close to an automatic next.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/efh8ye/ladies_i_implore_you_to_not_put_up_deceptive_or/",
    "score": 113,
    "upvote_ratio": 0.87,
    "created_utc": 1577285179.0,
    "num_comments": 77,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Nice post, but the people you want to read it aren’t here lol.",
            "author": "SDforreal",
            "id": "fc0dx6d",
            "parent_id": "t3_efh8ye",
            "score": 108,
            "created_utc": 1577288155.0,
            "replies": [
                {
                    "body": "This lol",
                    "author": "OliviaWildflower2332",
                    "id": "fc0h493",
                    "parent_id": "t1_fc0dx6d",
                    "score": 23,
                    "created_utc": 1577290715.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fc0uxtv",
                    "parent_id": "t1_fc0dx6d",
                    "score": 4,
                    "created_utc": 1577300293.0,
                    "replies": [
                        {
                            "body": "The people here don’t behave that way. 🙂",
                            "author": "SDforreal",
                            "id": "fc0v6lc",
                            "parent_id": "t1_fc0uxtv",
                            "score": 13,
                            "created_utc": 1577300487.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Not necessarily. I’m pretty theres’s new people all the time.",
                    "author": "Limitlesspappy",
                    "id": "fc10341",
                    "parent_id": "t1_fc0dx6d",
                    "score": 5,
                    "created_utc": 1577304424.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think we all go fo our best angles and most flattering pics but I agree that you should be pretty straight up. \n\nMy policy is to use my favourite most flattering pics of myself (unfiltered, maybe a bit of brightness and saturation adjustment but no filtering or photoshop,) and then when speaking to a POT I will send a body shot and face shot from either that day or that week. It is a much more casual selfie style and doesn’t feel appropriate for the profile but gives the person a perfect idea of my body and face in normal lighting and circumstances\n\nI also don’t mind giving clothing sizes and measurements but most guys need the visual :)",
            "author": "redheadedbeautyxo",
            "id": "fc0b3bc",
            "parent_id": "t3_efh8ye",
            "score": 30,
            "created_utc": 1577285560.0,
            "replies": [
                {
                    "body": "Same I usually send the most recent couple selfies including a no make up one. \n\nClothing sizes are so irrelevant anymore. I’ve noticed fewer request for my sizes in the past year think guys caught on.",
                    "author": "knowswhatiwant",
                    "id": "fc0btyn",
                    "parent_id": "t1_fc0b3bc",
                    "score": 19,
                    "created_utc": 1577286256.0,
                    "replies": [
                        {
                            "body": "I frequently get the bra and panty size question after a meet and greet so they’ve clearly already seen my body 😂 strange question but I’m happy to comply if it means I may get some lingerie ~",
                            "author": "redheadedbeautyxo",
                            "id": "fc0c3ff",
                            "parent_id": "t1_fc0btyn",
                            "score": 8,
                            "created_utc": 1577286497.0,
                            "replies": [
                                {
                                    "body": "When they ask your cup size I wanna say “oh are you doing a survey?”",
                                    "author": "knowswhatiwant",
                                    "id": "fc0c9k7",
                                    "parent_id": "t1_fc0c3ff",
                                    "score": 13,
                                    "created_utc": 1577286652.0,
                                    "replies": [
                                        {
                                            "body": "Haha, it bothers you? I have no issue with it if it’s just a one time ask.\nThere was this one guy that told me from the start he was really into big boobs (which I have,) and he liked. I was fine with that. But then- for the next month I saw him (3 times in person and lots of texting,) all he did was talk about my breasts and I was sooo put off by it that I ended the SR. Otherwise, everything about him was great but bringing up my boobs three times in one date and ten times a week through text messaging was for some reason, a turn off I never knew I’d have.",
                                            "author": "redheadedbeautyxo",
                                            "id": "fc0cnwl",
                                            "parent_id": "t1_fc0c9k7",
                                            "score": 5,
                                            "created_utc": 1577287021.0,
                                            "replies": [
                                                {
                                                    "body": "That’s awful! I danced with a girl with amazing natural boobs and had even been in playboy. We often did back rooms together and guys pretty much stopped seeing her as a person just breast. They would tug, pull, lick, tweak and every other non fun thing with them. I would just stand there trying to get them off her damn chest long enough to chill!!! \n\nIt’s not that it really bothers me it’s just subjective it’s not like they really really know a cup size. Hell I thought I was a B til i was 30 🤣",
                                                    "author": "knowswhatiwant",
                                                    "id": "fc0d0ai",
                                                    "parent_id": "t1_fc0cnwl",
                                                    "score": 10,
                                                    "created_utc": 1577287336.0,
                                                    "replies": [
                                                        {
                                                            "body": "Haha yeah it’s so true! I literally respond to it as if it’s them needing my size for a gift and I’m like “I’m a 34DD but not at Victoria secret. Their bras aren’t big enough for me so I can’t wear them :( I really like Calvin Klein, DKNY, and bras from nice boutiques.  \n\nI’m usually a medium in panties and I only like thongs.” Lmao! Flip the script on them ;)",
                                                            "author": "redheadedbeautyxo",
                                                            "id": "fc0d9ks",
                                                            "parent_id": "t1_fc0d0ai",
                                                            "score": 12,
                                                            "created_utc": 1577287565.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "“Back rooms”?",
                                                            "author": "2fast-2curious",
                                                            "id": "fc0enyy",
                                                            "parent_id": "t1_fc0d0ai",
                                                            "score": -1,
                                                            "created_utc": 1577288810.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Private rooms. Not like a booth but a big room with a door. Still no sex but more lax on the touching policy. The high end clubs here the very wealthy like the privacy oh and they basically wanna do coke. Not much stage or floor action.\n\nEdit guys spare me the clubs are a waste or I had sex in the champagne room crap. Just answering a question and providing an example.",
                                                                    "author": "knowswhatiwant",
                                                                    "id": "fc0ey5g",
                                                                    "parent_id": "t1_fc0enyy",
                                                                    "score": 10,
                                                                    "created_utc": 1577289056.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Hmmmm",
                                                                            "author": "InfiniteTemptation",
                                                                            "id": "fc2nr14",
                                                                            "parent_id": "t1_fc0ey5g",
                                                                            "score": 1,
                                                                            "created_utc": 1577368425.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Here’s the thing I danced in the Midwest, been to clubs around the country and danced Manhattan. Know how there are outliers even in this community certain places where allowances are super high well think of Manhattan Clubs as the outlier. They are absolutely not like any clubs in other cities. It’s apples and oranges to the rest of the country. No one tips stage or even cares about it....not much of a lap dance scene except for maybe a fri/sat. The places I worked most the clientele were hedge fund managers, celebrities and athletes who really don’t do anything in public. \n\nWhen I first moved here I thought it would be like it was back home OH GAWD nope guys just said let’s go to the back and that’s where we drank, danced and partied. Totally bananas. So it gets frustrating when people compare it to other parts of the country but hell I didn’t know what bottle service was til I moved here and def hadn’t even seen coke! \n\nIt just is what it is and back rooms were more of a discretion thing. Sting was a regular at the club hahaha amongst most of the Manhattan Forbes list guys. Also, dancers here know the importance of discretion and would never rat on a big fish. So the Uber wealthy feel way more comfortable and also the host guard their identities. Those guys aren’t on SA and def wouldn’t open themselves up to blackmail (the smart ones).\n\nI had a customer spend $250k in 6 weeks coming to see me. That wasn’t including the ridiculous tips he dropped. I moved to the marketing and promoting side and the nightly spend of one customer would be 5 to 12k low end. \n\nI hated the lifestyle though and wouldn’t go back. Much happier in sugar world.",
                                                                                    "author": "knowswhatiwant",
                                                                                    "id": "fc2srgi",
                                                                                    "parent_id": "t1_fc2nr14",
                                                                                    "score": 2,
                                                                                    "created_utc": 1577372968.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Hahahaha @ sting was regular at the club.\nThat was a thing.",
                                                                                            "author": "InfiniteTemptation",
                                                                                            "id": "fc4d6ma",
                                                                                            "parent_id": "t1_fc2srgi",
                                                                                            "score": 2,
                                                                                            "created_utc": 1577413251.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Of all the regulars for some reason that’s the one that cracks me up the most bahahaha",
                                                                                                    "author": "knowswhatiwant",
                                                                                                    "id": "fc4e8zi",
                                                                                                    "parent_id": "t1_fc4d6ma",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1577414133.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I think that's exactly the right attitude.  I would never ask bra and panty size so early on, right after a M&G seems in appropriately early to ask such an intimate question, but it IS a huge thrill when we do get to the point that I'm buying lingerie for you.  I'd rather shop for it together -- online or in store -- so don't  need sizes, but not everyone operates that way.  No reason to turn would could be a gift into a negative.",
                                    "author": "Azurecole",
                                    "id": "fc0eett",
                                    "parent_id": "t1_fc0c3ff",
                                    "score": 2,
                                    "created_utc": 1577288588.0,
                                    "replies": [
                                        {
                                            "body": "I’ve had men buy me some atrocious lingerie I know exactly what fits my body. The outcome is much better if I choose",
                                            "author": "knowswhatiwant",
                                            "id": "fc14z0g",
                                            "parent_id": "t1_fc0eett",
                                            "score": 3,
                                            "created_utc": 1577308404.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I love that you send a no make up one.  \n\nYou’d get an automatic M&G from me if you are even marginally one of my body types.  \n\nConfidence is so fucking hot...",
                            "author": "BGDDDY1",
                            "id": "fc1qkkt",
                            "parent_id": "t1_fc0btyn",
                            "score": 0,
                            "created_utc": 1577326570.0,
                            "replies": [
                                {
                                    "body": "Thank you I don’t wear much make up to begin with but love how I look especially in the mornings. Just want y’all to know what you’ll be waking up to 😉",
                                    "author": "knowswhatiwant",
                                    "id": "fc1qtcv",
                                    "parent_id": "t1_fc1qkkt",
                                    "score": 0,
                                    "created_utc": 1577326794.0,
                                    "replies": [
                                        {
                                            "body": "OMG!  \n\nYou are making me rethink getting back in the bowl.😍",
                                            "author": "BGDDDY1",
                                            "id": "fc1qz5j",
                                            "parent_id": "t1_fc1qtcv",
                                            "score": 0,
                                            "created_utc": 1577326938.0,
                                            "replies": [
                                                {
                                                    "body": "Why don’t ya come up and see me sometime 😉",
                                                    "author": "knowswhatiwant",
                                                    "id": "fc1ra2d",
                                                    "parent_id": "t1_fc1qz5j",
                                                    "score": -1,
                                                    "created_utc": 1577327210.0,
                                                    "replies": [
                                                        {
                                                            "body": " I’ve got a bad feeling that you’d be well worth it.",
                                                            "author": "BGDDDY1",
                                                            "id": "fc1rjx5",
                                                            "parent_id": "t1_fc1ra2d",
                                                            "score": 0,
                                                            "created_utc": 1577327465.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fc0d025",
                    "parent_id": "t1_fc0b3bc",
                    "score": -5,
                    "created_utc": 1577287330.0,
                    "replies": [
                        {
                            "body": "I love this coming from a guy. I have met someone who figured just because he’s a rich white guy giving the gifts I should be okay with his almost 400lbs weight. I politely told him I can’t go ahead with the meet and greet and then he went off. I’m not the thinnest or sexiest but I still have a type I’m attracted to regardless of whatever gift you are giving. And most guys don’t get this. So thank you for being reasonable.",
                            "author": null,
                            "id": "fc0stnc",
                            "parent_id": "t1_fc0d025",
                            "score": 6,
                            "created_utc": 1577298859.0,
                            "replies": [
                                {
                                    "body": "On one hand, i certainly get it. I’m a bit overweight, 35, but not morbidly so and am balding. I get I’m not everyone’s type and I very much expect the college types to shy away from me as I know I’m not their type.\n\nOn the flip side, when a 30+ cute buy not drop dead POT immediately ghosts on me when I share my pics i tend to shake my head. I know it sounds terrible, but there are limitations I may have as to what I get even with money but the women have to sometimes realize that as well. Most of the guys on SA aren’t brad Pitt look alikes.",
                                    "author": "throwawaysdaccount22",
                                    "id": "fc1bzmw",
                                    "parent_id": "t1_fc0stnc",
                                    "score": 2,
                                    "created_utc": 1577314222.0,
                                    "replies": [
                                        {
                                            "body": "Very well said most of the guys aren’t brad Pitt, we don’t expect brad Pitt or Liam hemsworth. Same way most of the girls are not Kim kardashian. But everyone has their type. Most guys just have this entitlement that because I’m bringing the gifts I can look like whatever.",
                                            "author": null,
                                            "id": "fc1cm8a",
                                            "parent_id": "t1_fc1bzmw",
                                            "score": 3,
                                            "created_utc": 1577314759.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah. I knew that would come off that way. Let me put it this way...I’d say I’m an average looking guy. An average looking 30 year old POT should probably not just immediately ghost on a guy who\nMight be interested and serious.",
                                                    "author": "throwawaysdaccount22",
                                                    "id": "fc1d35x",
                                                    "parent_id": "t1_fc1cm8a",
                                                    "score": 1,
                                                    "created_utc": 1577315153.0,
                                                    "replies": [
                                                        {
                                                            "body": "Very true. Average looking isn’t bad because we are all average looking. What is sexy to you might be average to someone else. So at some point we have all been called average looking.",
                                                            "author": null,
                                                            "id": "fc1dej0",
                                                            "parent_id": "t1_fc1d35x",
                                                            "score": 2,
                                                            "created_utc": 1577315418.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah. I feel bad having this convo. I know I have my type too so it isn’t really fair.",
                                                                    "author": "throwawaysdaccount22",
                                                                    "id": "fc1dijj",
                                                                    "parent_id": "t1_fc1dej0",
                                                                    "score": 1,
                                                                    "created_utc": 1577315514.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Lol it’s cool. So what’s your type?",
                                                                            "author": null,
                                                                            "id": "fc1djkx",
                                                                            "parent_id": "t1_fc1dijj",
                                                                            "score": 1,
                                                                            "created_utc": 1577315540.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Haha. Skinnier and petite.",
                                                                                    "author": "throwawaysdaccount22",
                                                                                    "id": "fc1fzhu",
                                                                                    "parent_id": "t1_fc1djkx",
                                                                                    "score": 1,
                                                                                    "created_utc": 1577317625.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Lol so you see?",
                                                                                            "author": null,
                                                                                            "id": "fc1g112",
                                                                                            "parent_id": "t1_fc1fzhu",
                                                                                            "score": 1,
                                                                                            "created_utc": 1577317660.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fc0tvb7",
                                    "parent_id": "t1_fc0stnc",
                                    "score": 1,
                                    "created_utc": 1577299550.0,
                                    "replies": [
                                        {
                                            "body": "Lol",
                                            "author": null,
                                            "id": "fc0u0pf",
                                            "parent_id": "t1_fc0tvb7",
                                            "score": 1,
                                            "created_utc": 1577299670.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yeah I agree entirely. I try to get my favorite pics while still showing my body and face clearly and having a varitey of pics. I probably have 10? I also give pics pretty freely ESPECIALLY if anything has changed at all.\n\nFor example, I’ve recently been wearing my hair in waves where as it is straight in 70% of my photos. I like to them send pics with the waves to someone I’m talking to and ask them which they prefer. A. It’s a recent pic. And B. I have no problem wearing it straight if they like it better :) \n\nI’ve never once been told that I look different than my profile picture aside from “I didn’t know you were so tall” (I’m 5 foot 8 and it’s written in my profile so that’s kind of on them 😂)",
                            "author": "redheadedbeautyxo",
                            "id": "fc0di4t",
                            "parent_id": "t1_fc0d025",
                            "score": 2,
                            "created_utc": 1577287778.0,
                            "replies": []
                        },
                        {
                            "body": "It's actually great to know there are SDs that care about genuine mutual attraction. Sometimes it seems like they're just looking for arm candy with a hole. :)",
                            "author": "Apple_34_",
                            "id": "fc23dns",
                            "parent_id": "t1_fc0d025",
                            "score": 1,
                            "created_utc": 1577338780.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This goes both ways. When a SD's profile says blonde with an athletic body, I'm going to be disappointed & mildly annoyed if someone with stark white hair, a huge potbelly & 20+ years is waiting for me at a M&G. \n\nYes, this actually happened.",
            "author": "r0siethecat",
            "id": "fc1gi24",
            "parent_id": "t3_efh8ye",
            "score": 12,
            "created_utc": 1577318066.0,
            "replies": []
        },
        {
            "body": "A lot of people must be doing this, because I can't tell you how many SA or WYP dates I've been on where the guy was relieved I actually look like my pics lol\n\nThis happens in non-SB dating too",
            "author": "pandorafetish",
            "id": "fc0v9x3",
            "parent_id": "t3_efh8ye",
            "score": 5,
            "created_utc": 1577300558.0,
            "replies": [
                {
                    "body": "Same here. When they say wow you look like/better than your pics I wonder how awful it is!",
                    "author": "knowswhatiwant",
                    "id": "fc1c79n",
                    "parent_id": "t1_fc0v9x3",
                    "score": 4,
                    "created_utc": 1577314402.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fair....as long as yours aren't 15-20 years old!!!",
            "author": "BratinaHat",
            "id": "fc0la7a",
            "parent_id": "t3_efh8ye",
            "score": 8,
            "created_utc": 1577293608.0,
            "replies": [
                {
                    "body": "Very true...",
                    "author": null,
                    "id": "fc0tvx3",
                    "parent_id": "t1_fc0la7a",
                    "score": 2,
                    "created_utc": 1577299564.0,
                    "replies": []
                },
                {
                    "body": "Exactly 😂",
                    "author": null,
                    "id": "fc0se6d",
                    "parent_id": "t1_fc0la7a",
                    "score": 1,
                    "created_utc": 1577298547.0,
                    "replies": [
                        {
                            "body": "liking your username ;)",
                            "author": "BratinaHat",
                            "id": "fc0shjw",
                            "parent_id": "t1_fc0se6d",
                            "score": 1,
                            "created_utc": 1577298623.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Fair is fair, for sure. It's almost to the point of requiring a hostage proof of life photo.\n\n\"Send me a picture of you holding a newspaper with todays headlines on it, I'll send you a picture of me in the front of the local clocktower with today's date clearly visible\".\n\nSad but true.",
                    "author": null,
                    "id": "fc3uqcy",
                    "parent_id": "t1_fc0la7a",
                    "score": 0,
                    "created_utc": 1577399128.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Welcome to my online dating. Everyone is trying to portray some kind of image of themselves.",
            "author": null,
            "id": "fc0tzrk",
            "parent_id": "t3_efh8ye",
            "score": 4,
            "created_utc": 1577299649.0,
            "replies": []
        },
        {
            "body": "I assure you this is applicable to the guys as well!",
            "author": null,
            "id": "fc2hwlv",
            "parent_id": "t3_efh8ye",
            "score": 3,
            "created_utc": 1577361137.0,
            "replies": []
        },
        {
            "body": "OMG - I could not agree more.  Also - if you happen to be a little heavier but you send photos that make you look very slender - it’s very deceptive and a big turn off.  Like you said above - there is someone for everyone - just be straight.",
            "author": "Jeffrey45429",
            "id": "fc0aup5",
            "parent_id": "t3_efh8ye",
            "score": 8,
            "created_utc": 1577285333.0,
            "replies": [
                {
                    "body": "There are a lot of girls that were recently pretty slender that have not noticed or embraced the changes.  Some girls take liberty with the “Athletic” body type because they played soccer in High School 6 years ago.  Time flies.",
                    "author": "LotBuilder",
                    "id": "fc0okk7",
                    "parent_id": "t1_fc0aup5",
                    "score": 3,
                    "created_utc": 1577295935.0,
                    "replies": [
                        {
                            "body": "Agreed.  Many take liberties.  Athletic body is fine if you’re athletic - toned and maybe a bit muscular.  Thick is not athletic.",
                            "author": "Jeffrey45429",
                            "id": "fc0owhl",
                            "parent_id": "t1_fc0okk7",
                            "score": 2,
                            "created_utc": 1577296152.0,
                            "replies": [
                                {
                                    "body": "I’m very picky and basically don’t contact girls unless their pics include a bikini or crop top shot showing some ab definition.   Most girls that put in the work to look like that want to show it Off rather than hide it with angles and filters.",
                                    "author": "LotBuilder",
                                    "id": "fc0pjhg",
                                    "parent_id": "t1_fc0owhl",
                                    "score": -4,
                                    "created_utc": 1577296579.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes and emphasize two things.\n\nSnapchat filters and the like are BAD.. leave them to high school kids\n\nAnd if you want to be attractive to men.. don't assume you should be skinny etc. There will be men attracted to any body type. Really.",
            "author": "doctorcoolpop",
            "id": "fc0sb0q",
            "parent_id": "t3_efh8ye",
            "score": 4,
            "created_utc": 1577298476.0,
            "replies": [
                {
                    "body": "Yes to this! There is a wide variety of attraction out there.",
                    "author": "OliviaWildflower2332",
                    "id": "fc1yoj8",
                    "parent_id": "t1_fc0sb0q",
                    "score": 0,
                    "created_utc": 1577333888.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is also good advice for new people on both sides. Ladies do show your body or we think you are hiding something and frankly we don't care enough to dig or have the time so you just lost me because you won't up front. And guys I can't believe how many messages I get that mention wow you have real pics and show yourself - which tells me that alot of POT SD don't do that. So we all need to be upfront and avoid wasting time on both sides which just leads to disappointment. And Happy Holidays to All.",
            "author": "tallandbald63",
            "id": "fc1ap6m",
            "parent_id": "t3_efh8ye",
            "score": 2,
            "created_utc": 1577313128.0,
            "replies": []
        },
        {
            "body": "Off topic slightly - I had posted a few pics from the summer and when someone pointed out it look like a summer scene I said yes it was and in fact I've lost weight since than so I'm not the fat guy in the pic anymore as a joke. And she replied but I like the fat guy in the pic.",
            "author": "tallandbald63",
            "id": "fc1badd",
            "parent_id": "t3_efh8ye",
            "score": 2,
            "created_utc": 1577313624.0,
            "replies": []
        },
        {
            "body": "Eh, you're playing a losing game with this suggestion. No one is going to act in a way they feel is against their best self interest. They want to get as many people interested as possible. Guys aren't immune to this either obviously.",
            "author": "NoBromo3213",
            "id": "fc24n6o",
            "parent_id": "t3_efh8ye",
            "score": 2,
            "created_utc": 1577340248.0,
            "replies": []
        },
        {
            "body": "The comments here about people's bodies.\nI am hoping the same sta date a should apply for both men and women.",
            "author": "InfiniteTemptation",
            "id": "fc2o4oh",
            "parent_id": "t3_efh8ye",
            "score": 2,
            "created_utc": 1577368809.0,
            "replies": []
        },
        {
            "body": "Your post applies to SDs too, not just the women. I can't tell you how many SD profiles I see where the man's primary public photo (if he has one) is of himself younger, and then when he opens his private pics, you find pics of him clearly looking 10-15 years older which are the newer ones. Or, a mix of younger and older looking ones - if you don't look like the younger you with dark hair in your business suit anymore, then please don't include it. One POT SD I connected with had 10 photos of himself looking very much like a male model with an incredibly sculpted body and abs...except I noticed there was one single photo of him covered in a plaid shirt where his body looked noticeably much larger (like a good 100lbs larger). When we chatted, without me asking, he himself made the comment that he was 'fatter' these days. If that's the case, then why put all the inaccurate pictures up when he doesn't look like that anymore? 'Truth in advertising' applies to both sides.",
            "author": "Fizzledy01",
            "id": "fc2rb13",
            "parent_id": "t3_efh8ye",
            "score": 2,
            "created_utc": 1577371732.0,
            "replies": []
        },
        {
            "body": "I post a mix of glammed up and natural look and one exhausted work pic... Just to show that other end of the spectrum and that I work",
            "author": "deli_bae",
            "id": "fc1bfj9",
            "parent_id": "t3_efh8ye",
            "score": 2,
            "created_utc": 1577313748.0,
            "replies": []
        },
        {
            "body": "I'm so glad I haven't been asked boob/panties question. I don't wear underwear but I don't like to share that right out of the gate.  \n\n I agree on the pictures. Recent are best. I usually wear glasses so I have pics with and without. I also keep mine current. At least 2 public and the rest private. \n\nThe men do this too. Usually not posting any pics at all. Asking me to share more of my pics and still not sharing theirs. Asking for a pic makes me feel shallow and annoying and that's not cool. I dont let it get that far anymore.",
            "author": "Freckleface7",
            "id": "fc0rvu8",
            "parent_id": "t3_efh8ye",
            "score": 2,
            "created_utc": 1577298164.0,
            "replies": [
                {
                    "body": "I'm a SB, I have literally a dozen pics of me that clearly show my face and body in my profile, and I STILL get asked by POTs for more, when they only have a few and most of those don't even show them very well. I respond that there is a badge on my profile that shows I verified directly with SA that I look like my pictures and why do they need more? Too many guys are greedy when it comes to pics or just want to window shop without meeting. No thanks.",
                    "author": "Fizzledy01",
                    "id": "fc2qqvl",
                    "parent_id": "t1_fc0rvu8",
                    "score": 2,
                    "created_utc": 1577371242.0,
                    "replies": []
                },
                {
                    "body": "I feeeeeel that, it's so annoying when they expect you to completely put all your pictures out there when they won't even reveal their face to you.",
                    "author": "Apple_34_",
                    "id": "fc24c92",
                    "parent_id": "t1_fc0rvu8",
                    "score": 2,
                    "created_utc": 1577339891.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If only one post like this could end the universal plague that is catfishing.",
            "author": "bsbdfw",
            "id": "fc0sc2e",
            "parent_id": "t3_efh8ye",
            "score": 2,
            "created_utc": 1577298500.0,
            "replies": []
        },
        {
            "body": "People can put up what they’re comfortable with 😂. Why are you even talking",
            "author": "Guru5000",
            "id": "fc18qzm",
            "parent_id": "t3_efh8ye",
            "score": 2,
            "created_utc": 1577311491.0,
            "replies": [
                {
                    "body": "Because we don’t want to see 5 pictures with cat whiskers.",
                    "author": "throwawaysdaccount22",
                    "id": "fc1c2my",
                    "parent_id": "t1_fc18qzm",
                    "score": 0,
                    "created_utc": 1577314294.0,
                    "replies": [
                        {
                            "body": "Then get off the internet. Don’t need entitled men like you here anyway.",
                            "author": "Guru5000",
                            "id": "fc1c5sp",
                            "parent_id": "t1_fc1c2my",
                            "score": 1,
                            "created_utc": 1577314368.0,
                            "replies": [
                                {
                                    "body": "Talk about going completely off the deep end! All I’m saying is that when I’m browsing or when you send me pics off site make them accurate. I know I do and I get rejected for it. When I’m setting up something with you to possibly meet and talk about setting up a financial arrangement with you I want to see accurate pictures to avoid wasting each person’s time.\n\nMe asking to see accurate pictures and not you with dog ears isn’t entitled. Jeez.\n\nEdit: btw, remember he post I made a couple days ago about people calling out really piss poor behavior from their own side? This is one of those times.",
                                    "author": "throwawaysdaccount22",
                                    "id": "fc1ce8d",
                                    "parent_id": "t1_fc1c5sp",
                                    "score": 0,
                                    "created_utc": 1577314569.0,
                                    "replies": [
                                        {
                                            "body": "I'm not convinced he/she knows what sub they're in.",
                                            "author": "chefdaddy2019",
                                            "id": "fc1e2iz",
                                            "parent_id": "t1_fc1ce8d",
                                            "score": 4,
                                            "created_utc": 1577315988.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I honestly don't understand why people aren't transparent and an honest in their profiles and their pictures.  I guess what I mean is I don't understand why people come to these sites/groups with ulterior motives. \n Liars and scam artists thinking they're Frank Abagnale are going to be found out pretty quickly.",
            "author": "Freckleface7",
            "id": "fc2a2ox",
            "parent_id": "t3_efh8ye",
            "score": 1,
            "created_utc": 1577347952.0,
            "replies": []
        },
        {
            "body": "Of course, everybody wants to put up their most flattering pics. Men do this too. I've noticed many men use pics that are ridiculously old. Like, years and years old. If you can find a guy using a pic from this year... winner winner chicken dinner. \n\nI model. Many of my pics are professionally edited, yes. They still look like me, of course. Just the version of me that has spent time with a pro makeup artist, hairstylist, photographer, etc. I have a bit of an insecurity about it, since, believe it or not, I don't look like an airbrushed Victoria's Secret model 24/7, and I'm afraid guys on dates will be disappointed by my appearance if I look anything but. However, I've realized this is an anxiety I've made up in my own head, and I've never had a guy walk out on me saying I \"deceived\" him in any way :)",
            "author": "lizw47",
            "id": "fc491zs",
            "parent_id": "t3_efh8ye",
            "score": 1,
            "created_utc": 1577409926.0,
            "replies": []
        },
        {
            "body": "It kind of blows my mind when I see snap chat filters (dog ears, etc...) in tinder/bumble profiles, or SA profiles.",
            "author": "VanGeaux",
            "id": "fc0llht",
            "parent_id": "t3_efh8ye",
            "score": 0,
            "created_utc": 1577293861.0,
            "replies": []
        },
        {
            "body": "Yasss!! Bu-bye!",
            "author": "Freckleface7",
            "id": "fc24m2e",
            "parent_id": "t3_efh8ye",
            "score": 0,
            "created_utc": 1577340214.0,
            "replies": []
        },
        {
            "body": "in addition to everything that is said here, please use current photos too, unless you look exactly like youre old photos. I can't tell you how many times Ive gone to a meet and greet, and met someone with shorter hair, a different color hair, or an extra 30lbs since they took the photos.",
            "author": "ruphun",
            "id": "fc0by5x",
            "parent_id": "t3_efh8ye",
            "score": -4,
            "created_utc": 1577286365.0,
            "replies": [
                {
                    "body": "Just ask for a recent pic before meeting :) ask her for something within the last couple weeks",
                    "author": "redheadedbeautyxo",
                    "id": "fc0c72l",
                    "parent_id": "t1_fc0by5x",
                    "score": 6,
                    "created_utc": 1577286589.0,
                    "replies": []
                },
                {
                    "body": "If a different hair style or colour is make-or-break for you that kind of seems like a you problem",
                    "author": "AnitaDeKinmey",
                    "id": "fc1btv6",
                    "parent_id": "t1_fc0by5x",
                    "score": 2,
                    "created_utc": 1577314086.0,
                    "replies": [
                        {
                            "body": "No, not really? If a woman has long hair in her pics then comes with a super short cut, I probably won’t be interested as I don’t find that attractive. Color is less of a big deal unless she died it purple or something like that",
                            "author": "throwawaysdaccount22",
                            "id": "fc1c8bf",
                            "parent_id": "t1_fc1btv6",
                            "score": 1,
                            "created_utc": 1577314427.0,
                            "replies": []
                        },
                        {
                            "body": "Not really when she goes from long hair to really short hair, or dies it an unnatural color",
                            "author": "ruphun",
                            "id": "fc1dzuh",
                            "parent_id": "t1_fc1btv6",
                            "score": 0,
                            "created_utc": 1577315924.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This applies to the men too.",
                    "author": "Fizzledy01",
                    "id": "fc2qtrv",
                    "parent_id": "t1_fc0by5x",
                    "score": 1,
                    "created_utc": 1577371312.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This lol",
            "author": "OliviaWildflower2332",
            "id": "fc0h493",
            "parent_id": "t1_fc0dx6d",
            "score": 23,
            "created_utc": 1577290715.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fc0uxtv",
            "parent_id": "t1_fc0dx6d",
            "score": 4,
            "created_utc": 1577300293.0,
            "replies": [
                {
                    "body": "The people here don’t behave that way. 🙂",
                    "author": "SDforreal",
                    "id": "fc0v6lc",
                    "parent_id": "t1_fc0uxtv",
                    "score": 13,
                    "created_utc": 1577300487.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not necessarily. I’m pretty theres’s new people all the time.",
            "author": "Limitlesspappy",
            "id": "fc10341",
            "parent_id": "t1_fc0dx6d",
            "score": 5,
            "created_utc": 1577304424.0,
            "replies": []
        },
        {
            "body": "Same I usually send the most recent couple selfies including a no make up one. \n\nClothing sizes are so irrelevant anymore. I’ve noticed fewer request for my sizes in the past year think guys caught on.",
            "author": "knowswhatiwant",
            "id": "fc0btyn",
            "parent_id": "t1_fc0b3bc",
            "score": 19,
            "created_utc": 1577286256.0,
            "replies": [
                {
                    "body": "I frequently get the bra and panty size question after a meet and greet so they’ve clearly already seen my body 😂 strange question but I’m happy to comply if it means I may get some lingerie ~",
                    "author": "redheadedbeautyxo",
                    "id": "fc0c3ff",
                    "parent_id": "t1_fc0btyn",
                    "score": 8,
                    "created_utc": 1577286497.0,
                    "replies": [
                        {
                            "body": "When they ask your cup size I wanna say “oh are you doing a survey?”",
                            "author": "knowswhatiwant",
                            "id": "fc0c9k7",
                            "parent_id": "t1_fc0c3ff",
                            "score": 13,
                            "created_utc": 1577286652.0,
                            "replies": [
                                {
                                    "body": "Haha, it bothers you? I have no issue with it if it’s just a one time ask.\nThere was this one guy that told me from the start he was really into big boobs (which I have,) and he liked. I was fine with that. But then- for the next month I saw him (3 times in person and lots of texting,) all he did was talk about my breasts and I was sooo put off by it that I ended the SR. Otherwise, everything about him was great but bringing up my boobs three times in one date and ten times a week through text messaging was for some reason, a turn off I never knew I’d have.",
                                    "author": "redheadedbeautyxo",
                                    "id": "fc0cnwl",
                                    "parent_id": "t1_fc0c9k7",
                                    "score": 5,
                                    "created_utc": 1577287021.0,
                                    "replies": [
                                        {
                                            "body": "That’s awful! I danced with a girl with amazing natural boobs and had even been in playboy. We often did back rooms together and guys pretty much stopped seeing her as a person just breast. They would tug, pull, lick, tweak and every other non fun thing with them. I would just stand there trying to get them off her damn chest long enough to chill!!! \n\nIt’s not that it really bothers me it’s just subjective it’s not like they really really know a cup size. Hell I thought I was a B til i was 30 🤣",
                                            "author": "knowswhatiwant",
                                            "id": "fc0d0ai",
                                            "parent_id": "t1_fc0cnwl",
                                            "score": 10,
                                            "created_utc": 1577287336.0,
                                            "replies": [
                                                {
                                                    "body": "Haha yeah it’s so true! I literally respond to it as if it’s them needing my size for a gift and I’m like “I’m a 34DD but not at Victoria secret. Their bras aren’t big enough for me so I can’t wear them :( I really like Calvin Klein, DKNY, and bras from nice boutiques.  \n\nI’m usually a medium in panties and I only like thongs.” Lmao! Flip the script on them ;)",
                                                    "author": "redheadedbeautyxo",
                                                    "id": "fc0d9ks",
                                                    "parent_id": "t1_fc0d0ai",
                                                    "score": 12,
                                                    "created_utc": 1577287565.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "“Back rooms”?",
                                                    "author": "2fast-2curious",
                                                    "id": "fc0enyy",
                                                    "parent_id": "t1_fc0d0ai",
                                                    "score": -1,
                                                    "created_utc": 1577288810.0,
                                                    "replies": [
                                                        {
                                                            "body": "Private rooms. Not like a booth but a big room with a door. Still no sex but more lax on the touching policy. The high end clubs here the very wealthy like the privacy oh and they basically wanna do coke. Not much stage or floor action.\n\nEdit guys spare me the clubs are a waste or I had sex in the champagne room crap. Just answering a question and providing an example.",
                                                            "author": "knowswhatiwant",
                                                            "id": "fc0ey5g",
                                                            "parent_id": "t1_fc0enyy",
                                                            "score": 10,
                                                            "created_utc": 1577289056.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Hmmmm",
                                                                    "author": "InfiniteTemptation",
                                                                    "id": "fc2nr14",
                                                                    "parent_id": "t1_fc0ey5g",
                                                                    "score": 1,
                                                                    "created_utc": 1577368425.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Here’s the thing I danced in the Midwest, been to clubs around the country and danced Manhattan. Know how there are outliers even in this community certain places where allowances are super high well think of Manhattan Clubs as the outlier. They are absolutely not like any clubs in other cities. It’s apples and oranges to the rest of the country. No one tips stage or even cares about it....not much of a lap dance scene except for maybe a fri/sat. The places I worked most the clientele were hedge fund managers, celebrities and athletes who really don’t do anything in public. \n\nWhen I first moved here I thought it would be like it was back home OH GAWD nope guys just said let’s go to the back and that’s where we drank, danced and partied. Totally bananas. So it gets frustrating when people compare it to other parts of the country but hell I didn’t know what bottle service was til I moved here and def hadn’t even seen coke! \n\nIt just is what it is and back rooms were more of a discretion thing. Sting was a regular at the club hahaha amongst most of the Manhattan Forbes list guys. Also, dancers here know the importance of discretion and would never rat on a big fish. So the Uber wealthy feel way more comfortable and also the host guard their identities. Those guys aren’t on SA and def wouldn’t open themselves up to blackmail (the smart ones).\n\nI had a customer spend $250k in 6 weeks coming to see me. That wasn’t including the ridiculous tips he dropped. I moved to the marketing and promoting side and the nightly spend of one customer would be 5 to 12k low end. \n\nI hated the lifestyle though and wouldn’t go back. Much happier in sugar world.",
                                                                            "author": "knowswhatiwant",
                                                                            "id": "fc2srgi",
                                                                            "parent_id": "t1_fc2nr14",
                                                                            "score": 2,
                                                                            "created_utc": 1577372968.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Hahahaha @ sting was regular at the club.\nThat was a thing.",
                                                                                    "author": "InfiniteTemptation",
                                                                                    "id": "fc4d6ma",
                                                                                    "parent_id": "t1_fc2srgi",
                                                                                    "score": 2,
                                                                                    "created_utc": 1577413251.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Of all the regulars for some reason that’s the one that cracks me up the most bahahaha",
                                                                                            "author": "knowswhatiwant",
                                                                                            "id": "fc4e8zi",
                                                                                            "parent_id": "t1_fc4d6ma",
                                                                                            "score": 1,
                                                                                            "created_utc": 1577414133.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I think that's exactly the right attitude.  I would never ask bra and panty size so early on, right after a M&G seems in appropriately early to ask such an intimate question, but it IS a huge thrill when we do get to the point that I'm buying lingerie for you.  I'd rather shop for it together -- online or in store -- so don't  need sizes, but not everyone operates that way.  No reason to turn would could be a gift into a negative.",
                            "author": "Azurecole",
                            "id": "fc0eett",
                            "parent_id": "t1_fc0c3ff",
                            "score": 2,
                            "created_utc": 1577288588.0,
                            "replies": [
                                {
                                    "body": "I’ve had men buy me some atrocious lingerie I know exactly what fits my body. The outcome is much better if I choose",
                                    "author": "knowswhatiwant",
                                    "id": "fc14z0g",
                                    "parent_id": "t1_fc0eett",
                                    "score": 3,
                                    "created_utc": 1577308404.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I love that you send a no make up one.  \n\nYou’d get an automatic M&G from me if you are even marginally one of my body types.  \n\nConfidence is so fucking hot...",
                    "author": "BGDDDY1",
                    "id": "fc1qkkt",
                    "parent_id": "t1_fc0btyn",
                    "score": 0,
                    "created_utc": 1577326570.0,
                    "replies": [
                        {
                            "body": "Thank you I don’t wear much make up to begin with but love how I look especially in the mornings. Just want y’all to know what you’ll be waking up to 😉",
                            "author": "knowswhatiwant",
                            "id": "fc1qtcv",
                            "parent_id": "t1_fc1qkkt",
                            "score": 0,
                            "created_utc": 1577326794.0,
                            "replies": [
                                {
                                    "body": "OMG!  \n\nYou are making me rethink getting back in the bowl.😍",
                                    "author": "BGDDDY1",
                                    "id": "fc1qz5j",
                                    "parent_id": "t1_fc1qtcv",
                                    "score": 0,
                                    "created_utc": 1577326938.0,
                                    "replies": [
                                        {
                                            "body": "Why don’t ya come up and see me sometime 😉",
                                            "author": "knowswhatiwant",
                                            "id": "fc1ra2d",
                                            "parent_id": "t1_fc1qz5j",
                                            "score": -1,
                                            "created_utc": 1577327210.0,
                                            "replies": [
                                                {
                                                    "body": " I’ve got a bad feeling that you’d be well worth it.",
                                                    "author": "BGDDDY1",
                                                    "id": "fc1rjx5",
                                                    "parent_id": "t1_fc1ra2d",
                                                    "score": 0,
                                                    "created_utc": 1577327465.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fc0d025",
            "parent_id": "t1_fc0b3bc",
            "score": -5,
            "created_utc": 1577287330.0,
            "replies": [
                {
                    "body": "I love this coming from a guy. I have met someone who figured just because he’s a rich white guy giving the gifts I should be okay with his almost 400lbs weight. I politely told him I can’t go ahead with the meet and greet and then he went off. I’m not the thinnest or sexiest but I still have a type I’m attracted to regardless of whatever gift you are giving. And most guys don’t get this. So thank you for being reasonable.",
                    "author": null,
                    "id": "fc0stnc",
                    "parent_id": "t1_fc0d025",
                    "score": 6,
                    "created_utc": 1577298859.0,
                    "replies": [
                        {
                            "body": "On one hand, i certainly get it. I’m a bit overweight, 35, but not morbidly so and am balding. I get I’m not everyone’s type and I very much expect the college types to shy away from me as I know I’m not their type.\n\nOn the flip side, when a 30+ cute buy not drop dead POT immediately ghosts on me when I share my pics i tend to shake my head. I know it sounds terrible, but there are limitations I may have as to what I get even with money but the women have to sometimes realize that as well. Most of the guys on SA aren’t brad Pitt look alikes.",
                            "author": "throwawaysdaccount22",
                            "id": "fc1bzmw",
                            "parent_id": "t1_fc0stnc",
                            "score": 2,
                            "created_utc": 1577314222.0,
                            "replies": [
                                {
                                    "body": "Very well said most of the guys aren’t brad Pitt, we don’t expect brad Pitt or Liam hemsworth. Same way most of the girls are not Kim kardashian. But everyone has their type. Most guys just have this entitlement that because I’m bringing the gifts I can look like whatever.",
                                    "author": null,
                                    "id": "fc1cm8a",
                                    "parent_id": "t1_fc1bzmw",
                                    "score": 3,
                                    "created_utc": 1577314759.0,
                                    "replies": [
                                        {
                                            "body": "Yeah. I knew that would come off that way. Let me put it this way...I’d say I’m an average looking guy. An average looking 30 year old POT should probably not just immediately ghost on a guy who\nMight be interested and serious.",
                                            "author": "throwawaysdaccount22",
                                            "id": "fc1d35x",
                                            "parent_id": "t1_fc1cm8a",
                                            "score": 1,
                                            "created_utc": 1577315153.0,
                                            "replies": [
                                                {
                                                    "body": "Very true. Average looking isn’t bad because we are all average looking. What is sexy to you might be average to someone else. So at some point we have all been called average looking.",
                                                    "author": null,
                                                    "id": "fc1dej0",
                                                    "parent_id": "t1_fc1d35x",
                                                    "score": 2,
                                                    "created_utc": 1577315418.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah. I feel bad having this convo. I know I have my type too so it isn’t really fair.",
                                                            "author": "throwawaysdaccount22",
                                                            "id": "fc1dijj",
                                                            "parent_id": "t1_fc1dej0",
                                                            "score": 1,
                                                            "created_utc": 1577315514.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Lol it’s cool. So what’s your type?",
                                                                    "author": null,
                                                                    "id": "fc1djkx",
                                                                    "parent_id": "t1_fc1dijj",
                                                                    "score": 1,
                                                                    "created_utc": 1577315540.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Haha. Skinnier and petite.",
                                                                            "author": "throwawaysdaccount22",
                                                                            "id": "fc1fzhu",
                                                                            "parent_id": "t1_fc1djkx",
                                                                            "score": 1,
                                                                            "created_utc": 1577317625.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Lol so you see?",
                                                                                    "author": null,
                                                                                    "id": "fc1g112",
                                                                                    "parent_id": "t1_fc1fzhu",
                                                                                    "score": 1,
                                                                                    "created_utc": 1577317660.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fc0tvb7",
                            "parent_id": "t1_fc0stnc",
                            "score": 1,
                            "created_utc": 1577299550.0,
                            "replies": [
                                {
                                    "body": "Lol",
                                    "author": null,
                                    "id": "fc0u0pf",
                                    "parent_id": "t1_fc0tvb7",
                                    "score": 1,
                                    "created_utc": 1577299670.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah I agree entirely. I try to get my favorite pics while still showing my body and face clearly and having a varitey of pics. I probably have 10? I also give pics pretty freely ESPECIALLY if anything has changed at all.\n\nFor example, I’ve recently been wearing my hair in waves where as it is straight in 70% of my photos. I like to them send pics with the waves to someone I’m talking to and ask them which they prefer. A. It’s a recent pic. And B. I have no problem wearing it straight if they like it better :) \n\nI’ve never once been told that I look different than my profile picture aside from “I didn’t know you were so tall” (I’m 5 foot 8 and it’s written in my profile so that’s kind of on them 😂)",
                    "author": "redheadedbeautyxo",
                    "id": "fc0di4t",
                    "parent_id": "t1_fc0d025",
                    "score": 2,
                    "created_utc": 1577287778.0,
                    "replies": []
                },
                {
                    "body": "It's actually great to know there are SDs that care about genuine mutual attraction. Sometimes it seems like they're just looking for arm candy with a hole. :)",
                    "author": "Apple_34_",
                    "id": "fc23dns",
                    "parent_id": "t1_fc0d025",
                    "score": 1,
                    "created_utc": 1577338780.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Same here. When they say wow you look like/better than your pics I wonder how awful it is!",
            "author": "knowswhatiwant",
            "id": "fc1c79n",
            "parent_id": "t1_fc0v9x3",
            "score": 4,
            "created_utc": 1577314402.0,
            "replies": []
        },
        {
            "body": "Very true...",
            "author": null,
            "id": "fc0tvx3",
            "parent_id": "t1_fc0la7a",
            "score": 2,
            "created_utc": 1577299564.0,
            "replies": []
        },
        {
            "body": "Exactly 😂",
            "author": null,
            "id": "fc0se6d",
            "parent_id": "t1_fc0la7a",
            "score": 1,
            "created_utc": 1577298547.0,
            "replies": [
                {
                    "body": "liking your username ;)",
                    "author": "BratinaHat",
                    "id": "fc0shjw",
                    "parent_id": "t1_fc0se6d",
                    "score": 1,
                    "created_utc": 1577298623.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fair is fair, for sure. It's almost to the point of requiring a hostage proof of life photo.\n\n\"Send me a picture of you holding a newspaper with todays headlines on it, I'll send you a picture of me in the front of the local clocktower with today's date clearly visible\".\n\nSad but true.",
            "author": null,
            "id": "fc3uqcy",
            "parent_id": "t1_fc0la7a",
            "score": 0,
            "created_utc": 1577399128.0,
            "replies": []
        },
        {
            "body": "There are a lot of girls that were recently pretty slender that have not noticed or embraced the changes.  Some girls take liberty with the “Athletic” body type because they played soccer in High School 6 years ago.  Time flies.",
            "author": "LotBuilder",
            "id": "fc0okk7",
            "parent_id": "t1_fc0aup5",
            "score": 3,
            "created_utc": 1577295935.0,
            "replies": [
                {
                    "body": "Agreed.  Many take liberties.  Athletic body is fine if you’re athletic - toned and maybe a bit muscular.  Thick is not athletic.",
                    "author": "Jeffrey45429",
                    "id": "fc0owhl",
                    "parent_id": "t1_fc0okk7",
                    "score": 2,
                    "created_utc": 1577296152.0,
                    "replies": [
                        {
                            "body": "I’m very picky and basically don’t contact girls unless their pics include a bikini or crop top shot showing some ab definition.   Most girls that put in the work to look like that want to show it Off rather than hide it with angles and filters.",
                            "author": "LotBuilder",
                            "id": "fc0pjhg",
                            "parent_id": "t1_fc0owhl",
                            "score": -4,
                            "created_utc": 1577296579.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes to this! There is a wide variety of attraction out there.",
            "author": "OliviaWildflower2332",
            "id": "fc1yoj8",
            "parent_id": "t1_fc0sb0q",
            "score": 0,
            "created_utc": 1577333888.0,
            "replies": []
        },
        {
            "body": "I'm a SB, I have literally a dozen pics of me that clearly show my face and body in my profile, and I STILL get asked by POTs for more, when they only have a few and most of those don't even show them very well. I respond that there is a badge on my profile that shows I verified directly with SA that I look like my pictures and why do they need more? Too many guys are greedy when it comes to pics or just want to window shop without meeting. No thanks.",
            "author": "Fizzledy01",
            "id": "fc2qqvl",
            "parent_id": "t1_fc0rvu8",
            "score": 2,
            "created_utc": 1577371242.0,
            "replies": []
        },
        {
            "body": "I feeeeeel that, it's so annoying when they expect you to completely put all your pictures out there when they won't even reveal their face to you.",
            "author": "Apple_34_",
            "id": "fc24c92",
            "parent_id": "t1_fc0rvu8",
            "score": 2,
            "created_utc": 1577339891.0,
            "replies": []
        },
        {
            "body": "Because we don’t want to see 5 pictures with cat whiskers.",
            "author": "throwawaysdaccount22",
            "id": "fc1c2my",
            "parent_id": "t1_fc18qzm",
            "score": 0,
            "created_utc": 1577314294.0,
            "replies": [
                {
                    "body": "Then get off the internet. Don’t need entitled men like you here anyway.",
                    "author": "Guru5000",
                    "id": "fc1c5sp",
                    "parent_id": "t1_fc1c2my",
                    "score": 1,
                    "created_utc": 1577314368.0,
                    "replies": [
                        {
                            "body": "Talk about going completely off the deep end! All I’m saying is that when I’m browsing or when you send me pics off site make them accurate. I know I do and I get rejected for it. When I’m setting up something with you to possibly meet and talk about setting up a financial arrangement with you I want to see accurate pictures to avoid wasting each person’s time.\n\nMe asking to see accurate pictures and not you with dog ears isn’t entitled. Jeez.\n\nEdit: btw, remember he post I made a couple days ago about people calling out really piss poor behavior from their own side? This is one of those times.",
                            "author": "throwawaysdaccount22",
                            "id": "fc1ce8d",
                            "parent_id": "t1_fc1c5sp",
                            "score": 0,
                            "created_utc": 1577314569.0,
                            "replies": [
                                {
                                    "body": "I'm not convinced he/she knows what sub they're in.",
                                    "author": "chefdaddy2019",
                                    "id": "fc1e2iz",
                                    "parent_id": "t1_fc1ce8d",
                                    "score": 4,
                                    "created_utc": 1577315988.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just ask for a recent pic before meeting :) ask her for something within the last couple weeks",
            "author": "redheadedbeautyxo",
            "id": "fc0c72l",
            "parent_id": "t1_fc0by5x",
            "score": 6,
            "created_utc": 1577286589.0,
            "replies": []
        },
        {
            "body": "If a different hair style or colour is make-or-break for you that kind of seems like a you problem",
            "author": "AnitaDeKinmey",
            "id": "fc1btv6",
            "parent_id": "t1_fc0by5x",
            "score": 2,
            "created_utc": 1577314086.0,
            "replies": [
                {
                    "body": "No, not really? If a woman has long hair in her pics then comes with a super short cut, I probably won’t be interested as I don’t find that attractive. Color is less of a big deal unless she died it purple or something like that",
                    "author": "throwawaysdaccount22",
                    "id": "fc1c8bf",
                    "parent_id": "t1_fc1btv6",
                    "score": 1,
                    "created_utc": 1577314427.0,
                    "replies": []
                },
                {
                    "body": "Not really when she goes from long hair to really short hair, or dies it an unnatural color",
                    "author": "ruphun",
                    "id": "fc1dzuh",
                    "parent_id": "t1_fc1btv6",
                    "score": 0,
                    "created_utc": 1577315924.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This applies to the men too.",
            "author": "Fizzledy01",
            "id": "fc2qtrv",
            "parent_id": "t1_fc0by5x",
            "score": 1,
            "created_utc": 1577371312.0,
            "replies": []
        },
        {
            "body": "The people here don’t behave that way. 🙂",
            "author": "SDforreal",
            "id": "fc0v6lc",
            "parent_id": "t1_fc0uxtv",
            "score": 13,
            "created_utc": 1577300487.0,
            "replies": []
        },
        {
            "body": "I frequently get the bra and panty size question after a meet and greet so they’ve clearly already seen my body 😂 strange question but I’m happy to comply if it means I may get some lingerie ~",
            "author": "redheadedbeautyxo",
            "id": "fc0c3ff",
            "parent_id": "t1_fc0btyn",
            "score": 8,
            "created_utc": 1577286497.0,
            "replies": [
                {
                    "body": "When they ask your cup size I wanna say “oh are you doing a survey?”",
                    "author": "knowswhatiwant",
                    "id": "fc0c9k7",
                    "parent_id": "t1_fc0c3ff",
                    "score": 13,
                    "created_utc": 1577286652.0,
                    "replies": [
                        {
                            "body": "Haha, it bothers you? I have no issue with it if it’s just a one time ask.\nThere was this one guy that told me from the start he was really into big boobs (which I have,) and he liked. I was fine with that. But then- for the next month I saw him (3 times in person and lots of texting,) all he did was talk about my breasts and I was sooo put off by it that I ended the SR. Otherwise, everything about him was great but bringing up my boobs three times in one date and ten times a week through text messaging was for some reason, a turn off I never knew I’d have.",
                            "author": "redheadedbeautyxo",
                            "id": "fc0cnwl",
                            "parent_id": "t1_fc0c9k7",
                            "score": 5,
                            "created_utc": 1577287021.0,
                            "replies": [
                                {
                                    "body": "That’s awful! I danced with a girl with amazing natural boobs and had even been in playboy. We often did back rooms together and guys pretty much stopped seeing her as a person just breast. They would tug, pull, lick, tweak and every other non fun thing with them. I would just stand there trying to get them off her damn chest long enough to chill!!! \n\nIt’s not that it really bothers me it’s just subjective it’s not like they really really know a cup size. Hell I thought I was a B til i was 30 🤣",
                                    "author": "knowswhatiwant",
                                    "id": "fc0d0ai",
                                    "parent_id": "t1_fc0cnwl",
                                    "score": 10,
                                    "created_utc": 1577287336.0,
                                    "replies": [
                                        {
                                            "body": "Haha yeah it’s so true! I literally respond to it as if it’s them needing my size for a gift and I’m like “I’m a 34DD but not at Victoria secret. Their bras aren’t big enough for me so I can’t wear them :( I really like Calvin Klein, DKNY, and bras from nice boutiques.  \n\nI’m usually a medium in panties and I only like thongs.” Lmao! Flip the script on them ;)",
                                            "author": "redheadedbeautyxo",
                                            "id": "fc0d9ks",
                                            "parent_id": "t1_fc0d0ai",
                                            "score": 12,
                                            "created_utc": 1577287565.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "“Back rooms”?",
                                            "author": "2fast-2curious",
                                            "id": "fc0enyy",
                                            "parent_id": "t1_fc0d0ai",
                                            "score": -1,
                                            "created_utc": 1577288810.0,
                                            "replies": [
                                                {
                                                    "body": "Private rooms. Not like a booth but a big room with a door. Still no sex but more lax on the touching policy. The high end clubs here the very wealthy like the privacy oh and they basically wanna do coke. Not much stage or floor action.\n\nEdit guys spare me the clubs are a waste or I had sex in the champagne room crap. Just answering a question and providing an example.",
                                                    "author": "knowswhatiwant",
                                                    "id": "fc0ey5g",
                                                    "parent_id": "t1_fc0enyy",
                                                    "score": 10,
                                                    "created_utc": 1577289056.0,
                                                    "replies": [
                                                        {
                                                            "body": "Hmmmm",
                                                            "author": "InfiniteTemptation",
                                                            "id": "fc2nr14",
                                                            "parent_id": "t1_fc0ey5g",
                                                            "score": 1,
                                                            "created_utc": 1577368425.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Here’s the thing I danced in the Midwest, been to clubs around the country and danced Manhattan. Know how there are outliers even in this community certain places where allowances are super high well think of Manhattan Clubs as the outlier. They are absolutely not like any clubs in other cities. It’s apples and oranges to the rest of the country. No one tips stage or even cares about it....not much of a lap dance scene except for maybe a fri/sat. The places I worked most the clientele were hedge fund managers, celebrities and athletes who really don’t do anything in public. \n\nWhen I first moved here I thought it would be like it was back home OH GAWD nope guys just said let’s go to the back and that’s where we drank, danced and partied. Totally bananas. So it gets frustrating when people compare it to other parts of the country but hell I didn’t know what bottle service was til I moved here and def hadn’t even seen coke! \n\nIt just is what it is and back rooms were more of a discretion thing. Sting was a regular at the club hahaha amongst most of the Manhattan Forbes list guys. Also, dancers here know the importance of discretion and would never rat on a big fish. So the Uber wealthy feel way more comfortable and also the host guard their identities. Those guys aren’t on SA and def wouldn’t open themselves up to blackmail (the smart ones).\n\nI had a customer spend $250k in 6 weeks coming to see me. That wasn’t including the ridiculous tips he dropped. I moved to the marketing and promoting side and the nightly spend of one customer would be 5 to 12k low end. \n\nI hated the lifestyle though and wouldn’t go back. Much happier in sugar world.",
                                                                    "author": "knowswhatiwant",
                                                                    "id": "fc2srgi",
                                                                    "parent_id": "t1_fc2nr14",
                                                                    "score": 2,
                                                                    "created_utc": 1577372968.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Hahahaha @ sting was regular at the club.\nThat was a thing.",
                                                                            "author": "InfiniteTemptation",
                                                                            "id": "fc4d6ma",
                                                                            "parent_id": "t1_fc2srgi",
                                                                            "score": 2,
                                                                            "created_utc": 1577413251.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Of all the regulars for some reason that’s the one that cracks me up the most bahahaha",
                                                                                    "author": "knowswhatiwant",
                                                                                    "id": "fc4e8zi",
                                                                                    "parent_id": "t1_fc4d6ma",
                                                                                    "score": 1,
                                                                                    "created_utc": 1577414133.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I think that's exactly the right attitude.  I would never ask bra and panty size so early on, right after a M&G seems in appropriately early to ask such an intimate question, but it IS a huge thrill when we do get to the point that I'm buying lingerie for you.  I'd rather shop for it together -- online or in store -- so don't  need sizes, but not everyone operates that way.  No reason to turn would could be a gift into a negative.",
                    "author": "Azurecole",
                    "id": "fc0eett",
                    "parent_id": "t1_fc0c3ff",
                    "score": 2,
                    "created_utc": 1577288588.0,
                    "replies": [
                        {
                            "body": "I’ve had men buy me some atrocious lingerie I know exactly what fits my body. The outcome is much better if I choose",
                            "author": "knowswhatiwant",
                            "id": "fc14z0g",
                            "parent_id": "t1_fc0eett",
                            "score": 3,
                            "created_utc": 1577308404.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love that you send a no make up one.  \n\nYou’d get an automatic M&G from me if you are even marginally one of my body types.  \n\nConfidence is so fucking hot...",
            "author": "BGDDDY1",
            "id": "fc1qkkt",
            "parent_id": "t1_fc0btyn",
            "score": 0,
            "created_utc": 1577326570.0,
            "replies": [
                {
                    "body": "Thank you I don’t wear much make up to begin with but love how I look especially in the mornings. Just want y’all to know what you’ll be waking up to 😉",
                    "author": "knowswhatiwant",
                    "id": "fc1qtcv",
                    "parent_id": "t1_fc1qkkt",
                    "score": 0,
                    "created_utc": 1577326794.0,
                    "replies": [
                        {
                            "body": "OMG!  \n\nYou are making me rethink getting back in the bowl.😍",
                            "author": "BGDDDY1",
                            "id": "fc1qz5j",
                            "parent_id": "t1_fc1qtcv",
                            "score": 0,
                            "created_utc": 1577326938.0,
                            "replies": [
                                {
                                    "body": "Why don’t ya come up and see me sometime 😉",
                                    "author": "knowswhatiwant",
                                    "id": "fc1ra2d",
                                    "parent_id": "t1_fc1qz5j",
                                    "score": -1,
                                    "created_utc": 1577327210.0,
                                    "replies": [
                                        {
                                            "body": " I’ve got a bad feeling that you’d be well worth it.",
                                            "author": "BGDDDY1",
                                            "id": "fc1rjx5",
                                            "parent_id": "t1_fc1ra2d",
                                            "score": 0,
                                            "created_utc": 1577327465.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love this coming from a guy. I have met someone who figured just because he’s a rich white guy giving the gifts I should be okay with his almost 400lbs weight. I politely told him I can’t go ahead with the meet and greet and then he went off. I’m not the thinnest or sexiest but I still have a type I’m attracted to regardless of whatever gift you are giving. And most guys don’t get this. So thank you for being reasonable.",
            "author": null,
            "id": "fc0stnc",
            "parent_id": "t1_fc0d025",
            "score": 6,
            "created_utc": 1577298859.0,
            "replies": [
                {
                    "body": "On one hand, i certainly get it. I’m a bit overweight, 35, but not morbidly so and am balding. I get I’m not everyone’s type and I very much expect the college types to shy away from me as I know I’m not their type.\n\nOn the flip side, when a 30+ cute buy not drop dead POT immediately ghosts on me when I share my pics i tend to shake my head. I know it sounds terrible, but there are limitations I may have as to what I get even with money but the women have to sometimes realize that as well. Most of the guys on SA aren’t brad Pitt look alikes.",
                    "author": "throwawaysdaccount22",
                    "id": "fc1bzmw",
                    "parent_id": "t1_fc0stnc",
                    "score": 2,
                    "created_utc": 1577314222.0,
                    "replies": [
                        {
                            "body": "Very well said most of the guys aren’t brad Pitt, we don’t expect brad Pitt or Liam hemsworth. Same way most of the girls are not Kim kardashian. But everyone has their type. Most guys just have this entitlement that because I’m bringing the gifts I can look like whatever.",
                            "author": null,
                            "id": "fc1cm8a",
                            "parent_id": "t1_fc1bzmw",
                            "score": 3,
                            "created_utc": 1577314759.0,
                            "replies": [
                                {
                                    "body": "Yeah. I knew that would come off that way. Let me put it this way...I’d say I’m an average looking guy. An average looking 30 year old POT should probably not just immediately ghost on a guy who\nMight be interested and serious.",
                                    "author": "throwawaysdaccount22",
                                    "id": "fc1d35x",
                                    "parent_id": "t1_fc1cm8a",
                                    "score": 1,
                                    "created_utc": 1577315153.0,
                                    "replies": [
                                        {
                                            "body": "Very true. Average looking isn’t bad because we are all average looking. What is sexy to you might be average to someone else. So at some point we have all been called average looking.",
                                            "author": null,
                                            "id": "fc1dej0",
                                            "parent_id": "t1_fc1d35x",
                                            "score": 2,
                                            "created_utc": 1577315418.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah. I feel bad having this convo. I know I have my type too so it isn’t really fair.",
                                                    "author": "throwawaysdaccount22",
                                                    "id": "fc1dijj",
                                                    "parent_id": "t1_fc1dej0",
                                                    "score": 1,
                                                    "created_utc": 1577315514.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lol it’s cool. So what’s your type?",
                                                            "author": null,
                                                            "id": "fc1djkx",
                                                            "parent_id": "t1_fc1dijj",
                                                            "score": 1,
                                                            "created_utc": 1577315540.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Haha. Skinnier and petite.",
                                                                    "author": "throwawaysdaccount22",
                                                                    "id": "fc1fzhu",
                                                                    "parent_id": "t1_fc1djkx",
                                                                    "score": 1,
                                                                    "created_utc": 1577317625.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Lol so you see?",
                                                                            "author": null,
                                                                            "id": "fc1g112",
                                                                            "parent_id": "t1_fc1fzhu",
                                                                            "score": 1,
                                                                            "created_utc": 1577317660.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fc0tvb7",
                    "parent_id": "t1_fc0stnc",
                    "score": 1,
                    "created_utc": 1577299550.0,
                    "replies": [
                        {
                            "body": "Lol",
                            "author": null,
                            "id": "fc0u0pf",
                            "parent_id": "t1_fc0tvb7",
                            "score": 1,
                            "created_utc": 1577299670.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah I agree entirely. I try to get my favorite pics while still showing my body and face clearly and having a varitey of pics. I probably have 10? I also give pics pretty freely ESPECIALLY if anything has changed at all.\n\nFor example, I’ve recently been wearing my hair in waves where as it is straight in 70% of my photos. I like to them send pics with the waves to someone I’m talking to and ask them which they prefer. A. It’s a recent pic. And B. I have no problem wearing it straight if they like it better :) \n\nI’ve never once been told that I look different than my profile picture aside from “I didn’t know you were so tall” (I’m 5 foot 8 and it’s written in my profile so that’s kind of on them 😂)",
            "author": "redheadedbeautyxo",
            "id": "fc0di4t",
            "parent_id": "t1_fc0d025",
            "score": 2,
            "created_utc": 1577287778.0,
            "replies": []
        },
        {
            "body": "It's actually great to know there are SDs that care about genuine mutual attraction. Sometimes it seems like they're just looking for arm candy with a hole. :)",
            "author": "Apple_34_",
            "id": "fc23dns",
            "parent_id": "t1_fc0d025",
            "score": 1,
            "created_utc": 1577338780.0,
            "replies": []
        },
        {
            "body": "liking your username ;)",
            "author": "BratinaHat",
            "id": "fc0shjw",
            "parent_id": "t1_fc0se6d",
            "score": 1,
            "created_utc": 1577298623.0,
            "replies": []
        },
        {
            "body": "Agreed.  Many take liberties.  Athletic body is fine if you’re athletic - toned and maybe a bit muscular.  Thick is not athletic.",
            "author": "Jeffrey45429",
            "id": "fc0owhl",
            "parent_id": "t1_fc0okk7",
            "score": 2,
            "created_utc": 1577296152.0,
            "replies": [
                {
                    "body": "I’m very picky and basically don’t contact girls unless their pics include a bikini or crop top shot showing some ab definition.   Most girls that put in the work to look like that want to show it Off rather than hide it with angles and filters.",
                    "author": "LotBuilder",
                    "id": "fc0pjhg",
                    "parent_id": "t1_fc0owhl",
                    "score": -4,
                    "created_utc": 1577296579.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Then get off the internet. Don’t need entitled men like you here anyway.",
            "author": "Guru5000",
            "id": "fc1c5sp",
            "parent_id": "t1_fc1c2my",
            "score": 1,
            "created_utc": 1577314368.0,
            "replies": [
                {
                    "body": "Talk about going completely off the deep end! All I’m saying is that when I’m browsing or when you send me pics off site make them accurate. I know I do and I get rejected for it. When I’m setting up something with you to possibly meet and talk about setting up a financial arrangement with you I want to see accurate pictures to avoid wasting each person’s time.\n\nMe asking to see accurate pictures and not you with dog ears isn’t entitled. Jeez.\n\nEdit: btw, remember he post I made a couple days ago about people calling out really piss poor behavior from their own side? This is one of those times.",
                    "author": "throwawaysdaccount22",
                    "id": "fc1ce8d",
                    "parent_id": "t1_fc1c5sp",
                    "score": 0,
                    "created_utc": 1577314569.0,
                    "replies": [
                        {
                            "body": "I'm not convinced he/she knows what sub they're in.",
                            "author": "chefdaddy2019",
                            "id": "fc1e2iz",
                            "parent_id": "t1_fc1ce8d",
                            "score": 4,
                            "created_utc": 1577315988.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No, not really? If a woman has long hair in her pics then comes with a super short cut, I probably won’t be interested as I don’t find that attractive. Color is less of a big deal unless she died it purple or something like that",
            "author": "throwawaysdaccount22",
            "id": "fc1c8bf",
            "parent_id": "t1_fc1btv6",
            "score": 1,
            "created_utc": 1577314427.0,
            "replies": []
        },
        {
            "body": "Not really when she goes from long hair to really short hair, or dies it an unnatural color",
            "author": "ruphun",
            "id": "fc1dzuh",
            "parent_id": "t1_fc1btv6",
            "score": 0,
            "created_utc": 1577315924.0,
            "replies": []
        },
        {
            "body": "When they ask your cup size I wanna say “oh are you doing a survey?”",
            "author": "knowswhatiwant",
            "id": "fc0c9k7",
            "parent_id": "t1_fc0c3ff",
            "score": 13,
            "created_utc": 1577286652.0,
            "replies": [
                {
                    "body": "Haha, it bothers you? I have no issue with it if it’s just a one time ask.\nThere was this one guy that told me from the start he was really into big boobs (which I have,) and he liked. I was fine with that. But then- for the next month I saw him (3 times in person and lots of texting,) all he did was talk about my breasts and I was sooo put off by it that I ended the SR. Otherwise, everything about him was great but bringing up my boobs three times in one date and ten times a week through text messaging was for some reason, a turn off I never knew I’d have.",
                    "author": "redheadedbeautyxo",
                    "id": "fc0cnwl",
                    "parent_id": "t1_fc0c9k7",
                    "score": 5,
                    "created_utc": 1577287021.0,
                    "replies": [
                        {
                            "body": "That’s awful! I danced with a girl with amazing natural boobs and had even been in playboy. We often did back rooms together and guys pretty much stopped seeing her as a person just breast. They would tug, pull, lick, tweak and every other non fun thing with them. I would just stand there trying to get them off her damn chest long enough to chill!!! \n\nIt’s not that it really bothers me it’s just subjective it’s not like they really really know a cup size. Hell I thought I was a B til i was 30 🤣",
                            "author": "knowswhatiwant",
                            "id": "fc0d0ai",
                            "parent_id": "t1_fc0cnwl",
                            "score": 10,
                            "created_utc": 1577287336.0,
                            "replies": [
                                {
                                    "body": "Haha yeah it’s so true! I literally respond to it as if it’s them needing my size for a gift and I’m like “I’m a 34DD but not at Victoria secret. Their bras aren’t big enough for me so I can’t wear them :( I really like Calvin Klein, DKNY, and bras from nice boutiques.  \n\nI’m usually a medium in panties and I only like thongs.” Lmao! Flip the script on them ;)",
                                    "author": "redheadedbeautyxo",
                                    "id": "fc0d9ks",
                                    "parent_id": "t1_fc0d0ai",
                                    "score": 12,
                                    "created_utc": 1577287565.0,
                                    "replies": []
                                },
                                {
                                    "body": "“Back rooms”?",
                                    "author": "2fast-2curious",
                                    "id": "fc0enyy",
                                    "parent_id": "t1_fc0d0ai",
                                    "score": -1,
                                    "created_utc": 1577288810.0,
                                    "replies": [
                                        {
                                            "body": "Private rooms. Not like a booth but a big room with a door. Still no sex but more lax on the touching policy. The high end clubs here the very wealthy like the privacy oh and they basically wanna do coke. Not much stage or floor action.\n\nEdit guys spare me the clubs are a waste or I had sex in the champagne room crap. Just answering a question and providing an example.",
                                            "author": "knowswhatiwant",
                                            "id": "fc0ey5g",
                                            "parent_id": "t1_fc0enyy",
                                            "score": 10,
                                            "created_utc": 1577289056.0,
                                            "replies": [
                                                {
                                                    "body": "Hmmmm",
                                                    "author": "InfiniteTemptation",
                                                    "id": "fc2nr14",
                                                    "parent_id": "t1_fc0ey5g",
                                                    "score": 1,
                                                    "created_utc": 1577368425.0,
                                                    "replies": [
                                                        {
                                                            "body": "Here’s the thing I danced in the Midwest, been to clubs around the country and danced Manhattan. Know how there are outliers even in this community certain places where allowances are super high well think of Manhattan Clubs as the outlier. They are absolutely not like any clubs in other cities. It’s apples and oranges to the rest of the country. No one tips stage or even cares about it....not much of a lap dance scene except for maybe a fri/sat. The places I worked most the clientele were hedge fund managers, celebrities and athletes who really don’t do anything in public. \n\nWhen I first moved here I thought it would be like it was back home OH GAWD nope guys just said let’s go to the back and that’s where we drank, danced and partied. Totally bananas. So it gets frustrating when people compare it to other parts of the country but hell I didn’t know what bottle service was til I moved here and def hadn’t even seen coke! \n\nIt just is what it is and back rooms were more of a discretion thing. Sting was a regular at the club hahaha amongst most of the Manhattan Forbes list guys. Also, dancers here know the importance of discretion and would never rat on a big fish. So the Uber wealthy feel way more comfortable and also the host guard their identities. Those guys aren’t on SA and def wouldn’t open themselves up to blackmail (the smart ones).\n\nI had a customer spend $250k in 6 weeks coming to see me. That wasn’t including the ridiculous tips he dropped. I moved to the marketing and promoting side and the nightly spend of one customer would be 5 to 12k low end. \n\nI hated the lifestyle though and wouldn’t go back. Much happier in sugar world.",
                                                            "author": "knowswhatiwant",
                                                            "id": "fc2srgi",
                                                            "parent_id": "t1_fc2nr14",
                                                            "score": 2,
                                                            "created_utc": 1577372968.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Hahahaha @ sting was regular at the club.\nThat was a thing.",
                                                                    "author": "InfiniteTemptation",
                                                                    "id": "fc4d6ma",
                                                                    "parent_id": "t1_fc2srgi",
                                                                    "score": 2,
                                                                    "created_utc": 1577413251.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Of all the regulars for some reason that’s the one that cracks me up the most bahahaha",
                                                                            "author": "knowswhatiwant",
                                                                            "id": "fc4e8zi",
                                                                            "parent_id": "t1_fc4d6ma",
                                                                            "score": 1,
                                                                            "created_utc": 1577414133.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think that's exactly the right attitude.  I would never ask bra and panty size so early on, right after a M&G seems in appropriately early to ask such an intimate question, but it IS a huge thrill when we do get to the point that I'm buying lingerie for you.  I'd rather shop for it together -- online or in store -- so don't  need sizes, but not everyone operates that way.  No reason to turn would could be a gift into a negative.",
            "author": "Azurecole",
            "id": "fc0eett",
            "parent_id": "t1_fc0c3ff",
            "score": 2,
            "created_utc": 1577288588.0,
            "replies": [
                {
                    "body": "I’ve had men buy me some atrocious lingerie I know exactly what fits my body. The outcome is much better if I choose",
                    "author": "knowswhatiwant",
                    "id": "fc14z0g",
                    "parent_id": "t1_fc0eett",
                    "score": 3,
                    "created_utc": 1577308404.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you I don’t wear much make up to begin with but love how I look especially in the mornings. Just want y’all to know what you’ll be waking up to 😉",
            "author": "knowswhatiwant",
            "id": "fc1qtcv",
            "parent_id": "t1_fc1qkkt",
            "score": 0,
            "created_utc": 1577326794.0,
            "replies": [
                {
                    "body": "OMG!  \n\nYou are making me rethink getting back in the bowl.😍",
                    "author": "BGDDDY1",
                    "id": "fc1qz5j",
                    "parent_id": "t1_fc1qtcv",
                    "score": 0,
                    "created_utc": 1577326938.0,
                    "replies": [
                        {
                            "body": "Why don’t ya come up and see me sometime 😉",
                            "author": "knowswhatiwant",
                            "id": "fc1ra2d",
                            "parent_id": "t1_fc1qz5j",
                            "score": -1,
                            "created_utc": 1577327210.0,
                            "replies": [
                                {
                                    "body": " I’ve got a bad feeling that you’d be well worth it.",
                                    "author": "BGDDDY1",
                                    "id": "fc1rjx5",
                                    "parent_id": "t1_fc1ra2d",
                                    "score": 0,
                                    "created_utc": 1577327465.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "On one hand, i certainly get it. I’m a bit overweight, 35, but not morbidly so and am balding. I get I’m not everyone’s type and I very much expect the college types to shy away from me as I know I’m not their type.\n\nOn the flip side, when a 30+ cute buy not drop dead POT immediately ghosts on me when I share my pics i tend to shake my head. I know it sounds terrible, but there are limitations I may have as to what I get even with money but the women have to sometimes realize that as well. Most of the guys on SA aren’t brad Pitt look alikes.",
            "author": "throwawaysdaccount22",
            "id": "fc1bzmw",
            "parent_id": "t1_fc0stnc",
            "score": 2,
            "created_utc": 1577314222.0,
            "replies": [
                {
                    "body": "Very well said most of the guys aren’t brad Pitt, we don’t expect brad Pitt or Liam hemsworth. Same way most of the girls are not Kim kardashian. But everyone has their type. Most guys just have this entitlement that because I’m bringing the gifts I can look like whatever.",
                    "author": null,
                    "id": "fc1cm8a",
                    "parent_id": "t1_fc1bzmw",
                    "score": 3,
                    "created_utc": 1577314759.0,
                    "replies": [
                        {
                            "body": "Yeah. I knew that would come off that way. Let me put it this way...I’d say I’m an average looking guy. An average looking 30 year old POT should probably not just immediately ghost on a guy who\nMight be interested and serious.",
                            "author": "throwawaysdaccount22",
                            "id": "fc1d35x",
                            "parent_id": "t1_fc1cm8a",
                            "score": 1,
                            "created_utc": 1577315153.0,
                            "replies": [
                                {
                                    "body": "Very true. Average looking isn’t bad because we are all average looking. What is sexy to you might be average to someone else. So at some point we have all been called average looking.",
                                    "author": null,
                                    "id": "fc1dej0",
                                    "parent_id": "t1_fc1d35x",
                                    "score": 2,
                                    "created_utc": 1577315418.0,
                                    "replies": [
                                        {
                                            "body": "Yeah. I feel bad having this convo. I know I have my type too so it isn’t really fair.",
                                            "author": "throwawaysdaccount22",
                                            "id": "fc1dijj",
                                            "parent_id": "t1_fc1dej0",
                                            "score": 1,
                                            "created_utc": 1577315514.0,
                                            "replies": [
                                                {
                                                    "body": "Lol it’s cool. So what’s your type?",
                                                    "author": null,
                                                    "id": "fc1djkx",
                                                    "parent_id": "t1_fc1dijj",
                                                    "score": 1,
                                                    "created_utc": 1577315540.0,
                                                    "replies": [
                                                        {
                                                            "body": "Haha. Skinnier and petite.",
                                                            "author": "throwawaysdaccount22",
                                                            "id": "fc1fzhu",
                                                            "parent_id": "t1_fc1djkx",
                                                            "score": 1,
                                                            "created_utc": 1577317625.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Lol so you see?",
                                                                    "author": null,
                                                                    "id": "fc1g112",
                                                                    "parent_id": "t1_fc1fzhu",
                                                                    "score": 1,
                                                                    "created_utc": 1577317660.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fc0tvb7",
            "parent_id": "t1_fc0stnc",
            "score": 1,
            "created_utc": 1577299550.0,
            "replies": [
                {
                    "body": "Lol",
                    "author": null,
                    "id": "fc0u0pf",
                    "parent_id": "t1_fc0tvb7",
                    "score": 1,
                    "created_utc": 1577299670.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m very picky and basically don’t contact girls unless their pics include a bikini or crop top shot showing some ab definition.   Most girls that put in the work to look like that want to show it Off rather than hide it with angles and filters.",
            "author": "LotBuilder",
            "id": "fc0pjhg",
            "parent_id": "t1_fc0owhl",
            "score": -4,
            "created_utc": 1577296579.0,
            "replies": []
        },
        {
            "body": "Talk about going completely off the deep end! All I’m saying is that when I’m browsing or when you send me pics off site make them accurate. I know I do and I get rejected for it. When I’m setting up something with you to possibly meet and talk about setting up a financial arrangement with you I want to see accurate pictures to avoid wasting each person’s time.\n\nMe asking to see accurate pictures and not you with dog ears isn’t entitled. Jeez.\n\nEdit: btw, remember he post I made a couple days ago about people calling out really piss poor behavior from their own side? This is one of those times.",
            "author": "throwawaysdaccount22",
            "id": "fc1ce8d",
            "parent_id": "t1_fc1c5sp",
            "score": 0,
            "created_utc": 1577314569.0,
            "replies": [
                {
                    "body": "I'm not convinced he/she knows what sub they're in.",
                    "author": "chefdaddy2019",
                    "id": "fc1e2iz",
                    "parent_id": "t1_fc1ce8d",
                    "score": 4,
                    "created_utc": 1577315988.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haha, it bothers you? I have no issue with it if it’s just a one time ask.\nThere was this one guy that told me from the start he was really into big boobs (which I have,) and he liked. I was fine with that. But then- for the next month I saw him (3 times in person and lots of texting,) all he did was talk about my breasts and I was sooo put off by it that I ended the SR. Otherwise, everything about him was great but bringing up my boobs three times in one date and ten times a week through text messaging was for some reason, a turn off I never knew I’d have.",
            "author": "redheadedbeautyxo",
            "id": "fc0cnwl",
            "parent_id": "t1_fc0c9k7",
            "score": 5,
            "created_utc": 1577287021.0,
            "replies": [
                {
                    "body": "That’s awful! I danced with a girl with amazing natural boobs and had even been in playboy. We often did back rooms together and guys pretty much stopped seeing her as a person just breast. They would tug, pull, lick, tweak and every other non fun thing with them. I would just stand there trying to get them off her damn chest long enough to chill!!! \n\nIt’s not that it really bothers me it’s just subjective it’s not like they really really know a cup size. Hell I thought I was a B til i was 30 🤣",
                    "author": "knowswhatiwant",
                    "id": "fc0d0ai",
                    "parent_id": "t1_fc0cnwl",
                    "score": 10,
                    "created_utc": 1577287336.0,
                    "replies": [
                        {
                            "body": "Haha yeah it’s so true! I literally respond to it as if it’s them needing my size for a gift and I’m like “I’m a 34DD but not at Victoria secret. Their bras aren’t big enough for me so I can’t wear them :( I really like Calvin Klein, DKNY, and bras from nice boutiques.  \n\nI’m usually a medium in panties and I only like thongs.” Lmao! Flip the script on them ;)",
                            "author": "redheadedbeautyxo",
                            "id": "fc0d9ks",
                            "parent_id": "t1_fc0d0ai",
                            "score": 12,
                            "created_utc": 1577287565.0,
                            "replies": []
                        },
                        {
                            "body": "“Back rooms”?",
                            "author": "2fast-2curious",
                            "id": "fc0enyy",
                            "parent_id": "t1_fc0d0ai",
                            "score": -1,
                            "created_utc": 1577288810.0,
                            "replies": [
                                {
                                    "body": "Private rooms. Not like a booth but a big room with a door. Still no sex but more lax on the touching policy. The high end clubs here the very wealthy like the privacy oh and they basically wanna do coke. Not much stage or floor action.\n\nEdit guys spare me the clubs are a waste or I had sex in the champagne room crap. Just answering a question and providing an example.",
                                    "author": "knowswhatiwant",
                                    "id": "fc0ey5g",
                                    "parent_id": "t1_fc0enyy",
                                    "score": 10,
                                    "created_utc": 1577289056.0,
                                    "replies": [
                                        {
                                            "body": "Hmmmm",
                                            "author": "InfiniteTemptation",
                                            "id": "fc2nr14",
                                            "parent_id": "t1_fc0ey5g",
                                            "score": 1,
                                            "created_utc": 1577368425.0,
                                            "replies": [
                                                {
                                                    "body": "Here’s the thing I danced in the Midwest, been to clubs around the country and danced Manhattan. Know how there are outliers even in this community certain places where allowances are super high well think of Manhattan Clubs as the outlier. They are absolutely not like any clubs in other cities. It’s apples and oranges to the rest of the country. No one tips stage or even cares about it....not much of a lap dance scene except for maybe a fri/sat. The places I worked most the clientele were hedge fund managers, celebrities and athletes who really don’t do anything in public. \n\nWhen I first moved here I thought it would be like it was back home OH GAWD nope guys just said let’s go to the back and that’s where we drank, danced and partied. Totally bananas. So it gets frustrating when people compare it to other parts of the country but hell I didn’t know what bottle service was til I moved here and def hadn’t even seen coke! \n\nIt just is what it is and back rooms were more of a discretion thing. Sting was a regular at the club hahaha amongst most of the Manhattan Forbes list guys. Also, dancers here know the importance of discretion and would never rat on a big fish. So the Uber wealthy feel way more comfortable and also the host guard their identities. Those guys aren’t on SA and def wouldn’t open themselves up to blackmail (the smart ones).\n\nI had a customer spend $250k in 6 weeks coming to see me. That wasn’t including the ridiculous tips he dropped. I moved to the marketing and promoting side and the nightly spend of one customer would be 5 to 12k low end. \n\nI hated the lifestyle though and wouldn’t go back. Much happier in sugar world.",
                                                    "author": "knowswhatiwant",
                                                    "id": "fc2srgi",
                                                    "parent_id": "t1_fc2nr14",
                                                    "score": 2,
                                                    "created_utc": 1577372968.0,
                                                    "replies": [
                                                        {
                                                            "body": "Hahahaha @ sting was regular at the club.\nThat was a thing.",
                                                            "author": "InfiniteTemptation",
                                                            "id": "fc4d6ma",
                                                            "parent_id": "t1_fc2srgi",
                                                            "score": 2,
                                                            "created_utc": 1577413251.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Of all the regulars for some reason that’s the one that cracks me up the most bahahaha",
                                                                    "author": "knowswhatiwant",
                                                                    "id": "fc4e8zi",
                                                                    "parent_id": "t1_fc4d6ma",
                                                                    "score": 1,
                                                                    "created_utc": 1577414133.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve had men buy me some atrocious lingerie I know exactly what fits my body. The outcome is much better if I choose",
            "author": "knowswhatiwant",
            "id": "fc14z0g",
            "parent_id": "t1_fc0eett",
            "score": 3,
            "created_utc": 1577308404.0,
            "replies": []
        },
        {
            "body": "OMG!  \n\nYou are making me rethink getting back in the bowl.😍",
            "author": "BGDDDY1",
            "id": "fc1qz5j",
            "parent_id": "t1_fc1qtcv",
            "score": 0,
            "created_utc": 1577326938.0,
            "replies": [
                {
                    "body": "Why don’t ya come up and see me sometime 😉",
                    "author": "knowswhatiwant",
                    "id": "fc1ra2d",
                    "parent_id": "t1_fc1qz5j",
                    "score": -1,
                    "created_utc": 1577327210.0,
                    "replies": [
                        {
                            "body": " I’ve got a bad feeling that you’d be well worth it.",
                            "author": "BGDDDY1",
                            "id": "fc1rjx5",
                            "parent_id": "t1_fc1ra2d",
                            "score": 0,
                            "created_utc": 1577327465.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Very well said most of the guys aren’t brad Pitt, we don’t expect brad Pitt or Liam hemsworth. Same way most of the girls are not Kim kardashian. But everyone has their type. Most guys just have this entitlement that because I’m bringing the gifts I can look like whatever.",
            "author": null,
            "id": "fc1cm8a",
            "parent_id": "t1_fc1bzmw",
            "score": 3,
            "created_utc": 1577314759.0,
            "replies": [
                {
                    "body": "Yeah. I knew that would come off that way. Let me put it this way...I’d say I’m an average looking guy. An average looking 30 year old POT should probably not just immediately ghost on a guy who\nMight be interested and serious.",
                    "author": "throwawaysdaccount22",
                    "id": "fc1d35x",
                    "parent_id": "t1_fc1cm8a",
                    "score": 1,
                    "created_utc": 1577315153.0,
                    "replies": [
                        {
                            "body": "Very true. Average looking isn’t bad because we are all average looking. What is sexy to you might be average to someone else. So at some point we have all been called average looking.",
                            "author": null,
                            "id": "fc1dej0",
                            "parent_id": "t1_fc1d35x",
                            "score": 2,
                            "created_utc": 1577315418.0,
                            "replies": [
                                {
                                    "body": "Yeah. I feel bad having this convo. I know I have my type too so it isn’t really fair.",
                                    "author": "throwawaysdaccount22",
                                    "id": "fc1dijj",
                                    "parent_id": "t1_fc1dej0",
                                    "score": 1,
                                    "created_utc": 1577315514.0,
                                    "replies": [
                                        {
                                            "body": "Lol it’s cool. So what’s your type?",
                                            "author": null,
                                            "id": "fc1djkx",
                                            "parent_id": "t1_fc1dijj",
                                            "score": 1,
                                            "created_utc": 1577315540.0,
                                            "replies": [
                                                {
                                                    "body": "Haha. Skinnier and petite.",
                                                    "author": "throwawaysdaccount22",
                                                    "id": "fc1fzhu",
                                                    "parent_id": "t1_fc1djkx",
                                                    "score": 1,
                                                    "created_utc": 1577317625.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lol so you see?",
                                                            "author": null,
                                                            "id": "fc1g112",
                                                            "parent_id": "t1_fc1fzhu",
                                                            "score": 1,
                                                            "created_utc": 1577317660.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol",
            "author": null,
            "id": "fc0u0pf",
            "parent_id": "t1_fc0tvb7",
            "score": 1,
            "created_utc": 1577299670.0,
            "replies": []
        },
        {
            "body": "I'm not convinced he/she knows what sub they're in.",
            "author": "chefdaddy2019",
            "id": "fc1e2iz",
            "parent_id": "t1_fc1ce8d",
            "score": 4,
            "created_utc": 1577315988.0,
            "replies": []
        },
        {
            "body": "That’s awful! I danced with a girl with amazing natural boobs and had even been in playboy. We often did back rooms together and guys pretty much stopped seeing her as a person just breast. They would tug, pull, lick, tweak and every other non fun thing with them. I would just stand there trying to get them off her damn chest long enough to chill!!! \n\nIt’s not that it really bothers me it’s just subjective it’s not like they really really know a cup size. Hell I thought I was a B til i was 30 🤣",
            "author": "knowswhatiwant",
            "id": "fc0d0ai",
            "parent_id": "t1_fc0cnwl",
            "score": 10,
            "created_utc": 1577287336.0,
            "replies": [
                {
                    "body": "Haha yeah it’s so true! I literally respond to it as if it’s them needing my size for a gift and I’m like “I’m a 34DD but not at Victoria secret. Their bras aren’t big enough for me so I can’t wear them :( I really like Calvin Klein, DKNY, and bras from nice boutiques.  \n\nI’m usually a medium in panties and I only like thongs.” Lmao! Flip the script on them ;)",
                    "author": "redheadedbeautyxo",
                    "id": "fc0d9ks",
                    "parent_id": "t1_fc0d0ai",
                    "score": 12,
                    "created_utc": 1577287565.0,
                    "replies": []
                },
                {
                    "body": "“Back rooms”?",
                    "author": "2fast-2curious",
                    "id": "fc0enyy",
                    "parent_id": "t1_fc0d0ai",
                    "score": -1,
                    "created_utc": 1577288810.0,
                    "replies": [
                        {
                            "body": "Private rooms. Not like a booth but a big room with a door. Still no sex but more lax on the touching policy. The high end clubs here the very wealthy like the privacy oh and they basically wanna do coke. Not much stage or floor action.\n\nEdit guys spare me the clubs are a waste or I had sex in the champagne room crap. Just answering a question and providing an example.",
                            "author": "knowswhatiwant",
                            "id": "fc0ey5g",
                            "parent_id": "t1_fc0enyy",
                            "score": 10,
                            "created_utc": 1577289056.0,
                            "replies": [
                                {
                                    "body": "Hmmmm",
                                    "author": "InfiniteTemptation",
                                    "id": "fc2nr14",
                                    "parent_id": "t1_fc0ey5g",
                                    "score": 1,
                                    "created_utc": 1577368425.0,
                                    "replies": [
                                        {
                                            "body": "Here’s the thing I danced in the Midwest, been to clubs around the country and danced Manhattan. Know how there are outliers even in this community certain places where allowances are super high well think of Manhattan Clubs as the outlier. They are absolutely not like any clubs in other cities. It’s apples and oranges to the rest of the country. No one tips stage or even cares about it....not much of a lap dance scene except for maybe a fri/sat. The places I worked most the clientele were hedge fund managers, celebrities and athletes who really don’t do anything in public. \n\nWhen I first moved here I thought it would be like it was back home OH GAWD nope guys just said let’s go to the back and that’s where we drank, danced and partied. Totally bananas. So it gets frustrating when people compare it to other parts of the country but hell I didn’t know what bottle service was til I moved here and def hadn’t even seen coke! \n\nIt just is what it is and back rooms were more of a discretion thing. Sting was a regular at the club hahaha amongst most of the Manhattan Forbes list guys. Also, dancers here know the importance of discretion and would never rat on a big fish. So the Uber wealthy feel way more comfortable and also the host guard their identities. Those guys aren’t on SA and def wouldn’t open themselves up to blackmail (the smart ones).\n\nI had a customer spend $250k in 6 weeks coming to see me. That wasn’t including the ridiculous tips he dropped. I moved to the marketing and promoting side and the nightly spend of one customer would be 5 to 12k low end. \n\nI hated the lifestyle though and wouldn’t go back. Much happier in sugar world.",
                                            "author": "knowswhatiwant",
                                            "id": "fc2srgi",
                                            "parent_id": "t1_fc2nr14",
                                            "score": 2,
                                            "created_utc": 1577372968.0,
                                            "replies": [
                                                {
                                                    "body": "Hahahaha @ sting was regular at the club.\nThat was a thing.",
                                                    "author": "InfiniteTemptation",
                                                    "id": "fc4d6ma",
                                                    "parent_id": "t1_fc2srgi",
                                                    "score": 2,
                                                    "created_utc": 1577413251.0,
                                                    "replies": [
                                                        {
                                                            "body": "Of all the regulars for some reason that’s the one that cracks me up the most bahahaha",
                                                            "author": "knowswhatiwant",
                                                            "id": "fc4e8zi",
                                                            "parent_id": "t1_fc4d6ma",
                                                            "score": 1,
                                                            "created_utc": 1577414133.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why don’t ya come up and see me sometime 😉",
            "author": "knowswhatiwant",
            "id": "fc1ra2d",
            "parent_id": "t1_fc1qz5j",
            "score": -1,
            "created_utc": 1577327210.0,
            "replies": [
                {
                    "body": " I’ve got a bad feeling that you’d be well worth it.",
                    "author": "BGDDDY1",
                    "id": "fc1rjx5",
                    "parent_id": "t1_fc1ra2d",
                    "score": 0,
                    "created_utc": 1577327465.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah. I knew that would come off that way. Let me put it this way...I’d say I’m an average looking guy. An average looking 30 year old POT should probably not just immediately ghost on a guy who\nMight be interested and serious.",
            "author": "throwawaysdaccount22",
            "id": "fc1d35x",
            "parent_id": "t1_fc1cm8a",
            "score": 1,
            "created_utc": 1577315153.0,
            "replies": [
                {
                    "body": "Very true. Average looking isn’t bad because we are all average looking. What is sexy to you might be average to someone else. So at some point we have all been called average looking.",
                    "author": null,
                    "id": "fc1dej0",
                    "parent_id": "t1_fc1d35x",
                    "score": 2,
                    "created_utc": 1577315418.0,
                    "replies": [
                        {
                            "body": "Yeah. I feel bad having this convo. I know I have my type too so it isn’t really fair.",
                            "author": "throwawaysdaccount22",
                            "id": "fc1dijj",
                            "parent_id": "t1_fc1dej0",
                            "score": 1,
                            "created_utc": 1577315514.0,
                            "replies": [
                                {
                                    "body": "Lol it’s cool. So what’s your type?",
                                    "author": null,
                                    "id": "fc1djkx",
                                    "parent_id": "t1_fc1dijj",
                                    "score": 1,
                                    "created_utc": 1577315540.0,
                                    "replies": [
                                        {
                                            "body": "Haha. Skinnier and petite.",
                                            "author": "throwawaysdaccount22",
                                            "id": "fc1fzhu",
                                            "parent_id": "t1_fc1djkx",
                                            "score": 1,
                                            "created_utc": 1577317625.0,
                                            "replies": [
                                                {
                                                    "body": "Lol so you see?",
                                                    "author": null,
                                                    "id": "fc1g112",
                                                    "parent_id": "t1_fc1fzhu",
                                                    "score": 1,
                                                    "created_utc": 1577317660.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Haha yeah it’s so true! I literally respond to it as if it’s them needing my size for a gift and I’m like “I’m a 34DD but not at Victoria secret. Their bras aren’t big enough for me so I can’t wear them :( I really like Calvin Klein, DKNY, and bras from nice boutiques.  \n\nI’m usually a medium in panties and I only like thongs.” Lmao! Flip the script on them ;)",
            "author": "redheadedbeautyxo",
            "id": "fc0d9ks",
            "parent_id": "t1_fc0d0ai",
            "score": 12,
            "created_utc": 1577287565.0,
            "replies": []
        },
        {
            "body": "“Back rooms”?",
            "author": "2fast-2curious",
            "id": "fc0enyy",
            "parent_id": "t1_fc0d0ai",
            "score": -1,
            "created_utc": 1577288810.0,
            "replies": [
                {
                    "body": "Private rooms. Not like a booth but a big room with a door. Still no sex but more lax on the touching policy. The high end clubs here the very wealthy like the privacy oh and they basically wanna do coke. Not much stage or floor action.\n\nEdit guys spare me the clubs are a waste or I had sex in the champagne room crap. Just answering a question and providing an example.",
                    "author": "knowswhatiwant",
                    "id": "fc0ey5g",
                    "parent_id": "t1_fc0enyy",
                    "score": 10,
                    "created_utc": 1577289056.0,
                    "replies": [
                        {
                            "body": "Hmmmm",
                            "author": "InfiniteTemptation",
                            "id": "fc2nr14",
                            "parent_id": "t1_fc0ey5g",
                            "score": 1,
                            "created_utc": 1577368425.0,
                            "replies": [
                                {
                                    "body": "Here’s the thing I danced in the Midwest, been to clubs around the country and danced Manhattan. Know how there are outliers even in this community certain places where allowances are super high well think of Manhattan Clubs as the outlier. They are absolutely not like any clubs in other cities. It’s apples and oranges to the rest of the country. No one tips stage or even cares about it....not much of a lap dance scene except for maybe a fri/sat. The places I worked most the clientele were hedge fund managers, celebrities and athletes who really don’t do anything in public. \n\nWhen I first moved here I thought it would be like it was back home OH GAWD nope guys just said let’s go to the back and that’s where we drank, danced and partied. Totally bananas. So it gets frustrating when people compare it to other parts of the country but hell I didn’t know what bottle service was til I moved here and def hadn’t even seen coke! \n\nIt just is what it is and back rooms were more of a discretion thing. Sting was a regular at the club hahaha amongst most of the Manhattan Forbes list guys. Also, dancers here know the importance of discretion and would never rat on a big fish. So the Uber wealthy feel way more comfortable and also the host guard their identities. Those guys aren’t on SA and def wouldn’t open themselves up to blackmail (the smart ones).\n\nI had a customer spend $250k in 6 weeks coming to see me. That wasn’t including the ridiculous tips he dropped. I moved to the marketing and promoting side and the nightly spend of one customer would be 5 to 12k low end. \n\nI hated the lifestyle though and wouldn’t go back. Much happier in sugar world.",
                                    "author": "knowswhatiwant",
                                    "id": "fc2srgi",
                                    "parent_id": "t1_fc2nr14",
                                    "score": 2,
                                    "created_utc": 1577372968.0,
                                    "replies": [
                                        {
                                            "body": "Hahahaha @ sting was regular at the club.\nThat was a thing.",
                                            "author": "InfiniteTemptation",
                                            "id": "fc4d6ma",
                                            "parent_id": "t1_fc2srgi",
                                            "score": 2,
                                            "created_utc": 1577413251.0,
                                            "replies": [
                                                {
                                                    "body": "Of all the regulars for some reason that’s the one that cracks me up the most bahahaha",
                                                    "author": "knowswhatiwant",
                                                    "id": "fc4e8zi",
                                                    "parent_id": "t1_fc4d6ma",
                                                    "score": 1,
                                                    "created_utc": 1577414133.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": " I’ve got a bad feeling that you’d be well worth it.",
            "author": "BGDDDY1",
            "id": "fc1rjx5",
            "parent_id": "t1_fc1ra2d",
            "score": 0,
            "created_utc": 1577327465.0,
            "replies": []
        },
        {
            "body": "Very true. Average looking isn’t bad because we are all average looking. What is sexy to you might be average to someone else. So at some point we have all been called average looking.",
            "author": null,
            "id": "fc1dej0",
            "parent_id": "t1_fc1d35x",
            "score": 2,
            "created_utc": 1577315418.0,
            "replies": [
                {
                    "body": "Yeah. I feel bad having this convo. I know I have my type too so it isn’t really fair.",
                    "author": "throwawaysdaccount22",
                    "id": "fc1dijj",
                    "parent_id": "t1_fc1dej0",
                    "score": 1,
                    "created_utc": 1577315514.0,
                    "replies": [
                        {
                            "body": "Lol it’s cool. So what’s your type?",
                            "author": null,
                            "id": "fc1djkx",
                            "parent_id": "t1_fc1dijj",
                            "score": 1,
                            "created_utc": 1577315540.0,
                            "replies": [
                                {
                                    "body": "Haha. Skinnier and petite.",
                                    "author": "throwawaysdaccount22",
                                    "id": "fc1fzhu",
                                    "parent_id": "t1_fc1djkx",
                                    "score": 1,
                                    "created_utc": 1577317625.0,
                                    "replies": [
                                        {
                                            "body": "Lol so you see?",
                                            "author": null,
                                            "id": "fc1g112",
                                            "parent_id": "t1_fc1fzhu",
                                            "score": 1,
                                            "created_utc": 1577317660.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Private rooms. Not like a booth but a big room with a door. Still no sex but more lax on the touching policy. The high end clubs here the very wealthy like the privacy oh and they basically wanna do coke. Not much stage or floor action.\n\nEdit guys spare me the clubs are a waste or I had sex in the champagne room crap. Just answering a question and providing an example.",
            "author": "knowswhatiwant",
            "id": "fc0ey5g",
            "parent_id": "t1_fc0enyy",
            "score": 10,
            "created_utc": 1577289056.0,
            "replies": [
                {
                    "body": "Hmmmm",
                    "author": "InfiniteTemptation",
                    "id": "fc2nr14",
                    "parent_id": "t1_fc0ey5g",
                    "score": 1,
                    "created_utc": 1577368425.0,
                    "replies": [
                        {
                            "body": "Here’s the thing I danced in the Midwest, been to clubs around the country and danced Manhattan. Know how there are outliers even in this community certain places where allowances are super high well think of Manhattan Clubs as the outlier. They are absolutely not like any clubs in other cities. It’s apples and oranges to the rest of the country. No one tips stage or even cares about it....not much of a lap dance scene except for maybe a fri/sat. The places I worked most the clientele were hedge fund managers, celebrities and athletes who really don’t do anything in public. \n\nWhen I first moved here I thought it would be like it was back home OH GAWD nope guys just said let’s go to the back and that’s where we drank, danced and partied. Totally bananas. So it gets frustrating when people compare it to other parts of the country but hell I didn’t know what bottle service was til I moved here and def hadn’t even seen coke! \n\nIt just is what it is and back rooms were more of a discretion thing. Sting was a regular at the club hahaha amongst most of the Manhattan Forbes list guys. Also, dancers here know the importance of discretion and would never rat on a big fish. So the Uber wealthy feel way more comfortable and also the host guard their identities. Those guys aren’t on SA and def wouldn’t open themselves up to blackmail (the smart ones).\n\nI had a customer spend $250k in 6 weeks coming to see me. That wasn’t including the ridiculous tips he dropped. I moved to the marketing and promoting side and the nightly spend of one customer would be 5 to 12k low end. \n\nI hated the lifestyle though and wouldn’t go back. Much happier in sugar world.",
                            "author": "knowswhatiwant",
                            "id": "fc2srgi",
                            "parent_id": "t1_fc2nr14",
                            "score": 2,
                            "created_utc": 1577372968.0,
                            "replies": [
                                {
                                    "body": "Hahahaha @ sting was regular at the club.\nThat was a thing.",
                                    "author": "InfiniteTemptation",
                                    "id": "fc4d6ma",
                                    "parent_id": "t1_fc2srgi",
                                    "score": 2,
                                    "created_utc": 1577413251.0,
                                    "replies": [
                                        {
                                            "body": "Of all the regulars for some reason that’s the one that cracks me up the most bahahaha",
                                            "author": "knowswhatiwant",
                                            "id": "fc4e8zi",
                                            "parent_id": "t1_fc4d6ma",
                                            "score": 1,
                                            "created_utc": 1577414133.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah. I feel bad having this convo. I know I have my type too so it isn’t really fair.",
            "author": "throwawaysdaccount22",
            "id": "fc1dijj",
            "parent_id": "t1_fc1dej0",
            "score": 1,
            "created_utc": 1577315514.0,
            "replies": [
                {
                    "body": "Lol it’s cool. So what’s your type?",
                    "author": null,
                    "id": "fc1djkx",
                    "parent_id": "t1_fc1dijj",
                    "score": 1,
                    "created_utc": 1577315540.0,
                    "replies": [
                        {
                            "body": "Haha. Skinnier and petite.",
                            "author": "throwawaysdaccount22",
                            "id": "fc1fzhu",
                            "parent_id": "t1_fc1djkx",
                            "score": 1,
                            "created_utc": 1577317625.0,
                            "replies": [
                                {
                                    "body": "Lol so you see?",
                                    "author": null,
                                    "id": "fc1g112",
                                    "parent_id": "t1_fc1fzhu",
                                    "score": 1,
                                    "created_utc": 1577317660.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hmmmm",
            "author": "InfiniteTemptation",
            "id": "fc2nr14",
            "parent_id": "t1_fc0ey5g",
            "score": 1,
            "created_utc": 1577368425.0,
            "replies": [
                {
                    "body": "Here’s the thing I danced in the Midwest, been to clubs around the country and danced Manhattan. Know how there are outliers even in this community certain places where allowances are super high well think of Manhattan Clubs as the outlier. They are absolutely not like any clubs in other cities. It’s apples and oranges to the rest of the country. No one tips stage or even cares about it....not much of a lap dance scene except for maybe a fri/sat. The places I worked most the clientele were hedge fund managers, celebrities and athletes who really don’t do anything in public. \n\nWhen I first moved here I thought it would be like it was back home OH GAWD nope guys just said let’s go to the back and that’s where we drank, danced and partied. Totally bananas. So it gets frustrating when people compare it to other parts of the country but hell I didn’t know what bottle service was til I moved here and def hadn’t even seen coke! \n\nIt just is what it is and back rooms were more of a discretion thing. Sting was a regular at the club hahaha amongst most of the Manhattan Forbes list guys. Also, dancers here know the importance of discretion and would never rat on a big fish. So the Uber wealthy feel way more comfortable and also the host guard their identities. Those guys aren’t on SA and def wouldn’t open themselves up to blackmail (the smart ones).\n\nI had a customer spend $250k in 6 weeks coming to see me. That wasn’t including the ridiculous tips he dropped. I moved to the marketing and promoting side and the nightly spend of one customer would be 5 to 12k low end. \n\nI hated the lifestyle though and wouldn’t go back. Much happier in sugar world.",
                    "author": "knowswhatiwant",
                    "id": "fc2srgi",
                    "parent_id": "t1_fc2nr14",
                    "score": 2,
                    "created_utc": 1577372968.0,
                    "replies": [
                        {
                            "body": "Hahahaha @ sting was regular at the club.\nThat was a thing.",
                            "author": "InfiniteTemptation",
                            "id": "fc4d6ma",
                            "parent_id": "t1_fc2srgi",
                            "score": 2,
                            "created_utc": 1577413251.0,
                            "replies": [
                                {
                                    "body": "Of all the regulars for some reason that’s the one that cracks me up the most bahahaha",
                                    "author": "knowswhatiwant",
                                    "id": "fc4e8zi",
                                    "parent_id": "t1_fc4d6ma",
                                    "score": 1,
                                    "created_utc": 1577414133.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol it’s cool. So what’s your type?",
            "author": null,
            "id": "fc1djkx",
            "parent_id": "t1_fc1dijj",
            "score": 1,
            "created_utc": 1577315540.0,
            "replies": [
                {
                    "body": "Haha. Skinnier and petite.",
                    "author": "throwawaysdaccount22",
                    "id": "fc1fzhu",
                    "parent_id": "t1_fc1djkx",
                    "score": 1,
                    "created_utc": 1577317625.0,
                    "replies": [
                        {
                            "body": "Lol so you see?",
                            "author": null,
                            "id": "fc1g112",
                            "parent_id": "t1_fc1fzhu",
                            "score": 1,
                            "created_utc": 1577317660.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Here’s the thing I danced in the Midwest, been to clubs around the country and danced Manhattan. Know how there are outliers even in this community certain places where allowances are super high well think of Manhattan Clubs as the outlier. They are absolutely not like any clubs in other cities. It’s apples and oranges to the rest of the country. No one tips stage or even cares about it....not much of a lap dance scene except for maybe a fri/sat. The places I worked most the clientele were hedge fund managers, celebrities and athletes who really don’t do anything in public. \n\nWhen I first moved here I thought it would be like it was back home OH GAWD nope guys just said let’s go to the back and that’s where we drank, danced and partied. Totally bananas. So it gets frustrating when people compare it to other parts of the country but hell I didn’t know what bottle service was til I moved here and def hadn’t even seen coke! \n\nIt just is what it is and back rooms were more of a discretion thing. Sting was a regular at the club hahaha amongst most of the Manhattan Forbes list guys. Also, dancers here know the importance of discretion and would never rat on a big fish. So the Uber wealthy feel way more comfortable and also the host guard their identities. Those guys aren’t on SA and def wouldn’t open themselves up to blackmail (the smart ones).\n\nI had a customer spend $250k in 6 weeks coming to see me. That wasn’t including the ridiculous tips he dropped. I moved to the marketing and promoting side and the nightly spend of one customer would be 5 to 12k low end. \n\nI hated the lifestyle though and wouldn’t go back. Much happier in sugar world.",
            "author": "knowswhatiwant",
            "id": "fc2srgi",
            "parent_id": "t1_fc2nr14",
            "score": 2,
            "created_utc": 1577372968.0,
            "replies": [
                {
                    "body": "Hahahaha @ sting was regular at the club.\nThat was a thing.",
                    "author": "InfiniteTemptation",
                    "id": "fc4d6ma",
                    "parent_id": "t1_fc2srgi",
                    "score": 2,
                    "created_utc": 1577413251.0,
                    "replies": [
                        {
                            "body": "Of all the regulars for some reason that’s the one that cracks me up the most bahahaha",
                            "author": "knowswhatiwant",
                            "id": "fc4e8zi",
                            "parent_id": "t1_fc4d6ma",
                            "score": 1,
                            "created_utc": 1577414133.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Haha. Skinnier and petite.",
            "author": "throwawaysdaccount22",
            "id": "fc1fzhu",
            "parent_id": "t1_fc1djkx",
            "score": 1,
            "created_utc": 1577317625.0,
            "replies": [
                {
                    "body": "Lol so you see?",
                    "author": null,
                    "id": "fc1g112",
                    "parent_id": "t1_fc1fzhu",
                    "score": 1,
                    "created_utc": 1577317660.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hahahaha @ sting was regular at the club.\nThat was a thing.",
            "author": "InfiniteTemptation",
            "id": "fc4d6ma",
            "parent_id": "t1_fc2srgi",
            "score": 2,
            "created_utc": 1577413251.0,
            "replies": [
                {
                    "body": "Of all the regulars for some reason that’s the one that cracks me up the most bahahaha",
                    "author": "knowswhatiwant",
                    "id": "fc4e8zi",
                    "parent_id": "t1_fc4d6ma",
                    "score": 1,
                    "created_utc": 1577414133.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol so you see?",
            "author": null,
            "id": "fc1g112",
            "parent_id": "t1_fc1fzhu",
            "score": 1,
            "created_utc": 1577317660.0,
            "replies": []
        },
        {
            "body": "Of all the regulars for some reason that’s the one that cracks me up the most bahahaha",
            "author": "knowswhatiwant",
            "id": "fc4e8zi",
            "parent_id": "t1_fc4d6ma",
            "score": 1,
            "created_utc": 1577414133.0,
            "replies": []
        }
    ]
}