{
    "title": "tasteful vs distasteful sbs? no such thing.",
    "post_id": "exf36b",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/exf36b/tasteful_vs_distasteful_sbs_no_such_thing/",
    "author": "h0ustonhur",
    "body": "okay so i’ve been on SA for over a week now and i find it crazy how most of it looks like an ordinary dating site. most of the bios of pot’s are very normal looking which is good however when money is brought up - it’s somehow not a good look? \n\ni’m confused is the whole basis of this lifestyle not a quid pro quo case? older guys in need of the company of a beautiful younger woman for some bucks. why do these guys try to emotionally connect with you only to sell you short? then hate on escorts because what? because they know what they want and aren’t afraid to ask for it. \n\ni don’t think it’s fair for these girls to have to walk on eggshells, when some of these guys are extremely blunt about wanting to have intimacy right off the bat. yes we expect to be paid that is the whole point of this exchange. yes we would love to have this long term however the belittling of the needs of the sbs need to stop. it’s a MUTUAL agreement. stop trying to half ass your side of things. okay bye. (no hate to the sds who really do treat their sbs how they’re supposed to)",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/exf36b/tasteful_vs_distasteful_sbs_no_such_thing/",
    "score": 121,
    "upvote_ratio": 0.95,
    "created_utc": 1580601407.0,
    "num_comments": 19,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I would just ignore the guys that pretend to get offended when you want clarity on the financial side of the arrangement.  They know the deal.   Same with girls that act offended when you don’t want to pay them a full allowance to be friends.  Just laugh at them and wish them luck.",
            "author": "LotBuilder",
            "id": "fg7vemz",
            "parent_id": "t3_exf36b",
            "score": 44,
            "created_utc": 1580602433.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fg7uzw2",
            "parent_id": "t3_exf36b",
            "score": 55,
            "created_utc": 1580602131.0,
            "replies": [
                {
                    "body": "Great post ,  the behavior is little different from those who wander up to a random woman in a bar and asking if she would like to fuck. \n\nThe simple answer is I love sex but not with jerks like you....  If the pot SD brings up sex and money in the first discussion and your vision is that of a true relationship you have been blessed with the truth.....  he's not about a relationship...",
                    "author": "pinotandsugar",
                    "id": "fg8hnct",
                    "parent_id": "t1_fg7uzw2",
                    "score": 9,
                    "created_utc": 1580619773.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think there's some fun things to disentangle here, and it's easy to get confused, at first, about what's going on\n\n* There the fact that, on SA itself, the policy is no mentioning PPM, and any tying together of sex with money in messaging is a ban-able offense.  So this needs to happen OFF SA messaging, in text or wherever, not on it.  **An SD (or SB) not wanting to talk money on the SA messaging platform is being smart... but they'd better be amenable to it off the platform**\n* **There are many manipulators, PUAs, etc. posing as SDs**.  No matter when or how you mention allowance, these guys are going to insult you, guilt you, manipulate you, threaten you, insult you.  100% with you that this absolutely sucks for SBs.  It sucks for SDs also, because SBs justifiably put their shields up.  \n* The phrase \"sell you short\" is a bit loaded.  **Maybe you're meeting splenda daddies** who, indeed, can't or won't offer even an average allowance.  **But it's also the case that there are SBs who ask so much that basically no one will meet their request given what they have to offer** \\-- that isn't being sold short, it's having unrealistic asks.  No one owes anyone anything, and not having any takers can very well mean that an SD is offering too little to be interesting, and an SB is ... well, you can figure out the conclusion.\n* No one \"hates\" escorts, in the sense of \"escorts universally bad, sugar good\" -- but SDs are on SA specifically because we've chosen a different experience.  I will tell you that the experience between an arrangement and an escort is night and day -- they are not remotely close to each other.  That's not an insult -- I think we are brothers and sisters in arms.  But the experiences could not possibly be more different.  IMO, escorting, given it's transactional, low emotional intimacy, no strings attached, often multiple clients a day model, is far far far closer to other transactional NSA activities like camming, AMPs, FBSM, stripping (all of which share everything I mentioned) than arrangements.  The transactional nature makes escorting more like pro domming than it does sugaring -- the fundamental nature of the relationship is completely different than sugar.  We don't hate escorts -- but we get tired of being offered escort-like experiences in the bowl.  **Escorting is very very VERY far from an arrangement, even if they are both sex work; not realizing that is the cause of much unneeded resentment and confusion.**",
            "author": "Azurecole",
            "id": "fg8h9if",
            "parent_id": "t3_exf36b",
            "score": 14,
            "created_utc": 1580619441.0,
            "replies": [
                {
                    "body": "I'm an escort, and I've done some sugar dating. I can tell you right now, the experience you have with me in either one is exactly the same. You're not seeing the right escorts if you feel it is transactional or low intimacy, you should feel like the only man in the world and left needing more and more, you pay top dollar, you get the perfect experience. The only difference I can see is if you choose to want an exclusive arrangement, which is absolutely fair enough if you do, but much of the time SDs arent too fussed on whether it is exclusive or not, and if not, what do you think they are doing the next day? \nWhat I do as an escort is provide an experience, the same as I would in the sugar world. I have overnight stays and even weekends, we make a connection and share some fun and romance, we stimulate each other intellectually, emotionally, and physically, we have the perfect rendezvous that benefits us both, and then we do it again the next week.\nI dont know. To me, they are the same thing with different names? but SDs pay less for more. You may not hate escorts yourself, but seriously, soooo many guys on there passionately dont like escorts, I've had a few conversations both on and off SA where the guy has brought the topic up and I've had to step back and leave the conversation. I was seeing a guy briefly, we had met a few times for lunch and went back to his hotel each time, basically a PPM type thing, who spoke about escorts in such a derogatory manner the last time I seen him, I left mid lunch and never seen them again, he started talking about escorts like they were scum of the earth, \"disgusting whores\" he said, like what did he think he was doing by taking me back to the hotel and giving me money to have sex with him?? Wanker. \nMy point is, I think there is a bigger divide between these two types of sex work then there should be. As someone who does both, the difference is minimal, and I dont think it should be such a big deal to think of them as at least similar. \nMain differences - choice of an exclusive arrangement with SD/SB relationship, and you generally pay or exchange less in an SD/SB relationship, with escorts it is time based (hours, days, weeks even) however the experience can absolutely be the same, this is totally dependant on the escort though, if shes a professional, it wont feel like shes working.",
                    "author": "shifty-kangaroo",
                    "id": "fg8nm8p",
                    "parent_id": "t1_fg8h9if",
                    "score": 21,
                    "created_utc": 1580625629.0,
                    "replies": [
                        {
                            "body": "Thanks for a very thoughtful, and thought-provoking reply.  First, I'll re-agree with you that there's no reason to dislike escorts on principle, it's crazy; to the outside world, we're all the same thing anyway.  Hang together or hang separately, as it were.\n\nTo me, the experiences between escorting and arrangements are night and day, and that's something I've seen repeated by so many SDs.  But let's put that aside for moment, and give another example of why I think these things are nothing alike:\n\nWhen you read slf, one of the things that might strike you is the number of threads from SBs, \"I fell in love with my SD\" \"My SD doesn't text me enough\", etc.  Just today there's a thread from an SB who is (justifiably) lamenting that the SDs she's had don't want to take her out for activities like dining, but just rush to have sex.   I have read a number of forums for escorts, strippers, camgirls, and even participated in one or two.  There are rarely or ever threads \"I fell in love with my client\" \"I wish my client would text me more when he's home\" \"I wish my client would spend more time with me doing activities outside the transactional sex part\".  When discussion comes to clients, most of it is venting, insulting, humiliating, etc.   I don't believe strippers, camgirls, or escorts develop anywhere NEAR the level of emotional intimacy that many SBs do, in the vast majority of cases.  They are not falling in love with the client very often, wishing the client would text more, etc.\n\nRecently there was an occurrence of something that's happened many times in the few years I've been here: an escort came into slf, failed to understand the culture, flamed out royally, and went back to SexWorkersOnly to vent.  To paraphrase one of the things she said, \"SBs have to deal with the fatigue of the increased emotional intimacy, texting their SDs, etc, and don't even get paid more for it\".  That, in a nutshell, though, is the huge yawning gap between escorting and arrangements.  I can see her point -- for an escort, emotional intimacy (or feigning it) and texting are \"work\", that she should get paid more for.  Meanwhile, I've never had an SB for whom emotional intimacy, some (or many) strings-attached, etc., isn't a REQUIREMENT, as well as fancy & fun experiences -- she wouldn't even be doing it without those things.  This not extra work to an SB (or at least some -- obviously, some SBs like a more NSA arrangement), rather it's a condition of a good arrangement.  That SB who was lamenting that her SD doesn't take her out to dinner and activities -- she wouldn't get more money if he did so, just her PPM, but nevertheless *she wants to spend more time with him doing activities.*  The complete difference in outlook is what makes the experiences so different between them, for me.\n\nThis is all pretty indicative of my personal experience -- that the experiences in escorting and arrangements are nothing alike.  It feels like a guy who manufactures helmets, and can only see the world through helmets, thinks football and motorcycles are basically the same thing, because *helmets*.  If you look through that lens, sure.  But it misses the really important parts of the experience; they're nothing alike, and football is not a minor variation on motorcycling.  That's exactly how I feel about escorting and arrangements, totally different experience, \"why don't you text me more\" vs \"don't text me too much between visits\", etc.   Doesn't mean I have anying against escorts, or camgirls, or strippers, or FBSM providers -- but those four areas of the sex industry are FAR more alike, than any of them are to arrangements, for me.",
                            "author": "Azurecole",
                            "id": "fg8pmid",
                            "parent_id": "t1_fg8nm8p",
                            "score": 15,
                            "created_utc": 1580627631.0,
                            "replies": [
                                {
                                    "body": "Nailed. it. Quit saying what I was going to say, but better.\n\nFrom now on I'm downvoting you every time I see your name. ;-/",
                                    "author": "Throwawayacct501sd",
                                    "id": "fgbcxtd",
                                    "parent_id": "t1_fg8pmid",
                                    "score": 3,
                                    "created_utc": 1580660788.0,
                                    "replies": [
                                        {
                                            "body": "Ha ha, totally fair!",
                                            "author": "Azurecole",
                                            "id": "fgbdi77",
                                            "parent_id": "t1_fgbcxtd",
                                            "score": 1,
                                            "created_utc": 1580660992.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">... but SDs pay less for more...  \n>  \n>Main differences - choice of an exclusive arrangement with SD/SB relationship, and you generally pay or exchange less in an SD/SB relationship, with escorts it is time based (hours, days, weeks even) however the experience can absolutely be the same,\n\nI wrote a giant essay in response, but should have just said -- I think your summary above IS my point.  Your summary of the difference between arrangements and escorts is focused on payment.  My summary focuses on the fact that escorts view things like emotional intimacy, overnights, texting in-between, etc., as work for which they need to get paid; every SB I've had viewed those things as something they enjoyed and was necessary to have an arrangement at all, even though there was no extra \"payment\" for them.  The difference in experience is stunning and visceral and obvious, which is why so many SDs feel the two experiences are night and day (and we haven't discussed SBs here -- none I've had would be remotely interested in an escort-like model).  I think someone whose priority is payment (and that's not a criticism -- everyone is entitled to their own priorities!) is going to have trouble seeing the big important differences, and instead is going to get stuck on the fact that an exchange of intimacy and money happens in both.  No, the experiences with a woman who WANTS to sleep over despite the fact that PPM stays the same, is never going to be exactly the same as with a woman who views it as work and will only stay over if she's paid more.",
                            "author": "Azurecole",
                            "id": "fgb3alj",
                            "parent_id": "t1_fg8nm8p",
                            "score": 3,
                            "created_utc": 1580658132.0,
                            "replies": []
                        },
                        {
                            "body": ">My point is, I think there is a bigger divide between these two types of sex work then there should be. As someone who does both, the difference is minimal, \\[......\\] if shes a professional, it wont feel like shes working.\n\nObviously I don't know you, and only you I can say what it's like for you. However, while I've never hired an escort, I have met some women through SA who were professionals. The difference was palpable. I don't hate professionals, but some sex workers loathe their clients, or even men in general.\n\nEither way, I don't know you (as far as I know... lol) and I don't mean to be disrespectful. Just saying what I know. The experience is completely different, and with a pro it definitely feels like she's at work.",
                            "author": "Throwawayacct501sd",
                            "id": "fgbbmqk",
                            "parent_id": "t1_fg8nm8p",
                            "score": 1,
                            "created_utc": 1580660399.0,
                            "replies": []
                        },
                        {
                            "body": "> As someone who does both, the difference is minimal\n\nWhich could mean you are a great escort, or a crappy SB? \n\n\"I have overnight stays and even weekends, we make a connection\".\n\nI guess that you price those services in your escort role?  A SB would not, or at least a good one. \n\nBut I agree that some SBs I have had were not as emotionally present as some escorts I have seen before. \n\nEmotional involvement and exclusivity are probably the main components of a SR in my book.",
                            "author": "GSSD",
                            "id": "fggb6st",
                            "parent_id": "t1_fg8nm8p",
                            "score": 1,
                            "created_utc": 1580758167.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeah, ok. You said it better than I did.",
                    "author": "Throwawayacct501sd",
                    "id": "fg8jmmy",
                    "parent_id": "t1_fg8h9if",
                    "score": 2,
                    "created_utc": 1580621566.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "  \n\n\n>okay so i’ve been on SA for over a week now and i find it crazy how most of it looks like an ordinary dating site. most of the bios of pot’s are very normal looking which is good however when money is brought up - it’s somehow not a good look?\n\nYou're mostly engaging with Johns, Scammers, Pump and Dumpers and Vanilla Daters (and some real SD)\n\n&#x200B;\n\n>i’m confused is the whole basis of this lifestyle not a quid pro quo case? older guys in need of the company of a beautiful younger woman for some bucks. why do these guys try to emotionally connect with you only to sell you short? then hate on escorts because what? because they know what they want and aren’t afraid to ask for it.\n\nBecause you're not talking to real SD, most likely Johns if they're bringing up sex.\n\n&#x200B;\n\n>i don’t think it’s fair for these girls to have to walk on eggshells, when some of these guys are extremely blunt about wanting to have intimacy right off the bat. yes we expect to be paid that is the whole point of this exchange. yes we would love to have this long term however the belittling of the needs of the sbs need to stop. it’s a MUTUAL agreement. stop trying to half ass your side of things. okay bye. (no hate to the sds who really do treat their sbs how they’re supposed to)\n\nThe likely hood youre actually engaging with real SD is low. Especially if youre profile is new. Most SD avoid new profiles.",
            "author": "ruphun",
            "id": "fg7vn6n",
            "parent_id": "t3_exf36b",
            "score": 10,
            "created_utc": 1580602613.0,
            "replies": []
        },
        {
            "body": "So don't walk on eggshells! Just be respectful but clear about my allowance expectations from the beginning.",
            "author": null,
            "id": "fg8fw7t",
            "parent_id": "t3_exf36b",
            "score": 4,
            "created_utc": 1580618285.0,
            "replies": []
        },
        {
            "body": "The bowl occupies a wide spectrum between escort/John and vanilla relationships. Everybody is at a different point in that spectrum. That’s not a bad thing. “Relationships on your terms.”\n\nBut we are all on eggshells in the early part of contacting each other, politely but somehow firmly transmitting our places on the spectrum to the other. Sometimes that can be annoying, or even insulting. It’s not easy. Yes, there are jerks and people up to no good, but there are also quite a few just seeking what makes them happy.",
            "author": "creepyoldguy99",
            "id": "fg7vo4f",
            "parent_id": "t3_exf36b",
            "score": 8,
            "created_utc": 1580602632.0,
            "replies": []
        },
        {
            "body": "I use to did very good arrangements on SA not it's just gone down hill in my opinion \n(To preface this a decent appartment out of the ghetto in my city is at least 1000 dollars )\n\nIt's now just filled with men messaging me something along the lines of \"100 dollars (or I've been gotten offered 50) ppm adault/bedroom only relationship\" \nAnd I always respond with \"sorry not an escort and this site is not for finding escorts \"\nAnd they proceed to get all offended I'd suggest they are looking for one \n\nEither that or they just send me a lewd message right of the bat and proceed to send me ten more and get pissed off because I never responded to them\n\nAnd the only people I've actaully had say where I was hoping my allowance would be (I've been doing this awhile and always have had the same allowance with every guy before this recent trip back onto there) was agreeable took me to dinner than insisted on sex and when I said sorry I haven't gotten an allowance and just spent three hours at red lobster with you not sleeping with you till your end of this arrangement is upheld \nProceeded to then tell me something along the lines of \"oh well I took you to dinner I didn't think you'd actaully make me give you money on top that!\" (This has happened three times this month -_-) \n\nAnd there actaully any real sugar daddies left out there? I'm starting to loose hope that there is",
            "author": "vintagerose224",
            "id": "fgbf3gj",
            "parent_id": "t3_exf36b",
            "score": 2,
            "created_utc": 1580661403.0,
            "replies": []
        },
        {
            "body": "\"why do these guys try to emotionally connect with you only to sell you short?\" What exactly happened that you are referring to here?",
            "author": "sugarthrowSD",
            "id": "fg8121e",
            "parent_id": "t3_exf36b",
            "score": 2,
            "created_utc": 1580606676.0,
            "replies": []
        },
        {
            "body": "So, a couple of things: there is a distinction that's being made here, but it's not what you think it is. Specifically, it's not an attempt to discriminate against professionals or to \"take advantage\" of amateurs. The distinction is between what SA is selling (what some of you might call \"the girlfriend experience\") and what Backpage was doing, before it went out of business. There are a number of reasons they're doing what they're doing:\n\n1. Prostitution is illegal. That's why Backpage is no longer with us.\n2. So one reason money is \"not a good look\" is because the people who run SA don't want to join the Backpage people in prison.\n3. There is a market for streetwalkers and escorts, and always will be. SA is not that marketplace. SA is doing something different.\n4. What SA is doing might seem cumbersome and inefficient to you. But then again, maybe SA is not where you should be doing your business.\n5. There are people - both men and women - who prefer the SA model. That doesn't mean they're better or worse than you. It just means they're looking for different things than you. For some, it means there are things important to them other than just maximizing revenue. Whatever they are, they're entitled to do things the way they want - not how you want them to.\n\nFinal note before you downvote me - remember: I don't go to r/SexWorkersOnly and downvote your posts.",
            "author": "Throwawayacct501sd",
            "id": "fg8fok4",
            "parent_id": "t3_exf36b",
            "score": -2,
            "created_utc": 1580618107.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fg993e1",
                    "parent_id": "t1_fg8fok4",
                    "score": 4,
                    "created_utc": 1580635822.0,
                    "replies": [
                        {
                            "body": "Sorry you feel that way. And yeah you're right I probably shouldn't have said it. It's just that sex workers are not a bit shy about coming here and telling us we should do things their way. They would explode if I went to their sub and started lecturing them.",
                            "author": "Throwawayacct501sd",
                            "id": "fgbeuqs",
                            "parent_id": "t1_fg993e1",
                            "score": 1,
                            "created_utc": 1580661319.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">yes we expect to be paid that is the whole point of this exchange.\n\nNot all SBs expect that these days.SA is trying very hard to become a site where you could find a rich bf and it seems like lots of newcomers are testing it that way.\n\nAt least in my city, if you are under 40 and decent looking you can easily get a vanilla date out of SA.",
            "author": null,
            "id": "fg8a78d",
            "parent_id": "t3_exf36b",
            "score": -4,
            "created_utc": 1580613696.0,
            "replies": []
        },
        {
            "body": "Great post ,  the behavior is little different from those who wander up to a random woman in a bar and asking if she would like to fuck. \n\nThe simple answer is I love sex but not with jerks like you....  If the pot SD brings up sex and money in the first discussion and your vision is that of a true relationship you have been blessed with the truth.....  he's not about a relationship...",
            "author": "pinotandsugar",
            "id": "fg8hnct",
            "parent_id": "t1_fg7uzw2",
            "score": 9,
            "created_utc": 1580619773.0,
            "replies": []
        },
        {
            "body": "I'm an escort, and I've done some sugar dating. I can tell you right now, the experience you have with me in either one is exactly the same. You're not seeing the right escorts if you feel it is transactional or low intimacy, you should feel like the only man in the world and left needing more and more, you pay top dollar, you get the perfect experience. The only difference I can see is if you choose to want an exclusive arrangement, which is absolutely fair enough if you do, but much of the time SDs arent too fussed on whether it is exclusive or not, and if not, what do you think they are doing the next day? \nWhat I do as an escort is provide an experience, the same as I would in the sugar world. I have overnight stays and even weekends, we make a connection and share some fun and romance, we stimulate each other intellectually, emotionally, and physically, we have the perfect rendezvous that benefits us both, and then we do it again the next week.\nI dont know. To me, they are the same thing with different names? but SDs pay less for more. You may not hate escorts yourself, but seriously, soooo many guys on there passionately dont like escorts, I've had a few conversations both on and off SA where the guy has brought the topic up and I've had to step back and leave the conversation. I was seeing a guy briefly, we had met a few times for lunch and went back to his hotel each time, basically a PPM type thing, who spoke about escorts in such a derogatory manner the last time I seen him, I left mid lunch and never seen them again, he started talking about escorts like they were scum of the earth, \"disgusting whores\" he said, like what did he think he was doing by taking me back to the hotel and giving me money to have sex with him?? Wanker. \nMy point is, I think there is a bigger divide between these two types of sex work then there should be. As someone who does both, the difference is minimal, and I dont think it should be such a big deal to think of them as at least similar. \nMain differences - choice of an exclusive arrangement with SD/SB relationship, and you generally pay or exchange less in an SD/SB relationship, with escorts it is time based (hours, days, weeks even) however the experience can absolutely be the same, this is totally dependant on the escort though, if shes a professional, it wont feel like shes working.",
            "author": "shifty-kangaroo",
            "id": "fg8nm8p",
            "parent_id": "t1_fg8h9if",
            "score": 21,
            "created_utc": 1580625629.0,
            "replies": [
                {
                    "body": "Thanks for a very thoughtful, and thought-provoking reply.  First, I'll re-agree with you that there's no reason to dislike escorts on principle, it's crazy; to the outside world, we're all the same thing anyway.  Hang together or hang separately, as it were.\n\nTo me, the experiences between escorting and arrangements are night and day, and that's something I've seen repeated by so many SDs.  But let's put that aside for moment, and give another example of why I think these things are nothing alike:\n\nWhen you read slf, one of the things that might strike you is the number of threads from SBs, \"I fell in love with my SD\" \"My SD doesn't text me enough\", etc.  Just today there's a thread from an SB who is (justifiably) lamenting that the SDs she's had don't want to take her out for activities like dining, but just rush to have sex.   I have read a number of forums for escorts, strippers, camgirls, and even participated in one or two.  There are rarely or ever threads \"I fell in love with my client\" \"I wish my client would text me more when he's home\" \"I wish my client would spend more time with me doing activities outside the transactional sex part\".  When discussion comes to clients, most of it is venting, insulting, humiliating, etc.   I don't believe strippers, camgirls, or escorts develop anywhere NEAR the level of emotional intimacy that many SBs do, in the vast majority of cases.  They are not falling in love with the client very often, wishing the client would text more, etc.\n\nRecently there was an occurrence of something that's happened many times in the few years I've been here: an escort came into slf, failed to understand the culture, flamed out royally, and went back to SexWorkersOnly to vent.  To paraphrase one of the things she said, \"SBs have to deal with the fatigue of the increased emotional intimacy, texting their SDs, etc, and don't even get paid more for it\".  That, in a nutshell, though, is the huge yawning gap between escorting and arrangements.  I can see her point -- for an escort, emotional intimacy (or feigning it) and texting are \"work\", that she should get paid more for.  Meanwhile, I've never had an SB for whom emotional intimacy, some (or many) strings-attached, etc., isn't a REQUIREMENT, as well as fancy & fun experiences -- she wouldn't even be doing it without those things.  This not extra work to an SB (or at least some -- obviously, some SBs like a more NSA arrangement), rather it's a condition of a good arrangement.  That SB who was lamenting that her SD doesn't take her out to dinner and activities -- she wouldn't get more money if he did so, just her PPM, but nevertheless *she wants to spend more time with him doing activities.*  The complete difference in outlook is what makes the experiences so different between them, for me.\n\nThis is all pretty indicative of my personal experience -- that the experiences in escorting and arrangements are nothing alike.  It feels like a guy who manufactures helmets, and can only see the world through helmets, thinks football and motorcycles are basically the same thing, because *helmets*.  If you look through that lens, sure.  But it misses the really important parts of the experience; they're nothing alike, and football is not a minor variation on motorcycling.  That's exactly how I feel about escorting and arrangements, totally different experience, \"why don't you text me more\" vs \"don't text me too much between visits\", etc.   Doesn't mean I have anying against escorts, or camgirls, or strippers, or FBSM providers -- but those four areas of the sex industry are FAR more alike, than any of them are to arrangements, for me.",
                    "author": "Azurecole",
                    "id": "fg8pmid",
                    "parent_id": "t1_fg8nm8p",
                    "score": 15,
                    "created_utc": 1580627631.0,
                    "replies": [
                        {
                            "body": "Nailed. it. Quit saying what I was going to say, but better.\n\nFrom now on I'm downvoting you every time I see your name. ;-/",
                            "author": "Throwawayacct501sd",
                            "id": "fgbcxtd",
                            "parent_id": "t1_fg8pmid",
                            "score": 3,
                            "created_utc": 1580660788.0,
                            "replies": [
                                {
                                    "body": "Ha ha, totally fair!",
                                    "author": "Azurecole",
                                    "id": "fgbdi77",
                                    "parent_id": "t1_fgbcxtd",
                                    "score": 1,
                                    "created_utc": 1580660992.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">... but SDs pay less for more...  \n>  \n>Main differences - choice of an exclusive arrangement with SD/SB relationship, and you generally pay or exchange less in an SD/SB relationship, with escorts it is time based (hours, days, weeks even) however the experience can absolutely be the same,\n\nI wrote a giant essay in response, but should have just said -- I think your summary above IS my point.  Your summary of the difference between arrangements and escorts is focused on payment.  My summary focuses on the fact that escorts view things like emotional intimacy, overnights, texting in-between, etc., as work for which they need to get paid; every SB I've had viewed those things as something they enjoyed and was necessary to have an arrangement at all, even though there was no extra \"payment\" for them.  The difference in experience is stunning and visceral and obvious, which is why so many SDs feel the two experiences are night and day (and we haven't discussed SBs here -- none I've had would be remotely interested in an escort-like model).  I think someone whose priority is payment (and that's not a criticism -- everyone is entitled to their own priorities!) is going to have trouble seeing the big important differences, and instead is going to get stuck on the fact that an exchange of intimacy and money happens in both.  No, the experiences with a woman who WANTS to sleep over despite the fact that PPM stays the same, is never going to be exactly the same as with a woman who views it as work and will only stay over if she's paid more.",
                    "author": "Azurecole",
                    "id": "fgb3alj",
                    "parent_id": "t1_fg8nm8p",
                    "score": 3,
                    "created_utc": 1580658132.0,
                    "replies": []
                },
                {
                    "body": ">My point is, I think there is a bigger divide between these two types of sex work then there should be. As someone who does both, the difference is minimal, \\[......\\] if shes a professional, it wont feel like shes working.\n\nObviously I don't know you, and only you I can say what it's like for you. However, while I've never hired an escort, I have met some women through SA who were professionals. The difference was palpable. I don't hate professionals, but some sex workers loathe their clients, or even men in general.\n\nEither way, I don't know you (as far as I know... lol) and I don't mean to be disrespectful. Just saying what I know. The experience is completely different, and with a pro it definitely feels like she's at work.",
                    "author": "Throwawayacct501sd",
                    "id": "fgbbmqk",
                    "parent_id": "t1_fg8nm8p",
                    "score": 1,
                    "created_utc": 1580660399.0,
                    "replies": []
                },
                {
                    "body": "> As someone who does both, the difference is minimal\n\nWhich could mean you are a great escort, or a crappy SB? \n\n\"I have overnight stays and even weekends, we make a connection\".\n\nI guess that you price those services in your escort role?  A SB would not, or at least a good one. \n\nBut I agree that some SBs I have had were not as emotionally present as some escorts I have seen before. \n\nEmotional involvement and exclusivity are probably the main components of a SR in my book.",
                    "author": "GSSD",
                    "id": "fggb6st",
                    "parent_id": "t1_fg8nm8p",
                    "score": 1,
                    "created_utc": 1580758167.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, ok. You said it better than I did.",
            "author": "Throwawayacct501sd",
            "id": "fg8jmmy",
            "parent_id": "t1_fg8h9if",
            "score": 2,
            "created_utc": 1580621566.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fg993e1",
            "parent_id": "t1_fg8fok4",
            "score": 4,
            "created_utc": 1580635822.0,
            "replies": [
                {
                    "body": "Sorry you feel that way. And yeah you're right I probably shouldn't have said it. It's just that sex workers are not a bit shy about coming here and telling us we should do things their way. They would explode if I went to their sub and started lecturing them.",
                    "author": "Throwawayacct501sd",
                    "id": "fgbeuqs",
                    "parent_id": "t1_fg993e1",
                    "score": 1,
                    "created_utc": 1580661319.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for a very thoughtful, and thought-provoking reply.  First, I'll re-agree with you that there's no reason to dislike escorts on principle, it's crazy; to the outside world, we're all the same thing anyway.  Hang together or hang separately, as it were.\n\nTo me, the experiences between escorting and arrangements are night and day, and that's something I've seen repeated by so many SDs.  But let's put that aside for moment, and give another example of why I think these things are nothing alike:\n\nWhen you read slf, one of the things that might strike you is the number of threads from SBs, \"I fell in love with my SD\" \"My SD doesn't text me enough\", etc.  Just today there's a thread from an SB who is (justifiably) lamenting that the SDs she's had don't want to take her out for activities like dining, but just rush to have sex.   I have read a number of forums for escorts, strippers, camgirls, and even participated in one or two.  There are rarely or ever threads \"I fell in love with my client\" \"I wish my client would text me more when he's home\" \"I wish my client would spend more time with me doing activities outside the transactional sex part\".  When discussion comes to clients, most of it is venting, insulting, humiliating, etc.   I don't believe strippers, camgirls, or escorts develop anywhere NEAR the level of emotional intimacy that many SBs do, in the vast majority of cases.  They are not falling in love with the client very often, wishing the client would text more, etc.\n\nRecently there was an occurrence of something that's happened many times in the few years I've been here: an escort came into slf, failed to understand the culture, flamed out royally, and went back to SexWorkersOnly to vent.  To paraphrase one of the things she said, \"SBs have to deal with the fatigue of the increased emotional intimacy, texting their SDs, etc, and don't even get paid more for it\".  That, in a nutshell, though, is the huge yawning gap between escorting and arrangements.  I can see her point -- for an escort, emotional intimacy (or feigning it) and texting are \"work\", that she should get paid more for.  Meanwhile, I've never had an SB for whom emotional intimacy, some (or many) strings-attached, etc., isn't a REQUIREMENT, as well as fancy & fun experiences -- she wouldn't even be doing it without those things.  This not extra work to an SB (or at least some -- obviously, some SBs like a more NSA arrangement), rather it's a condition of a good arrangement.  That SB who was lamenting that her SD doesn't take her out to dinner and activities -- she wouldn't get more money if he did so, just her PPM, but nevertheless *she wants to spend more time with him doing activities.*  The complete difference in outlook is what makes the experiences so different between them, for me.\n\nThis is all pretty indicative of my personal experience -- that the experiences in escorting and arrangements are nothing alike.  It feels like a guy who manufactures helmets, and can only see the world through helmets, thinks football and motorcycles are basically the same thing, because *helmets*.  If you look through that lens, sure.  But it misses the really important parts of the experience; they're nothing alike, and football is not a minor variation on motorcycling.  That's exactly how I feel about escorting and arrangements, totally different experience, \"why don't you text me more\" vs \"don't text me too much between visits\", etc.   Doesn't mean I have anying against escorts, or camgirls, or strippers, or FBSM providers -- but those four areas of the sex industry are FAR more alike, than any of them are to arrangements, for me.",
            "author": "Azurecole",
            "id": "fg8pmid",
            "parent_id": "t1_fg8nm8p",
            "score": 15,
            "created_utc": 1580627631.0,
            "replies": [
                {
                    "body": "Nailed. it. Quit saying what I was going to say, but better.\n\nFrom now on I'm downvoting you every time I see your name. ;-/",
                    "author": "Throwawayacct501sd",
                    "id": "fgbcxtd",
                    "parent_id": "t1_fg8pmid",
                    "score": 3,
                    "created_utc": 1580660788.0,
                    "replies": [
                        {
                            "body": "Ha ha, totally fair!",
                            "author": "Azurecole",
                            "id": "fgbdi77",
                            "parent_id": "t1_fgbcxtd",
                            "score": 1,
                            "created_utc": 1580660992.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">... but SDs pay less for more...  \n>  \n>Main differences - choice of an exclusive arrangement with SD/SB relationship, and you generally pay or exchange less in an SD/SB relationship, with escorts it is time based (hours, days, weeks even) however the experience can absolutely be the same,\n\nI wrote a giant essay in response, but should have just said -- I think your summary above IS my point.  Your summary of the difference between arrangements and escorts is focused on payment.  My summary focuses on the fact that escorts view things like emotional intimacy, overnights, texting in-between, etc., as work for which they need to get paid; every SB I've had viewed those things as something they enjoyed and was necessary to have an arrangement at all, even though there was no extra \"payment\" for them.  The difference in experience is stunning and visceral and obvious, which is why so many SDs feel the two experiences are night and day (and we haven't discussed SBs here -- none I've had would be remotely interested in an escort-like model).  I think someone whose priority is payment (and that's not a criticism -- everyone is entitled to their own priorities!) is going to have trouble seeing the big important differences, and instead is going to get stuck on the fact that an exchange of intimacy and money happens in both.  No, the experiences with a woman who WANTS to sleep over despite the fact that PPM stays the same, is never going to be exactly the same as with a woman who views it as work and will only stay over if she's paid more.",
            "author": "Azurecole",
            "id": "fgb3alj",
            "parent_id": "t1_fg8nm8p",
            "score": 3,
            "created_utc": 1580658132.0,
            "replies": []
        },
        {
            "body": ">My point is, I think there is a bigger divide between these two types of sex work then there should be. As someone who does both, the difference is minimal, \\[......\\] if shes a professional, it wont feel like shes working.\n\nObviously I don't know you, and only you I can say what it's like for you. However, while I've never hired an escort, I have met some women through SA who were professionals. The difference was palpable. I don't hate professionals, but some sex workers loathe their clients, or even men in general.\n\nEither way, I don't know you (as far as I know... lol) and I don't mean to be disrespectful. Just saying what I know. The experience is completely different, and with a pro it definitely feels like she's at work.",
            "author": "Throwawayacct501sd",
            "id": "fgbbmqk",
            "parent_id": "t1_fg8nm8p",
            "score": 1,
            "created_utc": 1580660399.0,
            "replies": []
        },
        {
            "body": "> As someone who does both, the difference is minimal\n\nWhich could mean you are a great escort, or a crappy SB? \n\n\"I have overnight stays and even weekends, we make a connection\".\n\nI guess that you price those services in your escort role?  A SB would not, or at least a good one. \n\nBut I agree that some SBs I have had were not as emotionally present as some escorts I have seen before. \n\nEmotional involvement and exclusivity are probably the main components of a SR in my book.",
            "author": "GSSD",
            "id": "fggb6st",
            "parent_id": "t1_fg8nm8p",
            "score": 1,
            "created_utc": 1580758167.0,
            "replies": []
        },
        {
            "body": "Sorry you feel that way. And yeah you're right I probably shouldn't have said it. It's just that sex workers are not a bit shy about coming here and telling us we should do things their way. They would explode if I went to their sub and started lecturing them.",
            "author": "Throwawayacct501sd",
            "id": "fgbeuqs",
            "parent_id": "t1_fg993e1",
            "score": 1,
            "created_utc": 1580661319.0,
            "replies": []
        },
        {
            "body": "Nailed. it. Quit saying what I was going to say, but better.\n\nFrom now on I'm downvoting you every time I see your name. ;-/",
            "author": "Throwawayacct501sd",
            "id": "fgbcxtd",
            "parent_id": "t1_fg8pmid",
            "score": 3,
            "created_utc": 1580660788.0,
            "replies": [
                {
                    "body": "Ha ha, totally fair!",
                    "author": "Azurecole",
                    "id": "fgbdi77",
                    "parent_id": "t1_fgbcxtd",
                    "score": 1,
                    "created_utc": 1580660992.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ha ha, totally fair!",
            "author": "Azurecole",
            "id": "fgbdi77",
            "parent_id": "t1_fgbcxtd",
            "score": 1,
            "created_utc": 1580660992.0,
            "replies": []
        }
    ]
}