{
    "title": "Am I being unreasonable?",
    "post_id": "nkqyyq",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/nkqyyq/am_i_being_unreasonable/",
    "author": "Shyyhoneybadger",
    "body": "",
    "url": "https://i.redd.it/w2nel09k0a171.jpg",
    "score": 176,
    "upvote_ratio": 0.94,
    "created_utc": 1621952689.0,
    "num_comments": 192,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "As an SD,  I would never put that kind of pressure on a SB.  I think he’s full of it about his genetics and weak ejaculation.  Does he think you’re naive enough to buy that?  If he’s asking you for this,  he’s going bare with others.   It’s not worth it.  Next this loser!",
            "author": "jmone14",
            "id": "gzenlq9",
            "parent_id": "t3_nkqyyq",
            "score": 256,
            "created_utc": 1621959587.0,
            "replies": [
                {
                    "body": "I am more of a “short and cute” type and I come off 💯 innocent so I think he’s definitely trying to completely control my thinking on this. When I first spoke with him he was very like “be careful, be safe, always second guess, maybe you shouldn’t meet with any other guy and just meet me” and now he is like this. You guys all gave me confirmation and more of a backbone :)",
                    "author": "Shyyhoneybadger",
                    "id": "gzf65fh",
                    "parent_id": "t1_gzenlq9",
                    "score": 91,
                    "created_utc": 1621967537.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gzfiz6l",
                            "parent_id": "t1_gzf65fh",
                            "score": 36,
                            "created_utc": 1621972846.0,
                            "replies": [
                                {
                                    "body": "It’s rough, IMO I think there is a kind of kink for the short cute girls... not that it’s a bad thing 😇",
                                    "author": "Shyyhoneybadger",
                                    "id": "gzfj71h",
                                    "parent_id": "t1_gzfiz6l",
                                    "score": 20,
                                    "created_utc": 1621972936.0,
                                    "replies": [
                                        {
                                            "body": "I like short cute girls 😊 but that doesn't mean I have to be a jerk and try to control you out make you do things you're not comfortable with. Show that guy the highway. You can do better.",
                                            "author": "SDSFBA",
                                            "id": "gzfn1iq",
                                            "parent_id": "t1_gzfj71h",
                                            "score": 11,
                                            "created_utc": 1621974599.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Yes there is that kink. In sopranos a line was big chest little feet..a hit in any man's league. But yes as a default most men will take short n cute.",
                                            "author": null,
                                            "id": "gzfkvsc",
                                            "parent_id": "t1_gzfj71h",
                                            "score": 6,
                                            "created_utc": 1621973664.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "That's exactly what they are doing! You even see men right here in this group doing it. Please be careful. These men aren't worth it.",
                                    "author": "clair-cummings",
                                    "id": "gzhlfz2",
                                    "parent_id": "t1_gzfiz6l",
                                    "score": 6,
                                    "created_utc": 1622013926.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gzi5vnw",
                                    "parent_id": "t1_gzfiz6l",
                                    "score": 6,
                                    "created_utc": 1622030770.0,
                                    "replies": [
                                        {
                                            "body": "Ditto!",
                                            "author": "Puzzleheaded-80",
                                            "id": "gziiezp",
                                            "parent_id": "t1_gzi5vnw",
                                            "score": 2,
                                            "created_utc": 1622037335.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gzgn29l",
                                    "parent_id": "t1_gzfiz6l",
                                    "score": 2,
                                    "created_utc": 1621992380.0,
                                    "replies": [
                                        {
                                            "body": "The word you are looking for is \"masculine guilt\" 🤦‍♀️",
                                            "author": "clair-cummings",
                                            "id": "gzhljn7",
                                            "parent_id": "t1_gzgn29l",
                                            "score": 2,
                                            "created_utc": 1622014014.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "His behavior hasn’t changed. He’s trying to control you and being manipulative about it. He wasn’t caring in the beginning, he was trying to control the way you saw/trusted him and treated the arrangement. Run the other direction 🚩🚩🚩🚩",
                            "author": "tiredofmyownself",
                            "id": "gzfxx53",
                            "parent_id": "t1_gzf65fh",
                            "score": 14,
                            "created_utc": 1621979868.0,
                            "replies": []
                        },
                        {
                            "body": "Beyond this obvious attempt at intimidation,  arrangements work when goals, expectations and actions are compatible.  If there is no sign of understanding in the first re-statement of your expectations then it is time to eject.  Story after story here starts with two or more compromises in the face of attempted intimidation, negotiation, extortion  ......  and the stories have fewer happy endings than purchasing lottery tickets. But there never is a grand winner.",
                            "author": "pinotandsugar",
                            "id": "gzfw3a8",
                            "parent_id": "t1_gzf65fh",
                            "score": 3,
                            "created_utc": 1621979016.0,
                            "replies": []
                        },
                        {
                            "body": "Yes short and cute get bossed around...be carefull.",
                            "author": null,
                            "id": "gzfkowc",
                            "parent_id": "t1_gzf65fh",
                            "score": 2,
                            "created_utc": 1621973581.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gzfs0eh",
                    "parent_id": "t1_gzenlq9",
                    "score": 12,
                    "created_utc": 1621977094.0,
                    "replies": [
                        {
                            "body": "IT ONLY TAKES ONE.",
                            "author": null,
                            "id": "gzfuw2b",
                            "parent_id": "t1_gzfs0eh",
                            "score": 8,
                            "created_utc": 1621978455.0,
                            "replies": []
                        },
                        {
                            "body": "\"Low sperm count\" has replaced the \"only in a little ways\" of yesteryear",
                            "author": "pinotandsugar",
                            "id": "gzfwcd8",
                            "parent_id": "t1_gzfs0eh",
                            "score": 10,
                            "created_utc": 1621979134.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"I barely ejaculate at all?\" What does that have to do with anything?\n\nProtection is a non-negotiable. If he's this immature and pushy about protection, he'll only be immature and pushy about other things.",
            "author": "TwoInSympathy",
            "id": "gzee95k",
            "parent_id": "t3_nkqyyq",
            "score": 187,
            "created_utc": 1621955560.0,
            "replies": [
                {
                    "body": "He is in his late 60s.. so I’m guessing that’s what he is meaning?\nHe is a lawyer (his firm is under his name) and he has taken me to his office and given me his full real name. But he is saying I’m being too worried like something bad is going to happen. I’m just making sure something bad DOESNT happen.",
                    "author": "Shyyhoneybadger",
                    "id": "gzeeyy1",
                    "parent_id": "t1_gzee95k",
                    "score": 42,
                    "created_utc": 1621955878.0,
                    "replies": [
                        {
                            "body": "If you don't feel comfortable without protection, don't do it and find someone who will.",
                            "author": "TwoInSympathy",
                            "id": "gzef6lq",
                            "parent_id": "t1_gzeeyy1",
                            "score": 64,
                            "created_utc": 1621955973.0,
                            "replies": [
                                {
                                    "body": "Okay! I just needed confirmation that I wasn’t being unreasonable as now he is saying I’m the only one that’s ever asked that 🙃\nHe is a lawyer so I’m guessing he is just using his lawyer speak on me ha",
                                    "author": "Shyyhoneybadger",
                                    "id": "gzeg99c",
                                    "parent_id": "t1_gzef6lq",
                                    "score": 39,
                                    "created_utc": 1621956445.0,
                                    "replies": [
                                        {
                                            "body": "Him saying that you are the only one that’s ever asked that means he regularly has unprotected sex- more reason to run !",
                                            "author": "prettylilprostitute",
                                            "id": "gzf1c0j",
                                            "parent_id": "t1_gzeg99c",
                                            "score": 43,
                                            "created_utc": 1621965517.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Putting your safety first is never unreasonable.",
                                            "author": "TwoInSympathy",
                                            "id": "gzegptt",
                                            "parent_id": "t1_gzeg99c",
                                            "score": 35,
                                            "created_utc": 1621956646.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Oh heck no, I feel most here aren’t saying “ya! lemme duck and suck without a condom! I’m totally okay with that and trust you babe xx” smh gaslighting mf \nYour concerns should be validated and taken seriously, next",
                                            "author": "xonlyjade",
                                            "id": "gzf4bzq",
                                            "parent_id": "t1_gzeg99c",
                                            "score": 10,
                                            "created_utc": 1621966791.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you! ♥️💕",
                                                    "author": "Shyyhoneybadger",
                                                    "id": "gzf5tut",
                                                    "parent_id": "t1_gzf4bzq",
                                                    "score": 1,
                                                    "created_utc": 1621967404.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Anyone who won’t use protection is concerning. Move on.  There are others out there:)",
                                            "author": null,
                                            "id": "gzf3v96",
                                            "parent_id": "t1_gzeg99c",
                                            "score": 10,
                                            "created_utc": 1621966605.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "> He is a lawyer\n\nPerhaps Shakespeare was right",
                                            "author": "pinotandsugar",
                                            "id": "gzfwlt5",
                                            "parent_id": "t1_gzeg99c",
                                            "score": 2,
                                            "created_utc": 1621979257.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Don't have sex without a condom. He is likely to be having sex with many girls and you will get passed anything they have.",
                            "author": "Worldly_Forever_9353",
                            "id": "gzekyr0",
                            "parent_id": "t1_gzeeyy1",
                            "score": 29,
                            "created_utc": 1621958461.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The amount of guys wanting unprotected sex in the sugar world is too much. EVERYONE who asked got turned down and passed to another girl who hopefully had smarts enough to say the same. In terms of an arrangement involving this though, I have only had unprotected sex in ONE arrangement. He was married, not seeing anyone else (we didn’t meet on a sugar site but another dating site) was older, tubes tied, and super big on monogamy. We were together for 8 years and it wasn’t until after the 2nd that I finally said OK. People that wanna jump into it, I don’t trust. Go w ur gut gf.",
            "author": "jaazthealien",
            "id": "gzevtfl",
            "parent_id": "t3_nkqyyq",
            "score": 34,
            "created_utc": 1621963126.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gzevswi",
            "parent_id": "t3_nkqyyq",
            "score": 22,
            "created_utc": 1621963120.0,
            "replies": [
                {
                    "body": "Just to be clear, that's 15% of the 1.2M people in the US with HIV.  or 180,000 people or less than 1/3 the number of people that died of covid.\n\nSo given that HIV positivity is less than 1/3 of 1% of the us population, and people that don't know they have it are 15% of that, that means less than 5% of 1% of the population has it and doesn't know.  Or less than .0005.\n\nIf you also consider that the vast majority of HIV positive people probably fall in demographics you're unlikely to interact with, and that if you're engaging in strictly hetero or strictly homo-sexual activity that further reduces the number of possible infected partners to potentially half that number, your odds of winning a major lottery prize are far better than interacting with someone that is unaware they have HIV.  Finally the rates of transmission from hetero vaginal sex is far less than anal sex.\n\nYou're now at .000025 or less.  You are far more likely to die by covid, auto accident..  and i wouldn't be surprised if dying in an airplane crash wasn't more likely.\n\nNot to say that you shouldn't take sensible precautions, including condoms... but I wouldn't be paranoid about HIV even if you don't.  Plus condoms reduce pregnancy risk and other STI's, but HIV is such a small risk in the US with standard sex that using this as an excuse is silly.",
                    "author": "Acrobatic_Half_6631",
                    "id": "gzhesoy",
                    "parent_id": "t1_gzevswi",
                    "score": 1,
                    "created_utc": 1622008572.0,
                    "replies": [
                        {
                            "body": "HIV is just one of many things to be concerned about. His lack of respect for her health is what is most concerning.",
                            "author": "clair-cummings",
                            "id": "gzhlurb",
                            "parent_id": "t1_gzhesoy",
                            "score": 5,
                            "created_utc": 1622014282.0,
                            "replies": []
                        },
                        {
                            "body": "That risk might be low.\n\nBut there are others.\n\nI always ask the lady. If not previously discussed, right before insertion... (typically, women who want me to use a condom have already let me know..)  If they are OK with it I'll let them know I've been \"snipped\"....\n\nBut really, especially first time I meet someone, arguing with her over this is dumb. Worse idea than trying to negotiate a rate. Just suit up.",
                            "author": "wackapoof",
                            "id": "gzk6132",
                            "parent_id": "t1_gzhesoy",
                            "score": 1,
                            "created_utc": 1622062107.0,
                            "replies": [
                                {
                                    "body": "I didn't say you should argue with anyone about it.  I also said you should in fact use condoms for other reasons.  I said, however that using HIV specifically as your excuse, or worrying about it is silly.  \n\nThere are far bigger risks to worry about.  In fact the odds of getting pregnant, even when using condoms are significantly higher than your odds of getting HIV when not using condoms, unless you're engaging with high risk individuals, in higher risk scenarios.",
                                    "author": "Acrobatic_Half_6631",
                                    "id": "gzlqkzt",
                                    "parent_id": "t1_gzk6132",
                                    "score": 1,
                                    "created_utc": 1622091782.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There’s more red flags here than Russia in the 1930s.",
            "author": null,
            "id": "gzexzlz",
            "parent_id": "t3_nkqyyq",
            "score": 18,
            "created_utc": 1621964060.0,
            "replies": [
                {
                    "body": "Love this.",
                    "author": "Distinct-Animal-9628",
                    "id": "gzfuoww",
                    "parent_id": "t1_gzexzlz",
                    "score": 3,
                    "created_utc": 1621978360.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You’re not being unreasonable. Even if you were “exclusive”, I’m guessing you’re not, he is pushing on your (very valid and smart) boundary. Next that mfer. There are plenty of SDs out there that will appreciate your precautions to keep you BOTH safe.",
            "author": "lilgarage",
            "id": "gzef2kf",
            "parent_id": "t3_nkqyyq",
            "score": 53,
            "created_utc": 1621955924.0,
            "replies": []
        },
        {
            "body": "HIV isn't the only STI that can have a long impact on your sexual health.\n\nHerpes 1&2 become lifelong symptoms you have to manage and most people are not even regularly tested for them. \n\nHPV also isn't a regularly tested that can be asymptomatic for one person and full on detrimental for another. Men have an easier time having HPV related warts removed than women as well.\n\nThere is nothing wrong wanting to have safe sex and if it is a hard limit for you make sure your boundaries are.",
            "author": "DarkDelightsShop",
            "id": "gzerphd",
            "parent_id": "t3_nkqyyq",
            "score": 31,
            "created_utc": 1621961350.0,
            "replies": [
                {
                    "body": "UK is my specialty. HPV vaccine is offered now to both boys and girls from age 12 and is free up to age 25. [https://www.nhs.uk/conditions/vaccinations/hpv-human-papillomavirus-vaccine/](https://www.nhs.uk/conditions/vaccinations/hpv-human-papillomavirus-vaccine/)\n\nThe vaccine is also recommended for the same age group in the US.\n\nIn the UK, the commonly known cervical smear test now primarily tests for HPV, so ladies should attend their free screening. Some areas are now piloting the self-testing as well and the uptake is very good so hopefully it will be commonly rolled out within the next couple of years.\n\n/freehealthplugoff",
                    "author": "AnSteall",
                    "id": "gzf3224",
                    "parent_id": "t1_gzerphd",
                    "score": 4,
                    "created_utc": 1621966256.0,
                    "replies": [
                        {
                            "body": "Just remember that the vaccine - which yes everyone should embrace - only covers a handful of strains and there are over 200 known variants of HPV.",
                            "author": "DarkDelightsShop",
                            "id": "gzf4ydz",
                            "parent_id": "t1_gzf3224",
                            "score": 14,
                            "created_utc": 1621967040.0,
                            "replies": [
                                {
                                    "body": "That's viruses for you.",
                                    "author": "AnSteall",
                                    "id": "gzf5jnh",
                                    "parent_id": "t1_gzf4ydz",
                                    "score": 3,
                                    "created_utc": 1621967284.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "In the US, you can get it up to age like 46? if your doctor decides it’s recommended (usually high risk sexual activity).",
                            "author": "n00b_to_this",
                            "id": "gzfteh9",
                            "parent_id": "t1_gzf3224",
                            "score": 2,
                            "created_utc": 1621977748.0,
                            "replies": [
                                {
                                    "body": "I wasn't sure, and a little extra education never hurts so I checked it out.\n\nFrom the CDC:  \nVaccine Recommendations  \nHPV vaccine is recommended for routine vaccination at age 11 or 12 years. (Vaccination can be started at age 9.)  \nACIP also recommends vaccination for everyone through age 26 years if not adequately vaccinated previously. HPV vaccination is given as a series of either two or three doses, depending on age at initial vaccination.  \nVaccination is not recommended for everyone older than age 26 years. However, some adults ages 27 through 45 years may decide to get the HPV vaccine based on discussion with their clinician, if they did not get adequately vaccinated when they were younger. HPV vaccination of people in this age range provides less benefit, for several reasons, including that more people in this age range have already been exposed to HPV.  \nFor adults ages 27 through 45 years, clinicians can consider discussing HPV vaccination with people who are most likely to benefit. HPV vaccination does not need to be discussed with most  adults over age 26 years.",
                                    "author": "DarkDelightsShop",
                                    "id": "gzg1kfe",
                                    "parent_id": "t1_gzfteh9",
                                    "score": 4,
                                    "created_utc": 1621981598.0,
                                    "replies": [
                                        {
                                            "body": "Yeah if you're older than 45 you have to sometimes argue/demand it and pay for it out of pocket. They'll say \"oh you already have all the HPV you don't need this\" but why not get it anyhow.",
                                            "author": "emptyoverflow",
                                            "id": "gzgq0m2",
                                            "parent_id": "t1_gzg1kfe",
                                            "score": 1,
                                            "created_utc": 1621993897.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow. His defensive (and disrespectful, medically inaccurate, overall idiotic) soliloquy would have guaranteed a block.\n\nEDIT: I bet he’s one of those anti maskers, or who wears a mask but with his nose hanging outside of it.",
            "author": "ExExpectations",
            "id": "gzenglc",
            "parent_id": "t3_nkqyyq",
            "score": 59,
            "created_utc": 1621959526.0,
            "replies": []
        },
        {
            "body": "ANYONE trying to pressure you or coerce you when you are trying to be safe, especially on topics like this, should be avoided. You don’t need that kind of influence in your life.\n\nHeck, this may apply to anyone trying to coerce you at all. It’s not cool.",
            "author": "garret6758",
            "id": "gzer4kl",
            "parent_id": "t3_nkqyyq",
            "score": 13,
            "created_utc": 1621961100.0,
            "replies": []
        },
        {
            "body": "No means no. \n\nI’ll say it again: \nNo means no. \n\nIf he won’t respect this boundary which one will he disrespect next, and when?",
            "author": "SassySugar4u",
            "id": "gzerk4e",
            "parent_id": "t3_nkqyyq",
            "score": 19,
            "created_utc": 1621961285.0,
            "replies": []
        },
        {
            "body": "No, you are not being unreasonable and it worries me that he's successfully made you question yourself.\n\nUnless you're exclusive (would never genuinely consider a SR to be) and getting tested with someone simultaneously, never take their word that they're clean. That's an aside from pregnancy risks for you, too, so even if there's no threat of STI's, if you want to stick to condoms, that is that - no further explanation is needed. \n\nAlso, it's true that there's no guarantee of 100% safety if you're engaging in sex acts with someone else, but since that's the case, by his logic, throw all caution to the wind and ditch the barrier?! Fuck outta here! \n\nLastly (yes, this is firing me up), there are spermicidal sponges, but I've never heard of spermicidal lube?! If this is a genuine thing somewhere, it does actually mess with your pH and irritates your vaginal lining... so, it would, in fact, make you more vulnerable to STI's.\n\nWork on your boundaries and stand firm as I know many SD's can be like this ♥",
            "author": null,
            "id": "gzetoyy",
            "parent_id": "t3_nkqyyq",
            "score": 11,
            "created_utc": 1621962199.0,
            "replies": []
        },
        {
            "body": "No you're not unreasonable and you should next him simply for pressuring you to go against what makes you comfortable.",
            "author": "viewfrom61",
            "id": "gzejj42",
            "parent_id": "t3_nkqyyq",
            "score": 8,
            "created_utc": 1621957844.0,
            "replies": []
        },
        {
            "body": "The only way any man is going to have raw sex with me is if we are vanilla exclusive partners. I would never ever go raw with a sugar relationship",
            "author": "babyforestfawn",
            "id": "gzetg8f",
            "parent_id": "t3_nkqyyq",
            "score": 8,
            "created_utc": 1621962092.0,
            "replies": []
        },
        {
            "body": "Why would there be the slightest question about you being unreasonable?  You're uncomfortable with raw dogging it, and unwilling to take the risk of catching STDs.   No one will (or should) question that this is 100% your call.  \n\nHe will only go without a condom -- it's easy to take him at his word that he doesn't find it at all enjoyable, and many men can't maintain an erection in one.  Which means you two aren't a match. \n\nThis one was super simple.  Case closed!  Find yourself a guy who is fine with a condom",
            "author": "Azurecole",
            "id": "gzedxys",
            "parent_id": "t3_nkqyyq",
            "score": 25,
            "created_utc": 1621955418.0,
            "replies": [
                {
                    "body": "I seriously worry for these newbies.",
                    "author": "ExExpectations",
                    "id": "gzexwoq",
                    "parent_id": "t1_gzedxys",
                    "score": 6,
                    "created_utc": 1621964025.0,
                    "replies": []
                },
                {
                    "body": ">  Which means you two aren't a match.\n\nIt's just that simple",
                    "author": "pinotandsugar",
                    "id": "gzfwzld",
                    "parent_id": "t1_gzedxys",
                    "score": 2,
                    "created_utc": 1621979435.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nope nope nope. He needs to respect that boundary. If he won't, DROP him",
            "author": "babygorl02",
            "id": "gzeozz2",
            "parent_id": "t3_nkqyyq",
            "score": 8,
            "created_utc": 1621960190.0,
            "replies": []
        },
        {
            "body": "asking to use protection is never unreasonable! what’s unreasonable is his response to “i want to use condoms” being “well i don’t even cum anyway!” lmaooo",
            "author": null,
            "id": "gzeysg7",
            "parent_id": "t3_nkqyyq",
            "score": 7,
            "created_utc": 1621964410.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gzf6paj",
            "parent_id": "t3_nkqyyq",
            "score": 7,
            "created_utc": 1621967757.0,
            "replies": []
        },
        {
            "body": "The fact that you’re questioning if this is an unreasonable thing to request concerns me. Stop being a doormat, pushover, pick me and stand up for your health and safety no exceptions.",
            "author": "princesspoppy77",
            "id": "gzehv6u",
            "parent_id": "t3_nkqyyq",
            "score": 23,
            "created_utc": 1621957128.0,
            "replies": [
                {
                    "body": "With the power dynamics in Sugar women need to be very nonnegotiable with boundaries and focus on their self confidence, self worth and self love because no amount of money is worth your self respect.",
                    "author": "LaFilleWhoCantFrench",
                    "id": "gzew99w",
                    "parent_id": "t1_gzehv6u",
                    "score": 12,
                    "created_utc": 1621963304.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If he is truly looking for a longterm exclusive SB then he will spend the time to earn trust. Provide multiple clean test and pay for you to be tested as well. You are worth wait.",
            "author": "zztop1999",
            "id": "gzervi3",
            "parent_id": "t3_nkqyyq",
            "score": 6,
            "created_utc": 1621961419.0,
            "replies": []
        },
        {
            "body": "You are not being unreasonable at all. Don't back down on using condoms ever. Your health comes first.",
            "author": "goddess_jana_",
            "id": "gzeznw9",
            "parent_id": "t3_nkqyyq",
            "score": 5,
            "created_utc": 1621964793.0,
            "replies": []
        },
        {
            "body": "Ah yes, magic lube. You're not being unreasonable. When you tell someone you want to use condoms, the proper answer is \"so do I\"",
            "author": "khaoticneutralzone",
            "id": "gzexvkk",
            "parent_id": "t3_nkqyyq",
            "score": 10,
            "created_utc": 1621964011.0,
            "replies": []
        },
        {
            "body": "You are being 100% reasonable for putting your sexual health first.",
            "author": "roscoe7585",
            "id": "gzeruzx",
            "parent_id": "t3_nkqyyq",
            "score": 4,
            "created_utc": 1621961413.0,
            "replies": []
        },
        {
            "body": "no boundaries around safety are unreasonable. i hate that use of protection is always such a make or break topic",
            "author": "xnymphmo",
            "id": "gzevqkq",
            "parent_id": "t3_nkqyyq",
            "score": 6,
            "created_utc": 1621963093.0,
            "replies": []
        },
        {
            "body": "It’s your body, it does not matter what your reasoning is.",
            "author": "OffhandCut",
            "id": "gzf0xz3",
            "parent_id": "t3_nkqyyq",
            "score": 4,
            "created_utc": 1621965350.0,
            "replies": []
        },
        {
            "body": "your body, your rules. If someone does not respect you, then walk away. \n\n&#x200B;\n\nP.s dont fall for the allergic to latex or i need to hide my penis trick..",
            "author": "peterharris100",
            "id": "gzf11gs",
            "parent_id": "t3_nkqyyq",
            "score": 4,
            "created_utc": 1621965391.0,
            "replies": []
        },
        {
            "body": "You’re not being unreasonable at all. You’re being smart and safe. 100%\n\nIn future I wouldn’t even give an explanation of why you want to use condoms… so they can’t come back with the  ‘but I don’t have ..’ type comments. Just say you always use protection no matter what and leave it at that. \n\nAlso, another option… For me personally, Im bi and non-monogamous regardless of SDs, just in my personal life this is what I choose. I always say this to SDs upfront before or during M&G. Bc I’m openly saying I’m going to be intimate with other people from the beginning… there’s usually no issue or pushback with condoms. The few times someone isn’t okay with it (the non monog or the condoms) it’s ended before it’s started so no messiness.\n\nNot saying you’re into non monogamy but feel free to use it if it’s easier to have a reason. Just be prepared if more questions come your way after that hahaha.",
            "author": "AndiAngelWW",
            "id": "gzezp96",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621964810.0,
            "replies": []
        },
        {
            "body": "I barely ejaculate at all. Now I have heard it all. Get rid of that guy.",
            "author": null,
            "id": "gzf3jv0",
            "parent_id": "t3_nkqyyq",
            "score": 5,
            "created_utc": 1621966467.0,
            "replies": [
                {
                    "body": "I know right? Only a few drops. My goodness, he's thought of it all.",
                    "author": "emptyoverflow",
                    "id": "gzgq5pc",
                    "parent_id": "t1_gzf3jv0",
                    "score": 2,
                    "created_utc": 1621993970.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No girl! Fuck this guy! Is he can’t respect your boundaries then he isn’t the right sugar daddy for you",
            "author": "km76896",
            "id": "gzf95j6",
            "parent_id": "t3_nkqyyq",
            "score": 4,
            "created_utc": 1621968713.0,
            "replies": []
        },
        {
            "body": "Fuck that sleezy fuck",
            "author": "SamanthaHendrixxx",
            "id": "gzfb7po",
            "parent_id": "t3_nkqyyq",
            "score": 4,
            "created_utc": 1621969570.0,
            "replies": []
        },
        {
            "body": "BOY BYE 👋",
            "author": null,
            "id": "gzgqhv0",
            "parent_id": "t3_nkqyyq",
            "score": 4,
            "created_utc": 1621994142.0,
            "replies": []
        },
        {
            "body": "\"Hey baby, you don't have to worry about it. I'm so old when I ejaculate it's just a cloud of dust.\"",
            "author": "OldschoolSD",
            "id": "gzhc1do",
            "parent_id": "t3_nkqyyq",
            "score": 4,
            "created_utc": 1622006568.0,
            "replies": []
        },
        {
            "body": "I did a M&G with a man yesterday who seemingly is a great fit. He asked me if I wanted to be his SB and I agreed.\nI live in Idaho so I’d say there aren’t many highly wealthy people here but he has a house, cabin, and another home in Florida so I know the agreement would suit my needs (hopefully). He doesn’t want to agree to any arrangement until we “confirm” it. Which from hearing from you guys yesterday it’s reasonable. So I asked for PPM until he feels comfortable... I told him we needed to use protection while we were talking on the phone and he said “oh no no, I can’t use those things and never have. I don’t understand how any guy can use those, not enjoyable tat all”\nWhich I kinda get but I informed him I was worried about my health and he got offended.",
            "author": "Shyyhoneybadger",
            "id": "gze7vxd",
            "parent_id": "t3_nkqyyq",
            "score": 9,
            "created_utc": 1621952701.0,
            "replies": [
                {
                    "body": "Nothing wrong at all in requiring condoms. Stick to it.",
                    "author": "mraspencer",
                    "id": "gzedvh2",
                    "parent_id": "t1_gze7vxd",
                    "score": 24,
                    "created_utc": 1621955387.0,
                    "replies": []
                },
                {
                    "body": "You're not being unreasonable. Next, next, next. Even if you need the money, even if there isn't a lot of POTs there, this is so disrespectful and the way he handled it was terrible. Do not get into a relationship of any kind with this person.",
                    "author": "TrumpsCovidfefe",
                    "id": "gzee3p4",
                    "parent_id": "t1_gze7vxd",
                    "score": 21,
                    "created_utc": 1621955491.0,
                    "replies": []
                },
                {
                    "body": "Anyone who gets all offended when you ask for protection should be blocked.",
                    "author": "emptyoverflow",
                    "id": "gzgq3ya",
                    "parent_id": "t1_gze7vxd",
                    "score": 2,
                    "created_utc": 1621993944.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Absolutely not. Don’t do it this is a huge red flag. If he doesn’t respect you now he won’t respect you if you’re in bed with him",
            "author": null,
            "id": "gzek9yr",
            "parent_id": "t3_nkqyyq",
            "score": 6,
            "created_utc": 1621958169.0,
            "replies": []
        },
        {
            "body": "Bare sex is a hard limit for me in the bowl. Everyone has their own risk tolerance, but if you want to require condoms that's incredibly normal and not at all unreasonable.",
            "author": "MASugarBaby",
            "id": "gzehnnd",
            "parent_id": "t3_nkqyyq",
            "score": 8,
            "created_utc": 1621957039.0,
            "replies": []
        },
        {
            "body": "Good bye",
            "author": "teach715",
            "id": "gzexwrg",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621964025.0,
            "replies": []
        },
        {
            "body": "Percent of people who use condoms based on Reddit comments on the subject across all subreddits- 99%\n\nPercent of non monogamous people who use condoms based on detailed studies- 30%\n\nAlways wondered if condom use in the Bowl was higher than in the general population since the risk of disaster is actually much greater for the married SDs.  Not for HIV.  That's like 1 in more than a million for a hetero encounter.  And you aren't preventing Herpes or HPV with a condom.  More concerned about them picking up chlamydia or gonorrhea and then giving it to their spouse.   Given that nightmare scenario, it's interesting how many SDs push to not use them.",
            "author": "soicansaywhatiwant",
            "id": "gzf2c3j",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621965951.0,
            "replies": []
        },
        {
            "body": "Nooope next",
            "author": null,
            "id": "gzf3azt",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621966361.0,
            "replies": []
        },
        {
            "body": "Boundaries are not a negotiation. You don't need to give a reason, or defend your reasons. But this guy will never accept that. I wouldn't meet with him at all.",
            "author": "my_NSFW_posts",
            "id": "gzf7yke",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621968243.0,
            "replies": []
        },
        {
            "body": "You’re not being unreasonable at all. If he’s pushing this sexual boundary you’ve set, he’ll push others. Don’t compromise your comfort and safety, drop him, and find someone who will value your comfort and safety. You deserve that, and you deserve to stand up for yourself!",
            "author": "GlitteringPumpkin873",
            "id": "gzf9v00",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621969005.0,
            "replies": []
        },
        {
            "body": "WTF no, he is being unreasonable. An arrangement is short term while your health is for life. He is trying to manipulate you, and clearly doesn’t care about your well being, only sex. I personally wouldn’t even have protected sex with someone whom I knew had HIV/AIDS. Stay away from him and don’t let men push your boundaries. What if by some chance you did contract HIV from sleeping with him? No amount of money is worth possibly contracting HIV.",
            "author": "hannah12121212",
            "id": "gzfg9yp",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621971717.0,
            "replies": []
        },
        {
            "body": "He’s 100% trying to take advantage of an inexperienced uneducated sb. Avoid avoid avoid",
            "author": "russianindianqueen",
            "id": "gzfibgl",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621972572.0,
            "replies": [
                {
                    "body": "Definitely avoiding thanks you guys 😇",
                    "author": "Shyyhoneybadger",
                    "id": "gzfkw3j",
                    "parent_id": "t1_gzfibgl",
                    "score": 3,
                    "created_utc": 1621973668.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lmfao forget this guy. What a fucking idiot. Sperm count doesn’t affect STDs 😫😓",
            "author": "noonisamongus",
            "id": "gzfjxd5",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621973249.0,
            "replies": [
                {
                    "body": "😂 and wouldn’t stand up in court lol",
                    "author": "Shyyhoneybadger",
                    "id": "gzfkdg6",
                    "parent_id": "t1_gzfjxd5",
                    "score": 2,
                    "created_utc": 1621973441.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He wants a gfe..girlfriend experience...in escort terms no condom. One mistake and your life can greatly change..I'd walk away asap..ASAP",
            "author": null,
            "id": "gzfl2hq",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621973745.0,
            "replies": []
        },
        {
            "body": "It’s just gross to have sex with someone you don’t love without a condom. My pH gets out of whack and the next thing you know I’m on antibiotics and have an infection nothing to do with STI’s. Any guy who is insisting on raw is a hell no in my book.",
            "author": "testing1to3",
            "id": "gzfqhii",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621976380.0,
            "replies": []
        },
        {
            "body": "Ew why do men think we are just gonna be willing cum depositories?? Listen, if this guy can’t respect your sexual health boundaries who knows what other boundaries he will be willing to cross, all for his own fucking pleasure. Nasty",
            "author": "littleolivexoxo",
            "id": "gzfrqlm",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621976963.0,
            "replies": []
        },
        {
            "body": "Okay, I am just laughing at that guy because he's so ridiculous, but it's a serious problem that many men can pull this shit and get away with it. Like seriously, \"I hardly ejaculate anything\". Have you NO idea how STDs are spread.",
            "author": "Distinct-Animal-9628",
            "id": "gzfuajm",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621978169.0,
            "replies": []
        },
        {
            "body": "He lies like a lawyer too lol",
            "author": "AdvanceNo8850",
            "id": "gzfvgi8",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621978721.0,
            "replies": []
        },
        {
            "body": "Delete, report and block",
            "author": "Zealousideal_Map8100",
            "id": "gzfxvz0",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621979852.0,
            "replies": []
        },
        {
            "body": "SD here.  I always wear a condom.  I don’t even ask to go without.  I don’t understand those guys.",
            "author": null,
            "id": "gzfzmfk",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621980669.0,
            "replies": []
        },
        {
            "body": "This is the sort of guy that will stealth on you - not to be trusted. Run away.\n\nSTD testing for all partners on a 6 monthly basis and always condoms is my rule.",
            "author": null,
            "id": "gzfzsi8",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621980751.0,
            "replies": []
        },
        {
            "body": "Note that if you choose to move forward with a guy who begrudgingly agrees to the condom, you are higher risk for stealthing, of non-consensual removal of the condom, which is a rape-adjacent act. Don’t ask me how I know.",
            "author": "JSBelle",
            "id": "gzg010b",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621980865.0,
            "replies": []
        },
        {
            "body": "Completely agreed with the majority of comments here.  No excuse for this kind of pressure.  Any decent human would accept this and apologize for even making the suggestion.",
            "author": "Carbonara79",
            "id": "gzg1mte",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621981630.0,
            "replies": []
        },
        {
            "body": "At the end of the day raw sex ain’t worth your life baby dick might not even be all that for hiv something that can cost u your whole life just so u can cum",
            "author": "Jayhere843",
            "id": "gzg3vxo",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621982729.0,
            "replies": []
        },
        {
            "body": "You are being reasonable.",
            "author": "Ray2020K",
            "id": "gzg5zpp",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621983773.0,
            "replies": []
        },
        {
            "body": "Did anyone else catch the part where he inherited his lack of ability to get have children from his parents just saying, not a great argument. \n\nAlso he's completely full of it and you shouldn't have anything to do with him and did he ask you to get tested if not my guess is he didn't ask the girl before you to get tested either. if he was genuinely safe about having unprotected sex he would have asked you to get tested before y'all did anything and to see the paperwork. Never trust anyone when it comes to these things always see the paperwork. You should honestly go in together to get tested together after being exclusive with protection for a while if you ever go with out a condom with anyone. But not this guy this guy you should just not sleep with at all. But in the future with other more gentlemanly sds maybe consider trying internal condom's the kind you wear rather than using the kind he wears. \n\nThe answer is no. You are being completely reasonable.",
            "author": "Ok-Yogurtcloset-931",
            "id": "gzg6xx9",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621984247.0,
            "replies": []
        },
        {
            "body": "Run away from this guy - what a jerk. And there is no way he's clean.",
            "author": "SeaRow",
            "id": "gzg8q0t",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621985148.0,
            "replies": []
        },
        {
            "body": "Omg what a dick!! Lucky for you, you got to find out over text so it's easier to screen him out before you actually have sex. There are WAY too many SDs who want it bareback the first time you have sex and based on my encounters, it's either they:\n\n1. Say no to condoms and getting tested because it's not a good start to an arrangement - and that \"every girl has done it raw with me with no problems\" \n\n2. Say they're okay with condoms, but when you're about to have sex, suddenly beg to do it raw, or immediately try and convince you that \"I won't get you pregnant!!!\"\n\n😕",
            "author": null,
            "id": "gzg9852",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621985407.0,
            "replies": []
        },
        {
            "body": "I would 100% block this guy. The fact that he is pressuring you in a situation such as this is raising so many red flags and reminds me of an experience I had. Still haven’t shown symptoms or tested for anything but terrified one day it might as he lied about everything. Actually the reason why I am no longer a part of the sugar life is him. \nEven if this guy showed you a negative test that wouldn’t mean shit. You don’t know for sure if you have herpes unless you get a swab on a lesion and if you didn’t get that 🤷🏻‍♀️ no one would know. Glad you asked people beforehand, I wish I had. \n\nAlso, side note, somebody once warned me of a man who has a fake test saying he’s clean and gives it to people so they trust him without a condom. \n\nGo with your gut and don’t trust anyone unless you REALLY know them.",
            "author": "rachbabe26",
            "id": "gzga98v",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621985931.0,
            "replies": []
        },
        {
            "body": "The safety issue is for sure something to discuss and not unreasonable to believe one should respect boundaries.  I’m still laughing over the low sperm count and a “few drops” as justification.   I guess “just the tip” and “why would I lie” were taken",
            "author": "VryLckyinLife",
            "id": "gzgbq49",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621986679.0,
            "replies": []
        },
        {
            "body": "When I was an SD I fully expected co doms would be used all the time, and I was happy to do so. You're not asking too much.",
            "author": "RetdSgrDaddy",
            "id": "gzgo1u5",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621992889.0,
            "replies": []
        },
        {
            "body": "Why bother entertaining him? Just block and delete",
            "author": "oforopplos",
            "id": "gzi6w1r",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1622031379.0,
            "replies": []
        },
        {
            "body": "He shouldn't be negging you to go raw, especially since you have spoken your peace. However, it is his prerogative to also decide to end communications there, so he can find an SB who is more in line with what he was looking for.",
            "author": "BigBearSD",
            "id": "gzejg5b",
            "parent_id": "t3_nkqyyq",
            "score": 7,
            "created_utc": 1621957809.0,
            "replies": []
        },
        {
            "body": "Correct me if I'm wrong but I think people are missing the sentiment that you don't actually want to next him, hence you posting on reddit when it's clear you should move to the next. \n\nIf he showed you recent negative tests (or y'all went to go get tested together), y'all have trust built and surely exclusive, I could see why SD is wondering what more needs to be done to go condomless. \n\nAt the end of the day, stand your ground sis, even if it means nexting someone you \"clicked\" with.",
            "author": "perpetually--tired",
            "id": "gzehigr",
            "parent_id": "t3_nkqyyq",
            "score": 3,
            "created_utc": 1621956980.0,
            "replies": []
        },
        {
            "body": "Next this loser or any like him.\n\nThere are plenty of men that are fine and WELCOME having sex with a condom because they value THEMSELVES and YOU.",
            "author": "Federal-Strawberry-8",
            "id": "gzejcma",
            "parent_id": "t3_nkqyyq",
            "score": 4,
            "created_utc": 1621957766.0,
            "replies": []
        },
        {
            "body": "You are not being unreasonable AT ALL. Just block this guy. His complete lack of regard for your health, and comfort is very evident. It’s doubtful that he’s even been checked.",
            "author": "prettylilprostitute",
            "id": "gzempv3",
            "parent_id": "t3_nkqyyq",
            "score": 5,
            "created_utc": 1621959202.0,
            "replies": []
        },
        {
            "body": "Your body your choice, but I wouldn’t pay for condom sex.",
            "author": "subaruguy14",
            "id": "gzfi7cs",
            "parent_id": "t3_nkqyyq",
            "score": 6,
            "created_utc": 1621972525.0,
            "replies": [
                {
                    "body": "Totally your call! Do you get tested often? \nHopefully if a SB doesn’t agree you don’t try to peer pressure 😇",
                    "author": "Shyyhoneybadger",
                    "id": "gzfknb0",
                    "parent_id": "t1_gzfi7cs",
                    "score": 3,
                    "created_utc": 1621973562.0,
                    "replies": [
                        {
                            "body": "There’s no real point in applying pressure, just find a different girl.",
                            "author": "subaruguy14",
                            "id": "gzgdh30",
                            "parent_id": "t1_gzfknb0",
                            "score": 2,
                            "created_utc": 1621987551.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You don’t wanna have sex with a condom, your call, but don’t refer to these arrangements as “condom sex” and vice versa. That’s ignorant. Its a person who makes a choice. Gtfo Subaru.",
                    "author": "rachbabe26",
                    "id": "gzgd3wm",
                    "parent_id": "t1_gzfi7cs",
                    "score": 0,
                    "created_utc": 1621987368.0,
                    "replies": [
                        {
                            "body": "Is it not an accurate description?",
                            "author": "subaruguy14",
                            "id": "gzgde2x",
                            "parent_id": "t1_gzgd3wm",
                            "score": 1,
                            "created_utc": 1621987510.0,
                            "replies": [
                                {
                                    "body": "There’s usually more to an arrangement than “condom sex” or “no condom sex”. One of those things being that there’s an actual person involved. But hey not judging what you want, just keep that in mind",
                                    "author": "rachbabe26",
                                    "id": "gzgeyw6",
                                    "parent_id": "t1_gzgde2x",
                                    "score": 2,
                                    "created_utc": 1621988301.0,
                                    "replies": [
                                        {
                                            "body": "It’s just a monthly lease vs hourly rental model for a sex worker to me.",
                                            "author": "subaruguy14",
                                            "id": "gzgf35l",
                                            "parent_id": "t1_gzgeyw6",
                                            "score": 2,
                                            "created_utc": 1621988361.0,
                                            "replies": [
                                                {
                                                    "body": "Ooo now I hope you are as transparent as this in your bio as well. That way people can add you to the list of people to avoid like this other dude we’re talking about. \nAnd again, since you clearly didn’t get the point, whether you have your “monthly lease” or “hourly rental” we are still talking about a person. Not a car. Maybe just don’t be so disrespectful you know.",
                                                    "author": "rachbabe26",
                                                    "id": "gzggwjd",
                                                    "parent_id": "t1_gzgf35l",
                                                    "score": 1,
                                                    "created_utc": 1621989280.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You’re not being unreasonable for expressing a concern with intimate encounters. If he wants the arrangement that badly then he can respect your boundaries",
            "author": "SellingSexyMILFp2p",
            "id": "gzfb18x",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1621969494.0,
            "replies": []
        },
        {
            "body": "yikes that is a cringe text. Not only is he 100% ignorant, selfish and a dick.. but he totally discounts your request.",
            "author": "SunBunny11",
            "id": "gzfect1",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1621970897.0,
            "replies": []
        },
        {
            "body": "Nope. He doesn't OWN your body. You're not being unreasonable at all, you're being very sensible and responsible. If you get pregnant that's YOUR body going through abortion. Not his. Very toxic behaviour on his part.",
            "author": "MD564",
            "id": "gzfepjw",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1621971048.0,
            "replies": []
        },
        {
            "body": "While everyone should get STD tested regularly if they engaged in activities, no means no.\n\nA lot of SD likes to go without condom. It's pretty much a deal breaker for a lot of them too. If a SB decided it's not worth the risk regardless of the risk then they should inform the SD in advance to save them from troubles down the line.\n\nSo, no, you aren't unreasonable.",
            "author": "Majesticpork",
            "id": "gzfgdt2",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1621971764.0,
            "replies": []
        },
        {
            "body": "LMAOOOO “the lube I use kills sperm cells” that one just killed my brain cells",
            "author": "GalacticNugz",
            "id": "gzfisff",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1621972769.0,
            "replies": [
                {
                    "body": "Hey at least it’s killing something! 😂",
                    "author": "Shyyhoneybadger",
                    "id": "gzfkgr3",
                    "parent_id": "t1_gzfisff",
                    "score": 1,
                    "created_utc": 1621973482.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Where is the laugh-react?!",
            "author": "sallybluntz",
            "id": "gzfmxc5",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1621974549.0,
            "replies": []
        },
        {
            "body": "He doesn’t get it, next him,  SB’s shouldn’t be under any stress about their safety.",
            "author": "DFWCouple4SB",
            "id": "gzfotyf",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1621975608.0,
            "replies": []
        },
        {
            "body": "You are being reasonable.\n\nHe's being totally unreasonable. \n\nYou 100% get to set whatever boundaries you want when it comes to your body. And this guy's response is both ignorant/uninformed and massively inappropriate given that you clearly stated what you're comfortable with. \n\nSorry you had to deal with this.",
            "author": "SwimmingInSugar",
            "id": "gzfu6uy",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1621978119.0,
            "replies": []
        },
        {
            "body": "Next.",
            "author": "Familiar_Substance43",
            "id": "gzfudkc",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1621978210.0,
            "replies": []
        },
        {
            "body": "Got to do what you are comfortable with.  If this is your first time with him he should understand and offer to show you some test results.",
            "author": "RedHeavyG603",
            "id": "gzfy34b",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1621979944.0,
            "replies": []
        },
        {
            "body": "No way, you’re being perfectly reasonable. I ask ALL my SDs to get std screen AND still REQUIRE condoms. I’ve hardly had issues. \nI let them know that 75% of people who have an STD go without symptoms at all. I also offer an STD test on my own side so they know it’s both ways but NEVER do I do it without condoms. Nope nope nope",
            "author": null,
            "id": "gzfyp5r",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1621980233.0,
            "replies": []
        },
        {
            "body": "I do not think that you are unreasonable. You’re trying to protect yourself! Good for you for standing up for yourself.",
            "author": "Maddx82",
            "id": "gzg0297",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1621980880.0,
            "replies": []
        },
        {
            "body": "He's being unreasonable by trying to corerce you into going to pound town nekked headed. What kind of child predator type MF says it's only a couple drops like a grown woman wouldn't know any better????",
            "author": "lowyellyow",
            "id": "gzg0n5h",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1621981157.0,
            "replies": []
        },
        {
            "body": "No means no.",
            "author": "hal99514",
            "id": "gzgb168",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1621986330.0,
            "replies": []
        },
        {
            "body": "Ew.",
            "author": "peachersa",
            "id": "gzggqfi",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1621989196.0,
            "replies": []
        },
        {
            "body": "bs to that guy",
            "author": "bookworm010101",
            "id": "gzgheao",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1621989529.0,
            "replies": []
        },
        {
            "body": "Boy howdy, that's not how science works.",
            "author": "HarleyPuddinPop",
            "id": "gzgnz2p",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1621992851.0,
            "replies": []
        },
        {
            "body": "Don’t go bare unless you naturally make the decision. I would never go bare with a man i didn’t intend to have children with IMO.",
            "author": "luhshawty",
            "id": "gzh1fjf",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1622000015.0,
            "replies": []
        },
        {
            "body": "I use condoms for a month or two and then when trust builds can discuss making a change.",
            "author": "vagatarian",
            "id": "gzh3kmo",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1622001273.0,
            "replies": []
        },
        {
            "body": "Not unreasonable at all, hes gross and pushy. 🤢 also what magic all killing lube is this lmao",
            "author": "sundriedflowers",
            "id": "gzhuuy4",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1622022495.0,
            "replies": []
        },
        {
            "body": "Wow 😮 Dont even go there . Say No and good bye . There a plenty better out there",
            "author": "Smileyjulienne",
            "id": "gzhv64h",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1622022773.0,
            "replies": []
        },
        {
            "body": "His message is blah, blah, blah... sorry to say!",
            "author": "your_right11",
            "id": "gzi6rnc",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1622031306.0,
            "replies": []
        },
        {
            "body": "In my opinion pressuring someone to have sex without a condom when they dont want to is a huge factor and stems from rape culture. Anything where you are being coerced and being made to think you may be being unreasonable in your request is not a good sign. Especially in sexual relationships. He knows better and knows what he is doing. Just trying to get his way. I wish guys like this put their and others health and livelihood over getting their dicks wet. Like it is a condom stop bitching about it or just dont get any pussy at all simple as that.",
            "author": "honeybunZania",
            "id": "gzih9g3",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1622036794.0,
            "replies": []
        },
        {
            "body": "Nope!! Not at all.",
            "author": "Puzzleheaded-80",
            "id": "gzii5q0",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1622037214.0,
            "replies": []
        },
        {
            "body": "Just move on. It seems like a non-negotiable issue for both of you. At this point, I wouldn't trust that person to even respect your choices",
            "author": "purpleyogi",
            "id": "gzjk49j",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1622052930.0,
            "replies": []
        },
        {
            "body": "I don't know why women even entertain arguments about his.\n\n\"I can't risk HIV\"... Really, that oughta just be assumed.\n\n\"But I don't have HIV\"... Like anyone's ever responded by saying OK, ya, I do....\n\nIf there were some genetic thing in his family... He, and his family, wouldn't be here.",
            "author": "wackapoof",
            "id": "gzk2qd1",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1622060697.0,
            "replies": []
        },
        {
            "body": "From a SD.\n\nDepends on your relationship.                                                                                                                   \nIf it is just a pay as you go / monthly stipend. Then that is not an emotional relationship.                     So NO you are NOT unreasonable.                                                                                                                    If you think the guy paying you is unreasonable to ask what he did. Then Just move on.\n\nHowever if it is a real SD/SB \"relationship\" there is more too it.                                                                                            He should just find a SB that wants what hw wants.\n\nIn reality he should be more afraid of getting something from you.                                                              And if he got you pregnant, well lets not get in to that. That is a whole other discussion.\n\nJust move on.",
            "author": "jerry10101010",
            "id": "gzkyeme",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1622075532.0,
            "replies": []
        },
        {
            "body": "This shit is so disgusting. I NEVER go condom free with an SD. Got stealthed by one that I'd been in an attachment with for over a year, and that was after he got Chlamydia from another girl. These guys are just Johns. \n\nI had one guy try to convince me that people \"in the lifestyle\" are cleaner, which is the stupidest thing I've ever heard. People in the lifestyle? You mean college girls trying to make rent? SA advertisers to women that sugar dating is a great source of second income --- it's sex work. Anyone who says otherwise had their head up their ass. And anyone trying to bang sex workers workout condoms just doesn't give a shit about their health or yours. Fuck that guy.",
            "author": "raeraerawraw",
            "id": "gzmm90z",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1622117810.0,
            "replies": []
        },
        {
            "body": "Lube that kills sperm? That’s a first lol \n\nYour boundaries are reasonable and you’ll find a man who respects them💕",
            "author": "Sweetiexoxoxo",
            "id": "gzeeysc",
            "parent_id": "t3_nkqyyq",
            "score": 4,
            "created_utc": 1621955877.0,
            "replies": [
                {
                    "body": "Spermicidal lubricant is a real thing, but my understanding is that it's not good for your lady parts, and it's nowhere near as safe as a condom (for any purposes).  100% agree that OP should next this dude.",
                    "author": "Inquisitive_SD",
                    "id": "gzeg1xy",
                    "parent_id": "t1_gzeeysc",
                    "score": 14,
                    "created_utc": 1621956356.0,
                    "replies": [
                        {
                            "body": "Seconding all of this. \n\nSpermicide is never a good first choice of birth control, and if the woman has the pill or anything else reliable, I would never use it. It's rather irritating to a very delicate area and regular use can make you more susceptible to catching infection because of the damages it causes.",
                            "author": "MASugarBaby",
                            "id": "gzehizs",
                            "parent_id": "t1_gzeg1xy",
                            "score": 4,
                            "created_utc": 1621956986.0,
                            "replies": []
                        },
                        {
                            "body": "Very interesting. I’ve got some research to do lol",
                            "author": "Sweetiexoxoxo",
                            "id": "gzegzjb",
                            "parent_id": "t1_gzeg1xy",
                            "score": 1,
                            "created_utc": 1621956763.0,
                            "replies": [
                                {
                                    "body": "It's commonly used by couples in fertility treatments.  They can maintain their sex life while not risking natural pregnancy (counter-intuitive I know since they're aiming for pregnancy but with the amount of money committed to it and the higher success rate, it makes sense)",
                                    "author": "Church42",
                                    "id": "gzehlsc",
                                    "parent_id": "t1_gzegzjb",
                                    "score": 2,
                                    "created_utc": 1621957017.0,
                                    "replies": []
                                },
                                {
                                    "body": "It's possible the stuff isn't even on the market anymore, so you not knowing about it might not be strange at all.  I just know it was a thing because I used to exclusively use condoms with spermicidal lube on them back when I was in college and didn't know any better.  Later, I heard there were studies showing it causes damage to your lady bits and so I stopped using it.  This dude might have a 20-year-old tube of it still sitting around 😂",
                                    "author": "Inquisitive_SD",
                                    "id": "gzehmf2",
                                    "parent_id": "t1_gzegzjb",
                                    "score": 2,
                                    "created_utc": 1621957025.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">Lube that kills sperm? That’s a first lol \n\nIt is a real thing though\n\nBut OP should stick to what she's comfortable with",
                    "author": "Church42",
                    "id": "gzegq2h",
                    "parent_id": "t1_gzeeysc",
                    "score": 3,
                    "created_utc": 1621956649.0,
                    "replies": []
                },
                {
                    "body": "That lube one really got me 😂",
                    "author": null,
                    "id": "gzefagj",
                    "parent_id": "t1_gzeeysc",
                    "score": 2,
                    "created_utc": 1621956021.0,
                    "replies": [
                        {
                            "body": "Right, some men will say anything lmfaooo. I had one guy say using condoms gives him ptsd😂",
                            "author": "Sweetiexoxoxo",
                            "id": "gzefwlw",
                            "parent_id": "t1_gzefagj",
                            "score": 2,
                            "created_utc": 1621956291.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do not break away from condom use...unless you want to without being pressured !!!!!!",
            "author": null,
            "id": "gzfkln1",
            "parent_id": "t3_nkqyyq",
            "score": 2,
            "created_utc": 1621973542.0,
            "replies": []
        },
        {
            "body": "You are bring tolerant and he's being moron. I'm not opposed to not using condoms if both parties can provide valid tests from a reputable source or clinic. Until then I'm gonna wrap it.",
            "author": "nickksd69",
            "id": "gzexiov",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1621963851.0,
            "replies": []
        },
        {
            "body": "Guy is being an a-hole. I certainly prefer without, but if someone wants me to wear one I will wear one",
            "author": "thesuitelife2010",
            "id": "gzelfou",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1621958649.0,
            "replies": [
                {
                    "body": "Which I agree with, but the first few times? I normally wait 6 months in a vanilla before going without",
                    "author": "Shyyhoneybadger",
                    "id": "gzem203",
                    "parent_id": "t1_gzelfou",
                    "score": 5,
                    "created_utc": 1621958913.0,
                    "replies": [
                        {
                            "body": "I hear you, and I would respect that. But eh I must confess to being quite a bit more risky than that in my own life. Testing shows I've gotten away with it, but I know it's risky. But I also see from other people it's pretty common",
                            "author": "thesuitelife2010",
                            "id": "gzeo3ve",
                            "parent_id": "t1_gzem203",
                            "score": 0,
                            "created_utc": 1621959803.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Only a couple of drops? WTF is wrong with him? I can fill a 7-11 SuperGulp cup. 😬",
            "author": "non_giant_panda",
            "id": "gzesfrx",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1621961658.0,
            "replies": []
        },
        {
            "body": "OMG you're not being unreasonable at all. Next this dude. If he's this pushy now, imagine how pushy he'll be later. \n\nAnyone who INSISTS on unprotected sex is IMO a higher risk bc you know he's done it before. And lemme guess, if you ask to see test results he'll refuse and argue.",
            "author": "emptyoverflow",
            "id": "gzgpoxt",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1621993730.0,
            "replies": []
        },
        {
            "body": "You're not being unreasonable, and neither is he. You just want different things. If there is no compromise to be had, move on.",
            "author": "tyranthraxxus",
            "id": "gzeu59x",
            "parent_id": "t3_nkqyyq",
            "score": -1,
            "created_utc": 1621962397.0,
            "replies": [
                {
                    "body": "She said no and he still pushed it. He definitely is being unreasonable.",
                    "author": "MD564",
                    "id": "gzffevh",
                    "parent_id": "t1_gzeu59x",
                    "score": 5,
                    "created_utc": 1621971351.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We both test neg, agree to exclusivity, and go bare with pull out. She is on the pill.  We are as safe as one can be. Believe it, your 68 yr old lawyer's 68 yr old wife is not a threat of STDS. She stopped having sex 15 years ago. \n\nOf course a lawyer---you know how to tell they are lying right?",
            "author": "GSSD",
            "id": "gzeui5r",
            "parent_id": "t3_nkqyyq",
            "score": -2,
            "created_utc": 1621962556.0,
            "replies": [
                {
                    "body": "Because their lips are moving?",
                    "author": "pussy_impaler337",
                    "id": "gzgwcv0",
                    "parent_id": "t1_gzeui5r",
                    "score": 2,
                    "created_utc": 1621997208.0,
                    "replies": [
                        {
                            "body": "Got it!",
                            "author": "GSSD",
                            "id": "gzi6p3e",
                            "parent_id": "t1_gzgwcv0",
                            "score": 1,
                            "created_utc": 1622031262.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Its you're body so its up to you what you like.  Similarly.if he has  been seeing you for a while its up to him if he wants to continue.\n\nThis was one of the reasons both my long term.sr ended.  Sex with a condom is boring.",
            "author": "wb19081908",
            "id": "gzg5ilk",
            "parent_id": "t3_nkqyyq",
            "score": 0,
            "created_utc": 1621983537.0,
            "replies": []
        },
        {
            "body": "It's your life and your comfort level. If he wants it and you don't then you aren't on the same page and you both need to move on and find what does fit. You can't put a square peg into a round hole.",
            "author": "DesertWolf39",
            "id": "gzffi9j",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1621971390.0,
            "replies": []
        },
        {
            "body": "One thing to add is if your concern is HIV you can look into taking PREP too, which prevents someone catching HIV. For me this is the real biggest STD risk, and if I go back to some of my older promiscuous ways I may take it as a precaution",
            "author": "thesuitelife2010",
            "id": "gzflcoq",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1621973867.0,
            "replies": []
        },
        {
            "body": "I thought this subreddit was for sugar pine 7",
            "author": "MKat__",
            "id": "gzfld5p",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1621973873.0,
            "replies": [
                {
                    "body": "?",
                    "author": "Shyyhoneybadger",
                    "id": "gzfmfzh",
                    "parent_id": "t1_gzfld5p",
                    "score": 1,
                    "created_utc": 1621974340.0,
                    "replies": [
                        {
                            "body": "The show. It’s called Sugar Pine 7: Alternative Lyfestyle. You could see how I get confused.",
                            "author": "MKat__",
                            "id": "gzfmldz",
                            "parent_id": "t1_gzfmfzh",
                            "score": 1,
                            "created_utc": 1621974406.0,
                            "replies": [
                                {
                                    "body": "Hahaha! I’m sure you were like “what the heck am I reading! 😅",
                                    "author": "Shyyhoneybadger",
                                    "id": "gzfn2az",
                                    "parent_id": "t1_gzfmldz",
                                    "score": 1,
                                    "created_utc": 1621974608.0,
                                    "replies": [
                                        {
                                            "body": "If it helps, safe sex is always awesome.",
                                            "author": "MKat__",
                                            "id": "gzfn99w",
                                            "parent_id": "t1_gzfn2az",
                                            "score": 2,
                                            "created_utc": 1621974693.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gzfo5uc",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1621975284.0,
            "replies": [
                {
                    "body": "Thank you! I think I definitely got defensive when it came to disagreeing with him on this, I’ll work better on this!",
                    "author": "Shyyhoneybadger",
                    "id": "gzfodtj",
                    "parent_id": "t1_gzfo5uc",
                    "score": 2,
                    "created_utc": 1621975396.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hate hate hate hate condoms, but if she says I have to wear one, I do. I don’t treat that as a negotiation point. Having an uncomfortable sexual partner is worse than having no sexual partner.",
            "author": "sdburner",
            "id": "gzfp2se",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1621975725.0,
            "replies": []
        },
        {
            "body": "I think you’re completely correct and you’re making the right decision….but maybe next time you phrase it a bit differently. This sounds like you’re telling him you think he’s sick, and I can see how that can sound really insulting. You could just say this is a personal rule you have.",
            "author": null,
            "id": "gzfszn4",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1621977553.0,
            "replies": []
        },
        {
            "body": "No totally not. That’s not something I’d bring up right away, or possibly ever",
            "author": "401kisfun",
            "id": "gzfzg5g",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1621980585.0,
            "replies": []
        },
        {
            "body": "Why not get tested and get results sent to both parties? But your body your choice in the end.",
            "author": "entwie_dumayla",
            "id": "gzg0fp3",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1621981058.0,
            "replies": [
                {
                    "body": "I have a hard time with that right now because we’ve now been going back and forth with the conversation all day and he hasn’t stopped being pushy about it so, I think the next time it arises I’ll definitely just ask for them to be tested but I think my relationship with this man can’t be mended",
                    "author": "Shyyhoneybadger",
                    "id": "gzg53i4",
                    "parent_id": "t1_gzg0fp3",
                    "score": 4,
                    "created_utc": 1621983327.0,
                    "replies": [
                        {
                            "body": "Do what's best for yourself. Best of luck to you.",
                            "author": "entwie_dumayla",
                            "id": "gzg60bx",
                            "parent_id": "t1_gzg53i4",
                            "score": 1,
                            "created_utc": 1621983782.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve gone bare with SBs, but only after a few weeks of intimacy with protection and a discussion about the risks",
            "author": "garbagecomm",
            "id": "gzgkpdn",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1621991189.0,
            "replies": []
        },
        {
            "body": "I don’t think any of the girls I’ve banged from SA have asked for protection.   If you want him to wear a condom and not doing so would be past your limit of what you’re ok with then say so.  I’d definitely next you but maybe this dude will keep you around",
            "author": "pussy_impaler337",
            "id": "gzgoinw",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1621993131.0,
            "replies": [
                {
                    "body": "Lol@your username",
                    "author": "Shyyhoneybadger",
                    "id": "gzgsnl0",
                    "parent_id": "t1_gzgoinw",
                    "score": 5,
                    "created_utc": 1621995251.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Always pull out trick…",
            "author": "xalchymia",
            "id": "gzh1tyd",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1622000243.0,
            "replies": []
        },
        {
            "body": "Both people need to be on the same page about protection and testing for any relationship to be successful",
            "author": "blk-tye",
            "id": "gzhl8g5",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1622013741.0,
            "replies": []
        },
        {
            "body": "Its this simple, its respect if my partner has any concerns it my obligation to act accordingly.\n\nForget disease accidents can happen, its just being prudent.\n\nYou dont want to thats good enough it really doesn't matter yiur reasons on something like that, you are not married.\n\nIf he has issues Cumming with a condom than he should have stated that......thats different.  But he didn't so",
            "author": "Momopllc",
            "id": "gziujr2",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1622042389.0,
            "replies": []
        },
        {
            "body": "  Why make a huge deal out of it?  He requires no condom.  You require condom.  You have not agreed to a mutually beneficial agreement so just move on.",
            "author": "Insearch69",
            "id": "gzjeefl",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1622050561.0,
            "replies": []
        },
        {
            "body": "It’s not unreasonable to be protected, if both parties are willing to compromise you both can go for tests",
            "author": "ChrissyD12",
            "id": "gzjwk4u",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1622058127.0,
            "replies": []
        },
        {
            "body": "EWWWWWWWWWWWWWWW",
            "author": "77hr0waway",
            "id": "hyoexcn",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1645988380.0,
            "replies": []
        },
        {
            "body": "I need to get myself that sti killer lube…",
            "author": "daddys-back",
            "id": "hztk1ja",
            "parent_id": "t3_nkqyyq",
            "score": 1,
            "created_utc": 1646733931.0,
            "replies": []
        },
        {
            "body": "I am more of a “short and cute” type and I come off 💯 innocent so I think he’s definitely trying to completely control my thinking on this. When I first spoke with him he was very like “be careful, be safe, always second guess, maybe you shouldn’t meet with any other guy and just meet me” and now he is like this. You guys all gave me confirmation and more of a backbone :)",
            "author": "Shyyhoneybadger",
            "id": "gzf65fh",
            "parent_id": "t1_gzenlq9",
            "score": 91,
            "created_utc": 1621967537.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gzfiz6l",
                    "parent_id": "t1_gzf65fh",
                    "score": 36,
                    "created_utc": 1621972846.0,
                    "replies": [
                        {
                            "body": "It’s rough, IMO I think there is a kind of kink for the short cute girls... not that it’s a bad thing 😇",
                            "author": "Shyyhoneybadger",
                            "id": "gzfj71h",
                            "parent_id": "t1_gzfiz6l",
                            "score": 20,
                            "created_utc": 1621972936.0,
                            "replies": [
                                {
                                    "body": "I like short cute girls 😊 but that doesn't mean I have to be a jerk and try to control you out make you do things you're not comfortable with. Show that guy the highway. You can do better.",
                                    "author": "SDSFBA",
                                    "id": "gzfn1iq",
                                    "parent_id": "t1_gzfj71h",
                                    "score": 11,
                                    "created_utc": 1621974599.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yes there is that kink. In sopranos a line was big chest little feet..a hit in any man's league. But yes as a default most men will take short n cute.",
                                    "author": null,
                                    "id": "gzfkvsc",
                                    "parent_id": "t1_gzfj71h",
                                    "score": 6,
                                    "created_utc": 1621973664.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "That's exactly what they are doing! You even see men right here in this group doing it. Please be careful. These men aren't worth it.",
                            "author": "clair-cummings",
                            "id": "gzhlfz2",
                            "parent_id": "t1_gzfiz6l",
                            "score": 6,
                            "created_utc": 1622013926.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gzi5vnw",
                            "parent_id": "t1_gzfiz6l",
                            "score": 6,
                            "created_utc": 1622030770.0,
                            "replies": [
                                {
                                    "body": "Ditto!",
                                    "author": "Puzzleheaded-80",
                                    "id": "gziiezp",
                                    "parent_id": "t1_gzi5vnw",
                                    "score": 2,
                                    "created_utc": 1622037335.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gzgn29l",
                            "parent_id": "t1_gzfiz6l",
                            "score": 2,
                            "created_utc": 1621992380.0,
                            "replies": [
                                {
                                    "body": "The word you are looking for is \"masculine guilt\" 🤦‍♀️",
                                    "author": "clair-cummings",
                                    "id": "gzhljn7",
                                    "parent_id": "t1_gzgn29l",
                                    "score": 2,
                                    "created_utc": 1622014014.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "His behavior hasn’t changed. He’s trying to control you and being manipulative about it. He wasn’t caring in the beginning, he was trying to control the way you saw/trusted him and treated the arrangement. Run the other direction 🚩🚩🚩🚩",
                    "author": "tiredofmyownself",
                    "id": "gzfxx53",
                    "parent_id": "t1_gzf65fh",
                    "score": 14,
                    "created_utc": 1621979868.0,
                    "replies": []
                },
                {
                    "body": "Beyond this obvious attempt at intimidation,  arrangements work when goals, expectations and actions are compatible.  If there is no sign of understanding in the first re-statement of your expectations then it is time to eject.  Story after story here starts with two or more compromises in the face of attempted intimidation, negotiation, extortion  ......  and the stories have fewer happy endings than purchasing lottery tickets. But there never is a grand winner.",
                    "author": "pinotandsugar",
                    "id": "gzfw3a8",
                    "parent_id": "t1_gzf65fh",
                    "score": 3,
                    "created_utc": 1621979016.0,
                    "replies": []
                },
                {
                    "body": "Yes short and cute get bossed around...be carefull.",
                    "author": null,
                    "id": "gzfkowc",
                    "parent_id": "t1_gzf65fh",
                    "score": 2,
                    "created_utc": 1621973581.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gzfs0eh",
            "parent_id": "t1_gzenlq9",
            "score": 12,
            "created_utc": 1621977094.0,
            "replies": [
                {
                    "body": "IT ONLY TAKES ONE.",
                    "author": null,
                    "id": "gzfuw2b",
                    "parent_id": "t1_gzfs0eh",
                    "score": 8,
                    "created_utc": 1621978455.0,
                    "replies": []
                },
                {
                    "body": "\"Low sperm count\" has replaced the \"only in a little ways\" of yesteryear",
                    "author": "pinotandsugar",
                    "id": "gzfwcd8",
                    "parent_id": "t1_gzfs0eh",
                    "score": 10,
                    "created_utc": 1621979134.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He is in his late 60s.. so I’m guessing that’s what he is meaning?\nHe is a lawyer (his firm is under his name) and he has taken me to his office and given me his full real name. But he is saying I’m being too worried like something bad is going to happen. I’m just making sure something bad DOESNT happen.",
            "author": "Shyyhoneybadger",
            "id": "gzeeyy1",
            "parent_id": "t1_gzee95k",
            "score": 42,
            "created_utc": 1621955878.0,
            "replies": [
                {
                    "body": "If you don't feel comfortable without protection, don't do it and find someone who will.",
                    "author": "TwoInSympathy",
                    "id": "gzef6lq",
                    "parent_id": "t1_gzeeyy1",
                    "score": 64,
                    "created_utc": 1621955973.0,
                    "replies": [
                        {
                            "body": "Okay! I just needed confirmation that I wasn’t being unreasonable as now he is saying I’m the only one that’s ever asked that 🙃\nHe is a lawyer so I’m guessing he is just using his lawyer speak on me ha",
                            "author": "Shyyhoneybadger",
                            "id": "gzeg99c",
                            "parent_id": "t1_gzef6lq",
                            "score": 39,
                            "created_utc": 1621956445.0,
                            "replies": [
                                {
                                    "body": "Him saying that you are the only one that’s ever asked that means he regularly has unprotected sex- more reason to run !",
                                    "author": "prettylilprostitute",
                                    "id": "gzf1c0j",
                                    "parent_id": "t1_gzeg99c",
                                    "score": 43,
                                    "created_utc": 1621965517.0,
                                    "replies": []
                                },
                                {
                                    "body": "Putting your safety first is never unreasonable.",
                                    "author": "TwoInSympathy",
                                    "id": "gzegptt",
                                    "parent_id": "t1_gzeg99c",
                                    "score": 35,
                                    "created_utc": 1621956646.0,
                                    "replies": []
                                },
                                {
                                    "body": "Oh heck no, I feel most here aren’t saying “ya! lemme duck and suck without a condom! I’m totally okay with that and trust you babe xx” smh gaslighting mf \nYour concerns should be validated and taken seriously, next",
                                    "author": "xonlyjade",
                                    "id": "gzf4bzq",
                                    "parent_id": "t1_gzeg99c",
                                    "score": 10,
                                    "created_utc": 1621966791.0,
                                    "replies": [
                                        {
                                            "body": "Thank you! ♥️💕",
                                            "author": "Shyyhoneybadger",
                                            "id": "gzf5tut",
                                            "parent_id": "t1_gzf4bzq",
                                            "score": 1,
                                            "created_utc": 1621967404.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Anyone who won’t use protection is concerning. Move on.  There are others out there:)",
                                    "author": null,
                                    "id": "gzf3v96",
                                    "parent_id": "t1_gzeg99c",
                                    "score": 10,
                                    "created_utc": 1621966605.0,
                                    "replies": []
                                },
                                {
                                    "body": "> He is a lawyer\n\nPerhaps Shakespeare was right",
                                    "author": "pinotandsugar",
                                    "id": "gzfwlt5",
                                    "parent_id": "t1_gzeg99c",
                                    "score": 2,
                                    "created_utc": 1621979257.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Don't have sex without a condom. He is likely to be having sex with many girls and you will get passed anything they have.",
                    "author": "Worldly_Forever_9353",
                    "id": "gzekyr0",
                    "parent_id": "t1_gzeeyy1",
                    "score": 29,
                    "created_utc": 1621958461.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just to be clear, that's 15% of the 1.2M people in the US with HIV.  or 180,000 people or less than 1/3 the number of people that died of covid.\n\nSo given that HIV positivity is less than 1/3 of 1% of the us population, and people that don't know they have it are 15% of that, that means less than 5% of 1% of the population has it and doesn't know.  Or less than .0005.\n\nIf you also consider that the vast majority of HIV positive people probably fall in demographics you're unlikely to interact with, and that if you're engaging in strictly hetero or strictly homo-sexual activity that further reduces the number of possible infected partners to potentially half that number, your odds of winning a major lottery prize are far better than interacting with someone that is unaware they have HIV.  Finally the rates of transmission from hetero vaginal sex is far less than anal sex.\n\nYou're now at .000025 or less.  You are far more likely to die by covid, auto accident..  and i wouldn't be surprised if dying in an airplane crash wasn't more likely.\n\nNot to say that you shouldn't take sensible precautions, including condoms... but I wouldn't be paranoid about HIV even if you don't.  Plus condoms reduce pregnancy risk and other STI's, but HIV is such a small risk in the US with standard sex that using this as an excuse is silly.",
            "author": "Acrobatic_Half_6631",
            "id": "gzhesoy",
            "parent_id": "t1_gzevswi",
            "score": 1,
            "created_utc": 1622008572.0,
            "replies": [
                {
                    "body": "HIV is just one of many things to be concerned about. His lack of respect for her health is what is most concerning.",
                    "author": "clair-cummings",
                    "id": "gzhlurb",
                    "parent_id": "t1_gzhesoy",
                    "score": 5,
                    "created_utc": 1622014282.0,
                    "replies": []
                },
                {
                    "body": "That risk might be low.\n\nBut there are others.\n\nI always ask the lady. If not previously discussed, right before insertion... (typically, women who want me to use a condom have already let me know..)  If they are OK with it I'll let them know I've been \"snipped\"....\n\nBut really, especially first time I meet someone, arguing with her over this is dumb. Worse idea than trying to negotiate a rate. Just suit up.",
                    "author": "wackapoof",
                    "id": "gzk6132",
                    "parent_id": "t1_gzhesoy",
                    "score": 1,
                    "created_utc": 1622062107.0,
                    "replies": [
                        {
                            "body": "I didn't say you should argue with anyone about it.  I also said you should in fact use condoms for other reasons.  I said, however that using HIV specifically as your excuse, or worrying about it is silly.  \n\nThere are far bigger risks to worry about.  In fact the odds of getting pregnant, even when using condoms are significantly higher than your odds of getting HIV when not using condoms, unless you're engaging with high risk individuals, in higher risk scenarios.",
                            "author": "Acrobatic_Half_6631",
                            "id": "gzlqkzt",
                            "parent_id": "t1_gzk6132",
                            "score": 1,
                            "created_utc": 1622091782.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Love this.",
            "author": "Distinct-Animal-9628",
            "id": "gzfuoww",
            "parent_id": "t1_gzexzlz",
            "score": 3,
            "created_utc": 1621978360.0,
            "replies": []
        },
        {
            "body": "UK is my specialty. HPV vaccine is offered now to both boys and girls from age 12 and is free up to age 25. [https://www.nhs.uk/conditions/vaccinations/hpv-human-papillomavirus-vaccine/](https://www.nhs.uk/conditions/vaccinations/hpv-human-papillomavirus-vaccine/)\n\nThe vaccine is also recommended for the same age group in the US.\n\nIn the UK, the commonly known cervical smear test now primarily tests for HPV, so ladies should attend their free screening. Some areas are now piloting the self-testing as well and the uptake is very good so hopefully it will be commonly rolled out within the next couple of years.\n\n/freehealthplugoff",
            "author": "AnSteall",
            "id": "gzf3224",
            "parent_id": "t1_gzerphd",
            "score": 4,
            "created_utc": 1621966256.0,
            "replies": [
                {
                    "body": "Just remember that the vaccine - which yes everyone should embrace - only covers a handful of strains and there are over 200 known variants of HPV.",
                    "author": "DarkDelightsShop",
                    "id": "gzf4ydz",
                    "parent_id": "t1_gzf3224",
                    "score": 14,
                    "created_utc": 1621967040.0,
                    "replies": [
                        {
                            "body": "That's viruses for you.",
                            "author": "AnSteall",
                            "id": "gzf5jnh",
                            "parent_id": "t1_gzf4ydz",
                            "score": 3,
                            "created_utc": 1621967284.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "In the US, you can get it up to age like 46? if your doctor decides it’s recommended (usually high risk sexual activity).",
                    "author": "n00b_to_this",
                    "id": "gzfteh9",
                    "parent_id": "t1_gzf3224",
                    "score": 2,
                    "created_utc": 1621977748.0,
                    "replies": [
                        {
                            "body": "I wasn't sure, and a little extra education never hurts so I checked it out.\n\nFrom the CDC:  \nVaccine Recommendations  \nHPV vaccine is recommended for routine vaccination at age 11 or 12 years. (Vaccination can be started at age 9.)  \nACIP also recommends vaccination for everyone through age 26 years if not adequately vaccinated previously. HPV vaccination is given as a series of either two or three doses, depending on age at initial vaccination.  \nVaccination is not recommended for everyone older than age 26 years. However, some adults ages 27 through 45 years may decide to get the HPV vaccine based on discussion with their clinician, if they did not get adequately vaccinated when they were younger. HPV vaccination of people in this age range provides less benefit, for several reasons, including that more people in this age range have already been exposed to HPV.  \nFor adults ages 27 through 45 years, clinicians can consider discussing HPV vaccination with people who are most likely to benefit. HPV vaccination does not need to be discussed with most  adults over age 26 years.",
                            "author": "DarkDelightsShop",
                            "id": "gzg1kfe",
                            "parent_id": "t1_gzfteh9",
                            "score": 4,
                            "created_utc": 1621981598.0,
                            "replies": [
                                {
                                    "body": "Yeah if you're older than 45 you have to sometimes argue/demand it and pay for it out of pocket. They'll say \"oh you already have all the HPV you don't need this\" but why not get it anyhow.",
                                    "author": "emptyoverflow",
                                    "id": "gzgq0m2",
                                    "parent_id": "t1_gzg1kfe",
                                    "score": 1,
                                    "created_utc": 1621993897.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I seriously worry for these newbies.",
            "author": "ExExpectations",
            "id": "gzexwoq",
            "parent_id": "t1_gzedxys",
            "score": 6,
            "created_utc": 1621964025.0,
            "replies": []
        },
        {
            "body": ">  Which means you two aren't a match.\n\nIt's just that simple",
            "author": "pinotandsugar",
            "id": "gzfwzld",
            "parent_id": "t1_gzedxys",
            "score": 2,
            "created_utc": 1621979435.0,
            "replies": []
        },
        {
            "body": "With the power dynamics in Sugar women need to be very nonnegotiable with boundaries and focus on their self confidence, self worth and self love because no amount of money is worth your self respect.",
            "author": "LaFilleWhoCantFrench",
            "id": "gzew99w",
            "parent_id": "t1_gzehv6u",
            "score": 12,
            "created_utc": 1621963304.0,
            "replies": []
        },
        {
            "body": "I know right? Only a few drops. My goodness, he's thought of it all.",
            "author": "emptyoverflow",
            "id": "gzgq5pc",
            "parent_id": "t1_gzf3jv0",
            "score": 2,
            "created_utc": 1621993970.0,
            "replies": []
        },
        {
            "body": "Nothing wrong at all in requiring condoms. Stick to it.",
            "author": "mraspencer",
            "id": "gzedvh2",
            "parent_id": "t1_gze7vxd",
            "score": 24,
            "created_utc": 1621955387.0,
            "replies": []
        },
        {
            "body": "You're not being unreasonable. Next, next, next. Even if you need the money, even if there isn't a lot of POTs there, this is so disrespectful and the way he handled it was terrible. Do not get into a relationship of any kind with this person.",
            "author": "TrumpsCovidfefe",
            "id": "gzee3p4",
            "parent_id": "t1_gze7vxd",
            "score": 21,
            "created_utc": 1621955491.0,
            "replies": []
        },
        {
            "body": "Anyone who gets all offended when you ask for protection should be blocked.",
            "author": "emptyoverflow",
            "id": "gzgq3ya",
            "parent_id": "t1_gze7vxd",
            "score": 2,
            "created_utc": 1621993944.0,
            "replies": []
        },
        {
            "body": "Definitely avoiding thanks you guys 😇",
            "author": "Shyyhoneybadger",
            "id": "gzfkw3j",
            "parent_id": "t1_gzfibgl",
            "score": 3,
            "created_utc": 1621973668.0,
            "replies": []
        },
        {
            "body": "😂 and wouldn’t stand up in court lol",
            "author": "Shyyhoneybadger",
            "id": "gzfkdg6",
            "parent_id": "t1_gzfjxd5",
            "score": 2,
            "created_utc": 1621973441.0,
            "replies": []
        },
        {
            "body": "Totally your call! Do you get tested often? \nHopefully if a SB doesn’t agree you don’t try to peer pressure 😇",
            "author": "Shyyhoneybadger",
            "id": "gzfknb0",
            "parent_id": "t1_gzfi7cs",
            "score": 3,
            "created_utc": 1621973562.0,
            "replies": [
                {
                    "body": "There’s no real point in applying pressure, just find a different girl.",
                    "author": "subaruguy14",
                    "id": "gzgdh30",
                    "parent_id": "t1_gzfknb0",
                    "score": 2,
                    "created_utc": 1621987551.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You don’t wanna have sex with a condom, your call, but don’t refer to these arrangements as “condom sex” and vice versa. That’s ignorant. Its a person who makes a choice. Gtfo Subaru.",
            "author": "rachbabe26",
            "id": "gzgd3wm",
            "parent_id": "t1_gzfi7cs",
            "score": 0,
            "created_utc": 1621987368.0,
            "replies": [
                {
                    "body": "Is it not an accurate description?",
                    "author": "subaruguy14",
                    "id": "gzgde2x",
                    "parent_id": "t1_gzgd3wm",
                    "score": 1,
                    "created_utc": 1621987510.0,
                    "replies": [
                        {
                            "body": "There’s usually more to an arrangement than “condom sex” or “no condom sex”. One of those things being that there’s an actual person involved. But hey not judging what you want, just keep that in mind",
                            "author": "rachbabe26",
                            "id": "gzgeyw6",
                            "parent_id": "t1_gzgde2x",
                            "score": 2,
                            "created_utc": 1621988301.0,
                            "replies": [
                                {
                                    "body": "It’s just a monthly lease vs hourly rental model for a sex worker to me.",
                                    "author": "subaruguy14",
                                    "id": "gzgf35l",
                                    "parent_id": "t1_gzgeyw6",
                                    "score": 2,
                                    "created_utc": 1621988361.0,
                                    "replies": [
                                        {
                                            "body": "Ooo now I hope you are as transparent as this in your bio as well. That way people can add you to the list of people to avoid like this other dude we’re talking about. \nAnd again, since you clearly didn’t get the point, whether you have your “monthly lease” or “hourly rental” we are still talking about a person. Not a car. Maybe just don’t be so disrespectful you know.",
                                            "author": "rachbabe26",
                                            "id": "gzggwjd",
                                            "parent_id": "t1_gzgf35l",
                                            "score": 1,
                                            "created_utc": 1621989280.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hey at least it’s killing something! 😂",
            "author": "Shyyhoneybadger",
            "id": "gzfkgr3",
            "parent_id": "t1_gzfisff",
            "score": 1,
            "created_utc": 1621973482.0,
            "replies": []
        },
        {
            "body": "Spermicidal lubricant is a real thing, but my understanding is that it's not good for your lady parts, and it's nowhere near as safe as a condom (for any purposes).  100% agree that OP should next this dude.",
            "author": "Inquisitive_SD",
            "id": "gzeg1xy",
            "parent_id": "t1_gzeeysc",
            "score": 14,
            "created_utc": 1621956356.0,
            "replies": [
                {
                    "body": "Seconding all of this. \n\nSpermicide is never a good first choice of birth control, and if the woman has the pill or anything else reliable, I would never use it. It's rather irritating to a very delicate area and regular use can make you more susceptible to catching infection because of the damages it causes.",
                    "author": "MASugarBaby",
                    "id": "gzehizs",
                    "parent_id": "t1_gzeg1xy",
                    "score": 4,
                    "created_utc": 1621956986.0,
                    "replies": []
                },
                {
                    "body": "Very interesting. I’ve got some research to do lol",
                    "author": "Sweetiexoxoxo",
                    "id": "gzegzjb",
                    "parent_id": "t1_gzeg1xy",
                    "score": 1,
                    "created_utc": 1621956763.0,
                    "replies": [
                        {
                            "body": "It's commonly used by couples in fertility treatments.  They can maintain their sex life while not risking natural pregnancy (counter-intuitive I know since they're aiming for pregnancy but with the amount of money committed to it and the higher success rate, it makes sense)",
                            "author": "Church42",
                            "id": "gzehlsc",
                            "parent_id": "t1_gzegzjb",
                            "score": 2,
                            "created_utc": 1621957017.0,
                            "replies": []
                        },
                        {
                            "body": "It's possible the stuff isn't even on the market anymore, so you not knowing about it might not be strange at all.  I just know it was a thing because I used to exclusively use condoms with spermicidal lube on them back when I was in college and didn't know any better.  Later, I heard there were studies showing it causes damage to your lady bits and so I stopped using it.  This dude might have a 20-year-old tube of it still sitting around 😂",
                            "author": "Inquisitive_SD",
                            "id": "gzehmf2",
                            "parent_id": "t1_gzegzjb",
                            "score": 2,
                            "created_utc": 1621957025.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Lube that kills sperm? That’s a first lol \n\nIt is a real thing though\n\nBut OP should stick to what she's comfortable with",
            "author": "Church42",
            "id": "gzegq2h",
            "parent_id": "t1_gzeeysc",
            "score": 3,
            "created_utc": 1621956649.0,
            "replies": []
        },
        {
            "body": "That lube one really got me 😂",
            "author": null,
            "id": "gzefagj",
            "parent_id": "t1_gzeeysc",
            "score": 2,
            "created_utc": 1621956021.0,
            "replies": [
                {
                    "body": "Right, some men will say anything lmfaooo. I had one guy say using condoms gives him ptsd😂",
                    "author": "Sweetiexoxoxo",
                    "id": "gzefwlw",
                    "parent_id": "t1_gzefagj",
                    "score": 2,
                    "created_utc": 1621956291.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Which I agree with, but the first few times? I normally wait 6 months in a vanilla before going without",
            "author": "Shyyhoneybadger",
            "id": "gzem203",
            "parent_id": "t1_gzelfou",
            "score": 5,
            "created_utc": 1621958913.0,
            "replies": [
                {
                    "body": "I hear you, and I would respect that. But eh I must confess to being quite a bit more risky than that in my own life. Testing shows I've gotten away with it, but I know it's risky. But I also see from other people it's pretty common",
                    "author": "thesuitelife2010",
                    "id": "gzeo3ve",
                    "parent_id": "t1_gzem203",
                    "score": 0,
                    "created_utc": 1621959803.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She said no and he still pushed it. He definitely is being unreasonable.",
            "author": "MD564",
            "id": "gzffevh",
            "parent_id": "t1_gzeu59x",
            "score": 5,
            "created_utc": 1621971351.0,
            "replies": []
        },
        {
            "body": "Because their lips are moving?",
            "author": "pussy_impaler337",
            "id": "gzgwcv0",
            "parent_id": "t1_gzeui5r",
            "score": 2,
            "created_utc": 1621997208.0,
            "replies": [
                {
                    "body": "Got it!",
                    "author": "GSSD",
                    "id": "gzi6p3e",
                    "parent_id": "t1_gzgwcv0",
                    "score": 1,
                    "created_utc": 1622031262.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "?",
            "author": "Shyyhoneybadger",
            "id": "gzfmfzh",
            "parent_id": "t1_gzfld5p",
            "score": 1,
            "created_utc": 1621974340.0,
            "replies": [
                {
                    "body": "The show. It’s called Sugar Pine 7: Alternative Lyfestyle. You could see how I get confused.",
                    "author": "MKat__",
                    "id": "gzfmldz",
                    "parent_id": "t1_gzfmfzh",
                    "score": 1,
                    "created_utc": 1621974406.0,
                    "replies": [
                        {
                            "body": "Hahaha! I’m sure you were like “what the heck am I reading! 😅",
                            "author": "Shyyhoneybadger",
                            "id": "gzfn2az",
                            "parent_id": "t1_gzfmldz",
                            "score": 1,
                            "created_utc": 1621974608.0,
                            "replies": [
                                {
                                    "body": "If it helps, safe sex is always awesome.",
                                    "author": "MKat__",
                                    "id": "gzfn99w",
                                    "parent_id": "t1_gzfn2az",
                                    "score": 2,
                                    "created_utc": 1621974693.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you! I think I definitely got defensive when it came to disagreeing with him on this, I’ll work better on this!",
            "author": "Shyyhoneybadger",
            "id": "gzfodtj",
            "parent_id": "t1_gzfo5uc",
            "score": 2,
            "created_utc": 1621975396.0,
            "replies": []
        },
        {
            "body": "I have a hard time with that right now because we’ve now been going back and forth with the conversation all day and he hasn’t stopped being pushy about it so, I think the next time it arises I’ll definitely just ask for them to be tested but I think my relationship with this man can’t be mended",
            "author": "Shyyhoneybadger",
            "id": "gzg53i4",
            "parent_id": "t1_gzg0fp3",
            "score": 4,
            "created_utc": 1621983327.0,
            "replies": [
                {
                    "body": "Do what's best for yourself. Best of luck to you.",
                    "author": "entwie_dumayla",
                    "id": "gzg60bx",
                    "parent_id": "t1_gzg53i4",
                    "score": 1,
                    "created_utc": 1621983782.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol@your username",
            "author": "Shyyhoneybadger",
            "id": "gzgsnl0",
            "parent_id": "t1_gzgoinw",
            "score": 5,
            "created_utc": 1621995251.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gzfiz6l",
            "parent_id": "t1_gzf65fh",
            "score": 36,
            "created_utc": 1621972846.0,
            "replies": [
                {
                    "body": "It’s rough, IMO I think there is a kind of kink for the short cute girls... not that it’s a bad thing 😇",
                    "author": "Shyyhoneybadger",
                    "id": "gzfj71h",
                    "parent_id": "t1_gzfiz6l",
                    "score": 20,
                    "created_utc": 1621972936.0,
                    "replies": [
                        {
                            "body": "I like short cute girls 😊 but that doesn't mean I have to be a jerk and try to control you out make you do things you're not comfortable with. Show that guy the highway. You can do better.",
                            "author": "SDSFBA",
                            "id": "gzfn1iq",
                            "parent_id": "t1_gzfj71h",
                            "score": 11,
                            "created_utc": 1621974599.0,
                            "replies": []
                        },
                        {
                            "body": "Yes there is that kink. In sopranos a line was big chest little feet..a hit in any man's league. But yes as a default most men will take short n cute.",
                            "author": null,
                            "id": "gzfkvsc",
                            "parent_id": "t1_gzfj71h",
                            "score": 6,
                            "created_utc": 1621973664.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That's exactly what they are doing! You even see men right here in this group doing it. Please be careful. These men aren't worth it.",
                    "author": "clair-cummings",
                    "id": "gzhlfz2",
                    "parent_id": "t1_gzfiz6l",
                    "score": 6,
                    "created_utc": 1622013926.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gzi5vnw",
                    "parent_id": "t1_gzfiz6l",
                    "score": 6,
                    "created_utc": 1622030770.0,
                    "replies": [
                        {
                            "body": "Ditto!",
                            "author": "Puzzleheaded-80",
                            "id": "gziiezp",
                            "parent_id": "t1_gzi5vnw",
                            "score": 2,
                            "created_utc": 1622037335.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gzgn29l",
                    "parent_id": "t1_gzfiz6l",
                    "score": 2,
                    "created_utc": 1621992380.0,
                    "replies": [
                        {
                            "body": "The word you are looking for is \"masculine guilt\" 🤦‍♀️",
                            "author": "clair-cummings",
                            "id": "gzhljn7",
                            "parent_id": "t1_gzgn29l",
                            "score": 2,
                            "created_utc": 1622014014.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "His behavior hasn’t changed. He’s trying to control you and being manipulative about it. He wasn’t caring in the beginning, he was trying to control the way you saw/trusted him and treated the arrangement. Run the other direction 🚩🚩🚩🚩",
            "author": "tiredofmyownself",
            "id": "gzfxx53",
            "parent_id": "t1_gzf65fh",
            "score": 14,
            "created_utc": 1621979868.0,
            "replies": []
        },
        {
            "body": "Beyond this obvious attempt at intimidation,  arrangements work when goals, expectations and actions are compatible.  If there is no sign of understanding in the first re-statement of your expectations then it is time to eject.  Story after story here starts with two or more compromises in the face of attempted intimidation, negotiation, extortion  ......  and the stories have fewer happy endings than purchasing lottery tickets. But there never is a grand winner.",
            "author": "pinotandsugar",
            "id": "gzfw3a8",
            "parent_id": "t1_gzf65fh",
            "score": 3,
            "created_utc": 1621979016.0,
            "replies": []
        },
        {
            "body": "Yes short and cute get bossed around...be carefull.",
            "author": null,
            "id": "gzfkowc",
            "parent_id": "t1_gzf65fh",
            "score": 2,
            "created_utc": 1621973581.0,
            "replies": []
        },
        {
            "body": "IT ONLY TAKES ONE.",
            "author": null,
            "id": "gzfuw2b",
            "parent_id": "t1_gzfs0eh",
            "score": 8,
            "created_utc": 1621978455.0,
            "replies": []
        },
        {
            "body": "\"Low sperm count\" has replaced the \"only in a little ways\" of yesteryear",
            "author": "pinotandsugar",
            "id": "gzfwcd8",
            "parent_id": "t1_gzfs0eh",
            "score": 10,
            "created_utc": 1621979134.0,
            "replies": []
        },
        {
            "body": "If you don't feel comfortable without protection, don't do it and find someone who will.",
            "author": "TwoInSympathy",
            "id": "gzef6lq",
            "parent_id": "t1_gzeeyy1",
            "score": 64,
            "created_utc": 1621955973.0,
            "replies": [
                {
                    "body": "Okay! I just needed confirmation that I wasn’t being unreasonable as now he is saying I’m the only one that’s ever asked that 🙃\nHe is a lawyer so I’m guessing he is just using his lawyer speak on me ha",
                    "author": "Shyyhoneybadger",
                    "id": "gzeg99c",
                    "parent_id": "t1_gzef6lq",
                    "score": 39,
                    "created_utc": 1621956445.0,
                    "replies": [
                        {
                            "body": "Him saying that you are the only one that’s ever asked that means he regularly has unprotected sex- more reason to run !",
                            "author": "prettylilprostitute",
                            "id": "gzf1c0j",
                            "parent_id": "t1_gzeg99c",
                            "score": 43,
                            "created_utc": 1621965517.0,
                            "replies": []
                        },
                        {
                            "body": "Putting your safety first is never unreasonable.",
                            "author": "TwoInSympathy",
                            "id": "gzegptt",
                            "parent_id": "t1_gzeg99c",
                            "score": 35,
                            "created_utc": 1621956646.0,
                            "replies": []
                        },
                        {
                            "body": "Oh heck no, I feel most here aren’t saying “ya! lemme duck and suck without a condom! I’m totally okay with that and trust you babe xx” smh gaslighting mf \nYour concerns should be validated and taken seriously, next",
                            "author": "xonlyjade",
                            "id": "gzf4bzq",
                            "parent_id": "t1_gzeg99c",
                            "score": 10,
                            "created_utc": 1621966791.0,
                            "replies": [
                                {
                                    "body": "Thank you! ♥️💕",
                                    "author": "Shyyhoneybadger",
                                    "id": "gzf5tut",
                                    "parent_id": "t1_gzf4bzq",
                                    "score": 1,
                                    "created_utc": 1621967404.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Anyone who won’t use protection is concerning. Move on.  There are others out there:)",
                            "author": null,
                            "id": "gzf3v96",
                            "parent_id": "t1_gzeg99c",
                            "score": 10,
                            "created_utc": 1621966605.0,
                            "replies": []
                        },
                        {
                            "body": "> He is a lawyer\n\nPerhaps Shakespeare was right",
                            "author": "pinotandsugar",
                            "id": "gzfwlt5",
                            "parent_id": "t1_gzeg99c",
                            "score": 2,
                            "created_utc": 1621979257.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don't have sex without a condom. He is likely to be having sex with many girls and you will get passed anything they have.",
            "author": "Worldly_Forever_9353",
            "id": "gzekyr0",
            "parent_id": "t1_gzeeyy1",
            "score": 29,
            "created_utc": 1621958461.0,
            "replies": []
        },
        {
            "body": "HIV is just one of many things to be concerned about. His lack of respect for her health is what is most concerning.",
            "author": "clair-cummings",
            "id": "gzhlurb",
            "parent_id": "t1_gzhesoy",
            "score": 5,
            "created_utc": 1622014282.0,
            "replies": []
        },
        {
            "body": "That risk might be low.\n\nBut there are others.\n\nI always ask the lady. If not previously discussed, right before insertion... (typically, women who want me to use a condom have already let me know..)  If they are OK with it I'll let them know I've been \"snipped\"....\n\nBut really, especially first time I meet someone, arguing with her over this is dumb. Worse idea than trying to negotiate a rate. Just suit up.",
            "author": "wackapoof",
            "id": "gzk6132",
            "parent_id": "t1_gzhesoy",
            "score": 1,
            "created_utc": 1622062107.0,
            "replies": [
                {
                    "body": "I didn't say you should argue with anyone about it.  I also said you should in fact use condoms for other reasons.  I said, however that using HIV specifically as your excuse, or worrying about it is silly.  \n\nThere are far bigger risks to worry about.  In fact the odds of getting pregnant, even when using condoms are significantly higher than your odds of getting HIV when not using condoms, unless you're engaging with high risk individuals, in higher risk scenarios.",
                    "author": "Acrobatic_Half_6631",
                    "id": "gzlqkzt",
                    "parent_id": "t1_gzk6132",
                    "score": 1,
                    "created_utc": 1622091782.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just remember that the vaccine - which yes everyone should embrace - only covers a handful of strains and there are over 200 known variants of HPV.",
            "author": "DarkDelightsShop",
            "id": "gzf4ydz",
            "parent_id": "t1_gzf3224",
            "score": 14,
            "created_utc": 1621967040.0,
            "replies": [
                {
                    "body": "That's viruses for you.",
                    "author": "AnSteall",
                    "id": "gzf5jnh",
                    "parent_id": "t1_gzf4ydz",
                    "score": 3,
                    "created_utc": 1621967284.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In the US, you can get it up to age like 46? if your doctor decides it’s recommended (usually high risk sexual activity).",
            "author": "n00b_to_this",
            "id": "gzfteh9",
            "parent_id": "t1_gzf3224",
            "score": 2,
            "created_utc": 1621977748.0,
            "replies": [
                {
                    "body": "I wasn't sure, and a little extra education never hurts so I checked it out.\n\nFrom the CDC:  \nVaccine Recommendations  \nHPV vaccine is recommended for routine vaccination at age 11 or 12 years. (Vaccination can be started at age 9.)  \nACIP also recommends vaccination for everyone through age 26 years if not adequately vaccinated previously. HPV vaccination is given as a series of either two or three doses, depending on age at initial vaccination.  \nVaccination is not recommended for everyone older than age 26 years. However, some adults ages 27 through 45 years may decide to get the HPV vaccine based on discussion with their clinician, if they did not get adequately vaccinated when they were younger. HPV vaccination of people in this age range provides less benefit, for several reasons, including that more people in this age range have already been exposed to HPV.  \nFor adults ages 27 through 45 years, clinicians can consider discussing HPV vaccination with people who are most likely to benefit. HPV vaccination does not need to be discussed with most  adults over age 26 years.",
                    "author": "DarkDelightsShop",
                    "id": "gzg1kfe",
                    "parent_id": "t1_gzfteh9",
                    "score": 4,
                    "created_utc": 1621981598.0,
                    "replies": [
                        {
                            "body": "Yeah if you're older than 45 you have to sometimes argue/demand it and pay for it out of pocket. They'll say \"oh you already have all the HPV you don't need this\" but why not get it anyhow.",
                            "author": "emptyoverflow",
                            "id": "gzgq0m2",
                            "parent_id": "t1_gzg1kfe",
                            "score": 1,
                            "created_utc": 1621993897.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There’s no real point in applying pressure, just find a different girl.",
            "author": "subaruguy14",
            "id": "gzgdh30",
            "parent_id": "t1_gzfknb0",
            "score": 2,
            "created_utc": 1621987551.0,
            "replies": []
        },
        {
            "body": "Is it not an accurate description?",
            "author": "subaruguy14",
            "id": "gzgde2x",
            "parent_id": "t1_gzgd3wm",
            "score": 1,
            "created_utc": 1621987510.0,
            "replies": [
                {
                    "body": "There’s usually more to an arrangement than “condom sex” or “no condom sex”. One of those things being that there’s an actual person involved. But hey not judging what you want, just keep that in mind",
                    "author": "rachbabe26",
                    "id": "gzgeyw6",
                    "parent_id": "t1_gzgde2x",
                    "score": 2,
                    "created_utc": 1621988301.0,
                    "replies": [
                        {
                            "body": "It’s just a monthly lease vs hourly rental model for a sex worker to me.",
                            "author": "subaruguy14",
                            "id": "gzgf35l",
                            "parent_id": "t1_gzgeyw6",
                            "score": 2,
                            "created_utc": 1621988361.0,
                            "replies": [
                                {
                                    "body": "Ooo now I hope you are as transparent as this in your bio as well. That way people can add you to the list of people to avoid like this other dude we’re talking about. \nAnd again, since you clearly didn’t get the point, whether you have your “monthly lease” or “hourly rental” we are still talking about a person. Not a car. Maybe just don’t be so disrespectful you know.",
                                    "author": "rachbabe26",
                                    "id": "gzggwjd",
                                    "parent_id": "t1_gzgf35l",
                                    "score": 1,
                                    "created_utc": 1621989280.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seconding all of this. \n\nSpermicide is never a good first choice of birth control, and if the woman has the pill or anything else reliable, I would never use it. It's rather irritating to a very delicate area and regular use can make you more susceptible to catching infection because of the damages it causes.",
            "author": "MASugarBaby",
            "id": "gzehizs",
            "parent_id": "t1_gzeg1xy",
            "score": 4,
            "created_utc": 1621956986.0,
            "replies": []
        },
        {
            "body": "Very interesting. I’ve got some research to do lol",
            "author": "Sweetiexoxoxo",
            "id": "gzegzjb",
            "parent_id": "t1_gzeg1xy",
            "score": 1,
            "created_utc": 1621956763.0,
            "replies": [
                {
                    "body": "It's commonly used by couples in fertility treatments.  They can maintain their sex life while not risking natural pregnancy (counter-intuitive I know since they're aiming for pregnancy but with the amount of money committed to it and the higher success rate, it makes sense)",
                    "author": "Church42",
                    "id": "gzehlsc",
                    "parent_id": "t1_gzegzjb",
                    "score": 2,
                    "created_utc": 1621957017.0,
                    "replies": []
                },
                {
                    "body": "It's possible the stuff isn't even on the market anymore, so you not knowing about it might not be strange at all.  I just know it was a thing because I used to exclusively use condoms with spermicidal lube on them back when I was in college and didn't know any better.  Later, I heard there were studies showing it causes damage to your lady bits and so I stopped using it.  This dude might have a 20-year-old tube of it still sitting around 😂",
                    "author": "Inquisitive_SD",
                    "id": "gzehmf2",
                    "parent_id": "t1_gzegzjb",
                    "score": 2,
                    "created_utc": 1621957025.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right, some men will say anything lmfaooo. I had one guy say using condoms gives him ptsd😂",
            "author": "Sweetiexoxoxo",
            "id": "gzefwlw",
            "parent_id": "t1_gzefagj",
            "score": 2,
            "created_utc": 1621956291.0,
            "replies": []
        },
        {
            "body": "I hear you, and I would respect that. But eh I must confess to being quite a bit more risky than that in my own life. Testing shows I've gotten away with it, but I know it's risky. But I also see from other people it's pretty common",
            "author": "thesuitelife2010",
            "id": "gzeo3ve",
            "parent_id": "t1_gzem203",
            "score": 0,
            "created_utc": 1621959803.0,
            "replies": []
        },
        {
            "body": "Got it!",
            "author": "GSSD",
            "id": "gzi6p3e",
            "parent_id": "t1_gzgwcv0",
            "score": 1,
            "created_utc": 1622031262.0,
            "replies": []
        },
        {
            "body": "The show. It’s called Sugar Pine 7: Alternative Lyfestyle. You could see how I get confused.",
            "author": "MKat__",
            "id": "gzfmldz",
            "parent_id": "t1_gzfmfzh",
            "score": 1,
            "created_utc": 1621974406.0,
            "replies": [
                {
                    "body": "Hahaha! I’m sure you were like “what the heck am I reading! 😅",
                    "author": "Shyyhoneybadger",
                    "id": "gzfn2az",
                    "parent_id": "t1_gzfmldz",
                    "score": 1,
                    "created_utc": 1621974608.0,
                    "replies": [
                        {
                            "body": "If it helps, safe sex is always awesome.",
                            "author": "MKat__",
                            "id": "gzfn99w",
                            "parent_id": "t1_gzfn2az",
                            "score": 2,
                            "created_utc": 1621974693.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do what's best for yourself. Best of luck to you.",
            "author": "entwie_dumayla",
            "id": "gzg60bx",
            "parent_id": "t1_gzg53i4",
            "score": 1,
            "created_utc": 1621983782.0,
            "replies": []
        },
        {
            "body": "It’s rough, IMO I think there is a kind of kink for the short cute girls... not that it’s a bad thing 😇",
            "author": "Shyyhoneybadger",
            "id": "gzfj71h",
            "parent_id": "t1_gzfiz6l",
            "score": 20,
            "created_utc": 1621972936.0,
            "replies": [
                {
                    "body": "I like short cute girls 😊 but that doesn't mean I have to be a jerk and try to control you out make you do things you're not comfortable with. Show that guy the highway. You can do better.",
                    "author": "SDSFBA",
                    "id": "gzfn1iq",
                    "parent_id": "t1_gzfj71h",
                    "score": 11,
                    "created_utc": 1621974599.0,
                    "replies": []
                },
                {
                    "body": "Yes there is that kink. In sopranos a line was big chest little feet..a hit in any man's league. But yes as a default most men will take short n cute.",
                    "author": null,
                    "id": "gzfkvsc",
                    "parent_id": "t1_gzfj71h",
                    "score": 6,
                    "created_utc": 1621973664.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's exactly what they are doing! You even see men right here in this group doing it. Please be careful. These men aren't worth it.",
            "author": "clair-cummings",
            "id": "gzhlfz2",
            "parent_id": "t1_gzfiz6l",
            "score": 6,
            "created_utc": 1622013926.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gzi5vnw",
            "parent_id": "t1_gzfiz6l",
            "score": 6,
            "created_utc": 1622030770.0,
            "replies": [
                {
                    "body": "Ditto!",
                    "author": "Puzzleheaded-80",
                    "id": "gziiezp",
                    "parent_id": "t1_gzi5vnw",
                    "score": 2,
                    "created_utc": 1622037335.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gzgn29l",
            "parent_id": "t1_gzfiz6l",
            "score": 2,
            "created_utc": 1621992380.0,
            "replies": [
                {
                    "body": "The word you are looking for is \"masculine guilt\" 🤦‍♀️",
                    "author": "clair-cummings",
                    "id": "gzhljn7",
                    "parent_id": "t1_gzgn29l",
                    "score": 2,
                    "created_utc": 1622014014.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Okay! I just needed confirmation that I wasn’t being unreasonable as now he is saying I’m the only one that’s ever asked that 🙃\nHe is a lawyer so I’m guessing he is just using his lawyer speak on me ha",
            "author": "Shyyhoneybadger",
            "id": "gzeg99c",
            "parent_id": "t1_gzef6lq",
            "score": 39,
            "created_utc": 1621956445.0,
            "replies": [
                {
                    "body": "Him saying that you are the only one that’s ever asked that means he regularly has unprotected sex- more reason to run !",
                    "author": "prettylilprostitute",
                    "id": "gzf1c0j",
                    "parent_id": "t1_gzeg99c",
                    "score": 43,
                    "created_utc": 1621965517.0,
                    "replies": []
                },
                {
                    "body": "Putting your safety first is never unreasonable.",
                    "author": "TwoInSympathy",
                    "id": "gzegptt",
                    "parent_id": "t1_gzeg99c",
                    "score": 35,
                    "created_utc": 1621956646.0,
                    "replies": []
                },
                {
                    "body": "Oh heck no, I feel most here aren’t saying “ya! lemme duck and suck without a condom! I’m totally okay with that and trust you babe xx” smh gaslighting mf \nYour concerns should be validated and taken seriously, next",
                    "author": "xonlyjade",
                    "id": "gzf4bzq",
                    "parent_id": "t1_gzeg99c",
                    "score": 10,
                    "created_utc": 1621966791.0,
                    "replies": [
                        {
                            "body": "Thank you! ♥️💕",
                            "author": "Shyyhoneybadger",
                            "id": "gzf5tut",
                            "parent_id": "t1_gzf4bzq",
                            "score": 1,
                            "created_utc": 1621967404.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Anyone who won’t use protection is concerning. Move on.  There are others out there:)",
                    "author": null,
                    "id": "gzf3v96",
                    "parent_id": "t1_gzeg99c",
                    "score": 10,
                    "created_utc": 1621966605.0,
                    "replies": []
                },
                {
                    "body": "> He is a lawyer\n\nPerhaps Shakespeare was right",
                    "author": "pinotandsugar",
                    "id": "gzfwlt5",
                    "parent_id": "t1_gzeg99c",
                    "score": 2,
                    "created_utc": 1621979257.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I didn't say you should argue with anyone about it.  I also said you should in fact use condoms for other reasons.  I said, however that using HIV specifically as your excuse, or worrying about it is silly.  \n\nThere are far bigger risks to worry about.  In fact the odds of getting pregnant, even when using condoms are significantly higher than your odds of getting HIV when not using condoms, unless you're engaging with high risk individuals, in higher risk scenarios.",
            "author": "Acrobatic_Half_6631",
            "id": "gzlqkzt",
            "parent_id": "t1_gzk6132",
            "score": 1,
            "created_utc": 1622091782.0,
            "replies": []
        },
        {
            "body": "That's viruses for you.",
            "author": "AnSteall",
            "id": "gzf5jnh",
            "parent_id": "t1_gzf4ydz",
            "score": 3,
            "created_utc": 1621967284.0,
            "replies": []
        },
        {
            "body": "I wasn't sure, and a little extra education never hurts so I checked it out.\n\nFrom the CDC:  \nVaccine Recommendations  \nHPV vaccine is recommended for routine vaccination at age 11 or 12 years. (Vaccination can be started at age 9.)  \nACIP also recommends vaccination for everyone through age 26 years if not adequately vaccinated previously. HPV vaccination is given as a series of either two or three doses, depending on age at initial vaccination.  \nVaccination is not recommended for everyone older than age 26 years. However, some adults ages 27 through 45 years may decide to get the HPV vaccine based on discussion with their clinician, if they did not get adequately vaccinated when they were younger. HPV vaccination of people in this age range provides less benefit, for several reasons, including that more people in this age range have already been exposed to HPV.  \nFor adults ages 27 through 45 years, clinicians can consider discussing HPV vaccination with people who are most likely to benefit. HPV vaccination does not need to be discussed with most  adults over age 26 years.",
            "author": "DarkDelightsShop",
            "id": "gzg1kfe",
            "parent_id": "t1_gzfteh9",
            "score": 4,
            "created_utc": 1621981598.0,
            "replies": [
                {
                    "body": "Yeah if you're older than 45 you have to sometimes argue/demand it and pay for it out of pocket. They'll say \"oh you already have all the HPV you don't need this\" but why not get it anyhow.",
                    "author": "emptyoverflow",
                    "id": "gzgq0m2",
                    "parent_id": "t1_gzg1kfe",
                    "score": 1,
                    "created_utc": 1621993897.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There’s usually more to an arrangement than “condom sex” or “no condom sex”. One of those things being that there’s an actual person involved. But hey not judging what you want, just keep that in mind",
            "author": "rachbabe26",
            "id": "gzgeyw6",
            "parent_id": "t1_gzgde2x",
            "score": 2,
            "created_utc": 1621988301.0,
            "replies": [
                {
                    "body": "It’s just a monthly lease vs hourly rental model for a sex worker to me.",
                    "author": "subaruguy14",
                    "id": "gzgf35l",
                    "parent_id": "t1_gzgeyw6",
                    "score": 2,
                    "created_utc": 1621988361.0,
                    "replies": [
                        {
                            "body": "Ooo now I hope you are as transparent as this in your bio as well. That way people can add you to the list of people to avoid like this other dude we’re talking about. \nAnd again, since you clearly didn’t get the point, whether you have your “monthly lease” or “hourly rental” we are still talking about a person. Not a car. Maybe just don’t be so disrespectful you know.",
                            "author": "rachbabe26",
                            "id": "gzggwjd",
                            "parent_id": "t1_gzgf35l",
                            "score": 1,
                            "created_utc": 1621989280.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's commonly used by couples in fertility treatments.  They can maintain their sex life while not risking natural pregnancy (counter-intuitive I know since they're aiming for pregnancy but with the amount of money committed to it and the higher success rate, it makes sense)",
            "author": "Church42",
            "id": "gzehlsc",
            "parent_id": "t1_gzegzjb",
            "score": 2,
            "created_utc": 1621957017.0,
            "replies": []
        },
        {
            "body": "It's possible the stuff isn't even on the market anymore, so you not knowing about it might not be strange at all.  I just know it was a thing because I used to exclusively use condoms with spermicidal lube on them back when I was in college and didn't know any better.  Later, I heard there were studies showing it causes damage to your lady bits and so I stopped using it.  This dude might have a 20-year-old tube of it still sitting around 😂",
            "author": "Inquisitive_SD",
            "id": "gzehmf2",
            "parent_id": "t1_gzegzjb",
            "score": 2,
            "created_utc": 1621957025.0,
            "replies": []
        },
        {
            "body": "Hahaha! I’m sure you were like “what the heck am I reading! 😅",
            "author": "Shyyhoneybadger",
            "id": "gzfn2az",
            "parent_id": "t1_gzfmldz",
            "score": 1,
            "created_utc": 1621974608.0,
            "replies": [
                {
                    "body": "If it helps, safe sex is always awesome.",
                    "author": "MKat__",
                    "id": "gzfn99w",
                    "parent_id": "t1_gzfn2az",
                    "score": 2,
                    "created_utc": 1621974693.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I like short cute girls 😊 but that doesn't mean I have to be a jerk and try to control you out make you do things you're not comfortable with. Show that guy the highway. You can do better.",
            "author": "SDSFBA",
            "id": "gzfn1iq",
            "parent_id": "t1_gzfj71h",
            "score": 11,
            "created_utc": 1621974599.0,
            "replies": []
        },
        {
            "body": "Yes there is that kink. In sopranos a line was big chest little feet..a hit in any man's league. But yes as a default most men will take short n cute.",
            "author": null,
            "id": "gzfkvsc",
            "parent_id": "t1_gzfj71h",
            "score": 6,
            "created_utc": 1621973664.0,
            "replies": []
        },
        {
            "body": "Ditto!",
            "author": "Puzzleheaded-80",
            "id": "gziiezp",
            "parent_id": "t1_gzi5vnw",
            "score": 2,
            "created_utc": 1622037335.0,
            "replies": []
        },
        {
            "body": "The word you are looking for is \"masculine guilt\" 🤦‍♀️",
            "author": "clair-cummings",
            "id": "gzhljn7",
            "parent_id": "t1_gzgn29l",
            "score": 2,
            "created_utc": 1622014014.0,
            "replies": []
        },
        {
            "body": "Him saying that you are the only one that’s ever asked that means he regularly has unprotected sex- more reason to run !",
            "author": "prettylilprostitute",
            "id": "gzf1c0j",
            "parent_id": "t1_gzeg99c",
            "score": 43,
            "created_utc": 1621965517.0,
            "replies": []
        },
        {
            "body": "Putting your safety first is never unreasonable.",
            "author": "TwoInSympathy",
            "id": "gzegptt",
            "parent_id": "t1_gzeg99c",
            "score": 35,
            "created_utc": 1621956646.0,
            "replies": []
        },
        {
            "body": "Oh heck no, I feel most here aren’t saying “ya! lemme duck and suck without a condom! I’m totally okay with that and trust you babe xx” smh gaslighting mf \nYour concerns should be validated and taken seriously, next",
            "author": "xonlyjade",
            "id": "gzf4bzq",
            "parent_id": "t1_gzeg99c",
            "score": 10,
            "created_utc": 1621966791.0,
            "replies": [
                {
                    "body": "Thank you! ♥️💕",
                    "author": "Shyyhoneybadger",
                    "id": "gzf5tut",
                    "parent_id": "t1_gzf4bzq",
                    "score": 1,
                    "created_utc": 1621967404.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Anyone who won’t use protection is concerning. Move on.  There are others out there:)",
            "author": null,
            "id": "gzf3v96",
            "parent_id": "t1_gzeg99c",
            "score": 10,
            "created_utc": 1621966605.0,
            "replies": []
        },
        {
            "body": "> He is a lawyer\n\nPerhaps Shakespeare was right",
            "author": "pinotandsugar",
            "id": "gzfwlt5",
            "parent_id": "t1_gzeg99c",
            "score": 2,
            "created_utc": 1621979257.0,
            "replies": []
        },
        {
            "body": "Yeah if you're older than 45 you have to sometimes argue/demand it and pay for it out of pocket. They'll say \"oh you already have all the HPV you don't need this\" but why not get it anyhow.",
            "author": "emptyoverflow",
            "id": "gzgq0m2",
            "parent_id": "t1_gzg1kfe",
            "score": 1,
            "created_utc": 1621993897.0,
            "replies": []
        },
        {
            "body": "It’s just a monthly lease vs hourly rental model for a sex worker to me.",
            "author": "subaruguy14",
            "id": "gzgf35l",
            "parent_id": "t1_gzgeyw6",
            "score": 2,
            "created_utc": 1621988361.0,
            "replies": [
                {
                    "body": "Ooo now I hope you are as transparent as this in your bio as well. That way people can add you to the list of people to avoid like this other dude we’re talking about. \nAnd again, since you clearly didn’t get the point, whether you have your “monthly lease” or “hourly rental” we are still talking about a person. Not a car. Maybe just don’t be so disrespectful you know.",
                    "author": "rachbabe26",
                    "id": "gzggwjd",
                    "parent_id": "t1_gzgf35l",
                    "score": 1,
                    "created_utc": 1621989280.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If it helps, safe sex is always awesome.",
            "author": "MKat__",
            "id": "gzfn99w",
            "parent_id": "t1_gzfn2az",
            "score": 2,
            "created_utc": 1621974693.0,
            "replies": []
        },
        {
            "body": "Thank you! ♥️💕",
            "author": "Shyyhoneybadger",
            "id": "gzf5tut",
            "parent_id": "t1_gzf4bzq",
            "score": 1,
            "created_utc": 1621967404.0,
            "replies": []
        },
        {
            "body": "Ooo now I hope you are as transparent as this in your bio as well. That way people can add you to the list of people to avoid like this other dude we’re talking about. \nAnd again, since you clearly didn’t get the point, whether you have your “monthly lease” or “hourly rental” we are still talking about a person. Not a car. Maybe just don’t be so disrespectful you know.",
            "author": "rachbabe26",
            "id": "gzggwjd",
            "parent_id": "t1_gzgf35l",
            "score": 1,
            "created_utc": 1621989280.0,
            "replies": []
        }
    ]
}