{
    "title": "Reading some of the posts on here genuinely makes me terrified for the women who ignore red flags",
    "post_id": "jv7x54",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/jv7x54/reading_some_of_the_posts_on_here_genuinely_makes/",
    "author": "qwertycats-",
    "body": "First - I am a woman myself and this is in no way meant to be victim blaming. However, if you’re going to experiment with sugar dating you HAVE to be aware of these things. It can literally be life or death, so please don’t be offended if you feel called out. \n\nAnyways, I’ll see posts on here on a very regular basis of women talking about the most insane experiences with men they meet from seeking. Women who drive over to a man’s apartment to meet him for the very first time, or they let him pick her up in his car despite never meeting before, and they don’t share their location with friends because they don’t want anyone to know they sugar. I just read a post today about a women who literally took drugs from a man WITHOUT EVEN KNOWING WHAT THEY WERE! Women who feel pressured to get uncomfortable intoxicated, or feel pressured into doing acts that they’re not comfortable with, women who don’t get paid their fair share of an agreed allowance, etc.  \n\nLadies - you HAVE to be able to set firm boundaries, especially when meeting someone for the first time. You literally need to think of the worst case scenario that could possibly happen, and then do everything in your power to ensure that there’s no way you end up in that scenario. Meeting for the first time should absolutely always be in public, with your own form of transportation both ways, even if he seems nice and offers you a ride back. The first few intimate meetings should preferably be in a hotel rather than his own place. Your location should absolutely always be shared with someone. And I know this part is so hard, especially because you never want to seem rude, but if you’re getting ANY sort of red flags from a guy on a meet and greet, just leave. If you have your own form of transportation this shouldn’t be an issue. If you’re worried about appearing rude, make something up - say your friend just called and there’s an emergency, you’re not feeling well, your roommate is locked out, etc. Ideally you should always have a back up plan in case things go south. \n\nI can’t count the number of times I’ve read posts on here and I’m like holy shit that girl is lucky to even be alive. I know hindsight is 20/20, but you have to be aware of these red flags before they happen, and you have to trust your gut. It’s literally your life that is at stake here. \n\nI’ve also seen a lot of posts recently of women posting screenshots of lengthy text conversations with rude/arrogant/creepy men. While they’re sometimes entertaining, these are usually conversations that should have been cut off and ended within the first few messages. The fact that some women are willing to continue to engage and try to reason with these men is another red flag. See how these red flags seem to build up really fast? That’s why you should ignore them the first time you see them and not when you’re 10 red flags in and it’s too late.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/jv7x54/reading_some_of_the_posts_on_here_genuinely_makes/",
    "score": 283,
    "upvote_ratio": 0.98,
    "created_utc": 1605537971.0,
    "num_comments": 58,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I’m sorry if this sounds harsh but I’d rather have naive girls from tiktok read posts like this instead of posts about how amazing sugaring is. Like yes it can definitely be amazing, but that only happens when you’re able to weed through all the red flags and find someone you can actually trust to respect you and your boundaries. It’s not all about instant gratification and meeting the first guy who offers you x amount even if it means ignoring a few things that rubbed you the wrong way. There’s probably a reason for that",
            "author": "qwertycats-",
            "id": "gchyyv3",
            "parent_id": "t3_jv7x54",
            "score": 134,
            "created_utc": 1605538128.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gcj57tp",
                    "parent_id": "t1_gchyyv3",
                    "score": 34,
                    "created_utc": 1605558058.0,
                    "replies": [
                        {
                            "body": "Yes! That was literally the post that finally made me write this one, my mouth dropped when I read it. Those pills could have been anything!! \nIt isn’t victim blaming to remind women that they need to be smart and safe when it comes to experimenting in such a risky field. I’m not here to bash the women who may struggle with setting firm boundaries or standing up for themselves. I’m just here to tell them they shouldn’t be sugaring if that’s the case, unless they’re willing to take on that huge risk, which I would not recommend",
                            "author": "qwertycats-",
                            "id": "gck6sp7",
                            "parent_id": "t1_gcj57tp",
                            "score": 6,
                            "created_utc": 1605573788.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Thank you so much for all of that. It’s very important and reminders like that are just more than necessary 🙏🏻",
                    "author": "polyhedralspherical",
                    "id": "gci3pj2",
                    "parent_id": "t1_gchyyv3",
                    "score": 18,
                    "created_utc": 1605540630.0,
                    "replies": []
                },
                {
                    "body": "Oh man, me too. I want women who are looking into sugaring to know that there is significant danger involved in sugaring. Even if you do everything in your power to be safe, there are still very real risks. There have been enough posts on here about being raped, assaulted, drugged, manipulated, made to be afraid for their life, being given viral STIs etc. \n\nHow many times do women in this community need to be hurt before people wise up, and start treating the risks seriously?\n\nPSA: \n\nif you don’t have a backbone, you should not sugar. You have to be able to say no a hundred times and stick to it. You have to trust your instincts, and not allow some dude to override your feelings. You have to have firm and clear boundaries. You have to be able to walk away. \n\nIf you can’t talk about safe sex practices, talk about the finances, talk about your expectations and needs...you should not sugar. All of these thing are difficult and uncomfortable at first, but it gets easier. You can’t skirt around these things. \n\nTo OP, this is post that the sub Reddit needs on the regular. Mandatory readings are great...if people do them. The reality of sugaring is so different than the fantasy or perception. SBs need to know.",
                    "author": "InnerRadio7",
                    "id": "gck5dso",
                    "parent_id": "t1_gchyyv3",
                    "score": 15,
                    "created_utc": 1605573022.0,
                    "replies": []
                },
                {
                    "body": "I may be out of the loop, but is sugaring advertised on tiktok or something?",
                    "author": "bright__eyes",
                    "id": "gcl2qvt",
                    "parent_id": "t1_gchyyv3",
                    "score": 2,
                    "created_utc": 1605592598.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agree with this message - it breaks my heart when I read stories here of women who get taken by a predator posing as an SD. Things can be so wonderful when both parties go in with positive intentions, but go so wrong when people don't spot the other person's less-than-positive intentions.",
            "author": "roscoe7585",
            "id": "gci0aws",
            "parent_id": "t3_jv7x54",
            "score": 27,
            "created_utc": 1605538856.0,
            "replies": []
        },
        {
            "body": "Honestly some of the things I hear from SDs I hear on here makes me concerned for the women they interact with. Not too long ago there was a guy saying he made his SB do all his housework before she could get allowance, in addition to all her other SB duties.",
            "author": null,
            "id": "gcieyv6",
            "parent_id": "t3_jv7x54",
            "score": 19,
            "created_utc": 1605546169.0,
            "replies": [
                {
                    "body": "I’m sorry\n\nWhat??!?\n\nIf he wanted his house cleaned he can hire a maid",
                    "author": "LaFilleWhoCantFrench",
                    "id": "gcjijjw",
                    "parent_id": "t1_gcieyv6",
                    "score": 13,
                    "created_utc": 1605563366.0,
                    "replies": [
                        {
                            "body": "Absolutely",
                            "author": null,
                            "id": "gcjk79t",
                            "parent_id": "t1_gcjijjw",
                            "score": 6,
                            "created_utc": 1605564014.0,
                            "replies": []
                        },
                        {
                            "body": "What if that fits in their arrangement?\n\nI know of a few guys that have their SB dress up sexy and clean their place...\n\nEveryone has a price, that's why they are being paid for their time, no?",
                            "author": "Kurtpackage",
                            "id": "gck0qgj",
                            "parent_id": "t1_gcjijjw",
                            "score": -2,
                            "created_utc": 1605570762.0,
                            "replies": [
                                {
                                    "body": "More importantly, how is the relationship treated.  Would the SB rather be paid 2-4x what she is paid in a menial job PLUS an allowance to make the SD life easier.",
                                    "author": "pinotandsugar",
                                    "id": "gckioj4",
                                    "parent_id": "t1_gck0qgj",
                                    "score": -1,
                                    "created_utc": 1605580179.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Wait, what?",
                    "author": "BratinaHat",
                    "id": "gck5wvn",
                    "parent_id": "t1_gcieyv6",
                    "score": 3,
                    "created_utc": 1605573307.0,
                    "replies": []
                },
                {
                    "body": "Did she agree to it or did she leave him?\n\nI don't see the problem here.",
                    "author": "Kurtpackage",
                    "id": "gck0vt3",
                    "parent_id": "t1_gcieyv6",
                    "score": -2,
                    "created_utc": 1605570826.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree, If you have low self-esteem you should not get into this, you need to be able to assert boundaries and not give af. Otherwise you will be steam rolled!\n\nI see it so much and it makes me sad because these guys treat you like you owe them something. Especially on their promises alone which pisses me off! \n\nYou need to be able to tell them to fuck off, when they step out of line and think they can take advantage of you\n\nKeep your day job/school and whatever you make off sugaring is extra so your not desperate for money",
            "author": "HeyHey1211",
            "id": "gci1xgk",
            "parent_id": "t3_jv7x54",
            "score": 33,
            "created_utc": 1605539727.0,
            "replies": [
                {
                    "body": "It's not just low esteem  .   Lack of situational awareness frequently plays a role in bad outcomes. \n\nOne of the good thoughts about risk management came from an old freight dog (days when bank checks were actually flown around the country at night to be physically presented for payment by the bale).\n\n\"Ask yourself how embarrassingly stupid this will sound in the accident report if it does not turn out well.\"      And it's great advice for sugar decisions .  \n\nHad someone at Boeing asked a simple question about the insanely stupid design of the system that caused two airliners full of people to crash and may destroy several airlines, someone would have seen how  stupid it was.",
                    "author": "pinotandsugar",
                    "id": "gcioxuw",
                    "parent_id": "t1_gci1xgk",
                    "score": 13,
                    "created_utc": 1605550873.0,
                    "replies": [
                        {
                            "body": "Thats kind of circular.\n\nHow will someone with no situational awareness have...the awareness to take a step back when the situation calls for it?",
                            "author": null,
                            "id": "gck51um",
                            "parent_id": "t1_gcioxuw",
                            "score": 2,
                            "created_utc": 1605572842.0,
                            "replies": [
                                {
                                    "body": "By asking the question  ,   \"How stupid will this look if it turns out badly\" ?  \n\n\n\nA lot of what Gavin de Becker talks about in Gift of Fear is that people often go to great lengths to suppress the blinking red lights.",
                                    "author": "pinotandsugar",
                                    "id": "gckgmrz",
                                    "parent_id": "t1_gck51um",
                                    "score": 5,
                                    "created_utc": 1605579099.0,
                                    "replies": [
                                        {
                                            "body": "Yep. Gift of Fear should be compulsory reading for newbie SBs.",
                                            "author": "Mangotingthroneway",
                                            "id": "gclhn2j",
                                            "parent_id": "t1_gckgmrz",
                                            "score": 2,
                                            "created_utc": 1605606591.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "That advice is brilliant!",
                            "author": "furiana",
                            "id": "gd04stj",
                            "parent_id": "t1_gcioxuw",
                            "score": 1,
                            "created_utc": 1605922546.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Same. It's heartbreaking and frustrating at the same time. A lot of the time common sense is just not so common. Also, alot of SB's/aspiring SB's put up with crap because sugar is involved.",
            "author": "w4termelonsug4r",
            "id": "gci277n",
            "parent_id": "t3_jv7x54",
            "score": 7,
            "created_utc": 1605539870.0,
            "replies": [
                {
                    "body": "Very frustrating. I often do not comment on purpose because I want to empathise with the SB but I’m just thinking: « Jesus Christ, how did you think THAT would be a good idea? ». The post about the past SB being drugged by her SD had me wanting to bang my head against a wall. So many red flags.",
                    "author": null,
                    "id": "gci3h4v",
                    "parent_id": "t1_gci277n",
                    "score": 7,
                    "created_utc": 1605540514.0,
                    "replies": [
                        {
                            "body": "I also have come to the conclusion that the bowl isn't for everyone. If you don't have common sense you might as well not even try.",
                            "author": "w4termelonsug4r",
                            "id": "gci48i4",
                            "parent_id": "t1_gci3h4v",
                            "score": 3,
                            "created_utc": 1605540898.0,
                            "replies": [
                                {
                                    "body": "I feel like a lot of women here are so blinded by the monetary aspect that they prefer to ignore their instinct. All it takes for these men is to promise they will spoil them rotten. I also kinda think, despite being young myself, that an age limit of 21 on sugaring would do some good to the SBs (although it would be a bummer for me). A lot of these posts come from girls my age and I think so many of these men seek us because we lack experience. I am very heavy-handed with the block/delete button and do not waste time when I notice red flags or feel uncomfortable, no matter how much money is promised.",
                                    "author": null,
                                    "id": "gci58kb",
                                    "parent_id": "t1_gci48i4",
                                    "score": 15,
                                    "created_utc": 1605541409.0,
                                    "replies": [
                                        {
                                            "body": "Yes! The worst part is when these stories come from peers. Being younger definitely makes us easier targets which is why I wish newbies would spend more time educating + mentally preparing themselves for this lifestyle.",
                                            "author": "curly_spice",
                                            "id": "gcif9g6",
                                            "parent_id": "t1_gci58kb",
                                            "score": 4,
                                            "created_utc": 1605546313.0,
                                            "replies": [
                                                {
                                                    "body": "Yes!! This sub is so damn helpful. I \"researched\" this sub like a solid 10 months before diving in. I only decided to enter the bowl because I felt ready and understood a proper/safe way to do so.",
                                                    "author": "w4termelonsug4r",
                                                    "id": "gcj6lr8",
                                                    "parent_id": "t1_gcif9g6",
                                                    "score": 5,
                                                    "created_utc": 1605558667.0,
                                                    "replies": [
                                                        {
                                                            "body": "Same here. There’s a lot of helpful information available, people just have to take the time and find it. But no, they insist on making the rest of us young SBs look bad 🥴",
                                                            "author": "curly_spice",
                                                            "id": "gcj92tz",
                                                            "parent_id": "t1_gcj6lr8",
                                                            "score": 2,
                                                            "created_utc": 1605559606.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Same here! I still ask questions from time to time, but i've been 'researching' this sub along with countless do's and don't articles on how to sugar with safety and confidence. I feel more than ready to take the leap into sugaring than i did before taking the time to read through everyone else's q&a's. I wish more aspiring sb's did the same.",
                                                            "author": "babyxjminah",
                                                            "id": "gcl506n",
                                                            "parent_id": "t1_gcj6lr8",
                                                            "score": 2,
                                                            "created_utc": 1605594407.0,
                                                            "replies": [
                                                                {
                                                                    "body": "This makes me happy to read. Atta girl!! Safety first. Always.",
                                                                    "author": "w4termelonsug4r",
                                                                    "id": "gclw4po",
                                                                    "parent_id": "t1_gcl506n",
                                                                    "score": 1,
                                                                    "created_utc": 1605619926.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Smart girl.\n\n And I agree with the age... Not old enough to have a drink at a bar but you're old enough to sugar. Seems whack but what can ya do.",
                                            "author": "w4termelonsug4r",
                                            "id": "gcj6foy",
                                            "parent_id": "t1_gci58kb",
                                            "score": 2,
                                            "created_utc": 1605558601.0,
                                            "replies": [
                                                {
                                                    "body": "I don’t like when Americans bring up that argument because they seem to forget a lot of us can legally drink at 18 lol",
                                                    "author": null,
                                                    "id": "gcjavb8",
                                                    "parent_id": "t1_gcj6foy",
                                                    "score": 3,
                                                    "created_utc": 1605560300.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'm Canadian which probably explains why I didnt know that😅🤭. Certain areas are for 18?",
                                                            "author": "w4termelonsug4r",
                                                            "id": "gckpnqi",
                                                            "parent_id": "t1_gcjavb8",
                                                            "score": 1,
                                                            "created_utc": 1605583996.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "This exactly!!! I wanna share my thoughts without sounding like I'm victim blaming but as you said... So many red flags you'd think you're at an amusement park..",
                            "author": "w4termelonsug4r",
                            "id": "gci3n0z",
                            "parent_id": "t1_gci3h4v",
                            "score": 1,
                            "created_utc": 1605540595.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is what I feel reading posts on here as well as on BDSM forums. One should not be sugaring or dabbling in kink with low self esteem. Predators swim in these waters, and you MUST have the ability to stand up for yourself.",
            "author": "LulaGagging34",
            "id": "gcjfli6",
            "parent_id": "t3_jv7x54",
            "score": 7,
            "created_utc": 1605562211.0,
            "replies": []
        },
        {
            "body": "A common comment from newbies is \"I don't know what is normal \" or \"I didn't want to hurt his feelings\" or even better \" I didn't want to spoil the connection to talk about money\". \n\nI agree you have to get the business arrangement executed, then you can build the connection.",
            "author": "GSSD",
            "id": "gcipoem",
            "parent_id": "t3_jv7x54",
            "score": 6,
            "created_utc": 1605551214.0,
            "replies": [
                {
                    "body": "True, there’s so much that people don’t know before going into it but that’s why you do your research and read up on sugaring and safety BEFORE you go out and start meeting people",
                    "author": "qwertycats-",
                    "id": "gcj1axt",
                    "parent_id": "t1_gcipoem",
                    "score": 3,
                    "created_utc": 1605556258.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This shouldn't be seen as harsh or victim blaming, but an opportunity for others to learn from their mistakes so others can avoid the same mistakes.   Making a mistake, doesn't mean it is their fault.  Forgetting to lock your door and being robbed doesn't mean you are responsible for being robbed, but it is smart to remind people to lock their doors and keep themselves safe and secure.  \n\nThere is \"victim blaming\" that does happen, but that card is over played. It prevents us from learning from mistakes others have made and teach others not to make those same mistakes.  \n\nIn business, we study industrial accidents very closely, learn from the mistakes made by the victim, co-workers, procedures, the company they work for and the manufactures of equipment they use.  This has led to an order of magnitude reduction in industrial accidents and deaths.  It's how we learn.  Not allowing a discussion of the mistakes made, makes it unsafe for everyone.",
            "author": "willfromvb",
            "id": "gci0p8p",
            "parent_id": "t3_jv7x54",
            "score": 18,
            "created_utc": 1605539072.0,
            "replies": [
                {
                    "body": "> Not allowing a discussion of the mistakes made, makes it unsafe for everyone.\n\nYES",
                    "author": "pinotandsugar",
                    "id": "gckisu6",
                    "parent_id": "t1_gci0p8p",
                    "score": 4,
                    "created_utc": 1605580243.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You have a point, but I think its somewhat how women are socialised as young girls. Or it may have to do w their background.\n\nFor me my family didn't expect or want me to date unless I was planning to marry and as such I didn't know what red flags were tbh. I only realised after talking to girlfriends who would offer to come or told me what to look out for.",
            "author": "PessimisticAna",
            "id": "gckbs7g",
            "parent_id": "t3_jv7x54",
            "score": 8,
            "created_utc": 1605576503.0,
            "replies": [
                {
                    "body": "That brings up another great point, which is the fact that if someone has little to no experience with dating or sex in general, then sugaring probably isn’t for them either. I’m glad you had your girlfriends to let you know what is and isn’t normal, because some people have absolutely nothing to go off in terms of what’s ok and what’s not, and predatory men will definitely take advantage of that",
                    "author": "qwertycats-",
                    "id": "gckc7nc",
                    "parent_id": "t1_gckbs7g",
                    "score": 11,
                    "created_utc": 1605576728.0,
                    "replies": [
                        {
                            "body": "Yeah this was for normal dating btw. \nI still don't think I have enough experience to go into sugaring, the men seem to be a lot more brash and I don't tolerate rudeness regardless so I've lost potential pots lol.",
                            "author": "PessimisticAna",
                            "id": "gckcxsi",
                            "parent_id": "t1_gckc7nc",
                            "score": 2,
                            "created_utc": 1605577110.0,
                            "replies": [
                                {
                                    "body": "If they were brash and rude, then they've lost you, not the other way round.",
                                    "author": "Sophs_B",
                                    "id": "gclimpd",
                                    "parent_id": "t1_gckcxsi",
                                    "score": 3,
                                    "created_utc": 1605607685.0,
                                    "replies": [
                                        {
                                            "body": "Thats a good way to see it",
                                            "author": "PessimisticAna",
                                            "id": "gclmnlx",
                                            "parent_id": "t1_gclimpd",
                                            "score": 1,
                                            "created_utc": 1605612031.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is definitely not harsh! There is definitely a downfall. I’m in the process of looking for a SD but I’ve come across nothing but scammers on here.",
            "author": null,
            "id": "gcioa54",
            "parent_id": "t3_jv7x54",
            "score": 4,
            "created_utc": 1605550569.0,
            "replies": []
        },
        {
            "body": "I've had guys try to take advantage of me, I have definitely spent too much time texting, but overall, I make my choices and live with them.  Things are working out, despite a few bumps in the road.",
            "author": "swissslut99",
            "id": "gcj1f6k",
            "parent_id": "t3_jv7x54",
            "score": 3,
            "created_utc": 1605556312.0,
            "replies": []
        },
        {
            "body": "I agree 100%. I didn't start sugaring until I was 28, so sometimes I read stories and I'm like \"wtf was she thinking\" and I have to remind myself that younger girls aren't always thinking before doing things! I'm so grateful I've never been in any bad situations",
            "author": null,
            "id": "gci8of5",
            "parent_id": "t3_jv7x54",
            "score": 10,
            "created_utc": 1605543138.0,
            "replies": []
        },
        {
            "body": "I have had 2 babies tell me the most horrifying things. It makes me want to vomit thinking they went through it.",
            "author": "stonedoubt",
            "id": "gcibiir",
            "parent_id": "t3_jv7x54",
            "score": 3,
            "created_utc": 1605544519.0,
            "replies": []
        },
        {
            "body": "Absolutely agree, not once have I kept kitchen knife in my pocket just in case. I find far too many people do not acknowledge, perhaps do not even realise the risk they are putting themselves into. Sugar dating websites are doing precisely NOTHING to mitigate any of the risks and I have their asses legally covered very well. Far too well in fact. I wonder how many crimes have happened as a result of people being desperate for money/sex (yes, even sugar daddies can get robbed), of course we wouldn't hear about it because it is such a taboo that one would rather risk their life than to take reasonable precautions. I find that unacceptable. I wish there were better and safer ways to engage in sugar lifestyle. It can be a wonderful thing, but it is spoiled by the risk it involves.",
            "author": "MimiRodriguez",
            "id": "gcmj94b",
            "parent_id": "t3_jv7x54",
            "score": 3,
            "created_utc": 1605632170.0,
            "replies": []
        },
        {
            "body": "How do people make the mistake not once or twice, but three, four, and five times? It’s just inconceivable to me.",
            "author": "Limitlesspappy",
            "id": "gci9vnl",
            "parent_id": "t3_jv7x54",
            "score": 7,
            "created_utc": 1605543732.0,
            "replies": []
        },
        {
            "body": "Not harsh at all! It's better people to learn the tough truth through here then through experience",
            "author": "Anonymoussss100",
            "id": "gciaol5",
            "parent_id": "t3_jv7x54",
            "score": 2,
            "created_utc": 1605544116.0,
            "replies": []
        },
        {
            "body": "Wise words...",
            "author": "aesthete2061",
            "id": "gcoyhpp",
            "parent_id": "t3_jv7x54",
            "score": 2,
            "created_utc": 1605677966.0,
            "replies": []
        },
        {
            "body": "I agree!! Girls are so naive it hurts and you try to talk to them but they’re like I know I know!! Well clearly you don’t know",
            "author": "grayvi2",
            "id": "gcib6rg",
            "parent_id": "t3_jv7x54",
            "score": 3,
            "created_utc": 1605544361.0,
            "replies": []
        },
        {
            "body": "This is so TRUE!!!! \n\n&#x200B;\n\nI'm a sugardaddy and many times I put \"my real dad hat\" on.    When I talk to some of these young girls and they tell me these things, the hair on the back of my neck stands up.  I feel obligated to warn them of the dangers and to be on guard.\n\nThe first meeting should be in public - whether its coffee or dinner, anything else to me is extremely risky.  True, a guy can hide his true self and wait to do his crazy stuff on the next meet, but at least you have an idea of who he is, what type of person he is, and whether you'd get along or not.  And by the way, this holds true for the sugar daddy too.  Do either of you want some crazy stranger knowing personal items about you prior to starting a relationship?\n\nRed flags are red flags. Don't let dollar signs cause us to not see them.\n\nOne more comment and I'll probably get fussed at for stating it.  But a lot of Sugar babies complain about SD's wanting a \"cheap ho\".  Which is true, a lot of them do - hence the Splenda daddy tag.  But the reverse is true.  If a girl lets a guy come by and pick her up for a nominal PPM fee, is she really a sugar baby or something else?  I think she's something else.\n\nThis is a very expensive \"hobby\" and a lot of guys just want to be a sugar daddy, but can't afford it. I liken it to being a member of a $100,000 a year country club and you still have to pay green fees.  Its not cheap.  In fact, I think golf is cheaper!  :)",
            "author": "SDlovesu2",
            "id": "gctxrqq",
            "parent_id": "t3_jv7x54",
            "score": 1,
            "created_utc": 1605796170.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "gctxrsn",
                    "parent_id": "t1_gctxrqq",
                    "score": 1,
                    "created_utc": 1605796171.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I really wish you had said that a woman who HAS been assaulted isn't at fault. I agree with all the red flags but your tone is a little shamey. Women who've been assaulted are already being bombarded with messages about how they're stupid sluts who asked for it.",
            "author": "twocatsnoheart",
            "id": "gck0qcr",
            "parent_id": "t3_jv7x54",
            "score": 0,
            "created_utc": 1605570760.0,
            "replies": [
                {
                    "body": "Of course a woman who has been assaulted isn’t at fault, I didn’t ever imply otherwise. Sorry if you find my tone ‘shamey’ but frankly, tough love is absolutely necessary when it comes to giving advice towards women interested in sugaring. Is it a woman’s fault if a man chooses to take advantage of her or harm her in any way? Absolutely not, of course not. But should she be aware of what to look out for and how to stay safe in an effort to prevent those bad things from happening in the first place? Absolutely. I’m not shaming anyone, I’m trying to look out for the naive women who don’t seem to understand how dangerous this sort of thing can be. This kind of stuff isn’t for everyone and you have to know what to look out for to be safe. \n\nThere’s a pretty big difference between calling victims of assault “stupid sluts” versus trying to look out for them so they don’t become a victim in the first place",
                    "author": "qwertycats-",
                    "id": "gck373u",
                    "parent_id": "t1_gck0qcr",
                    "score": 6,
                    "created_utc": 1605571848.0,
                    "replies": [
                        {
                            "body": "What needs to be \"tough\" about the love? Literally you could have just said the (great) points you needed to say and been done with it.  \n\nThe world is looking for reasons to blame women for being assaulted, and sharing this kind of information among each other is the most valuable thing you can do. So when you start with \"I'm not victim blaming, HOWEVER...\", it's going to read like you're saying that women who can't read these red flags as quickly, or who experience assault, are partially to blame.",
                            "author": "twocatsnoheart",
                            "id": "gck8rsa",
                            "parent_id": "t1_gck373u",
                            "score": 3,
                            "created_utc": 1605574872.0,
                            "replies": [
                                {
                                    "body": "Hm.. I actually agree with OP here. When you teach a child not to touch the fire, sometimes saying it calmly just doesn't cut it. They may ignore the warning because it doesn't seem serious when being told in a calm/relaxed way. They might not see the severity of touching the fire. Some kids need that stern and tough tone to truly understand the warning. \n\nThe girls who ended up in these unfortunate situations may have needed that stern warning post instead of a post talking about how wonderful their sb lifestyle is. It's not implying they're to blame, it's just another way to warn them, and if it can save another woman from that fate, then we should welcome it.",
                                    "author": "babyxjminah",
                                    "id": "gcl73ao",
                                    "parent_id": "t1_gck8rsa",
                                    "score": 6,
                                    "created_utc": 1605596155.0,
                                    "replies": []
                                },
                                {
                                    "body": "I’m sorry you’re not a fan of the tone of the post. If women aren’t able to accurately recognize red flags or warning signs, they simply should not be doing sugaring. That’s the whole point. Is it their fault that so many men on the site are predatory? Absolutely not. But should they still have a sense of responsibility towards themselves and their safety? Of course",
                                    "author": "qwertycats-",
                                    "id": "gckbixv",
                                    "parent_id": "t1_gck8rsa",
                                    "score": 7,
                                    "created_utc": 1605576374.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gcj57tp",
            "parent_id": "t1_gchyyv3",
            "score": 34,
            "created_utc": 1605558058.0,
            "replies": [
                {
                    "body": "Yes! That was literally the post that finally made me write this one, my mouth dropped when I read it. Those pills could have been anything!! \nIt isn’t victim blaming to remind women that they need to be smart and safe when it comes to experimenting in such a risky field. I’m not here to bash the women who may struggle with setting firm boundaries or standing up for themselves. I’m just here to tell them they shouldn’t be sugaring if that’s the case, unless they’re willing to take on that huge risk, which I would not recommend",
                    "author": "qwertycats-",
                    "id": "gck6sp7",
                    "parent_id": "t1_gcj57tp",
                    "score": 6,
                    "created_utc": 1605573788.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you so much for all of that. It’s very important and reminders like that are just more than necessary 🙏🏻",
            "author": "polyhedralspherical",
            "id": "gci3pj2",
            "parent_id": "t1_gchyyv3",
            "score": 18,
            "created_utc": 1605540630.0,
            "replies": []
        },
        {
            "body": "Oh man, me too. I want women who are looking into sugaring to know that there is significant danger involved in sugaring. Even if you do everything in your power to be safe, there are still very real risks. There have been enough posts on here about being raped, assaulted, drugged, manipulated, made to be afraid for their life, being given viral STIs etc. \n\nHow many times do women in this community need to be hurt before people wise up, and start treating the risks seriously?\n\nPSA: \n\nif you don’t have a backbone, you should not sugar. You have to be able to say no a hundred times and stick to it. You have to trust your instincts, and not allow some dude to override your feelings. You have to have firm and clear boundaries. You have to be able to walk away. \n\nIf you can’t talk about safe sex practices, talk about the finances, talk about your expectations and needs...you should not sugar. All of these thing are difficult and uncomfortable at first, but it gets easier. You can’t skirt around these things. \n\nTo OP, this is post that the sub Reddit needs on the regular. Mandatory readings are great...if people do them. The reality of sugaring is so different than the fantasy or perception. SBs need to know.",
            "author": "InnerRadio7",
            "id": "gck5dso",
            "parent_id": "t1_gchyyv3",
            "score": 15,
            "created_utc": 1605573022.0,
            "replies": []
        },
        {
            "body": "I may be out of the loop, but is sugaring advertised on tiktok or something?",
            "author": "bright__eyes",
            "id": "gcl2qvt",
            "parent_id": "t1_gchyyv3",
            "score": 2,
            "created_utc": 1605592598.0,
            "replies": []
        },
        {
            "body": "I’m sorry\n\nWhat??!?\n\nIf he wanted his house cleaned he can hire a maid",
            "author": "LaFilleWhoCantFrench",
            "id": "gcjijjw",
            "parent_id": "t1_gcieyv6",
            "score": 13,
            "created_utc": 1605563366.0,
            "replies": [
                {
                    "body": "Absolutely",
                    "author": null,
                    "id": "gcjk79t",
                    "parent_id": "t1_gcjijjw",
                    "score": 6,
                    "created_utc": 1605564014.0,
                    "replies": []
                },
                {
                    "body": "What if that fits in their arrangement?\n\nI know of a few guys that have their SB dress up sexy and clean their place...\n\nEveryone has a price, that's why they are being paid for their time, no?",
                    "author": "Kurtpackage",
                    "id": "gck0qgj",
                    "parent_id": "t1_gcjijjw",
                    "score": -2,
                    "created_utc": 1605570762.0,
                    "replies": [
                        {
                            "body": "More importantly, how is the relationship treated.  Would the SB rather be paid 2-4x what she is paid in a menial job PLUS an allowance to make the SD life easier.",
                            "author": "pinotandsugar",
                            "id": "gckioj4",
                            "parent_id": "t1_gck0qgj",
                            "score": -1,
                            "created_utc": 1605580179.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wait, what?",
            "author": "BratinaHat",
            "id": "gck5wvn",
            "parent_id": "t1_gcieyv6",
            "score": 3,
            "created_utc": 1605573307.0,
            "replies": []
        },
        {
            "body": "Did she agree to it or did she leave him?\n\nI don't see the problem here.",
            "author": "Kurtpackage",
            "id": "gck0vt3",
            "parent_id": "t1_gcieyv6",
            "score": -2,
            "created_utc": 1605570826.0,
            "replies": []
        },
        {
            "body": "It's not just low esteem  .   Lack of situational awareness frequently plays a role in bad outcomes. \n\nOne of the good thoughts about risk management came from an old freight dog (days when bank checks were actually flown around the country at night to be physically presented for payment by the bale).\n\n\"Ask yourself how embarrassingly stupid this will sound in the accident report if it does not turn out well.\"      And it's great advice for sugar decisions .  \n\nHad someone at Boeing asked a simple question about the insanely stupid design of the system that caused two airliners full of people to crash and may destroy several airlines, someone would have seen how  stupid it was.",
            "author": "pinotandsugar",
            "id": "gcioxuw",
            "parent_id": "t1_gci1xgk",
            "score": 13,
            "created_utc": 1605550873.0,
            "replies": [
                {
                    "body": "Thats kind of circular.\n\nHow will someone with no situational awareness have...the awareness to take a step back when the situation calls for it?",
                    "author": null,
                    "id": "gck51um",
                    "parent_id": "t1_gcioxuw",
                    "score": 2,
                    "created_utc": 1605572842.0,
                    "replies": [
                        {
                            "body": "By asking the question  ,   \"How stupid will this look if it turns out badly\" ?  \n\n\n\nA lot of what Gavin de Becker talks about in Gift of Fear is that people often go to great lengths to suppress the blinking red lights.",
                            "author": "pinotandsugar",
                            "id": "gckgmrz",
                            "parent_id": "t1_gck51um",
                            "score": 5,
                            "created_utc": 1605579099.0,
                            "replies": [
                                {
                                    "body": "Yep. Gift of Fear should be compulsory reading for newbie SBs.",
                                    "author": "Mangotingthroneway",
                                    "id": "gclhn2j",
                                    "parent_id": "t1_gckgmrz",
                                    "score": 2,
                                    "created_utc": 1605606591.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That advice is brilliant!",
                    "author": "furiana",
                    "id": "gd04stj",
                    "parent_id": "t1_gcioxuw",
                    "score": 1,
                    "created_utc": 1605922546.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Very frustrating. I often do not comment on purpose because I want to empathise with the SB but I’m just thinking: « Jesus Christ, how did you think THAT would be a good idea? ». The post about the past SB being drugged by her SD had me wanting to bang my head against a wall. So many red flags.",
            "author": null,
            "id": "gci3h4v",
            "parent_id": "t1_gci277n",
            "score": 7,
            "created_utc": 1605540514.0,
            "replies": [
                {
                    "body": "I also have come to the conclusion that the bowl isn't for everyone. If you don't have common sense you might as well not even try.",
                    "author": "w4termelonsug4r",
                    "id": "gci48i4",
                    "parent_id": "t1_gci3h4v",
                    "score": 3,
                    "created_utc": 1605540898.0,
                    "replies": [
                        {
                            "body": "I feel like a lot of women here are so blinded by the monetary aspect that they prefer to ignore their instinct. All it takes for these men is to promise they will spoil them rotten. I also kinda think, despite being young myself, that an age limit of 21 on sugaring would do some good to the SBs (although it would be a bummer for me). A lot of these posts come from girls my age and I think so many of these men seek us because we lack experience. I am very heavy-handed with the block/delete button and do not waste time when I notice red flags or feel uncomfortable, no matter how much money is promised.",
                            "author": null,
                            "id": "gci58kb",
                            "parent_id": "t1_gci48i4",
                            "score": 15,
                            "created_utc": 1605541409.0,
                            "replies": [
                                {
                                    "body": "Yes! The worst part is when these stories come from peers. Being younger definitely makes us easier targets which is why I wish newbies would spend more time educating + mentally preparing themselves for this lifestyle.",
                                    "author": "curly_spice",
                                    "id": "gcif9g6",
                                    "parent_id": "t1_gci58kb",
                                    "score": 4,
                                    "created_utc": 1605546313.0,
                                    "replies": [
                                        {
                                            "body": "Yes!! This sub is so damn helpful. I \"researched\" this sub like a solid 10 months before diving in. I only decided to enter the bowl because I felt ready and understood a proper/safe way to do so.",
                                            "author": "w4termelonsug4r",
                                            "id": "gcj6lr8",
                                            "parent_id": "t1_gcif9g6",
                                            "score": 5,
                                            "created_utc": 1605558667.0,
                                            "replies": [
                                                {
                                                    "body": "Same here. There’s a lot of helpful information available, people just have to take the time and find it. But no, they insist on making the rest of us young SBs look bad 🥴",
                                                    "author": "curly_spice",
                                                    "id": "gcj92tz",
                                                    "parent_id": "t1_gcj6lr8",
                                                    "score": 2,
                                                    "created_utc": 1605559606.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Same here! I still ask questions from time to time, but i've been 'researching' this sub along with countless do's and don't articles on how to sugar with safety and confidence. I feel more than ready to take the leap into sugaring than i did before taking the time to read through everyone else's q&a's. I wish more aspiring sb's did the same.",
                                                    "author": "babyxjminah",
                                                    "id": "gcl506n",
                                                    "parent_id": "t1_gcj6lr8",
                                                    "score": 2,
                                                    "created_utc": 1605594407.0,
                                                    "replies": [
                                                        {
                                                            "body": "This makes me happy to read. Atta girl!! Safety first. Always.",
                                                            "author": "w4termelonsug4r",
                                                            "id": "gclw4po",
                                                            "parent_id": "t1_gcl506n",
                                                            "score": 1,
                                                            "created_utc": 1605619926.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Smart girl.\n\n And I agree with the age... Not old enough to have a drink at a bar but you're old enough to sugar. Seems whack but what can ya do.",
                                    "author": "w4termelonsug4r",
                                    "id": "gcj6foy",
                                    "parent_id": "t1_gci58kb",
                                    "score": 2,
                                    "created_utc": 1605558601.0,
                                    "replies": [
                                        {
                                            "body": "I don’t like when Americans bring up that argument because they seem to forget a lot of us can legally drink at 18 lol",
                                            "author": null,
                                            "id": "gcjavb8",
                                            "parent_id": "t1_gcj6foy",
                                            "score": 3,
                                            "created_utc": 1605560300.0,
                                            "replies": [
                                                {
                                                    "body": "I'm Canadian which probably explains why I didnt know that😅🤭. Certain areas are for 18?",
                                                    "author": "w4termelonsug4r",
                                                    "id": "gckpnqi",
                                                    "parent_id": "t1_gcjavb8",
                                                    "score": 1,
                                                    "created_utc": 1605583996.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This exactly!!! I wanna share my thoughts without sounding like I'm victim blaming but as you said... So many red flags you'd think you're at an amusement park..",
                    "author": "w4termelonsug4r",
                    "id": "gci3n0z",
                    "parent_id": "t1_gci3h4v",
                    "score": 1,
                    "created_utc": 1605540595.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "True, there’s so much that people don’t know before going into it but that’s why you do your research and read up on sugaring and safety BEFORE you go out and start meeting people",
            "author": "qwertycats-",
            "id": "gcj1axt",
            "parent_id": "t1_gcipoem",
            "score": 3,
            "created_utc": 1605556258.0,
            "replies": []
        },
        {
            "body": "> Not allowing a discussion of the mistakes made, makes it unsafe for everyone.\n\nYES",
            "author": "pinotandsugar",
            "id": "gckisu6",
            "parent_id": "t1_gci0p8p",
            "score": 4,
            "created_utc": 1605580243.0,
            "replies": []
        },
        {
            "body": "That brings up another great point, which is the fact that if someone has little to no experience with dating or sex in general, then sugaring probably isn’t for them either. I’m glad you had your girlfriends to let you know what is and isn’t normal, because some people have absolutely nothing to go off in terms of what’s ok and what’s not, and predatory men will definitely take advantage of that",
            "author": "qwertycats-",
            "id": "gckc7nc",
            "parent_id": "t1_gckbs7g",
            "score": 11,
            "created_utc": 1605576728.0,
            "replies": [
                {
                    "body": "Yeah this was for normal dating btw. \nI still don't think I have enough experience to go into sugaring, the men seem to be a lot more brash and I don't tolerate rudeness regardless so I've lost potential pots lol.",
                    "author": "PessimisticAna",
                    "id": "gckcxsi",
                    "parent_id": "t1_gckc7nc",
                    "score": 2,
                    "created_utc": 1605577110.0,
                    "replies": [
                        {
                            "body": "If they were brash and rude, then they've lost you, not the other way round.",
                            "author": "Sophs_B",
                            "id": "gclimpd",
                            "parent_id": "t1_gckcxsi",
                            "score": 3,
                            "created_utc": 1605607685.0,
                            "replies": [
                                {
                                    "body": "Thats a good way to see it",
                                    "author": "PessimisticAna",
                                    "id": "gclmnlx",
                                    "parent_id": "t1_gclimpd",
                                    "score": 1,
                                    "created_utc": 1605612031.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "gctxrsn",
            "parent_id": "t1_gctxrqq",
            "score": 1,
            "created_utc": 1605796171.0,
            "replies": []
        },
        {
            "body": "Of course a woman who has been assaulted isn’t at fault, I didn’t ever imply otherwise. Sorry if you find my tone ‘shamey’ but frankly, tough love is absolutely necessary when it comes to giving advice towards women interested in sugaring. Is it a woman’s fault if a man chooses to take advantage of her or harm her in any way? Absolutely not, of course not. But should she be aware of what to look out for and how to stay safe in an effort to prevent those bad things from happening in the first place? Absolutely. I’m not shaming anyone, I’m trying to look out for the naive women who don’t seem to understand how dangerous this sort of thing can be. This kind of stuff isn’t for everyone and you have to know what to look out for to be safe. \n\nThere’s a pretty big difference between calling victims of assault “stupid sluts” versus trying to look out for them so they don’t become a victim in the first place",
            "author": "qwertycats-",
            "id": "gck373u",
            "parent_id": "t1_gck0qcr",
            "score": 6,
            "created_utc": 1605571848.0,
            "replies": [
                {
                    "body": "What needs to be \"tough\" about the love? Literally you could have just said the (great) points you needed to say and been done with it.  \n\nThe world is looking for reasons to blame women for being assaulted, and sharing this kind of information among each other is the most valuable thing you can do. So when you start with \"I'm not victim blaming, HOWEVER...\", it's going to read like you're saying that women who can't read these red flags as quickly, or who experience assault, are partially to blame.",
                    "author": "twocatsnoheart",
                    "id": "gck8rsa",
                    "parent_id": "t1_gck373u",
                    "score": 3,
                    "created_utc": 1605574872.0,
                    "replies": [
                        {
                            "body": "Hm.. I actually agree with OP here. When you teach a child not to touch the fire, sometimes saying it calmly just doesn't cut it. They may ignore the warning because it doesn't seem serious when being told in a calm/relaxed way. They might not see the severity of touching the fire. Some kids need that stern and tough tone to truly understand the warning. \n\nThe girls who ended up in these unfortunate situations may have needed that stern warning post instead of a post talking about how wonderful their sb lifestyle is. It's not implying they're to blame, it's just another way to warn them, and if it can save another woman from that fate, then we should welcome it.",
                            "author": "babyxjminah",
                            "id": "gcl73ao",
                            "parent_id": "t1_gck8rsa",
                            "score": 6,
                            "created_utc": 1605596155.0,
                            "replies": []
                        },
                        {
                            "body": "I’m sorry you’re not a fan of the tone of the post. If women aren’t able to accurately recognize red flags or warning signs, they simply should not be doing sugaring. That’s the whole point. Is it their fault that so many men on the site are predatory? Absolutely not. But should they still have a sense of responsibility towards themselves and their safety? Of course",
                            "author": "qwertycats-",
                            "id": "gckbixv",
                            "parent_id": "t1_gck8rsa",
                            "score": 7,
                            "created_utc": 1605576374.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes! That was literally the post that finally made me write this one, my mouth dropped when I read it. Those pills could have been anything!! \nIt isn’t victim blaming to remind women that they need to be smart and safe when it comes to experimenting in such a risky field. I’m not here to bash the women who may struggle with setting firm boundaries or standing up for themselves. I’m just here to tell them they shouldn’t be sugaring if that’s the case, unless they’re willing to take on that huge risk, which I would not recommend",
            "author": "qwertycats-",
            "id": "gck6sp7",
            "parent_id": "t1_gcj57tp",
            "score": 6,
            "created_utc": 1605573788.0,
            "replies": []
        },
        {
            "body": "Absolutely",
            "author": null,
            "id": "gcjk79t",
            "parent_id": "t1_gcjijjw",
            "score": 6,
            "created_utc": 1605564014.0,
            "replies": []
        },
        {
            "body": "What if that fits in their arrangement?\n\nI know of a few guys that have their SB dress up sexy and clean their place...\n\nEveryone has a price, that's why they are being paid for their time, no?",
            "author": "Kurtpackage",
            "id": "gck0qgj",
            "parent_id": "t1_gcjijjw",
            "score": -2,
            "created_utc": 1605570762.0,
            "replies": [
                {
                    "body": "More importantly, how is the relationship treated.  Would the SB rather be paid 2-4x what she is paid in a menial job PLUS an allowance to make the SD life easier.",
                    "author": "pinotandsugar",
                    "id": "gckioj4",
                    "parent_id": "t1_gck0qgj",
                    "score": -1,
                    "created_utc": 1605580179.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thats kind of circular.\n\nHow will someone with no situational awareness have...the awareness to take a step back when the situation calls for it?",
            "author": null,
            "id": "gck51um",
            "parent_id": "t1_gcioxuw",
            "score": 2,
            "created_utc": 1605572842.0,
            "replies": [
                {
                    "body": "By asking the question  ,   \"How stupid will this look if it turns out badly\" ?  \n\n\n\nA lot of what Gavin de Becker talks about in Gift of Fear is that people often go to great lengths to suppress the blinking red lights.",
                    "author": "pinotandsugar",
                    "id": "gckgmrz",
                    "parent_id": "t1_gck51um",
                    "score": 5,
                    "created_utc": 1605579099.0,
                    "replies": [
                        {
                            "body": "Yep. Gift of Fear should be compulsory reading for newbie SBs.",
                            "author": "Mangotingthroneway",
                            "id": "gclhn2j",
                            "parent_id": "t1_gckgmrz",
                            "score": 2,
                            "created_utc": 1605606591.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That advice is brilliant!",
            "author": "furiana",
            "id": "gd04stj",
            "parent_id": "t1_gcioxuw",
            "score": 1,
            "created_utc": 1605922546.0,
            "replies": []
        },
        {
            "body": "I also have come to the conclusion that the bowl isn't for everyone. If you don't have common sense you might as well not even try.",
            "author": "w4termelonsug4r",
            "id": "gci48i4",
            "parent_id": "t1_gci3h4v",
            "score": 3,
            "created_utc": 1605540898.0,
            "replies": [
                {
                    "body": "I feel like a lot of women here are so blinded by the monetary aspect that they prefer to ignore their instinct. All it takes for these men is to promise they will spoil them rotten. I also kinda think, despite being young myself, that an age limit of 21 on sugaring would do some good to the SBs (although it would be a bummer for me). A lot of these posts come from girls my age and I think so many of these men seek us because we lack experience. I am very heavy-handed with the block/delete button and do not waste time when I notice red flags or feel uncomfortable, no matter how much money is promised.",
                    "author": null,
                    "id": "gci58kb",
                    "parent_id": "t1_gci48i4",
                    "score": 15,
                    "created_utc": 1605541409.0,
                    "replies": [
                        {
                            "body": "Yes! The worst part is when these stories come from peers. Being younger definitely makes us easier targets which is why I wish newbies would spend more time educating + mentally preparing themselves for this lifestyle.",
                            "author": "curly_spice",
                            "id": "gcif9g6",
                            "parent_id": "t1_gci58kb",
                            "score": 4,
                            "created_utc": 1605546313.0,
                            "replies": [
                                {
                                    "body": "Yes!! This sub is so damn helpful. I \"researched\" this sub like a solid 10 months before diving in. I only decided to enter the bowl because I felt ready and understood a proper/safe way to do so.",
                                    "author": "w4termelonsug4r",
                                    "id": "gcj6lr8",
                                    "parent_id": "t1_gcif9g6",
                                    "score": 5,
                                    "created_utc": 1605558667.0,
                                    "replies": [
                                        {
                                            "body": "Same here. There’s a lot of helpful information available, people just have to take the time and find it. But no, they insist on making the rest of us young SBs look bad 🥴",
                                            "author": "curly_spice",
                                            "id": "gcj92tz",
                                            "parent_id": "t1_gcj6lr8",
                                            "score": 2,
                                            "created_utc": 1605559606.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Same here! I still ask questions from time to time, but i've been 'researching' this sub along with countless do's and don't articles on how to sugar with safety and confidence. I feel more than ready to take the leap into sugaring than i did before taking the time to read through everyone else's q&a's. I wish more aspiring sb's did the same.",
                                            "author": "babyxjminah",
                                            "id": "gcl506n",
                                            "parent_id": "t1_gcj6lr8",
                                            "score": 2,
                                            "created_utc": 1605594407.0,
                                            "replies": [
                                                {
                                                    "body": "This makes me happy to read. Atta girl!! Safety first. Always.",
                                                    "author": "w4termelonsug4r",
                                                    "id": "gclw4po",
                                                    "parent_id": "t1_gcl506n",
                                                    "score": 1,
                                                    "created_utc": 1605619926.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Smart girl.\n\n And I agree with the age... Not old enough to have a drink at a bar but you're old enough to sugar. Seems whack but what can ya do.",
                            "author": "w4termelonsug4r",
                            "id": "gcj6foy",
                            "parent_id": "t1_gci58kb",
                            "score": 2,
                            "created_utc": 1605558601.0,
                            "replies": [
                                {
                                    "body": "I don’t like when Americans bring up that argument because they seem to forget a lot of us can legally drink at 18 lol",
                                    "author": null,
                                    "id": "gcjavb8",
                                    "parent_id": "t1_gcj6foy",
                                    "score": 3,
                                    "created_utc": 1605560300.0,
                                    "replies": [
                                        {
                                            "body": "I'm Canadian which probably explains why I didnt know that😅🤭. Certain areas are for 18?",
                                            "author": "w4termelonsug4r",
                                            "id": "gckpnqi",
                                            "parent_id": "t1_gcjavb8",
                                            "score": 1,
                                            "created_utc": 1605583996.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This exactly!!! I wanna share my thoughts without sounding like I'm victim blaming but as you said... So many red flags you'd think you're at an amusement park..",
            "author": "w4termelonsug4r",
            "id": "gci3n0z",
            "parent_id": "t1_gci3h4v",
            "score": 1,
            "created_utc": 1605540595.0,
            "replies": []
        },
        {
            "body": "Yeah this was for normal dating btw. \nI still don't think I have enough experience to go into sugaring, the men seem to be a lot more brash and I don't tolerate rudeness regardless so I've lost potential pots lol.",
            "author": "PessimisticAna",
            "id": "gckcxsi",
            "parent_id": "t1_gckc7nc",
            "score": 2,
            "created_utc": 1605577110.0,
            "replies": [
                {
                    "body": "If they were brash and rude, then they've lost you, not the other way round.",
                    "author": "Sophs_B",
                    "id": "gclimpd",
                    "parent_id": "t1_gckcxsi",
                    "score": 3,
                    "created_utc": 1605607685.0,
                    "replies": [
                        {
                            "body": "Thats a good way to see it",
                            "author": "PessimisticAna",
                            "id": "gclmnlx",
                            "parent_id": "t1_gclimpd",
                            "score": 1,
                            "created_utc": 1605612031.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What needs to be \"tough\" about the love? Literally you could have just said the (great) points you needed to say and been done with it.  \n\nThe world is looking for reasons to blame women for being assaulted, and sharing this kind of information among each other is the most valuable thing you can do. So when you start with \"I'm not victim blaming, HOWEVER...\", it's going to read like you're saying that women who can't read these red flags as quickly, or who experience assault, are partially to blame.",
            "author": "twocatsnoheart",
            "id": "gck8rsa",
            "parent_id": "t1_gck373u",
            "score": 3,
            "created_utc": 1605574872.0,
            "replies": [
                {
                    "body": "Hm.. I actually agree with OP here. When you teach a child not to touch the fire, sometimes saying it calmly just doesn't cut it. They may ignore the warning because it doesn't seem serious when being told in a calm/relaxed way. They might not see the severity of touching the fire. Some kids need that stern and tough tone to truly understand the warning. \n\nThe girls who ended up in these unfortunate situations may have needed that stern warning post instead of a post talking about how wonderful their sb lifestyle is. It's not implying they're to blame, it's just another way to warn them, and if it can save another woman from that fate, then we should welcome it.",
                    "author": "babyxjminah",
                    "id": "gcl73ao",
                    "parent_id": "t1_gck8rsa",
                    "score": 6,
                    "created_utc": 1605596155.0,
                    "replies": []
                },
                {
                    "body": "I’m sorry you’re not a fan of the tone of the post. If women aren’t able to accurately recognize red flags or warning signs, they simply should not be doing sugaring. That’s the whole point. Is it their fault that so many men on the site are predatory? Absolutely not. But should they still have a sense of responsibility towards themselves and their safety? Of course",
                    "author": "qwertycats-",
                    "id": "gckbixv",
                    "parent_id": "t1_gck8rsa",
                    "score": 7,
                    "created_utc": 1605576374.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "More importantly, how is the relationship treated.  Would the SB rather be paid 2-4x what she is paid in a menial job PLUS an allowance to make the SD life easier.",
            "author": "pinotandsugar",
            "id": "gckioj4",
            "parent_id": "t1_gck0qgj",
            "score": -1,
            "created_utc": 1605580179.0,
            "replies": []
        },
        {
            "body": "By asking the question  ,   \"How stupid will this look if it turns out badly\" ?  \n\n\n\nA lot of what Gavin de Becker talks about in Gift of Fear is that people often go to great lengths to suppress the blinking red lights.",
            "author": "pinotandsugar",
            "id": "gckgmrz",
            "parent_id": "t1_gck51um",
            "score": 5,
            "created_utc": 1605579099.0,
            "replies": [
                {
                    "body": "Yep. Gift of Fear should be compulsory reading for newbie SBs.",
                    "author": "Mangotingthroneway",
                    "id": "gclhn2j",
                    "parent_id": "t1_gckgmrz",
                    "score": 2,
                    "created_utc": 1605606591.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I feel like a lot of women here are so blinded by the monetary aspect that they prefer to ignore their instinct. All it takes for these men is to promise they will spoil them rotten. I also kinda think, despite being young myself, that an age limit of 21 on sugaring would do some good to the SBs (although it would be a bummer for me). A lot of these posts come from girls my age and I think so many of these men seek us because we lack experience. I am very heavy-handed with the block/delete button and do not waste time when I notice red flags or feel uncomfortable, no matter how much money is promised.",
            "author": null,
            "id": "gci58kb",
            "parent_id": "t1_gci48i4",
            "score": 15,
            "created_utc": 1605541409.0,
            "replies": [
                {
                    "body": "Yes! The worst part is when these stories come from peers. Being younger definitely makes us easier targets which is why I wish newbies would spend more time educating + mentally preparing themselves for this lifestyle.",
                    "author": "curly_spice",
                    "id": "gcif9g6",
                    "parent_id": "t1_gci58kb",
                    "score": 4,
                    "created_utc": 1605546313.0,
                    "replies": [
                        {
                            "body": "Yes!! This sub is so damn helpful. I \"researched\" this sub like a solid 10 months before diving in. I only decided to enter the bowl because I felt ready and understood a proper/safe way to do so.",
                            "author": "w4termelonsug4r",
                            "id": "gcj6lr8",
                            "parent_id": "t1_gcif9g6",
                            "score": 5,
                            "created_utc": 1605558667.0,
                            "replies": [
                                {
                                    "body": "Same here. There’s a lot of helpful information available, people just have to take the time and find it. But no, they insist on making the rest of us young SBs look bad 🥴",
                                    "author": "curly_spice",
                                    "id": "gcj92tz",
                                    "parent_id": "t1_gcj6lr8",
                                    "score": 2,
                                    "created_utc": 1605559606.0,
                                    "replies": []
                                },
                                {
                                    "body": "Same here! I still ask questions from time to time, but i've been 'researching' this sub along with countless do's and don't articles on how to sugar with safety and confidence. I feel more than ready to take the leap into sugaring than i did before taking the time to read through everyone else's q&a's. I wish more aspiring sb's did the same.",
                                    "author": "babyxjminah",
                                    "id": "gcl506n",
                                    "parent_id": "t1_gcj6lr8",
                                    "score": 2,
                                    "created_utc": 1605594407.0,
                                    "replies": [
                                        {
                                            "body": "This makes me happy to read. Atta girl!! Safety first. Always.",
                                            "author": "w4termelonsug4r",
                                            "id": "gclw4po",
                                            "parent_id": "t1_gcl506n",
                                            "score": 1,
                                            "created_utc": 1605619926.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Smart girl.\n\n And I agree with the age... Not old enough to have a drink at a bar but you're old enough to sugar. Seems whack but what can ya do.",
                    "author": "w4termelonsug4r",
                    "id": "gcj6foy",
                    "parent_id": "t1_gci58kb",
                    "score": 2,
                    "created_utc": 1605558601.0,
                    "replies": [
                        {
                            "body": "I don’t like when Americans bring up that argument because they seem to forget a lot of us can legally drink at 18 lol",
                            "author": null,
                            "id": "gcjavb8",
                            "parent_id": "t1_gcj6foy",
                            "score": 3,
                            "created_utc": 1605560300.0,
                            "replies": [
                                {
                                    "body": "I'm Canadian which probably explains why I didnt know that😅🤭. Certain areas are for 18?",
                                    "author": "w4termelonsug4r",
                                    "id": "gckpnqi",
                                    "parent_id": "t1_gcjavb8",
                                    "score": 1,
                                    "created_utc": 1605583996.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If they were brash and rude, then they've lost you, not the other way round.",
            "author": "Sophs_B",
            "id": "gclimpd",
            "parent_id": "t1_gckcxsi",
            "score": 3,
            "created_utc": 1605607685.0,
            "replies": [
                {
                    "body": "Thats a good way to see it",
                    "author": "PessimisticAna",
                    "id": "gclmnlx",
                    "parent_id": "t1_gclimpd",
                    "score": 1,
                    "created_utc": 1605612031.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hm.. I actually agree with OP here. When you teach a child not to touch the fire, sometimes saying it calmly just doesn't cut it. They may ignore the warning because it doesn't seem serious when being told in a calm/relaxed way. They might not see the severity of touching the fire. Some kids need that stern and tough tone to truly understand the warning. \n\nThe girls who ended up in these unfortunate situations may have needed that stern warning post instead of a post talking about how wonderful their sb lifestyle is. It's not implying they're to blame, it's just another way to warn them, and if it can save another woman from that fate, then we should welcome it.",
            "author": "babyxjminah",
            "id": "gcl73ao",
            "parent_id": "t1_gck8rsa",
            "score": 6,
            "created_utc": 1605596155.0,
            "replies": []
        },
        {
            "body": "I’m sorry you’re not a fan of the tone of the post. If women aren’t able to accurately recognize red flags or warning signs, they simply should not be doing sugaring. That’s the whole point. Is it their fault that so many men on the site are predatory? Absolutely not. But should they still have a sense of responsibility towards themselves and their safety? Of course",
            "author": "qwertycats-",
            "id": "gckbixv",
            "parent_id": "t1_gck8rsa",
            "score": 7,
            "created_utc": 1605576374.0,
            "replies": []
        },
        {
            "body": "Yep. Gift of Fear should be compulsory reading for newbie SBs.",
            "author": "Mangotingthroneway",
            "id": "gclhn2j",
            "parent_id": "t1_gckgmrz",
            "score": 2,
            "created_utc": 1605606591.0,
            "replies": []
        },
        {
            "body": "Yes! The worst part is when these stories come from peers. Being younger definitely makes us easier targets which is why I wish newbies would spend more time educating + mentally preparing themselves for this lifestyle.",
            "author": "curly_spice",
            "id": "gcif9g6",
            "parent_id": "t1_gci58kb",
            "score": 4,
            "created_utc": 1605546313.0,
            "replies": [
                {
                    "body": "Yes!! This sub is so damn helpful. I \"researched\" this sub like a solid 10 months before diving in. I only decided to enter the bowl because I felt ready and understood a proper/safe way to do so.",
                    "author": "w4termelonsug4r",
                    "id": "gcj6lr8",
                    "parent_id": "t1_gcif9g6",
                    "score": 5,
                    "created_utc": 1605558667.0,
                    "replies": [
                        {
                            "body": "Same here. There’s a lot of helpful information available, people just have to take the time and find it. But no, they insist on making the rest of us young SBs look bad 🥴",
                            "author": "curly_spice",
                            "id": "gcj92tz",
                            "parent_id": "t1_gcj6lr8",
                            "score": 2,
                            "created_utc": 1605559606.0,
                            "replies": []
                        },
                        {
                            "body": "Same here! I still ask questions from time to time, but i've been 'researching' this sub along with countless do's and don't articles on how to sugar with safety and confidence. I feel more than ready to take the leap into sugaring than i did before taking the time to read through everyone else's q&a's. I wish more aspiring sb's did the same.",
                            "author": "babyxjminah",
                            "id": "gcl506n",
                            "parent_id": "t1_gcj6lr8",
                            "score": 2,
                            "created_utc": 1605594407.0,
                            "replies": [
                                {
                                    "body": "This makes me happy to read. Atta girl!! Safety first. Always.",
                                    "author": "w4termelonsug4r",
                                    "id": "gclw4po",
                                    "parent_id": "t1_gcl506n",
                                    "score": 1,
                                    "created_utc": 1605619926.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Smart girl.\n\n And I agree with the age... Not old enough to have a drink at a bar but you're old enough to sugar. Seems whack but what can ya do.",
            "author": "w4termelonsug4r",
            "id": "gcj6foy",
            "parent_id": "t1_gci58kb",
            "score": 2,
            "created_utc": 1605558601.0,
            "replies": [
                {
                    "body": "I don’t like when Americans bring up that argument because they seem to forget a lot of us can legally drink at 18 lol",
                    "author": null,
                    "id": "gcjavb8",
                    "parent_id": "t1_gcj6foy",
                    "score": 3,
                    "created_utc": 1605560300.0,
                    "replies": [
                        {
                            "body": "I'm Canadian which probably explains why I didnt know that😅🤭. Certain areas are for 18?",
                            "author": "w4termelonsug4r",
                            "id": "gckpnqi",
                            "parent_id": "t1_gcjavb8",
                            "score": 1,
                            "created_utc": 1605583996.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thats a good way to see it",
            "author": "PessimisticAna",
            "id": "gclmnlx",
            "parent_id": "t1_gclimpd",
            "score": 1,
            "created_utc": 1605612031.0,
            "replies": []
        },
        {
            "body": "Yes!! This sub is so damn helpful. I \"researched\" this sub like a solid 10 months before diving in. I only decided to enter the bowl because I felt ready and understood a proper/safe way to do so.",
            "author": "w4termelonsug4r",
            "id": "gcj6lr8",
            "parent_id": "t1_gcif9g6",
            "score": 5,
            "created_utc": 1605558667.0,
            "replies": [
                {
                    "body": "Same here. There’s a lot of helpful information available, people just have to take the time and find it. But no, they insist on making the rest of us young SBs look bad 🥴",
                    "author": "curly_spice",
                    "id": "gcj92tz",
                    "parent_id": "t1_gcj6lr8",
                    "score": 2,
                    "created_utc": 1605559606.0,
                    "replies": []
                },
                {
                    "body": "Same here! I still ask questions from time to time, but i've been 'researching' this sub along with countless do's and don't articles on how to sugar with safety and confidence. I feel more than ready to take the leap into sugaring than i did before taking the time to read through everyone else's q&a's. I wish more aspiring sb's did the same.",
                    "author": "babyxjminah",
                    "id": "gcl506n",
                    "parent_id": "t1_gcj6lr8",
                    "score": 2,
                    "created_utc": 1605594407.0,
                    "replies": [
                        {
                            "body": "This makes me happy to read. Atta girl!! Safety first. Always.",
                            "author": "w4termelonsug4r",
                            "id": "gclw4po",
                            "parent_id": "t1_gcl506n",
                            "score": 1,
                            "created_utc": 1605619926.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t like when Americans bring up that argument because they seem to forget a lot of us can legally drink at 18 lol",
            "author": null,
            "id": "gcjavb8",
            "parent_id": "t1_gcj6foy",
            "score": 3,
            "created_utc": 1605560300.0,
            "replies": [
                {
                    "body": "I'm Canadian which probably explains why I didnt know that😅🤭. Certain areas are for 18?",
                    "author": "w4termelonsug4r",
                    "id": "gckpnqi",
                    "parent_id": "t1_gcjavb8",
                    "score": 1,
                    "created_utc": 1605583996.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Same here. There’s a lot of helpful information available, people just have to take the time and find it. But no, they insist on making the rest of us young SBs look bad 🥴",
            "author": "curly_spice",
            "id": "gcj92tz",
            "parent_id": "t1_gcj6lr8",
            "score": 2,
            "created_utc": 1605559606.0,
            "replies": []
        },
        {
            "body": "Same here! I still ask questions from time to time, but i've been 'researching' this sub along with countless do's and don't articles on how to sugar with safety and confidence. I feel more than ready to take the leap into sugaring than i did before taking the time to read through everyone else's q&a's. I wish more aspiring sb's did the same.",
            "author": "babyxjminah",
            "id": "gcl506n",
            "parent_id": "t1_gcj6lr8",
            "score": 2,
            "created_utc": 1605594407.0,
            "replies": [
                {
                    "body": "This makes me happy to read. Atta girl!! Safety first. Always.",
                    "author": "w4termelonsug4r",
                    "id": "gclw4po",
                    "parent_id": "t1_gcl506n",
                    "score": 1,
                    "created_utc": 1605619926.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm Canadian which probably explains why I didnt know that😅🤭. Certain areas are for 18?",
            "author": "w4termelonsug4r",
            "id": "gckpnqi",
            "parent_id": "t1_gcjavb8",
            "score": 1,
            "created_utc": 1605583996.0,
            "replies": []
        },
        {
            "body": "This makes me happy to read. Atta girl!! Safety first. Always.",
            "author": "w4termelonsug4r",
            "id": "gclw4po",
            "parent_id": "t1_gcl506n",
            "score": 1,
            "created_utc": 1605619926.0,
            "replies": []
        }
    ]
}