{
    "title": "Tired of the repetitive content here. Hope to see new memes soon and here's my contribution",
    "post_id": "t3gh94",
    "post_url": "https://www.reddit.com/r/dankruto/comments/t3gh94/tired_of_the_repetitive_content_here_hope_to_see/",
    "author": "SeaworthinessWeary68",
    "body": "",
    "url": "https://i.redd.it/inmhel0b0lk81.gif",
    "score": 4166,
    "upvote_ratio": 0.98,
    "created_utc": 1646057425.0,
    "num_comments": 84,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Reference :-\n\nZabuza said that he killed every competetor... Good Meme",
            "author": null,
            "id": "hys4ra8",
            "parent_id": "t3_t3gh94",
            "score": 329,
            "created_utc": 1646058646.0,
            "replies": [
                {
                    "body": "That’s what I remember too and I haven’t seen it read Naruto in about a decade",
                    "author": "Nokia_00",
                    "id": "hysbaj0",
                    "parent_id": "t1_hys4ra8",
                    "score": 78,
                    "created_utc": 1646061530.0,
                    "replies": [
                        {
                            "body": "yea i also remembered a scene where Kid Zabuza was standing between corpses of dead bodies",
                            "author": null,
                            "id": "hyscqr9",
                            "parent_id": "t1_hysbaj0",
                            "score": 44,
                            "created_utc": 1646062132.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Except everyone else had guns too and were told to shoot each other instead of race",
                    "author": "SmallerBork",
                    "id": "hyt6r58",
                    "parent_id": "t1_hys4ra8",
                    "score": 13,
                    "created_utc": 1646073788.0,
                    "replies": []
                },
                {
                    "body": "This meme would be better without the \"No one\" and \"Literally no one\"\n\n\nIt's unnecessary",
                    "author": "OuchYouPokedMyHeart",
                    "id": "hyscfbe",
                    "parent_id": "t1_hys4ra8",
                    "score": 66,
                    "created_utc": 1646062000.0,
                    "replies": [
                        {
                            "body": ">Literally no one\n\nidk why people put that and worse, they'll add \"not even a single a soul\"",
                            "author": "yuuri_ni_victor",
                            "id": "hyueaa3",
                            "parent_id": "t1_hyscfbe",
                            "score": 13,
                            "created_utc": 1646091122.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "The competition was to kill competitors. He wasn’t a trained killer enrolled with the school at the time. He was just so good at it that he was above everyone else who had classical training.  If you take the information given to us about the timeline of events in the mist, Zabuza is only a few years older than naruto.",
                    "author": "HeraldofblueRP",
                    "id": "hysfnl2",
                    "parent_id": "t1_hys4ra8",
                    "score": 15,
                    "created_utc": 1646063328.0,
                    "replies": [
                        {
                            "body": "Zabuza is 26 in Part 1",
                            "author": "Chalaka",
                            "id": "hysz5b2",
                            "parent_id": "t1_hysfnl2",
                            "score": 19,
                            "created_utc": 1646070885.0,
                            "replies": [
                                {
                                    "body": "According to the datebooks, He was 9 when he graduated the academy. 11 years after that he met naruto. So he was 20, at least in the time line the story lays out. The data books does go on to say he is 26.",
                                    "author": "HeraldofblueRP",
                                    "id": "hyunznd",
                                    "parent_id": "t1_hysz5b2",
                                    "score": 5,
                                    "created_utc": 1646095663.0,
                                    "replies": [
                                        {
                                            "body": "I'd have to watch Zabuza explaining his past again (I can't at the moment) but something or someone isn't right.",
                                            "author": "Chalaka",
                                            "id": "hyurp3o",
                                            "parent_id": "t1_hyunznd",
                                            "score": 4,
                                            "created_utc": 1646097416.0,
                                            "replies": [
                                                {
                                                    "body": "These minor mistakes are pretty common in naruto. It’s no big deal.",
                                                    "author": "HeraldofblueRP",
                                                    "id": "hyvlex9",
                                                    "parent_id": "t1_hyurp3o",
                                                    "score": 5,
                                                    "created_utc": 1646111918.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "He was forced to kill his friends and classmates they all were.",
                    "author": "Kotsugawa",
                    "id": "hyv2ggj",
                    "parent_id": "t1_hys4ra8",
                    "score": 4,
                    "created_utc": 1646102405.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Zabuza gets overlooked as a strong character because he is defeated so early on in the series. But, he actually beat Kakashi pretty easily. It was only because of Naruto + Sasuke that he ended up losing. Although, Kakashi's rematch at the bridge he did actually lose fair and square.",
            "author": "tpklus",
            "id": "hyseq63",
            "parent_id": "t3_t3gh94",
            "score": 124,
            "created_utc": 1646062951.0,
            "replies": [
                {
                    "body": "You're right that Zabuza's early defeat hurts the audience perception of his strength. He beat Kakashi, but it was the weakest version of Kakashi we ever got to see. Kakashi got so much stronger as the series progressed, even without training, that the idea of Zabuza as a challenge for Kakashi stopped being reasonable pretty quickly in Shippuden. \n\nIt doesn't help that we later learn Kakashi had a mangekyo sharingan available the whole time. Kamui would have ended the fight with Zabuza immediately, especially as Zabuza was a sitting duck while using the water prison jutsu. Once the existence of kamui is revealed to the audience, the story becomes \"Kakashi could have ended the fight at any time, but he wasn't sure it was worth heavy exhaustion and a slight degredation to his sharingan's eyesight.\"\n\nAlso the later introduction of the rest of the 7 Swords of the Mist didn't help Zabuza much. Of the seven, the Executioner Blade is the least impressive (still looks cool though) for combat. And its gimmick, using iron in blood to repair itself, means it's one of the very few swords we see repeatedly broken in Naruto. Based on how often the blade breaks, it comes across like the Executioner Blade is unusually fragile and therefore needs that repair feature.",
                    "author": "Justicar-terrae",
                    "id": "hysmhxd",
                    "parent_id": "t1_hyseq63",
                    "score": 43,
                    "created_utc": 1646066046.0,
                    "replies": [
                        {
                            "body": "I agree with most of your comment. It is reasonable to assume that Zabuza would also grow in strength as the series progresses. Probably not to the extent that Kakashi does as he becomes Uber powerful. But, possibly with help from Haku they can be on par with an Akatsuki duo. His sword is pretty lame too. It would be cool if the sword also increases in size/strength when it steals iron from enemies' blood. \n\nIn short, Zabuza is a cool character and I wish he got some more screentime. Seeing him resurrected was a mistake as I feel his story was resolved on the bridge when he died.",
                            "author": "tpklus",
                            "id": "hysoukf",
                            "parent_id": "t1_hysmhxd",
                            "score": 15,
                            "created_utc": 1646066952.0,
                            "replies": [
                                {
                                    "body": "Nah bringing him back was sick. Seeing him and haku still feel indepted to kakashi and showing how much kakakshi has grown even as a jonin during the entire anime/manga. \n\nGotta remember, in og Naruto, kakashi was basically retired from being a ninja. Kakashi wasn't barely his anbu level during that first fight. Now we seem him further ahead than he was when he was anbu.",
                                    "author": "codeklutch",
                                    "id": "hytyp1b",
                                    "parent_id": "t1_hysoukf",
                                    "score": 8,
                                    "created_utc": 1646084568.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">\"Kakashi could have ended the fight at any time, but he wasn't sure it was worth heavy exhaustion and a slight degredation to his sharingan's eyesight.\"\n\nWell not really. Even though Kakashi gets Mangekyou Sharingan when he's younger, he passes out, and has no idea he has it until much later. We probably won't see how he finds out about it any time soon, he most probably read the Uchiha tablet to see if he can improve his Sharingan.",
                            "author": "Chalaka",
                            "id": "hyszxzu",
                            "parent_id": "t1_hysmhxd",
                            "score": 6,
                            "created_utc": 1646071183.0,
                            "replies": [
                                {
                                    "body": "Imagine Kakashi reading the tablet:\nTo awaken the Mangekyou sharingan, a forbidden technique granting unimaginable power, you must perform the unthinkable. You must see your most precious comrade die to your hands.\n\n\"Hey, I already did that! Twice!\"",
                                    "author": "RedShankyMan",
                                    "id": "hyt2ax5",
                                    "parent_id": "t1_hyszxzu",
                                    "score": 17,
                                    "created_utc": 1646072092.0,
                                    "replies": [
                                        {
                                            "body": "💎💎 Achievement unlocked: Mangekyo Sharingan 💎💎",
                                            "author": "MadEyeJoker",
                                            "id": "hyuzk1m",
                                            "parent_id": "t1_hyt2ax5",
                                            "score": 7,
                                            "created_utc": 1646101054.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Zabuza lost to someone who was a perfect Counter to him. Kakashi’s dogs made his Mist useless, his sharingan helped him combat against the executioner blade, and Kakashi knew enough jutsu to counter anything Zabuza could use. :(",
                    "author": "enoughfuckery",
                    "id": "hysgq5a",
                    "parent_id": "t1_hyseq63",
                    "score": 70,
                    "created_utc": 1646063753.0,
                    "replies": [
                        {
                            "body": "True, and Zabuza still fought well!",
                            "author": "Slimxshadyx",
                            "id": "hysipaf",
                            "parent_id": "t1_hysgq5a",
                            "score": 32,
                            "created_utc": 1646064542.0,
                            "replies": [
                                {
                                    "body": "Yes he did. And while he’s not Akatsuki level, he’s still high jonin, and would slaughter a lot of characters.",
                                    "author": "enoughfuckery",
                                    "id": "hyslsxk",
                                    "parent_id": "t1_hysipaf",
                                    "score": 33,
                                    "created_utc": 1646065770.0,
                                    "replies": [
                                        {
                                            "body": "He is akatsuki level though. He no diffs Hidan and is better than that juzo fella",
                                            "author": "glogangintern",
                                            "id": "hysnd8b",
                                            "parent_id": "t1_hyslsxk",
                                            "score": 15,
                                            "created_utc": 1646066382.0,
                                            "replies": [
                                                {
                                                    "body": "Idk who Juzo is I never watched the filler in later Shippuden. And him being Hidan level isn’t exactly saying much, if Hidan wasn’t immortal he wouldn’t have been anyone special, the second worst member of the Akatsuki (whoever you consider that to be) still beats Zabuza. Which isn’t to demean him, but the Akatsuki really are that strong",
                                                    "author": "enoughfuckery",
                                                    "id": "hysnv73",
                                                    "parent_id": "t1_hysnd8b",
                                                    "score": 21,
                                                    "created_utc": 1646066574.0,
                                                    "replies": [
                                                        {
                                                            "body": "Pretty sure Juzo was the owner of the executioners blade before zabuza and itachis original partner in the akatsuki. He talks about might Dai (guy's genin father) who used the 8 gates to kill 4 of the 7 swordsman of the hidden mist at once.",
                                                            "author": "NewBuddha32",
                                                            "id": "hytkdwa",
                                                            "parent_id": "t1_hysnv73",
                                                            "score": 12,
                                                            "created_utc": 1646079027.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I'm still mad we didn't get to see that fight",
                                                                    "author": "Musulmaniaco",
                                                                    "id": "hyuedyq",
                                                                    "parent_id": "t1_hytkdwa",
                                                                    "score": 4,
                                                                    "created_utc": 1646091169.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Me too. How did the other 3 get away? Did they manage to kill him or did he die from the 8th gate? It's such a badass moment for that character and he deserved to be seen whooping ass one time.",
                                                                            "author": "NewBuddha32",
                                                                            "id": "hyuhqbd",
                                                                            "parent_id": "t1_hyuedyq",
                                                                            "score": 3,
                                                                            "created_utc": 1646092708.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Yep but he is stronger and more useful than Hidan so he literally is Akatsuki level. His Giant chakra reserves and Hiddenn Mist Jutsu would frustrate the life out of Jinchuuriki and would have been a good in random with another member. Haku also fits the bill and had potential to be stronger than Sasori.",
                                                            "author": "glogangintern",
                                                            "id": "hytj98m",
                                                            "parent_id": "t1_hysnv73",
                                                            "score": 8,
                                                            "created_utc": 1646078582.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Haku definitely had potential. He wouldn't be able to beat any akatsuki at his level then, but give him a few years and he def could beat Sasori",
                                                                    "author": "Slimxshadyx",
                                                                    "id": "hyugkky",
                                                                    "parent_id": "t1_hytj98m",
                                                                    "score": 2,
                                                                    "created_utc": 1646092170.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "What could Hidan do to Haku? I’m sure haku could decapitate Hidan by using crystal ice mirrors",
                                                                            "author": "glogangintern",
                                                                            "id": "hyvyyit",
                                                                            "parent_id": "t1_hyugkky",
                                                                            "score": 1,
                                                                            "created_utc": 1646121061.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I'm not sure how Hidan could attack Haku, but you have to remember Hidan has pretty good fighting skills, so I don't think it's so simple for Haku to just decapitate him.\n\nHe fought Kakashi blade on blade without struggle, and the only times he got caught was Shikamaru needing to do some 300 IQ moves. He even dodged a Chakra blade in mid air from his quick thinking.\n\nIn terms of raw power, Hidan is pretty low on the Akatsuki scale, but he makes up for it in his defenses, speed, and reaction times.",
                                                                                    "author": "Slimxshadyx",
                                                                                    "id": "hyz1w66",
                                                                                    "parent_id": "t1_hyvyyit",
                                                                                    "score": 1,
                                                                                    "created_utc": 1646174832.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "He is the slowest and weakest out of the akatsuki. Completely fell for a substitution jutsu and couldn’t keep up with a Kakashi being chased by 3 of Kakuzu’s heart monsters. He’s shit. Haku would disable him and bury him. He also needs time to form his ritual and Haku blitzes him.",
                                                                                            "author": "glogangintern",
                                                                                            "id": "hz119vc",
                                                                                            "parent_id": "t1_hyz1w66",
                                                                                            "score": 1,
                                                                                            "created_utc": 1646211506.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Naruto and Sasuke kind of got in way of Kakashi in their first fight, that forced Kakashi to protected them and get caught by Zabuza. So their help evens out the handicape that they gave for kakashi.",
                    "author": "DrunkSaruman",
                    "id": "hyuacva",
                    "parent_id": "t1_hyseq63",
                    "score": 3,
                    "created_utc": 1646089359.0,
                    "replies": []
                },
                {
                    "body": "I felt he lost on purpose to spur on Naruto and sas-gay. Specifically Sas-gay who wanted to end his own life at the sheer talent of 2 Jonin going head to head. some avenger",
                    "author": "Buffalonightmare",
                    "id": "hyvak90",
                    "parent_id": "t1_hyseq63",
                    "score": 2,
                    "created_utc": 1646106237.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "People in here are gonna have a heart attack after seeing a new meme and not sakura bad or boruto bad meme",
            "author": "sanid_sriva",
            "id": "hys91e6",
            "parent_id": "t3_t3gh94",
            "score": 126,
            "created_utc": 1646060554.0,
            "replies": [
                {
                    "body": ">Oh hey look a new meme, I'm gonna shit myself and die.\n\nr/dankruto users, probably",
                    "author": "SonicBlur254",
                    "id": "hysas1q",
                    "parent_id": "t1_hys91e6",
                    "score": 32,
                    "created_utc": 1646061311.0,
                    "replies": []
                },
                {
                    "body": "Those are the best memes though :(",
                    "author": "MDJ_STRIKER",
                    "id": "hyt4xpg",
                    "parent_id": "t1_hys91e6",
                    "score": 8,
                    "created_utc": 1646073092.0,
                    "replies": [
                        {
                            "body": "Those are the only memes in top here",
                            "author": "sanid_sriva",
                            "id": "hytud87",
                            "parent_id": "t1_hyt4xpg",
                            "score": 4,
                            "created_utc": 1646082893.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Sakura bad, ramen guy good",
                    "author": "deekascab",
                    "id": "hytdgss",
                    "parent_id": "t1_hys91e6",
                    "score": 3,
                    "created_utc": 1646076352.0,
                    "replies": []
                },
                {
                    "body": "I had a heart attack because of the shitty \"nO oNe: aBsoLuTeLy nO oNe: \" garbage",
                    "author": "Electro226",
                    "id": "hytcokz",
                    "parent_id": "t1_hys91e6",
                    "score": 5,
                    "created_utc": 1646076053.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "r/Uselessnobody",
            "author": "JoeyAndrews",
            "id": "hyspvg0",
            "parent_id": "t3_t3gh94",
            "score": 21,
            "created_utc": 1646067343.0,
            "replies": [
                {
                    "body": "Cant wait for this shit meme format to die off",
                    "author": "YARPakaLEX",
                    "id": "hytd5fo",
                    "parent_id": "t1_hyspvg0",
                    "score": 7,
                    "created_utc": 1646076231.0,
                    "replies": [
                        {
                            "body": "Been going for years unfortunately so probably never will",
                            "author": "island_donn_",
                            "id": "hyuosov",
                            "parent_id": "t1_hytd5fo",
                            "score": 3,
                            "created_utc": 1646096042.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good start for sure",
            "author": "Illustrious_Side_396",
            "id": "hys992w",
            "parent_id": "t3_t3gh94",
            "score": 19,
            "created_utc": 1646060646.0,
            "replies": []
        },
        {
            "body": "That's good contribution!",
            "author": "Amaro760",
            "id": "hysamtw",
            "parent_id": "t3_t3gh94",
            "score": 9,
            "created_utc": 1646061249.0,
            "replies": []
        },
        {
            "body": "Absolutely love this movie. Stellar meme.",
            "author": "Barnard87",
            "id": "hysvgsh",
            "parent_id": "t3_t3gh94",
            "score": 4,
            "created_utc": 1646069498.0,
            "replies": [
                {
                    "body": "By far my favorite Sacha Baron Cohen movie. You are HIV Aladeen!",
                    "author": null,
                    "id": "hytbufh",
                    "parent_id": "t1_hysvgsh",
                    "score": 3,
                    "created_utc": 1646075731.0,
                    "replies": [
                        {
                            "body": "\"It needs to be pointy\"",
                            "author": "Barnard87",
                            "id": "hytnzms",
                            "parent_id": "t1_hytbufh",
                            "score": 3,
                            "created_utc": 1646080429.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Absolute masterpiece I squealed watching this",
            "author": "delusional_piscean",
            "id": "hysvkk7",
            "parent_id": "t3_t3gh94",
            "score": 3,
            "created_utc": 1646069539.0,
            "replies": []
        },
        {
            "body": "thank you\n\nSomething different from the usual “Boruto Sucks” stuff that floods this subreddit",
            "author": "HokageOfReddit",
            "id": "hyscmiy",
            "parent_id": "t3_t3gh94",
            "score": 6,
            "created_utc": 1646062082.0,
            "replies": []
        },
        {
            "body": "u/savevideo",
            "author": "kedychan",
            "id": "hys9rvb",
            "parent_id": "t3_t3gh94",
            "score": 3,
            "created_utc": 1646060876.0,
            "replies": [
                {
                    "body": "u/savevideobot",
                    "author": "kedychan",
                    "id": "hysb9d2",
                    "parent_id": "t1_hys9rvb",
                    "score": 3,
                    "created_utc": 1646061516.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Those kids probably had it coming for mocking him about his shark teeth",
            "author": "Rom455",
            "id": "hytkz3x",
            "parent_id": "t3_t3gh94",
            "score": 3,
            "created_utc": 1646079260.0,
            "replies": []
        },
        {
            "body": "I love this movie its easily one of my favorites along with Accident man",
            "author": "Moist_Bee_1880",
            "id": "hyua2n4",
            "parent_id": "t3_t3gh94",
            "score": 3,
            "created_utc": 1646089236.0,
            "replies": []
        },
        {
            "body": "r/uselessnobody. Cover up the nobody line, and ask if it adds anything or is even necessary. The answer is always no to both.",
            "author": "kay_bizzle",
            "id": "hytxfji",
            "parent_id": "t3_t3gh94",
            "score": 4,
            "created_utc": 1646084074.0,
            "replies": []
        },
        {
            "body": "Almost perfect. But can we PLEASE leave behind the fucking r/uselessnobody template?",
            "author": "Negrizzy153",
            "id": "hyu6g8d",
            "parent_id": "t3_t3gh94",
            "score": 4,
            "created_utc": 1646087704.0,
            "replies": []
        },
        {
            "body": "Yes",
            "author": "theamazingspiderstan",
            "id": "hysly28",
            "parent_id": "t3_t3gh94",
            "score": 2,
            "created_utc": 1646065826.0,
            "replies": []
        },
        {
            "body": "Forgie for a second who zabuza was",
            "author": "Plane_Pace",
            "id": "hytqfjl",
            "parent_id": "t3_t3gh94",
            "score": 2,
            "created_utc": 1646081378.0,
            "replies": []
        },
        {
            "body": "He killed it",
            "author": "Hiruzen_solos",
            "id": "hyuds64",
            "parent_id": "t3_t3gh94",
            "score": 2,
            "created_utc": 1646090891.0,
            "replies": []
        },
        {
            "body": "Sauce?",
            "author": "badassboy1",
            "id": "hys9fr6",
            "parent_id": "t3_t3gh94",
            "score": 3,
            "created_utc": 1646060728.0,
            "replies": [
                {
                    "body": "It's a movie called d\n\"Dictator\" or \"The Dictator\"",
                    "author": "Amaro760",
                    "id": "hysatud",
                    "parent_id": "t1_hys9fr6",
                    "score": 11,
                    "created_utc": 1646061333.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Except everyone else had guns too and were told to shoot each other. Zabuza just did it more, a lot more.",
            "author": "SmallerBork",
            "id": "hyt6war",
            "parent_id": "t3_t3gh94",
            "score": 2,
            "created_utc": 1646073843.0,
            "replies": []
        },
        {
            "body": "This is how Putin started the war",
            "author": "konrad312",
            "id": "hysghl4",
            "parent_id": "t3_t3gh94",
            "score": 2,
            "created_utc": 1646063659.0,
            "replies": []
        },
        {
            "body": "Thank you for something fucking original.",
            "author": "NewBuddha32",
            "id": "hytjsnf",
            "parent_id": "t3_t3gh94",
            "score": 2,
            "created_utc": 1646078793.0,
            "replies": []
        },
        {
            "body": "You're a hero. We are grateful for your contribution. \n\n&#x200B;\n\nAlso lmao.",
            "author": "Fourth_Sin",
            "id": "hyum67w",
            "parent_id": "t3_t3gh94",
            "score": 2,
            "created_utc": 1646094798.0,
            "replies": []
        },
        {
            "body": "Nice meme lol",
            "author": "Slimxshadyx",
            "id": "hysil6t",
            "parent_id": "t3_t3gh94",
            "score": 1,
            "created_utc": 1646064495.0,
            "replies": []
        },
        {
            "body": "Ay, finally a quality meme on this sub, good work OP",
            "author": "sk0711",
            "id": "hysl7dg",
            "parent_id": "t3_t3gh94",
            "score": 1,
            "created_utc": 1646065538.0,
            "replies": []
        },
        {
            "body": "He didn't even go to the school when he murdered everyone at that school",
            "author": "SpeakerzsoLoud",
            "id": "hysmst9",
            "parent_id": "t3_t3gh94",
            "score": 1,
            "created_utc": 1646066163.0,
            "replies": []
        },
        {
            "body": "LMAOOO good one",
            "author": "kmyeurs",
            "id": "hyty6yr",
            "parent_id": "t3_t3gh94",
            "score": 1,
            "created_utc": 1646084372.0,
            "replies": []
        },
        {
            "body": "Nice bro you have my medal for new content (if I had a medal)",
            "author": "Efficient_Audience99",
            "id": "hytz11m",
            "parent_id": "t3_t3gh94",
            "score": 1,
            "created_utc": 1646084697.0,
            "replies": []
        },
        {
            "body": "“Tired of repetitive content”\nNobody:\nNot a single person:\nLike for real there’s no-one:\nActually try and find someone, you can’t:\nThere isn’t a soul in the universe:\nI’m not sure you’re understanding how few people:\n\n\nLike what does that add?",
            "author": "Icthlarion",
            "id": "hyuf98w",
            "parent_id": "t3_t3gh94",
            "score": 1,
            "created_utc": 1646091568.0,
            "replies": []
        },
        {
            "body": "op, whats the point of putting your name on the meme",
            "author": null,
            "id": "hyuxsfo",
            "parent_id": "t3_t3gh94",
            "score": 1,
            "created_utc": 1646100247.0,
            "replies": []
        },
        {
            "body": "First good meme I’ve seen on dankruto in a LOOOONG while. Thank you so much",
            "author": "ExaltedRenegade",
            "id": "hyuxyez",
            "parent_id": "t3_t3gh94",
            "score": 1,
            "created_utc": 1646100323.0,
            "replies": []
        },
        {
            "body": "Sakura is trash .",
            "author": null,
            "id": "hysq4sf",
            "parent_id": "t3_t3gh94",
            "score": 0,
            "created_utc": 1646067444.0,
            "replies": []
        },
        {
            "body": "u/savevideobot u/savevideo yes but give everyone else a gun as well and you've got yourself the blood mist exams",
            "author": "carrot-parent",
            "id": "hytde69",
            "parent_id": "t3_t3gh94",
            "score": 1,
            "created_utc": 1646076324.0,
            "replies": [
                {
                    "body": "###[View link](https://redditsave.com/info?url=/r/dankruto/comments/t3gh94/tired_of_the_repetitive_content_here_hope_to_see/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/dankruto/comments/t3gh94/tired_of_the_repetitive_content_here_hope_to_see/)",
                    "author": "savevideobot",
                    "id": "hytderv",
                    "parent_id": "t1_hytde69",
                    "score": 1,
                    "created_utc": 1646076330.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Inspired stuff lmfao",
            "author": "limarlo",
            "id": "hytirx4",
            "parent_id": "t3_t3gh94",
            "score": 1,
            "created_utc": 1646078397.0,
            "replies": []
        },
        {
            "body": "Kisame when he is with his squad",
            "author": "Turtle_Dog64",
            "id": "hyu2roy",
            "parent_id": "t3_t3gh94",
            "score": 1,
            "created_utc": 1646086182.0,
            "replies": []
        },
        {
            "body": "im new to the sub and dont know which is new or repost, but honestly, every single one of them is so funny and creative, i literally had kewk face in real life and shared to my friends",
            "author": "Lozyness",
            "id": "hyw16qt",
            "parent_id": "t3_t3gh94",
            "score": 1,
            "created_utc": 1646122821.0,
            "replies": []
        },
        {
            "body": "u/savevideo",
            "author": "Sufficient_Use_7629",
            "id": "i2g036z",
            "parent_id": "t3_t3gh94",
            "score": 1,
            "created_utc": 1648479415.0,
            "replies": []
        },
        {
            "body": "u/redditmp4bot",
            "author": "Sufficient_Use_7629",
            "id": "i2g03vb",
            "parent_id": "t3_t3gh94",
            "score": 1,
            "created_utc": 1648479423.0,
            "replies": [
                {
                    "body": "## [**Download MP4**](https://redditmp4.com/t3gh94)\n ___ \n\n^(Mention `u/RedditMP4Bot` under a post to download reddit videos and gifs from v.redd.it, i.redd.it, youtube, imgur, twitter, gfycat, gif-vif, streamable, redgifs, giphy etc.)\n^(Help keep the server running [**Donate**](https://ko-fi.com/redditmp4))",
                    "author": "RedditMP4Bot",
                    "id": "i2lu7pr",
                    "parent_id": "t1_i2g03vb",
                    "score": 1,
                    "created_utc": 1648583158.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "u/savevideobot",
            "author": "Sufficient_Use_7629",
            "id": "i2g04g1",
            "parent_id": "t3_t3gh94",
            "score": 1,
            "created_utc": 1648479430.0,
            "replies": []
        },
        {
            "body": "That’s what I remember too and I haven’t seen it read Naruto in about a decade",
            "author": "Nokia_00",
            "id": "hysbaj0",
            "parent_id": "t1_hys4ra8",
            "score": 78,
            "created_utc": 1646061530.0,
            "replies": [
                {
                    "body": "yea i also remembered a scene where Kid Zabuza was standing between corpses of dead bodies",
                    "author": null,
                    "id": "hyscqr9",
                    "parent_id": "t1_hysbaj0",
                    "score": 44,
                    "created_utc": 1646062132.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Except everyone else had guns too and were told to shoot each other instead of race",
            "author": "SmallerBork",
            "id": "hyt6r58",
            "parent_id": "t1_hys4ra8",
            "score": 13,
            "created_utc": 1646073788.0,
            "replies": []
        },
        {
            "body": "This meme would be better without the \"No one\" and \"Literally no one\"\n\n\nIt's unnecessary",
            "author": "OuchYouPokedMyHeart",
            "id": "hyscfbe",
            "parent_id": "t1_hys4ra8",
            "score": 66,
            "created_utc": 1646062000.0,
            "replies": [
                {
                    "body": ">Literally no one\n\nidk why people put that and worse, they'll add \"not even a single a soul\"",
                    "author": "yuuri_ni_victor",
                    "id": "hyueaa3",
                    "parent_id": "t1_hyscfbe",
                    "score": 13,
                    "created_utc": 1646091122.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The competition was to kill competitors. He wasn’t a trained killer enrolled with the school at the time. He was just so good at it that he was above everyone else who had classical training.  If you take the information given to us about the timeline of events in the mist, Zabuza is only a few years older than naruto.",
            "author": "HeraldofblueRP",
            "id": "hysfnl2",
            "parent_id": "t1_hys4ra8",
            "score": 15,
            "created_utc": 1646063328.0,
            "replies": [
                {
                    "body": "Zabuza is 26 in Part 1",
                    "author": "Chalaka",
                    "id": "hysz5b2",
                    "parent_id": "t1_hysfnl2",
                    "score": 19,
                    "created_utc": 1646070885.0,
                    "replies": [
                        {
                            "body": "According to the datebooks, He was 9 when he graduated the academy. 11 years after that he met naruto. So he was 20, at least in the time line the story lays out. The data books does go on to say he is 26.",
                            "author": "HeraldofblueRP",
                            "id": "hyunznd",
                            "parent_id": "t1_hysz5b2",
                            "score": 5,
                            "created_utc": 1646095663.0,
                            "replies": [
                                {
                                    "body": "I'd have to watch Zabuza explaining his past again (I can't at the moment) but something or someone isn't right.",
                                    "author": "Chalaka",
                                    "id": "hyurp3o",
                                    "parent_id": "t1_hyunznd",
                                    "score": 4,
                                    "created_utc": 1646097416.0,
                                    "replies": [
                                        {
                                            "body": "These minor mistakes are pretty common in naruto. It’s no big deal.",
                                            "author": "HeraldofblueRP",
                                            "id": "hyvlex9",
                                            "parent_id": "t1_hyurp3o",
                                            "score": 5,
                                            "created_utc": 1646111918.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He was forced to kill his friends and classmates they all were.",
            "author": "Kotsugawa",
            "id": "hyv2ggj",
            "parent_id": "t1_hys4ra8",
            "score": 4,
            "created_utc": 1646102405.0,
            "replies": []
        },
        {
            "body": "You're right that Zabuza's early defeat hurts the audience perception of his strength. He beat Kakashi, but it was the weakest version of Kakashi we ever got to see. Kakashi got so much stronger as the series progressed, even without training, that the idea of Zabuza as a challenge for Kakashi stopped being reasonable pretty quickly in Shippuden. \n\nIt doesn't help that we later learn Kakashi had a mangekyo sharingan available the whole time. Kamui would have ended the fight with Zabuza immediately, especially as Zabuza was a sitting duck while using the water prison jutsu. Once the existence of kamui is revealed to the audience, the story becomes \"Kakashi could have ended the fight at any time, but he wasn't sure it was worth heavy exhaustion and a slight degredation to his sharingan's eyesight.\"\n\nAlso the later introduction of the rest of the 7 Swords of the Mist didn't help Zabuza much. Of the seven, the Executioner Blade is the least impressive (still looks cool though) for combat. And its gimmick, using iron in blood to repair itself, means it's one of the very few swords we see repeatedly broken in Naruto. Based on how often the blade breaks, it comes across like the Executioner Blade is unusually fragile and therefore needs that repair feature.",
            "author": "Justicar-terrae",
            "id": "hysmhxd",
            "parent_id": "t1_hyseq63",
            "score": 43,
            "created_utc": 1646066046.0,
            "replies": [
                {
                    "body": "I agree with most of your comment. It is reasonable to assume that Zabuza would also grow in strength as the series progresses. Probably not to the extent that Kakashi does as he becomes Uber powerful. But, possibly with help from Haku they can be on par with an Akatsuki duo. His sword is pretty lame too. It would be cool if the sword also increases in size/strength when it steals iron from enemies' blood. \n\nIn short, Zabuza is a cool character and I wish he got some more screentime. Seeing him resurrected was a mistake as I feel his story was resolved on the bridge when he died.",
                    "author": "tpklus",
                    "id": "hysoukf",
                    "parent_id": "t1_hysmhxd",
                    "score": 15,
                    "created_utc": 1646066952.0,
                    "replies": [
                        {
                            "body": "Nah bringing him back was sick. Seeing him and haku still feel indepted to kakashi and showing how much kakakshi has grown even as a jonin during the entire anime/manga. \n\nGotta remember, in og Naruto, kakashi was basically retired from being a ninja. Kakashi wasn't barely his anbu level during that first fight. Now we seem him further ahead than he was when he was anbu.",
                            "author": "codeklutch",
                            "id": "hytyp1b",
                            "parent_id": "t1_hysoukf",
                            "score": 8,
                            "created_utc": 1646084568.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">\"Kakashi could have ended the fight at any time, but he wasn't sure it was worth heavy exhaustion and a slight degredation to his sharingan's eyesight.\"\n\nWell not really. Even though Kakashi gets Mangekyou Sharingan when he's younger, he passes out, and has no idea he has it until much later. We probably won't see how he finds out about it any time soon, he most probably read the Uchiha tablet to see if he can improve his Sharingan.",
                    "author": "Chalaka",
                    "id": "hyszxzu",
                    "parent_id": "t1_hysmhxd",
                    "score": 6,
                    "created_utc": 1646071183.0,
                    "replies": [
                        {
                            "body": "Imagine Kakashi reading the tablet:\nTo awaken the Mangekyou sharingan, a forbidden technique granting unimaginable power, you must perform the unthinkable. You must see your most precious comrade die to your hands.\n\n\"Hey, I already did that! Twice!\"",
                            "author": "RedShankyMan",
                            "id": "hyt2ax5",
                            "parent_id": "t1_hyszxzu",
                            "score": 17,
                            "created_utc": 1646072092.0,
                            "replies": [
                                {
                                    "body": "💎💎 Achievement unlocked: Mangekyo Sharingan 💎💎",
                                    "author": "MadEyeJoker",
                                    "id": "hyuzk1m",
                                    "parent_id": "t1_hyt2ax5",
                                    "score": 7,
                                    "created_utc": 1646101054.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Zabuza lost to someone who was a perfect Counter to him. Kakashi’s dogs made his Mist useless, his sharingan helped him combat against the executioner blade, and Kakashi knew enough jutsu to counter anything Zabuza could use. :(",
            "author": "enoughfuckery",
            "id": "hysgq5a",
            "parent_id": "t1_hyseq63",
            "score": 70,
            "created_utc": 1646063753.0,
            "replies": [
                {
                    "body": "True, and Zabuza still fought well!",
                    "author": "Slimxshadyx",
                    "id": "hysipaf",
                    "parent_id": "t1_hysgq5a",
                    "score": 32,
                    "created_utc": 1646064542.0,
                    "replies": [
                        {
                            "body": "Yes he did. And while he’s not Akatsuki level, he’s still high jonin, and would slaughter a lot of characters.",
                            "author": "enoughfuckery",
                            "id": "hyslsxk",
                            "parent_id": "t1_hysipaf",
                            "score": 33,
                            "created_utc": 1646065770.0,
                            "replies": [
                                {
                                    "body": "He is akatsuki level though. He no diffs Hidan and is better than that juzo fella",
                                    "author": "glogangintern",
                                    "id": "hysnd8b",
                                    "parent_id": "t1_hyslsxk",
                                    "score": 15,
                                    "created_utc": 1646066382.0,
                                    "replies": [
                                        {
                                            "body": "Idk who Juzo is I never watched the filler in later Shippuden. And him being Hidan level isn’t exactly saying much, if Hidan wasn’t immortal he wouldn’t have been anyone special, the second worst member of the Akatsuki (whoever you consider that to be) still beats Zabuza. Which isn’t to demean him, but the Akatsuki really are that strong",
                                            "author": "enoughfuckery",
                                            "id": "hysnv73",
                                            "parent_id": "t1_hysnd8b",
                                            "score": 21,
                                            "created_utc": 1646066574.0,
                                            "replies": [
                                                {
                                                    "body": "Pretty sure Juzo was the owner of the executioners blade before zabuza and itachis original partner in the akatsuki. He talks about might Dai (guy's genin father) who used the 8 gates to kill 4 of the 7 swordsman of the hidden mist at once.",
                                                    "author": "NewBuddha32",
                                                    "id": "hytkdwa",
                                                    "parent_id": "t1_hysnv73",
                                                    "score": 12,
                                                    "created_utc": 1646079027.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'm still mad we didn't get to see that fight",
                                                            "author": "Musulmaniaco",
                                                            "id": "hyuedyq",
                                                            "parent_id": "t1_hytkdwa",
                                                            "score": 4,
                                                            "created_utc": 1646091169.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Me too. How did the other 3 get away? Did they manage to kill him or did he die from the 8th gate? It's such a badass moment for that character and he deserved to be seen whooping ass one time.",
                                                                    "author": "NewBuddha32",
                                                                    "id": "hyuhqbd",
                                                                    "parent_id": "t1_hyuedyq",
                                                                    "score": 3,
                                                                    "created_utc": 1646092708.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Yep but he is stronger and more useful than Hidan so he literally is Akatsuki level. His Giant chakra reserves and Hiddenn Mist Jutsu would frustrate the life out of Jinchuuriki and would have been a good in random with another member. Haku also fits the bill and had potential to be stronger than Sasori.",
                                                    "author": "glogangintern",
                                                    "id": "hytj98m",
                                                    "parent_id": "t1_hysnv73",
                                                    "score": 8,
                                                    "created_utc": 1646078582.0,
                                                    "replies": [
                                                        {
                                                            "body": "Haku definitely had potential. He wouldn't be able to beat any akatsuki at his level then, but give him a few years and he def could beat Sasori",
                                                            "author": "Slimxshadyx",
                                                            "id": "hyugkky",
                                                            "parent_id": "t1_hytj98m",
                                                            "score": 2,
                                                            "created_utc": 1646092170.0,
                                                            "replies": [
                                                                {
                                                                    "body": "What could Hidan do to Haku? I’m sure haku could decapitate Hidan by using crystal ice mirrors",
                                                                    "author": "glogangintern",
                                                                    "id": "hyvyyit",
                                                                    "parent_id": "t1_hyugkky",
                                                                    "score": 1,
                                                                    "created_utc": 1646121061.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I'm not sure how Hidan could attack Haku, but you have to remember Hidan has pretty good fighting skills, so I don't think it's so simple for Haku to just decapitate him.\n\nHe fought Kakashi blade on blade without struggle, and the only times he got caught was Shikamaru needing to do some 300 IQ moves. He even dodged a Chakra blade in mid air from his quick thinking.\n\nIn terms of raw power, Hidan is pretty low on the Akatsuki scale, but he makes up for it in his defenses, speed, and reaction times.",
                                                                            "author": "Slimxshadyx",
                                                                            "id": "hyz1w66",
                                                                            "parent_id": "t1_hyvyyit",
                                                                            "score": 1,
                                                                            "created_utc": 1646174832.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "He is the slowest and weakest out of the akatsuki. Completely fell for a substitution jutsu and couldn’t keep up with a Kakashi being chased by 3 of Kakuzu’s heart monsters. He’s shit. Haku would disable him and bury him. He also needs time to form his ritual and Haku blitzes him.",
                                                                                    "author": "glogangintern",
                                                                                    "id": "hz119vc",
                                                                                    "parent_id": "t1_hyz1w66",
                                                                                    "score": 1,
                                                                                    "created_utc": 1646211506.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Naruto and Sasuke kind of got in way of Kakashi in their first fight, that forced Kakashi to protected them and get caught by Zabuza. So their help evens out the handicape that they gave for kakashi.",
            "author": "DrunkSaruman",
            "id": "hyuacva",
            "parent_id": "t1_hyseq63",
            "score": 3,
            "created_utc": 1646089359.0,
            "replies": []
        },
        {
            "body": "I felt he lost on purpose to spur on Naruto and sas-gay. Specifically Sas-gay who wanted to end his own life at the sheer talent of 2 Jonin going head to head. some avenger",
            "author": "Buffalonightmare",
            "id": "hyvak90",
            "parent_id": "t1_hyseq63",
            "score": 2,
            "created_utc": 1646106237.0,
            "replies": []
        },
        {
            "body": ">Oh hey look a new meme, I'm gonna shit myself and die.\n\nr/dankruto users, probably",
            "author": "SonicBlur254",
            "id": "hysas1q",
            "parent_id": "t1_hys91e6",
            "score": 32,
            "created_utc": 1646061311.0,
            "replies": []
        },
        {
            "body": "Those are the best memes though :(",
            "author": "MDJ_STRIKER",
            "id": "hyt4xpg",
            "parent_id": "t1_hys91e6",
            "score": 8,
            "created_utc": 1646073092.0,
            "replies": [
                {
                    "body": "Those are the only memes in top here",
                    "author": "sanid_sriva",
                    "id": "hytud87",
                    "parent_id": "t1_hyt4xpg",
                    "score": 4,
                    "created_utc": 1646082893.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sakura bad, ramen guy good",
            "author": "deekascab",
            "id": "hytdgss",
            "parent_id": "t1_hys91e6",
            "score": 3,
            "created_utc": 1646076352.0,
            "replies": []
        },
        {
            "body": "I had a heart attack because of the shitty \"nO oNe: aBsoLuTeLy nO oNe: \" garbage",
            "author": "Electro226",
            "id": "hytcokz",
            "parent_id": "t1_hys91e6",
            "score": 5,
            "created_utc": 1646076053.0,
            "replies": []
        },
        {
            "body": "Cant wait for this shit meme format to die off",
            "author": "YARPakaLEX",
            "id": "hytd5fo",
            "parent_id": "t1_hyspvg0",
            "score": 7,
            "created_utc": 1646076231.0,
            "replies": [
                {
                    "body": "Been going for years unfortunately so probably never will",
                    "author": "island_donn_",
                    "id": "hyuosov",
                    "parent_id": "t1_hytd5fo",
                    "score": 3,
                    "created_utc": 1646096042.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "By far my favorite Sacha Baron Cohen movie. You are HIV Aladeen!",
            "author": null,
            "id": "hytbufh",
            "parent_id": "t1_hysvgsh",
            "score": 3,
            "created_utc": 1646075731.0,
            "replies": [
                {
                    "body": "\"It needs to be pointy\"",
                    "author": "Barnard87",
                    "id": "hytnzms",
                    "parent_id": "t1_hytbufh",
                    "score": 3,
                    "created_utc": 1646080429.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "u/savevideobot",
            "author": "kedychan",
            "id": "hysb9d2",
            "parent_id": "t1_hys9rvb",
            "score": 3,
            "created_utc": 1646061516.0,
            "replies": []
        },
        {
            "body": "It's a movie called d\n\"Dictator\" or \"The Dictator\"",
            "author": "Amaro760",
            "id": "hysatud",
            "parent_id": "t1_hys9fr6",
            "score": 11,
            "created_utc": 1646061333.0,
            "replies": []
        },
        {
            "body": "###[View link](https://redditsave.com/info?url=/r/dankruto/comments/t3gh94/tired_of_the_repetitive_content_here_hope_to_see/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/dankruto/comments/t3gh94/tired_of_the_repetitive_content_here_hope_to_see/)",
            "author": "savevideobot",
            "id": "hytderv",
            "parent_id": "t1_hytde69",
            "score": 1,
            "created_utc": 1646076330.0,
            "replies": []
        },
        {
            "body": "## [**Download MP4**](https://redditmp4.com/t3gh94)\n ___ \n\n^(Mention `u/RedditMP4Bot` under a post to download reddit videos and gifs from v.redd.it, i.redd.it, youtube, imgur, twitter, gfycat, gif-vif, streamable, redgifs, giphy etc.)\n^(Help keep the server running [**Donate**](https://ko-fi.com/redditmp4))",
            "author": "RedditMP4Bot",
            "id": "i2lu7pr",
            "parent_id": "t1_i2g03vb",
            "score": 1,
            "created_utc": 1648583158.0,
            "replies": []
        },
        {
            "body": "yea i also remembered a scene where Kid Zabuza was standing between corpses of dead bodies",
            "author": null,
            "id": "hyscqr9",
            "parent_id": "t1_hysbaj0",
            "score": 44,
            "created_utc": 1646062132.0,
            "replies": []
        },
        {
            "body": ">Literally no one\n\nidk why people put that and worse, they'll add \"not even a single a soul\"",
            "author": "yuuri_ni_victor",
            "id": "hyueaa3",
            "parent_id": "t1_hyscfbe",
            "score": 13,
            "created_utc": 1646091122.0,
            "replies": []
        },
        {
            "body": "Zabuza is 26 in Part 1",
            "author": "Chalaka",
            "id": "hysz5b2",
            "parent_id": "t1_hysfnl2",
            "score": 19,
            "created_utc": 1646070885.0,
            "replies": [
                {
                    "body": "According to the datebooks, He was 9 when he graduated the academy. 11 years after that he met naruto. So he was 20, at least in the time line the story lays out. The data books does go on to say he is 26.",
                    "author": "HeraldofblueRP",
                    "id": "hyunznd",
                    "parent_id": "t1_hysz5b2",
                    "score": 5,
                    "created_utc": 1646095663.0,
                    "replies": [
                        {
                            "body": "I'd have to watch Zabuza explaining his past again (I can't at the moment) but something or someone isn't right.",
                            "author": "Chalaka",
                            "id": "hyurp3o",
                            "parent_id": "t1_hyunznd",
                            "score": 4,
                            "created_utc": 1646097416.0,
                            "replies": [
                                {
                                    "body": "These minor mistakes are pretty common in naruto. It’s no big deal.",
                                    "author": "HeraldofblueRP",
                                    "id": "hyvlex9",
                                    "parent_id": "t1_hyurp3o",
                                    "score": 5,
                                    "created_utc": 1646111918.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree with most of your comment. It is reasonable to assume that Zabuza would also grow in strength as the series progresses. Probably not to the extent that Kakashi does as he becomes Uber powerful. But, possibly with help from Haku they can be on par with an Akatsuki duo. His sword is pretty lame too. It would be cool if the sword also increases in size/strength when it steals iron from enemies' blood. \n\nIn short, Zabuza is a cool character and I wish he got some more screentime. Seeing him resurrected was a mistake as I feel his story was resolved on the bridge when he died.",
            "author": "tpklus",
            "id": "hysoukf",
            "parent_id": "t1_hysmhxd",
            "score": 15,
            "created_utc": 1646066952.0,
            "replies": [
                {
                    "body": "Nah bringing him back was sick. Seeing him and haku still feel indepted to kakashi and showing how much kakakshi has grown even as a jonin during the entire anime/manga. \n\nGotta remember, in og Naruto, kakashi was basically retired from being a ninja. Kakashi wasn't barely his anbu level during that first fight. Now we seem him further ahead than he was when he was anbu.",
                    "author": "codeklutch",
                    "id": "hytyp1b",
                    "parent_id": "t1_hysoukf",
                    "score": 8,
                    "created_utc": 1646084568.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">\"Kakashi could have ended the fight at any time, but he wasn't sure it was worth heavy exhaustion and a slight degredation to his sharingan's eyesight.\"\n\nWell not really. Even though Kakashi gets Mangekyou Sharingan when he's younger, he passes out, and has no idea he has it until much later. We probably won't see how he finds out about it any time soon, he most probably read the Uchiha tablet to see if he can improve his Sharingan.",
            "author": "Chalaka",
            "id": "hyszxzu",
            "parent_id": "t1_hysmhxd",
            "score": 6,
            "created_utc": 1646071183.0,
            "replies": [
                {
                    "body": "Imagine Kakashi reading the tablet:\nTo awaken the Mangekyou sharingan, a forbidden technique granting unimaginable power, you must perform the unthinkable. You must see your most precious comrade die to your hands.\n\n\"Hey, I already did that! Twice!\"",
                    "author": "RedShankyMan",
                    "id": "hyt2ax5",
                    "parent_id": "t1_hyszxzu",
                    "score": 17,
                    "created_utc": 1646072092.0,
                    "replies": [
                        {
                            "body": "💎💎 Achievement unlocked: Mangekyo Sharingan 💎💎",
                            "author": "MadEyeJoker",
                            "id": "hyuzk1m",
                            "parent_id": "t1_hyt2ax5",
                            "score": 7,
                            "created_utc": 1646101054.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "True, and Zabuza still fought well!",
            "author": "Slimxshadyx",
            "id": "hysipaf",
            "parent_id": "t1_hysgq5a",
            "score": 32,
            "created_utc": 1646064542.0,
            "replies": [
                {
                    "body": "Yes he did. And while he’s not Akatsuki level, he’s still high jonin, and would slaughter a lot of characters.",
                    "author": "enoughfuckery",
                    "id": "hyslsxk",
                    "parent_id": "t1_hysipaf",
                    "score": 33,
                    "created_utc": 1646065770.0,
                    "replies": [
                        {
                            "body": "He is akatsuki level though. He no diffs Hidan and is better than that juzo fella",
                            "author": "glogangintern",
                            "id": "hysnd8b",
                            "parent_id": "t1_hyslsxk",
                            "score": 15,
                            "created_utc": 1646066382.0,
                            "replies": [
                                {
                                    "body": "Idk who Juzo is I never watched the filler in later Shippuden. And him being Hidan level isn’t exactly saying much, if Hidan wasn’t immortal he wouldn’t have been anyone special, the second worst member of the Akatsuki (whoever you consider that to be) still beats Zabuza. Which isn’t to demean him, but the Akatsuki really are that strong",
                                    "author": "enoughfuckery",
                                    "id": "hysnv73",
                                    "parent_id": "t1_hysnd8b",
                                    "score": 21,
                                    "created_utc": 1646066574.0,
                                    "replies": [
                                        {
                                            "body": "Pretty sure Juzo was the owner of the executioners blade before zabuza and itachis original partner in the akatsuki. He talks about might Dai (guy's genin father) who used the 8 gates to kill 4 of the 7 swordsman of the hidden mist at once.",
                                            "author": "NewBuddha32",
                                            "id": "hytkdwa",
                                            "parent_id": "t1_hysnv73",
                                            "score": 12,
                                            "created_utc": 1646079027.0,
                                            "replies": [
                                                {
                                                    "body": "I'm still mad we didn't get to see that fight",
                                                    "author": "Musulmaniaco",
                                                    "id": "hyuedyq",
                                                    "parent_id": "t1_hytkdwa",
                                                    "score": 4,
                                                    "created_utc": 1646091169.0,
                                                    "replies": [
                                                        {
                                                            "body": "Me too. How did the other 3 get away? Did they manage to kill him or did he die from the 8th gate? It's such a badass moment for that character and he deserved to be seen whooping ass one time.",
                                                            "author": "NewBuddha32",
                                                            "id": "hyuhqbd",
                                                            "parent_id": "t1_hyuedyq",
                                                            "score": 3,
                                                            "created_utc": 1646092708.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Yep but he is stronger and more useful than Hidan so he literally is Akatsuki level. His Giant chakra reserves and Hiddenn Mist Jutsu would frustrate the life out of Jinchuuriki and would have been a good in random with another member. Haku also fits the bill and had potential to be stronger than Sasori.",
                                            "author": "glogangintern",
                                            "id": "hytj98m",
                                            "parent_id": "t1_hysnv73",
                                            "score": 8,
                                            "created_utc": 1646078582.0,
                                            "replies": [
                                                {
                                                    "body": "Haku definitely had potential. He wouldn't be able to beat any akatsuki at his level then, but give him a few years and he def could beat Sasori",
                                                    "author": "Slimxshadyx",
                                                    "id": "hyugkky",
                                                    "parent_id": "t1_hytj98m",
                                                    "score": 2,
                                                    "created_utc": 1646092170.0,
                                                    "replies": [
                                                        {
                                                            "body": "What could Hidan do to Haku? I’m sure haku could decapitate Hidan by using crystal ice mirrors",
                                                            "author": "glogangintern",
                                                            "id": "hyvyyit",
                                                            "parent_id": "t1_hyugkky",
                                                            "score": 1,
                                                            "created_utc": 1646121061.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I'm not sure how Hidan could attack Haku, but you have to remember Hidan has pretty good fighting skills, so I don't think it's so simple for Haku to just decapitate him.\n\nHe fought Kakashi blade on blade without struggle, and the only times he got caught was Shikamaru needing to do some 300 IQ moves. He even dodged a Chakra blade in mid air from his quick thinking.\n\nIn terms of raw power, Hidan is pretty low on the Akatsuki scale, but he makes up for it in his defenses, speed, and reaction times.",
                                                                    "author": "Slimxshadyx",
                                                                    "id": "hyz1w66",
                                                                    "parent_id": "t1_hyvyyit",
                                                                    "score": 1,
                                                                    "created_utc": 1646174832.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "He is the slowest and weakest out of the akatsuki. Completely fell for a substitution jutsu and couldn’t keep up with a Kakashi being chased by 3 of Kakuzu’s heart monsters. He’s shit. Haku would disable him and bury him. He also needs time to form his ritual and Haku blitzes him.",
                                                                            "author": "glogangintern",
                                                                            "id": "hz119vc",
                                                                            "parent_id": "t1_hyz1w66",
                                                                            "score": 1,
                                                                            "created_utc": 1646211506.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Those are the only memes in top here",
            "author": "sanid_sriva",
            "id": "hytud87",
            "parent_id": "t1_hyt4xpg",
            "score": 4,
            "created_utc": 1646082893.0,
            "replies": []
        },
        {
            "body": "Been going for years unfortunately so probably never will",
            "author": "island_donn_",
            "id": "hyuosov",
            "parent_id": "t1_hytd5fo",
            "score": 3,
            "created_utc": 1646096042.0,
            "replies": []
        },
        {
            "body": "\"It needs to be pointy\"",
            "author": "Barnard87",
            "id": "hytnzms",
            "parent_id": "t1_hytbufh",
            "score": 3,
            "created_utc": 1646080429.0,
            "replies": []
        },
        {
            "body": "According to the datebooks, He was 9 when he graduated the academy. 11 years after that he met naruto. So he was 20, at least in the time line the story lays out. The data books does go on to say he is 26.",
            "author": "HeraldofblueRP",
            "id": "hyunznd",
            "parent_id": "t1_hysz5b2",
            "score": 5,
            "created_utc": 1646095663.0,
            "replies": [
                {
                    "body": "I'd have to watch Zabuza explaining his past again (I can't at the moment) but something or someone isn't right.",
                    "author": "Chalaka",
                    "id": "hyurp3o",
                    "parent_id": "t1_hyunznd",
                    "score": 4,
                    "created_utc": 1646097416.0,
                    "replies": [
                        {
                            "body": "These minor mistakes are pretty common in naruto. It’s no big deal.",
                            "author": "HeraldofblueRP",
                            "id": "hyvlex9",
                            "parent_id": "t1_hyurp3o",
                            "score": 5,
                            "created_utc": 1646111918.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nah bringing him back was sick. Seeing him and haku still feel indepted to kakashi and showing how much kakakshi has grown even as a jonin during the entire anime/manga. \n\nGotta remember, in og Naruto, kakashi was basically retired from being a ninja. Kakashi wasn't barely his anbu level during that first fight. Now we seem him further ahead than he was when he was anbu.",
            "author": "codeklutch",
            "id": "hytyp1b",
            "parent_id": "t1_hysoukf",
            "score": 8,
            "created_utc": 1646084568.0,
            "replies": []
        },
        {
            "body": "Imagine Kakashi reading the tablet:\nTo awaken the Mangekyou sharingan, a forbidden technique granting unimaginable power, you must perform the unthinkable. You must see your most precious comrade die to your hands.\n\n\"Hey, I already did that! Twice!\"",
            "author": "RedShankyMan",
            "id": "hyt2ax5",
            "parent_id": "t1_hyszxzu",
            "score": 17,
            "created_utc": 1646072092.0,
            "replies": [
                {
                    "body": "💎💎 Achievement unlocked: Mangekyo Sharingan 💎💎",
                    "author": "MadEyeJoker",
                    "id": "hyuzk1m",
                    "parent_id": "t1_hyt2ax5",
                    "score": 7,
                    "created_utc": 1646101054.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes he did. And while he’s not Akatsuki level, he’s still high jonin, and would slaughter a lot of characters.",
            "author": "enoughfuckery",
            "id": "hyslsxk",
            "parent_id": "t1_hysipaf",
            "score": 33,
            "created_utc": 1646065770.0,
            "replies": [
                {
                    "body": "He is akatsuki level though. He no diffs Hidan and is better than that juzo fella",
                    "author": "glogangintern",
                    "id": "hysnd8b",
                    "parent_id": "t1_hyslsxk",
                    "score": 15,
                    "created_utc": 1646066382.0,
                    "replies": [
                        {
                            "body": "Idk who Juzo is I never watched the filler in later Shippuden. And him being Hidan level isn’t exactly saying much, if Hidan wasn’t immortal he wouldn’t have been anyone special, the second worst member of the Akatsuki (whoever you consider that to be) still beats Zabuza. Which isn’t to demean him, but the Akatsuki really are that strong",
                            "author": "enoughfuckery",
                            "id": "hysnv73",
                            "parent_id": "t1_hysnd8b",
                            "score": 21,
                            "created_utc": 1646066574.0,
                            "replies": [
                                {
                                    "body": "Pretty sure Juzo was the owner of the executioners blade before zabuza and itachis original partner in the akatsuki. He talks about might Dai (guy's genin father) who used the 8 gates to kill 4 of the 7 swordsman of the hidden mist at once.",
                                    "author": "NewBuddha32",
                                    "id": "hytkdwa",
                                    "parent_id": "t1_hysnv73",
                                    "score": 12,
                                    "created_utc": 1646079027.0,
                                    "replies": [
                                        {
                                            "body": "I'm still mad we didn't get to see that fight",
                                            "author": "Musulmaniaco",
                                            "id": "hyuedyq",
                                            "parent_id": "t1_hytkdwa",
                                            "score": 4,
                                            "created_utc": 1646091169.0,
                                            "replies": [
                                                {
                                                    "body": "Me too. How did the other 3 get away? Did they manage to kill him or did he die from the 8th gate? It's such a badass moment for that character and he deserved to be seen whooping ass one time.",
                                                    "author": "NewBuddha32",
                                                    "id": "hyuhqbd",
                                                    "parent_id": "t1_hyuedyq",
                                                    "score": 3,
                                                    "created_utc": 1646092708.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Yep but he is stronger and more useful than Hidan so he literally is Akatsuki level. His Giant chakra reserves and Hiddenn Mist Jutsu would frustrate the life out of Jinchuuriki and would have been a good in random with another member. Haku also fits the bill and had potential to be stronger than Sasori.",
                                    "author": "glogangintern",
                                    "id": "hytj98m",
                                    "parent_id": "t1_hysnv73",
                                    "score": 8,
                                    "created_utc": 1646078582.0,
                                    "replies": [
                                        {
                                            "body": "Haku definitely had potential. He wouldn't be able to beat any akatsuki at his level then, but give him a few years and he def could beat Sasori",
                                            "author": "Slimxshadyx",
                                            "id": "hyugkky",
                                            "parent_id": "t1_hytj98m",
                                            "score": 2,
                                            "created_utc": 1646092170.0,
                                            "replies": [
                                                {
                                                    "body": "What could Hidan do to Haku? I’m sure haku could decapitate Hidan by using crystal ice mirrors",
                                                    "author": "glogangintern",
                                                    "id": "hyvyyit",
                                                    "parent_id": "t1_hyugkky",
                                                    "score": 1,
                                                    "created_utc": 1646121061.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'm not sure how Hidan could attack Haku, but you have to remember Hidan has pretty good fighting skills, so I don't think it's so simple for Haku to just decapitate him.\n\nHe fought Kakashi blade on blade without struggle, and the only times he got caught was Shikamaru needing to do some 300 IQ moves. He even dodged a Chakra blade in mid air from his quick thinking.\n\nIn terms of raw power, Hidan is pretty low on the Akatsuki scale, but he makes up for it in his defenses, speed, and reaction times.",
                                                            "author": "Slimxshadyx",
                                                            "id": "hyz1w66",
                                                            "parent_id": "t1_hyvyyit",
                                                            "score": 1,
                                                            "created_utc": 1646174832.0,
                                                            "replies": [
                                                                {
                                                                    "body": "He is the slowest and weakest out of the akatsuki. Completely fell for a substitution jutsu and couldn’t keep up with a Kakashi being chased by 3 of Kakuzu’s heart monsters. He’s shit. Haku would disable him and bury him. He also needs time to form his ritual and Haku blitzes him.",
                                                                    "author": "glogangintern",
                                                                    "id": "hz119vc",
                                                                    "parent_id": "t1_hyz1w66",
                                                                    "score": 1,
                                                                    "created_utc": 1646211506.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'd have to watch Zabuza explaining his past again (I can't at the moment) but something or someone isn't right.",
            "author": "Chalaka",
            "id": "hyurp3o",
            "parent_id": "t1_hyunznd",
            "score": 4,
            "created_utc": 1646097416.0,
            "replies": [
                {
                    "body": "These minor mistakes are pretty common in naruto. It’s no big deal.",
                    "author": "HeraldofblueRP",
                    "id": "hyvlex9",
                    "parent_id": "t1_hyurp3o",
                    "score": 5,
                    "created_utc": 1646111918.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "💎💎 Achievement unlocked: Mangekyo Sharingan 💎💎",
            "author": "MadEyeJoker",
            "id": "hyuzk1m",
            "parent_id": "t1_hyt2ax5",
            "score": 7,
            "created_utc": 1646101054.0,
            "replies": []
        },
        {
            "body": "He is akatsuki level though. He no diffs Hidan and is better than that juzo fella",
            "author": "glogangintern",
            "id": "hysnd8b",
            "parent_id": "t1_hyslsxk",
            "score": 15,
            "created_utc": 1646066382.0,
            "replies": [
                {
                    "body": "Idk who Juzo is I never watched the filler in later Shippuden. And him being Hidan level isn’t exactly saying much, if Hidan wasn’t immortal he wouldn’t have been anyone special, the second worst member of the Akatsuki (whoever you consider that to be) still beats Zabuza. Which isn’t to demean him, but the Akatsuki really are that strong",
                    "author": "enoughfuckery",
                    "id": "hysnv73",
                    "parent_id": "t1_hysnd8b",
                    "score": 21,
                    "created_utc": 1646066574.0,
                    "replies": [
                        {
                            "body": "Pretty sure Juzo was the owner of the executioners blade before zabuza and itachis original partner in the akatsuki. He talks about might Dai (guy's genin father) who used the 8 gates to kill 4 of the 7 swordsman of the hidden mist at once.",
                            "author": "NewBuddha32",
                            "id": "hytkdwa",
                            "parent_id": "t1_hysnv73",
                            "score": 12,
                            "created_utc": 1646079027.0,
                            "replies": [
                                {
                                    "body": "I'm still mad we didn't get to see that fight",
                                    "author": "Musulmaniaco",
                                    "id": "hyuedyq",
                                    "parent_id": "t1_hytkdwa",
                                    "score": 4,
                                    "created_utc": 1646091169.0,
                                    "replies": [
                                        {
                                            "body": "Me too. How did the other 3 get away? Did they manage to kill him or did he die from the 8th gate? It's such a badass moment for that character and he deserved to be seen whooping ass one time.",
                                            "author": "NewBuddha32",
                                            "id": "hyuhqbd",
                                            "parent_id": "t1_hyuedyq",
                                            "score": 3,
                                            "created_utc": 1646092708.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yep but he is stronger and more useful than Hidan so he literally is Akatsuki level. His Giant chakra reserves and Hiddenn Mist Jutsu would frustrate the life out of Jinchuuriki and would have been a good in random with another member. Haku also fits the bill and had potential to be stronger than Sasori.",
                            "author": "glogangintern",
                            "id": "hytj98m",
                            "parent_id": "t1_hysnv73",
                            "score": 8,
                            "created_utc": 1646078582.0,
                            "replies": [
                                {
                                    "body": "Haku definitely had potential. He wouldn't be able to beat any akatsuki at his level then, but give him a few years and he def could beat Sasori",
                                    "author": "Slimxshadyx",
                                    "id": "hyugkky",
                                    "parent_id": "t1_hytj98m",
                                    "score": 2,
                                    "created_utc": 1646092170.0,
                                    "replies": [
                                        {
                                            "body": "What could Hidan do to Haku? I’m sure haku could decapitate Hidan by using crystal ice mirrors",
                                            "author": "glogangintern",
                                            "id": "hyvyyit",
                                            "parent_id": "t1_hyugkky",
                                            "score": 1,
                                            "created_utc": 1646121061.0,
                                            "replies": [
                                                {
                                                    "body": "I'm not sure how Hidan could attack Haku, but you have to remember Hidan has pretty good fighting skills, so I don't think it's so simple for Haku to just decapitate him.\n\nHe fought Kakashi blade on blade without struggle, and the only times he got caught was Shikamaru needing to do some 300 IQ moves. He even dodged a Chakra blade in mid air from his quick thinking.\n\nIn terms of raw power, Hidan is pretty low on the Akatsuki scale, but he makes up for it in his defenses, speed, and reaction times.",
                                                    "author": "Slimxshadyx",
                                                    "id": "hyz1w66",
                                                    "parent_id": "t1_hyvyyit",
                                                    "score": 1,
                                                    "created_utc": 1646174832.0,
                                                    "replies": [
                                                        {
                                                            "body": "He is the slowest and weakest out of the akatsuki. Completely fell for a substitution jutsu and couldn’t keep up with a Kakashi being chased by 3 of Kakuzu’s heart monsters. He’s shit. Haku would disable him and bury him. He also needs time to form his ritual and Haku blitzes him.",
                                                            "author": "glogangintern",
                                                            "id": "hz119vc",
                                                            "parent_id": "t1_hyz1w66",
                                                            "score": 1,
                                                            "created_utc": 1646211506.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "These minor mistakes are pretty common in naruto. It’s no big deal.",
            "author": "HeraldofblueRP",
            "id": "hyvlex9",
            "parent_id": "t1_hyurp3o",
            "score": 5,
            "created_utc": 1646111918.0,
            "replies": []
        },
        {
            "body": "Idk who Juzo is I never watched the filler in later Shippuden. And him being Hidan level isn’t exactly saying much, if Hidan wasn’t immortal he wouldn’t have been anyone special, the second worst member of the Akatsuki (whoever you consider that to be) still beats Zabuza. Which isn’t to demean him, but the Akatsuki really are that strong",
            "author": "enoughfuckery",
            "id": "hysnv73",
            "parent_id": "t1_hysnd8b",
            "score": 21,
            "created_utc": 1646066574.0,
            "replies": [
                {
                    "body": "Pretty sure Juzo was the owner of the executioners blade before zabuza and itachis original partner in the akatsuki. He talks about might Dai (guy's genin father) who used the 8 gates to kill 4 of the 7 swordsman of the hidden mist at once.",
                    "author": "NewBuddha32",
                    "id": "hytkdwa",
                    "parent_id": "t1_hysnv73",
                    "score": 12,
                    "created_utc": 1646079027.0,
                    "replies": [
                        {
                            "body": "I'm still mad we didn't get to see that fight",
                            "author": "Musulmaniaco",
                            "id": "hyuedyq",
                            "parent_id": "t1_hytkdwa",
                            "score": 4,
                            "created_utc": 1646091169.0,
                            "replies": [
                                {
                                    "body": "Me too. How did the other 3 get away? Did they manage to kill him or did he die from the 8th gate? It's such a badass moment for that character and he deserved to be seen whooping ass one time.",
                                    "author": "NewBuddha32",
                                    "id": "hyuhqbd",
                                    "parent_id": "t1_hyuedyq",
                                    "score": 3,
                                    "created_utc": 1646092708.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yep but he is stronger and more useful than Hidan so he literally is Akatsuki level. His Giant chakra reserves and Hiddenn Mist Jutsu would frustrate the life out of Jinchuuriki and would have been a good in random with another member. Haku also fits the bill and had potential to be stronger than Sasori.",
                    "author": "glogangintern",
                    "id": "hytj98m",
                    "parent_id": "t1_hysnv73",
                    "score": 8,
                    "created_utc": 1646078582.0,
                    "replies": [
                        {
                            "body": "Haku definitely had potential. He wouldn't be able to beat any akatsuki at his level then, but give him a few years and he def could beat Sasori",
                            "author": "Slimxshadyx",
                            "id": "hyugkky",
                            "parent_id": "t1_hytj98m",
                            "score": 2,
                            "created_utc": 1646092170.0,
                            "replies": [
                                {
                                    "body": "What could Hidan do to Haku? I’m sure haku could decapitate Hidan by using crystal ice mirrors",
                                    "author": "glogangintern",
                                    "id": "hyvyyit",
                                    "parent_id": "t1_hyugkky",
                                    "score": 1,
                                    "created_utc": 1646121061.0,
                                    "replies": [
                                        {
                                            "body": "I'm not sure how Hidan could attack Haku, but you have to remember Hidan has pretty good fighting skills, so I don't think it's so simple for Haku to just decapitate him.\n\nHe fought Kakashi blade on blade without struggle, and the only times he got caught was Shikamaru needing to do some 300 IQ moves. He even dodged a Chakra blade in mid air from his quick thinking.\n\nIn terms of raw power, Hidan is pretty low on the Akatsuki scale, but he makes up for it in his defenses, speed, and reaction times.",
                                            "author": "Slimxshadyx",
                                            "id": "hyz1w66",
                                            "parent_id": "t1_hyvyyit",
                                            "score": 1,
                                            "created_utc": 1646174832.0,
                                            "replies": [
                                                {
                                                    "body": "He is the slowest and weakest out of the akatsuki. Completely fell for a substitution jutsu and couldn’t keep up with a Kakashi being chased by 3 of Kakuzu’s heart monsters. He’s shit. Haku would disable him and bury him. He also needs time to form his ritual and Haku blitzes him.",
                                                    "author": "glogangintern",
                                                    "id": "hz119vc",
                                                    "parent_id": "t1_hyz1w66",
                                                    "score": 1,
                                                    "created_utc": 1646211506.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Pretty sure Juzo was the owner of the executioners blade before zabuza and itachis original partner in the akatsuki. He talks about might Dai (guy's genin father) who used the 8 gates to kill 4 of the 7 swordsman of the hidden mist at once.",
            "author": "NewBuddha32",
            "id": "hytkdwa",
            "parent_id": "t1_hysnv73",
            "score": 12,
            "created_utc": 1646079027.0,
            "replies": [
                {
                    "body": "I'm still mad we didn't get to see that fight",
                    "author": "Musulmaniaco",
                    "id": "hyuedyq",
                    "parent_id": "t1_hytkdwa",
                    "score": 4,
                    "created_utc": 1646091169.0,
                    "replies": [
                        {
                            "body": "Me too. How did the other 3 get away? Did they manage to kill him or did he die from the 8th gate? It's such a badass moment for that character and he deserved to be seen whooping ass one time.",
                            "author": "NewBuddha32",
                            "id": "hyuhqbd",
                            "parent_id": "t1_hyuedyq",
                            "score": 3,
                            "created_utc": 1646092708.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yep but he is stronger and more useful than Hidan so he literally is Akatsuki level. His Giant chakra reserves and Hiddenn Mist Jutsu would frustrate the life out of Jinchuuriki and would have been a good in random with another member. Haku also fits the bill and had potential to be stronger than Sasori.",
            "author": "glogangintern",
            "id": "hytj98m",
            "parent_id": "t1_hysnv73",
            "score": 8,
            "created_utc": 1646078582.0,
            "replies": [
                {
                    "body": "Haku definitely had potential. He wouldn't be able to beat any akatsuki at his level then, but give him a few years and he def could beat Sasori",
                    "author": "Slimxshadyx",
                    "id": "hyugkky",
                    "parent_id": "t1_hytj98m",
                    "score": 2,
                    "created_utc": 1646092170.0,
                    "replies": [
                        {
                            "body": "What could Hidan do to Haku? I’m sure haku could decapitate Hidan by using crystal ice mirrors",
                            "author": "glogangintern",
                            "id": "hyvyyit",
                            "parent_id": "t1_hyugkky",
                            "score": 1,
                            "created_utc": 1646121061.0,
                            "replies": [
                                {
                                    "body": "I'm not sure how Hidan could attack Haku, but you have to remember Hidan has pretty good fighting skills, so I don't think it's so simple for Haku to just decapitate him.\n\nHe fought Kakashi blade on blade without struggle, and the only times he got caught was Shikamaru needing to do some 300 IQ moves. He even dodged a Chakra blade in mid air from his quick thinking.\n\nIn terms of raw power, Hidan is pretty low on the Akatsuki scale, but he makes up for it in his defenses, speed, and reaction times.",
                                    "author": "Slimxshadyx",
                                    "id": "hyz1w66",
                                    "parent_id": "t1_hyvyyit",
                                    "score": 1,
                                    "created_utc": 1646174832.0,
                                    "replies": [
                                        {
                                            "body": "He is the slowest and weakest out of the akatsuki. Completely fell for a substitution jutsu and couldn’t keep up with a Kakashi being chased by 3 of Kakuzu’s heart monsters. He’s shit. Haku would disable him and bury him. He also needs time to form his ritual and Haku blitzes him.",
                                            "author": "glogangintern",
                                            "id": "hz119vc",
                                            "parent_id": "t1_hyz1w66",
                                            "score": 1,
                                            "created_utc": 1646211506.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm still mad we didn't get to see that fight",
            "author": "Musulmaniaco",
            "id": "hyuedyq",
            "parent_id": "t1_hytkdwa",
            "score": 4,
            "created_utc": 1646091169.0,
            "replies": [
                {
                    "body": "Me too. How did the other 3 get away? Did they manage to kill him or did he die from the 8th gate? It's such a badass moment for that character and he deserved to be seen whooping ass one time.",
                    "author": "NewBuddha32",
                    "id": "hyuhqbd",
                    "parent_id": "t1_hyuedyq",
                    "score": 3,
                    "created_utc": 1646092708.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haku definitely had potential. He wouldn't be able to beat any akatsuki at his level then, but give him a few years and he def could beat Sasori",
            "author": "Slimxshadyx",
            "id": "hyugkky",
            "parent_id": "t1_hytj98m",
            "score": 2,
            "created_utc": 1646092170.0,
            "replies": [
                {
                    "body": "What could Hidan do to Haku? I’m sure haku could decapitate Hidan by using crystal ice mirrors",
                    "author": "glogangintern",
                    "id": "hyvyyit",
                    "parent_id": "t1_hyugkky",
                    "score": 1,
                    "created_utc": 1646121061.0,
                    "replies": [
                        {
                            "body": "I'm not sure how Hidan could attack Haku, but you have to remember Hidan has pretty good fighting skills, so I don't think it's so simple for Haku to just decapitate him.\n\nHe fought Kakashi blade on blade without struggle, and the only times he got caught was Shikamaru needing to do some 300 IQ moves. He even dodged a Chakra blade in mid air from his quick thinking.\n\nIn terms of raw power, Hidan is pretty low on the Akatsuki scale, but he makes up for it in his defenses, speed, and reaction times.",
                            "author": "Slimxshadyx",
                            "id": "hyz1w66",
                            "parent_id": "t1_hyvyyit",
                            "score": 1,
                            "created_utc": 1646174832.0,
                            "replies": [
                                {
                                    "body": "He is the slowest and weakest out of the akatsuki. Completely fell for a substitution jutsu and couldn’t keep up with a Kakashi being chased by 3 of Kakuzu’s heart monsters. He’s shit. Haku would disable him and bury him. He also needs time to form his ritual and Haku blitzes him.",
                                    "author": "glogangintern",
                                    "id": "hz119vc",
                                    "parent_id": "t1_hyz1w66",
                                    "score": 1,
                                    "created_utc": 1646211506.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Me too. How did the other 3 get away? Did they manage to kill him or did he die from the 8th gate? It's such a badass moment for that character and he deserved to be seen whooping ass one time.",
            "author": "NewBuddha32",
            "id": "hyuhqbd",
            "parent_id": "t1_hyuedyq",
            "score": 3,
            "created_utc": 1646092708.0,
            "replies": []
        },
        {
            "body": "What could Hidan do to Haku? I’m sure haku could decapitate Hidan by using crystal ice mirrors",
            "author": "glogangintern",
            "id": "hyvyyit",
            "parent_id": "t1_hyugkky",
            "score": 1,
            "created_utc": 1646121061.0,
            "replies": [
                {
                    "body": "I'm not sure how Hidan could attack Haku, but you have to remember Hidan has pretty good fighting skills, so I don't think it's so simple for Haku to just decapitate him.\n\nHe fought Kakashi blade on blade without struggle, and the only times he got caught was Shikamaru needing to do some 300 IQ moves. He even dodged a Chakra blade in mid air from his quick thinking.\n\nIn terms of raw power, Hidan is pretty low on the Akatsuki scale, but he makes up for it in his defenses, speed, and reaction times.",
                    "author": "Slimxshadyx",
                    "id": "hyz1w66",
                    "parent_id": "t1_hyvyyit",
                    "score": 1,
                    "created_utc": 1646174832.0,
                    "replies": [
                        {
                            "body": "He is the slowest and weakest out of the akatsuki. Completely fell for a substitution jutsu and couldn’t keep up with a Kakashi being chased by 3 of Kakuzu’s heart monsters. He’s shit. Haku would disable him and bury him. He also needs time to form his ritual and Haku blitzes him.",
                            "author": "glogangintern",
                            "id": "hz119vc",
                            "parent_id": "t1_hyz1w66",
                            "score": 1,
                            "created_utc": 1646211506.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm not sure how Hidan could attack Haku, but you have to remember Hidan has pretty good fighting skills, so I don't think it's so simple for Haku to just decapitate him.\n\nHe fought Kakashi blade on blade without struggle, and the only times he got caught was Shikamaru needing to do some 300 IQ moves. He even dodged a Chakra blade in mid air from his quick thinking.\n\nIn terms of raw power, Hidan is pretty low on the Akatsuki scale, but he makes up for it in his defenses, speed, and reaction times.",
            "author": "Slimxshadyx",
            "id": "hyz1w66",
            "parent_id": "t1_hyvyyit",
            "score": 1,
            "created_utc": 1646174832.0,
            "replies": [
                {
                    "body": "He is the slowest and weakest out of the akatsuki. Completely fell for a substitution jutsu and couldn’t keep up with a Kakashi being chased by 3 of Kakuzu’s heart monsters. He’s shit. Haku would disable him and bury him. He also needs time to form his ritual and Haku blitzes him.",
                    "author": "glogangintern",
                    "id": "hz119vc",
                    "parent_id": "t1_hyz1w66",
                    "score": 1,
                    "created_utc": 1646211506.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He is the slowest and weakest out of the akatsuki. Completely fell for a substitution jutsu and couldn’t keep up with a Kakashi being chased by 3 of Kakuzu’s heart monsters. He’s shit. Haku would disable him and bury him. He also needs time to form his ritual and Haku blitzes him.",
            "author": "glogangintern",
            "id": "hz119vc",
            "parent_id": "t1_hyz1w66",
            "score": 1,
            "created_utc": 1646211506.0,
            "replies": []
        }
    ]
}