{
    "title": "A lot of throw away comments on men’s pictures telling them they are balding or receding when they clearly aren’t. No need to instil added insecurity to a person already seeking reassurance.",
    "post_id": "g2ekxk",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/g2ekxk/a_lot_of_throw_away_comments_on_mens_pictures/",
    "author": "Clarkie2323",
    "body": "",
    "url": "https://www.reddit.com/r/malehairadvice/comments/g2ekxk/a_lot_of_throw_away_comments_on_mens_pictures/",
    "score": 360,
    "upvote_ratio": 0.95,
    "created_utc": 1587042528.0,
    "num_comments": 50,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I think honesty is ok in the context of people explicitly asking about their receding hairline.\n\nBut I have seen people responding to questions about how to style saying \"just shave it!\". A lot of these times, the person's hair isn't even that far receded. That is a really mean thing.",
            "author": "bnjman",
            "id": "fnlcvqx",
            "parent_id": "t3_g2ekxk",
            "score": 118,
            "created_utc": 1587051310.0,
            "replies": [
                {
                    "body": "Posted a thread asking about the beard, got the reply that my hair was thinning like... thanks, I know?",
                    "author": "Neknoh",
                    "id": "fnm0maj",
                    "parent_id": "t1_fnlcvqx",
                    "score": 31,
                    "created_utc": 1587063007.0,
                    "replies": []
                },
                {
                    "body": "I haven't personally done this to people that aren't asking specifically about shaving their heads, but I don't know that it's mean if somebody comes to male hair advice it's not like any advice happening is unsolicited. everyone's got a different opinion about what looks good, anything shared here is obviously just an opinion.",
                    "author": "8Ariadnesthread8",
                    "id": "fnlte79",
                    "parent_id": "t1_fnlcvqx",
                    "score": 5,
                    "created_utc": 1587059403.0,
                    "replies": []
                },
                {
                    "body": "Why's it mean? They're asking for advice, and they're receiving advice.\n\nNobody said you had to like or value the advice being given to you, and don't try to act like a victim because you don't like it.\n\nWhen you put yourself in the spotlight, you've made the decision to take criticism. Don't want criticism? Don't put yourself out there and stay in your shell.",
                    "author": "Dreviore",
                    "id": "fnldo4z",
                    "parent_id": "t1_fnlcvqx",
                    "score": -19,
                    "created_utc": 1587051719.0,
                    "replies": [
                        {
                            "body": "Generally this sub is really supportive and there are certainly ways to gently give advice, which most people on the sub don't need to be reminded about. There are two kinds of criticism, constructive and negative. A lot of people here are young and insecure and looking for advice, and they don't deserve unhelpful forms of criticism just for putting themselves out there.",
                            "author": "scottyLogJobs",
                            "id": "fnlf9ri",
                            "parent_id": "t1_fnldo4z",
                            "score": 13,
                            "created_utc": 1587052528.0,
                            "replies": [
                                {
                                    "body": "Precisely",
                                    "author": "Clarkie2323",
                                    "id": "fnlofpi",
                                    "parent_id": "t1_fnlf9ri",
                                    "score": 5,
                                    "created_utc": 1587056983.0,
                                    "replies": []
                                },
                                {
                                    "body": "If you're young and insecure now's a great opportunity to learn that when you're asking for advice, at least one person's gonna give you advice you don't like.\n\nIt's called growing a thicker skin, and recognizing criticism is a part of everyday life, and crying victim every time you're criticized leads to people not taking you seriously.",
                                    "author": "Dreviore",
                                    "id": "fnlhdgx",
                                    "parent_id": "t1_fnlf9ri",
                                    "score": -9,
                                    "created_utc": 1587053578.0,
                                    "replies": [
                                        {
                                            "body": "> It's called growing a thicker skin, and recognizing criticism is a part of everyday life, and crying victim every time you're criticized leads to people not taking you seriously.\n\n\"We should treat people like shit so they understand that people are going to treat them like shit\"",
                                            "author": "scottyLogJobs",
                                            "id": "fnlptyh",
                                            "parent_id": "t1_fnlhdgx",
                                            "score": 7,
                                            "created_utc": 1587057657.0,
                                            "replies": [
                                                {
                                                    "body": "Being told your hair line is receeding is not toxic.",
                                                    "author": "Dreviore",
                                                    "id": "fnlqch3",
                                                    "parent_id": "t1_fnlptyh",
                                                    "score": 5,
                                                    "created_utc": 1587057904.0,
                                                    "replies": [
                                                        {
                                                            "body": "It is when you relish shitting on people about it.",
                                                            "author": "JackFoxEsq",
                                                            "id": "fnnpbni",
                                                            "parent_id": "t1_fnlqch3",
                                                            "score": 3,
                                                            "created_utc": 1587097949.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": ">Nobody said you had to like or value the advice being given to you      \n     \n>>don't try to act like a victim because you don't like it.    \n    \n>>>Don't put yourself out there and stay in your shell.         \n        \nThose are tell tale signs of someone that isn't trying to give advice, just trying to attack people as if you're doing them a favor.       \n         \nIf they ask for advice, and you don't have actual advice to give, just stay quiet. Giving the same generic advice that a bot could easily give is not, by the way.       \n     \nDon't try to act like a victim, all offended because people are telling you your comments are not good enough. If you don't want people to have an opinion on them, you are allowed to close your pie hole and let the adults talk, ok?",
                                                            "author": "Lucifer_Hirsch",
                                                            "id": "fnlsen4",
                                                            "parent_id": "t1_fnlqch3",
                                                            "score": 2,
                                                            "created_utc": 1587058914.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Adults can take criticism and don't ask for advice if they're afraid of receiving any so that's a moot argument.",
                                                                    "author": "Dreviore",
                                                                    "id": "fnlwexv",
                                                                    "parent_id": "t1_fnlsen4",
                                                                    "score": 3,
                                                                    "created_utc": 1587060909.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "taking criticism doesn't mean taking any criticism. if a 5 year old comes to you and call you baldy, you won't sit there and think \"oh, what good advice, I may think about changing my hairstyle.\" you're going to roll your eyes and keep going.         \n        \nof course, that's a bit different when it's an adult having the same attitude.",
                                                                            "author": "Lucifer_Hirsch",
                                                                            "id": "fnlxv92",
                                                                            "parent_id": "t1_fnlwexv",
                                                                            "score": 1,
                                                                            "created_utc": 1587061633.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "There's a difference in my mind between answering the question \"is my hair receding and what should I do about it?\" Vs \"I'm looking for style suggestions\".",
                            "author": "bnjman",
                            "id": "fnleec2",
                            "parent_id": "t1_fnldo4z",
                            "score": 15,
                            "created_utc": 1587052090.0,
                            "replies": [
                                {
                                    "body": "But a shaved head is a legitimate style, even for people that don't have receding hair lines. Some people just have a really great face for a shaved head and can pull it off really well.",
                                    "author": null,
                                    "id": "fnlhraz",
                                    "parent_id": "t1_fnleec2",
                                    "score": 1,
                                    "created_utc": 1587053767.0,
                                    "replies": []
                                },
                                {
                                    "body": "OP: \"I'm looking for style suggestions\"\n\nMe: \"Well, your hair is receeding, I'd suggest you shave it.\"\n\nThat's still answering the question, you just don't like the answer, who cares if you feel hurt by it? Grow up if you don't like it, continue to scroll down and look for more advice.\n\nOr if you really can't handle criticism, don't post your picture online for people to look at.",
                                    "author": "Dreviore",
                                    "id": "fnlhh8z",
                                    "parent_id": "t1_fnleec2",
                                    "score": -10,
                                    "created_utc": 1587053629.0,
                                    "replies": [
                                        {
                                            "body": "What a toxic way to to approach this",
                                            "author": "Chaoswade",
                                            "id": "fnlmhhm",
                                            "parent_id": "t1_fnlhh8z",
                                            "score": 3,
                                            "created_utc": 1587056050.0,
                                            "replies": [
                                                {
                                                    "body": "It's not toxic to suggest somebody with a reeceding hairline to shave it off.\n\nIt's an opinion, and if you don't agree, I'm sure somebody else will have another suggestion.",
                                                    "author": "Dreviore",
                                                    "id": "fnlqnm8",
                                                    "parent_id": "t1_fnlmhhm",
                                                    "score": -5,
                                                    "created_utc": 1587058057.0,
                                                    "replies": [
                                                        {
                                                            "body": "My problem with this is that the same advice is given to everyone. It's like some are trying to get everyone to join this ficticous man club, where all you have to do is shave your head. I have no choice in the matter, because I can't grow hair up top, but I still find it annoying.",
                                                            "author": "rogun64",
                                                            "id": "fnnaqam",
                                                            "parent_id": "t1_fnlqnm8",
                                                            "score": 2,
                                                            "created_utc": 1587088133.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So people here are defending this by saying \"this is an advice sub and you should take the criticism etc.\" Sure but there's no need to tell people they are balding when they're not. And if someone is asking how to style their hair (not should I keep my hair) \"shave it\" isn't very useful.",
            "author": "kyloren1110",
            "id": "fnlfw22",
            "parent_id": "t3_g2ekxk",
            "score": 54,
            "created_utc": 1587052836.0,
            "replies": [
                {
                    "body": "Precisely, I’m open to discussion but they’re missing the point",
                    "author": "Clarkie2323",
                    "id": "fnlm7my",
                    "parent_id": "t1_fnlfw22",
                    "score": 15,
                    "created_utc": 1587055921.0,
                    "replies": []
                },
                {
                    "body": "I honestly have not seen people telling those who aren't balding that they are. Am I missing these posts? (Edit: why y'all downvoting me instead of linking the posts where this happens?)",
                    "author": null,
                    "id": "fnlgz3p",
                    "parent_id": "t1_fnlfw22",
                    "score": 2,
                    "created_utc": 1587053381.0,
                    "replies": [
                        {
                            "body": "I’m going to go out on a limb and say OP is balding and in denial and sees others with similar hair being told they’re balding and doesn’t like that",
                            "author": "Paranoidexboyfriend",
                            "id": "fnljz86",
                            "parent_id": "t1_fnlgz3p",
                            "score": -27,
                            "created_utc": 1587054845.0,
                            "replies": [
                                {
                                    "body": "Full head of hair",
                                    "author": "Clarkie2323",
                                    "id": "fnlmbou",
                                    "parent_id": "t1_fnljz86",
                                    "score": 12,
                                    "created_utc": 1587055975.0,
                                    "replies": [
                                        {
                                            "body": "Hey. Where are the links to the comments you're talking about?",
                                            "author": null,
                                            "id": "fnmbi1a",
                                            "parent_id": "t1_fnlmbou",
                                            "score": 2,
                                            "created_utc": 1587068449.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fnm8yxa",
                                    "parent_id": "t1_fnljz86",
                                    "score": 1,
                                    "created_utc": 1587067163.0,
                                    "replies": [
                                        {
                                            "body": "Neither of you should be making stupid claims like that. Ridiculous.",
                                            "author": null,
                                            "id": "fnmdqyt",
                                            "parent_id": "t1_fnm8yxa",
                                            "score": 1,
                                            "created_utc": 1587069597.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I noticed this too. Almost commented a few times. A lot of young people posting about minor recession and getting advice to shave their heads. Seemed a little extreme.\n\nLike here for example, this kid is probably not going to be bald in 10 years, the recession is minor... even if he was balding there is not enough to go off of to tell a kid that, and he certainly does not need a hair transplant...\n\nhttps://www.reddit.com/r/malehairadvice/comments/g2bvf2/what_to_do_about_receding_hairline/?utm_medium=android_app&utm_source=share",
            "author": "C4eaglem",
            "id": "fnlq1zj",
            "parent_id": "t3_g2ekxk",
            "score": 25,
            "created_utc": 1587057764.0,
            "replies": [
                {
                    "body": "it's people who have bought so far into the 'embrace baldness' mantra that they feel compelled to force it on other people.",
                    "author": "dancutty",
                    "id": "fnm8ms8",
                    "parent_id": "t1_fnlq1zj",
                    "score": 9,
                    "created_utc": 1587067001.0,
                    "replies": []
                },
                {
                    "body": "But the sooner t starts the faster it goes yeah? My brothers started around 19 and their hairlines were halfway up their head by 22.",
                    "author": "Boxfulachiken",
                    "id": "fnnm6mx",
                    "parent_id": "t1_fnlq1zj",
                    "score": 0,
                    "created_utc": 1587095681.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, exactly.\n\nEveryone's hairline is different, you often can't tell unless you can compare to pictures taken 5-10 years ago. A lot of guys, like me, have a widow's peak and hair that's a bit higher up at the temples. I've *always* had hair like that, so I know it's not receding right now and I usually tell posters \"difficult to tell based on 1 picture, post a picture from 5-10 years ago\".\n\nHowever, whenever I say that I get downvoted as though I just murdered a puppy. What gives?",
            "author": "diatonico_",
            "id": "fnlpufo",
            "parent_id": "t3_g2ekxk",
            "score": 12,
            "created_utc": 1587057664.0,
            "replies": []
        },
        {
            "body": "Everyone is dealing with insecurity about themselves",
            "author": "foodislife88",
            "id": "fnlysso",
            "parent_id": "t3_g2ekxk",
            "score": 5,
            "created_utc": 1587062105.0,
            "replies": []
        },
        {
            "body": "Totally agree, people on here act like if your hair's receding, even a little, you have to shave it all right away. Like, some styles, even if a bit obvious, can look good with a receding hairline, so you don't have to instantly hit the bald button when you start noticing it.   \n\nAlso, the \"durr shave it and grow a beard!!\" crowd is the worst, oh jeez just grow a beard? Is that it??! I'll just strap on my beard helmet, get in my beard cannon, and fly off into beardland, where beards grow on beardies!",
            "author": "Gary_FucKing",
            "id": "fnmrfsf",
            "parent_id": "t3_g2ekxk",
            "score": 4,
            "created_utc": 1587076735.0,
            "replies": [
                {
                    "body": "Hahahaha",
                    "author": "Clarkie2323",
                    "id": "fnmrnqa",
                    "parent_id": "t1_fnmrfsf",
                    "score": 3,
                    "created_utc": 1587076853.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "People are A$$holes.\nI apologize on their behalf.",
            "author": "IGOTPOPROX",
            "id": "fnneyqx",
            "parent_id": "t3_g2ekxk",
            "score": 3,
            "created_utc": 1587090821.0,
            "replies": []
        },
        {
            "body": "This sub is for advice. Frankly, if they post here looking for advice or people's thoughts on their haircut, and those people think the guy looks like he's balding, they should say so. Anything less is dishonest, and defeats the whole purpose of this sub. I highly doubt anyone is in here for the explicit reason of putting others down, so anyone saying that someone is balding is highly likely saying so for that person's best interest.",
            "author": "NachosPR",
            "id": "fnlasei",
            "parent_id": "t3_g2ekxk",
            "score": 6,
            "created_utc": 1587050228.0,
            "replies": []
        },
        {
            "body": "It’s stuff like this post mentions that make me afraid to post in this subreddit.",
            "author": "McHorseyPie",
            "id": "fnnozzr",
            "parent_id": "t3_g2ekxk",
            "score": 1,
            "created_utc": 1587097709.0,
            "replies": []
        },
        {
            "body": "Which posts?! I have not seen this",
            "author": null,
            "id": "fnlnat2",
            "parent_id": "t3_g2ekxk",
            "score": 1,
            "created_utc": 1587056437.0,
            "replies": []
        },
        {
            "body": "We're all balding man",
            "author": "AdmiralZassman",
            "id": "fnlxtp2",
            "parent_id": "t3_g2ekxk",
            "score": 1,
            "created_utc": 1587061612.0,
            "replies": []
        },
        {
            "body": "It's those dang hair-regrowth companies seeding the market. But seriously, I wonder about this sometimes.",
            "author": "archarugen",
            "id": "fnmf5p8",
            "parent_id": "t3_g2ekxk",
            "score": 1,
            "created_utc": 1587070316.0,
            "replies": []
        },
        {
            "body": "Sorry but \"insecurity\" is not an excuse to not be honest.\n\nIf somebody puts themselves out there for criticism don't scream how bad people are for following through.\n\nGrow up, and recognize words don't hurt, and people people here are giving advice, regardless of if you like the advice or not.\n\nThis is an advice subreddit, not a \"Look at me and tell me I'm pretty\" sub.",
            "author": "Dreviore",
            "id": "fnldhse",
            "parent_id": "t3_g2ekxk",
            "score": -6,
            "created_utc": 1587051628.0,
            "replies": [
                {
                    "body": "I don't disagree with you, however words can certainly hurt. However words from internet strangers, not so much",
                    "author": "Luberino_Brochacho",
                    "id": "fnlmmw5",
                    "parent_id": "t1_fnldhse",
                    "score": 1,
                    "created_utc": 1587056122.0,
                    "replies": [
                        {
                            "body": "That's the point.\n\nIf you're going online and asking for advice, if you receive advice you don't like, continue scrolling till you find advice you like.\n\nIf you're hurt by strangers on the internet, you really need to evaluate your own self worth.\n\nI'm here to help people make choices with their hair that will help them look better, I'm not here to inflate your ego, or make you feel good about yourself.",
                            "author": "Dreviore",
                            "id": "fnlqktn",
                            "parent_id": "t1_fnlmmw5",
                            "score": 0,
                            "created_utc": 1587058019.0,
                            "replies": [
                                {
                                    "body": "Well what you said was \"words don't hurt\" that was the part I took issue with.",
                                    "author": "Luberino_Brochacho",
                                    "id": "fnniexc",
                                    "parent_id": "t1_fnlqktn",
                                    "score": 1,
                                    "created_utc": 1587093094.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why be insecure about balding? Its perfectly normal",
            "author": "ppeater6969",
            "id": "fnlvd6g",
            "parent_id": "t3_g2ekxk",
            "score": -1,
            "created_utc": 1587060384.0,
            "replies": []
        },
        {
            "body": "tbh no one should be seeking reassurance here, thats not what the subreddit is for",
            "author": "learning_skincare",
            "id": "fnlcdi7",
            "parent_id": "t3_g2ekxk",
            "score": -7,
            "created_utc": 1587051047.0,
            "replies": [
                {
                    "body": "You think a subreddit people go to to make themselves look better shouldn't help them feel better about their appearance? Are you sure about that one?",
                    "author": "Chaoswade",
                    "id": "fnln7c4",
                    "parent_id": "t1_fnlcdi7",
                    "score": 1,
                    "created_utc": 1587056392.0,
                    "replies": [
                        {
                            "body": "If someone asks \"does this look good?\" \"can I pull off this style?\" \"is my hair receding?\" they should equally expect to get the answer they don't want to hear.",
                            "author": "learning_skincare",
                            "id": "fnlzwn5",
                            "parent_id": "t1_fnln7c4",
                            "score": 5,
                            "created_utc": 1587062651.0,
                            "replies": [
                                {
                                    "body": "HaTe SpEeCh",
                                    "author": "Dreviore",
                                    "id": "fnmi7es",
                                    "parent_id": "t1_fnlzwn5",
                                    "score": 3,
                                    "created_utc": 1587071881.0,
                                    "replies": [
                                        {
                                            "body": "😂",
                                            "author": "learning_skincare",
                                            "id": "fnmmjuc",
                                            "parent_id": "t1_fnmi7es",
                                            "score": 1,
                                            "created_utc": 1587074141.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Posted a thread asking about the beard, got the reply that my hair was thinning like... thanks, I know?",
            "author": "Neknoh",
            "id": "fnm0maj",
            "parent_id": "t1_fnlcvqx",
            "score": 31,
            "created_utc": 1587063007.0,
            "replies": []
        },
        {
            "body": "I haven't personally done this to people that aren't asking specifically about shaving their heads, but I don't know that it's mean if somebody comes to male hair advice it's not like any advice happening is unsolicited. everyone's got a different opinion about what looks good, anything shared here is obviously just an opinion.",
            "author": "8Ariadnesthread8",
            "id": "fnlte79",
            "parent_id": "t1_fnlcvqx",
            "score": 5,
            "created_utc": 1587059403.0,
            "replies": []
        },
        {
            "body": "Why's it mean? They're asking for advice, and they're receiving advice.\n\nNobody said you had to like or value the advice being given to you, and don't try to act like a victim because you don't like it.\n\nWhen you put yourself in the spotlight, you've made the decision to take criticism. Don't want criticism? Don't put yourself out there and stay in your shell.",
            "author": "Dreviore",
            "id": "fnldo4z",
            "parent_id": "t1_fnlcvqx",
            "score": -19,
            "created_utc": 1587051719.0,
            "replies": [
                {
                    "body": "Generally this sub is really supportive and there are certainly ways to gently give advice, which most people on the sub don't need to be reminded about. There are two kinds of criticism, constructive and negative. A lot of people here are young and insecure and looking for advice, and they don't deserve unhelpful forms of criticism just for putting themselves out there.",
                    "author": "scottyLogJobs",
                    "id": "fnlf9ri",
                    "parent_id": "t1_fnldo4z",
                    "score": 13,
                    "created_utc": 1587052528.0,
                    "replies": [
                        {
                            "body": "Precisely",
                            "author": "Clarkie2323",
                            "id": "fnlofpi",
                            "parent_id": "t1_fnlf9ri",
                            "score": 5,
                            "created_utc": 1587056983.0,
                            "replies": []
                        },
                        {
                            "body": "If you're young and insecure now's a great opportunity to learn that when you're asking for advice, at least one person's gonna give you advice you don't like.\n\nIt's called growing a thicker skin, and recognizing criticism is a part of everyday life, and crying victim every time you're criticized leads to people not taking you seriously.",
                            "author": "Dreviore",
                            "id": "fnlhdgx",
                            "parent_id": "t1_fnlf9ri",
                            "score": -9,
                            "created_utc": 1587053578.0,
                            "replies": [
                                {
                                    "body": "> It's called growing a thicker skin, and recognizing criticism is a part of everyday life, and crying victim every time you're criticized leads to people not taking you seriously.\n\n\"We should treat people like shit so they understand that people are going to treat them like shit\"",
                                    "author": "scottyLogJobs",
                                    "id": "fnlptyh",
                                    "parent_id": "t1_fnlhdgx",
                                    "score": 7,
                                    "created_utc": 1587057657.0,
                                    "replies": [
                                        {
                                            "body": "Being told your hair line is receeding is not toxic.",
                                            "author": "Dreviore",
                                            "id": "fnlqch3",
                                            "parent_id": "t1_fnlptyh",
                                            "score": 5,
                                            "created_utc": 1587057904.0,
                                            "replies": [
                                                {
                                                    "body": "It is when you relish shitting on people about it.",
                                                    "author": "JackFoxEsq",
                                                    "id": "fnnpbni",
                                                    "parent_id": "t1_fnlqch3",
                                                    "score": 3,
                                                    "created_utc": 1587097949.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": ">Nobody said you had to like or value the advice being given to you      \n     \n>>don't try to act like a victim because you don't like it.    \n    \n>>>Don't put yourself out there and stay in your shell.         \n        \nThose are tell tale signs of someone that isn't trying to give advice, just trying to attack people as if you're doing them a favor.       \n         \nIf they ask for advice, and you don't have actual advice to give, just stay quiet. Giving the same generic advice that a bot could easily give is not, by the way.       \n     \nDon't try to act like a victim, all offended because people are telling you your comments are not good enough. If you don't want people to have an opinion on them, you are allowed to close your pie hole and let the adults talk, ok?",
                                                    "author": "Lucifer_Hirsch",
                                                    "id": "fnlsen4",
                                                    "parent_id": "t1_fnlqch3",
                                                    "score": 2,
                                                    "created_utc": 1587058914.0,
                                                    "replies": [
                                                        {
                                                            "body": "Adults can take criticism and don't ask for advice if they're afraid of receiving any so that's a moot argument.",
                                                            "author": "Dreviore",
                                                            "id": "fnlwexv",
                                                            "parent_id": "t1_fnlsen4",
                                                            "score": 3,
                                                            "created_utc": 1587060909.0,
                                                            "replies": [
                                                                {
                                                                    "body": "taking criticism doesn't mean taking any criticism. if a 5 year old comes to you and call you baldy, you won't sit there and think \"oh, what good advice, I may think about changing my hairstyle.\" you're going to roll your eyes and keep going.         \n        \nof course, that's a bit different when it's an adult having the same attitude.",
                                                                    "author": "Lucifer_Hirsch",
                                                                    "id": "fnlxv92",
                                                                    "parent_id": "t1_fnlwexv",
                                                                    "score": 1,
                                                                    "created_utc": 1587061633.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "There's a difference in my mind between answering the question \"is my hair receding and what should I do about it?\" Vs \"I'm looking for style suggestions\".",
                    "author": "bnjman",
                    "id": "fnleec2",
                    "parent_id": "t1_fnldo4z",
                    "score": 15,
                    "created_utc": 1587052090.0,
                    "replies": [
                        {
                            "body": "But a shaved head is a legitimate style, even for people that don't have receding hair lines. Some people just have a really great face for a shaved head and can pull it off really well.",
                            "author": null,
                            "id": "fnlhraz",
                            "parent_id": "t1_fnleec2",
                            "score": 1,
                            "created_utc": 1587053767.0,
                            "replies": []
                        },
                        {
                            "body": "OP: \"I'm looking for style suggestions\"\n\nMe: \"Well, your hair is receeding, I'd suggest you shave it.\"\n\nThat's still answering the question, you just don't like the answer, who cares if you feel hurt by it? Grow up if you don't like it, continue to scroll down and look for more advice.\n\nOr if you really can't handle criticism, don't post your picture online for people to look at.",
                            "author": "Dreviore",
                            "id": "fnlhh8z",
                            "parent_id": "t1_fnleec2",
                            "score": -10,
                            "created_utc": 1587053629.0,
                            "replies": [
                                {
                                    "body": "What a toxic way to to approach this",
                                    "author": "Chaoswade",
                                    "id": "fnlmhhm",
                                    "parent_id": "t1_fnlhh8z",
                                    "score": 3,
                                    "created_utc": 1587056050.0,
                                    "replies": [
                                        {
                                            "body": "It's not toxic to suggest somebody with a reeceding hairline to shave it off.\n\nIt's an opinion, and if you don't agree, I'm sure somebody else will have another suggestion.",
                                            "author": "Dreviore",
                                            "id": "fnlqnm8",
                                            "parent_id": "t1_fnlmhhm",
                                            "score": -5,
                                            "created_utc": 1587058057.0,
                                            "replies": [
                                                {
                                                    "body": "My problem with this is that the same advice is given to everyone. It's like some are trying to get everyone to join this ficticous man club, where all you have to do is shave your head. I have no choice in the matter, because I can't grow hair up top, but I still find it annoying.",
                                                    "author": "rogun64",
                                                    "id": "fnnaqam",
                                                    "parent_id": "t1_fnlqnm8",
                                                    "score": 2,
                                                    "created_utc": 1587088133.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Precisely, I’m open to discussion but they’re missing the point",
            "author": "Clarkie2323",
            "id": "fnlm7my",
            "parent_id": "t1_fnlfw22",
            "score": 15,
            "created_utc": 1587055921.0,
            "replies": []
        },
        {
            "body": "I honestly have not seen people telling those who aren't balding that they are. Am I missing these posts? (Edit: why y'all downvoting me instead of linking the posts where this happens?)",
            "author": null,
            "id": "fnlgz3p",
            "parent_id": "t1_fnlfw22",
            "score": 2,
            "created_utc": 1587053381.0,
            "replies": [
                {
                    "body": "I’m going to go out on a limb and say OP is balding and in denial and sees others with similar hair being told they’re balding and doesn’t like that",
                    "author": "Paranoidexboyfriend",
                    "id": "fnljz86",
                    "parent_id": "t1_fnlgz3p",
                    "score": -27,
                    "created_utc": 1587054845.0,
                    "replies": [
                        {
                            "body": "Full head of hair",
                            "author": "Clarkie2323",
                            "id": "fnlmbou",
                            "parent_id": "t1_fnljz86",
                            "score": 12,
                            "created_utc": 1587055975.0,
                            "replies": [
                                {
                                    "body": "Hey. Where are the links to the comments you're talking about?",
                                    "author": null,
                                    "id": "fnmbi1a",
                                    "parent_id": "t1_fnlmbou",
                                    "score": 2,
                                    "created_utc": 1587068449.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fnm8yxa",
                            "parent_id": "t1_fnljz86",
                            "score": 1,
                            "created_utc": 1587067163.0,
                            "replies": [
                                {
                                    "body": "Neither of you should be making stupid claims like that. Ridiculous.",
                                    "author": null,
                                    "id": "fnmdqyt",
                                    "parent_id": "t1_fnm8yxa",
                                    "score": 1,
                                    "created_utc": 1587069597.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "it's people who have bought so far into the 'embrace baldness' mantra that they feel compelled to force it on other people.",
            "author": "dancutty",
            "id": "fnm8ms8",
            "parent_id": "t1_fnlq1zj",
            "score": 9,
            "created_utc": 1587067001.0,
            "replies": []
        },
        {
            "body": "But the sooner t starts the faster it goes yeah? My brothers started around 19 and their hairlines were halfway up their head by 22.",
            "author": "Boxfulachiken",
            "id": "fnnm6mx",
            "parent_id": "t1_fnlq1zj",
            "score": 0,
            "created_utc": 1587095681.0,
            "replies": []
        },
        {
            "body": "Hahahaha",
            "author": "Clarkie2323",
            "id": "fnmrnqa",
            "parent_id": "t1_fnmrfsf",
            "score": 3,
            "created_utc": 1587076853.0,
            "replies": []
        },
        {
            "body": "I don't disagree with you, however words can certainly hurt. However words from internet strangers, not so much",
            "author": "Luberino_Brochacho",
            "id": "fnlmmw5",
            "parent_id": "t1_fnldhse",
            "score": 1,
            "created_utc": 1587056122.0,
            "replies": [
                {
                    "body": "That's the point.\n\nIf you're going online and asking for advice, if you receive advice you don't like, continue scrolling till you find advice you like.\n\nIf you're hurt by strangers on the internet, you really need to evaluate your own self worth.\n\nI'm here to help people make choices with their hair that will help them look better, I'm not here to inflate your ego, or make you feel good about yourself.",
                    "author": "Dreviore",
                    "id": "fnlqktn",
                    "parent_id": "t1_fnlmmw5",
                    "score": 0,
                    "created_utc": 1587058019.0,
                    "replies": [
                        {
                            "body": "Well what you said was \"words don't hurt\" that was the part I took issue with.",
                            "author": "Luberino_Brochacho",
                            "id": "fnniexc",
                            "parent_id": "t1_fnlqktn",
                            "score": 1,
                            "created_utc": 1587093094.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You think a subreddit people go to to make themselves look better shouldn't help them feel better about their appearance? Are you sure about that one?",
            "author": "Chaoswade",
            "id": "fnln7c4",
            "parent_id": "t1_fnlcdi7",
            "score": 1,
            "created_utc": 1587056392.0,
            "replies": [
                {
                    "body": "If someone asks \"does this look good?\" \"can I pull off this style?\" \"is my hair receding?\" they should equally expect to get the answer they don't want to hear.",
                    "author": "learning_skincare",
                    "id": "fnlzwn5",
                    "parent_id": "t1_fnln7c4",
                    "score": 5,
                    "created_utc": 1587062651.0,
                    "replies": [
                        {
                            "body": "HaTe SpEeCh",
                            "author": "Dreviore",
                            "id": "fnmi7es",
                            "parent_id": "t1_fnlzwn5",
                            "score": 3,
                            "created_utc": 1587071881.0,
                            "replies": [
                                {
                                    "body": "😂",
                                    "author": "learning_skincare",
                                    "id": "fnmmjuc",
                                    "parent_id": "t1_fnmi7es",
                                    "score": 1,
                                    "created_utc": 1587074141.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Generally this sub is really supportive and there are certainly ways to gently give advice, which most people on the sub don't need to be reminded about. There are two kinds of criticism, constructive and negative. A lot of people here are young and insecure and looking for advice, and they don't deserve unhelpful forms of criticism just for putting themselves out there.",
            "author": "scottyLogJobs",
            "id": "fnlf9ri",
            "parent_id": "t1_fnldo4z",
            "score": 13,
            "created_utc": 1587052528.0,
            "replies": [
                {
                    "body": "Precisely",
                    "author": "Clarkie2323",
                    "id": "fnlofpi",
                    "parent_id": "t1_fnlf9ri",
                    "score": 5,
                    "created_utc": 1587056983.0,
                    "replies": []
                },
                {
                    "body": "If you're young and insecure now's a great opportunity to learn that when you're asking for advice, at least one person's gonna give you advice you don't like.\n\nIt's called growing a thicker skin, and recognizing criticism is a part of everyday life, and crying victim every time you're criticized leads to people not taking you seriously.",
                    "author": "Dreviore",
                    "id": "fnlhdgx",
                    "parent_id": "t1_fnlf9ri",
                    "score": -9,
                    "created_utc": 1587053578.0,
                    "replies": [
                        {
                            "body": "> It's called growing a thicker skin, and recognizing criticism is a part of everyday life, and crying victim every time you're criticized leads to people not taking you seriously.\n\n\"We should treat people like shit so they understand that people are going to treat them like shit\"",
                            "author": "scottyLogJobs",
                            "id": "fnlptyh",
                            "parent_id": "t1_fnlhdgx",
                            "score": 7,
                            "created_utc": 1587057657.0,
                            "replies": [
                                {
                                    "body": "Being told your hair line is receeding is not toxic.",
                                    "author": "Dreviore",
                                    "id": "fnlqch3",
                                    "parent_id": "t1_fnlptyh",
                                    "score": 5,
                                    "created_utc": 1587057904.0,
                                    "replies": [
                                        {
                                            "body": "It is when you relish shitting on people about it.",
                                            "author": "JackFoxEsq",
                                            "id": "fnnpbni",
                                            "parent_id": "t1_fnlqch3",
                                            "score": 3,
                                            "created_utc": 1587097949.0,
                                            "replies": []
                                        },
                                        {
                                            "body": ">Nobody said you had to like or value the advice being given to you      \n     \n>>don't try to act like a victim because you don't like it.    \n    \n>>>Don't put yourself out there and stay in your shell.         \n        \nThose are tell tale signs of someone that isn't trying to give advice, just trying to attack people as if you're doing them a favor.       \n         \nIf they ask for advice, and you don't have actual advice to give, just stay quiet. Giving the same generic advice that a bot could easily give is not, by the way.       \n     \nDon't try to act like a victim, all offended because people are telling you your comments are not good enough. If you don't want people to have an opinion on them, you are allowed to close your pie hole and let the adults talk, ok?",
                                            "author": "Lucifer_Hirsch",
                                            "id": "fnlsen4",
                                            "parent_id": "t1_fnlqch3",
                                            "score": 2,
                                            "created_utc": 1587058914.0,
                                            "replies": [
                                                {
                                                    "body": "Adults can take criticism and don't ask for advice if they're afraid of receiving any so that's a moot argument.",
                                                    "author": "Dreviore",
                                                    "id": "fnlwexv",
                                                    "parent_id": "t1_fnlsen4",
                                                    "score": 3,
                                                    "created_utc": 1587060909.0,
                                                    "replies": [
                                                        {
                                                            "body": "taking criticism doesn't mean taking any criticism. if a 5 year old comes to you and call you baldy, you won't sit there and think \"oh, what good advice, I may think about changing my hairstyle.\" you're going to roll your eyes and keep going.         \n        \nof course, that's a bit different when it's an adult having the same attitude.",
                                                            "author": "Lucifer_Hirsch",
                                                            "id": "fnlxv92",
                                                            "parent_id": "t1_fnlwexv",
                                                            "score": 1,
                                                            "created_utc": 1587061633.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There's a difference in my mind between answering the question \"is my hair receding and what should I do about it?\" Vs \"I'm looking for style suggestions\".",
            "author": "bnjman",
            "id": "fnleec2",
            "parent_id": "t1_fnldo4z",
            "score": 15,
            "created_utc": 1587052090.0,
            "replies": [
                {
                    "body": "But a shaved head is a legitimate style, even for people that don't have receding hair lines. Some people just have a really great face for a shaved head and can pull it off really well.",
                    "author": null,
                    "id": "fnlhraz",
                    "parent_id": "t1_fnleec2",
                    "score": 1,
                    "created_utc": 1587053767.0,
                    "replies": []
                },
                {
                    "body": "OP: \"I'm looking for style suggestions\"\n\nMe: \"Well, your hair is receeding, I'd suggest you shave it.\"\n\nThat's still answering the question, you just don't like the answer, who cares if you feel hurt by it? Grow up if you don't like it, continue to scroll down and look for more advice.\n\nOr if you really can't handle criticism, don't post your picture online for people to look at.",
                    "author": "Dreviore",
                    "id": "fnlhh8z",
                    "parent_id": "t1_fnleec2",
                    "score": -10,
                    "created_utc": 1587053629.0,
                    "replies": [
                        {
                            "body": "What a toxic way to to approach this",
                            "author": "Chaoswade",
                            "id": "fnlmhhm",
                            "parent_id": "t1_fnlhh8z",
                            "score": 3,
                            "created_utc": 1587056050.0,
                            "replies": [
                                {
                                    "body": "It's not toxic to suggest somebody with a reeceding hairline to shave it off.\n\nIt's an opinion, and if you don't agree, I'm sure somebody else will have another suggestion.",
                                    "author": "Dreviore",
                                    "id": "fnlqnm8",
                                    "parent_id": "t1_fnlmhhm",
                                    "score": -5,
                                    "created_utc": 1587058057.0,
                                    "replies": [
                                        {
                                            "body": "My problem with this is that the same advice is given to everyone. It's like some are trying to get everyone to join this ficticous man club, where all you have to do is shave your head. I have no choice in the matter, because I can't grow hair up top, but I still find it annoying.",
                                            "author": "rogun64",
                                            "id": "fnnaqam",
                                            "parent_id": "t1_fnlqnm8",
                                            "score": 2,
                                            "created_utc": 1587088133.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m going to go out on a limb and say OP is balding and in denial and sees others with similar hair being told they’re balding and doesn’t like that",
            "author": "Paranoidexboyfriend",
            "id": "fnljz86",
            "parent_id": "t1_fnlgz3p",
            "score": -27,
            "created_utc": 1587054845.0,
            "replies": [
                {
                    "body": "Full head of hair",
                    "author": "Clarkie2323",
                    "id": "fnlmbou",
                    "parent_id": "t1_fnljz86",
                    "score": 12,
                    "created_utc": 1587055975.0,
                    "replies": [
                        {
                            "body": "Hey. Where are the links to the comments you're talking about?",
                            "author": null,
                            "id": "fnmbi1a",
                            "parent_id": "t1_fnlmbou",
                            "score": 2,
                            "created_utc": 1587068449.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fnm8yxa",
                    "parent_id": "t1_fnljz86",
                    "score": 1,
                    "created_utc": 1587067163.0,
                    "replies": [
                        {
                            "body": "Neither of you should be making stupid claims like that. Ridiculous.",
                            "author": null,
                            "id": "fnmdqyt",
                            "parent_id": "t1_fnm8yxa",
                            "score": 1,
                            "created_utc": 1587069597.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's the point.\n\nIf you're going online and asking for advice, if you receive advice you don't like, continue scrolling till you find advice you like.\n\nIf you're hurt by strangers on the internet, you really need to evaluate your own self worth.\n\nI'm here to help people make choices with their hair that will help them look better, I'm not here to inflate your ego, or make you feel good about yourself.",
            "author": "Dreviore",
            "id": "fnlqktn",
            "parent_id": "t1_fnlmmw5",
            "score": 0,
            "created_utc": 1587058019.0,
            "replies": [
                {
                    "body": "Well what you said was \"words don't hurt\" that was the part I took issue with.",
                    "author": "Luberino_Brochacho",
                    "id": "fnniexc",
                    "parent_id": "t1_fnlqktn",
                    "score": 1,
                    "created_utc": 1587093094.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If someone asks \"does this look good?\" \"can I pull off this style?\" \"is my hair receding?\" they should equally expect to get the answer they don't want to hear.",
            "author": "learning_skincare",
            "id": "fnlzwn5",
            "parent_id": "t1_fnln7c4",
            "score": 5,
            "created_utc": 1587062651.0,
            "replies": [
                {
                    "body": "HaTe SpEeCh",
                    "author": "Dreviore",
                    "id": "fnmi7es",
                    "parent_id": "t1_fnlzwn5",
                    "score": 3,
                    "created_utc": 1587071881.0,
                    "replies": [
                        {
                            "body": "😂",
                            "author": "learning_skincare",
                            "id": "fnmmjuc",
                            "parent_id": "t1_fnmi7es",
                            "score": 1,
                            "created_utc": 1587074141.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Precisely",
            "author": "Clarkie2323",
            "id": "fnlofpi",
            "parent_id": "t1_fnlf9ri",
            "score": 5,
            "created_utc": 1587056983.0,
            "replies": []
        },
        {
            "body": "If you're young and insecure now's a great opportunity to learn that when you're asking for advice, at least one person's gonna give you advice you don't like.\n\nIt's called growing a thicker skin, and recognizing criticism is a part of everyday life, and crying victim every time you're criticized leads to people not taking you seriously.",
            "author": "Dreviore",
            "id": "fnlhdgx",
            "parent_id": "t1_fnlf9ri",
            "score": -9,
            "created_utc": 1587053578.0,
            "replies": [
                {
                    "body": "> It's called growing a thicker skin, and recognizing criticism is a part of everyday life, and crying victim every time you're criticized leads to people not taking you seriously.\n\n\"We should treat people like shit so they understand that people are going to treat them like shit\"",
                    "author": "scottyLogJobs",
                    "id": "fnlptyh",
                    "parent_id": "t1_fnlhdgx",
                    "score": 7,
                    "created_utc": 1587057657.0,
                    "replies": [
                        {
                            "body": "Being told your hair line is receeding is not toxic.",
                            "author": "Dreviore",
                            "id": "fnlqch3",
                            "parent_id": "t1_fnlptyh",
                            "score": 5,
                            "created_utc": 1587057904.0,
                            "replies": [
                                {
                                    "body": "It is when you relish shitting on people about it.",
                                    "author": "JackFoxEsq",
                                    "id": "fnnpbni",
                                    "parent_id": "t1_fnlqch3",
                                    "score": 3,
                                    "created_utc": 1587097949.0,
                                    "replies": []
                                },
                                {
                                    "body": ">Nobody said you had to like or value the advice being given to you      \n     \n>>don't try to act like a victim because you don't like it.    \n    \n>>>Don't put yourself out there and stay in your shell.         \n        \nThose are tell tale signs of someone that isn't trying to give advice, just trying to attack people as if you're doing them a favor.       \n         \nIf they ask for advice, and you don't have actual advice to give, just stay quiet. Giving the same generic advice that a bot could easily give is not, by the way.       \n     \nDon't try to act like a victim, all offended because people are telling you your comments are not good enough. If you don't want people to have an opinion on them, you are allowed to close your pie hole and let the adults talk, ok?",
                                    "author": "Lucifer_Hirsch",
                                    "id": "fnlsen4",
                                    "parent_id": "t1_fnlqch3",
                                    "score": 2,
                                    "created_utc": 1587058914.0,
                                    "replies": [
                                        {
                                            "body": "Adults can take criticism and don't ask for advice if they're afraid of receiving any so that's a moot argument.",
                                            "author": "Dreviore",
                                            "id": "fnlwexv",
                                            "parent_id": "t1_fnlsen4",
                                            "score": 3,
                                            "created_utc": 1587060909.0,
                                            "replies": [
                                                {
                                                    "body": "taking criticism doesn't mean taking any criticism. if a 5 year old comes to you and call you baldy, you won't sit there and think \"oh, what good advice, I may think about changing my hairstyle.\" you're going to roll your eyes and keep going.         \n        \nof course, that's a bit different when it's an adult having the same attitude.",
                                                    "author": "Lucifer_Hirsch",
                                                    "id": "fnlxv92",
                                                    "parent_id": "t1_fnlwexv",
                                                    "score": 1,
                                                    "created_utc": 1587061633.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "But a shaved head is a legitimate style, even for people that don't have receding hair lines. Some people just have a really great face for a shaved head and can pull it off really well.",
            "author": null,
            "id": "fnlhraz",
            "parent_id": "t1_fnleec2",
            "score": 1,
            "created_utc": 1587053767.0,
            "replies": []
        },
        {
            "body": "OP: \"I'm looking for style suggestions\"\n\nMe: \"Well, your hair is receeding, I'd suggest you shave it.\"\n\nThat's still answering the question, you just don't like the answer, who cares if you feel hurt by it? Grow up if you don't like it, continue to scroll down and look for more advice.\n\nOr if you really can't handle criticism, don't post your picture online for people to look at.",
            "author": "Dreviore",
            "id": "fnlhh8z",
            "parent_id": "t1_fnleec2",
            "score": -10,
            "created_utc": 1587053629.0,
            "replies": [
                {
                    "body": "What a toxic way to to approach this",
                    "author": "Chaoswade",
                    "id": "fnlmhhm",
                    "parent_id": "t1_fnlhh8z",
                    "score": 3,
                    "created_utc": 1587056050.0,
                    "replies": [
                        {
                            "body": "It's not toxic to suggest somebody with a reeceding hairline to shave it off.\n\nIt's an opinion, and if you don't agree, I'm sure somebody else will have another suggestion.",
                            "author": "Dreviore",
                            "id": "fnlqnm8",
                            "parent_id": "t1_fnlmhhm",
                            "score": -5,
                            "created_utc": 1587058057.0,
                            "replies": [
                                {
                                    "body": "My problem with this is that the same advice is given to everyone. It's like some are trying to get everyone to join this ficticous man club, where all you have to do is shave your head. I have no choice in the matter, because I can't grow hair up top, but I still find it annoying.",
                                    "author": "rogun64",
                                    "id": "fnnaqam",
                                    "parent_id": "t1_fnlqnm8",
                                    "score": 2,
                                    "created_utc": 1587088133.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Full head of hair",
            "author": "Clarkie2323",
            "id": "fnlmbou",
            "parent_id": "t1_fnljz86",
            "score": 12,
            "created_utc": 1587055975.0,
            "replies": [
                {
                    "body": "Hey. Where are the links to the comments you're talking about?",
                    "author": null,
                    "id": "fnmbi1a",
                    "parent_id": "t1_fnlmbou",
                    "score": 2,
                    "created_utc": 1587068449.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fnm8yxa",
            "parent_id": "t1_fnljz86",
            "score": 1,
            "created_utc": 1587067163.0,
            "replies": [
                {
                    "body": "Neither of you should be making stupid claims like that. Ridiculous.",
                    "author": null,
                    "id": "fnmdqyt",
                    "parent_id": "t1_fnm8yxa",
                    "score": 1,
                    "created_utc": 1587069597.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well what you said was \"words don't hurt\" that was the part I took issue with.",
            "author": "Luberino_Brochacho",
            "id": "fnniexc",
            "parent_id": "t1_fnlqktn",
            "score": 1,
            "created_utc": 1587093094.0,
            "replies": []
        },
        {
            "body": "HaTe SpEeCh",
            "author": "Dreviore",
            "id": "fnmi7es",
            "parent_id": "t1_fnlzwn5",
            "score": 3,
            "created_utc": 1587071881.0,
            "replies": [
                {
                    "body": "😂",
                    "author": "learning_skincare",
                    "id": "fnmmjuc",
                    "parent_id": "t1_fnmi7es",
                    "score": 1,
                    "created_utc": 1587074141.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> It's called growing a thicker skin, and recognizing criticism is a part of everyday life, and crying victim every time you're criticized leads to people not taking you seriously.\n\n\"We should treat people like shit so they understand that people are going to treat them like shit\"",
            "author": "scottyLogJobs",
            "id": "fnlptyh",
            "parent_id": "t1_fnlhdgx",
            "score": 7,
            "created_utc": 1587057657.0,
            "replies": [
                {
                    "body": "Being told your hair line is receeding is not toxic.",
                    "author": "Dreviore",
                    "id": "fnlqch3",
                    "parent_id": "t1_fnlptyh",
                    "score": 5,
                    "created_utc": 1587057904.0,
                    "replies": [
                        {
                            "body": "It is when you relish shitting on people about it.",
                            "author": "JackFoxEsq",
                            "id": "fnnpbni",
                            "parent_id": "t1_fnlqch3",
                            "score": 3,
                            "created_utc": 1587097949.0,
                            "replies": []
                        },
                        {
                            "body": ">Nobody said you had to like or value the advice being given to you      \n     \n>>don't try to act like a victim because you don't like it.    \n    \n>>>Don't put yourself out there and stay in your shell.         \n        \nThose are tell tale signs of someone that isn't trying to give advice, just trying to attack people as if you're doing them a favor.       \n         \nIf they ask for advice, and you don't have actual advice to give, just stay quiet. Giving the same generic advice that a bot could easily give is not, by the way.       \n     \nDon't try to act like a victim, all offended because people are telling you your comments are not good enough. If you don't want people to have an opinion on them, you are allowed to close your pie hole and let the adults talk, ok?",
                            "author": "Lucifer_Hirsch",
                            "id": "fnlsen4",
                            "parent_id": "t1_fnlqch3",
                            "score": 2,
                            "created_utc": 1587058914.0,
                            "replies": [
                                {
                                    "body": "Adults can take criticism and don't ask for advice if they're afraid of receiving any so that's a moot argument.",
                                    "author": "Dreviore",
                                    "id": "fnlwexv",
                                    "parent_id": "t1_fnlsen4",
                                    "score": 3,
                                    "created_utc": 1587060909.0,
                                    "replies": [
                                        {
                                            "body": "taking criticism doesn't mean taking any criticism. if a 5 year old comes to you and call you baldy, you won't sit there and think \"oh, what good advice, I may think about changing my hairstyle.\" you're going to roll your eyes and keep going.         \n        \nof course, that's a bit different when it's an adult having the same attitude.",
                                            "author": "Lucifer_Hirsch",
                                            "id": "fnlxv92",
                                            "parent_id": "t1_fnlwexv",
                                            "score": 1,
                                            "created_utc": 1587061633.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What a toxic way to to approach this",
            "author": "Chaoswade",
            "id": "fnlmhhm",
            "parent_id": "t1_fnlhh8z",
            "score": 3,
            "created_utc": 1587056050.0,
            "replies": [
                {
                    "body": "It's not toxic to suggest somebody with a reeceding hairline to shave it off.\n\nIt's an opinion, and if you don't agree, I'm sure somebody else will have another suggestion.",
                    "author": "Dreviore",
                    "id": "fnlqnm8",
                    "parent_id": "t1_fnlmhhm",
                    "score": -5,
                    "created_utc": 1587058057.0,
                    "replies": [
                        {
                            "body": "My problem with this is that the same advice is given to everyone. It's like some are trying to get everyone to join this ficticous man club, where all you have to do is shave your head. I have no choice in the matter, because I can't grow hair up top, but I still find it annoying.",
                            "author": "rogun64",
                            "id": "fnnaqam",
                            "parent_id": "t1_fnlqnm8",
                            "score": 2,
                            "created_utc": 1587088133.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hey. Where are the links to the comments you're talking about?",
            "author": null,
            "id": "fnmbi1a",
            "parent_id": "t1_fnlmbou",
            "score": 2,
            "created_utc": 1587068449.0,
            "replies": []
        },
        {
            "body": "Neither of you should be making stupid claims like that. Ridiculous.",
            "author": null,
            "id": "fnmdqyt",
            "parent_id": "t1_fnm8yxa",
            "score": 1,
            "created_utc": 1587069597.0,
            "replies": []
        },
        {
            "body": "😂",
            "author": "learning_skincare",
            "id": "fnmmjuc",
            "parent_id": "t1_fnmi7es",
            "score": 1,
            "created_utc": 1587074141.0,
            "replies": []
        },
        {
            "body": "Being told your hair line is receeding is not toxic.",
            "author": "Dreviore",
            "id": "fnlqch3",
            "parent_id": "t1_fnlptyh",
            "score": 5,
            "created_utc": 1587057904.0,
            "replies": [
                {
                    "body": "It is when you relish shitting on people about it.",
                    "author": "JackFoxEsq",
                    "id": "fnnpbni",
                    "parent_id": "t1_fnlqch3",
                    "score": 3,
                    "created_utc": 1587097949.0,
                    "replies": []
                },
                {
                    "body": ">Nobody said you had to like or value the advice being given to you      \n     \n>>don't try to act like a victim because you don't like it.    \n    \n>>>Don't put yourself out there and stay in your shell.         \n        \nThose are tell tale signs of someone that isn't trying to give advice, just trying to attack people as if you're doing them a favor.       \n         \nIf they ask for advice, and you don't have actual advice to give, just stay quiet. Giving the same generic advice that a bot could easily give is not, by the way.       \n     \nDon't try to act like a victim, all offended because people are telling you your comments are not good enough. If you don't want people to have an opinion on them, you are allowed to close your pie hole and let the adults talk, ok?",
                    "author": "Lucifer_Hirsch",
                    "id": "fnlsen4",
                    "parent_id": "t1_fnlqch3",
                    "score": 2,
                    "created_utc": 1587058914.0,
                    "replies": [
                        {
                            "body": "Adults can take criticism and don't ask for advice if they're afraid of receiving any so that's a moot argument.",
                            "author": "Dreviore",
                            "id": "fnlwexv",
                            "parent_id": "t1_fnlsen4",
                            "score": 3,
                            "created_utc": 1587060909.0,
                            "replies": [
                                {
                                    "body": "taking criticism doesn't mean taking any criticism. if a 5 year old comes to you and call you baldy, you won't sit there and think \"oh, what good advice, I may think about changing my hairstyle.\" you're going to roll your eyes and keep going.         \n        \nof course, that's a bit different when it's an adult having the same attitude.",
                                    "author": "Lucifer_Hirsch",
                                    "id": "fnlxv92",
                                    "parent_id": "t1_fnlwexv",
                                    "score": 1,
                                    "created_utc": 1587061633.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's not toxic to suggest somebody with a reeceding hairline to shave it off.\n\nIt's an opinion, and if you don't agree, I'm sure somebody else will have another suggestion.",
            "author": "Dreviore",
            "id": "fnlqnm8",
            "parent_id": "t1_fnlmhhm",
            "score": -5,
            "created_utc": 1587058057.0,
            "replies": [
                {
                    "body": "My problem with this is that the same advice is given to everyone. It's like some are trying to get everyone to join this ficticous man club, where all you have to do is shave your head. I have no choice in the matter, because I can't grow hair up top, but I still find it annoying.",
                    "author": "rogun64",
                    "id": "fnnaqam",
                    "parent_id": "t1_fnlqnm8",
                    "score": 2,
                    "created_utc": 1587088133.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It is when you relish shitting on people about it.",
            "author": "JackFoxEsq",
            "id": "fnnpbni",
            "parent_id": "t1_fnlqch3",
            "score": 3,
            "created_utc": 1587097949.0,
            "replies": []
        },
        {
            "body": ">Nobody said you had to like or value the advice being given to you      \n     \n>>don't try to act like a victim because you don't like it.    \n    \n>>>Don't put yourself out there and stay in your shell.         \n        \nThose are tell tale signs of someone that isn't trying to give advice, just trying to attack people as if you're doing them a favor.       \n         \nIf they ask for advice, and you don't have actual advice to give, just stay quiet. Giving the same generic advice that a bot could easily give is not, by the way.       \n     \nDon't try to act like a victim, all offended because people are telling you your comments are not good enough. If you don't want people to have an opinion on them, you are allowed to close your pie hole and let the adults talk, ok?",
            "author": "Lucifer_Hirsch",
            "id": "fnlsen4",
            "parent_id": "t1_fnlqch3",
            "score": 2,
            "created_utc": 1587058914.0,
            "replies": [
                {
                    "body": "Adults can take criticism and don't ask for advice if they're afraid of receiving any so that's a moot argument.",
                    "author": "Dreviore",
                    "id": "fnlwexv",
                    "parent_id": "t1_fnlsen4",
                    "score": 3,
                    "created_utc": 1587060909.0,
                    "replies": [
                        {
                            "body": "taking criticism doesn't mean taking any criticism. if a 5 year old comes to you and call you baldy, you won't sit there and think \"oh, what good advice, I may think about changing my hairstyle.\" you're going to roll your eyes and keep going.         \n        \nof course, that's a bit different when it's an adult having the same attitude.",
                            "author": "Lucifer_Hirsch",
                            "id": "fnlxv92",
                            "parent_id": "t1_fnlwexv",
                            "score": 1,
                            "created_utc": 1587061633.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My problem with this is that the same advice is given to everyone. It's like some are trying to get everyone to join this ficticous man club, where all you have to do is shave your head. I have no choice in the matter, because I can't grow hair up top, but I still find it annoying.",
            "author": "rogun64",
            "id": "fnnaqam",
            "parent_id": "t1_fnlqnm8",
            "score": 2,
            "created_utc": 1587088133.0,
            "replies": []
        },
        {
            "body": "Adults can take criticism and don't ask for advice if they're afraid of receiving any so that's a moot argument.",
            "author": "Dreviore",
            "id": "fnlwexv",
            "parent_id": "t1_fnlsen4",
            "score": 3,
            "created_utc": 1587060909.0,
            "replies": [
                {
                    "body": "taking criticism doesn't mean taking any criticism. if a 5 year old comes to you and call you baldy, you won't sit there and think \"oh, what good advice, I may think about changing my hairstyle.\" you're going to roll your eyes and keep going.         \n        \nof course, that's a bit different when it's an adult having the same attitude.",
                    "author": "Lucifer_Hirsch",
                    "id": "fnlxv92",
                    "parent_id": "t1_fnlwexv",
                    "score": 1,
                    "created_utc": 1587061633.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "taking criticism doesn't mean taking any criticism. if a 5 year old comes to you and call you baldy, you won't sit there and think \"oh, what good advice, I may think about changing my hairstyle.\" you're going to roll your eyes and keep going.         \n        \nof course, that's a bit different when it's an adult having the same attitude.",
            "author": "Lucifer_Hirsch",
            "id": "fnlxv92",
            "parent_id": "t1_fnlwexv",
            "score": 1,
            "created_utc": 1587061633.0,
            "replies": []
        }
    ]
}