{
    "title": "Date Etiquette",
    "post_id": "a0wuum",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/a0wuum/date_etiquette/",
    "author": "milliondollarkitty",
    "body": "We’ve all had bad dates.  Sometimes they’re funny, sometimes they’re downright horrible.  I’ve seen many a post from SDs talking about a cringe worthy meet and greet with an SB.  I’ve also seen more than a few “first meet and greet tomorrow, what do I do?!” posts from the SB side.  So I figured hey, why the hell not spice up the feed and drop some knowledge.\n\n\n-BE ON TIME. Best case scenario, be a few minutes early.  It shows that you’re organized and have yourself together.  Being late is rude and shows you probably don’t take this very seriously.  \n\n-Make sure you smile.  Smiling make you seem much more friendly and approachable.  People like people who make them feel good.  Work on an inviting demeanor. \n\n-Don’t be on your phone.  Just don’t do it.  Easiest thing to do is just put it away.  You don’t want to seem distracted and being glued to your phone is going to make them feel like they need to compete for your attention, which is no fun.\n\n-Walk with confidence.  Make sure you sit with good posture.  Being all slouched over is not cute.\n\n-Keep your elbows off the table.  Napkin on your lap.  Come on now.  \n\n-Up your vocabulary.  Within reason, obviously.  Stay away from r/iamverysmart levels.  Try not to use a bunch of slang.  Stay away from cursing until you know how it will be received.  I love the word fuck as much as the next person but I’m probably not going to drop it until I know he don’t clutch his pearls in horror.  \n\n-Eat slowly and chew with your mouth closed.  Don’t talk with your mouth full.  Basic manners.\n\n-Make sure you’re well groomed.  Your hair should be brushed and styled.  Put some effort into your makeup and outfit.  Dates are not the time to show up in leggings and a t shirt.  Keep your nails clean and maintained!  So gross how many people I’ve seen with dirt under their nails.  I get a mani/pedi regularly, but that’s not completely necessary.  Just make sure they’re trimmed and neat.  \n\n-This goes without saying, but the way you look matters.  You don’t need to break the bank on outfits if you don’t want to, but you should invest in classic pieces that go with everything and that you can get a lot of use out of.  Make sure it’s clean and well fitted.  Dress appropriately for the venue and the weather.  Don’t show off way too much skin. \n\n-Don’t get super drunk.  Sloppy behavior is never cute.  It is not safe and can impair your decision making and Impulse control.  It’s trashy and it’s embarrassing to you and your date.   Nothing says discreet like a belligerent date.  \n\n-Be gracious. Ask questions.  Be engaging.  Be mature.  Remember, you want to convince this person that you’re worth investing in/spending time with.\n\n-Try to make a point to talk less about yourself. Ask questions, people love to talk about themselves.  Be engaging and don’t interrupt. Share things that you’re interested in as well.\n\n-Don’t be negative.  No one likes people who are gossipy or rude to other people.  No one likes people who make them feel bad.\n\n-Try to stay up on current events, at the very least it gives you something to talk about.  Read more and stay informed.  \n\n-Look people in the eyes when speaking/being spoken to.  Confidence is so key.  People can pick up on insecurity and it can make you an easy target.  If you aren’t naturally confident, fake it til you make it.  It eventually becomes habit.  Sugaring has made me so much more confident and for that I’m grateful.  \n\n\nThree cheers to being more civilized 🎉\n\nEdit: if anything else has anything want to add to this, feel free.  What are your pet peeves that seem so obvious yet a lot of people fail to grasp?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/a0wuum/date_etiquette/",
    "score": 130,
    "upvote_ratio": 0.94,
    "created_utc": 1543338966.0,
    "num_comments": 58,
    "links": [
        [
            "/r/iamverysmart"
        ]
    ],
    "comments": [
        {
            "body": "I would add an addendum to the \"leave your phone alone\" rule-- it's prudent when agreeing to a meet and greet to have someone you trust who knows where you are, and a quick \"made it to location, POT seems nice and matches description, expect another check in around x time\". otherwise the phone should be put away. \n\nmost people are super respectful about that, but if anyone ever accuses you of being rude or addicted to your phone because of a brief, reasonable precaution, they are telling you a LOT about what kind of dynamic you can expect with them. \n\nthis should be obvious, but the power dynamic and drive to please on a date can make things fuzzy for some, my younger self included. ",
            "author": "yikesmysexlife",
            "id": "ealqmms",
            "parent_id": "t3_a0wuum",
            "score": 24,
            "created_utc": 1543359579.0,
            "replies": [
                {
                    "body": "Yeah I agree, this is a really good idea safety wise.",
                    "author": "milliondollarkitty",
                    "id": "ealqya1",
                    "parent_id": "t1_ealqmms",
                    "score": 8,
                    "created_utc": 1543359840.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good tips u/milliondollarkitty! \n\nA couple of things to add. \n\n- Ask questions and be engaged! This is a *date* and you want to know if you’re compatible. Are you both going to like the same foods, enjoy travel to the same destinations, enjoy talking about the same TV shows (or not), etc. - don’t let the conversation be one-sided.\n\n- If you like the girl or guy then be flirty! Giggle, laugh, compliment their hair or smile (don’t be fucking creepy). Girls, you can lightly brush their arm if the situation is going well (also don’t be creepy) to show interest",
            "author": "seekingsweetsugar",
            "id": "eakz6vt",
            "parent_id": "t3_a0wuum",
            "score": 27,
            "created_utc": 1543339500.0,
            "replies": []
        },
        {
            "body": "Good post. As a SD who has had over 50 M&g in 5 years, my top 5:\n\n\\- Please show up on time.  \n\\- Leave your phone alone.   \n\\- Be genuinely interested.   \n\\- Be clear what what you are looking for in a SR. (this is a problem in my country which is socially   \n  conservative).  \n\\- Be comfortable. I ask POTs if they would be OK with the M&G location, after which I do expect that   \n   they would dress appropriately and not be overwhelmed by their surroundings. ",
            "author": "Dean_46",
            "id": "eam9hvs",
            "parent_id": "t3_a0wuum",
            "score": 11,
            "created_utc": 1543376289.0,
            "replies": []
        },
        {
            "body": "Agree with all of the above - adding one last thing on advice for ‘being a classy lady’ my Granma told me. \n\nBlot your lipstick! It’s apparently ‘unbecoming’ to leave a lipstick/gloss mark on glasses/mugs. And certainly not ideal to leave it accidentally on a shirt/cheek. \n\nApply, blot, apply, blot, apply, blot yet again. I also use ‘Lipcote’ for good measure. ",
            "author": "siderealx",
            "id": "ean0jdt",
            "parent_id": "t3_a0wuum",
            "score": 7,
            "created_utc": 1543413602.0,
            "replies": []
        },
        {
            "body": ">until I know he don’t clutch his pearls in horror.\n\nThis made me smile.  I've heard this phrase a number of times in the UK but had no idea that it was actually used in the USA as well.\n\n(I presume that you're American?)",
            "author": null,
            "id": "eal5pta",
            "parent_id": "t3_a0wuum",
            "score": 11,
            "created_utc": 1543344161.0,
            "replies": [
                {
                    "body": "Haha yes I am American.  ",
                    "author": "milliondollarkitty",
                    "id": "eal9khx",
                    "parent_id": "t1_eal5pta",
                    "score": 5,
                    "created_utc": 1543346816.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well said. The sloppy drunk thing is something that's happened to me (by SBs) before. Had a great m&g with a lady. And that led to a nice dinner date--except that she was packing back the drinks. So that when we got back to the room with the notion we MIGHT get intimate, she starts projectile vomiting everywhere. I, of course, let her stay the night (with me on the couch), but that pretty well killed any going forward with an SR.",
            "author": "OlderSD",
            "id": "ealkf7c",
            "parent_id": "t3_a0wuum",
            "score": 4,
            "created_utc": 1543354727.0,
            "replies": [
                {
                    "body": "Nervous energy?  Hope this was not a cause to the end.",
                    "author": "rogerthatonce",
                    "id": "ealyig9",
                    "parent_id": "t1_ealkf7c",
                    "score": 3,
                    "created_utc": 1543366441.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'd give this more than one up vote if I could. Some of these seem so obvious, yet people still fail at them. Great advice all around (and not just for SBs)!",
            "author": "Cledaddy23",
            "id": "eakz0fj",
            "parent_id": "t3_a0wuum",
            "score": 13,
            "created_utc": 1543339361.0,
            "replies": []
        },
        {
            "body": "Well said! The only thing I struggle with slightly is interrupting. I've been making a concious effort to catch myself and listen more.  These tips are useful beyond sugar, especially for career oriented gals! ",
            "author": "AzucaritaSB",
            "id": "eal277k",
            "parent_id": "t3_a0wuum",
            "score": 9,
            "created_utc": 1543341686.0,
            "replies": [
                {
                    "body": "I’m the same way.  I also feel like I have a problem where someone tells me something and I want to try to relate to them so I tell them about something similar that happened to me.  I’m conscious to try to make sure it doesn’t seem like I’m trying to one up them or divert the conversation back to myself.  ",
                    "author": "milliondollarkitty",
                    "id": "eal2odq",
                    "parent_id": "t1_eal277k",
                    "score": 14,
                    "created_utc": 1543342016.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eal3sro",
                            "parent_id": "t1_eal2odq",
                            "score": 12,
                            "created_utc": 1543342798.0,
                            "replies": [
                                {
                                    "body": "This is a tricky one, because I think the other person probably wants to know something about you too, so sometimes a story that relates to their story is great.",
                                    "author": "JustAnotherBurner2",
                                    "id": "eamddvw",
                                    "parent_id": "t1_eal3sro",
                                    "score": 2,
                                    "created_utc": 1543380195.0,
                                    "replies": [
                                        {
                                            "body": "I see such mixed advice on this on SLF! \n\n“Help him escape his life, work, relationship — he *wants* to hear about you. You’re younger, you can teach him about [insert anything “millennial” here].”\n\nVs\n\n“Make him feel like the most interesting man by asking mostly about him, hang on what he says, compliment him profusely. Never interrupt! Let him direct questions to you. Don’t interject.”\n\nSigh. What feels natural to me is to chime in and relate like so many of y’all said. ",
                                            "author": "ilovecookies86",
                                            "id": "eapcs3f",
                                            "parent_id": "t1_eamddvw",
                                            "score": 4,
                                            "created_utc": 1543479340.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "If this isn't me then I don't know what is!!",
                            "author": "ohsweetsugar",
                            "id": "eam6i0o",
                            "parent_id": "t1_eal2odq",
                            "score": 3,
                            "created_utc": 1543373572.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Same! Especially when I'm with someone a POT likes talking about himself. I have to remind myself not to interject until it's appropriate. ",
                    "author": "sb105",
                    "id": "eal4g2k",
                    "parent_id": "t1_eal277k",
                    "score": 2,
                    "created_utc": 1543343248.0,
                    "replies": []
                },
                {
                    "body": "In general, more lately I have realized that I interject too often with questions.....almost like a need a certain picture or clarity in my mind (probably just an age thing).",
                    "author": "rogerthatonce",
                    "id": "ealx6zw",
                    "parent_id": "t1_eal277k",
                    "score": 2,
                    "created_utc": 1543365236.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is a great post. Please don’t show up looking like well, like it’s obvious why we’re meeting. If possible we want it to appear that we are on a work meeting. ",
            "author": "Texas_Rangers",
            "id": "ealt235",
            "parent_id": "t3_a0wuum",
            "score": 3,
            "created_utc": 1543361599.0,
            "replies": []
        },
        {
            "body": "The only thing to add is feel free to politely end the date if the other party is not the right fit or makes you uncomfortable. ",
            "author": null,
            "id": "eal1bt7",
            "parent_id": "t3_a0wuum",
            "score": 8,
            "created_utc": 1543341067.0,
            "replies": [
                {
                    "body": "> feel free to politely end the date\n\nWell, fuckin A asshat, I'm outta here!",
                    "author": "GSSD",
                    "id": "ealgvu6",
                    "parent_id": "t1_eal1bt7",
                    "score": 5,
                    "created_utc": 1543352096.0,
                    "replies": [
                        {
                            "body": "Business meeting or family emergency.",
                            "author": null,
                            "id": "ealq8cq",
                            "parent_id": "t1_ealgvu6",
                            "score": 2,
                            "created_utc": 1543359268.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "What would be something polite to say to end it? ",
                    "author": "AzucaritaSB",
                    "id": "ealar1r",
                    "parent_id": "t1_eal1bt7",
                    "score": 3,
                    "created_utc": 1543347658.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eamejk4",
                            "parent_id": "t1_ealar1r",
                            "score": 11,
                            "created_utc": 1543381471.0,
                            "replies": [
                                {
                                    "body": "That’s exactly what I do. “You seem like a wonderful person, and you’re beautiful, but I’m not feeling the chemistry.  I’m so sorry about that but I feel like it’s better to just say it.”\n\nAfter a minute or two give her $100 and say “I just wanted to thank you for taking the trouble to meet “",
                                    "author": null,
                                    "id": "eav62rn",
                                    "parent_id": "t1_eamejk4",
                                    "score": 3,
                                    "created_utc": 1543686439.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Take my up vote! \n\nAlthough I don't think us SDs clutch our pearls? :P\n\n\nAgreed with everything. Although trust me, as a straight man I personally don't mind if a date shows up in yoga pants or leggings... especially if at a more casual place. But yes, at least be clean and not sloppy looking. ",
            "author": "BigBearSD",
            "id": "eal033c",
            "parent_id": "t3_a0wuum",
            "score": 5,
            "created_utc": 1543340183.0,
            "replies": [
                {
                    "body": ">as a straight man I personally don't mind if a date shows up in yoga pants or leggings...\n\nSeconded, thirded, and zillionth'ed :)  I've only had a few SBs show up in leggings, but in those cases they pulled it off -- they did not look thrown-together or like they were going to work out.  One was wearing leggings, boots, nice top, the whole outfit looked pulled together and sexy.  I think \"no leggings\" is a good general rule, maybe not everyone can pull off \"leggings as part of an outfit where it works in a nice bar\"",
                    "author": "Azurecole",
                    "id": "eal24pt",
                    "parent_id": "t1_eal033c",
                    "score": 6,
                    "created_utc": 1543341637.0,
                    "replies": [
                        {
                            "body": "Agreed. Like if you can pull it off, they are a nice pair, and part of an outfit etc... I am all for it!\n\nI mean I like the more elegant and classy look too, and especially love dresses. However, leggings if done right can look great! \n",
                            "author": "BigBearSD",
                            "id": "eal2a5y",
                            "parent_id": "t1_eal24pt",
                            "score": 2,
                            "created_utc": 1543341742.0,
                            "replies": []
                        },
                        {
                            "body": "> Seconded, thirded, and zillionth'ed\n\nI had a date ask once what I wanted her to wear, and I said \"yoga pants and a t-shirt?\" She did and looked great. ",
                            "author": "JustAnotherBurner2",
                            "id": "eamdog4",
                            "parent_id": "t1_eal24pt",
                            "score": 1,
                            "created_utc": 1543380511.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eal217k",
            "parent_id": "t3_a0wuum",
            "score": 8,
            "created_utc": 1543341571.0,
            "replies": [
                {
                    "body": "> Phone etiquette\n\nAll communication by phone should be at the table and the purpose announced to her date.  \"Oh, it's my sitter,do you mind?\" or \" My GF is checking on me\" . Unexplained mad texting is rude and the date will assume that you are making your M&G appointment with POT #2 ",
                    "author": "GSSD",
                    "id": "ealhqly",
                    "parent_id": "t1_eal217k",
                    "score": 5,
                    "created_utc": 1543352716.0,
                    "replies": [
                        {
                            "body": "I do agree that if an emergency has arisen in the past, I’ve clearly stated/asked if I can take a call. But my point wasn’t for emergencies. It was (vaguely) stating that it’s fair to peek at your phone in the bathroom while you freshen up before leaving, pee, etc. ",
                            "author": "3rdDeviationxo",
                            "id": "ealk3qu",
                            "parent_id": "t1_ealhqly",
                            "score": 4,
                            "created_utc": 1543354487.0,
                            "replies": [
                                {
                                    "body": "Plus he’s most likely going to be checking his phone while SB is in the bathroom , not a big deal . I would always be safe and bring my purse to the bathroom just because I wouldn’t want to leave it with someone I just met . ",
                                    "author": "mismeah",
                                    "id": "ealtqpq",
                                    "parent_id": "t1_ealk3qu",
                                    "score": 3,
                                    "created_utc": 1543362183.0,
                                    "replies": [
                                        {
                                            "body": "Exactly. A little pointless to reply to each “what-if” scenario when it comes to checking phones. ",
                                            "author": "3rdDeviationxo",
                                            "id": "ealvlow",
                                            "parent_id": "t1_ealtqpq",
                                            "score": 3,
                                            "created_utc": 1543363803.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> Phone etiquette: if you must check your phone, do it in the bathroom. Or do it while they take that important work call.\n\nI'm not amused when the potential SB excuses herself to use the bathroom and then takes her phone with her. Obviously she wants privacy for a call text or emails, or just checking SA to see if there are any more fish on the line.  ",
                    "author": "pinotandsugar",
                    "id": "eal3dui",
                    "parent_id": "t1_eal217k",
                    "score": -6,
                    "created_utc": 1543342509.0,
                    "replies": [
                        {
                            "body": "What is she supposed to do? Leave her phone on the table/ in her bag with a stranger while she goes to the bathroom?\n\nWhy would you assume that she's checking SA in the bathroom, that's a rather odd conclusion to reach unless you're on there too while she's there and see her.",
                            "author": "sb105",
                            "id": "eal4c50",
                            "parent_id": "t1_eal3dui",
                            "score": 12,
                            "created_utc": 1543343173.0,
                            "replies": [
                                {
                                    "body": "It does not matter if she is checking SA or sales at her favorite store.  Unless it is a family emergency or similar she should not be on her phone or texting (other than to let her gf know she is fine)   \n\"I'm letting my girlfriend know I am having a wonderful time, she made me promise to check in\"  \n\nYou stopped at Starbucks on the way to class and are halfway through giving you order and the barista holds up a finger as she takes a personal call......  you are waiting while she is giggling   and waiting   5 minutes later she looks at you to finish your order like nothing has happened.  .....  most likely you would be looking for the door or the manager and wondering how someone could be so rude.  It is no different at a M&G.  \n\n  \n\n\n\n\n\n",
                                    "author": "pinotandsugar",
                                    "id": "eal5mug",
                                    "parent_id": "t1_eal4c50",
                                    "score": -7,
                                    "created_utc": 1543344103.0,
                                    "replies": [
                                        {
                                            "body": "What? You were talking about her taking her phone to the toilet with her being a faux pas. That is what we are disagreeing with.",
                                            "author": "sb105",
                                            "id": "eal6bfc",
                                            "parent_id": "t1_eal5mug",
                                            "score": 9,
                                            "created_utc": 1543344584.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I usually take my purse into the bathroom with me, so I can freshen up generally. Phone is in purse.",
                            "author": "MASugarBaby",
                            "id": "eal3ytw",
                            "parent_id": "t1_eal3dui",
                            "score": 11,
                            "created_utc": 1543342915.0,
                            "replies": []
                        },
                        {
                            "body": "I assume you make an exception for those that have young children (not me, but I remember those days...).",
                            "author": null,
                            "id": "eal3lzx",
                            "parent_id": "t1_eal3dui",
                            "score": 3,
                            "created_utc": 1543342668.0,
                            "replies": [
                                {
                                    "body": "I politely let my date know I’ll check in with my sitter 1-2 times via text message while together. I make it super brief and leave it at that.\n\nI also set a ringer that rings through silent on my phone for my Nanny so if it’s an emergency I’ll know to answer. \n\nSo far I’ve never had anyone be offended by this. Most of the men I date specifically are interested because I’m a Mom.",
                                    "author": "Sugartits333",
                                    "id": "ealfmxj",
                                    "parent_id": "t1_eal3lzx",
                                    "score": 6,
                                    "created_utc": 1543351244.0,
                                    "replies": [
                                        {
                                            "body": "> I politely let my date know I’ll check in with my sitter 1-2 times via text message while together.\n\nAs a dad I would find this charming. ",
                                            "author": "JustAnotherBurner2",
                                            "id": "eamdiy1",
                                            "parent_id": "t1_ealfmxj",
                                            "score": 4,
                                            "created_utc": 1543380345.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I always tell a new date that since my kiddo is with childcare, I'll need to check my phone occasionally.  It simply it what it is.",
                                    "author": null,
                                    "id": "eal6iah",
                                    "parent_id": "t1_eal3lzx",
                                    "score": 5,
                                    "created_utc": 1543344714.0,
                                    "replies": []
                                },
                                {
                                    "body": "Of course   Good mothers are usually great sb",
                                    "author": "pinotandsugar",
                                    "id": "ealefj2",
                                    "parent_id": "t1_eal3lzx",
                                    "score": 1,
                                    "created_utc": 1543350406.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I actually expect a new SB to have to check in with their wingperson at some point, so it doesn't bother me.  Thinking they're hiding their phone in their lap and looking like they're contemplating their navel through dinner is far more annoying!",
                            "author": null,
                            "id": "eal6ek9",
                            "parent_id": "t1_eal3dui",
                            "score": 6,
                            "created_utc": 1543344644.0,
                            "replies": [
                                {
                                    "body": "I think the checking with friend is a positive .....  and just be open.....  I promised I would text my girlfriend.....  I'm telling her I am having a wonderful time ",
                                    "author": "pinotandsugar",
                                    "id": "ealaanl",
                                    "parent_id": "t1_eal6ek9",
                                    "score": 1,
                                    "created_utc": 1543347326.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I usually get up to use the bathroom, typically towards the end. Gotta pee before the drive home (city traffic). I’ll take my purse, where my phone has been the entire time. I’ll leave my coat or something behind though so there’s no inkling that I’m just walking out.\n\nNever been a big deal. ",
                            "author": "3rdDeviationxo",
                            "id": "eal3moq",
                            "parent_id": "t1_eal3dui",
                            "score": 7,
                            "created_utc": 1543342681.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is perfect! As obvious as some of the tips are, they still need to be said. Thanks for the well-thought and articulate post.",
            "author": "youremybutterflysb",
            "id": "eal9skk",
            "parent_id": "t3_a0wuum",
            "score": 2,
            "created_utc": 1543346970.0,
            "replies": []
        },
        {
            "body": "Great advice, as I expect from a milliondollarkitty thread!  One that I'd like to poke at to see how it holds up:\n\n>\\-Try to make a point to talk less about yourself. Ask questions, people love to talk about themselves.\n\n\"People love to talk about themselves\" is one of those common wisdoms that, IME, is not true, for a whole lot of people ... at least when it comes to interacting with strangers.  I don't love talking about myself to strangers.  Don't get me wrong, our conversation at the M&G will be fun and interactive with lots of laughing and great stories (at least ideally), and I'm sure you'll learn plenty about me through that, but very little of the type of conversation that's evoked when someone hears \"ask questions, people love to talk about themselves\" ... with a stranger, I'm not interested in a more one-way conversation where I do most of the talking for most of the time, like talking about my family, or my career path, or going through a list of my hobbies.  By contrast, I enjoy if she talks about herself, as long as it doesn't get to the point where it's self-indulgent.  Most of my M&G conversation is highly interactive (you'll learn a lot about me through that), and in addition she can talk about herself as much as she wants, and I will talk about myself not as much.  I don't think I'm terribly unique in that.\n\nSo, if your date is engaged and animated when you talk about yourself, but quickly turns the conversation back around when you ask \"and tell me all about your job\", no reason to keep pressing, you're doing fine.   Even with my long-term SB, beyond  interactive conversation, she talks about herself a lot, I talk about myself a little, and we both love it that way.",
            "author": "Azurecole",
            "id": "ealfa8p",
            "parent_id": "t3_a0wuum",
            "score": 2,
            "created_utc": 1543351001.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eal5tbj",
            "parent_id": "t3_a0wuum",
            "score": 3,
            "created_utc": 1543344230.0,
            "replies": [
                {
                    "body": "I assume this post is about M&G, not generally dating in SR's. I bring my phone out every now and then on dates to Google things were having a conversation about or I might reply to friends while he's getting drinks but on a M&G, it's staying in my bag. \n\nBetter safe than sorry since you don't know whether the person will take offense or be chill about it. ",
                    "author": "blonde-throwaway",
                    "id": "eal683n",
                    "parent_id": "t1_eal5tbj",
                    "score": 1,
                    "created_utc": 1543344518.0,
                    "replies": []
                },
                {
                    "body": "> Am I the only guy who doesn't care if someone takes their phone out and text? \n\nProbably",
                    "author": "GSSD",
                    "id": "ealgzbm",
                    "parent_id": "t1_eal5tbj",
                    "score": 1,
                    "created_utc": 1543352164.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What if you don’t know how to do your own makeup?",
            "author": null,
            "id": "eamljcz",
            "parent_id": "t3_a0wuum",
            "score": 1,
            "created_utc": 1543391272.0,
            "replies": [
                {
                    "body": "I don’t know anyone who has zero idea how to do their own makeup.  And if some how they don’t know how to do makeup, it would be because they never wear it.  So it wouldn’t matter anyways.",
                    "author": "milliondollarkitty",
                    "id": "eamlodo",
                    "parent_id": "t1_eamljcz",
                    "score": 6,
                    "created_utc": 1543391509.0,
                    "replies": []
                },
                {
                    "body": "Do you have to wear any? I hate the feeling and process. But I am a skincare nut for that reason. \n\nA good q, I suppose. Does makeup matter? If so, why do SDs like it?\n\nIt leaves a mess on linens. \nYou can’t just fall asleep casually. \nIt sometimes looks like, well, makeup. ",
                    "author": "ilovecookies86",
                    "id": "eapd11j",
                    "parent_id": "t1_eamljcz",
                    "score": 1,
                    "created_utc": 1543479652.0,
                    "replies": [
                        {
                            "body": "I for one am not a fan of makeup and on some occasions, before the date, mention it casually, not telling them what to do but letting them know my preferences and that they shouldn’t worry about taking an excessive amount of time to get ready. I’m more likely to say this to someone who doesn’t have tons on in pics but who seems like they are inclined to try hard to impress.",
                            "author": null,
                            "id": "eaylyio",
                            "parent_id": "t1_eapd11j",
                            "score": 1,
                            "created_utc": 1543791700.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have no issue with casual dress (preferred).\n\nI am not a fan of women who carry large purses or bags.  It just seems like an organization or high(er) maintenance issue.  Suitcases are very problematic....lmao!",
            "author": "rogerthatonce",
            "id": "ealz248",
            "parent_id": "t3_a0wuum",
            "score": 0,
            "created_utc": 1543366935.0,
            "replies": []
        },
        {
            "body": "A million dollars of purr fect  advice.......\n\nUse touch selectively, appropriately and effectively.  It's a very situational thing but a simple touch on the arm is a great way to warm up a good conversation..... obviously to be avoided if you are just counting the minutes until you can leave without a scene. \n\nMaintain situational awareness,  is the SD nervous about being here with this beautiful, much younger woman  or is he very comfortable with you in these surroundings.  ",
            "author": "pinotandsugar",
            "id": "eal22xp",
            "parent_id": "t3_a0wuum",
            "score": -1,
            "created_utc": 1543341604.0,
            "replies": [
                {
                    "body": "> A million dollars of purr fect advice.......\n\nThat sounds almost like a quote from Bruno Tonioli.\n\nAre you perhaps channelling your inner Dance With the Stars persona?\n\n(just meant as a joke)",
                    "author": null,
                    "id": "eal5chw",
                    "parent_id": "t1_eal22xp",
                    "score": 1,
                    "created_utc": 1543343899.0,
                    "replies": [
                        {
                            "body": "I'm one of the few who has never watched the program......",
                            "author": "pinotandsugar",
                            "id": "eal5rtq",
                            "parent_id": "t1_eal5chw",
                            "score": 2,
                            "created_utc": 1543344202.0,
                            "replies": [
                                {
                                    "body": "Stars dance and well yeah.",
                                    "author": "rogerthatonce",
                                    "id": "ealyusl",
                                    "parent_id": "t1_eal5rtq",
                                    "score": 1,
                                    "created_utc": 1543366751.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "+100 mdkitty\n\nIt is sad but true that young ladies need prompting about these self evident things.",
            "author": "GSSD",
            "id": "ealns9p",
            "parent_id": "t3_a0wuum",
            "score": -2,
            "created_utc": 1543357326.0,
            "replies": []
        },
        {
            "body": "Yeah I agree, this is a really good idea safety wise.",
            "author": "milliondollarkitty",
            "id": "ealqya1",
            "parent_id": "t1_ealqmms",
            "score": 8,
            "created_utc": 1543359840.0,
            "replies": []
        },
        {
            "body": "Haha yes I am American.  ",
            "author": "milliondollarkitty",
            "id": "eal9khx",
            "parent_id": "t1_eal5pta",
            "score": 5,
            "created_utc": 1543346816.0,
            "replies": []
        },
        {
            "body": "Nervous energy?  Hope this was not a cause to the end.",
            "author": "rogerthatonce",
            "id": "ealyig9",
            "parent_id": "t1_ealkf7c",
            "score": 3,
            "created_utc": 1543366441.0,
            "replies": []
        },
        {
            "body": "I’m the same way.  I also feel like I have a problem where someone tells me something and I want to try to relate to them so I tell them about something similar that happened to me.  I’m conscious to try to make sure it doesn’t seem like I’m trying to one up them or divert the conversation back to myself.  ",
            "author": "milliondollarkitty",
            "id": "eal2odq",
            "parent_id": "t1_eal277k",
            "score": 14,
            "created_utc": 1543342016.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eal3sro",
                    "parent_id": "t1_eal2odq",
                    "score": 12,
                    "created_utc": 1543342798.0,
                    "replies": [
                        {
                            "body": "This is a tricky one, because I think the other person probably wants to know something about you too, so sometimes a story that relates to their story is great.",
                            "author": "JustAnotherBurner2",
                            "id": "eamddvw",
                            "parent_id": "t1_eal3sro",
                            "score": 2,
                            "created_utc": 1543380195.0,
                            "replies": [
                                {
                                    "body": "I see such mixed advice on this on SLF! \n\n“Help him escape his life, work, relationship — he *wants* to hear about you. You’re younger, you can teach him about [insert anything “millennial” here].”\n\nVs\n\n“Make him feel like the most interesting man by asking mostly about him, hang on what he says, compliment him profusely. Never interrupt! Let him direct questions to you. Don’t interject.”\n\nSigh. What feels natural to me is to chime in and relate like so many of y’all said. ",
                                    "author": "ilovecookies86",
                                    "id": "eapcs3f",
                                    "parent_id": "t1_eamddvw",
                                    "score": 4,
                                    "created_utc": 1543479340.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "If this isn't me then I don't know what is!!",
                    "author": "ohsweetsugar",
                    "id": "eam6i0o",
                    "parent_id": "t1_eal2odq",
                    "score": 3,
                    "created_utc": 1543373572.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Same! Especially when I'm with someone a POT likes talking about himself. I have to remind myself not to interject until it's appropriate. ",
            "author": "sb105",
            "id": "eal4g2k",
            "parent_id": "t1_eal277k",
            "score": 2,
            "created_utc": 1543343248.0,
            "replies": []
        },
        {
            "body": "In general, more lately I have realized that I interject too often with questions.....almost like a need a certain picture or clarity in my mind (probably just an age thing).",
            "author": "rogerthatonce",
            "id": "ealx6zw",
            "parent_id": "t1_eal277k",
            "score": 2,
            "created_utc": 1543365236.0,
            "replies": []
        },
        {
            "body": "> feel free to politely end the date\n\nWell, fuckin A asshat, I'm outta here!",
            "author": "GSSD",
            "id": "ealgvu6",
            "parent_id": "t1_eal1bt7",
            "score": 5,
            "created_utc": 1543352096.0,
            "replies": [
                {
                    "body": "Business meeting or family emergency.",
                    "author": null,
                    "id": "ealq8cq",
                    "parent_id": "t1_ealgvu6",
                    "score": 2,
                    "created_utc": 1543359268.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What would be something polite to say to end it? ",
            "author": "AzucaritaSB",
            "id": "ealar1r",
            "parent_id": "t1_eal1bt7",
            "score": 3,
            "created_utc": 1543347658.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eamejk4",
                    "parent_id": "t1_ealar1r",
                    "score": 11,
                    "created_utc": 1543381471.0,
                    "replies": [
                        {
                            "body": "That’s exactly what I do. “You seem like a wonderful person, and you’re beautiful, but I’m not feeling the chemistry.  I’m so sorry about that but I feel like it’s better to just say it.”\n\nAfter a minute or two give her $100 and say “I just wanted to thank you for taking the trouble to meet “",
                            "author": null,
                            "id": "eav62rn",
                            "parent_id": "t1_eamejk4",
                            "score": 3,
                            "created_utc": 1543686439.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">as a straight man I personally don't mind if a date shows up in yoga pants or leggings...\n\nSeconded, thirded, and zillionth'ed :)  I've only had a few SBs show up in leggings, but in those cases they pulled it off -- they did not look thrown-together or like they were going to work out.  One was wearing leggings, boots, nice top, the whole outfit looked pulled together and sexy.  I think \"no leggings\" is a good general rule, maybe not everyone can pull off \"leggings as part of an outfit where it works in a nice bar\"",
            "author": "Azurecole",
            "id": "eal24pt",
            "parent_id": "t1_eal033c",
            "score": 6,
            "created_utc": 1543341637.0,
            "replies": [
                {
                    "body": "Agreed. Like if you can pull it off, they are a nice pair, and part of an outfit etc... I am all for it!\n\nI mean I like the more elegant and classy look too, and especially love dresses. However, leggings if done right can look great! \n",
                    "author": "BigBearSD",
                    "id": "eal2a5y",
                    "parent_id": "t1_eal24pt",
                    "score": 2,
                    "created_utc": 1543341742.0,
                    "replies": []
                },
                {
                    "body": "> Seconded, thirded, and zillionth'ed\n\nI had a date ask once what I wanted her to wear, and I said \"yoga pants and a t-shirt?\" She did and looked great. ",
                    "author": "JustAnotherBurner2",
                    "id": "eamdog4",
                    "parent_id": "t1_eal24pt",
                    "score": 1,
                    "created_utc": 1543380511.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Phone etiquette\n\nAll communication by phone should be at the table and the purpose announced to her date.  \"Oh, it's my sitter,do you mind?\" or \" My GF is checking on me\" . Unexplained mad texting is rude and the date will assume that you are making your M&G appointment with POT #2 ",
            "author": "GSSD",
            "id": "ealhqly",
            "parent_id": "t1_eal217k",
            "score": 5,
            "created_utc": 1543352716.0,
            "replies": [
                {
                    "body": "I do agree that if an emergency has arisen in the past, I’ve clearly stated/asked if I can take a call. But my point wasn’t for emergencies. It was (vaguely) stating that it’s fair to peek at your phone in the bathroom while you freshen up before leaving, pee, etc. ",
                    "author": "3rdDeviationxo",
                    "id": "ealk3qu",
                    "parent_id": "t1_ealhqly",
                    "score": 4,
                    "created_utc": 1543354487.0,
                    "replies": [
                        {
                            "body": "Plus he’s most likely going to be checking his phone while SB is in the bathroom , not a big deal . I would always be safe and bring my purse to the bathroom just because I wouldn’t want to leave it with someone I just met . ",
                            "author": "mismeah",
                            "id": "ealtqpq",
                            "parent_id": "t1_ealk3qu",
                            "score": 3,
                            "created_utc": 1543362183.0,
                            "replies": [
                                {
                                    "body": "Exactly. A little pointless to reply to each “what-if” scenario when it comes to checking phones. ",
                                    "author": "3rdDeviationxo",
                                    "id": "ealvlow",
                                    "parent_id": "t1_ealtqpq",
                                    "score": 3,
                                    "created_utc": 1543363803.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> Phone etiquette: if you must check your phone, do it in the bathroom. Or do it while they take that important work call.\n\nI'm not amused when the potential SB excuses herself to use the bathroom and then takes her phone with her. Obviously she wants privacy for a call text or emails, or just checking SA to see if there are any more fish on the line.  ",
            "author": "pinotandsugar",
            "id": "eal3dui",
            "parent_id": "t1_eal217k",
            "score": -6,
            "created_utc": 1543342509.0,
            "replies": [
                {
                    "body": "What is she supposed to do? Leave her phone on the table/ in her bag with a stranger while she goes to the bathroom?\n\nWhy would you assume that she's checking SA in the bathroom, that's a rather odd conclusion to reach unless you're on there too while she's there and see her.",
                    "author": "sb105",
                    "id": "eal4c50",
                    "parent_id": "t1_eal3dui",
                    "score": 12,
                    "created_utc": 1543343173.0,
                    "replies": [
                        {
                            "body": "It does not matter if she is checking SA or sales at her favorite store.  Unless it is a family emergency or similar she should not be on her phone or texting (other than to let her gf know she is fine)   \n\"I'm letting my girlfriend know I am having a wonderful time, she made me promise to check in\"  \n\nYou stopped at Starbucks on the way to class and are halfway through giving you order and the barista holds up a finger as she takes a personal call......  you are waiting while she is giggling   and waiting   5 minutes later she looks at you to finish your order like nothing has happened.  .....  most likely you would be looking for the door or the manager and wondering how someone could be so rude.  It is no different at a M&G.  \n\n  \n\n\n\n\n\n",
                            "author": "pinotandsugar",
                            "id": "eal5mug",
                            "parent_id": "t1_eal4c50",
                            "score": -7,
                            "created_utc": 1543344103.0,
                            "replies": [
                                {
                                    "body": "What? You were talking about her taking her phone to the toilet with her being a faux pas. That is what we are disagreeing with.",
                                    "author": "sb105",
                                    "id": "eal6bfc",
                                    "parent_id": "t1_eal5mug",
                                    "score": 9,
                                    "created_utc": 1543344584.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I usually take my purse into the bathroom with me, so I can freshen up generally. Phone is in purse.",
                    "author": "MASugarBaby",
                    "id": "eal3ytw",
                    "parent_id": "t1_eal3dui",
                    "score": 11,
                    "created_utc": 1543342915.0,
                    "replies": []
                },
                {
                    "body": "I assume you make an exception for those that have young children (not me, but I remember those days...).",
                    "author": null,
                    "id": "eal3lzx",
                    "parent_id": "t1_eal3dui",
                    "score": 3,
                    "created_utc": 1543342668.0,
                    "replies": [
                        {
                            "body": "I politely let my date know I’ll check in with my sitter 1-2 times via text message while together. I make it super brief and leave it at that.\n\nI also set a ringer that rings through silent on my phone for my Nanny so if it’s an emergency I’ll know to answer. \n\nSo far I’ve never had anyone be offended by this. Most of the men I date specifically are interested because I’m a Mom.",
                            "author": "Sugartits333",
                            "id": "ealfmxj",
                            "parent_id": "t1_eal3lzx",
                            "score": 6,
                            "created_utc": 1543351244.0,
                            "replies": [
                                {
                                    "body": "> I politely let my date know I’ll check in with my sitter 1-2 times via text message while together.\n\nAs a dad I would find this charming. ",
                                    "author": "JustAnotherBurner2",
                                    "id": "eamdiy1",
                                    "parent_id": "t1_ealfmxj",
                                    "score": 4,
                                    "created_utc": 1543380345.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I always tell a new date that since my kiddo is with childcare, I'll need to check my phone occasionally.  It simply it what it is.",
                            "author": null,
                            "id": "eal6iah",
                            "parent_id": "t1_eal3lzx",
                            "score": 5,
                            "created_utc": 1543344714.0,
                            "replies": []
                        },
                        {
                            "body": "Of course   Good mothers are usually great sb",
                            "author": "pinotandsugar",
                            "id": "ealefj2",
                            "parent_id": "t1_eal3lzx",
                            "score": 1,
                            "created_utc": 1543350406.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I actually expect a new SB to have to check in with their wingperson at some point, so it doesn't bother me.  Thinking they're hiding their phone in their lap and looking like they're contemplating their navel through dinner is far more annoying!",
                    "author": null,
                    "id": "eal6ek9",
                    "parent_id": "t1_eal3dui",
                    "score": 6,
                    "created_utc": 1543344644.0,
                    "replies": [
                        {
                            "body": "I think the checking with friend is a positive .....  and just be open.....  I promised I would text my girlfriend.....  I'm telling her I am having a wonderful time ",
                            "author": "pinotandsugar",
                            "id": "ealaanl",
                            "parent_id": "t1_eal6ek9",
                            "score": 1,
                            "created_utc": 1543347326.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I usually get up to use the bathroom, typically towards the end. Gotta pee before the drive home (city traffic). I’ll take my purse, where my phone has been the entire time. I’ll leave my coat or something behind though so there’s no inkling that I’m just walking out.\n\nNever been a big deal. ",
                    "author": "3rdDeviationxo",
                    "id": "eal3moq",
                    "parent_id": "t1_eal3dui",
                    "score": 7,
                    "created_utc": 1543342681.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I assume this post is about M&G, not generally dating in SR's. I bring my phone out every now and then on dates to Google things were having a conversation about or I might reply to friends while he's getting drinks but on a M&G, it's staying in my bag. \n\nBetter safe than sorry since you don't know whether the person will take offense or be chill about it. ",
            "author": "blonde-throwaway",
            "id": "eal683n",
            "parent_id": "t1_eal5tbj",
            "score": 1,
            "created_utc": 1543344518.0,
            "replies": []
        },
        {
            "body": "> Am I the only guy who doesn't care if someone takes their phone out and text? \n\nProbably",
            "author": "GSSD",
            "id": "ealgzbm",
            "parent_id": "t1_eal5tbj",
            "score": 1,
            "created_utc": 1543352164.0,
            "replies": []
        },
        {
            "body": "I don’t know anyone who has zero idea how to do their own makeup.  And if some how they don’t know how to do makeup, it would be because they never wear it.  So it wouldn’t matter anyways.",
            "author": "milliondollarkitty",
            "id": "eamlodo",
            "parent_id": "t1_eamljcz",
            "score": 6,
            "created_utc": 1543391509.0,
            "replies": []
        },
        {
            "body": "Do you have to wear any? I hate the feeling and process. But I am a skincare nut for that reason. \n\nA good q, I suppose. Does makeup matter? If so, why do SDs like it?\n\nIt leaves a mess on linens. \nYou can’t just fall asleep casually. \nIt sometimes looks like, well, makeup. ",
            "author": "ilovecookies86",
            "id": "eapd11j",
            "parent_id": "t1_eamljcz",
            "score": 1,
            "created_utc": 1543479652.0,
            "replies": [
                {
                    "body": "I for one am not a fan of makeup and on some occasions, before the date, mention it casually, not telling them what to do but letting them know my preferences and that they shouldn’t worry about taking an excessive amount of time to get ready. I’m more likely to say this to someone who doesn’t have tons on in pics but who seems like they are inclined to try hard to impress.",
                    "author": null,
                    "id": "eaylyio",
                    "parent_id": "t1_eapd11j",
                    "score": 1,
                    "created_utc": 1543791700.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> A million dollars of purr fect advice.......\n\nThat sounds almost like a quote from Bruno Tonioli.\n\nAre you perhaps channelling your inner Dance With the Stars persona?\n\n(just meant as a joke)",
            "author": null,
            "id": "eal5chw",
            "parent_id": "t1_eal22xp",
            "score": 1,
            "created_utc": 1543343899.0,
            "replies": [
                {
                    "body": "I'm one of the few who has never watched the program......",
                    "author": "pinotandsugar",
                    "id": "eal5rtq",
                    "parent_id": "t1_eal5chw",
                    "score": 2,
                    "created_utc": 1543344202.0,
                    "replies": [
                        {
                            "body": "Stars dance and well yeah.",
                            "author": "rogerthatonce",
                            "id": "ealyusl",
                            "parent_id": "t1_eal5rtq",
                            "score": 1,
                            "created_utc": 1543366751.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eal3sro",
            "parent_id": "t1_eal2odq",
            "score": 12,
            "created_utc": 1543342798.0,
            "replies": [
                {
                    "body": "This is a tricky one, because I think the other person probably wants to know something about you too, so sometimes a story that relates to their story is great.",
                    "author": "JustAnotherBurner2",
                    "id": "eamddvw",
                    "parent_id": "t1_eal3sro",
                    "score": 2,
                    "created_utc": 1543380195.0,
                    "replies": [
                        {
                            "body": "I see such mixed advice on this on SLF! \n\n“Help him escape his life, work, relationship — he *wants* to hear about you. You’re younger, you can teach him about [insert anything “millennial” here].”\n\nVs\n\n“Make him feel like the most interesting man by asking mostly about him, hang on what he says, compliment him profusely. Never interrupt! Let him direct questions to you. Don’t interject.”\n\nSigh. What feels natural to me is to chime in and relate like so many of y’all said. ",
                            "author": "ilovecookies86",
                            "id": "eapcs3f",
                            "parent_id": "t1_eamddvw",
                            "score": 4,
                            "created_utc": 1543479340.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If this isn't me then I don't know what is!!",
            "author": "ohsweetsugar",
            "id": "eam6i0o",
            "parent_id": "t1_eal2odq",
            "score": 3,
            "created_utc": 1543373572.0,
            "replies": []
        },
        {
            "body": "Business meeting or family emergency.",
            "author": null,
            "id": "ealq8cq",
            "parent_id": "t1_ealgvu6",
            "score": 2,
            "created_utc": 1543359268.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eamejk4",
            "parent_id": "t1_ealar1r",
            "score": 11,
            "created_utc": 1543381471.0,
            "replies": [
                {
                    "body": "That’s exactly what I do. “You seem like a wonderful person, and you’re beautiful, but I’m not feeling the chemistry.  I’m so sorry about that but I feel like it’s better to just say it.”\n\nAfter a minute or two give her $100 and say “I just wanted to thank you for taking the trouble to meet “",
                    "author": null,
                    "id": "eav62rn",
                    "parent_id": "t1_eamejk4",
                    "score": 3,
                    "created_utc": 1543686439.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed. Like if you can pull it off, they are a nice pair, and part of an outfit etc... I am all for it!\n\nI mean I like the more elegant and classy look too, and especially love dresses. However, leggings if done right can look great! \n",
            "author": "BigBearSD",
            "id": "eal2a5y",
            "parent_id": "t1_eal24pt",
            "score": 2,
            "created_utc": 1543341742.0,
            "replies": []
        },
        {
            "body": "> Seconded, thirded, and zillionth'ed\n\nI had a date ask once what I wanted her to wear, and I said \"yoga pants and a t-shirt?\" She did and looked great. ",
            "author": "JustAnotherBurner2",
            "id": "eamdog4",
            "parent_id": "t1_eal24pt",
            "score": 1,
            "created_utc": 1543380511.0,
            "replies": []
        },
        {
            "body": "I do agree that if an emergency has arisen in the past, I’ve clearly stated/asked if I can take a call. But my point wasn’t for emergencies. It was (vaguely) stating that it’s fair to peek at your phone in the bathroom while you freshen up before leaving, pee, etc. ",
            "author": "3rdDeviationxo",
            "id": "ealk3qu",
            "parent_id": "t1_ealhqly",
            "score": 4,
            "created_utc": 1543354487.0,
            "replies": [
                {
                    "body": "Plus he’s most likely going to be checking his phone while SB is in the bathroom , not a big deal . I would always be safe and bring my purse to the bathroom just because I wouldn’t want to leave it with someone I just met . ",
                    "author": "mismeah",
                    "id": "ealtqpq",
                    "parent_id": "t1_ealk3qu",
                    "score": 3,
                    "created_utc": 1543362183.0,
                    "replies": [
                        {
                            "body": "Exactly. A little pointless to reply to each “what-if” scenario when it comes to checking phones. ",
                            "author": "3rdDeviationxo",
                            "id": "ealvlow",
                            "parent_id": "t1_ealtqpq",
                            "score": 3,
                            "created_utc": 1543363803.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What is she supposed to do? Leave her phone on the table/ in her bag with a stranger while she goes to the bathroom?\n\nWhy would you assume that she's checking SA in the bathroom, that's a rather odd conclusion to reach unless you're on there too while she's there and see her.",
            "author": "sb105",
            "id": "eal4c50",
            "parent_id": "t1_eal3dui",
            "score": 12,
            "created_utc": 1543343173.0,
            "replies": [
                {
                    "body": "It does not matter if she is checking SA or sales at her favorite store.  Unless it is a family emergency or similar she should not be on her phone or texting (other than to let her gf know she is fine)   \n\"I'm letting my girlfriend know I am having a wonderful time, she made me promise to check in\"  \n\nYou stopped at Starbucks on the way to class and are halfway through giving you order and the barista holds up a finger as she takes a personal call......  you are waiting while she is giggling   and waiting   5 minutes later she looks at you to finish your order like nothing has happened.  .....  most likely you would be looking for the door or the manager and wondering how someone could be so rude.  It is no different at a M&G.  \n\n  \n\n\n\n\n\n",
                    "author": "pinotandsugar",
                    "id": "eal5mug",
                    "parent_id": "t1_eal4c50",
                    "score": -7,
                    "created_utc": 1543344103.0,
                    "replies": [
                        {
                            "body": "What? You were talking about her taking her phone to the toilet with her being a faux pas. That is what we are disagreeing with.",
                            "author": "sb105",
                            "id": "eal6bfc",
                            "parent_id": "t1_eal5mug",
                            "score": 9,
                            "created_utc": 1543344584.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I usually take my purse into the bathroom with me, so I can freshen up generally. Phone is in purse.",
            "author": "MASugarBaby",
            "id": "eal3ytw",
            "parent_id": "t1_eal3dui",
            "score": 11,
            "created_utc": 1543342915.0,
            "replies": []
        },
        {
            "body": "I assume you make an exception for those that have young children (not me, but I remember those days...).",
            "author": null,
            "id": "eal3lzx",
            "parent_id": "t1_eal3dui",
            "score": 3,
            "created_utc": 1543342668.0,
            "replies": [
                {
                    "body": "I politely let my date know I’ll check in with my sitter 1-2 times via text message while together. I make it super brief and leave it at that.\n\nI also set a ringer that rings through silent on my phone for my Nanny so if it’s an emergency I’ll know to answer. \n\nSo far I’ve never had anyone be offended by this. Most of the men I date specifically are interested because I’m a Mom.",
                    "author": "Sugartits333",
                    "id": "ealfmxj",
                    "parent_id": "t1_eal3lzx",
                    "score": 6,
                    "created_utc": 1543351244.0,
                    "replies": [
                        {
                            "body": "> I politely let my date know I’ll check in with my sitter 1-2 times via text message while together.\n\nAs a dad I would find this charming. ",
                            "author": "JustAnotherBurner2",
                            "id": "eamdiy1",
                            "parent_id": "t1_ealfmxj",
                            "score": 4,
                            "created_utc": 1543380345.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I always tell a new date that since my kiddo is with childcare, I'll need to check my phone occasionally.  It simply it what it is.",
                    "author": null,
                    "id": "eal6iah",
                    "parent_id": "t1_eal3lzx",
                    "score": 5,
                    "created_utc": 1543344714.0,
                    "replies": []
                },
                {
                    "body": "Of course   Good mothers are usually great sb",
                    "author": "pinotandsugar",
                    "id": "ealefj2",
                    "parent_id": "t1_eal3lzx",
                    "score": 1,
                    "created_utc": 1543350406.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I actually expect a new SB to have to check in with their wingperson at some point, so it doesn't bother me.  Thinking they're hiding their phone in their lap and looking like they're contemplating their navel through dinner is far more annoying!",
            "author": null,
            "id": "eal6ek9",
            "parent_id": "t1_eal3dui",
            "score": 6,
            "created_utc": 1543344644.0,
            "replies": [
                {
                    "body": "I think the checking with friend is a positive .....  and just be open.....  I promised I would text my girlfriend.....  I'm telling her I am having a wonderful time ",
                    "author": "pinotandsugar",
                    "id": "ealaanl",
                    "parent_id": "t1_eal6ek9",
                    "score": 1,
                    "created_utc": 1543347326.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I usually get up to use the bathroom, typically towards the end. Gotta pee before the drive home (city traffic). I’ll take my purse, where my phone has been the entire time. I’ll leave my coat or something behind though so there’s no inkling that I’m just walking out.\n\nNever been a big deal. ",
            "author": "3rdDeviationxo",
            "id": "eal3moq",
            "parent_id": "t1_eal3dui",
            "score": 7,
            "created_utc": 1543342681.0,
            "replies": []
        },
        {
            "body": "I for one am not a fan of makeup and on some occasions, before the date, mention it casually, not telling them what to do but letting them know my preferences and that they shouldn’t worry about taking an excessive amount of time to get ready. I’m more likely to say this to someone who doesn’t have tons on in pics but who seems like they are inclined to try hard to impress.",
            "author": null,
            "id": "eaylyio",
            "parent_id": "t1_eapd11j",
            "score": 1,
            "created_utc": 1543791700.0,
            "replies": []
        },
        {
            "body": "I'm one of the few who has never watched the program......",
            "author": "pinotandsugar",
            "id": "eal5rtq",
            "parent_id": "t1_eal5chw",
            "score": 2,
            "created_utc": 1543344202.0,
            "replies": [
                {
                    "body": "Stars dance and well yeah.",
                    "author": "rogerthatonce",
                    "id": "ealyusl",
                    "parent_id": "t1_eal5rtq",
                    "score": 1,
                    "created_utc": 1543366751.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is a tricky one, because I think the other person probably wants to know something about you too, so sometimes a story that relates to their story is great.",
            "author": "JustAnotherBurner2",
            "id": "eamddvw",
            "parent_id": "t1_eal3sro",
            "score": 2,
            "created_utc": 1543380195.0,
            "replies": [
                {
                    "body": "I see such mixed advice on this on SLF! \n\n“Help him escape his life, work, relationship — he *wants* to hear about you. You’re younger, you can teach him about [insert anything “millennial” here].”\n\nVs\n\n“Make him feel like the most interesting man by asking mostly about him, hang on what he says, compliment him profusely. Never interrupt! Let him direct questions to you. Don’t interject.”\n\nSigh. What feels natural to me is to chime in and relate like so many of y’all said. ",
                    "author": "ilovecookies86",
                    "id": "eapcs3f",
                    "parent_id": "t1_eamddvw",
                    "score": 4,
                    "created_utc": 1543479340.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s exactly what I do. “You seem like a wonderful person, and you’re beautiful, but I’m not feeling the chemistry.  I’m so sorry about that but I feel like it’s better to just say it.”\n\nAfter a minute or two give her $100 and say “I just wanted to thank you for taking the trouble to meet “",
            "author": null,
            "id": "eav62rn",
            "parent_id": "t1_eamejk4",
            "score": 3,
            "created_utc": 1543686439.0,
            "replies": []
        },
        {
            "body": "Plus he’s most likely going to be checking his phone while SB is in the bathroom , not a big deal . I would always be safe and bring my purse to the bathroom just because I wouldn’t want to leave it with someone I just met . ",
            "author": "mismeah",
            "id": "ealtqpq",
            "parent_id": "t1_ealk3qu",
            "score": 3,
            "created_utc": 1543362183.0,
            "replies": [
                {
                    "body": "Exactly. A little pointless to reply to each “what-if” scenario when it comes to checking phones. ",
                    "author": "3rdDeviationxo",
                    "id": "ealvlow",
                    "parent_id": "t1_ealtqpq",
                    "score": 3,
                    "created_utc": 1543363803.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It does not matter if she is checking SA or sales at her favorite store.  Unless it is a family emergency or similar she should not be on her phone or texting (other than to let her gf know she is fine)   \n\"I'm letting my girlfriend know I am having a wonderful time, she made me promise to check in\"  \n\nYou stopped at Starbucks on the way to class and are halfway through giving you order and the barista holds up a finger as she takes a personal call......  you are waiting while she is giggling   and waiting   5 minutes later she looks at you to finish your order like nothing has happened.  .....  most likely you would be looking for the door or the manager and wondering how someone could be so rude.  It is no different at a M&G.  \n\n  \n\n\n\n\n\n",
            "author": "pinotandsugar",
            "id": "eal5mug",
            "parent_id": "t1_eal4c50",
            "score": -7,
            "created_utc": 1543344103.0,
            "replies": [
                {
                    "body": "What? You were talking about her taking her phone to the toilet with her being a faux pas. That is what we are disagreeing with.",
                    "author": "sb105",
                    "id": "eal6bfc",
                    "parent_id": "t1_eal5mug",
                    "score": 9,
                    "created_utc": 1543344584.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I politely let my date know I’ll check in with my sitter 1-2 times via text message while together. I make it super brief and leave it at that.\n\nI also set a ringer that rings through silent on my phone for my Nanny so if it’s an emergency I’ll know to answer. \n\nSo far I’ve never had anyone be offended by this. Most of the men I date specifically are interested because I’m a Mom.",
            "author": "Sugartits333",
            "id": "ealfmxj",
            "parent_id": "t1_eal3lzx",
            "score": 6,
            "created_utc": 1543351244.0,
            "replies": [
                {
                    "body": "> I politely let my date know I’ll check in with my sitter 1-2 times via text message while together.\n\nAs a dad I would find this charming. ",
                    "author": "JustAnotherBurner2",
                    "id": "eamdiy1",
                    "parent_id": "t1_ealfmxj",
                    "score": 4,
                    "created_utc": 1543380345.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I always tell a new date that since my kiddo is with childcare, I'll need to check my phone occasionally.  It simply it what it is.",
            "author": null,
            "id": "eal6iah",
            "parent_id": "t1_eal3lzx",
            "score": 5,
            "created_utc": 1543344714.0,
            "replies": []
        },
        {
            "body": "Of course   Good mothers are usually great sb",
            "author": "pinotandsugar",
            "id": "ealefj2",
            "parent_id": "t1_eal3lzx",
            "score": 1,
            "created_utc": 1543350406.0,
            "replies": []
        },
        {
            "body": "I think the checking with friend is a positive .....  and just be open.....  I promised I would text my girlfriend.....  I'm telling her I am having a wonderful time ",
            "author": "pinotandsugar",
            "id": "ealaanl",
            "parent_id": "t1_eal6ek9",
            "score": 1,
            "created_utc": 1543347326.0,
            "replies": []
        },
        {
            "body": "Stars dance and well yeah.",
            "author": "rogerthatonce",
            "id": "ealyusl",
            "parent_id": "t1_eal5rtq",
            "score": 1,
            "created_utc": 1543366751.0,
            "replies": []
        },
        {
            "body": "I see such mixed advice on this on SLF! \n\n“Help him escape his life, work, relationship — he *wants* to hear about you. You’re younger, you can teach him about [insert anything “millennial” here].”\n\nVs\n\n“Make him feel like the most interesting man by asking mostly about him, hang on what he says, compliment him profusely. Never interrupt! Let him direct questions to you. Don’t interject.”\n\nSigh. What feels natural to me is to chime in and relate like so many of y’all said. ",
            "author": "ilovecookies86",
            "id": "eapcs3f",
            "parent_id": "t1_eamddvw",
            "score": 4,
            "created_utc": 1543479340.0,
            "replies": []
        },
        {
            "body": "Exactly. A little pointless to reply to each “what-if” scenario when it comes to checking phones. ",
            "author": "3rdDeviationxo",
            "id": "ealvlow",
            "parent_id": "t1_ealtqpq",
            "score": 3,
            "created_utc": 1543363803.0,
            "replies": []
        },
        {
            "body": "What? You were talking about her taking her phone to the toilet with her being a faux pas. That is what we are disagreeing with.",
            "author": "sb105",
            "id": "eal6bfc",
            "parent_id": "t1_eal5mug",
            "score": 9,
            "created_utc": 1543344584.0,
            "replies": []
        },
        {
            "body": "> I politely let my date know I’ll check in with my sitter 1-2 times via text message while together.\n\nAs a dad I would find this charming. ",
            "author": "JustAnotherBurner2",
            "id": "eamdiy1",
            "parent_id": "t1_ealfmxj",
            "score": 4,
            "created_utc": 1543380345.0,
            "replies": []
        }
    ]
}