{
    "title": "PSA for Black women",
    "post_id": "s4bwlo",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/s4bwlo/psa_for_black_women/",
    "author": "kikienen",
    "body": "Please please and please stop posting your profiles for review on this sub because no matter how gorgeous you look, how beautiful your pictures are or how well spoken amd educated you sound you’ll still get ripped to shreds while Becky can post the same three pictures wearing black leggings and a crop top and these men will be all “goddess” ‘omg you’re so beautiful’ \nA black woman posts a bikini picture and and she’s called a ‘pro’ or a gold digger which is really rich Viking from men in this sub but 4 days ago this white girl literally had her butt crack on display and no one batted an eyelid.\n\nEven though the rules of the sub say not to you’ll still have these men commenting on your appearance and telling you how average you look or telling you you’re overweight. You don’t need that kind of negativity in your life so please just don’t. Ask a fellow black sugar baby what you need to do but don’t ask these racist trolls. My post is probably going to get removed but that’s how you know that I’m speaking the truth 🤷🏽‍♀️",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/s4bwlo/psa_for_black_women/",
    "score": 454,
    "upvote_ratio": 0.86,
    "created_utc": 1642221255.0,
    "num_comments": 69,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I’m a white male and all my SBs have been black women. I’m so sorry for everything you all go through.",
            "author": "mikemac51973",
            "id": "hsq6nn5",
            "parent_id": "t3_s4bwlo",
            "score": 125,
            "created_utc": 1642222037.0,
            "replies": [
                {
                    "body": "We love this 💕",
                    "author": "nycsbestkeptsecret",
                    "id": "hsq9irp",
                    "parent_id": "t1_hsq6nn5",
                    "score": 23,
                    "created_utc": 1642223581.0,
                    "replies": [
                        {
                            "body": "Thanks. All my experiences have been pretty awesome",
                            "author": "mikemac51973",
                            "id": "hsq9xjb",
                            "parent_id": "t1_hsq9irp",
                            "score": 20,
                            "created_utc": 1642223796.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Im.going to repost what I shared here a week ago. I'm not gonna lie - even I look at some of fellow AA SBs profile reviews and think \"wtf\"??? I end up not even offering advice because even - as a WOC - I don't have much positive to say! Education be damned, actual text portion can be on point, and they hit every single line item that would make a perfect post. But their pictures....leaves me wondering where the self awareness is. Dont get me wrong, a lot of profiles that get posted here by all nationalities have me questioning  their common sense, and i treat them the same way. I'm sorry, but we can't uplift each other unless we are HONEST with each other. And being honest, some of our sistas need to really take a step back and rethink joining the bowl. The same look that catches the brothas attention on the street - is NOT necessarily going to turn a white high end exec from the Midwest's head...and getting offended by that confuses me.\n\n**********************************************************\nAs an AA (mixed) SB - I gotta keep it real with my sistas that join the bowl....\n\n\n1. People have preferences...and there is nothing wrong with that. All of us have them! I am not attracted to obese men, some women only like tall guys, some men don't care for flat chested/small boobs, and some people just aren't attracted to other ethnicities. Gotta learn to be OK with that. Peoples preferences are based on their environment. Personally speaking, I'm open to all ethnicities- as long as I am attracted to them!!!! And Hell yeah I'd date a Travis Kelce over a Sheldon Cooper anyday...🤣😍. But someone preferring a certain type is not racism - and I find a lot of AA women confuse the 2.\n\n\n\n2. There is a caveat though - and this tends to hurt people's feelings (and I understand): there are men who have said to my face \"I'm not into black girls, normally\"...but then WILL openly want to date or be involved with me?! 😵‍💫. Yes, ive even had AA men say that. What they really are saying is they like black girls that have lighter complexions...(Saweetie, DojaCat, Beyonce, Ashanti, etc) - those that are considered \"racially ambiguous\" but identify as AA women. I can't lie and say I haven't benefited from being mixed and having a Lite complexion...and then my gf who is a beautiful chocolate complexion hardly gets any matches, or she gets the \"you are pretty - for a dark girl, but im not into black women\" backhanded compliments 🙄. This woman is beautiful and built like a real life sex doll - but she doesn't even get a lot of \"play\" in vanilla dating...so in the bowl, those chances get even lower. It is the sad reality for AA women both in vanilla and the sugar lifestyle....\n\n\n3. My SDs have been all pretty respectful, but I've met some POTs who really acted like I was more of a \"live doll\" then a human being. They would make creepy comments \"I didn't know black girls were so soft\"....\"what ARE you mixed with, because you look so exotic\"...\"how did you get your hair so curly - can I touch it?\" (Water bruh...thats it...amazing right - WATER). LOL\n\n\n4. Lastly - the more \"standard\" beauty you have the better your chances are. For example- I used to be part of this SB group in my city. I stood out like a sore thumb!!!! These chick's had 4\" coffin nails with gems and chains on them, all colors of wigs, amiclubwear type outfits...false lashes longer then their natural hair....and only 4 out of the 15 girls there - had an SD. Every single one was complaining about how SA sucked, no one msg them, no one responded, etc. Now - if that is their style of dress, cool - they like it I love it. BUT...if going for the C-level exec type SD, YOU have to look the part! Not saying go get named brand high end clothes...no....but you have to be what you want to attract. And for us black girls that sometimes means changing our methods...where other ethnicities may not have to\n\n\nTake breaks in this bowl. If you don't, you will burn out trying to constantly find a POT. Keep a solid circle of friends - it is so important to be around people that value you for YOU. Be careful of the \"you are so exotic\" type who fetishize you solely because you are black. And don't let anyone's not choosing you be a reason for YOU to give up...",
            "author": "letsjusthavefunnow",
            "id": "hsqcjf5",
            "parent_id": "t3_s4bwlo",
            "score": 141,
            "created_utc": 1642225237.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "hsqewkt",
                    "parent_id": "t1_hsqcjf5",
                    "score": -43,
                    "created_utc": 1642226631.0,
                    "replies": [
                        {
                            "body": "See...honey, the fact you took constructive criticism, got in your feelings over it, and then tried to project that back at me like I'm \"shuckin n jivin\" is exactly why WE (WOC) stay stuck. But if you like it there, God bless you.",
                            "author": "letsjusthavefunnow",
                            "id": "hsqf6ym",
                            "parent_id": "t1_hsqewkt",
                            "score": 97,
                            "created_utc": 1642226806.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am going to try to be as transparent as possible and I hope that it doesn't offend anyone because that is not my intention. I posted a profile review and have also asked SDs from the thread to review my profile and what you described has never been my experience. With that being said, as a black SB, you will have to work 2-3x as hard as any other SB who is non-black because that is the way of the world. You have to do this at school, at work, etc. I just say if you can't take the heat, then stay out the kitchen. This style of dating is nuanced and you need thick skin to do it. Not everyone is going to find you attractive. It's okay. Shake it off, keep it moving, and get your bag, sis. Ignore the naysayers.",
            "author": "coolerthanbeans45",
            "id": "hsq5x31",
            "parent_id": "t3_s4bwlo",
            "score": 69,
            "created_utc": 1642221637.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "hsq6h64",
                    "parent_id": "t1_hsq5x31",
                    "score": 5,
                    "created_utc": 1642221938.0,
                    "replies": [
                        {
                            "body": "Thank you but yes that’s why I mentioned that I’ve contacted SDs from the thread to review my profile. I’ve never been left on read by them, and have always been helped/greeted with open arms. I’m just putting that out there to say my experience has not been what’s mentioned but I also am not super active on this thread (until recently) & I don’t look at profile reviews (only the one I posted).",
                            "author": "coolerthanbeans45",
                            "id": "hsqcnx6",
                            "parent_id": "t1_hsq6h64",
                            "score": 4,
                            "created_utc": 1642225308.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">I just say if you can't take the heat, then stay out the kitchen\n\nThis is the laziest reply I have ever encountered in my LIFE! Racism is not something we should have to \"deal with\" because it's just \"the way of the world\". Glad you've had great successes but you shouldn't HAVE to work 3x as hard JUST because you're black",
                    "author": "QuirkyComplex",
                    "id": "hsq7m2u",
                    "parent_id": "t1_hsq5x31",
                    "score": 25,
                    "created_utc": 1642222556.0,
                    "replies": [
                        {
                            "body": "It’s true, though. Any SB that deviates from what’s considering conventional in the bowl will have to work harder to find success. We all have preconceived notions about others that happen to affect how we choose POTs. And it seems that the poster-girl of all SBs happens to be a white sorority-girl type. That might not be what everyone is looking for, but I think that’s the common perception of what an SB is (I mean FFS, just look at how sites like SA advertise their members + target demographics). \n\nSome SDs shy away from Black SBs because they believe we’re ghetto, unkempt/trashy, and only in it for the money. Obviously that’s a stereotype and doesn’t represent everyone, but it’s an obstacle we have to accept in order to overcome it. Blaming it on racism and saying that all SDs need to do better isn’t productive because it’s not going to change anything. Instead, find little ways to prove them wrong and show that Black SBs can be just as good as any other SB. \n\nFWIW, I judge all profile reviews evenly despite race. Perks of being a mixed girl I guess 😅. Though Black SBs have to be more aware of the negative stereotypes that are stacked against them in the bowl. Pointing out aspects of their profile that might play into them and how to avoid that is, IMO, an important piece of feedback that’ll help us challenge unfair stereotypes in the long run.",
                            "author": "curly_spice",
                            "id": "hsqasip",
                            "parent_id": "t1_hsq7m2u",
                            "score": 27,
                            "created_utc": 1642224265.0,
                            "replies": [
                                {
                                    "body": ">only in it for the money\n\nWhite 19 year old sorority girl here. I am only in it for money lol. I have no shame in it.",
                                    "author": "Not_That_Girl_13",
                                    "id": "hsqdf0g",
                                    "parent_id": "t1_hsqasip",
                                    "score": 22,
                                    "created_utc": 1642225740.0,
                                    "replies": []
                                },
                                {
                                    "body": "Thank you.",
                                    "author": "coolerthanbeans45",
                                    "id": "hsqcz2l",
                                    "parent_id": "t1_hsqasip",
                                    "score": 3,
                                    "created_utc": 1642225483.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "no.  comments like this are lazy.  there's a difference between understanding how the world works and navigating it with that understanding vs. trying to constantly running into a wall and hoping it eventually won't hurt.  \n\ni'm a short male, i've  had to accept that my dating pool is smaller than your typical 5'9+ male.  It's the way the world works.  Hell, i've had SBs say no to me because of height.  last time i checked, my money is just as real as a taller male.",
                            "author": "throwawaymeter",
                            "id": "hsqbmp9",
                            "parent_id": "t1_hsq7m2u",
                            "score": 14,
                            "created_utc": 1642224733.0,
                            "replies": [
                                {
                                    "body": "I don’t really understand the point here.",
                                    "author": "coolerthanbeans45",
                                    "id": "hsqcu1z",
                                    "parent_id": "t1_hsqbmp9",
                                    "score": 5,
                                    "created_utc": 1642225403.0,
                                    "replies": [
                                        {
                                            "body": "It’s not that hard to understand. We’re all dealt a hand. How you play it is up to you",
                                            "author": "throwawaymeter",
                                            "id": "hsqczw9",
                                            "parent_id": "t1_hsqcu1z",
                                            "score": 7,
                                            "created_utc": 1642225496.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, I tend to agree with that.",
                                                    "author": "coolerthanbeans45",
                                                    "id": "hsqd46e",
                                                    "parent_id": "t1_hsqczw9",
                                                    "score": 3,
                                                    "created_utc": 1642225566.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I never said it was right... I just said that's the way things are. I don't think it's good, but unfortunately capitalism weaponizes racism & this style of dating is driven by capitalistic ideals so you have to just be real with yourself. I'm not trying to solve racism by sugar dating. I know it exists, so I move accordingly. I suggest all other BW do the same.",
                            "author": "coolerthanbeans45",
                            "id": "hsq96jz",
                            "parent_id": "t1_hsq7m2u",
                            "score": 5,
                            "created_utc": 1642223396.0,
                            "replies": [
                                {
                                    "body": "You can't gripe about capitalism and be a SB. The excess of capitalism is what's paying for our asses.",
                                    "author": "Not_That_Girl_13",
                                    "id": "hsqdi9e",
                                    "parent_id": "t1_hsq96jz",
                                    "score": 11,
                                    "created_utc": 1642225793.0,
                                    "replies": [
                                        {
                                            "body": "this is exactly what i'm saying... captalism weaponizes racism, colorism, texturism, etc. So, how can you complain about someone not being attracted to you when they are lterally paying to look at you, be around you, etc.? Move along. Chew the meat and spit out the bones.",
                                            "author": "coolerthanbeans45",
                                            "id": "hsqe1qa",
                                            "parent_id": "t1_hsqdi9e",
                                            "score": 2,
                                            "created_utc": 1642226112.0,
                                            "replies": [
                                                {
                                                    "body": "North Korea is communist, I don't think Kim Jong is sleeping with ugly girls. Venezuela is socialist, the president isn't sleeping with ugly girls. It's not about race, it's about what the rich and powerful find attractive.",
                                                    "author": "Not_That_Girl_13",
                                                    "id": "hsqefds",
                                                    "parent_id": "t1_hsqe1qa",
                                                    "score": 5,
                                                    "created_utc": 1642226341.0,
                                                    "replies": [
                                                        {
                                                            "body": "Right on the money.",
                                                            "author": "coolerthanbeans45",
                                                            "id": "hsqekfd",
                                                            "parent_id": "t1_hsqefds",
                                                            "score": 2,
                                                            "created_utc": 1642226424.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "> \"captalism weaponizes racism\"\n\nSounds like something from a sophomoric lecture  \n\nIf someone is a \"pure capitalist\" then there is no room for racism; everything is profit driven.  Actually the absence of capitalism, responsibility for delivering value, weaponizes racism.",
                                                    "author": "pinotandsugar",
                                                    "id": "hsql1y7",
                                                    "parent_id": "t1_hsqe1qa",
                                                    "score": 2,
                                                    "created_utc": 1642230650.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Black SB's are more common than white, I'm not even going to talk to the things I've heard middle eastern and Japanese girls making. Scarcity drives up value.",
                            "author": "Not_That_Girl_13",
                            "id": "hsqdb5b",
                            "parent_id": "t1_hsq7m2u",
                            "score": 4,
                            "created_utc": 1642225678.0,
                            "replies": [
                                {
                                    "body": " \nMy advice would be the same as that of a basketball coach, instructor, employer.....  Don't look for reasons why you are struggling but rather look for ways to succeed.",
                                    "author": "pinotandsugar",
                                    "id": "hsqlett",
                                    "parent_id": "t1_hsqdb5b",
                                    "score": 6,
                                    "created_utc": 1642230899.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’m sorry but I do not agree with this at all, it’s 2022, we shouldn’t have to work harder than everyone in order to get lesser than results. That doesn’t make any sense…\n\nI’m currently reading *”Black girls must die exhausted”* by Jayne Allen and it gives into this topic",
                    "author": "Forsaken_Software394",
                    "id": "hsqdhsg",
                    "parent_id": "t1_hsq5x31",
                    "score": -8,
                    "created_utc": 1642225786.0,
                    "replies": [
                        {
                            "body": "You don’t need to agree, but it’s the truth.",
                            "author": "throwawaymeter",
                            "id": "hsqeq9y",
                            "parent_id": "t1_hsqdhsg",
                            "score": 9,
                            "created_utc": 1642226524.0,
                            "replies": []
                        },
                        {
                            "body": "I guess me stating the realities is me agreeing with them... This conversation is not making me any money, so with that, i rest my case. Goodnight, everyone! Be blessed.",
                            "author": "coolerthanbeans45",
                            "id": "hsqef4n",
                            "parent_id": "t1_hsqdhsg",
                            "score": 6,
                            "created_utc": 1642226337.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm going to be blunt, the  \"whiter\" a black woman is in her profile, it will increase her success.  The content of profiles from black women on SA are wrong for the demographic (white old men).   When black women post their profiles here, of course they're going to get harsh feedback.  Most of the profiles are simply not \"white\" enough. From personal experience, the vast majority of black women profiles have Miami, Las Vegas, and gold digger vibes.  The ones that have more normative pics and descriptions will do better.\n\nI'm a POC and young and vanilla dated black women.  So i don't think i'm saying this from a lens of racism.  Black SBs need to realize that sexy and attractive in the black community is just simply not the same for the old and white community.  It's not that the black women aren't attractive, but their portrayal of themselves don't vibe with what old white men want as their fantasy.\n\nOne anecdotal detail, i see white men with black SBs in the wild all the time in NY",
            "author": "throwawaymeter",
            "id": "hsqa8rp",
            "parent_id": "t3_s4bwlo",
            "score": 67,
            "created_utc": 1642223966.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hsqakrf",
                    "parent_id": "t1_hsqa8rp",
                    "score": 27,
                    "created_utc": 1642224145.0,
                    "replies": [
                        {
                            "body": "should probably edit with old, white, and wealthy.  it's more accurate",
                            "author": "throwawaymeter",
                            "id": "hsqaync",
                            "parent_id": "t1_hsqakrf",
                            "score": 16,
                            "created_utc": 1642224362.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hsqb2pv",
                                    "parent_id": "t1_hsqaync",
                                    "score": 11,
                                    "created_utc": 1642224426.0,
                                    "replies": [
                                        {
                                            "body": "Wealthy black people have more in common with wealthy white people than urban black people. Not really a secret",
                                            "author": "Not_That_Girl_13",
                                            "id": "hsqe0kd",
                                            "parent_id": "t1_hsqb2pv",
                                            "score": 43,
                                            "created_utc": 1642226093.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "question though, are there many black SDs?  From my perception, the answer is no.  but i have no idea.  all i know is that white men are overwhelmingly the people in power and have money",
                                            "author": "throwawaymeter",
                                            "id": "hsqbrmc",
                                            "parent_id": "t1_hsqb2pv",
                                            "score": 8,
                                            "created_utc": 1642224809.0,
                                            "replies": [
                                                {
                                                    "body": "I wanna shed some light. I've seen black men who had made their money, and they dated younger black women and lavished them with gifts and financial security. They didn't call it SR, they thought of it as more what happens when you're successful and single. You get the cream of the crop.\n\nI call that a SR, they don't",
                                                    "author": "Not_That_Girl_13",
                                                    "id": "hsqe5vt",
                                                    "parent_id": "t1_hsqbrmc",
                                                    "score": 28,
                                                    "created_utc": 1642226183.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Literally saw the most ethereal, gorgeous, angelic black woman get told she looks like a pro/gold digger. Next day, basic white girl posts her profile (very negative writing, all pictures were exuding luxury lifestyle) and every single person replied how perfect she is 🧍🏿‍♀️",
            "author": "QuirkyComplex",
            "id": "hsq7don",
            "parent_id": "t3_s4bwlo",
            "score": 57,
            "created_utc": 1642222429.0,
            "replies": [
                {
                    "body": "They don’t want to admit that they find attractive black women ‘intimidating’",
                    "author": "kikienen",
                    "id": "hsq7s0o",
                    "parent_id": "t1_hsq7don",
                    "score": 29,
                    "created_utc": 1642222645.0,
                    "replies": [
                        {
                            "body": "intimidating is only one factor.  imagine if you're a 65 year old white male.  Being with a 21 year old white female is already a double take.  Now imagine the 65 year old male with a 21 year old black female. it's simply harder to be discreet.\n\nno saying it's right, but there are 2 sides to every coin.  but yeah, the SD comments are many times racist",
                            "author": "throwawaymeter",
                            "id": "hsqcglu",
                            "parent_id": "t1_hsq7s0o",
                            "score": 18,
                            "created_utc": 1642225193.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you so much for this post! I’ve definitely noticed how black women’s profile reviews are judged more harshly than other races.",
            "author": "_chloephil",
            "id": "hsq5gph",
            "parent_id": "t3_s4bwlo",
            "score": 47,
            "created_utc": 1642221393.0,
            "replies": [
                {
                    "body": "I’ve never seen a BW profile review that doesn’t have disgusting comments on it, smh",
                    "author": "kikienen",
                    "id": "hsq5ss3",
                    "parent_id": "t1_hsq5gph",
                    "score": 14,
                    "created_utc": 1642221574.0,
                    "replies": []
                },
                {
                    "body": "they might be judged more harshly, both with and without unconscious bias.  but, the profiles are simply not geared to capture the attention of your typical SD.  It's a profile review.  Even if harsh, the SDs are guiding the profile towards something they'd rather see.",
                    "author": "throwawaymeter",
                    "id": "hsqby6k",
                    "parent_id": "t1_hsq5gph",
                    "score": 4,
                    "created_utc": 1642224909.0,
                    "replies": [
                        {
                            "body": "I can be fairly harsh and blunt, but I do it with the hopes that every woman can land her whale and never have to work another day in her life. I might be more popular if I sugar coat stuff, but too many people get these ideas that are based in fantasy land.",
                            "author": "Not_That_Girl_13",
                            "id": "hsqd3q9",
                            "parent_id": "t1_hsqby6k",
                            "score": 3,
                            "created_utc": 1642225559.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Learned that the hard way lol 😂 where was your post about 4 hours ago? Luckily I’m not easily wavered by what old white men think. I know I don’t conform to their beauty standards. I don’t really want to.",
            "author": "Iambriiee",
            "id": "hsq5tsk",
            "parent_id": "t3_s4bwlo",
            "score": 20,
            "created_utc": 1642221590.0,
            "replies": [
                {
                    "body": "I saw your profile review post and that one guy (you know who I mean) made me ill. I’m sorry for what you had to absorb.",
                    "author": "ThrowawayUserID1501",
                    "id": "hsqbdc6",
                    "parent_id": "t1_hsq5tsk",
                    "score": 11,
                    "created_utc": 1642224588.0,
                    "replies": [
                        {
                            "body": "That guy was a weirdo.",
                            "author": "Iambriiee",
                            "id": "hsqccfw",
                            "parent_id": "t1_hsqbdc6",
                            "score": 8,
                            "created_utc": 1642225128.0,
                            "replies": [
                                {
                                    "body": "Lol, he's a bit of an odd duck. But he's always treated me good :) shame he got banned from this subreddit, I talked him into getting back on Reddit. Now I have to hear him moan and groan for an hour",
                                    "author": "Not_That_Girl_13",
                                    "id": "hsqdp18",
                                    "parent_id": "t1_hsqccfw",
                                    "score": -3,
                                    "created_utc": 1642225902.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Sweetie your post inspired this honestly, you didn’t deserve such comments",
                    "author": "kikienen",
                    "id": "hsq667u",
                    "parent_id": "t1_hsq5tsk",
                    "score": 14,
                    "created_utc": 1642221774.0,
                    "replies": [
                        {
                            "body": "Lol the one really long comment on my PR is what pushed me to delete both posts. Like wow, why did I trigger you that badly!? Idk if you saw my “discouraged” post from earlier but there were some words said after the revelation that I’m not a white woman.",
                            "author": "Iambriiee",
                            "id": "hsq6gif",
                            "parent_id": "t1_hsq667u",
                            "score": 6,
                            "created_utc": 1642221929.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I call 100% bullshit. You're on that bullshit. I shred black and white chick  profile reviews on this sub. I'm black and I deal with primarily black women.  Shitty is shitty. Wack profiles are wack profiles regardless of race.  \n\n\nFellow black sugar babies are not cashapping or putting  money in envelopes handing it over to women. So don't even go for that shit. Women lie to be nice regardless of race. Listen to the men. They are the paying clients.   \n\n\nGood pictures free of filters. Clearly written profiles letting the men know why he should get with you goes a long way. Regardless of race.",
            "author": "southernslick",
            "id": "hsq8vth",
            "parent_id": "t3_s4bwlo",
            "score": 12,
            "created_utc": 1642223237.0,
            "replies": [
                {
                    "body": "Thanks for your contribution then",
                    "author": "QuirkyComplex",
                    "id": "hsq918l",
                    "parent_id": "t1_hsq8vth",
                    "score": 9,
                    "created_utc": 1642223317.0,
                    "replies": []
                },
                {
                    "body": "How does your room smell after spewing all these bull crap because this is a dirty lie.",
                    "author": "kikienen",
                    "id": "hsq9kjf",
                    "parent_id": "t1_hsq8vth",
                    "score": 7,
                    "created_utc": 1642223607.0,
                    "replies": [
                        {
                            "body": "It's 100% all true. You know what's so funny ? I have a homegirl who is also a sister. She sugar date with white men 95% of the time. She does not have even half the problems I read in this sub from other black women. She is winning.  \n\n\nShe does basic shit. Good clear pictures. Always come out the house on point. Targets men who have the disposable income. Shit, she got a man to give her the cash to purchase  luxury vehicle. I saw the money transfer and rode in the car. I use to tell her she should do coaching. But now I know whys she says no and it's a waste of time.  \n\n\nWomen are lazy as fuck. They won't do the things she does to get the bag, regardless of race. Reading the shit in this sub I believe her. Women not going to put that work in for self improvement. So I already know some ladies going to downvote this shit. Don't change the facts on the ground.",
                            "author": "southernslick",
                            "id": "hsqaos9",
                            "parent_id": "t1_hsq9kjf",
                            "score": 15,
                            "created_utc": 1642224207.0,
                            "replies": [
                                {
                                    "body": "Wowww. I was invested in the first half of your comment. Then you derailed and just proved everyone’s point. I guess misogyny doesn’t discriminate either.",
                                    "author": "lipslikesugar88",
                                    "id": "hsqbu6c",
                                    "parent_id": "t1_hsqaos9",
                                    "score": 25,
                                    "created_utc": 1642224849.0,
                                    "replies": [
                                        {
                                            "body": "The definition of misogyny is contempt for women. Could you point out at what point did I show contempt to for women in my response ??",
                                            "author": "southernslick",
                                            "id": "hsqd9ir",
                                            "parent_id": "t1_hsqbu6c",
                                            "score": -1,
                                            "created_utc": 1642225652.0,
                                            "replies": [
                                                {
                                                    "body": "Lol\n\n“Women are lazy as fuck”. \n\nThe end.",
                                                    "author": "lipslikesugar88",
                                                    "id": "hsqdg2i",
                                                    "parent_id": "t1_hsqd9ir",
                                                    "score": 20,
                                                    "created_utc": 1642225758.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "> Could you point out at what point did I show contempt to for women in my response ??\n\nCome on, man, seriously?\n\n> Women are lazy as fuck.",
                                                    "author": "Y_4Z44",
                                                    "id": "hsqe0wy",
                                                    "parent_id": "t1_hsqd9ir",
                                                    "score": 12,
                                                    "created_utc": 1642226099.0,
                                                    "replies": [
                                                        {
                                                            "body": "Now you’re just playing with my emotions 😉",
                                                            "author": "lipslikesugar88",
                                                            "id": "hsqes1m",
                                                            "parent_id": "t1_hsqe0wy",
                                                            "score": 2,
                                                            "created_utc": 1642226554.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This, right here.",
                    "author": "Not_That_Girl_13",
                    "id": "hsqdrym",
                    "parent_id": "t1_hsq8vth",
                    "score": 1,
                    "created_utc": 1642225951.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hsq8snl",
            "parent_id": "t3_s4bwlo",
            "score": -1,
            "created_utc": 1642223190.0,
            "replies": [
                {
                    "body": "You are not obligated to engage in topics and conversations that tire you. Scroll past if it's such an issue",
                    "author": "QuirkyComplex",
                    "id": "hsq93e5",
                    "parent_id": "t1_hsq8snl",
                    "score": 20,
                    "created_utc": 1642223349.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hsqa8s2",
                            "parent_id": "t1_hsq93e5",
                            "score": 11,
                            "created_utc": 1642223967.0,
                            "replies": [
                                {
                                    "body": "Maybe you can hop over to the armpit hair post and contribute that same energy. But wait. A white SD wrote that post….cmon now. Do better please!!",
                                    "author": "lipslikesugar88",
                                    "id": "hsqakhm",
                                    "parent_id": "t1_hsqa8s2",
                                    "score": 3,
                                    "created_utc": 1642224141.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hsqan3i",
                                            "parent_id": "t1_hsqakhm",
                                            "score": 2,
                                            "created_utc": 1642224181.0,
                                            "replies": [
                                                {
                                                    "body": "Ooo gave me butterflies when you called me sweetheart.",
                                                    "author": "lipslikesugar88",
                                                    "id": "hsqaqgy",
                                                    "parent_id": "t1_hsqan3i",
                                                    "score": 4,
                                                    "created_utc": 1642224233.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "hsqaue9",
                                    "parent_id": "t1_hsqa8s2",
                                    "score": 1,
                                    "created_utc": 1642224294.0,
                                    "replies": [
                                        {
                                            "body": "> The same conversations are regularly beaten to death on this sub\n\nYou've been here less than a day and you know this, huh? You using an alt to avoid soiling your regular user name or evading a ban?",
                                            "author": "Y_4Z44",
                                            "id": "hsqcje7",
                                            "parent_id": "t1_hsqaue9",
                                            "score": 7,
                                            "created_utc": 1642225237.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hsqcbhv",
                                            "parent_id": "t1_hsqaue9",
                                            "score": -3,
                                            "created_utc": 1642225112.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I was so ready to throw hands at the first sentence but reading the full post and... yeah. It sucks but... yeah.",
            "author": "Charming-Eye-1309",
            "id": "hsqawhr",
            "parent_id": "t3_s4bwlo",
            "score": 1,
            "created_utc": 1642224327.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hsqa649",
            "parent_id": "t3_s4bwlo",
            "score": -1,
            "created_utc": 1642223927.0,
            "replies": [
                {
                    "body": "You could have made your point *far more effectively* if you'd used different words, friend.",
                    "author": "Y_4Z44",
                    "id": "hsqabte",
                    "parent_id": "t1_hsqa649",
                    "score": 5,
                    "created_utc": 1642224012.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We love this 💕",
            "author": "nycsbestkeptsecret",
            "id": "hsq9irp",
            "parent_id": "t1_hsq6nn5",
            "score": 23,
            "created_utc": 1642223581.0,
            "replies": [
                {
                    "body": "Thanks. All my experiences have been pretty awesome",
                    "author": "mikemac51973",
                    "id": "hsq9xjb",
                    "parent_id": "t1_hsq9irp",
                    "score": 20,
                    "created_utc": 1642223796.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hsqewkt",
            "parent_id": "t1_hsqcjf5",
            "score": -43,
            "created_utc": 1642226631.0,
            "replies": [
                {
                    "body": "See...honey, the fact you took constructive criticism, got in your feelings over it, and then tried to project that back at me like I'm \"shuckin n jivin\" is exactly why WE (WOC) stay stuck. But if you like it there, God bless you.",
                    "author": "letsjusthavefunnow",
                    "id": "hsqf6ym",
                    "parent_id": "t1_hsqewkt",
                    "score": 97,
                    "created_utc": 1642226806.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hsq6h64",
            "parent_id": "t1_hsq5x31",
            "score": 5,
            "created_utc": 1642221938.0,
            "replies": [
                {
                    "body": "Thank you but yes that’s why I mentioned that I’ve contacted SDs from the thread to review my profile. I’ve never been left on read by them, and have always been helped/greeted with open arms. I’m just putting that out there to say my experience has not been what’s mentioned but I also am not super active on this thread (until recently) & I don’t look at profile reviews (only the one I posted).",
                    "author": "coolerthanbeans45",
                    "id": "hsqcnx6",
                    "parent_id": "t1_hsq6h64",
                    "score": 4,
                    "created_utc": 1642225308.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">I just say if you can't take the heat, then stay out the kitchen\n\nThis is the laziest reply I have ever encountered in my LIFE! Racism is not something we should have to \"deal with\" because it's just \"the way of the world\". Glad you've had great successes but you shouldn't HAVE to work 3x as hard JUST because you're black",
            "author": "QuirkyComplex",
            "id": "hsq7m2u",
            "parent_id": "t1_hsq5x31",
            "score": 25,
            "created_utc": 1642222556.0,
            "replies": [
                {
                    "body": "It’s true, though. Any SB that deviates from what’s considering conventional in the bowl will have to work harder to find success. We all have preconceived notions about others that happen to affect how we choose POTs. And it seems that the poster-girl of all SBs happens to be a white sorority-girl type. That might not be what everyone is looking for, but I think that’s the common perception of what an SB is (I mean FFS, just look at how sites like SA advertise their members + target demographics). \n\nSome SDs shy away from Black SBs because they believe we’re ghetto, unkempt/trashy, and only in it for the money. Obviously that’s a stereotype and doesn’t represent everyone, but it’s an obstacle we have to accept in order to overcome it. Blaming it on racism and saying that all SDs need to do better isn’t productive because it’s not going to change anything. Instead, find little ways to prove them wrong and show that Black SBs can be just as good as any other SB. \n\nFWIW, I judge all profile reviews evenly despite race. Perks of being a mixed girl I guess 😅. Though Black SBs have to be more aware of the negative stereotypes that are stacked against them in the bowl. Pointing out aspects of their profile that might play into them and how to avoid that is, IMO, an important piece of feedback that’ll help us challenge unfair stereotypes in the long run.",
                    "author": "curly_spice",
                    "id": "hsqasip",
                    "parent_id": "t1_hsq7m2u",
                    "score": 27,
                    "created_utc": 1642224265.0,
                    "replies": [
                        {
                            "body": ">only in it for the money\n\nWhite 19 year old sorority girl here. I am only in it for money lol. I have no shame in it.",
                            "author": "Not_That_Girl_13",
                            "id": "hsqdf0g",
                            "parent_id": "t1_hsqasip",
                            "score": 22,
                            "created_utc": 1642225740.0,
                            "replies": []
                        },
                        {
                            "body": "Thank you.",
                            "author": "coolerthanbeans45",
                            "id": "hsqcz2l",
                            "parent_id": "t1_hsqasip",
                            "score": 3,
                            "created_utc": 1642225483.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "no.  comments like this are lazy.  there's a difference between understanding how the world works and navigating it with that understanding vs. trying to constantly running into a wall and hoping it eventually won't hurt.  \n\ni'm a short male, i've  had to accept that my dating pool is smaller than your typical 5'9+ male.  It's the way the world works.  Hell, i've had SBs say no to me because of height.  last time i checked, my money is just as real as a taller male.",
                    "author": "throwawaymeter",
                    "id": "hsqbmp9",
                    "parent_id": "t1_hsq7m2u",
                    "score": 14,
                    "created_utc": 1642224733.0,
                    "replies": [
                        {
                            "body": "I don’t really understand the point here.",
                            "author": "coolerthanbeans45",
                            "id": "hsqcu1z",
                            "parent_id": "t1_hsqbmp9",
                            "score": 5,
                            "created_utc": 1642225403.0,
                            "replies": [
                                {
                                    "body": "It’s not that hard to understand. We’re all dealt a hand. How you play it is up to you",
                                    "author": "throwawaymeter",
                                    "id": "hsqczw9",
                                    "parent_id": "t1_hsqcu1z",
                                    "score": 7,
                                    "created_utc": 1642225496.0,
                                    "replies": [
                                        {
                                            "body": "Yes, I tend to agree with that.",
                                            "author": "coolerthanbeans45",
                                            "id": "hsqd46e",
                                            "parent_id": "t1_hsqczw9",
                                            "score": 3,
                                            "created_utc": 1642225566.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I never said it was right... I just said that's the way things are. I don't think it's good, but unfortunately capitalism weaponizes racism & this style of dating is driven by capitalistic ideals so you have to just be real with yourself. I'm not trying to solve racism by sugar dating. I know it exists, so I move accordingly. I suggest all other BW do the same.",
                    "author": "coolerthanbeans45",
                    "id": "hsq96jz",
                    "parent_id": "t1_hsq7m2u",
                    "score": 5,
                    "created_utc": 1642223396.0,
                    "replies": [
                        {
                            "body": "You can't gripe about capitalism and be a SB. The excess of capitalism is what's paying for our asses.",
                            "author": "Not_That_Girl_13",
                            "id": "hsqdi9e",
                            "parent_id": "t1_hsq96jz",
                            "score": 11,
                            "created_utc": 1642225793.0,
                            "replies": [
                                {
                                    "body": "this is exactly what i'm saying... captalism weaponizes racism, colorism, texturism, etc. So, how can you complain about someone not being attracted to you when they are lterally paying to look at you, be around you, etc.? Move along. Chew the meat and spit out the bones.",
                                    "author": "coolerthanbeans45",
                                    "id": "hsqe1qa",
                                    "parent_id": "t1_hsqdi9e",
                                    "score": 2,
                                    "created_utc": 1642226112.0,
                                    "replies": [
                                        {
                                            "body": "North Korea is communist, I don't think Kim Jong is sleeping with ugly girls. Venezuela is socialist, the president isn't sleeping with ugly girls. It's not about race, it's about what the rich and powerful find attractive.",
                                            "author": "Not_That_Girl_13",
                                            "id": "hsqefds",
                                            "parent_id": "t1_hsqe1qa",
                                            "score": 5,
                                            "created_utc": 1642226341.0,
                                            "replies": [
                                                {
                                                    "body": "Right on the money.",
                                                    "author": "coolerthanbeans45",
                                                    "id": "hsqekfd",
                                                    "parent_id": "t1_hsqefds",
                                                    "score": 2,
                                                    "created_utc": 1642226424.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "> \"captalism weaponizes racism\"\n\nSounds like something from a sophomoric lecture  \n\nIf someone is a \"pure capitalist\" then there is no room for racism; everything is profit driven.  Actually the absence of capitalism, responsibility for delivering value, weaponizes racism.",
                                            "author": "pinotandsugar",
                                            "id": "hsql1y7",
                                            "parent_id": "t1_hsqe1qa",
                                            "score": 2,
                                            "created_utc": 1642230650.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Black SB's are more common than white, I'm not even going to talk to the things I've heard middle eastern and Japanese girls making. Scarcity drives up value.",
                    "author": "Not_That_Girl_13",
                    "id": "hsqdb5b",
                    "parent_id": "t1_hsq7m2u",
                    "score": 4,
                    "created_utc": 1642225678.0,
                    "replies": [
                        {
                            "body": " \nMy advice would be the same as that of a basketball coach, instructor, employer.....  Don't look for reasons why you are struggling but rather look for ways to succeed.",
                            "author": "pinotandsugar",
                            "id": "hsqlett",
                            "parent_id": "t1_hsqdb5b",
                            "score": 6,
                            "created_utc": 1642230899.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m sorry but I do not agree with this at all, it’s 2022, we shouldn’t have to work harder than everyone in order to get lesser than results. That doesn’t make any sense…\n\nI’m currently reading *”Black girls must die exhausted”* by Jayne Allen and it gives into this topic",
            "author": "Forsaken_Software394",
            "id": "hsqdhsg",
            "parent_id": "t1_hsq5x31",
            "score": -8,
            "created_utc": 1642225786.0,
            "replies": [
                {
                    "body": "You don’t need to agree, but it’s the truth.",
                    "author": "throwawaymeter",
                    "id": "hsqeq9y",
                    "parent_id": "t1_hsqdhsg",
                    "score": 9,
                    "created_utc": 1642226524.0,
                    "replies": []
                },
                {
                    "body": "I guess me stating the realities is me agreeing with them... This conversation is not making me any money, so with that, i rest my case. Goodnight, everyone! Be blessed.",
                    "author": "coolerthanbeans45",
                    "id": "hsqef4n",
                    "parent_id": "t1_hsqdhsg",
                    "score": 6,
                    "created_utc": 1642226337.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hsqakrf",
            "parent_id": "t1_hsqa8rp",
            "score": 27,
            "created_utc": 1642224145.0,
            "replies": [
                {
                    "body": "should probably edit with old, white, and wealthy.  it's more accurate",
                    "author": "throwawaymeter",
                    "id": "hsqaync",
                    "parent_id": "t1_hsqakrf",
                    "score": 16,
                    "created_utc": 1642224362.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hsqb2pv",
                            "parent_id": "t1_hsqaync",
                            "score": 11,
                            "created_utc": 1642224426.0,
                            "replies": [
                                {
                                    "body": "Wealthy black people have more in common with wealthy white people than urban black people. Not really a secret",
                                    "author": "Not_That_Girl_13",
                                    "id": "hsqe0kd",
                                    "parent_id": "t1_hsqb2pv",
                                    "score": 43,
                                    "created_utc": 1642226093.0,
                                    "replies": []
                                },
                                {
                                    "body": "question though, are there many black SDs?  From my perception, the answer is no.  but i have no idea.  all i know is that white men are overwhelmingly the people in power and have money",
                                    "author": "throwawaymeter",
                                    "id": "hsqbrmc",
                                    "parent_id": "t1_hsqb2pv",
                                    "score": 8,
                                    "created_utc": 1642224809.0,
                                    "replies": [
                                        {
                                            "body": "I wanna shed some light. I've seen black men who had made their money, and they dated younger black women and lavished them with gifts and financial security. They didn't call it SR, they thought of it as more what happens when you're successful and single. You get the cream of the crop.\n\nI call that a SR, they don't",
                                            "author": "Not_That_Girl_13",
                                            "id": "hsqe5vt",
                                            "parent_id": "t1_hsqbrmc",
                                            "score": 28,
                                            "created_utc": 1642226183.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "They don’t want to admit that they find attractive black women ‘intimidating’",
            "author": "kikienen",
            "id": "hsq7s0o",
            "parent_id": "t1_hsq7don",
            "score": 29,
            "created_utc": 1642222645.0,
            "replies": [
                {
                    "body": "intimidating is only one factor.  imagine if you're a 65 year old white male.  Being with a 21 year old white female is already a double take.  Now imagine the 65 year old male with a 21 year old black female. it's simply harder to be discreet.\n\nno saying it's right, but there are 2 sides to every coin.  but yeah, the SD comments are many times racist",
                    "author": "throwawaymeter",
                    "id": "hsqcglu",
                    "parent_id": "t1_hsq7s0o",
                    "score": 18,
                    "created_utc": 1642225193.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ve never seen a BW profile review that doesn’t have disgusting comments on it, smh",
            "author": "kikienen",
            "id": "hsq5ss3",
            "parent_id": "t1_hsq5gph",
            "score": 14,
            "created_utc": 1642221574.0,
            "replies": []
        },
        {
            "body": "they might be judged more harshly, both with and without unconscious bias.  but, the profiles are simply not geared to capture the attention of your typical SD.  It's a profile review.  Even if harsh, the SDs are guiding the profile towards something they'd rather see.",
            "author": "throwawaymeter",
            "id": "hsqby6k",
            "parent_id": "t1_hsq5gph",
            "score": 4,
            "created_utc": 1642224909.0,
            "replies": [
                {
                    "body": "I can be fairly harsh and blunt, but I do it with the hopes that every woman can land her whale and never have to work another day in her life. I might be more popular if I sugar coat stuff, but too many people get these ideas that are based in fantasy land.",
                    "author": "Not_That_Girl_13",
                    "id": "hsqd3q9",
                    "parent_id": "t1_hsqby6k",
                    "score": 3,
                    "created_utc": 1642225559.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I saw your profile review post and that one guy (you know who I mean) made me ill. I’m sorry for what you had to absorb.",
            "author": "ThrowawayUserID1501",
            "id": "hsqbdc6",
            "parent_id": "t1_hsq5tsk",
            "score": 11,
            "created_utc": 1642224588.0,
            "replies": [
                {
                    "body": "That guy was a weirdo.",
                    "author": "Iambriiee",
                    "id": "hsqccfw",
                    "parent_id": "t1_hsqbdc6",
                    "score": 8,
                    "created_utc": 1642225128.0,
                    "replies": [
                        {
                            "body": "Lol, he's a bit of an odd duck. But he's always treated me good :) shame he got banned from this subreddit, I talked him into getting back on Reddit. Now I have to hear him moan and groan for an hour",
                            "author": "Not_That_Girl_13",
                            "id": "hsqdp18",
                            "parent_id": "t1_hsqccfw",
                            "score": -3,
                            "created_utc": 1642225902.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sweetie your post inspired this honestly, you didn’t deserve such comments",
            "author": "kikienen",
            "id": "hsq667u",
            "parent_id": "t1_hsq5tsk",
            "score": 14,
            "created_utc": 1642221774.0,
            "replies": [
                {
                    "body": "Lol the one really long comment on my PR is what pushed me to delete both posts. Like wow, why did I trigger you that badly!? Idk if you saw my “discouraged” post from earlier but there were some words said after the revelation that I’m not a white woman.",
                    "author": "Iambriiee",
                    "id": "hsq6gif",
                    "parent_id": "t1_hsq667u",
                    "score": 6,
                    "created_utc": 1642221929.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for your contribution then",
            "author": "QuirkyComplex",
            "id": "hsq918l",
            "parent_id": "t1_hsq8vth",
            "score": 9,
            "created_utc": 1642223317.0,
            "replies": []
        },
        {
            "body": "How does your room smell after spewing all these bull crap because this is a dirty lie.",
            "author": "kikienen",
            "id": "hsq9kjf",
            "parent_id": "t1_hsq8vth",
            "score": 7,
            "created_utc": 1642223607.0,
            "replies": [
                {
                    "body": "It's 100% all true. You know what's so funny ? I have a homegirl who is also a sister. She sugar date with white men 95% of the time. She does not have even half the problems I read in this sub from other black women. She is winning.  \n\n\nShe does basic shit. Good clear pictures. Always come out the house on point. Targets men who have the disposable income. Shit, she got a man to give her the cash to purchase  luxury vehicle. I saw the money transfer and rode in the car. I use to tell her she should do coaching. But now I know whys she says no and it's a waste of time.  \n\n\nWomen are lazy as fuck. They won't do the things she does to get the bag, regardless of race. Reading the shit in this sub I believe her. Women not going to put that work in for self improvement. So I already know some ladies going to downvote this shit. Don't change the facts on the ground.",
                    "author": "southernslick",
                    "id": "hsqaos9",
                    "parent_id": "t1_hsq9kjf",
                    "score": 15,
                    "created_utc": 1642224207.0,
                    "replies": [
                        {
                            "body": "Wowww. I was invested in the first half of your comment. Then you derailed and just proved everyone’s point. I guess misogyny doesn’t discriminate either.",
                            "author": "lipslikesugar88",
                            "id": "hsqbu6c",
                            "parent_id": "t1_hsqaos9",
                            "score": 25,
                            "created_utc": 1642224849.0,
                            "replies": [
                                {
                                    "body": "The definition of misogyny is contempt for women. Could you point out at what point did I show contempt to for women in my response ??",
                                    "author": "southernslick",
                                    "id": "hsqd9ir",
                                    "parent_id": "t1_hsqbu6c",
                                    "score": -1,
                                    "created_utc": 1642225652.0,
                                    "replies": [
                                        {
                                            "body": "Lol\n\n“Women are lazy as fuck”. \n\nThe end.",
                                            "author": "lipslikesugar88",
                                            "id": "hsqdg2i",
                                            "parent_id": "t1_hsqd9ir",
                                            "score": 20,
                                            "created_utc": 1642225758.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "> Could you point out at what point did I show contempt to for women in my response ??\n\nCome on, man, seriously?\n\n> Women are lazy as fuck.",
                                            "author": "Y_4Z44",
                                            "id": "hsqe0wy",
                                            "parent_id": "t1_hsqd9ir",
                                            "score": 12,
                                            "created_utc": 1642226099.0,
                                            "replies": [
                                                {
                                                    "body": "Now you’re just playing with my emotions 😉",
                                                    "author": "lipslikesugar88",
                                                    "id": "hsqes1m",
                                                    "parent_id": "t1_hsqe0wy",
                                                    "score": 2,
                                                    "created_utc": 1642226554.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This, right here.",
            "author": "Not_That_Girl_13",
            "id": "hsqdrym",
            "parent_id": "t1_hsq8vth",
            "score": 1,
            "created_utc": 1642225951.0,
            "replies": []
        },
        {
            "body": "You are not obligated to engage in topics and conversations that tire you. Scroll past if it's such an issue",
            "author": "QuirkyComplex",
            "id": "hsq93e5",
            "parent_id": "t1_hsq8snl",
            "score": 20,
            "created_utc": 1642223349.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hsqa8s2",
                    "parent_id": "t1_hsq93e5",
                    "score": 11,
                    "created_utc": 1642223967.0,
                    "replies": [
                        {
                            "body": "Maybe you can hop over to the armpit hair post and contribute that same energy. But wait. A white SD wrote that post….cmon now. Do better please!!",
                            "author": "lipslikesugar88",
                            "id": "hsqakhm",
                            "parent_id": "t1_hsqa8s2",
                            "score": 3,
                            "created_utc": 1642224141.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hsqan3i",
                                    "parent_id": "t1_hsqakhm",
                                    "score": 2,
                                    "created_utc": 1642224181.0,
                                    "replies": [
                                        {
                                            "body": "Ooo gave me butterflies when you called me sweetheart.",
                                            "author": "lipslikesugar88",
                                            "id": "hsqaqgy",
                                            "parent_id": "t1_hsqan3i",
                                            "score": 4,
                                            "created_utc": 1642224233.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "hsqaue9",
                            "parent_id": "t1_hsqa8s2",
                            "score": 1,
                            "created_utc": 1642224294.0,
                            "replies": [
                                {
                                    "body": "> The same conversations are regularly beaten to death on this sub\n\nYou've been here less than a day and you know this, huh? You using an alt to avoid soiling your regular user name or evading a ban?",
                                    "author": "Y_4Z44",
                                    "id": "hsqcje7",
                                    "parent_id": "t1_hsqaue9",
                                    "score": 7,
                                    "created_utc": 1642225237.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hsqcbhv",
                                    "parent_id": "t1_hsqaue9",
                                    "score": -3,
                                    "created_utc": 1642225112.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You could have made your point *far more effectively* if you'd used different words, friend.",
            "author": "Y_4Z44",
            "id": "hsqabte",
            "parent_id": "t1_hsqa649",
            "score": 5,
            "created_utc": 1642224012.0,
            "replies": []
        },
        {
            "body": "Thanks. All my experiences have been pretty awesome",
            "author": "mikemac51973",
            "id": "hsq9xjb",
            "parent_id": "t1_hsq9irp",
            "score": 20,
            "created_utc": 1642223796.0,
            "replies": []
        },
        {
            "body": "See...honey, the fact you took constructive criticism, got in your feelings over it, and then tried to project that back at me like I'm \"shuckin n jivin\" is exactly why WE (WOC) stay stuck. But if you like it there, God bless you.",
            "author": "letsjusthavefunnow",
            "id": "hsqf6ym",
            "parent_id": "t1_hsqewkt",
            "score": 97,
            "created_utc": 1642226806.0,
            "replies": []
        },
        {
            "body": "Thank you but yes that’s why I mentioned that I’ve contacted SDs from the thread to review my profile. I’ve never been left on read by them, and have always been helped/greeted with open arms. I’m just putting that out there to say my experience has not been what’s mentioned but I also am not super active on this thread (until recently) & I don’t look at profile reviews (only the one I posted).",
            "author": "coolerthanbeans45",
            "id": "hsqcnx6",
            "parent_id": "t1_hsq6h64",
            "score": 4,
            "created_utc": 1642225308.0,
            "replies": []
        },
        {
            "body": "It’s true, though. Any SB that deviates from what’s considering conventional in the bowl will have to work harder to find success. We all have preconceived notions about others that happen to affect how we choose POTs. And it seems that the poster-girl of all SBs happens to be a white sorority-girl type. That might not be what everyone is looking for, but I think that’s the common perception of what an SB is (I mean FFS, just look at how sites like SA advertise their members + target demographics). \n\nSome SDs shy away from Black SBs because they believe we’re ghetto, unkempt/trashy, and only in it for the money. Obviously that’s a stereotype and doesn’t represent everyone, but it’s an obstacle we have to accept in order to overcome it. Blaming it on racism and saying that all SDs need to do better isn’t productive because it’s not going to change anything. Instead, find little ways to prove them wrong and show that Black SBs can be just as good as any other SB. \n\nFWIW, I judge all profile reviews evenly despite race. Perks of being a mixed girl I guess 😅. Though Black SBs have to be more aware of the negative stereotypes that are stacked against them in the bowl. Pointing out aspects of their profile that might play into them and how to avoid that is, IMO, an important piece of feedback that’ll help us challenge unfair stereotypes in the long run.",
            "author": "curly_spice",
            "id": "hsqasip",
            "parent_id": "t1_hsq7m2u",
            "score": 27,
            "created_utc": 1642224265.0,
            "replies": [
                {
                    "body": ">only in it for the money\n\nWhite 19 year old sorority girl here. I am only in it for money lol. I have no shame in it.",
                    "author": "Not_That_Girl_13",
                    "id": "hsqdf0g",
                    "parent_id": "t1_hsqasip",
                    "score": 22,
                    "created_utc": 1642225740.0,
                    "replies": []
                },
                {
                    "body": "Thank you.",
                    "author": "coolerthanbeans45",
                    "id": "hsqcz2l",
                    "parent_id": "t1_hsqasip",
                    "score": 3,
                    "created_utc": 1642225483.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "no.  comments like this are lazy.  there's a difference between understanding how the world works and navigating it with that understanding vs. trying to constantly running into a wall and hoping it eventually won't hurt.  \n\ni'm a short male, i've  had to accept that my dating pool is smaller than your typical 5'9+ male.  It's the way the world works.  Hell, i've had SBs say no to me because of height.  last time i checked, my money is just as real as a taller male.",
            "author": "throwawaymeter",
            "id": "hsqbmp9",
            "parent_id": "t1_hsq7m2u",
            "score": 14,
            "created_utc": 1642224733.0,
            "replies": [
                {
                    "body": "I don’t really understand the point here.",
                    "author": "coolerthanbeans45",
                    "id": "hsqcu1z",
                    "parent_id": "t1_hsqbmp9",
                    "score": 5,
                    "created_utc": 1642225403.0,
                    "replies": [
                        {
                            "body": "It’s not that hard to understand. We’re all dealt a hand. How you play it is up to you",
                            "author": "throwawaymeter",
                            "id": "hsqczw9",
                            "parent_id": "t1_hsqcu1z",
                            "score": 7,
                            "created_utc": 1642225496.0,
                            "replies": [
                                {
                                    "body": "Yes, I tend to agree with that.",
                                    "author": "coolerthanbeans45",
                                    "id": "hsqd46e",
                                    "parent_id": "t1_hsqczw9",
                                    "score": 3,
                                    "created_utc": 1642225566.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I never said it was right... I just said that's the way things are. I don't think it's good, but unfortunately capitalism weaponizes racism & this style of dating is driven by capitalistic ideals so you have to just be real with yourself. I'm not trying to solve racism by sugar dating. I know it exists, so I move accordingly. I suggest all other BW do the same.",
            "author": "coolerthanbeans45",
            "id": "hsq96jz",
            "parent_id": "t1_hsq7m2u",
            "score": 5,
            "created_utc": 1642223396.0,
            "replies": [
                {
                    "body": "You can't gripe about capitalism and be a SB. The excess of capitalism is what's paying for our asses.",
                    "author": "Not_That_Girl_13",
                    "id": "hsqdi9e",
                    "parent_id": "t1_hsq96jz",
                    "score": 11,
                    "created_utc": 1642225793.0,
                    "replies": [
                        {
                            "body": "this is exactly what i'm saying... captalism weaponizes racism, colorism, texturism, etc. So, how can you complain about someone not being attracted to you when they are lterally paying to look at you, be around you, etc.? Move along. Chew the meat and spit out the bones.",
                            "author": "coolerthanbeans45",
                            "id": "hsqe1qa",
                            "parent_id": "t1_hsqdi9e",
                            "score": 2,
                            "created_utc": 1642226112.0,
                            "replies": [
                                {
                                    "body": "North Korea is communist, I don't think Kim Jong is sleeping with ugly girls. Venezuela is socialist, the president isn't sleeping with ugly girls. It's not about race, it's about what the rich and powerful find attractive.",
                                    "author": "Not_That_Girl_13",
                                    "id": "hsqefds",
                                    "parent_id": "t1_hsqe1qa",
                                    "score": 5,
                                    "created_utc": 1642226341.0,
                                    "replies": [
                                        {
                                            "body": "Right on the money.",
                                            "author": "coolerthanbeans45",
                                            "id": "hsqekfd",
                                            "parent_id": "t1_hsqefds",
                                            "score": 2,
                                            "created_utc": 1642226424.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "> \"captalism weaponizes racism\"\n\nSounds like something from a sophomoric lecture  \n\nIf someone is a \"pure capitalist\" then there is no room for racism; everything is profit driven.  Actually the absence of capitalism, responsibility for delivering value, weaponizes racism.",
                                    "author": "pinotandsugar",
                                    "id": "hsql1y7",
                                    "parent_id": "t1_hsqe1qa",
                                    "score": 2,
                                    "created_utc": 1642230650.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Black SB's are more common than white, I'm not even going to talk to the things I've heard middle eastern and Japanese girls making. Scarcity drives up value.",
            "author": "Not_That_Girl_13",
            "id": "hsqdb5b",
            "parent_id": "t1_hsq7m2u",
            "score": 4,
            "created_utc": 1642225678.0,
            "replies": [
                {
                    "body": " \nMy advice would be the same as that of a basketball coach, instructor, employer.....  Don't look for reasons why you are struggling but rather look for ways to succeed.",
                    "author": "pinotandsugar",
                    "id": "hsqlett",
                    "parent_id": "t1_hsqdb5b",
                    "score": 6,
                    "created_utc": 1642230899.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You don’t need to agree, but it’s the truth.",
            "author": "throwawaymeter",
            "id": "hsqeq9y",
            "parent_id": "t1_hsqdhsg",
            "score": 9,
            "created_utc": 1642226524.0,
            "replies": []
        },
        {
            "body": "I guess me stating the realities is me agreeing with them... This conversation is not making me any money, so with that, i rest my case. Goodnight, everyone! Be blessed.",
            "author": "coolerthanbeans45",
            "id": "hsqef4n",
            "parent_id": "t1_hsqdhsg",
            "score": 6,
            "created_utc": 1642226337.0,
            "replies": []
        },
        {
            "body": "should probably edit with old, white, and wealthy.  it's more accurate",
            "author": "throwawaymeter",
            "id": "hsqaync",
            "parent_id": "t1_hsqakrf",
            "score": 16,
            "created_utc": 1642224362.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hsqb2pv",
                    "parent_id": "t1_hsqaync",
                    "score": 11,
                    "created_utc": 1642224426.0,
                    "replies": [
                        {
                            "body": "Wealthy black people have more in common with wealthy white people than urban black people. Not really a secret",
                            "author": "Not_That_Girl_13",
                            "id": "hsqe0kd",
                            "parent_id": "t1_hsqb2pv",
                            "score": 43,
                            "created_utc": 1642226093.0,
                            "replies": []
                        },
                        {
                            "body": "question though, are there many black SDs?  From my perception, the answer is no.  but i have no idea.  all i know is that white men are overwhelmingly the people in power and have money",
                            "author": "throwawaymeter",
                            "id": "hsqbrmc",
                            "parent_id": "t1_hsqb2pv",
                            "score": 8,
                            "created_utc": 1642224809.0,
                            "replies": [
                                {
                                    "body": "I wanna shed some light. I've seen black men who had made their money, and they dated younger black women and lavished them with gifts and financial security. They didn't call it SR, they thought of it as more what happens when you're successful and single. You get the cream of the crop.\n\nI call that a SR, they don't",
                                    "author": "Not_That_Girl_13",
                                    "id": "hsqe5vt",
                                    "parent_id": "t1_hsqbrmc",
                                    "score": 28,
                                    "created_utc": 1642226183.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "intimidating is only one factor.  imagine if you're a 65 year old white male.  Being with a 21 year old white female is already a double take.  Now imagine the 65 year old male with a 21 year old black female. it's simply harder to be discreet.\n\nno saying it's right, but there are 2 sides to every coin.  but yeah, the SD comments are many times racist",
            "author": "throwawaymeter",
            "id": "hsqcglu",
            "parent_id": "t1_hsq7s0o",
            "score": 18,
            "created_utc": 1642225193.0,
            "replies": []
        },
        {
            "body": "I can be fairly harsh and blunt, but I do it with the hopes that every woman can land her whale and never have to work another day in her life. I might be more popular if I sugar coat stuff, but too many people get these ideas that are based in fantasy land.",
            "author": "Not_That_Girl_13",
            "id": "hsqd3q9",
            "parent_id": "t1_hsqby6k",
            "score": 3,
            "created_utc": 1642225559.0,
            "replies": []
        },
        {
            "body": "That guy was a weirdo.",
            "author": "Iambriiee",
            "id": "hsqccfw",
            "parent_id": "t1_hsqbdc6",
            "score": 8,
            "created_utc": 1642225128.0,
            "replies": [
                {
                    "body": "Lol, he's a bit of an odd duck. But he's always treated me good :) shame he got banned from this subreddit, I talked him into getting back on Reddit. Now I have to hear him moan and groan for an hour",
                    "author": "Not_That_Girl_13",
                    "id": "hsqdp18",
                    "parent_id": "t1_hsqccfw",
                    "score": -3,
                    "created_utc": 1642225902.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol the one really long comment on my PR is what pushed me to delete both posts. Like wow, why did I trigger you that badly!? Idk if you saw my “discouraged” post from earlier but there were some words said after the revelation that I’m not a white woman.",
            "author": "Iambriiee",
            "id": "hsq6gif",
            "parent_id": "t1_hsq667u",
            "score": 6,
            "created_utc": 1642221929.0,
            "replies": []
        },
        {
            "body": "It's 100% all true. You know what's so funny ? I have a homegirl who is also a sister. She sugar date with white men 95% of the time. She does not have even half the problems I read in this sub from other black women. She is winning.  \n\n\nShe does basic shit. Good clear pictures. Always come out the house on point. Targets men who have the disposable income. Shit, she got a man to give her the cash to purchase  luxury vehicle. I saw the money transfer and rode in the car. I use to tell her she should do coaching. But now I know whys she says no and it's a waste of time.  \n\n\nWomen are lazy as fuck. They won't do the things she does to get the bag, regardless of race. Reading the shit in this sub I believe her. Women not going to put that work in for self improvement. So I already know some ladies going to downvote this shit. Don't change the facts on the ground.",
            "author": "southernslick",
            "id": "hsqaos9",
            "parent_id": "t1_hsq9kjf",
            "score": 15,
            "created_utc": 1642224207.0,
            "replies": [
                {
                    "body": "Wowww. I was invested in the first half of your comment. Then you derailed and just proved everyone’s point. I guess misogyny doesn’t discriminate either.",
                    "author": "lipslikesugar88",
                    "id": "hsqbu6c",
                    "parent_id": "t1_hsqaos9",
                    "score": 25,
                    "created_utc": 1642224849.0,
                    "replies": [
                        {
                            "body": "The definition of misogyny is contempt for women. Could you point out at what point did I show contempt to for women in my response ??",
                            "author": "southernslick",
                            "id": "hsqd9ir",
                            "parent_id": "t1_hsqbu6c",
                            "score": -1,
                            "created_utc": 1642225652.0,
                            "replies": [
                                {
                                    "body": "Lol\n\n“Women are lazy as fuck”. \n\nThe end.",
                                    "author": "lipslikesugar88",
                                    "id": "hsqdg2i",
                                    "parent_id": "t1_hsqd9ir",
                                    "score": 20,
                                    "created_utc": 1642225758.0,
                                    "replies": []
                                },
                                {
                                    "body": "> Could you point out at what point did I show contempt to for women in my response ??\n\nCome on, man, seriously?\n\n> Women are lazy as fuck.",
                                    "author": "Y_4Z44",
                                    "id": "hsqe0wy",
                                    "parent_id": "t1_hsqd9ir",
                                    "score": 12,
                                    "created_utc": 1642226099.0,
                                    "replies": [
                                        {
                                            "body": "Now you’re just playing with my emotions 😉",
                                            "author": "lipslikesugar88",
                                            "id": "hsqes1m",
                                            "parent_id": "t1_hsqe0wy",
                                            "score": 2,
                                            "created_utc": 1642226554.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hsqa8s2",
            "parent_id": "t1_hsq93e5",
            "score": 11,
            "created_utc": 1642223967.0,
            "replies": [
                {
                    "body": "Maybe you can hop over to the armpit hair post and contribute that same energy. But wait. A white SD wrote that post….cmon now. Do better please!!",
                    "author": "lipslikesugar88",
                    "id": "hsqakhm",
                    "parent_id": "t1_hsqa8s2",
                    "score": 3,
                    "created_utc": 1642224141.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hsqan3i",
                            "parent_id": "t1_hsqakhm",
                            "score": 2,
                            "created_utc": 1642224181.0,
                            "replies": [
                                {
                                    "body": "Ooo gave me butterflies when you called me sweetheart.",
                                    "author": "lipslikesugar88",
                                    "id": "hsqaqgy",
                                    "parent_id": "t1_hsqan3i",
                                    "score": 4,
                                    "created_utc": 1642224233.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "hsqaue9",
                    "parent_id": "t1_hsqa8s2",
                    "score": 1,
                    "created_utc": 1642224294.0,
                    "replies": [
                        {
                            "body": "> The same conversations are regularly beaten to death on this sub\n\nYou've been here less than a day and you know this, huh? You using an alt to avoid soiling your regular user name or evading a ban?",
                            "author": "Y_4Z44",
                            "id": "hsqcje7",
                            "parent_id": "t1_hsqaue9",
                            "score": 7,
                            "created_utc": 1642225237.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hsqcbhv",
                            "parent_id": "t1_hsqaue9",
                            "score": -3,
                            "created_utc": 1642225112.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">only in it for the money\n\nWhite 19 year old sorority girl here. I am only in it for money lol. I have no shame in it.",
            "author": "Not_That_Girl_13",
            "id": "hsqdf0g",
            "parent_id": "t1_hsqasip",
            "score": 22,
            "created_utc": 1642225740.0,
            "replies": []
        },
        {
            "body": "Thank you.",
            "author": "coolerthanbeans45",
            "id": "hsqcz2l",
            "parent_id": "t1_hsqasip",
            "score": 3,
            "created_utc": 1642225483.0,
            "replies": []
        },
        {
            "body": "I don’t really understand the point here.",
            "author": "coolerthanbeans45",
            "id": "hsqcu1z",
            "parent_id": "t1_hsqbmp9",
            "score": 5,
            "created_utc": 1642225403.0,
            "replies": [
                {
                    "body": "It’s not that hard to understand. We’re all dealt a hand. How you play it is up to you",
                    "author": "throwawaymeter",
                    "id": "hsqczw9",
                    "parent_id": "t1_hsqcu1z",
                    "score": 7,
                    "created_utc": 1642225496.0,
                    "replies": [
                        {
                            "body": "Yes, I tend to agree with that.",
                            "author": "coolerthanbeans45",
                            "id": "hsqd46e",
                            "parent_id": "t1_hsqczw9",
                            "score": 3,
                            "created_utc": 1642225566.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You can't gripe about capitalism and be a SB. The excess of capitalism is what's paying for our asses.",
            "author": "Not_That_Girl_13",
            "id": "hsqdi9e",
            "parent_id": "t1_hsq96jz",
            "score": 11,
            "created_utc": 1642225793.0,
            "replies": [
                {
                    "body": "this is exactly what i'm saying... captalism weaponizes racism, colorism, texturism, etc. So, how can you complain about someone not being attracted to you when they are lterally paying to look at you, be around you, etc.? Move along. Chew the meat and spit out the bones.",
                    "author": "coolerthanbeans45",
                    "id": "hsqe1qa",
                    "parent_id": "t1_hsqdi9e",
                    "score": 2,
                    "created_utc": 1642226112.0,
                    "replies": [
                        {
                            "body": "North Korea is communist, I don't think Kim Jong is sleeping with ugly girls. Venezuela is socialist, the president isn't sleeping with ugly girls. It's not about race, it's about what the rich and powerful find attractive.",
                            "author": "Not_That_Girl_13",
                            "id": "hsqefds",
                            "parent_id": "t1_hsqe1qa",
                            "score": 5,
                            "created_utc": 1642226341.0,
                            "replies": [
                                {
                                    "body": "Right on the money.",
                                    "author": "coolerthanbeans45",
                                    "id": "hsqekfd",
                                    "parent_id": "t1_hsqefds",
                                    "score": 2,
                                    "created_utc": 1642226424.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "> \"captalism weaponizes racism\"\n\nSounds like something from a sophomoric lecture  \n\nIf someone is a \"pure capitalist\" then there is no room for racism; everything is profit driven.  Actually the absence of capitalism, responsibility for delivering value, weaponizes racism.",
                            "author": "pinotandsugar",
                            "id": "hsql1y7",
                            "parent_id": "t1_hsqe1qa",
                            "score": 2,
                            "created_utc": 1642230650.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": " \nMy advice would be the same as that of a basketball coach, instructor, employer.....  Don't look for reasons why you are struggling but rather look for ways to succeed.",
            "author": "pinotandsugar",
            "id": "hsqlett",
            "parent_id": "t1_hsqdb5b",
            "score": 6,
            "created_utc": 1642230899.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hsqb2pv",
            "parent_id": "t1_hsqaync",
            "score": 11,
            "created_utc": 1642224426.0,
            "replies": [
                {
                    "body": "Wealthy black people have more in common with wealthy white people than urban black people. Not really a secret",
                    "author": "Not_That_Girl_13",
                    "id": "hsqe0kd",
                    "parent_id": "t1_hsqb2pv",
                    "score": 43,
                    "created_utc": 1642226093.0,
                    "replies": []
                },
                {
                    "body": "question though, are there many black SDs?  From my perception, the answer is no.  but i have no idea.  all i know is that white men are overwhelmingly the people in power and have money",
                    "author": "throwawaymeter",
                    "id": "hsqbrmc",
                    "parent_id": "t1_hsqb2pv",
                    "score": 8,
                    "created_utc": 1642224809.0,
                    "replies": [
                        {
                            "body": "I wanna shed some light. I've seen black men who had made their money, and they dated younger black women and lavished them with gifts and financial security. They didn't call it SR, they thought of it as more what happens when you're successful and single. You get the cream of the crop.\n\nI call that a SR, they don't",
                            "author": "Not_That_Girl_13",
                            "id": "hsqe5vt",
                            "parent_id": "t1_hsqbrmc",
                            "score": 28,
                            "created_utc": 1642226183.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol, he's a bit of an odd duck. But he's always treated me good :) shame he got banned from this subreddit, I talked him into getting back on Reddit. Now I have to hear him moan and groan for an hour",
            "author": "Not_That_Girl_13",
            "id": "hsqdp18",
            "parent_id": "t1_hsqccfw",
            "score": -3,
            "created_utc": 1642225902.0,
            "replies": []
        },
        {
            "body": "Wowww. I was invested in the first half of your comment. Then you derailed and just proved everyone’s point. I guess misogyny doesn’t discriminate either.",
            "author": "lipslikesugar88",
            "id": "hsqbu6c",
            "parent_id": "t1_hsqaos9",
            "score": 25,
            "created_utc": 1642224849.0,
            "replies": [
                {
                    "body": "The definition of misogyny is contempt for women. Could you point out at what point did I show contempt to for women in my response ??",
                    "author": "southernslick",
                    "id": "hsqd9ir",
                    "parent_id": "t1_hsqbu6c",
                    "score": -1,
                    "created_utc": 1642225652.0,
                    "replies": [
                        {
                            "body": "Lol\n\n“Women are lazy as fuck”. \n\nThe end.",
                            "author": "lipslikesugar88",
                            "id": "hsqdg2i",
                            "parent_id": "t1_hsqd9ir",
                            "score": 20,
                            "created_utc": 1642225758.0,
                            "replies": []
                        },
                        {
                            "body": "> Could you point out at what point did I show contempt to for women in my response ??\n\nCome on, man, seriously?\n\n> Women are lazy as fuck.",
                            "author": "Y_4Z44",
                            "id": "hsqe0wy",
                            "parent_id": "t1_hsqd9ir",
                            "score": 12,
                            "created_utc": 1642226099.0,
                            "replies": [
                                {
                                    "body": "Now you’re just playing with my emotions 😉",
                                    "author": "lipslikesugar88",
                                    "id": "hsqes1m",
                                    "parent_id": "t1_hsqe0wy",
                                    "score": 2,
                                    "created_utc": 1642226554.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Maybe you can hop over to the armpit hair post and contribute that same energy. But wait. A white SD wrote that post….cmon now. Do better please!!",
            "author": "lipslikesugar88",
            "id": "hsqakhm",
            "parent_id": "t1_hsqa8s2",
            "score": 3,
            "created_utc": 1642224141.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hsqan3i",
                    "parent_id": "t1_hsqakhm",
                    "score": 2,
                    "created_utc": 1642224181.0,
                    "replies": [
                        {
                            "body": "Ooo gave me butterflies when you called me sweetheart.",
                            "author": "lipslikesugar88",
                            "id": "hsqaqgy",
                            "parent_id": "t1_hsqan3i",
                            "score": 4,
                            "created_utc": 1642224233.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hsqaue9",
            "parent_id": "t1_hsqa8s2",
            "score": 1,
            "created_utc": 1642224294.0,
            "replies": [
                {
                    "body": "> The same conversations are regularly beaten to death on this sub\n\nYou've been here less than a day and you know this, huh? You using an alt to avoid soiling your regular user name or evading a ban?",
                    "author": "Y_4Z44",
                    "id": "hsqcje7",
                    "parent_id": "t1_hsqaue9",
                    "score": 7,
                    "created_utc": 1642225237.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hsqcbhv",
                    "parent_id": "t1_hsqaue9",
                    "score": -3,
                    "created_utc": 1642225112.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s not that hard to understand. We’re all dealt a hand. How you play it is up to you",
            "author": "throwawaymeter",
            "id": "hsqczw9",
            "parent_id": "t1_hsqcu1z",
            "score": 7,
            "created_utc": 1642225496.0,
            "replies": [
                {
                    "body": "Yes, I tend to agree with that.",
                    "author": "coolerthanbeans45",
                    "id": "hsqd46e",
                    "parent_id": "t1_hsqczw9",
                    "score": 3,
                    "created_utc": 1642225566.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "this is exactly what i'm saying... captalism weaponizes racism, colorism, texturism, etc. So, how can you complain about someone not being attracted to you when they are lterally paying to look at you, be around you, etc.? Move along. Chew the meat and spit out the bones.",
            "author": "coolerthanbeans45",
            "id": "hsqe1qa",
            "parent_id": "t1_hsqdi9e",
            "score": 2,
            "created_utc": 1642226112.0,
            "replies": [
                {
                    "body": "North Korea is communist, I don't think Kim Jong is sleeping with ugly girls. Venezuela is socialist, the president isn't sleeping with ugly girls. It's not about race, it's about what the rich and powerful find attractive.",
                    "author": "Not_That_Girl_13",
                    "id": "hsqefds",
                    "parent_id": "t1_hsqe1qa",
                    "score": 5,
                    "created_utc": 1642226341.0,
                    "replies": [
                        {
                            "body": "Right on the money.",
                            "author": "coolerthanbeans45",
                            "id": "hsqekfd",
                            "parent_id": "t1_hsqefds",
                            "score": 2,
                            "created_utc": 1642226424.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> \"captalism weaponizes racism\"\n\nSounds like something from a sophomoric lecture  \n\nIf someone is a \"pure capitalist\" then there is no room for racism; everything is profit driven.  Actually the absence of capitalism, responsibility for delivering value, weaponizes racism.",
                    "author": "pinotandsugar",
                    "id": "hsql1y7",
                    "parent_id": "t1_hsqe1qa",
                    "score": 2,
                    "created_utc": 1642230650.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wealthy black people have more in common with wealthy white people than urban black people. Not really a secret",
            "author": "Not_That_Girl_13",
            "id": "hsqe0kd",
            "parent_id": "t1_hsqb2pv",
            "score": 43,
            "created_utc": 1642226093.0,
            "replies": []
        },
        {
            "body": "question though, are there many black SDs?  From my perception, the answer is no.  but i have no idea.  all i know is that white men are overwhelmingly the people in power and have money",
            "author": "throwawaymeter",
            "id": "hsqbrmc",
            "parent_id": "t1_hsqb2pv",
            "score": 8,
            "created_utc": 1642224809.0,
            "replies": [
                {
                    "body": "I wanna shed some light. I've seen black men who had made their money, and they dated younger black women and lavished them with gifts and financial security. They didn't call it SR, they thought of it as more what happens when you're successful and single. You get the cream of the crop.\n\nI call that a SR, they don't",
                    "author": "Not_That_Girl_13",
                    "id": "hsqe5vt",
                    "parent_id": "t1_hsqbrmc",
                    "score": 28,
                    "created_utc": 1642226183.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The definition of misogyny is contempt for women. Could you point out at what point did I show contempt to for women in my response ??",
            "author": "southernslick",
            "id": "hsqd9ir",
            "parent_id": "t1_hsqbu6c",
            "score": -1,
            "created_utc": 1642225652.0,
            "replies": [
                {
                    "body": "Lol\n\n“Women are lazy as fuck”. \n\nThe end.",
                    "author": "lipslikesugar88",
                    "id": "hsqdg2i",
                    "parent_id": "t1_hsqd9ir",
                    "score": 20,
                    "created_utc": 1642225758.0,
                    "replies": []
                },
                {
                    "body": "> Could you point out at what point did I show contempt to for women in my response ??\n\nCome on, man, seriously?\n\n> Women are lazy as fuck.",
                    "author": "Y_4Z44",
                    "id": "hsqe0wy",
                    "parent_id": "t1_hsqd9ir",
                    "score": 12,
                    "created_utc": 1642226099.0,
                    "replies": [
                        {
                            "body": "Now you’re just playing with my emotions 😉",
                            "author": "lipslikesugar88",
                            "id": "hsqes1m",
                            "parent_id": "t1_hsqe0wy",
                            "score": 2,
                            "created_utc": 1642226554.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hsqan3i",
            "parent_id": "t1_hsqakhm",
            "score": 2,
            "created_utc": 1642224181.0,
            "replies": [
                {
                    "body": "Ooo gave me butterflies when you called me sweetheart.",
                    "author": "lipslikesugar88",
                    "id": "hsqaqgy",
                    "parent_id": "t1_hsqan3i",
                    "score": 4,
                    "created_utc": 1642224233.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> The same conversations are regularly beaten to death on this sub\n\nYou've been here less than a day and you know this, huh? You using an alt to avoid soiling your regular user name or evading a ban?",
            "author": "Y_4Z44",
            "id": "hsqcje7",
            "parent_id": "t1_hsqaue9",
            "score": 7,
            "created_utc": 1642225237.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hsqcbhv",
            "parent_id": "t1_hsqaue9",
            "score": -3,
            "created_utc": 1642225112.0,
            "replies": []
        },
        {
            "body": "Yes, I tend to agree with that.",
            "author": "coolerthanbeans45",
            "id": "hsqd46e",
            "parent_id": "t1_hsqczw9",
            "score": 3,
            "created_utc": 1642225566.0,
            "replies": []
        },
        {
            "body": "North Korea is communist, I don't think Kim Jong is sleeping with ugly girls. Venezuela is socialist, the president isn't sleeping with ugly girls. It's not about race, it's about what the rich and powerful find attractive.",
            "author": "Not_That_Girl_13",
            "id": "hsqefds",
            "parent_id": "t1_hsqe1qa",
            "score": 5,
            "created_utc": 1642226341.0,
            "replies": [
                {
                    "body": "Right on the money.",
                    "author": "coolerthanbeans45",
                    "id": "hsqekfd",
                    "parent_id": "t1_hsqefds",
                    "score": 2,
                    "created_utc": 1642226424.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> \"captalism weaponizes racism\"\n\nSounds like something from a sophomoric lecture  \n\nIf someone is a \"pure capitalist\" then there is no room for racism; everything is profit driven.  Actually the absence of capitalism, responsibility for delivering value, weaponizes racism.",
            "author": "pinotandsugar",
            "id": "hsql1y7",
            "parent_id": "t1_hsqe1qa",
            "score": 2,
            "created_utc": 1642230650.0,
            "replies": []
        },
        {
            "body": "I wanna shed some light. I've seen black men who had made their money, and they dated younger black women and lavished them with gifts and financial security. They didn't call it SR, they thought of it as more what happens when you're successful and single. You get the cream of the crop.\n\nI call that a SR, they don't",
            "author": "Not_That_Girl_13",
            "id": "hsqe5vt",
            "parent_id": "t1_hsqbrmc",
            "score": 28,
            "created_utc": 1642226183.0,
            "replies": []
        },
        {
            "body": "Lol\n\n“Women are lazy as fuck”. \n\nThe end.",
            "author": "lipslikesugar88",
            "id": "hsqdg2i",
            "parent_id": "t1_hsqd9ir",
            "score": 20,
            "created_utc": 1642225758.0,
            "replies": []
        },
        {
            "body": "> Could you point out at what point did I show contempt to for women in my response ??\n\nCome on, man, seriously?\n\n> Women are lazy as fuck.",
            "author": "Y_4Z44",
            "id": "hsqe0wy",
            "parent_id": "t1_hsqd9ir",
            "score": 12,
            "created_utc": 1642226099.0,
            "replies": [
                {
                    "body": "Now you’re just playing with my emotions 😉",
                    "author": "lipslikesugar88",
                    "id": "hsqes1m",
                    "parent_id": "t1_hsqe0wy",
                    "score": 2,
                    "created_utc": 1642226554.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ooo gave me butterflies when you called me sweetheart.",
            "author": "lipslikesugar88",
            "id": "hsqaqgy",
            "parent_id": "t1_hsqan3i",
            "score": 4,
            "created_utc": 1642224233.0,
            "replies": []
        },
        {
            "body": "Right on the money.",
            "author": "coolerthanbeans45",
            "id": "hsqekfd",
            "parent_id": "t1_hsqefds",
            "score": 2,
            "created_utc": 1642226424.0,
            "replies": []
        },
        {
            "body": "Now you’re just playing with my emotions 😉",
            "author": "lipslikesugar88",
            "id": "hsqes1m",
            "parent_id": "t1_hsqe0wy",
            "score": 2,
            "created_utc": 1642226554.0,
            "replies": []
        }
    ]
}