{
    "title": "Hilariously uncomfortable M&G last night",
    "post_id": "jw63ov",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/jw63ov/hilariously_uncomfortable_mg_last_night/",
    "author": "spicyflowr",
    "body": "\nJust a quick ramble \n\nDinner went like this:\nNice hellos and fun start.\nStarted getting quiet when we sat down.\nStart noticing POT was extremely boring and poor table manners. \nRealized, I, myself, a hilarious and fun person, carried the whole entire conversation to make him feel comfortable and to open up. POT opens up more, saying he’s stressed and work has been chaotic. Tells me about work.\nWe talk more. Nice laughs and took his mind off of work.\nStarted asking each other questions about the arrangement to come to an agreement. (At this point he’s nice but I want to next this guy, but still giving a small benefit of the doubt).\nTopic of sex has been going smoothly, then he brings up condoms.\n\nHere’s when things get uncomfortable (to him at least. It was quite humorous to me).\n\nI said “I prefer to use condoms.”\nHe says “what if I provide an STD test”\nI told him no because I don’t even know him\nHe confirms “so no?”\n“No :/“\nSo now he’s upset and the table just got extremely quiet and the silence carried on for over 2-3 minutes. He pulls out his phone. \nI see where this is leading as men I’ve encountered in vanilla relationships act when they can’t get what they want.\nI pull out my phone as well since he’s being rude, I, myself should as well. \nAt this point okay, I’m going to next this mf.\nI make humor of the situation to conclude we’re not going to move forward. \nThen he goes on this spiel of women being high maintenance and he’s extremely disappointed in my response and tries to guilt trip me HEAVILY. \nI stand firm on my ground with a smile. The silence continues. \nI’m over it at this point and offer to split the check so we can go our separate ways.\nHe scratches his head and says okay and say women expect so much (we went on a $$ dinner btw lol)\nWe split the check and I pull out my card and gave it to the waitress. He hasn’t taken his card out yet. Waitress takes my portion of the check. \nHe says “you know usually when I say if I provide my STD results 99% would agree to it.. but I guess there’s always that 1%. It’s such a shame, I liked your presence”\nWaitress comes back. He pulls out his card. \nI gave him a nice fist bump on the arm and left. \n\nYou can’t expect me to carry the conversation, then say women are high maintenance and allow you to raw dog me? Out of your mind!\n\nEdit: typos",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/jw63ov/hilariously_uncomfortable_mg_last_night/",
    "score": 284,
    "upvote_ratio": 0.97,
    "created_utc": 1605662176.0,
    "num_comments": 67,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "gcojuld",
            "parent_id": "t3_jw63ov",
            "score": 108,
            "created_utc": 1605668378.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gcpd00i",
                    "parent_id": "t1_gcojuld",
                    "score": -42,
                    "created_utc": 1605691516.0,
                    "replies": [
                        {
                            "body": "Found the Splenda daddy lol",
                            "author": null,
                            "id": "gctym3p",
                            "parent_id": "t1_gcpd00i",
                            "score": 9,
                            "created_utc": 1605796652.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some M&G's just suck.\n\nWhich is why they are so necessary - better to discover you are dealing with a boor in a public setting, rather than in private.\n\n\nYou were very patient,  honestly. But better to be nice, even when the other person is not.",
            "author": "GDarn",
            "id": "gcoh25s",
            "parent_id": "t3_jw63ov",
            "score": 60,
            "created_utc": 1605666804.0,
            "replies": []
        },
        {
            "body": "Again can someone explain to me the issue men have with condoms?  As a man I'm still confused.  I use condoms for the same reason I wear a mask during COVID, it's as much about protecting myself as protecting my partner and giving her the respect she deserves.  Saying it's uncomfortable is bullshit.",
            "author": "Daddyg2019",
            "id": "gcpjc1d",
            "parent_id": "t3_jw63ov",
            "score": 43,
            "created_utc": 1605698369.0,
            "replies": [
                {
                    "body": "I’ve actually experienced this often with them trying to persuade me to let them not use a condom. I guess they feel entitled to raw sex and they makes us feel bad about it when we politely decline",
                    "author": null,
                    "id": "gcqhha3",
                    "parent_id": "t1_gcpjc1d",
                    "score": 8,
                    "created_utc": 1605719218.0,
                    "replies": [
                        {
                            "body": "Completely agree. Also men thinking they can just cum inside of you because you allowed them to go raw.. it’s ✨rude✨💘",
                            "author": "spicyflowr",
                            "id": "gcr1o2a",
                            "parent_id": "t1_gcqhha3",
                            "score": 5,
                            "created_utc": 1605728705.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Right there with you. I appreciate some men may have more troubles climaxing with a condom, but the benefits outweigh the inconvenience.",
                    "author": "helios4fun",
                    "id": "gcqptce",
                    "parent_id": "t1_gcpjc1d",
                    "score": 6,
                    "created_utc": 1605723126.0,
                    "replies": []
                },
                {
                    "body": "I always use condoms but It’s hard for me to cum wearing a condom.",
                    "author": "Fun_Focus8159",
                    "id": "gcq58ir",
                    "parent_id": "t1_gcpjc1d",
                    "score": 2,
                    "created_utc": 1605713328.0,
                    "replies": [
                        {
                            "body": "And women knowing that, they appreciate and respect you 100x more. Because of that, you deserve all the blowjobs you want",
                            "author": "spicyflowr",
                            "id": "gcr1vv2",
                            "parent_id": "t1_gcq58ir",
                            "score": 3,
                            "created_utc": 1605728805.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It says much about you by handling this with such humor and grace. I don't understand his obstinacy on condoms. Thank you for sharing.",
            "author": "Intrepid_Seeker",
            "id": "gcoeigj",
            "parent_id": "t3_jw63ov",
            "score": 41,
            "created_utc": 1605665372.0,
            "replies": [
                {
                    "body": "He can’t get/keep it up. That’s the prob.",
                    "author": "usernamechecksout4u",
                    "id": "gcoque8",
                    "parent_id": "t1_gcoeigj",
                    "score": 7,
                    "created_utc": 1605672616.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m all about the fist pumps or side hugs when things don’t go well 👊🏻. I think you handled this very well.\nI’ve had someone be so adamant about no condoms because “it numbs the feeling” - bro, STFU!! 😑",
            "author": null,
            "id": "gcocyde",
            "parent_id": "t3_jw63ov",
            "score": 57,
            "created_utc": 1605664493.0,
            "replies": [
                {
                    "body": "I know! He says “it cuts of my circulation”. \nBaby, I’m sure what was taken into account when they were making condoms lol",
                    "author": "spicyflowr",
                    "id": "gcokf38",
                    "parent_id": "t1_gcocyde",
                    "score": 35,
                    "created_utc": 1605668705.0,
                    "replies": [
                        {
                            "body": "I love to respond with, \"I have literally fit one comfortably over my entire hand to fist someone before, but go off.\" 🤣\n\nI get they're not the most pleasurable thing in the world, but neither is risking your sexual health.",
                            "author": "Killer_Yandere",
                            "id": "gcov4z1",
                            "parent_id": "t1_gcokf38",
                            "score": 28,
                            "created_utc": 1605675470.0,
                            "replies": [
                                {
                                    "body": "Not just sexual health, health in general!! HIV/AIDS, cervical cancer, liver failure, infertility... all can be caused by unprotected sex.\n\nWhenever some chump is an absolute baby about it, I'm all,\"Wow, good thing I know this now! If you get this upset you must never wear them and STD panels don't cover everything.\"\n\nOr charge a ridiculous amount because risking your health comes at a high price.",
                                    "author": "kimchi_Queen",
                                    "id": "gcp2kqd",
                                    "parent_id": "t1_gcov4z1",
                                    "score": 14,
                                    "created_utc": 1605681346.0,
                                    "replies": []
                                },
                                {
                                    "body": "I absolutely agree! I asked him how many partners he has had. He said, “this year? Because of covid and the shut down.. 5”\nI was pretty grossed out",
                                    "author": "spicyflowr",
                                    "id": "gcowb8r",
                                    "parent_id": "t1_gcov4z1",
                                    "score": 2,
                                    "created_utc": 1605676320.0,
                                    "replies": [
                                        {
                                            "body": "Protection aside, are you really shaming people for having several partners in 2020? You're literally on a subreddit filled with people willing to date older people they aren't attracted to because they're getting paid. A ton of these relationships are borderlines sex work. This guy is obviously wrong but I didn't think this place was a place of shaming.",
                                            "author": "Dragosanie",
                                            "id": "gcpyplq",
                                            "parent_id": "t1_gcowb8r",
                                            "score": 2,
                                            "created_utc": 1605709863.0,
                                            "replies": [
                                                {
                                                    "body": "Sex with 5 people using no protection is gross, especially if it’s true he’s typically having MORE unprotected sex with people in times without pandemics.",
                                                    "author": null,
                                                    "id": "gcq50k7",
                                                    "parent_id": "t1_gcpyplq",
                                                    "score": 7,
                                                    "created_utc": 1605713214.0,
                                                    "replies": [
                                                        {
                                                            "body": "I find it a bit harsh to go that hard on people that literally make a career out of selling sex and then call people gross for having several partners that's all. I'm just saying it's probably not the place to shame but go off I guess, friendly reminder it costs zero dollars to be nice ✨",
                                                            "author": "Dragosanie",
                                                            "id": "gcq729z",
                                                            "parent_id": "t1_gcq50k7",
                                                            "score": 4,
                                                            "created_utc": 1605714241.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "The only reason I brought it up was because it wasn't specified unprotected. That's why I said *protection aside* it's the first part of the comment 💖💖",
                                                            "author": "Dragosanie",
                                                            "id": "gcq6uq7",
                                                            "parent_id": "t1_gcq50k7",
                                                            "score": 2,
                                                            "created_utc": 1605714136.0,
                                                            "replies": [
                                                                {
                                                                    "body": "The fact that her entire post about him is his pressure to guilt her into not using condoms makes that very relevant to her being uncomfortable with his amount of partners, but I agree # of partners is not shameful.",
                                                                    "author": null,
                                                                    "id": "gcq7kx8",
                                                                    "parent_id": "t1_gcq6uq7",
                                                                    "score": 6,
                                                                    "created_utc": 1605714492.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "> The only reason I brought it up was because it wasn't specified unprotected. That's why I said protection aside it's the first part of the comment 💖💖\n\nBut it was pretty clearly implied by him he had 0 interest if a condom was involved.\n\nSo I have to assume that's 5 partners without a condom.",
                                                                    "author": "SDstartingOut",
                                                                    "id": "gcq85jq",
                                                                    "parent_id": "t1_gcq6uq7",
                                                                    "score": 6,
                                                                    "created_utc": 1605714773.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Not everyone is as smart as you, I was trying to clarify something. I got it, the other commenter cleared that right up just a second ago but thanks :)",
                                                                            "author": "Dragosanie",
                                                                            "id": "gcq8csp",
                                                                            "parent_id": "t1_gcq85jq",
                                                                            "score": 1,
                                                                            "created_utc": 1605714870.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Haha yea! That line is just a sad attempt at sizing himself up 🤥",
                            "author": null,
                            "id": "gconp7c",
                            "parent_id": "t1_gcokf38",
                            "score": 10,
                            "created_utc": 1605670668.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "WHAT. IS. IT. WITH. MEN. NOT. WEARING. CONDOMS. OUT. HERE?!?!? 🙄\n\nVanilla, Sugar, it doesn’t matter! I always have to be the one to check them!! I’m always amazed.... \n\nAlso, love when they’re like “it feels so much better for us guys” (as if we don’t feel a difference...) and I’m like “Ummmm, for us too, but you know what feels even better, not getting an STI from your random ass....” especially when we don’t know each other! ugh ok, rant over... \n\nLove how you handled this OP!!",
            "author": "unicornmermaiden",
            "id": "gcqe8bk",
            "parent_id": "t3_jw63ov",
            "score": 10,
            "created_utc": 1605717691.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gcqnut2",
                    "parent_id": "t1_gcqe8bk",
                    "score": -1,
                    "created_utc": 1605722215.0,
                    "replies": [
                        {
                            "body": "Okay but imagine if the shower you’re taking is clear blue water, but it has mud, fungi and bacteria in the water! The raincoat protects you from what you can’t see!",
                            "author": "spicyflowr",
                            "id": "gcr2tq5",
                            "parent_id": "t1_gcqnut2",
                            "score": 1,
                            "created_utc": 1605729252.0,
                            "replies": [
                                {
                                    "body": "I get it. I am not against condom use. I'm telling you how it might set the agenda of a man. I do use them until we don't because we are clean, tested.",
                                    "author": "stonedoubt",
                                    "id": "gcruc4v",
                                    "parent_id": "t1_gcr2tq5",
                                    "score": 1,
                                    "created_utc": 1605742026.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I dig your style! Well done.",
            "author": "mraspencer",
            "id": "gcodfzk",
            "parent_id": "t3_jw63ov",
            "score": 17,
            "created_utc": 1605664771.0,
            "replies": []
        },
        {
            "body": "Split the check? wtf! Never. Ever. Do, That.\n\nJust say whatever and exit. No need to confront at dinner.",
            "author": "daddoms",
            "id": "gcoccx8",
            "parent_id": "t3_jw63ov",
            "score": 52,
            "created_utc": 1605664156.0,
            "replies": [
                {
                    "body": "I probably would’ve done the same so I could get out of there ASAP and not feel like I owe anyone anything... especially based on his behaviour from the getgo. \nHaving said that, I’ve not had a m&g like this.",
                    "author": null,
                    "id": "gcod437",
                    "parent_id": "t1_gcoccx8",
                    "score": 31,
                    "created_utc": 1605664582.0,
                    "replies": [
                        {
                            "body": "Be polite, get a phone call, and exit",
                            "author": "daddoms",
                            "id": "gcoehxb",
                            "parent_id": "t1_gcod437",
                            "score": 10,
                            "created_utc": 1605665363.0,
                            "replies": [
                                {
                                    "body": "If a POT tried to manipulate me into sex, I'd excuse myself to the bathroom, permanently. Dude deserves no respect.",
                                    "author": "Actually_a_bot_accnt",
                                    "id": "gcohv8v",
                                    "parent_id": "t1_gcoehxb",
                                    "score": 21,
                                    "created_utc": 1605667258.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh god. Another low EQ man.  A lot of men are that way right into adulthood.  Do some women suffer from that?",
            "author": "TY2022",
            "id": "gcoxt4z",
            "parent_id": "t3_jw63ov",
            "score": 7,
            "created_utc": 1605677434.0,
            "replies": []
        },
        {
            "body": "What an idiot.  Safe sex.  Cover up.",
            "author": null,
            "id": "gcohe8d",
            "parent_id": "t3_jw63ov",
            "score": 12,
            "created_utc": 1605666991.0,
            "replies": []
        },
        {
            "body": "Did you have to cut up his steak too?  Sorry, ya had to babysit.",
            "author": "DFWCouple4SB",
            "id": "gcp6mgj",
            "parent_id": "t3_jw63ov",
            "score": 5,
            "created_utc": 1605685022.0,
            "replies": [
                {
                    "body": "Close! I had to watch and hear him chew with his mouth open",
                    "author": "spicyflowr",
                    "id": "gcr2jiu",
                    "parent_id": "t1_gcp6mgj",
                    "score": 1,
                    "created_utc": 1605729116.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No one I taking his offer for condom free sex I can tell you that. Want proof? Look at his attitude. Women being “high maintenance”=him pouting about not getting what he wants",
            "author": "throwawayFA93",
            "id": "gcpbtu4",
            "parent_id": "t3_jw63ov",
            "score": 4,
            "created_utc": 1605690253.0,
            "replies": [
                {
                    "body": "Right. If that was the case, it would be a shrug and a 'On to the next one'. He's a liar as well as being cheap and dirty.",
                    "author": "blonde-throwaway",
                    "id": "gcplbby",
                    "parent_id": "t1_gcpbtu4",
                    "score": 6,
                    "created_utc": 1605700324.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My gosh \n\nIf I didn't know this was the sugar forum i would have assumed one of my girls said this...I've had so many vanilla dates like this\n\nWhat is it wth men feeling so entitled to a woman they barely know???\n\nDo they not care for their own health??",
            "author": "PessimisticAna",
            "id": "gcoxnny",
            "parent_id": "t3_jw63ov",
            "score": 8,
            "created_utc": 1605677322.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gcofdwr",
            "parent_id": "t3_jw63ov",
            "score": 21,
            "created_utc": 1605665856.0,
            "replies": [
                {
                    "body": "Yeah, I wasn’t going to especially because of ho he acted, but the waitress came by 3 times and he still hasn’t called for it! We were just sitting in silence! He was looking at me, looking away (very poor eye contact too btw) and in my head, I was thinking.. hey buddy I think it’s time lol",
                    "author": "spicyflowr",
                    "id": "gcol1rp",
                    "parent_id": "t1_gcofdwr",
                    "score": 7,
                    "created_utc": 1605669081.0,
                    "replies": [
                        {
                            "body": "Next time just get up and leave. Never pay half the check. I understand why you did it but you have to change that mentality in the bowl.",
                            "author": "prettylilprostitute",
                            "id": "gcp1zam",
                            "parent_id": "t1_gcol1rp",
                            "score": 10,
                            "created_utc": 1605680831.0,
                            "replies": [
                                {
                                    "body": "Yep, this. If an SD takes you out to dinner and then acts like a jerk, I think it's fine to stand up, say this isn't a good fit but thanks for dinner, and leave. \n\nIf that's hard to do, come up with some other excuse (going to grab some fresh air to reconsider his request, need to use the ladies room, etc), but leave quickly. Don't go to the restroom for a while and then wander back to the table, because IMO a guy like that will bail and leave you with the check while you're away from the table.",
                                    "author": "emptyoverflow",
                                    "id": "gcrmf7s",
                                    "parent_id": "t1_gcp1zam",
                                    "score": 3,
                                    "created_utc": 1605738640.0,
                                    "replies": [
                                        {
                                            "body": "Yeah 100 percent. This is great advice",
                                            "author": "prettylilprostitute",
                                            "id": "gcrppxc",
                                            "parent_id": "t1_gcrmf7s",
                                            "score": 1,
                                            "created_utc": 1605740071.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Agree on this, but to each their own. If OP prefers this approach that's fine too :)",
                    "author": "SuperduperDUCKS",
                    "id": "gcoolif",
                    "parent_id": "t1_gcofdwr",
                    "score": 5,
                    "created_utc": 1605671215.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Would it have shamed him to pay the whole bill? :p",
            "author": "garret6758",
            "id": "gcoyfvm",
            "parent_id": "t3_jw63ov",
            "score": 4,
            "created_utc": 1605677927.0,
            "replies": []
        },
        {
            "body": "Major kudos for handling the situation with such grace.",
            "author": "MASugarBaby",
            "id": "gcogl8k",
            "parent_id": "t3_jw63ov",
            "score": 8,
            "created_utc": 1605666538.0,
            "replies": []
        },
        {
            "body": "Lol, the 1%. He’s lying to himself there",
            "author": "Elvishgirl",
            "id": "gcqii3g",
            "parent_id": "t3_jw63ov",
            "score": 2,
            "created_utc": 1605719705.0,
            "replies": []
        },
        {
            "body": "These days, anyone who quickly, eagerly, and repeatedly insists on unprotected sex without a hint of caution or concern is someone that I 100% assume has STDs, regardless of test results.   Especially if they don't ask for my own test results.",
            "author": "emptyoverflow",
            "id": "gcs12nk",
            "parent_id": "t3_jw63ov",
            "score": 2,
            "created_utc": 1605745532.0,
            "replies": []
        },
        {
            "body": "It never ceases to amaze me how badly behaved people can be. That’s an adult tantrum. You handle this all with such grace. I can’t believe he let you split the check. \nThank goodness you could tell he was a boring knob, and now you know he is also cheap. Yikes. \n\nThe trifecta!",
            "author": "InnerRadio7",
            "id": "gcs1bh7",
            "parent_id": "t3_jw63ov",
            "score": 2,
            "created_utc": 1605745671.0,
            "replies": []
        },
        {
            "body": "Your post cracked me up! In my opinion you stayed too long! I would have made a smooth dip  after he pulled out his phone and the silence for 3 minutes. You were smart to get on your phone, but then I would have said excuse me real quick. No shame",
            "author": "lonelyjellyfish184",
            "id": "gdx1x5c",
            "parent_id": "t3_jw63ov",
            "score": 2,
            "created_utc": 1606594851.0,
            "replies": []
        },
        {
            "body": "You handled yourself well.  Safe sex should be paramount for everyone in the SB.  It was gracious of you to offer to split the check, but his attitude, demeanor and overall poor judgement didn't deserve your offer.  I doubt he is a legit SD.",
            "author": "jeffzeke",
            "id": "gcotm93",
            "parent_id": "t3_jw63ov",
            "score": 3,
            "created_utc": 1605674425.0,
            "replies": []
        },
        {
            "body": "Well done you. What a jerk!",
            "author": "aesthete2061",
            "id": "gcovna1",
            "parent_id": "t3_jw63ov",
            "score": 2,
            "created_utc": 1605675836.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gcpo02x",
            "parent_id": "t3_jw63ov",
            "score": 2,
            "created_utc": 1605702703.0,
            "replies": [
                {
                    "body": ">Should I instead be interpreting this as a sign she has decided she's not interested and wants to leave the M&G without feeling any obligation toward me?\n\nShe doesn't want to feel obligated towards you, but it doesn't 100% mean she's not interested. She just doesn't want to feel indebted to you (or cause you to feel like she \"owes\" you in some way). \n\nI sometimes like to say \"I can get this one if you want to get the next one,\" if I want them to feel a bit more comfortable with me paying. But ultimately if they want to split the check that's fine.",
                    "author": "emptyoverflow",
                    "id": "gcrmpo5",
                    "parent_id": "t1_gcpo02x",
                    "score": 1,
                    "created_utc": 1605738775.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nice job!!!",
            "author": "ziggy440",
            "id": "gcokyvy",
            "parent_id": "t3_jw63ov",
            "score": 2,
            "created_utc": 1605669033.0,
            "replies": []
        },
        {
            "body": "This is why meet and greets should be paid.",
            "author": "prettylilprostitute",
            "id": "gcp20kb",
            "parent_id": "t3_jw63ov",
            "score": 0,
            "created_utc": 1605680861.0,
            "replies": [
                {
                    "body": "YES YES YES",
                    "author": null,
                    "id": "gcqhw7t",
                    "parent_id": "t1_gcp20kb",
                    "score": 2,
                    "created_utc": 1605719416.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "very classy of you to still split the check",
            "author": "dontcallmechristian",
            "id": "gcoi38z",
            "parent_id": "t3_jw63ov",
            "score": 0,
            "created_utc": 1605667384.0,
            "replies": []
        },
        {
            "body": "I would have embarrassed him in front of the waitress to pay the bill. It’s not even the $$ but the principle, i would have made him pay or just left.",
            "author": "angelhair12",
            "id": "gcowm3s",
            "parent_id": "t3_jw63ov",
            "score": 0,
            "created_utc": 1605676542.0,
            "replies": []
        },
        {
            "body": "I learned a long time ago to determine compatibility on this issue before meeting.  It may sometimes be awkward to ask before meeting but not as awkward or wasteful as realizing you are incompatible during a dinner together.",
            "author": "mike_o212",
            "id": "gcpdd7a",
            "parent_id": "t3_jw63ov",
            "score": 0,
            "created_utc": 1605691926.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gcprlv6",
            "parent_id": "t3_jw63ov",
            "score": 0,
            "created_utc": 1605705445.0,
            "replies": [
                {
                    "body": "Food was good! Surprising only ordered an entree",
                    "author": "spicyflowr",
                    "id": "gcsmvh5",
                    "parent_id": "t1_gcprlv6",
                    "score": 1,
                    "created_utc": 1605757573.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's hilarious and you're awesome.",
            "author": "kimchi_Queen",
            "id": "gcp2bf1",
            "parent_id": "t3_jw63ov",
            "score": 1,
            "created_utc": 1605681121.0,
            "replies": []
        },
        {
            "body": "Well done.  I agree that he should have paid in full, but it's also nice to walk away with zero strings attached.  Way to stand your ground!",
            "author": "MartinB75",
            "id": "gcptvrk",
            "parent_id": "t3_jw63ov",
            "score": 1,
            "created_utc": 1605706981.0,
            "replies": []
        },
        {
            "body": "ugh god damn cover the bill man. Its like the one thing that should be ours at all times. \n\nLook my view is that it is ok for a dude to ask but if the POT SB says no then deal with it like a man.  It sounds like he was awkward and no fun before the question then started pouting after hearing the answer.... so Next!",
            "author": "craa141",
            "id": "gcqad31",
            "parent_id": "t3_jw63ov",
            "score": 1,
            "created_utc": 1605715847.0,
            "replies": [
                {
                    "body": "Next!!",
                    "author": "spicyflowr",
                    "id": "gcr36xg",
                    "parent_id": "t1_gcqad31",
                    "score": 1,
                    "created_utc": 1605729423.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Holy shit, he made you split the bill??",
            "author": "roscoe7585",
            "id": "gcr2d6c",
            "parent_id": "t3_jw63ov",
            "score": 1,
            "created_utc": 1605729031.0,
            "replies": [
                {
                    "body": "He didn’t make me split the bill, I just wanted to get out of there. The silence rolled over for so long and he was trying to not have the m&g end with a “no”. I just had to",
                    "author": "spicyflowr",
                    "id": "gcr43ly",
                    "parent_id": "t1_gcr2d6c",
                    "score": 1,
                    "created_utc": 1605729853.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You were way toooooooo nice. I would have got up and left with no words. How’s that for high maintenance. Ugh so disappointing when this happens. Better luck next time.",
            "author": "orangeyaglad",
            "id": "gcrj8me",
            "parent_id": "t3_jw63ov",
            "score": 1,
            "created_utc": 1605737052.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gcpd00i",
            "parent_id": "t1_gcojuld",
            "score": -42,
            "created_utc": 1605691516.0,
            "replies": [
                {
                    "body": "Found the Splenda daddy lol",
                    "author": null,
                    "id": "gctym3p",
                    "parent_id": "t1_gcpd00i",
                    "score": 9,
                    "created_utc": 1605796652.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ve actually experienced this often with them trying to persuade me to let them not use a condom. I guess they feel entitled to raw sex and they makes us feel bad about it when we politely decline",
            "author": null,
            "id": "gcqhha3",
            "parent_id": "t1_gcpjc1d",
            "score": 8,
            "created_utc": 1605719218.0,
            "replies": [
                {
                    "body": "Completely agree. Also men thinking they can just cum inside of you because you allowed them to go raw.. it’s ✨rude✨💘",
                    "author": "spicyflowr",
                    "id": "gcr1o2a",
                    "parent_id": "t1_gcqhha3",
                    "score": 5,
                    "created_utc": 1605728705.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right there with you. I appreciate some men may have more troubles climaxing with a condom, but the benefits outweigh the inconvenience.",
            "author": "helios4fun",
            "id": "gcqptce",
            "parent_id": "t1_gcpjc1d",
            "score": 6,
            "created_utc": 1605723126.0,
            "replies": []
        },
        {
            "body": "I always use condoms but It’s hard for me to cum wearing a condom.",
            "author": "Fun_Focus8159",
            "id": "gcq58ir",
            "parent_id": "t1_gcpjc1d",
            "score": 2,
            "created_utc": 1605713328.0,
            "replies": [
                {
                    "body": "And women knowing that, they appreciate and respect you 100x more. Because of that, you deserve all the blowjobs you want",
                    "author": "spicyflowr",
                    "id": "gcr1vv2",
                    "parent_id": "t1_gcq58ir",
                    "score": 3,
                    "created_utc": 1605728805.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He can’t get/keep it up. That’s the prob.",
            "author": "usernamechecksout4u",
            "id": "gcoque8",
            "parent_id": "t1_gcoeigj",
            "score": 7,
            "created_utc": 1605672616.0,
            "replies": []
        },
        {
            "body": "I know! He says “it cuts of my circulation”. \nBaby, I’m sure what was taken into account when they were making condoms lol",
            "author": "spicyflowr",
            "id": "gcokf38",
            "parent_id": "t1_gcocyde",
            "score": 35,
            "created_utc": 1605668705.0,
            "replies": [
                {
                    "body": "I love to respond with, \"I have literally fit one comfortably over my entire hand to fist someone before, but go off.\" 🤣\n\nI get they're not the most pleasurable thing in the world, but neither is risking your sexual health.",
                    "author": "Killer_Yandere",
                    "id": "gcov4z1",
                    "parent_id": "t1_gcokf38",
                    "score": 28,
                    "created_utc": 1605675470.0,
                    "replies": [
                        {
                            "body": "Not just sexual health, health in general!! HIV/AIDS, cervical cancer, liver failure, infertility... all can be caused by unprotected sex.\n\nWhenever some chump is an absolute baby about it, I'm all,\"Wow, good thing I know this now! If you get this upset you must never wear them and STD panels don't cover everything.\"\n\nOr charge a ridiculous amount because risking your health comes at a high price.",
                            "author": "kimchi_Queen",
                            "id": "gcp2kqd",
                            "parent_id": "t1_gcov4z1",
                            "score": 14,
                            "created_utc": 1605681346.0,
                            "replies": []
                        },
                        {
                            "body": "I absolutely agree! I asked him how many partners he has had. He said, “this year? Because of covid and the shut down.. 5”\nI was pretty grossed out",
                            "author": "spicyflowr",
                            "id": "gcowb8r",
                            "parent_id": "t1_gcov4z1",
                            "score": 2,
                            "created_utc": 1605676320.0,
                            "replies": [
                                {
                                    "body": "Protection aside, are you really shaming people for having several partners in 2020? You're literally on a subreddit filled with people willing to date older people they aren't attracted to because they're getting paid. A ton of these relationships are borderlines sex work. This guy is obviously wrong but I didn't think this place was a place of shaming.",
                                    "author": "Dragosanie",
                                    "id": "gcpyplq",
                                    "parent_id": "t1_gcowb8r",
                                    "score": 2,
                                    "created_utc": 1605709863.0,
                                    "replies": [
                                        {
                                            "body": "Sex with 5 people using no protection is gross, especially if it’s true he’s typically having MORE unprotected sex with people in times without pandemics.",
                                            "author": null,
                                            "id": "gcq50k7",
                                            "parent_id": "t1_gcpyplq",
                                            "score": 7,
                                            "created_utc": 1605713214.0,
                                            "replies": [
                                                {
                                                    "body": "I find it a bit harsh to go that hard on people that literally make a career out of selling sex and then call people gross for having several partners that's all. I'm just saying it's probably not the place to shame but go off I guess, friendly reminder it costs zero dollars to be nice ✨",
                                                    "author": "Dragosanie",
                                                    "id": "gcq729z",
                                                    "parent_id": "t1_gcq50k7",
                                                    "score": 4,
                                                    "created_utc": 1605714241.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "The only reason I brought it up was because it wasn't specified unprotected. That's why I said *protection aside* it's the first part of the comment 💖💖",
                                                    "author": "Dragosanie",
                                                    "id": "gcq6uq7",
                                                    "parent_id": "t1_gcq50k7",
                                                    "score": 2,
                                                    "created_utc": 1605714136.0,
                                                    "replies": [
                                                        {
                                                            "body": "The fact that her entire post about him is his pressure to guilt her into not using condoms makes that very relevant to her being uncomfortable with his amount of partners, but I agree # of partners is not shameful.",
                                                            "author": null,
                                                            "id": "gcq7kx8",
                                                            "parent_id": "t1_gcq6uq7",
                                                            "score": 6,
                                                            "created_utc": 1605714492.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "> The only reason I brought it up was because it wasn't specified unprotected. That's why I said protection aside it's the first part of the comment 💖💖\n\nBut it was pretty clearly implied by him he had 0 interest if a condom was involved.\n\nSo I have to assume that's 5 partners without a condom.",
                                                            "author": "SDstartingOut",
                                                            "id": "gcq85jq",
                                                            "parent_id": "t1_gcq6uq7",
                                                            "score": 6,
                                                            "created_utc": 1605714773.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Not everyone is as smart as you, I was trying to clarify something. I got it, the other commenter cleared that right up just a second ago but thanks :)",
                                                                    "author": "Dragosanie",
                                                                    "id": "gcq8csp",
                                                                    "parent_id": "t1_gcq85jq",
                                                                    "score": 1,
                                                                    "created_utc": 1605714870.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Haha yea! That line is just a sad attempt at sizing himself up 🤥",
                    "author": null,
                    "id": "gconp7c",
                    "parent_id": "t1_gcokf38",
                    "score": 10,
                    "created_utc": 1605670668.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gcqnut2",
            "parent_id": "t1_gcqe8bk",
            "score": -1,
            "created_utc": 1605722215.0,
            "replies": [
                {
                    "body": "Okay but imagine if the shower you’re taking is clear blue water, but it has mud, fungi and bacteria in the water! The raincoat protects you from what you can’t see!",
                    "author": "spicyflowr",
                    "id": "gcr2tq5",
                    "parent_id": "t1_gcqnut2",
                    "score": 1,
                    "created_utc": 1605729252.0,
                    "replies": [
                        {
                            "body": "I get it. I am not against condom use. I'm telling you how it might set the agenda of a man. I do use them until we don't because we are clean, tested.",
                            "author": "stonedoubt",
                            "id": "gcruc4v",
                            "parent_id": "t1_gcr2tq5",
                            "score": 1,
                            "created_utc": 1605742026.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I probably would’ve done the same so I could get out of there ASAP and not feel like I owe anyone anything... especially based on his behaviour from the getgo. \nHaving said that, I’ve not had a m&g like this.",
            "author": null,
            "id": "gcod437",
            "parent_id": "t1_gcoccx8",
            "score": 31,
            "created_utc": 1605664582.0,
            "replies": [
                {
                    "body": "Be polite, get a phone call, and exit",
                    "author": "daddoms",
                    "id": "gcoehxb",
                    "parent_id": "t1_gcod437",
                    "score": 10,
                    "created_utc": 1605665363.0,
                    "replies": [
                        {
                            "body": "If a POT tried to manipulate me into sex, I'd excuse myself to the bathroom, permanently. Dude deserves no respect.",
                            "author": "Actually_a_bot_accnt",
                            "id": "gcohv8v",
                            "parent_id": "t1_gcoehxb",
                            "score": 21,
                            "created_utc": 1605667258.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Close! I had to watch and hear him chew with his mouth open",
            "author": "spicyflowr",
            "id": "gcr2jiu",
            "parent_id": "t1_gcp6mgj",
            "score": 1,
            "created_utc": 1605729116.0,
            "replies": []
        },
        {
            "body": "Right. If that was the case, it would be a shrug and a 'On to the next one'. He's a liar as well as being cheap and dirty.",
            "author": "blonde-throwaway",
            "id": "gcplbby",
            "parent_id": "t1_gcpbtu4",
            "score": 6,
            "created_utc": 1605700324.0,
            "replies": []
        },
        {
            "body": "Yeah, I wasn’t going to especially because of ho he acted, but the waitress came by 3 times and he still hasn’t called for it! We were just sitting in silence! He was looking at me, looking away (very poor eye contact too btw) and in my head, I was thinking.. hey buddy I think it’s time lol",
            "author": "spicyflowr",
            "id": "gcol1rp",
            "parent_id": "t1_gcofdwr",
            "score": 7,
            "created_utc": 1605669081.0,
            "replies": [
                {
                    "body": "Next time just get up and leave. Never pay half the check. I understand why you did it but you have to change that mentality in the bowl.",
                    "author": "prettylilprostitute",
                    "id": "gcp1zam",
                    "parent_id": "t1_gcol1rp",
                    "score": 10,
                    "created_utc": 1605680831.0,
                    "replies": [
                        {
                            "body": "Yep, this. If an SD takes you out to dinner and then acts like a jerk, I think it's fine to stand up, say this isn't a good fit but thanks for dinner, and leave. \n\nIf that's hard to do, come up with some other excuse (going to grab some fresh air to reconsider his request, need to use the ladies room, etc), but leave quickly. Don't go to the restroom for a while and then wander back to the table, because IMO a guy like that will bail and leave you with the check while you're away from the table.",
                            "author": "emptyoverflow",
                            "id": "gcrmf7s",
                            "parent_id": "t1_gcp1zam",
                            "score": 3,
                            "created_utc": 1605738640.0,
                            "replies": [
                                {
                                    "body": "Yeah 100 percent. This is great advice",
                                    "author": "prettylilprostitute",
                                    "id": "gcrppxc",
                                    "parent_id": "t1_gcrmf7s",
                                    "score": 1,
                                    "created_utc": 1605740071.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agree on this, but to each their own. If OP prefers this approach that's fine too :)",
            "author": "SuperduperDUCKS",
            "id": "gcoolif",
            "parent_id": "t1_gcofdwr",
            "score": 5,
            "created_utc": 1605671215.0,
            "replies": []
        },
        {
            "body": ">Should I instead be interpreting this as a sign she has decided she's not interested and wants to leave the M&G without feeling any obligation toward me?\n\nShe doesn't want to feel obligated towards you, but it doesn't 100% mean she's not interested. She just doesn't want to feel indebted to you (or cause you to feel like she \"owes\" you in some way). \n\nI sometimes like to say \"I can get this one if you want to get the next one,\" if I want them to feel a bit more comfortable with me paying. But ultimately if they want to split the check that's fine.",
            "author": "emptyoverflow",
            "id": "gcrmpo5",
            "parent_id": "t1_gcpo02x",
            "score": 1,
            "created_utc": 1605738775.0,
            "replies": []
        },
        {
            "body": "YES YES YES",
            "author": null,
            "id": "gcqhw7t",
            "parent_id": "t1_gcp20kb",
            "score": 2,
            "created_utc": 1605719416.0,
            "replies": []
        },
        {
            "body": "Food was good! Surprising only ordered an entree",
            "author": "spicyflowr",
            "id": "gcsmvh5",
            "parent_id": "t1_gcprlv6",
            "score": 1,
            "created_utc": 1605757573.0,
            "replies": []
        },
        {
            "body": "Next!!",
            "author": "spicyflowr",
            "id": "gcr36xg",
            "parent_id": "t1_gcqad31",
            "score": 1,
            "created_utc": 1605729423.0,
            "replies": []
        },
        {
            "body": "He didn’t make me split the bill, I just wanted to get out of there. The silence rolled over for so long and he was trying to not have the m&g end with a “no”. I just had to",
            "author": "spicyflowr",
            "id": "gcr43ly",
            "parent_id": "t1_gcr2d6c",
            "score": 1,
            "created_utc": 1605729853.0,
            "replies": []
        },
        {
            "body": "Found the Splenda daddy lol",
            "author": null,
            "id": "gctym3p",
            "parent_id": "t1_gcpd00i",
            "score": 9,
            "created_utc": 1605796652.0,
            "replies": []
        },
        {
            "body": "Completely agree. Also men thinking they can just cum inside of you because you allowed them to go raw.. it’s ✨rude✨💘",
            "author": "spicyflowr",
            "id": "gcr1o2a",
            "parent_id": "t1_gcqhha3",
            "score": 5,
            "created_utc": 1605728705.0,
            "replies": []
        },
        {
            "body": "And women knowing that, they appreciate and respect you 100x more. Because of that, you deserve all the blowjobs you want",
            "author": "spicyflowr",
            "id": "gcr1vv2",
            "parent_id": "t1_gcq58ir",
            "score": 3,
            "created_utc": 1605728805.0,
            "replies": []
        },
        {
            "body": "I love to respond with, \"I have literally fit one comfortably over my entire hand to fist someone before, but go off.\" 🤣\n\nI get they're not the most pleasurable thing in the world, but neither is risking your sexual health.",
            "author": "Killer_Yandere",
            "id": "gcov4z1",
            "parent_id": "t1_gcokf38",
            "score": 28,
            "created_utc": 1605675470.0,
            "replies": [
                {
                    "body": "Not just sexual health, health in general!! HIV/AIDS, cervical cancer, liver failure, infertility... all can be caused by unprotected sex.\n\nWhenever some chump is an absolute baby about it, I'm all,\"Wow, good thing I know this now! If you get this upset you must never wear them and STD panels don't cover everything.\"\n\nOr charge a ridiculous amount because risking your health comes at a high price.",
                    "author": "kimchi_Queen",
                    "id": "gcp2kqd",
                    "parent_id": "t1_gcov4z1",
                    "score": 14,
                    "created_utc": 1605681346.0,
                    "replies": []
                },
                {
                    "body": "I absolutely agree! I asked him how many partners he has had. He said, “this year? Because of covid and the shut down.. 5”\nI was pretty grossed out",
                    "author": "spicyflowr",
                    "id": "gcowb8r",
                    "parent_id": "t1_gcov4z1",
                    "score": 2,
                    "created_utc": 1605676320.0,
                    "replies": [
                        {
                            "body": "Protection aside, are you really shaming people for having several partners in 2020? You're literally on a subreddit filled with people willing to date older people they aren't attracted to because they're getting paid. A ton of these relationships are borderlines sex work. This guy is obviously wrong but I didn't think this place was a place of shaming.",
                            "author": "Dragosanie",
                            "id": "gcpyplq",
                            "parent_id": "t1_gcowb8r",
                            "score": 2,
                            "created_utc": 1605709863.0,
                            "replies": [
                                {
                                    "body": "Sex with 5 people using no protection is gross, especially if it’s true he’s typically having MORE unprotected sex with people in times without pandemics.",
                                    "author": null,
                                    "id": "gcq50k7",
                                    "parent_id": "t1_gcpyplq",
                                    "score": 7,
                                    "created_utc": 1605713214.0,
                                    "replies": [
                                        {
                                            "body": "I find it a bit harsh to go that hard on people that literally make a career out of selling sex and then call people gross for having several partners that's all. I'm just saying it's probably not the place to shame but go off I guess, friendly reminder it costs zero dollars to be nice ✨",
                                            "author": "Dragosanie",
                                            "id": "gcq729z",
                                            "parent_id": "t1_gcq50k7",
                                            "score": 4,
                                            "created_utc": 1605714241.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "The only reason I brought it up was because it wasn't specified unprotected. That's why I said *protection aside* it's the first part of the comment 💖💖",
                                            "author": "Dragosanie",
                                            "id": "gcq6uq7",
                                            "parent_id": "t1_gcq50k7",
                                            "score": 2,
                                            "created_utc": 1605714136.0,
                                            "replies": [
                                                {
                                                    "body": "The fact that her entire post about him is his pressure to guilt her into not using condoms makes that very relevant to her being uncomfortable with his amount of partners, but I agree # of partners is not shameful.",
                                                    "author": null,
                                                    "id": "gcq7kx8",
                                                    "parent_id": "t1_gcq6uq7",
                                                    "score": 6,
                                                    "created_utc": 1605714492.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "> The only reason I brought it up was because it wasn't specified unprotected. That's why I said protection aside it's the first part of the comment 💖💖\n\nBut it was pretty clearly implied by him he had 0 interest if a condom was involved.\n\nSo I have to assume that's 5 partners without a condom.",
                                                    "author": "SDstartingOut",
                                                    "id": "gcq85jq",
                                                    "parent_id": "t1_gcq6uq7",
                                                    "score": 6,
                                                    "created_utc": 1605714773.0,
                                                    "replies": [
                                                        {
                                                            "body": "Not everyone is as smart as you, I was trying to clarify something. I got it, the other commenter cleared that right up just a second ago but thanks :)",
                                                            "author": "Dragosanie",
                                                            "id": "gcq8csp",
                                                            "parent_id": "t1_gcq85jq",
                                                            "score": 1,
                                                            "created_utc": 1605714870.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Haha yea! That line is just a sad attempt at sizing himself up 🤥",
            "author": null,
            "id": "gconp7c",
            "parent_id": "t1_gcokf38",
            "score": 10,
            "created_utc": 1605670668.0,
            "replies": []
        },
        {
            "body": "Okay but imagine if the shower you’re taking is clear blue water, but it has mud, fungi and bacteria in the water! The raincoat protects you from what you can’t see!",
            "author": "spicyflowr",
            "id": "gcr2tq5",
            "parent_id": "t1_gcqnut2",
            "score": 1,
            "created_utc": 1605729252.0,
            "replies": [
                {
                    "body": "I get it. I am not against condom use. I'm telling you how it might set the agenda of a man. I do use them until we don't because we are clean, tested.",
                    "author": "stonedoubt",
                    "id": "gcruc4v",
                    "parent_id": "t1_gcr2tq5",
                    "score": 1,
                    "created_utc": 1605742026.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Be polite, get a phone call, and exit",
            "author": "daddoms",
            "id": "gcoehxb",
            "parent_id": "t1_gcod437",
            "score": 10,
            "created_utc": 1605665363.0,
            "replies": [
                {
                    "body": "If a POT tried to manipulate me into sex, I'd excuse myself to the bathroom, permanently. Dude deserves no respect.",
                    "author": "Actually_a_bot_accnt",
                    "id": "gcohv8v",
                    "parent_id": "t1_gcoehxb",
                    "score": 21,
                    "created_utc": 1605667258.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Next time just get up and leave. Never pay half the check. I understand why you did it but you have to change that mentality in the bowl.",
            "author": "prettylilprostitute",
            "id": "gcp1zam",
            "parent_id": "t1_gcol1rp",
            "score": 10,
            "created_utc": 1605680831.0,
            "replies": [
                {
                    "body": "Yep, this. If an SD takes you out to dinner and then acts like a jerk, I think it's fine to stand up, say this isn't a good fit but thanks for dinner, and leave. \n\nIf that's hard to do, come up with some other excuse (going to grab some fresh air to reconsider his request, need to use the ladies room, etc), but leave quickly. Don't go to the restroom for a while and then wander back to the table, because IMO a guy like that will bail and leave you with the check while you're away from the table.",
                    "author": "emptyoverflow",
                    "id": "gcrmf7s",
                    "parent_id": "t1_gcp1zam",
                    "score": 3,
                    "created_utc": 1605738640.0,
                    "replies": [
                        {
                            "body": "Yeah 100 percent. This is great advice",
                            "author": "prettylilprostitute",
                            "id": "gcrppxc",
                            "parent_id": "t1_gcrmf7s",
                            "score": 1,
                            "created_utc": 1605740071.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not just sexual health, health in general!! HIV/AIDS, cervical cancer, liver failure, infertility... all can be caused by unprotected sex.\n\nWhenever some chump is an absolute baby about it, I'm all,\"Wow, good thing I know this now! If you get this upset you must never wear them and STD panels don't cover everything.\"\n\nOr charge a ridiculous amount because risking your health comes at a high price.",
            "author": "kimchi_Queen",
            "id": "gcp2kqd",
            "parent_id": "t1_gcov4z1",
            "score": 14,
            "created_utc": 1605681346.0,
            "replies": []
        },
        {
            "body": "I absolutely agree! I asked him how many partners he has had. He said, “this year? Because of covid and the shut down.. 5”\nI was pretty grossed out",
            "author": "spicyflowr",
            "id": "gcowb8r",
            "parent_id": "t1_gcov4z1",
            "score": 2,
            "created_utc": 1605676320.0,
            "replies": [
                {
                    "body": "Protection aside, are you really shaming people for having several partners in 2020? You're literally on a subreddit filled with people willing to date older people they aren't attracted to because they're getting paid. A ton of these relationships are borderlines sex work. This guy is obviously wrong but I didn't think this place was a place of shaming.",
                    "author": "Dragosanie",
                    "id": "gcpyplq",
                    "parent_id": "t1_gcowb8r",
                    "score": 2,
                    "created_utc": 1605709863.0,
                    "replies": [
                        {
                            "body": "Sex with 5 people using no protection is gross, especially if it’s true he’s typically having MORE unprotected sex with people in times without pandemics.",
                            "author": null,
                            "id": "gcq50k7",
                            "parent_id": "t1_gcpyplq",
                            "score": 7,
                            "created_utc": 1605713214.0,
                            "replies": [
                                {
                                    "body": "I find it a bit harsh to go that hard on people that literally make a career out of selling sex and then call people gross for having several partners that's all. I'm just saying it's probably not the place to shame but go off I guess, friendly reminder it costs zero dollars to be nice ✨",
                                    "author": "Dragosanie",
                                    "id": "gcq729z",
                                    "parent_id": "t1_gcq50k7",
                                    "score": 4,
                                    "created_utc": 1605714241.0,
                                    "replies": []
                                },
                                {
                                    "body": "The only reason I brought it up was because it wasn't specified unprotected. That's why I said *protection aside* it's the first part of the comment 💖💖",
                                    "author": "Dragosanie",
                                    "id": "gcq6uq7",
                                    "parent_id": "t1_gcq50k7",
                                    "score": 2,
                                    "created_utc": 1605714136.0,
                                    "replies": [
                                        {
                                            "body": "The fact that her entire post about him is his pressure to guilt her into not using condoms makes that very relevant to her being uncomfortable with his amount of partners, but I agree # of partners is not shameful.",
                                            "author": null,
                                            "id": "gcq7kx8",
                                            "parent_id": "t1_gcq6uq7",
                                            "score": 6,
                                            "created_utc": 1605714492.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "> The only reason I brought it up was because it wasn't specified unprotected. That's why I said protection aside it's the first part of the comment 💖💖\n\nBut it was pretty clearly implied by him he had 0 interest if a condom was involved.\n\nSo I have to assume that's 5 partners without a condom.",
                                            "author": "SDstartingOut",
                                            "id": "gcq85jq",
                                            "parent_id": "t1_gcq6uq7",
                                            "score": 6,
                                            "created_utc": 1605714773.0,
                                            "replies": [
                                                {
                                                    "body": "Not everyone is as smart as you, I was trying to clarify something. I got it, the other commenter cleared that right up just a second ago but thanks :)",
                                                    "author": "Dragosanie",
                                                    "id": "gcq8csp",
                                                    "parent_id": "t1_gcq85jq",
                                                    "score": 1,
                                                    "created_utc": 1605714870.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I get it. I am not against condom use. I'm telling you how it might set the agenda of a man. I do use them until we don't because we are clean, tested.",
            "author": "stonedoubt",
            "id": "gcruc4v",
            "parent_id": "t1_gcr2tq5",
            "score": 1,
            "created_utc": 1605742026.0,
            "replies": []
        },
        {
            "body": "If a POT tried to manipulate me into sex, I'd excuse myself to the bathroom, permanently. Dude deserves no respect.",
            "author": "Actually_a_bot_accnt",
            "id": "gcohv8v",
            "parent_id": "t1_gcoehxb",
            "score": 21,
            "created_utc": 1605667258.0,
            "replies": []
        },
        {
            "body": "Yep, this. If an SD takes you out to dinner and then acts like a jerk, I think it's fine to stand up, say this isn't a good fit but thanks for dinner, and leave. \n\nIf that's hard to do, come up with some other excuse (going to grab some fresh air to reconsider his request, need to use the ladies room, etc), but leave quickly. Don't go to the restroom for a while and then wander back to the table, because IMO a guy like that will bail and leave you with the check while you're away from the table.",
            "author": "emptyoverflow",
            "id": "gcrmf7s",
            "parent_id": "t1_gcp1zam",
            "score": 3,
            "created_utc": 1605738640.0,
            "replies": [
                {
                    "body": "Yeah 100 percent. This is great advice",
                    "author": "prettylilprostitute",
                    "id": "gcrppxc",
                    "parent_id": "t1_gcrmf7s",
                    "score": 1,
                    "created_utc": 1605740071.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Protection aside, are you really shaming people for having several partners in 2020? You're literally on a subreddit filled with people willing to date older people they aren't attracted to because they're getting paid. A ton of these relationships are borderlines sex work. This guy is obviously wrong but I didn't think this place was a place of shaming.",
            "author": "Dragosanie",
            "id": "gcpyplq",
            "parent_id": "t1_gcowb8r",
            "score": 2,
            "created_utc": 1605709863.0,
            "replies": [
                {
                    "body": "Sex with 5 people using no protection is gross, especially if it’s true he’s typically having MORE unprotected sex with people in times without pandemics.",
                    "author": null,
                    "id": "gcq50k7",
                    "parent_id": "t1_gcpyplq",
                    "score": 7,
                    "created_utc": 1605713214.0,
                    "replies": [
                        {
                            "body": "I find it a bit harsh to go that hard on people that literally make a career out of selling sex and then call people gross for having several partners that's all. I'm just saying it's probably not the place to shame but go off I guess, friendly reminder it costs zero dollars to be nice ✨",
                            "author": "Dragosanie",
                            "id": "gcq729z",
                            "parent_id": "t1_gcq50k7",
                            "score": 4,
                            "created_utc": 1605714241.0,
                            "replies": []
                        },
                        {
                            "body": "The only reason I brought it up was because it wasn't specified unprotected. That's why I said *protection aside* it's the first part of the comment 💖💖",
                            "author": "Dragosanie",
                            "id": "gcq6uq7",
                            "parent_id": "t1_gcq50k7",
                            "score": 2,
                            "created_utc": 1605714136.0,
                            "replies": [
                                {
                                    "body": "The fact that her entire post about him is his pressure to guilt her into not using condoms makes that very relevant to her being uncomfortable with his amount of partners, but I agree # of partners is not shameful.",
                                    "author": null,
                                    "id": "gcq7kx8",
                                    "parent_id": "t1_gcq6uq7",
                                    "score": 6,
                                    "created_utc": 1605714492.0,
                                    "replies": []
                                },
                                {
                                    "body": "> The only reason I brought it up was because it wasn't specified unprotected. That's why I said protection aside it's the first part of the comment 💖💖\n\nBut it was pretty clearly implied by him he had 0 interest if a condom was involved.\n\nSo I have to assume that's 5 partners without a condom.",
                                    "author": "SDstartingOut",
                                    "id": "gcq85jq",
                                    "parent_id": "t1_gcq6uq7",
                                    "score": 6,
                                    "created_utc": 1605714773.0,
                                    "replies": [
                                        {
                                            "body": "Not everyone is as smart as you, I was trying to clarify something. I got it, the other commenter cleared that right up just a second ago but thanks :)",
                                            "author": "Dragosanie",
                                            "id": "gcq8csp",
                                            "parent_id": "t1_gcq85jq",
                                            "score": 1,
                                            "created_utc": 1605714870.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah 100 percent. This is great advice",
            "author": "prettylilprostitute",
            "id": "gcrppxc",
            "parent_id": "t1_gcrmf7s",
            "score": 1,
            "created_utc": 1605740071.0,
            "replies": []
        },
        {
            "body": "Sex with 5 people using no protection is gross, especially if it’s true he’s typically having MORE unprotected sex with people in times without pandemics.",
            "author": null,
            "id": "gcq50k7",
            "parent_id": "t1_gcpyplq",
            "score": 7,
            "created_utc": 1605713214.0,
            "replies": [
                {
                    "body": "I find it a bit harsh to go that hard on people that literally make a career out of selling sex and then call people gross for having several partners that's all. I'm just saying it's probably not the place to shame but go off I guess, friendly reminder it costs zero dollars to be nice ✨",
                    "author": "Dragosanie",
                    "id": "gcq729z",
                    "parent_id": "t1_gcq50k7",
                    "score": 4,
                    "created_utc": 1605714241.0,
                    "replies": []
                },
                {
                    "body": "The only reason I brought it up was because it wasn't specified unprotected. That's why I said *protection aside* it's the first part of the comment 💖💖",
                    "author": "Dragosanie",
                    "id": "gcq6uq7",
                    "parent_id": "t1_gcq50k7",
                    "score": 2,
                    "created_utc": 1605714136.0,
                    "replies": [
                        {
                            "body": "The fact that her entire post about him is his pressure to guilt her into not using condoms makes that very relevant to her being uncomfortable with his amount of partners, but I agree # of partners is not shameful.",
                            "author": null,
                            "id": "gcq7kx8",
                            "parent_id": "t1_gcq6uq7",
                            "score": 6,
                            "created_utc": 1605714492.0,
                            "replies": []
                        },
                        {
                            "body": "> The only reason I brought it up was because it wasn't specified unprotected. That's why I said protection aside it's the first part of the comment 💖💖\n\nBut it was pretty clearly implied by him he had 0 interest if a condom was involved.\n\nSo I have to assume that's 5 partners without a condom.",
                            "author": "SDstartingOut",
                            "id": "gcq85jq",
                            "parent_id": "t1_gcq6uq7",
                            "score": 6,
                            "created_utc": 1605714773.0,
                            "replies": [
                                {
                                    "body": "Not everyone is as smart as you, I was trying to clarify something. I got it, the other commenter cleared that right up just a second ago but thanks :)",
                                    "author": "Dragosanie",
                                    "id": "gcq8csp",
                                    "parent_id": "t1_gcq85jq",
                                    "score": 1,
                                    "created_utc": 1605714870.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I find it a bit harsh to go that hard on people that literally make a career out of selling sex and then call people gross for having several partners that's all. I'm just saying it's probably not the place to shame but go off I guess, friendly reminder it costs zero dollars to be nice ✨",
            "author": "Dragosanie",
            "id": "gcq729z",
            "parent_id": "t1_gcq50k7",
            "score": 4,
            "created_utc": 1605714241.0,
            "replies": []
        },
        {
            "body": "The only reason I brought it up was because it wasn't specified unprotected. That's why I said *protection aside* it's the first part of the comment 💖💖",
            "author": "Dragosanie",
            "id": "gcq6uq7",
            "parent_id": "t1_gcq50k7",
            "score": 2,
            "created_utc": 1605714136.0,
            "replies": [
                {
                    "body": "The fact that her entire post about him is his pressure to guilt her into not using condoms makes that very relevant to her being uncomfortable with his amount of partners, but I agree # of partners is not shameful.",
                    "author": null,
                    "id": "gcq7kx8",
                    "parent_id": "t1_gcq6uq7",
                    "score": 6,
                    "created_utc": 1605714492.0,
                    "replies": []
                },
                {
                    "body": "> The only reason I brought it up was because it wasn't specified unprotected. That's why I said protection aside it's the first part of the comment 💖💖\n\nBut it was pretty clearly implied by him he had 0 interest if a condom was involved.\n\nSo I have to assume that's 5 partners without a condom.",
                    "author": "SDstartingOut",
                    "id": "gcq85jq",
                    "parent_id": "t1_gcq6uq7",
                    "score": 6,
                    "created_utc": 1605714773.0,
                    "replies": [
                        {
                            "body": "Not everyone is as smart as you, I was trying to clarify something. I got it, the other commenter cleared that right up just a second ago but thanks :)",
                            "author": "Dragosanie",
                            "id": "gcq8csp",
                            "parent_id": "t1_gcq85jq",
                            "score": 1,
                            "created_utc": 1605714870.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The fact that her entire post about him is his pressure to guilt her into not using condoms makes that very relevant to her being uncomfortable with his amount of partners, but I agree # of partners is not shameful.",
            "author": null,
            "id": "gcq7kx8",
            "parent_id": "t1_gcq6uq7",
            "score": 6,
            "created_utc": 1605714492.0,
            "replies": []
        },
        {
            "body": "> The only reason I brought it up was because it wasn't specified unprotected. That's why I said protection aside it's the first part of the comment 💖💖\n\nBut it was pretty clearly implied by him he had 0 interest if a condom was involved.\n\nSo I have to assume that's 5 partners without a condom.",
            "author": "SDstartingOut",
            "id": "gcq85jq",
            "parent_id": "t1_gcq6uq7",
            "score": 6,
            "created_utc": 1605714773.0,
            "replies": [
                {
                    "body": "Not everyone is as smart as you, I was trying to clarify something. I got it, the other commenter cleared that right up just a second ago but thanks :)",
                    "author": "Dragosanie",
                    "id": "gcq8csp",
                    "parent_id": "t1_gcq85jq",
                    "score": 1,
                    "created_utc": 1605714870.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not everyone is as smart as you, I was trying to clarify something. I got it, the other commenter cleared that right up just a second ago but thanks :)",
            "author": "Dragosanie",
            "id": "gcq8csp",
            "parent_id": "t1_gcq85jq",
            "score": 1,
            "created_utc": 1605714870.0,
            "replies": []
        }
    ]
}