{
    "title": "10 Ways To Introduce the Money Conversation",
    "post_id": "11p2311",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/11p2311/10_ways_to_introduce_the_money_conversation/",
    "author": "HarvardLawSB",
    "body": "I know it can be difficult for both SBs and SDs to broach the money conversation. I certainly hate talking about the money because I want the focus to be on our relationship. But I recognize that for many it's untenable to go into an arrangement without having any firm numbers on the table.\n\nEDIT: While these were taken from an advanced negotiation class all about money negotiations, this post is specifically about how to bring up the topic of money. It's NOT about how to negotiate an allowance. \n\nSome of these methods overlap with others, but it's nice to have a lot of tools in your toolbox depending on your situation. The names are pretty self explanatory, so I'll just offer some sample text relating to an arrangement setting following each name.\n\n1. **Make an offer**\"I'd be happy to provide an allowance of X\"\"What do you think about meeting weekly for a PPM of X?\"\n2. **Frame as a joint dilemma**\"One thing we'll have to think about is how much the allowance should be\"\n3. **Ask to be educated**\"I'd love to hear more about how you think about the financial side of things\"\n4. **Invite or propose a process**\"How do you want to go about discussing allowance?\"\"Why don't we lay out a few ways we might think about this and then we can decide which makes the most sense\"\n5. **Suggest relevant criteria**\"It seems to me that it makes sense to provide an allowance that is equivalent to a one bedroom apartment in our area\"\"When I think about what allowance would be adequate, I would be interested in knowing what your monthly expenses are\"\n6. **Suggest a range**\"I would be comfortable with an amount between X and Y\"\n7. **Two options to choose from**\"I could do a PPM of X to meet weekly or an allowance of Y and we could meet whenever we both want. Which of these appeals to you and makes the most sense?\"\n8. **Ask about the economic ecosystem: assumptions, implicit rules, norms, criteria...**\"Here's something I'm wondering about.... I'm curious because...\"\"How do you think about allowance increases in later years?\"\n9. **Talk about the challenge**\"Here's the dilemma for me: What you're offering/asking for is very reasonable. The challenge is that...\"\n10. **Name the awkwardness. Clarify your purpose**\"I hate to ask about money. I just want to be sure we can get it out of the way so we don't have to talk about it again\"\"I’m worried that If I ask about money, it sounds like I’m only interested in the money.  That’s not true, but it is an important part of the picture because….”\n\nHope this helps someone :)",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/11p2311/10_ways_to_introduce_the_money_conversation/",
    "score": 149,
    "upvote_ratio": 0.96,
    "created_utc": 1678586376.0,
    "num_comments": 68,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Lots of good stuff!\n\nFor those who want a little longer version, \\_Never Split The Difference\\_ is a pretty good book written by an FBI hostage negotiator.",
            "author": "quietgrey1",
            "id": "jbvs4yi",
            "parent_id": "t3_11p2311",
            "score": 25,
            "created_utc": 1678588406.0,
            "replies": [
                {
                    "body": "I have very strong thoughts on this, so apologies in advance. But I very much don't subscribe to Voss's \"my way or the highway\" mentality or that a negotiation is a big game where you need a tactical advantage or manipulation. My view is that a negotiation should be less about making sure my piece of the pie is bigger than someone else's but more about making the pie itself bigger. Increasing value through sharing interests is a big part of my negotiating philosophy. I would be more inclined to recommend books by Roger Fisher/William ury",
                    "author": "HarvardLawSB",
                    "id": "jbvui1o",
                    "parent_id": "t1_jbvs4yi",
                    "score": 52,
                    "created_utc": 1678589568.0,
                    "replies": [
                        {
                            "body": "> But I very much don't subscribe to Voss's \"my way or the highway\" mentality or that a negotiation is a big game where you need a tactical advantage or manipulation.\n\nI agree with you in the context of anything outside an actual hostage negotiation. For those, it is an absolute imperative. lol",
                            "author": "FLRAdvocate",
                            "id": "jbvweg7",
                            "parent_id": "t1_jbvui1o",
                            "score": 15,
                            "created_utc": 1678590555.0,
                            "replies": [
                                {
                                    "body": "what's missing in the attempt to transfer negotiating skills from merger deals, hostage negotiations or used car sales is that that the arrangement  is about an ongoing relationship.  Ideally the handling of the discussion leads to a strengthening of the bonds.  It is also an exercise in leadership by both.  \n\nThink of the \"arrangement\"   as creation of a bouquet in a crystal vase.   You are partners in the creation of the arrangement .  If you tussle excessively you will break the vase and in the morning all you will have wilted flowers and broken glass.",
                                    "author": "pinotandsugar",
                                    "id": "jbwjrxo",
                                    "parent_id": "t1_jbvweg7",
                                    "score": 15,
                                    "created_utc": 1678605030.0,
                                    "replies": [
                                        {
                                            "body": "Oh, I love this analogy",
                                            "author": "HarvardLawSB",
                                            "id": "jbwl0lv",
                                            "parent_id": "t1_jbwjrxo",
                                            "score": 6,
                                            "created_utc": 1678605982.0,
                                            "replies": [
                                                {
                                                    "body": "It came from the other side of the river",
                                                    "author": "pinotandsugar",
                                                    "id": "jbwpdsb",
                                                    "parent_id": "t1_jbwl0lv",
                                                    "score": 1,
                                                    "created_utc": 1678609559.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I would agree with you - I've had the best success (and the most fulfilling SRs) using the collaborative negotiation stye. Let's get a win/win deal on the table so we all walk away satisfied.",
                            "author": "Hot_Selection3626",
                            "id": "jbvwcu2",
                            "parent_id": "t1_jbvui1o",
                            "score": 9,
                            "created_utc": 1678590533.0,
                            "replies": [
                                {
                                    "body": "Yup totally concur! Wasn’t trying to suggest argumentative, just that a lot (most) SBs could use skills here in general.\n\nEdit: I don’t remember Voss as being purely “my way or highway” but will happily give your authors a read. :)",
                                    "author": "quietgrey1",
                                    "id": "jbw6q8c",
                                    "parent_id": "t1_jbvwcu2",
                                    "score": 3,
                                    "created_utc": 1678596243.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "And what kind of relationship are you left with, if it's started on the basis of one person exercising leverage to the detriment of the other? \n\nThat's not a relationship of equity. That's a relationship of commercial superiority. Fnck that. Be kind to one another people. Have fun.",
                    "author": "sparklehorse43",
                    "id": "jbw8b7y",
                    "parent_id": "t1_jbvs4yi",
                    "score": 4,
                    "created_utc": 1678597190.0,
                    "replies": [
                        {
                            "body": "I’m going to go back and re-read Voss. In my mind at the moment I think of it as giving tools so people are able to negotiate, not go for the jugular, but two of you have strong opinions otherwise so perhaps my interpretation here is invalid. \n\nIn my mind the goal is equity but that SBs have no idea how to hold their own. But if that’s not what the book was suggesting then apologies in advance.",
                            "author": "quietgrey1",
                            "id": "jbwd4lr",
                            "parent_id": "t1_jbw8b7y",
                            "score": 4,
                            "created_utc": 1678600239.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love this. The companion to it is a reflection on how to pick among these options based on (1) your communication style and personality, (2) your partner’s style and personality and (3) any weakness/problem that you are perceiving in the interaction so far.\n\nIf I had to “expand the frame”, I would suggest that negotiations are not always necessary. It is possible to build enough trust that you don’t have to invest as much in negotiations. My personal ideal is to be generous early, so that there is no $ negotiation drama.",
            "author": "LippoLippi1500",
            "id": "jbvy2te",
            "parent_id": "t3_11p2311",
            "score": 9,
            "created_utc": 1678591438.0,
            "replies": [
                {
                    "body": "I agree with this wholeheartedly. Your ideal is also my ideal— i pretty much either say yes or no. I want to write a post in the future about how to negotiate your allowance (spoiler: my advice is to… DON’T!)",
                    "author": "HarvardLawSB",
                    "id": "jbvyh6s",
                    "parent_id": "t1_jbvy2te",
                    "score": 8,
                    "created_utc": 1678591652.0,
                    "replies": [
                        {
                            "body": "i strongly agree with this. either you’re aligned or not. meeting in the middle of two faraway places just means two people far from where they want to be, and if one or both of the numbers was just a “negotiation tactic,” then one or both people aren’t people i’d want to be with.\n\ni can’t count how many times a potential SB asked for twice as much as she really thought was a rewarding arrangement, only to come back with a much smaller ask after being politely but permanently declined. leave the highball/lowball stuff for tacky business deals!",
                            "author": "sdsf9",
                            "id": "jbwf1zb",
                            "parent_id": "t1_jbvyh6s",
                            "score": 5,
                            "created_utc": 1678601557.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Great post with thoughtful and tactful language and ideas. As an SD, I usually lay out what I have done in past arrangements. I usually do this in my first message via text, which comes after establishing a v\nbit of a rapport with the POT on the Seeking message platform.  I always offer the same and most times it is accepted,  so I think I am either in the correct range, or maybe over what I could be offering.  I don't care if I am over. It is good for me and for the SB's, so all good.",
            "author": "Teejaynj",
            "id": "jbvzby2",
            "parent_id": "t3_11p2311",
            "score": 6,
            "created_utc": 1678592117.0,
            "replies": [
                {
                    "body": "Yup! That's another great example of suggesting relevant criteria-- in your case, the relevant criteria would be what has worked for you in the past :). Glad it works for you and your SBs!",
                    "author": "HarvardLawSB",
                    "id": "jbvzo5v",
                    "parent_id": "t1_jbvzby2",
                    "score": 2,
                    "created_utc": 1678592297.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I really like #10 that you pointed out the awkwardness while still making sure that it is an important part in your finance! Great stuff",
            "author": "IndividualReady667",
            "id": "jbvsse2",
            "parent_id": "t3_11p2311",
            "score": 5,
            "created_utc": 1678588724.0,
            "replies": [
                {
                    "body": "Thanks! I can't really take the credit since it's just a repurposed lecture from my courses, but I'll kinda take the credit anyway hahaha",
                    "author": "HarvardLawSB",
                    "id": "jbvv3mf",
                    "parent_id": "t1_jbvsse2",
                    "score": 4,
                    "created_utc": 1678589878.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SB here with an MBa…. Totally love this approach. It’s similar to how we also talked about money in my negotiations and sales classes, and how I’ve taught my clients.\n\nI would add the it can also help to allow things to become a little more personal, such as detailing how an allowance will help free up more time for the relationship or alleviate stressors and distractions.\n\n“I’d love to see you every week but that would require me to take time away from my kids/school/work (opportunity cost). An allowance of $$$$$ would certainly make that easier. What are your thoughts?” Etc.",
            "author": "LVSugarBebe",
            "id": "jbwa67s",
            "parent_id": "t3_11p2311",
            "score": 12,
            "created_utc": 1678598338.0,
            "replies": [
                {
                    "body": "Love it!! Congrats on your MBA!!",
                    "author": "HarvardLawSB",
                    "id": "jbwa8fe",
                    "parent_id": "t1_jbwa67s",
                    "score": 2,
                    "created_utc": 1678598377.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm a qualified Mediator, and wholeheartedly subscribe to the idea of parties going into any negotiation to be aware of their BATNA/WATNA (Best or Worst Alternative To a Negotiated Agreement). That is, what's the best, or worst case outcome? Strictly speaking, if you find common ground and both parties are happy with the result, that's a win!",
            "author": "sparklehorse43",
            "id": "jbw81u3",
            "parent_id": "t3_11p2311",
            "score": 4,
            "created_utc": 1678597029.0,
            "replies": [
                {
                    "body": "Yes, and acknowledging that the other party has their own BATNA that you’re up against.",
                    "author": "LVSugarBebe",
                    "id": "jbxcblx",
                    "parent_id": "t1_jbw81u3",
                    "score": 2,
                    "created_utc": 1678627328.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just talked to a POT on seeking. Literally 1st reply she sent me was asking whether I provided an allowance. I mean, I get it, but it purs me off a bit as it frames what the whole relationship will be like.\n\nI get, we need to talk about it but you know...first message? Really ?",
            "author": "C12H22O11-EU",
            "id": "jbxozjd",
            "parent_id": "t3_11p2311",
            "score": 5,
            "created_utc": 1678633680.0,
            "replies": []
        },
        {
            "body": "I think this is great. I’ve taken a number of negotiating classes and the takeaways are similar. Understanding your options (and thus, your BATNA) is also critical to achieving a zone of agreement.",
            "author": "57hz",
            "id": "jckv6yx",
            "parent_id": "t3_11p2311",
            "score": 2,
            "created_utc": 1679068398.0,
            "replies": []
        },
        {
            "body": "“What kind of $ puts you in a fun mood?”  Works great for me.",
            "author": "Murderousbonesfile",
            "id": "jdr70jr",
            "parent_id": "t3_11p2311",
            "score": 2,
            "created_utc": 1679844906.0,
            "replies": []
        },
        {
            "body": "Do we really need 10 ways?  What’s wrong with “here is my allowance offer / expectation?”",
            "author": "DumbleSD",
            "id": "jbvylts",
            "parent_id": "t3_11p2311",
            "score": 2,
            "created_utc": 1678591724.0,
            "replies": [
                {
                    "body": "There’s nothing wrong with it, that’s why that’s one of the options :). Not everyone is comfortable being that direct",
                    "author": "HarvardLawSB",
                    "id": "jbvyo0a",
                    "parent_id": "t1_jbvylts",
                    "score": 7,
                    "created_utc": 1678591756.0,
                    "replies": []
                },
                {
                    "body": "I'm straightforward so I'm comfortable making my expectations known. I have a friend who is brand new to the lifestyle though so these tips would help her approach the subject.",
                    "author": "AdBot_1443",
                    "id": "jbw7emr",
                    "parent_id": "t1_jbvylts",
                    "score": 2,
                    "created_utc": 1678596645.0,
                    "replies": []
                },
                {
                    "body": "No. We don't need 10 ways. We hold all the cards. All.",
                    "author": null,
                    "id": "jbw2o0f",
                    "parent_id": "t1_jbvylts",
                    "score": -4,
                    "created_utc": 1678593930.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good stuff, but it leaves out the #1 rule of financial negotiations: ... The first person to name a number loses.\n\nI have had SR's where I was paying the SB less than half of what I would have been willing to pay her ... but she volunteered and named a number first, and way low-balled herself. So when I accepted her offer, she was obviously very happy, and both parties perceived it as a win-win.\n\nSB's need to learn that they should try and get the SD to name the number first. That's Job 1, above all else.",
            "author": "Nomad_Bill",
            "id": "jbw1frr",
            "parent_id": "t3_11p2311",
            "score": 2,
            "created_utc": 1678593256.0,
            "replies": [
                {
                    "body": "Many people believe that being the first to name a number is the better thing to do because it's a way of anchoring. \n\nEither way though, I find your premise to be flawed. \n\nIf a SB is happy with the number she asked for, there's nothing wrong with that. If you feel like you would be taking advantage of her by only giving her the amount she asked for, you can remedy this by increasing the amount.",
                    "author": "HarvardLawSB",
                    "id": "jbw1s2u",
                    "parent_id": "t1_jbw1frr",
                    "score": 12,
                    "created_utc": 1678593442.0,
                    "replies": [
                        {
                            "body": "I second this. Especially for those of us aiming for higher allowances in the 6-figures.\n\nFor guys saying they’re happy when she accepts less than they would have offered… they risk losing a good SB when she later discovers she can do better. Also, people tend to show up in a way that reflects the worth others see in them. If a woman feel’s valued, she’ll generally put in more effort to keep that relationship and fulfill her end of the deal.",
                            "author": "LVSugarBebe",
                            "id": "jbwbr57",
                            "parent_id": "t1_jbw1s2u",
                            "score": 8,
                            "created_utc": 1678599338.0,
                            "replies": []
                        },
                        {
                            "body": "Your post is a fabrication, and you're just arguing for the sake of arguing. My premise isn't flawed. It's Negotiation 101, and is as fundamental as it gets.\n\nAnd more specifically, your rebuttal fails because (in the scenario I described above), the SB only received half of what she could have otherwise received, if only she had asked for it. That's the complete opposite of \"there's nothing wrong with that\".",
                            "author": "Nomad_Bill",
                            "id": "jbwije0",
                            "parent_id": "t1_jbw1s2u",
                            "score": -1,
                            "created_utc": 1678604099.0,
                            "replies": [
                                {
                                    "body": "> My premise isn't flawed. It's Negotiation 101.\n\nYour premise **is** flawed, and relationships (sugar or otherwise) are but business deals.\n\n>And more specifically, your rebuttal fails because (in the scenario I described above), the SB only received half of what she could have otherwise received, if only she had asked for it. That's the complete opposite of \"there's nothing wrong with that\".\n\nI’m not sure what kind of flex you’re trying to make here, it really just makes you look bad. You would have been willing to support her more (note my usage of “support,” not “pay,” because again, we’re talking about relationships and not business transactions) but you didn’t “pay” her more, presumably because you’re cheap. You could have very easily just given her the extra amount that she “could have” received, because if you think she could have received that greater amount, you also thought she brought proportionately extra value to your life. But you didn’t. \n\nThat says a lot more about the kind of person you are than it does about their negotiation skills.",
                                    "author": "throwaway321zyxw",
                                    "id": "jg1naes",
                                    "parent_id": "t1_jbwije0",
                                    "score": 1,
                                    "created_utc": 1681353568.0,
                                    "replies": [
                                        {
                                            "body": "Nope. All of that is wrong. It's an emotion-driven word salad of ad hominems and fabrications. You have no idea what you're talking about, and are arguing just to argue.",
                                            "author": "Nomad_Bill",
                                            "id": "jg41hip",
                                            "parent_id": "t1_jg1naes",
                                            "score": 0,
                                            "created_utc": 1681403203.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Disagree bc it’s not a business. I personally prefer that the SB tell me what she wants. And in every single case where the SB has told me and I thought too low, I increased it. And I have done that in 4 of my SRs. \n\nIf it’s more than my budget, then I wish them well.",
                    "author": "thereadinessisall",
                    "id": "jbw2dwa",
                    "parent_id": "t1_jbw1frr",
                    "score": 5,
                    "created_utc": 1678593771.0,
                    "replies": []
                },
                {
                    "body": ">Good stuff, but it leaves out the #1 rule of financial negotiations: ... The first person to name a number loses.\n\nWhen I met my first SB , I told her the PPM I was willing to offer. She accepted.\n\nObviously I **lost** that negotiation by naming a number. Oh well. I had a great year long SR with her.",
                    "author": "BinghamtonSD",
                    "id": "jbwczie",
                    "parent_id": "t1_jbw1frr",
                    "score": 3,
                    "created_utc": 1678600142.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Love this!!!\n\nIt’s very thorough & informative! Love that you included examples both from the SB and the SD’s pov\n\nThank you so much for this! ❤️\n\nI’m sure this will be really helpful for new or young SBs. Hope this can be included in the wiki!",
            "author": "sugaring_throwaway",
            "id": "jbw4eor",
            "parent_id": "t3_11p2311",
            "score": 1,
            "created_utc": 1678594904.0,
            "replies": [
                {
                    "body": "Very glad you enjoyed it! :)",
                    "author": "HarvardLawSB",
                    "id": "jbw4hse",
                    "parent_id": "t1_jbw4eor",
                    "score": 2,
                    "created_utc": 1678594952.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is way overthinking the subject.  I say “I have been paying x. If you are comfortable with that, I’d like to meet you.”  The babies can come up with their own version. That way both party’s know what to expect.",
            "author": "Realistic_Scratch912",
            "id": "jbw89ry",
            "parent_id": "t3_11p2311",
            "score": 1,
            "created_utc": 1678597165.0,
            "replies": [
                {
                    "body": "That’s a mix of making an offer and suggesting relevant criteria :).",
                    "author": "HarvardLawSB",
                    "id": "jbw8g6d",
                    "parent_id": "t1_jbw89ry",
                    "score": 4,
                    "created_utc": 1678597273.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I usually just say I offer x ppm very early in text. It’s a tad over market. Really just a tad. My success rate is 90%. Those who counter or walk away somehow find a way to get back in touch soon. Conversely those who blatantly try to rob with references to a rich previous arrangement hit a wall with me quickly. I just want to be fair. Don’t want to rob or be robbed.",
            "author": null,
            "id": "jbvtkpu",
            "parent_id": "t3_11p2311",
            "score": 0,
            "created_utc": 1678589107.0,
            "replies": [
                {
                    "body": ">I just want to be fair. \n\nI would be more concerned with this than with the \"robbing\" -- people having different expectations than you doesn't mean they're robbers or being robbed from. Being fair is important though and I definitely like your method. Negotiating in these kinds of scenarios feels to me like a lose-lose.",
                    "author": "HarvardLawSB",
                    "id": "jbvvbo4",
                    "parent_id": "t1_jbvtkpu",
                    "score": 6,
                    "created_utc": 1678589997.0,
                    "replies": [
                        {
                            "body": "I hear you. The fact is I have built companies and hired hundreds of people and always offered people a tad more than market. Always a good strategy. \n\nSmall sliver have tried to outsmart by quoting fake made up figures which very quickly get proven wrong. \n\nSame principles for sugar. \n\nWith me, a premium is on the table. I am not pulling a fast one on the ladies by low balling, so why pull a fast one on me by putting fake numbers.",
                            "author": null,
                            "id": "jbw6dow",
                            "parent_id": "t1_jbvvbo4",
                            "score": 2,
                            "created_utc": 1678596040.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is not the Yankees v Scott Boras negotiating a half a billion dollar contract.\n\nIf someone approached me with this framework, I'd be turned off.   Ever bought a car at a dealer?   There you go. \n\nGuys, this isn't rocket surgery.  PPM should be based on market value, how often you meet, and what she has to offer.  She needs us more than we need her.",
            "author": null,
            "id": "jbw2kwe",
            "parent_id": "t3_11p2311",
            "score": -3,
            "created_utc": 1678593881.0,
            "replies": [
                {
                    "body": "If someone said \"I'd love to hear more about how you think about the financial side of things\" you would be turned off?\n\nIt's not rocket surgery, but not everyone-- and especially not young women-- has experience bringing up money. \n\nI feel like I need to edit the post to take out the bit about this coming from a negotiation class because the point of this post is not \"how to negotiate\"-- the point is to teach some methods on how to bring up money if you're not comfortable being direct.\n\nEither way, I feel your last comment is fairly grotesque so we likely don't see eye to eye on a lot of things",
                    "author": "HarvardLawSB",
                    "id": "jbw30bq",
                    "parent_id": "t1_jbw2kwe",
                    "score": 8,
                    "created_utc": 1678594117.0,
                    "replies": [
                        {
                            "body": "The sugarbabies I engage are college age  student, the 18-22 crowd, so these conversations are never had.   They are happy to be considered, enjoy the fantastic times, and are for the most part, very appreciative.   When we discuss funding, I ask them how much they feel they are worth.  Whatever they respond, my response is, oh, you are worth WAY more than that!!!  Then we get into market value and past performance. \n\nThey are gorgeous and are in it too have fun, love being treated with respect, love the attention, amazing intimacy, and money.\n\nYour 10 ways are for women in their 30s and 40s.  I vanilla date that group.",
                            "author": null,
                            "id": "jbw51vq",
                            "parent_id": "t1_jbw30bq",
                            "score": 0,
                            "created_utc": 1678595267.0,
                            "replies": [
                                {
                                    "body": "In that case, you’re suggesting relevant criteria. In your view, the relevant criteria is how much they feel they’re worth (I believe this is a gross way of framing it, but putting that aside…)\n\nAs I said, it’s just the different ways you choose to approach the money conversation. It’s not isolated to a SB’s use, and certainly not to those in a certain age range.",
                                    "author": "HarvardLawSB",
                                    "id": "jbw5f6c",
                                    "parent_id": "t1_jbw51vq",
                                    "score": 8,
                                    "created_utc": 1678595485.0,
                                    "replies": [
                                        {
                                            "body": "We can agree to disagree.",
                                            "author": null,
                                            "id": "jbw7i4i",
                                            "parent_id": "t1_jbw5f6c",
                                            "score": 0,
                                            "created_utc": 1678596701.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "*She needs us more than we need her.*\n\n*We hold all the cards. All.*\n\nLove the delusion here!!\n\nNEED  is the one thing that has driven the world . This is not philosophy it's hard facts. \n\nYou go on the sugaring sites because you NEED something. You have gfs/fwbs/friends all arising from a simple thing called \"NEED\". \n\nSo, *You so equally need her.*\n\nStop living a life of misery and start really looking in deeper.There are some things you need to sort out.",
                    "author": null,
                    "id": "jbw5bsz",
                    "parent_id": "t1_jbw2kwe",
                    "score": 10,
                    "created_utc": 1678595430.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "jbw7bum",
                            "parent_id": "t1_jbw5bsz",
                            "score": 0,
                            "created_utc": 1678596601.0,
                            "replies": [
                                {
                                    "body": "No one holds the card. No one . Remember that.\n\nWe all eventually die. So no one holds anything really. \n\nGood luck!! I will not be commenting on this anymore.",
                                    "author": null,
                                    "id": "jbwbmpf",
                                    "parent_id": "t1_jbw7bum",
                                    "score": 4,
                                    "created_utc": 1678599258.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Market value… honestly, how can you run a proper valuation on a prospective arrangement if you haven’t met the person and haven’t assessed what unique attributes she has to offer?",
                    "author": "LVSugarBebe",
                    "id": "jbxcqji",
                    "parent_id": "t1_jbw2kwe",
                    "score": 5,
                    "created_utc": 1678627579.0,
                    "replies": [
                        {
                            "body": "This is discussed after the meet and greet.",
                            "author": null,
                            "id": "jbxd4n2",
                            "parent_id": "t1_jbxcqji",
                            "score": 1,
                            "created_utc": 1678627815.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Great job, as always.",
            "author": "Hot_Selection3626",
            "id": "jbvtn53",
            "parent_id": "t3_11p2311",
            "score": 0,
            "created_utc": 1678589140.0,
            "replies": [
                {
                    "body": "Thank you :)",
                    "author": "HarvardLawSB",
                    "id": "jbvv08y",
                    "parent_id": "t1_jbvtn53",
                    "score": 2,
                    "created_utc": 1678589829.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You’re a lawyer?  Why say in 10 words when you can use 1000?",
            "author": "Realistic_Scratch912",
            "id": "jbw9rzn",
            "parent_id": "t3_11p2311",
            "score": -1,
            "created_utc": 1678598089.0,
            "replies": [
                {
                    "body": "You used 14 words for this unhelpful comment.",
                    "author": "Inner_Examination_38",
                    "id": "jbxmibe",
                    "parent_id": "t1_jbw9rzn",
                    "score": 6,
                    "created_utc": 1678632568.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great list......  One of the potential openers for the SD is to ask (after both have expressed a desire to engage in an arrangement subject to agreeable terms)   what's important to you.  \n\nCertainty of cash flow \n\nAmount of \" allowance\"  (for confirmation) \n\nTiming \n\nThe SD might assess the situation that  a monthly allowance at the initiation might be harmful for the relationship.  However half month might both provide assurance that it is not one and done and provide incentive to make the meetings a priority.",
            "author": "pinotandsugar",
            "id": "jbwp9ob",
            "parent_id": "t3_11p2311",
            "score": 1,
            "created_utc": 1678609465.0,
            "replies": []
        },
        {
            "body": "I never got #6, the range option. Not just here but in any negotiation. Like what's the point of \"Y\"? Like, is that a number above which you would refuse? \"Oh, I'm sorry...I won't take more than Y\" doesn't seem...likely? \n\nPerhaps frame it as, \"I'd be satisfied with anything over X, and I'd be giggly happy and delighted with anything more than Y.\"",
            "author": "steelmanfallacy",
            "id": "jbx3pjd",
            "parent_id": "t3_11p2311",
            "score": 1,
            "created_utc": 1678621560.0,
            "replies": []
        },
        {
            "body": "One thing I recommend never including in an allowance discussion/re-negotiation - an \"I know you have the means\" comment. Instant deal breaker. We have the means to do a lot of things...",
            "author": "StealyMissile",
            "id": "jbyab9a",
            "parent_id": "t3_11p2311",
            "score": 1,
            "created_utc": 1678642680.0,
            "replies": [
                {
                    "body": "It's meant as a compliment. I can see how you could be off put by that, it's like the SB might be trying to have an opinion on how you spend your money. \n\nI complement- ask- compliment, As my lovely friend calls it \" a compliment sandwich is the best sandwich!\"",
                    "author": "MapleSappling",
                    "id": "jc0pxmm",
                    "parent_id": "t1_jbyab9a",
                    "score": 1,
                    "created_utc": 1678682232.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is excellent (and very balanced/impartial) 🙌🙌🙌",
            "author": "ihsotas",
            "id": "jbyi653",
            "parent_id": "t3_11p2311",
            "score": 1,
            "created_utc": 1678645917.0,
            "replies": []
        },
        {
            "body": "The PPM/Allowance is only the starting point and a small amount of the overall equation. Putting too much energy into it is a waste of time. I never bring it up. I simply gift early and often to show/prove my intentions. I treat her right and its reciprocated. Not all of them have worked out but I can't recall any complaining about the amount but could possibly be they weren't happy with the numbers. Such is life.\n\nI know times are changing. If they want to bring it up, they should be prepared with a number. I've only been given a number once and promptly agreed. Didn't stop the shopping trips, new tires for her car, etc., from happening. Daddy's sugar comes in many forms.",
            "author": "GordonGuapo",
            "id": "jbypfx0",
            "parent_id": "t3_11p2311",
            "score": 1,
            "created_utc": 1678648942.0,
            "replies": []
        },
        {
            "body": "Thank you, HLSB! ❤️",
            "author": "261chameleons",
            "id": "jc0h0xh",
            "parent_id": "t3_11p2311",
            "score": 1,
            "created_utc": 1678677350.0,
            "replies": [
                {
                    "body": "You’re very welcome :)",
                    "author": "HarvardLawSB",
                    "id": "jc0jnk1",
                    "parent_id": "t1_jc0h0xh",
                    "score": 1,
                    "created_utc": 1678678672.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I like 1, 2, & 6.",
            "author": "RealEarthAngel",
            "id": "jc7oiwa",
            "parent_id": "t3_11p2311",
            "score": 1,
            "created_utc": 1678814333.0,
            "replies": []
        },
        {
            "body": "Whats the right way to ask this though so that you dont lowball yourself?",
            "author": "beckiem9",
            "id": "jck4cjq",
            "parent_id": "t3_11p2311",
            "score": 1,
            "created_utc": 1679056704.0,
            "replies": []
        },
        {
            "body": "💗",
            "author": "lunakumiko",
            "id": "je95fpu",
            "parent_id": "t3_11p2311",
            "score": 1,
            "created_utc": 1680169095.0,
            "replies": []
        },
        {
            "body": "I have very strong thoughts on this, so apologies in advance. But I very much don't subscribe to Voss's \"my way or the highway\" mentality or that a negotiation is a big game where you need a tactical advantage or manipulation. My view is that a negotiation should be less about making sure my piece of the pie is bigger than someone else's but more about making the pie itself bigger. Increasing value through sharing interests is a big part of my negotiating philosophy. I would be more inclined to recommend books by Roger Fisher/William ury",
            "author": "HarvardLawSB",
            "id": "jbvui1o",
            "parent_id": "t1_jbvs4yi",
            "score": 52,
            "created_utc": 1678589568.0,
            "replies": [
                {
                    "body": "> But I very much don't subscribe to Voss's \"my way or the highway\" mentality or that a negotiation is a big game where you need a tactical advantage or manipulation.\n\nI agree with you in the context of anything outside an actual hostage negotiation. For those, it is an absolute imperative. lol",
                    "author": "FLRAdvocate",
                    "id": "jbvweg7",
                    "parent_id": "t1_jbvui1o",
                    "score": 15,
                    "created_utc": 1678590555.0,
                    "replies": [
                        {
                            "body": "what's missing in the attempt to transfer negotiating skills from merger deals, hostage negotiations or used car sales is that that the arrangement  is about an ongoing relationship.  Ideally the handling of the discussion leads to a strengthening of the bonds.  It is also an exercise in leadership by both.  \n\nThink of the \"arrangement\"   as creation of a bouquet in a crystal vase.   You are partners in the creation of the arrangement .  If you tussle excessively you will break the vase and in the morning all you will have wilted flowers and broken glass.",
                            "author": "pinotandsugar",
                            "id": "jbwjrxo",
                            "parent_id": "t1_jbvweg7",
                            "score": 15,
                            "created_utc": 1678605030.0,
                            "replies": [
                                {
                                    "body": "Oh, I love this analogy",
                                    "author": "HarvardLawSB",
                                    "id": "jbwl0lv",
                                    "parent_id": "t1_jbwjrxo",
                                    "score": 6,
                                    "created_utc": 1678605982.0,
                                    "replies": [
                                        {
                                            "body": "It came from the other side of the river",
                                            "author": "pinotandsugar",
                                            "id": "jbwpdsb",
                                            "parent_id": "t1_jbwl0lv",
                                            "score": 1,
                                            "created_utc": 1678609559.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I would agree with you - I've had the best success (and the most fulfilling SRs) using the collaborative negotiation stye. Let's get a win/win deal on the table so we all walk away satisfied.",
                    "author": "Hot_Selection3626",
                    "id": "jbvwcu2",
                    "parent_id": "t1_jbvui1o",
                    "score": 9,
                    "created_utc": 1678590533.0,
                    "replies": [
                        {
                            "body": "Yup totally concur! Wasn’t trying to suggest argumentative, just that a lot (most) SBs could use skills here in general.\n\nEdit: I don’t remember Voss as being purely “my way or highway” but will happily give your authors a read. :)",
                            "author": "quietgrey1",
                            "id": "jbw6q8c",
                            "parent_id": "t1_jbvwcu2",
                            "score": 3,
                            "created_utc": 1678596243.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And what kind of relationship are you left with, if it's started on the basis of one person exercising leverage to the detriment of the other? \n\nThat's not a relationship of equity. That's a relationship of commercial superiority. Fnck that. Be kind to one another people. Have fun.",
            "author": "sparklehorse43",
            "id": "jbw8b7y",
            "parent_id": "t1_jbvs4yi",
            "score": 4,
            "created_utc": 1678597190.0,
            "replies": [
                {
                    "body": "I’m going to go back and re-read Voss. In my mind at the moment I think of it as giving tools so people are able to negotiate, not go for the jugular, but two of you have strong opinions otherwise so perhaps my interpretation here is invalid. \n\nIn my mind the goal is equity but that SBs have no idea how to hold their own. But if that’s not what the book was suggesting then apologies in advance.",
                    "author": "quietgrey1",
                    "id": "jbwd4lr",
                    "parent_id": "t1_jbw8b7y",
                    "score": 4,
                    "created_utc": 1678600239.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree with this wholeheartedly. Your ideal is also my ideal— i pretty much either say yes or no. I want to write a post in the future about how to negotiate your allowance (spoiler: my advice is to… DON’T!)",
            "author": "HarvardLawSB",
            "id": "jbvyh6s",
            "parent_id": "t1_jbvy2te",
            "score": 8,
            "created_utc": 1678591652.0,
            "replies": [
                {
                    "body": "i strongly agree with this. either you’re aligned or not. meeting in the middle of two faraway places just means two people far from where they want to be, and if one or both of the numbers was just a “negotiation tactic,” then one or both people aren’t people i’d want to be with.\n\ni can’t count how many times a potential SB asked for twice as much as she really thought was a rewarding arrangement, only to come back with a much smaller ask after being politely but permanently declined. leave the highball/lowball stuff for tacky business deals!",
                    "author": "sdsf9",
                    "id": "jbwf1zb",
                    "parent_id": "t1_jbvyh6s",
                    "score": 5,
                    "created_utc": 1678601557.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup! That's another great example of suggesting relevant criteria-- in your case, the relevant criteria would be what has worked for you in the past :). Glad it works for you and your SBs!",
            "author": "HarvardLawSB",
            "id": "jbvzo5v",
            "parent_id": "t1_jbvzby2",
            "score": 2,
            "created_utc": 1678592297.0,
            "replies": []
        },
        {
            "body": "Thanks! I can't really take the credit since it's just a repurposed lecture from my courses, but I'll kinda take the credit anyway hahaha",
            "author": "HarvardLawSB",
            "id": "jbvv3mf",
            "parent_id": "t1_jbvsse2",
            "score": 4,
            "created_utc": 1678589878.0,
            "replies": []
        },
        {
            "body": "Love it!! Congrats on your MBA!!",
            "author": "HarvardLawSB",
            "id": "jbwa8fe",
            "parent_id": "t1_jbwa67s",
            "score": 2,
            "created_utc": 1678598377.0,
            "replies": []
        },
        {
            "body": "Yes, and acknowledging that the other party has their own BATNA that you’re up against.",
            "author": "LVSugarBebe",
            "id": "jbxcblx",
            "parent_id": "t1_jbw81u3",
            "score": 2,
            "created_utc": 1678627328.0,
            "replies": []
        },
        {
            "body": "There’s nothing wrong with it, that’s why that’s one of the options :). Not everyone is comfortable being that direct",
            "author": "HarvardLawSB",
            "id": "jbvyo0a",
            "parent_id": "t1_jbvylts",
            "score": 7,
            "created_utc": 1678591756.0,
            "replies": []
        },
        {
            "body": "I'm straightforward so I'm comfortable making my expectations known. I have a friend who is brand new to the lifestyle though so these tips would help her approach the subject.",
            "author": "AdBot_1443",
            "id": "jbw7emr",
            "parent_id": "t1_jbvylts",
            "score": 2,
            "created_utc": 1678596645.0,
            "replies": []
        },
        {
            "body": "No. We don't need 10 ways. We hold all the cards. All.",
            "author": null,
            "id": "jbw2o0f",
            "parent_id": "t1_jbvylts",
            "score": -4,
            "created_utc": 1678593930.0,
            "replies": []
        },
        {
            "body": "Many people believe that being the first to name a number is the better thing to do because it's a way of anchoring. \n\nEither way though, I find your premise to be flawed. \n\nIf a SB is happy with the number she asked for, there's nothing wrong with that. If you feel like you would be taking advantage of her by only giving her the amount she asked for, you can remedy this by increasing the amount.",
            "author": "HarvardLawSB",
            "id": "jbw1s2u",
            "parent_id": "t1_jbw1frr",
            "score": 12,
            "created_utc": 1678593442.0,
            "replies": [
                {
                    "body": "I second this. Especially for those of us aiming for higher allowances in the 6-figures.\n\nFor guys saying they’re happy when she accepts less than they would have offered… they risk losing a good SB when she later discovers she can do better. Also, people tend to show up in a way that reflects the worth others see in them. If a woman feel’s valued, she’ll generally put in more effort to keep that relationship and fulfill her end of the deal.",
                    "author": "LVSugarBebe",
                    "id": "jbwbr57",
                    "parent_id": "t1_jbw1s2u",
                    "score": 8,
                    "created_utc": 1678599338.0,
                    "replies": []
                },
                {
                    "body": "Your post is a fabrication, and you're just arguing for the sake of arguing. My premise isn't flawed. It's Negotiation 101, and is as fundamental as it gets.\n\nAnd more specifically, your rebuttal fails because (in the scenario I described above), the SB only received half of what she could have otherwise received, if only she had asked for it. That's the complete opposite of \"there's nothing wrong with that\".",
                    "author": "Nomad_Bill",
                    "id": "jbwije0",
                    "parent_id": "t1_jbw1s2u",
                    "score": -1,
                    "created_utc": 1678604099.0,
                    "replies": [
                        {
                            "body": "> My premise isn't flawed. It's Negotiation 101.\n\nYour premise **is** flawed, and relationships (sugar or otherwise) are but business deals.\n\n>And more specifically, your rebuttal fails because (in the scenario I described above), the SB only received half of what she could have otherwise received, if only she had asked for it. That's the complete opposite of \"there's nothing wrong with that\".\n\nI’m not sure what kind of flex you’re trying to make here, it really just makes you look bad. You would have been willing to support her more (note my usage of “support,” not “pay,” because again, we’re talking about relationships and not business transactions) but you didn’t “pay” her more, presumably because you’re cheap. You could have very easily just given her the extra amount that she “could have” received, because if you think she could have received that greater amount, you also thought she brought proportionately extra value to your life. But you didn’t. \n\nThat says a lot more about the kind of person you are than it does about their negotiation skills.",
                            "author": "throwaway321zyxw",
                            "id": "jg1naes",
                            "parent_id": "t1_jbwije0",
                            "score": 1,
                            "created_utc": 1681353568.0,
                            "replies": [
                                {
                                    "body": "Nope. All of that is wrong. It's an emotion-driven word salad of ad hominems and fabrications. You have no idea what you're talking about, and are arguing just to argue.",
                                    "author": "Nomad_Bill",
                                    "id": "jg41hip",
                                    "parent_id": "t1_jg1naes",
                                    "score": 0,
                                    "created_utc": 1681403203.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Disagree bc it’s not a business. I personally prefer that the SB tell me what she wants. And in every single case where the SB has told me and I thought too low, I increased it. And I have done that in 4 of my SRs. \n\nIf it’s more than my budget, then I wish them well.",
            "author": "thereadinessisall",
            "id": "jbw2dwa",
            "parent_id": "t1_jbw1frr",
            "score": 5,
            "created_utc": 1678593771.0,
            "replies": []
        },
        {
            "body": ">Good stuff, but it leaves out the #1 rule of financial negotiations: ... The first person to name a number loses.\n\nWhen I met my first SB , I told her the PPM I was willing to offer. She accepted.\n\nObviously I **lost** that negotiation by naming a number. Oh well. I had a great year long SR with her.",
            "author": "BinghamtonSD",
            "id": "jbwczie",
            "parent_id": "t1_jbw1frr",
            "score": 3,
            "created_utc": 1678600142.0,
            "replies": []
        },
        {
            "body": "Very glad you enjoyed it! :)",
            "author": "HarvardLawSB",
            "id": "jbw4hse",
            "parent_id": "t1_jbw4eor",
            "score": 2,
            "created_utc": 1678594952.0,
            "replies": []
        },
        {
            "body": "That’s a mix of making an offer and suggesting relevant criteria :).",
            "author": "HarvardLawSB",
            "id": "jbw8g6d",
            "parent_id": "t1_jbw89ry",
            "score": 4,
            "created_utc": 1678597273.0,
            "replies": []
        },
        {
            "body": ">I just want to be fair. \n\nI would be more concerned with this than with the \"robbing\" -- people having different expectations than you doesn't mean they're robbers or being robbed from. Being fair is important though and I definitely like your method. Negotiating in these kinds of scenarios feels to me like a lose-lose.",
            "author": "HarvardLawSB",
            "id": "jbvvbo4",
            "parent_id": "t1_jbvtkpu",
            "score": 6,
            "created_utc": 1678589997.0,
            "replies": [
                {
                    "body": "I hear you. The fact is I have built companies and hired hundreds of people and always offered people a tad more than market. Always a good strategy. \n\nSmall sliver have tried to outsmart by quoting fake made up figures which very quickly get proven wrong. \n\nSame principles for sugar. \n\nWith me, a premium is on the table. I am not pulling a fast one on the ladies by low balling, so why pull a fast one on me by putting fake numbers.",
                    "author": null,
                    "id": "jbw6dow",
                    "parent_id": "t1_jbvvbo4",
                    "score": 2,
                    "created_utc": 1678596040.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If someone said \"I'd love to hear more about how you think about the financial side of things\" you would be turned off?\n\nIt's not rocket surgery, but not everyone-- and especially not young women-- has experience bringing up money. \n\nI feel like I need to edit the post to take out the bit about this coming from a negotiation class because the point of this post is not \"how to negotiate\"-- the point is to teach some methods on how to bring up money if you're not comfortable being direct.\n\nEither way, I feel your last comment is fairly grotesque so we likely don't see eye to eye on a lot of things",
            "author": "HarvardLawSB",
            "id": "jbw30bq",
            "parent_id": "t1_jbw2kwe",
            "score": 8,
            "created_utc": 1678594117.0,
            "replies": [
                {
                    "body": "The sugarbabies I engage are college age  student, the 18-22 crowd, so these conversations are never had.   They are happy to be considered, enjoy the fantastic times, and are for the most part, very appreciative.   When we discuss funding, I ask them how much they feel they are worth.  Whatever they respond, my response is, oh, you are worth WAY more than that!!!  Then we get into market value and past performance. \n\nThey are gorgeous and are in it too have fun, love being treated with respect, love the attention, amazing intimacy, and money.\n\nYour 10 ways are for women in their 30s and 40s.  I vanilla date that group.",
                    "author": null,
                    "id": "jbw51vq",
                    "parent_id": "t1_jbw30bq",
                    "score": 0,
                    "created_utc": 1678595267.0,
                    "replies": [
                        {
                            "body": "In that case, you’re suggesting relevant criteria. In your view, the relevant criteria is how much they feel they’re worth (I believe this is a gross way of framing it, but putting that aside…)\n\nAs I said, it’s just the different ways you choose to approach the money conversation. It’s not isolated to a SB’s use, and certainly not to those in a certain age range.",
                            "author": "HarvardLawSB",
                            "id": "jbw5f6c",
                            "parent_id": "t1_jbw51vq",
                            "score": 8,
                            "created_utc": 1678595485.0,
                            "replies": [
                                {
                                    "body": "We can agree to disagree.",
                                    "author": null,
                                    "id": "jbw7i4i",
                                    "parent_id": "t1_jbw5f6c",
                                    "score": 0,
                                    "created_utc": 1678596701.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "*She needs us more than we need her.*\n\n*We hold all the cards. All.*\n\nLove the delusion here!!\n\nNEED  is the one thing that has driven the world . This is not philosophy it's hard facts. \n\nYou go on the sugaring sites because you NEED something. You have gfs/fwbs/friends all arising from a simple thing called \"NEED\". \n\nSo, *You so equally need her.*\n\nStop living a life of misery and start really looking in deeper.There are some things you need to sort out.",
            "author": null,
            "id": "jbw5bsz",
            "parent_id": "t1_jbw2kwe",
            "score": 10,
            "created_utc": 1678595430.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "jbw7bum",
                    "parent_id": "t1_jbw5bsz",
                    "score": 0,
                    "created_utc": 1678596601.0,
                    "replies": [
                        {
                            "body": "No one holds the card. No one . Remember that.\n\nWe all eventually die. So no one holds anything really. \n\nGood luck!! I will not be commenting on this anymore.",
                            "author": null,
                            "id": "jbwbmpf",
                            "parent_id": "t1_jbw7bum",
                            "score": 4,
                            "created_utc": 1678599258.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Market value… honestly, how can you run a proper valuation on a prospective arrangement if you haven’t met the person and haven’t assessed what unique attributes she has to offer?",
            "author": "LVSugarBebe",
            "id": "jbxcqji",
            "parent_id": "t1_jbw2kwe",
            "score": 5,
            "created_utc": 1678627579.0,
            "replies": [
                {
                    "body": "This is discussed after the meet and greet.",
                    "author": null,
                    "id": "jbxd4n2",
                    "parent_id": "t1_jbxcqji",
                    "score": 1,
                    "created_utc": 1678627815.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you :)",
            "author": "HarvardLawSB",
            "id": "jbvv08y",
            "parent_id": "t1_jbvtn53",
            "score": 2,
            "created_utc": 1678589829.0,
            "replies": []
        },
        {
            "body": "You used 14 words for this unhelpful comment.",
            "author": "Inner_Examination_38",
            "id": "jbxmibe",
            "parent_id": "t1_jbw9rzn",
            "score": 6,
            "created_utc": 1678632568.0,
            "replies": []
        },
        {
            "body": "It's meant as a compliment. I can see how you could be off put by that, it's like the SB might be trying to have an opinion on how you spend your money. \n\nI complement- ask- compliment, As my lovely friend calls it \" a compliment sandwich is the best sandwich!\"",
            "author": "MapleSappling",
            "id": "jc0pxmm",
            "parent_id": "t1_jbyab9a",
            "score": 1,
            "created_utc": 1678682232.0,
            "replies": []
        },
        {
            "body": "You’re very welcome :)",
            "author": "HarvardLawSB",
            "id": "jc0jnk1",
            "parent_id": "t1_jc0h0xh",
            "score": 1,
            "created_utc": 1678678672.0,
            "replies": []
        },
        {
            "body": "> But I very much don't subscribe to Voss's \"my way or the highway\" mentality or that a negotiation is a big game where you need a tactical advantage or manipulation.\n\nI agree with you in the context of anything outside an actual hostage negotiation. For those, it is an absolute imperative. lol",
            "author": "FLRAdvocate",
            "id": "jbvweg7",
            "parent_id": "t1_jbvui1o",
            "score": 15,
            "created_utc": 1678590555.0,
            "replies": [
                {
                    "body": "what's missing in the attempt to transfer negotiating skills from merger deals, hostage negotiations or used car sales is that that the arrangement  is about an ongoing relationship.  Ideally the handling of the discussion leads to a strengthening of the bonds.  It is also an exercise in leadership by both.  \n\nThink of the \"arrangement\"   as creation of a bouquet in a crystal vase.   You are partners in the creation of the arrangement .  If you tussle excessively you will break the vase and in the morning all you will have wilted flowers and broken glass.",
                    "author": "pinotandsugar",
                    "id": "jbwjrxo",
                    "parent_id": "t1_jbvweg7",
                    "score": 15,
                    "created_utc": 1678605030.0,
                    "replies": [
                        {
                            "body": "Oh, I love this analogy",
                            "author": "HarvardLawSB",
                            "id": "jbwl0lv",
                            "parent_id": "t1_jbwjrxo",
                            "score": 6,
                            "created_utc": 1678605982.0,
                            "replies": [
                                {
                                    "body": "It came from the other side of the river",
                                    "author": "pinotandsugar",
                                    "id": "jbwpdsb",
                                    "parent_id": "t1_jbwl0lv",
                                    "score": 1,
                                    "created_utc": 1678609559.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would agree with you - I've had the best success (and the most fulfilling SRs) using the collaborative negotiation stye. Let's get a win/win deal on the table so we all walk away satisfied.",
            "author": "Hot_Selection3626",
            "id": "jbvwcu2",
            "parent_id": "t1_jbvui1o",
            "score": 9,
            "created_utc": 1678590533.0,
            "replies": [
                {
                    "body": "Yup totally concur! Wasn’t trying to suggest argumentative, just that a lot (most) SBs could use skills here in general.\n\nEdit: I don’t remember Voss as being purely “my way or highway” but will happily give your authors a read. :)",
                    "author": "quietgrey1",
                    "id": "jbw6q8c",
                    "parent_id": "t1_jbvwcu2",
                    "score": 3,
                    "created_utc": 1678596243.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m going to go back and re-read Voss. In my mind at the moment I think of it as giving tools so people are able to negotiate, not go for the jugular, but two of you have strong opinions otherwise so perhaps my interpretation here is invalid. \n\nIn my mind the goal is equity but that SBs have no idea how to hold their own. But if that’s not what the book was suggesting then apologies in advance.",
            "author": "quietgrey1",
            "id": "jbwd4lr",
            "parent_id": "t1_jbw8b7y",
            "score": 4,
            "created_utc": 1678600239.0,
            "replies": []
        },
        {
            "body": "i strongly agree with this. either you’re aligned or not. meeting in the middle of two faraway places just means two people far from where they want to be, and if one or both of the numbers was just a “negotiation tactic,” then one or both people aren’t people i’d want to be with.\n\ni can’t count how many times a potential SB asked for twice as much as she really thought was a rewarding arrangement, only to come back with a much smaller ask after being politely but permanently declined. leave the highball/lowball stuff for tacky business deals!",
            "author": "sdsf9",
            "id": "jbwf1zb",
            "parent_id": "t1_jbvyh6s",
            "score": 5,
            "created_utc": 1678601557.0,
            "replies": []
        },
        {
            "body": "I second this. Especially for those of us aiming for higher allowances in the 6-figures.\n\nFor guys saying they’re happy when she accepts less than they would have offered… they risk losing a good SB when she later discovers she can do better. Also, people tend to show up in a way that reflects the worth others see in them. If a woman feel’s valued, she’ll generally put in more effort to keep that relationship and fulfill her end of the deal.",
            "author": "LVSugarBebe",
            "id": "jbwbr57",
            "parent_id": "t1_jbw1s2u",
            "score": 8,
            "created_utc": 1678599338.0,
            "replies": []
        },
        {
            "body": "Your post is a fabrication, and you're just arguing for the sake of arguing. My premise isn't flawed. It's Negotiation 101, and is as fundamental as it gets.\n\nAnd more specifically, your rebuttal fails because (in the scenario I described above), the SB only received half of what she could have otherwise received, if only she had asked for it. That's the complete opposite of \"there's nothing wrong with that\".",
            "author": "Nomad_Bill",
            "id": "jbwije0",
            "parent_id": "t1_jbw1s2u",
            "score": -1,
            "created_utc": 1678604099.0,
            "replies": [
                {
                    "body": "> My premise isn't flawed. It's Negotiation 101.\n\nYour premise **is** flawed, and relationships (sugar or otherwise) are but business deals.\n\n>And more specifically, your rebuttal fails because (in the scenario I described above), the SB only received half of what she could have otherwise received, if only she had asked for it. That's the complete opposite of \"there's nothing wrong with that\".\n\nI’m not sure what kind of flex you’re trying to make here, it really just makes you look bad. You would have been willing to support her more (note my usage of “support,” not “pay,” because again, we’re talking about relationships and not business transactions) but you didn’t “pay” her more, presumably because you’re cheap. You could have very easily just given her the extra amount that she “could have” received, because if you think she could have received that greater amount, you also thought she brought proportionately extra value to your life. But you didn’t. \n\nThat says a lot more about the kind of person you are than it does about their negotiation skills.",
                    "author": "throwaway321zyxw",
                    "id": "jg1naes",
                    "parent_id": "t1_jbwije0",
                    "score": 1,
                    "created_utc": 1681353568.0,
                    "replies": [
                        {
                            "body": "Nope. All of that is wrong. It's an emotion-driven word salad of ad hominems and fabrications. You have no idea what you're talking about, and are arguing just to argue.",
                            "author": "Nomad_Bill",
                            "id": "jg41hip",
                            "parent_id": "t1_jg1naes",
                            "score": 0,
                            "created_utc": 1681403203.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I hear you. The fact is I have built companies and hired hundreds of people and always offered people a tad more than market. Always a good strategy. \n\nSmall sliver have tried to outsmart by quoting fake made up figures which very quickly get proven wrong. \n\nSame principles for sugar. \n\nWith me, a premium is on the table. I am not pulling a fast one on the ladies by low balling, so why pull a fast one on me by putting fake numbers.",
            "author": null,
            "id": "jbw6dow",
            "parent_id": "t1_jbvvbo4",
            "score": 2,
            "created_utc": 1678596040.0,
            "replies": []
        },
        {
            "body": "The sugarbabies I engage are college age  student, the 18-22 crowd, so these conversations are never had.   They are happy to be considered, enjoy the fantastic times, and are for the most part, very appreciative.   When we discuss funding, I ask them how much they feel they are worth.  Whatever they respond, my response is, oh, you are worth WAY more than that!!!  Then we get into market value and past performance. \n\nThey are gorgeous and are in it too have fun, love being treated with respect, love the attention, amazing intimacy, and money.\n\nYour 10 ways are for women in their 30s and 40s.  I vanilla date that group.",
            "author": null,
            "id": "jbw51vq",
            "parent_id": "t1_jbw30bq",
            "score": 0,
            "created_utc": 1678595267.0,
            "replies": [
                {
                    "body": "In that case, you’re suggesting relevant criteria. In your view, the relevant criteria is how much they feel they’re worth (I believe this is a gross way of framing it, but putting that aside…)\n\nAs I said, it’s just the different ways you choose to approach the money conversation. It’s not isolated to a SB’s use, and certainly not to those in a certain age range.",
                    "author": "HarvardLawSB",
                    "id": "jbw5f6c",
                    "parent_id": "t1_jbw51vq",
                    "score": 8,
                    "created_utc": 1678595485.0,
                    "replies": [
                        {
                            "body": "We can agree to disagree.",
                            "author": null,
                            "id": "jbw7i4i",
                            "parent_id": "t1_jbw5f6c",
                            "score": 0,
                            "created_utc": 1678596701.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "jbw7bum",
            "parent_id": "t1_jbw5bsz",
            "score": 0,
            "created_utc": 1678596601.0,
            "replies": [
                {
                    "body": "No one holds the card. No one . Remember that.\n\nWe all eventually die. So no one holds anything really. \n\nGood luck!! I will not be commenting on this anymore.",
                    "author": null,
                    "id": "jbwbmpf",
                    "parent_id": "t1_jbw7bum",
                    "score": 4,
                    "created_utc": 1678599258.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is discussed after the meet and greet.",
            "author": null,
            "id": "jbxd4n2",
            "parent_id": "t1_jbxcqji",
            "score": 1,
            "created_utc": 1678627815.0,
            "replies": []
        },
        {
            "body": "what's missing in the attempt to transfer negotiating skills from merger deals, hostage negotiations or used car sales is that that the arrangement  is about an ongoing relationship.  Ideally the handling of the discussion leads to a strengthening of the bonds.  It is also an exercise in leadership by both.  \n\nThink of the \"arrangement\"   as creation of a bouquet in a crystal vase.   You are partners in the creation of the arrangement .  If you tussle excessively you will break the vase and in the morning all you will have wilted flowers and broken glass.",
            "author": "pinotandsugar",
            "id": "jbwjrxo",
            "parent_id": "t1_jbvweg7",
            "score": 15,
            "created_utc": 1678605030.0,
            "replies": [
                {
                    "body": "Oh, I love this analogy",
                    "author": "HarvardLawSB",
                    "id": "jbwl0lv",
                    "parent_id": "t1_jbwjrxo",
                    "score": 6,
                    "created_utc": 1678605982.0,
                    "replies": [
                        {
                            "body": "It came from the other side of the river",
                            "author": "pinotandsugar",
                            "id": "jbwpdsb",
                            "parent_id": "t1_jbwl0lv",
                            "score": 1,
                            "created_utc": 1678609559.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yup totally concur! Wasn’t trying to suggest argumentative, just that a lot (most) SBs could use skills here in general.\n\nEdit: I don’t remember Voss as being purely “my way or highway” but will happily give your authors a read. :)",
            "author": "quietgrey1",
            "id": "jbw6q8c",
            "parent_id": "t1_jbvwcu2",
            "score": 3,
            "created_utc": 1678596243.0,
            "replies": []
        },
        {
            "body": "> My premise isn't flawed. It's Negotiation 101.\n\nYour premise **is** flawed, and relationships (sugar or otherwise) are but business deals.\n\n>And more specifically, your rebuttal fails because (in the scenario I described above), the SB only received half of what she could have otherwise received, if only she had asked for it. That's the complete opposite of \"there's nothing wrong with that\".\n\nI’m not sure what kind of flex you’re trying to make here, it really just makes you look bad. You would have been willing to support her more (note my usage of “support,” not “pay,” because again, we’re talking about relationships and not business transactions) but you didn’t “pay” her more, presumably because you’re cheap. You could have very easily just given her the extra amount that she “could have” received, because if you think she could have received that greater amount, you also thought she brought proportionately extra value to your life. But you didn’t. \n\nThat says a lot more about the kind of person you are than it does about their negotiation skills.",
            "author": "throwaway321zyxw",
            "id": "jg1naes",
            "parent_id": "t1_jbwije0",
            "score": 1,
            "created_utc": 1681353568.0,
            "replies": [
                {
                    "body": "Nope. All of that is wrong. It's an emotion-driven word salad of ad hominems and fabrications. You have no idea what you're talking about, and are arguing just to argue.",
                    "author": "Nomad_Bill",
                    "id": "jg41hip",
                    "parent_id": "t1_jg1naes",
                    "score": 0,
                    "created_utc": 1681403203.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In that case, you’re suggesting relevant criteria. In your view, the relevant criteria is how much they feel they’re worth (I believe this is a gross way of framing it, but putting that aside…)\n\nAs I said, it’s just the different ways you choose to approach the money conversation. It’s not isolated to a SB’s use, and certainly not to those in a certain age range.",
            "author": "HarvardLawSB",
            "id": "jbw5f6c",
            "parent_id": "t1_jbw51vq",
            "score": 8,
            "created_utc": 1678595485.0,
            "replies": [
                {
                    "body": "We can agree to disagree.",
                    "author": null,
                    "id": "jbw7i4i",
                    "parent_id": "t1_jbw5f6c",
                    "score": 0,
                    "created_utc": 1678596701.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No one holds the card. No one . Remember that.\n\nWe all eventually die. So no one holds anything really. \n\nGood luck!! I will not be commenting on this anymore.",
            "author": null,
            "id": "jbwbmpf",
            "parent_id": "t1_jbw7bum",
            "score": 4,
            "created_utc": 1678599258.0,
            "replies": []
        },
        {
            "body": "Oh, I love this analogy",
            "author": "HarvardLawSB",
            "id": "jbwl0lv",
            "parent_id": "t1_jbwjrxo",
            "score": 6,
            "created_utc": 1678605982.0,
            "replies": [
                {
                    "body": "It came from the other side of the river",
                    "author": "pinotandsugar",
                    "id": "jbwpdsb",
                    "parent_id": "t1_jbwl0lv",
                    "score": 1,
                    "created_utc": 1678609559.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nope. All of that is wrong. It's an emotion-driven word salad of ad hominems and fabrications. You have no idea what you're talking about, and are arguing just to argue.",
            "author": "Nomad_Bill",
            "id": "jg41hip",
            "parent_id": "t1_jg1naes",
            "score": 0,
            "created_utc": 1681403203.0,
            "replies": []
        },
        {
            "body": "We can agree to disagree.",
            "author": null,
            "id": "jbw7i4i",
            "parent_id": "t1_jbw5f6c",
            "score": 0,
            "created_utc": 1678596701.0,
            "replies": []
        },
        {
            "body": "It came from the other side of the river",
            "author": "pinotandsugar",
            "id": "jbwpdsb",
            "parent_id": "t1_jbwl0lv",
            "score": 1,
            "created_utc": 1678609559.0,
            "replies": []
        }
    ]
}