{
    "title": "An interesting title",
    "post_id": "fto2zo",
    "post_url": "https://www.reddit.com/r/dankruto/comments/fto2zo/an_interesting_title/",
    "author": "kae_de",
    "body": "",
    "url": "https://i.redd.it/gq96klqp8fq41.jpg",
    "score": 4049,
    "upvote_ratio": 0.99,
    "created_utc": 1585840576.0,
    "num_comments": 58,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "If they don't like it, force them to. Kotoamatsukami!",
            "author": "quirkyemoweeb69420",
            "id": "fm8auu7",
            "parent_id": "t3_fto2zo",
            "score": 186,
            "created_utc": 1585846009.0,
            "replies": [
                {
                    "body": "Comment of the century",
                    "author": "Tonantzin_314",
                    "id": "fmav3s2",
                    "parent_id": "t1_fm8auu7",
                    "score": 7,
                    "created_utc": 1585909010.0,
                    "replies": [
                        {
                            "body": ":) <3",
                            "author": "quirkyemoweeb69420",
                            "id": "fmbm2av",
                            "parent_id": "t1_fmav3s2",
                            "score": 5,
                            "created_utc": 1585929016.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "These guys were poping eyeballs like they were skittles.",
            "author": "Vlad_117",
            "id": "fm8q5xg",
            "parent_id": "t3_fto2zo",
            "score": 136,
            "created_utc": 1585853958.0,
            "replies": [
                {
                    "body": "Taste the Blood",
                    "author": "IAmYoDaddyDuh",
                    "id": "fm9pazy",
                    "parent_id": "t1_fm8q5xg",
                    "score": 26,
                    "created_utc": 1585873529.0,
                    "replies": [
                        {
                            "body": "Is that a devil may cry reference?",
                            "author": "cj-the-man",
                            "id": "fma80km",
                            "parent_id": "t1_fm9pazy",
                            "score": 5,
                            "created_utc": 1585886213.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "And placing them like changing light bulbs",
                    "author": "Hyperion1000",
                    "id": "fmagnrl",
                    "parent_id": "t1_fm8q5xg",
                    "score": 10,
                    "created_utc": 1585893513.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lmao at least your friends accepted your recommendation. Mine make up their minds that they don't like it before even starting",
            "author": "zarbod",
            "id": "fm8y6kr",
            "parent_id": "t3_fto2zo",
            "score": 51,
            "created_utc": 1585858205.0,
            "replies": [
                {
                    "body": "I pretty much never recommend anyone but my brother shows, because all my friends only watch the same type of anime stuff and I've only seen like 6 anime. The only show that one of my friends finally watched after my recommendation was the Outsider. And that was partly for a podcast.",
                    "author": "Elite_Doc",
                    "id": "fm9bqq8",
                    "parent_id": "t1_fm8y6kr",
                    "score": 9,
                    "created_utc": 1585865524.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How is it possible for people to dislike naruto after they’ve watched it??",
            "author": "tobiasvr23",
            "id": "fm8b51v",
            "parent_id": "t3_fto2zo",
            "score": 73,
            "created_utc": 1585846161.0,
            "replies": [
                {
                    "body": "I ask myself that question everyday",
                    "author": "quirkyemoweeb69420",
                    "id": "fm8bix5",
                    "parent_id": "t1_fm8b51v",
                    "score": 34,
                    "created_utc": 1585846366.0,
                    "replies": []
                },
                {
                    "body": "Naruto is a good anime but far from a great anime, it's understandable how someone could dislike it.\nThere's a lot of filler in it and that's just a waste of time, some of the characters are poorly written and get no conclusion, the story seems to change based on how the writers want it, Kishimoto just kept writing himself into corners like he did with Madara Uciha and his power escalation.\n\nThere's a lot of problems with the serie and especially part 2 and the Spin-Off Boruto.\n\nEven with Naruto being one of my top favourites it has a lot of problems, like a *LOT* of problems after the first serie Kishimoto really didn't have a direction, he knew where he wanted to go but didn't know how to get there. Writers often do this, they know where they want to go and instead of writing a road on how to get there they go backwards from where they wanted to end up.\n\nThe ending Kishimoto wanted was (Probably) Naruto Vs Sasuke, all else that happens in the series is just him creating the context for that ending to take place.",
                    "author": "Dan-TAW123",
                    "id": "fm8gv3x",
                    "parent_id": "t1_fm8b51v",
                    "score": 63,
                    "created_utc": 1585849149.0,
                    "replies": [
                        {
                            "body": "All throughout part 2 the Akatsuki were the main villains who were hunting tailed beast for the sake of a large scale war and the plot didn’t change from that until the kaguya plot twist. Intentions were revealed and sometimes changed, but the series was always building up to the great ninja war. \n\nAnd the power escalation made perfect since given the context. Madara absorbed the power of nine beast with practically limitless destructive power. If the power scaling didn’t go up than the Akatsuki’s goal wouldn’t have made sense. And all the characters got the conclusion they deserved, it’s not like every single side character needs an arc.\n\nThe series only gets bad at the kaguya revival part. Some side characters were pretty dull but it’s bit dramatic to call them poorly written. And you can skip filler, the anime ended 3 years ago there’s even a Naruto Kai now.",
                            "author": "silkboye",
                            "id": "fm8pubc",
                            "parent_id": "t1_fm8gv3x",
                            "score": 45,
                            "created_utc": 1585853791.0,
                            "replies": [
                                {
                                    "body": "The power scale got bad around Naruto and Bee vs. Revived Tailed Beasts. Rock Lee, Hinata, and a couple others either didn't have arcs that they deserved or had their arc rushed. But yeah overall the writing wasn't bad until Black Zetsu played Madara who played Obito.",
                                    "author": "fang434",
                                    "id": "fm9dr36",
                                    "parent_id": "t1_fm8pubc",
                                    "score": 13,
                                    "created_utc": 1585866665.0,
                                    "replies": [
                                        {
                                            "body": "I don’t get what was bad about it, the series establishes very early on that tailed beast are extremely powerful. Rock Lee’s purpose was to show that he could become an elite shinobi with just Taijutsu and he already proved himself to be elite by the end of part 1 if not in his fight against gaara. Hinata’s purpose was to build courage to fight for herself and she displays her courage in the pain arc and when she fought along side naruto in the ninja war arc. All the side characters who were fighting internal battles had some time of resolution. There are no loose ends and all the side characters served their purpose. Even Shino got a conclusion and he was a gag character in part 2.",
                                            "author": "silkboye",
                                            "id": "fm9hb7m",
                                            "parent_id": "t1_fm9dr36",
                                            "score": 7,
                                            "created_utc": 1585868733.0,
                                            "replies": [
                                                {
                                                    "body": "Shino being a gag character is not a good thing after how he was portrayed in part one, being creepily powerful. He hardly got a conclusion. Hinata didn't really fight alongside Naruto, she was fodder. Rock Lee was supposed to show hard work can let you achieve anything you want, yet he was still fodder and couldn't beat Sasuke or Naruto because they had crazy ninjutsu. Naruto should not be able to hold his own against 6 different tailed beasts simultaneously, and Kakashi should be destroyed by a single one but they all got power crept to be more powerful.",
                                                    "author": "fang434",
                                                    "id": "fm9kt2c",
                                                    "parent_id": "t1_fm9hb7m",
                                                    "score": 6,
                                                    "created_utc": 1585870776.0,
                                                    "replies": [
                                                        {
                                                            "body": "Gag characters are never good tbh but his conclusion was that he found a passion in teaching. Rock lee wanted to prove he be an elite shinobi without chakra and he did that. Hinata was just meant to prove her courage and she did that. Just because they didn’t become the strongest in the series doesn’t mean they didn’t accomplish their goals. You’re expectations aren’t too high for side characters. I can’t think of many shonen series where side characters are as strong as main characters by the end. \n\nAnd in the anime it wasn’t really that much of a fight. Neither side really had a chance to go all out.",
                                                            "author": "silkboye",
                                                            "id": "fm9psbu",
                                                            "parent_id": "t1_fm9kt2c",
                                                            "score": 5,
                                                            "created_utc": 1585873837.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Right. No matter how good lee gets he’s a side character. How can you be mad that a side character couldn’t beat superman the main character?\n\nNobody got mad that goku can beat all the teammates in dbz. I think he’s just a hater",
                                                                    "author": "Phenoxx",
                                                                    "id": "fma1496",
                                                                    "parent_id": "t1_fm9psbu",
                                                                    "score": 0,
                                                                    "created_utc": 1585881254.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "i saw naruto kai only and it waz dope",
                                    "author": "Dhruv_Colossus",
                                    "id": "fnv5pxf",
                                    "parent_id": "t1_fm8pubc",
                                    "score": 2,
                                    "created_utc": 1587281151.0,
                                    "replies": []
                                },
                                {
                                    "body": "They abandoned a lot of the side Characters to focus on Naruto and Sasuke, also the reincarnation part was really dumb. In a world where Naruto and Sasuke were fated to fight on another their actions had no weight. Ninja Jesus and His children were horrible characters. Kaguya and Zetsu were probably the worst thing to ever come out of Naruto.\nMadara was defeated in a stupid way, they went on and on about the power of Friendship and Cooperation and then Naruto and Sasuke were the only one who's actions mattered. Both shows have their strength but Shippuden has none of the technical aspects of Ninja combats that the first serie had, Shippuden is just people throwing energy stuff at each others and seeing who can withstand it better. There were some great moments, good moments, bad moments and mostly fillers to tie it all together.\n\nEven ignoring the fillers the show, both of them (and the manga it's based upon) have many problems, Kishimoto isn't good at world building, he's good at Character writing and in Shippuden he shifted into world building, which he isn't capable of doing.\n\nIt was such a missed opportunity to make something great, if only he was a better writer.\n\nHonestly who could tell me that Naruto has some good lore and worldbuilding, compared to the character focused moments.\n\nLike all of the scene with Shikamaru after >!Asuma death's;< or Naruto and >!Jiraya's!<. The show is at its best there and not showing you this pointless world of Space Chakra and dimension bullshit.\n\nThe Kyuubi and the other tailed beasts were being changed and they did whatever the fuck they wanted with them, like they did all Characters, they have a Character with an established personality and they change it to fit whatever story they want to tell. \n\nThey have some characters who really have nothing to do, like Sakura, Ino, Tenten and Hinata, until the end they have nothing to do. (I'm sure people will want to defend their Waifus).\n\nCharacters like Neji, Lee, Shino and Kiba are abandoned, Shikamaru and Choji's development gets changed whenever they feel like it.\n\nThe Akatsuki get some development but they're also retconned every once in a while, not always good or bad.\n\nSome characters are better in Shippuden, like Itachi, he did get a lot of development in the second serie.\n\nSome Characters are completely abandoned like Orochimaru and Kabuto. They're shadows of their former selves and it's a shame because Orochimaru was one of my favs in Naruto.\n\nI could go on but I don't want to rant for too long.\n\nPeace out and bye.",
                                    "author": "Dan-TAW123",
                                    "id": "fm9js0n",
                                    "parent_id": "t1_fm8pubc",
                                    "score": 0,
                                    "created_utc": 1585870172.0,
                                    "replies": [
                                        {
                                            "body": "You use the word “abandon” really excessively. Like we’re you expecting each and every side character to have an arc to themselves? The series is literally called naruto of course everything will revolve around him. It’s ridiculous to think that every side character is going to have some big shining moment when new side characters are introduced every arc. The purpose of a side character is to work for the plot not for the plot to work for them. And many side characters have presence throughout the whole series like Kabuto and Orochimaru, how were they abandoned? What more did you want from them? Shikamaru has MVP moments in 4 different arcs and has an entire arc to himself. \n\nThe Kaguya plot twist was properly foreshadowed before the war arc and  well explained within the series even if Madara was the better villain it doesn’t mean the plot twist made no sense. And everyone’s actions mattered, Naruto wouldn’t have gotten as far as he did without the people around him. It’s ridiculous to try to downplay everyone’s role in the series because things would’ve played out differently if it weren’t for characters like itachi and Jiraiya etc.\n\nAnd you need to provide evidence before you say stuff like “The Kyuubi and the other tailed beasts were being changed and they did whatever the fuck they wanted with them, like they did all Characters, they have a Character with an established personality and they change it to fit whatever story they want to tell.” You keep saying characters development were retconned but you provide no proof.\n\nAll the side characters concluded what ever internal struggle they had going on (example: Neji and Rock lee). It just seems like you expected them to get as much screen time as main characters which doesn’t happen in any series unless it’s slice of life.\n\nThe fights still had strategy even up to the war arc. Example: Sasuke v Deidara, Obito v Kakashi, itachi v Sasuke and Hidan v Shikamaru.\n\nAnd pretty much everything else in that rant is just a bunch of complaints with no reason or evidence attached to it. Like at least explain how Choji’s development is changed.",
                                            "author": "silkboye",
                                            "id": "fm9ocm8",
                                            "parent_id": "t1_fm9js0n",
                                            "score": 2,
                                            "created_utc": 1585872932.0,
                                            "replies": [
                                                {
                                                    "body": "In the beginning they said that the beast were just forces of nature with no intelligence (paraphrasing)\n\nAlso I didn't said all fights were non strategic, I knew you'd bring up the deidara fight or the Obito one, I agree with those picks but quoting a dozen \"strategic\" fight scenes out of the hundreds that aren't doesn't mean that the majority of fights is. \n\nNeji ended up being right, the show was supposed to be about a kid who marginalized by society for different reasons, he was the underdog, yet at every fight and in every arc there's need to be an awesome revelation on how he's special and stronger than everyone, he has a god inside him, his parents were great ninjas, he was trained by other great ninjas, he kept using the fox's chakra instead of his own, he was a reincarnation of the son of Ninja Jesus, none of the things he did mattered, of everything happened because of destiny then none of the choices the character makes have an actual impact.\n\nKaguya and Zetsu were not foreshadowed at all, I don't know where the heck did you see that being foreshadowed.\n\nChoji had an entire episode dedicated to him believing in himself during the war arc and then he magically lost weight and during the madara fight he gained it all back, like wtf? And in Boruto he's far and thin whenever he wants, like, again, WTF?\n\nNeji was right in the end, during the chunin exams he said it.\n\nNaruto has declined in quality over the years, it's by far not a bad serie, it's just average.\n\nA lot of anime fall into that bad writing, they start out great and then drop like shit.\n\nI'm talking as a fan, if you can't admit that the serie has its problems then you must be blind. It's better to be out of the circlejerk and admit it, the serie has really gone downhill.",
                                                    "author": "Dan-TAW123",
                                                    "id": "fm9tmwf",
                                                    "parent_id": "t1_fm9ocm8",
                                                    "score": 3,
                                                    "created_utc": 1585876306.0,
                                                    "replies": [
                                                        {
                                                            "body": "Neji didn’t talk about destiny in the literal sense. His point was that people can’t change their position in hierarchy/society no matter how fit or unfit they are for that position. Like Hinata was was technically destined to become the leader for the hyuga even though she was clearly unfit for it and she never did become fit for it even though it was her destiny. He believed naruto would stay a hated outcast because that’s how he was born. \n\n  Naruto was not an underdog story. By mid way of the land if waves arc it should’ve been obvious that Naruto was not an underdog because by this point it was stated that his only disadvantage to his peers was his poor chakra control and this was because he had practically infinite chakra and also he was shown to be able to tap into the chakra of the nine tailed beast that almost destroyed a village full of Shinobi, so did he really have it that bad? And throughout part 1 he was shown to be clever enough to find ways around his handicap so it’s not even like he was stupid either. In the final valley fight Sasuke literally acknowledges that Naruto is “special” so definitely by this point it’s clear that this was not meant to be an underdog story. This is the worst misconception for the series I’ve heard and it shows that you don’t know what you’re even talking about.\n\nHundreds of fights?? Really!?\n\nKaguya AKA “the rabbit goddess” was name dropped a couple times throughout the series not just in the war arc. Black zestu was a mystery all throughout the series because is objectives were never stated until the plot twist and he had presence even during part 1 so he didn’t come out of nowhere. But you would only know this if you’d pay attention.\n\nAnd choji’s transformation being inconsistent is as petty as complaining about goku’s hair turning to normal after ss3. It makes no difference either way, why be mad over something so trivial?\n\nEdit: and no one ever tried to understand the tailed beast except Naruto so of course people just thought they were mindless.",
                                                            "author": "silkboye",
                                                            "id": "fm9w9bs",
                                                            "parent_id": "t1_fm9tmwf",
                                                            "score": 2,
                                                            "created_utc": 1585877993.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I’d like to know when was Kaguya was mentioned during the series. The whole time it was all about the Rikudo Sennin not Kaguya. The first time she was mentioned was when Madara explained to Hashirama how chakra came to be. I am pretty certain of what I am saying, I watched the anime and I own all manga chapters.",
                                                                    "author": "WrongCilantro",
                                                                    "id": "fmbp13v",
                                                                    "parent_id": "t1_fm9w9bs",
                                                                    "score": 4,
                                                                    "created_utc": 1585930589.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Sorry I don’t have a source but I just remember “rabbit goddess” being mentioned subtly by Kakashi. Even if she was foreshadowed that one time by Madara it still counts as foreshadowing anyway so it makes no difference.",
                                                                            "author": "silkboye",
                                                                            "id": "fmbxncl",
                                                                            "parent_id": "t1_fmbp13v",
                                                                            "score": 1,
                                                                            "created_utc": 1585935102.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I don’t recall Kakashi talking about the rabbit goddess, I’ll have to check it out and make my research as you could be right, my memory sucks sometimes. And yes it is foreshadowing but you have to admit it still came very very late and was a little last minute storywise.",
                                                                                    "author": "WrongCilantro",
                                                                                    "id": "fmbyaxz",
                                                                                    "parent_id": "t1_fmbxncl",
                                                                                    "score": 2,
                                                                                    "created_utc": 1585935448.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "She might’ve been referenced when kimimaru’s origin story was explained. And yeah it was done in a shady kinda way but at least it’s not a total asspull. And I’ve seen many series even outside of anime get away with much cheaper writing tactics so it doesn’t bug me. The only series I can think of that always uses foreshadowing properly is one piece.",
                                                                                            "author": "silkboye",
                                                                                            "id": "fmc0g1v",
                                                                                            "parent_id": "t1_fmbyaxz",
                                                                                            "score": 1,
                                                                                            "created_utc": 1585936585.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Dude, you give too much credit to Kishimoto and his assistant and editors. You have to understand that in the process of writing a serie people change things, especially in an on-going serie like the ShonenJump series. You're trying to give this things too much sense, the story was not ready from the beginning, someone above me confirmed this as well, with no sources, that Kishimoto wanted to end the serie with Naruto Vs Sasuke, it was obvious that he had a goal in mind and just went backwards from that plot point, but going this way ruins everything else, the characters are supposed to have a natural development and in Naruto they don't really have that, some of them do, but the characters change to serve the plot and the writers, it's the lazy writer technique. I like Naruto, wether you believe this or not, but the story isn't as good, the characters were the best part of it and by the end Kishimoto and his assistants cast them aside to focus on the plot which they were incapable of writing. You can't seriously tell me it's good or they had thought about it from the beginning, Kaguya came out of nowhere to save Kishimoto after he wrote himself into a corner. Ninja Jesus was so dumb, he could've been a great character but he was just literally was a 2Dimensional boring character. The resurrection parts were so dumb, the only thing that was salvageable were the characters and Kishimoto failed at it, the last good episode was the Naruto Vs Sasuke fight, after that it was fillers all over again and a couple of movies. They milked the franchise dry, both ShonenJump and The Studio Pierrot, like they're doing with Boruto now. It's such a wasted opportunity and time. I loved this serie as a kid, I grew up with it, but it's really not as great as everyone says it is, especially Shippuden. The second part of the serie was particularly bad, especially after the Pain Arc, after that the good moments were few, Itachi had some of the best development in Shippuden (as I've said already) even other characters had, but by the war arc everything was forgotten, one of the worst arcs I've seen, ever.",
                                                                    "author": "Dan-TAW123",
                                                                    "id": "fm9ybv6",
                                                                    "parent_id": "t1_fm9w9bs",
                                                                    "score": 2,
                                                                    "created_utc": 1585879347.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I couldn’t care less about what happened with Kishimoto and his editors behind the scenes. I’m not trying to make the series make sense, it’s more like you’re trying to make the series look bad by disregarding all the context and exposition the series has. That’s how you get ridiculous arguments like “Neji is right about destiny” , “Obito started a war because his crush died” or my personal favorite “Naruto’s underdog story got ruined”. \n\nKaguya’s revival itself wasn’t bad but pretty much everything that involved her made the series less enjoyable and made the series make less sense. This part took up about less than a third of the war arc and it was terrible but it didn’t ruin the war arc for me and saying that it ruined the whole series is just overdramatic.\n\nHagoromo served his purpose he was a mediocre character but that’s fine considering he had probably 8-15 minutes of screen time. And after the pain arc there were so many good moments like the waterfall of truth and the reunion of Sasuke and itachi.",
                                                                            "author": "silkboye",
                                                                            "id": "fma0lyw",
                                                                            "parent_id": "t1_fm9ybv6",
                                                                            "score": 0,
                                                                            "created_utc": 1585880905.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "thats not what i said, i never talked against obito, he was one of my favourites. also i said it myself that even after the pain arc there were good moments. i think youre misunderstanding me, im criticising the serie but you think im an hater, im not. Naruto is one of my favorites series, but just because it is doesnt make it immune to my criticism, it would be dishonest from me to just ignore all the bad writing, just as it would for you. the story was changed constantly from one thing to another, Kishimoto had no actual direction, he only had plot-points he wanted to reach, its pretty clear hes not the great writer you seem to think he is, even his new serie is being canceled after only a few months of coming out. hes not capable of writing stories, his strength is in the character writing, which he abandoned around the war arc, some characters did get a good treatment, like Itachi (as ive said 4 times already, not only him but also a few others).",
                                                                                    "author": "Dan-TAW123",
                                                                                    "id": "fma210a",
                                                                                    "parent_id": "t1_fma0lyw",
                                                                                    "score": 3,
                                                                                    "created_utc": 1585881879.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I wasn’t trying to imply that you think Obito started the war for that reason, I’m just saying the series gets a lot of hate because of misconceptions due to people pulling characters and events completely out of context to bash it. \n\nWhether you think Naruto is amazing or garbage doesn’t matter to me. My point is that Naruto’s overall quality was consistent from land of waves up to the beginning of the ninja war. I understand why that arc is controversial. If you hate that arc I would understand. I was lucky enough to experience the war arc through the video game adaptation so I enjoyed it for the most part. \n\nEver since the beginning of part 2 the plot was clearly headed to some type of massive war because the Akatsuki were collecting 9 beast with practically limitless destructive power. And lack of screen time does not mean abandoned. Side characters are meant to serve the plot not the other way around. Side characters were used whenever they were necessary. People had extremely high hopes for Naruto side characters in particular which I don’t understand.",
                                                                                            "author": "silkboye",
                                                                                            "id": "fma3lio",
                                                                                            "parent_id": "t1_fma210a",
                                                                                            "score": 1,
                                                                                            "created_utc": 1585882967.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Imagine being this delusional. Naruto part 1 is the only good one, shippuden and boruto are terrible",
                                    "author": "Clayman_",
                                    "id": "fm92kdp",
                                    "parent_id": "t1_fm8pubc",
                                    "score": -19,
                                    "created_utc": 1585860515.0,
                                    "replies": [
                                        {
                                            "body": "Nice rebuttal! Totally proved me wrong.",
                                            "author": "silkboye",
                                            "id": "fm93knx",
                                            "parent_id": "t1_fm92kdp",
                                            "score": 11,
                                            "created_utc": 1585861058.0,
                                            "replies": [
                                                {
                                                    "body": "You just have no taste. There is no comparison between OG Naruto and shippuden. Shippuden has no real story and all the fights look like either DBZ or kaiju fights. And boruto is just pure garbage lol",
                                                    "author": "Clayman_",
                                                    "id": "fm94ewm",
                                                    "parent_id": "t1_fm93knx",
                                                    "score": -10,
                                                    "created_utc": 1585861511.0,
                                                    "replies": [
                                                        {
                                                            "body": "kakashi vs obito??????",
                                                            "author": "OnePumpBoy",
                                                            "id": "fm96vwb",
                                                            "parent_id": "t1_fm94ewm",
                                                            "score": 8,
                                                            "created_utc": 1585862849.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "The crazy part is that I have the ability to defend my own opinions while all you can do is spew out lame insults. You probably get all your opinions from YouTube videos or hive leader you follow on social media.",
                                                            "author": "silkboye",
                                                            "id": "fm96hn0",
                                                            "parent_id": "t1_fm94ewm",
                                                            "score": 7,
                                                            "created_utc": 1585862634.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Only a person without brain can defend shippuden 🤣🤣",
                                                                    "author": "Clayman_",
                                                                    "id": "fm9bvla",
                                                                    "parent_id": "t1_fm96hn0",
                                                                    "score": -5,
                                                                    "created_utc": 1585865601.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Imagine being this ignorant, believing your own unpopular opinion is the end all be all fact and that anyone who thinks otherwise is the delusional one. If you skip all of the filler and only watch the canon episodes everything makes much more sense. Not only that, Kishimoto had a clear path the entire series. Just because it wasn't clear to you, doesn't mean it isn't there. You say Boruto is trash, but that only because 90% of the anime so far is filler, in which the filler is horrendous at best. If you take out the filler Boruto is a quality anime. It's not great, but it is still exceptional. Naruto and Naruto Shippuden are on equal terms from my somewhat unbiased opinion. The main difference is you own personal preference and opinion. In fact, if it weren't for the constant nostalgic feeling I get from Naruto, then I'd likely say that Naruto Shippuden is far better than Naruto. Realistically, Shippuden has everything Naruto has, but more. More action, more characters, same/more emotion, more power, more plot twists, just more. In the end you have your opinion and everyone else has their own. So maybe try not to call someone else delusional while putting your own OPINION above theirs. Delusional and ignorant, that isnt a good combination my friend.",
                                            "author": "Alaryc_Stahl",
                                            "id": "fm94u18",
                                            "parent_id": "t1_fm92kdp",
                                            "score": 8,
                                            "created_utc": 1585861741.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "What a load of shit. Naruto Shippuden is awesome. I'd even argue that up until the end of the Pain arc it's better than the original series.",
                                            "author": "Poobumwillyboobs",
                                            "id": "fm9beei",
                                            "parent_id": "t1_fm92kdp",
                                            "score": 4,
                                            "created_utc": 1585865330.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You are right. I think he even stated that he had already thought up the ending of Naruto and Sasuke lying side by side arm less, bleading out on statues of their ancestors while he was doing Chunnin Arc.",
                            "author": "Moonlights_Embrace",
                            "id": "fm8i41w",
                            "parent_id": "t1_fm8gv3x",
                            "score": 9,
                            "created_utc": 1585849799.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Pacing",
                    "author": null,
                    "id": "fm9jbs7",
                    "parent_id": "t1_fm8b51v",
                    "score": 4,
                    "created_utc": 1585869908.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "*heavy danzo breathing*",
            "author": null,
            "id": "fm8uo2r",
            "parent_id": "t3_fto2zo",
            "score": 11,
            "created_utc": 1585856352.0,
            "replies": [
                {
                    "body": "*Orochimaru climaxes*",
                    "author": "IAmYoDaddyDuh",
                    "id": "fm9p6e1",
                    "parent_id": "t1_fm8uo2r",
                    "score": 3,
                    "created_utc": 1585873449.0,
                    "replies": []
                },
                {
                    "body": "*Cultural appropriation intensifies*",
                    "author": "Phenoxx",
                    "id": "fma1axs",
                    "parent_id": "t1_fm8uo2r",
                    "score": 2,
                    "created_utc": 1585881379.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If I were president all schools starting at 9th grade will show naruto in a dedicated class to completion until they graduate",
            "author": "RelativePerspectiv",
            "id": "fm8dvlo",
            "parent_id": "t3_fto2zo",
            "score": 23,
            "created_utc": 1585847624.0,
            "replies": [
                {
                    "body": "What do you think the president does?",
                    "author": "persceptivepanda26",
                    "id": "fm8r25m",
                    "parent_id": "t1_fm8dvlo",
                    "score": 9,
                    "created_utc": 1585854429.0,
                    "replies": [
                        {
                            "body": "Teaches, inspires, and instills morals at a young age. Or at least they should",
                            "author": "RelativePerspectiv",
                            "id": "fm9bg2r",
                            "parent_id": "t1_fm8r25m",
                            "score": 3,
                            "created_utc": 1585865356.0,
                            "replies": []
                        },
                        {
                            "body": "Believe me\n\nOh",
                            "author": "TrueSaiyanGod",
                            "id": "fm8toyv",
                            "parent_id": "t1_fm8r25m",
                            "score": 2,
                            "created_utc": 1585855833.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This but with a good anime.",
                    "author": "Beardamus",
                    "id": "fm9cjns",
                    "parent_id": "t1_fm8dvlo",
                    "score": 0,
                    "created_utc": 1585865979.0,
                    "replies": [
                        {
                            "body": "What would you suggest? More importantly why are you on this page then?",
                            "author": "I-like-your-pants",
                            "id": "fm9g35f",
                            "parent_id": "t1_fm9cjns",
                            "score": 1,
                            "created_utc": 1585868017.0,
                            "replies": [
                                {
                                    "body": "Came from r/all. Anyway doing that is totally stupid but if it had to be done it'd be with something people can learn from like Legend of the Galactic Heroes.",
                                    "author": "Beardamus",
                                    "id": "fm9k6cr",
                                    "parent_id": "t1_fm9g35f",
                                    "score": 2,
                                    "created_utc": 1585870404.0,
                                    "replies": [
                                        {
                                            "body": ">Anyway doing that is totally stupid\n\nOP was almost certainly joking",
                                            "author": "The96thPoet",
                                            "id": "fmamxzc",
                                            "parent_id": "t1_fm9k6cr",
                                            "score": 1,
                                            "created_utc": 1585899857.0,
                                            "replies": [
                                                {
                                                    "body": "> What would you suggest? \n\nWhich is why I was more replying to that than op.",
                                                    "author": "Beardamus",
                                                    "id": "fmaxp95",
                                                    "parent_id": "t1_fmamxzc",
                                                    "score": 1,
                                                    "created_utc": 1585911903.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "“Why do your eyeballs have screws on them?”",
            "author": "dxtboxer",
            "id": "fm9j539",
            "parent_id": "t3_fto2zo",
            "score": 5,
            "created_utc": 1585869800.0,
            "replies": []
        },
        {
            "body": "I never understood how this worked. So they got the eyeball then what? Just slapped in on top of the other?",
            "author": null,
            "id": "fmaes84",
            "parent_id": "t3_fto2zo",
            "score": 1,
            "created_utc": 1585891798.0,
            "replies": [
                {
                    "body": "You change them like you change a lightbulb, take off the broken one, replace with a functioning one.",
                    "author": "WrongCilantro",
                    "id": "fmbpmu6",
                    "parent_id": "t1_fmaes84",
                    "score": 1,
                    "created_utc": 1585930901.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "An insightful comment",
            "author": "Hexxas",
            "id": "fmanyvo",
            "parent_id": "t3_fto2zo",
            "score": 1,
            "created_utc": 1585900980.0,
            "replies": []
        },
        {
            "body": "3,000 upvotes. OH YEAH ME I DID THAT",
            "author": "nuggetboi987",
            "id": "fmk2j8j",
            "parent_id": "t3_fto2zo",
            "score": 1,
            "created_utc": 1586142998.0,
            "replies": []
        },
        {
            "body": "Comment of the century",
            "author": "Tonantzin_314",
            "id": "fmav3s2",
            "parent_id": "t1_fm8auu7",
            "score": 7,
            "created_utc": 1585909010.0,
            "replies": [
                {
                    "body": ":) <3",
                    "author": "quirkyemoweeb69420",
                    "id": "fmbm2av",
                    "parent_id": "t1_fmav3s2",
                    "score": 5,
                    "created_utc": 1585929016.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Taste the Blood",
            "author": "IAmYoDaddyDuh",
            "id": "fm9pazy",
            "parent_id": "t1_fm8q5xg",
            "score": 26,
            "created_utc": 1585873529.0,
            "replies": [
                {
                    "body": "Is that a devil may cry reference?",
                    "author": "cj-the-man",
                    "id": "fma80km",
                    "parent_id": "t1_fm9pazy",
                    "score": 5,
                    "created_utc": 1585886213.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And placing them like changing light bulbs",
            "author": "Hyperion1000",
            "id": "fmagnrl",
            "parent_id": "t1_fm8q5xg",
            "score": 10,
            "created_utc": 1585893513.0,
            "replies": []
        },
        {
            "body": "I pretty much never recommend anyone but my brother shows, because all my friends only watch the same type of anime stuff and I've only seen like 6 anime. The only show that one of my friends finally watched after my recommendation was the Outsider. And that was partly for a podcast.",
            "author": "Elite_Doc",
            "id": "fm9bqq8",
            "parent_id": "t1_fm8y6kr",
            "score": 9,
            "created_utc": 1585865524.0,
            "replies": []
        },
        {
            "body": "I ask myself that question everyday",
            "author": "quirkyemoweeb69420",
            "id": "fm8bix5",
            "parent_id": "t1_fm8b51v",
            "score": 34,
            "created_utc": 1585846366.0,
            "replies": []
        },
        {
            "body": "Naruto is a good anime but far from a great anime, it's understandable how someone could dislike it.\nThere's a lot of filler in it and that's just a waste of time, some of the characters are poorly written and get no conclusion, the story seems to change based on how the writers want it, Kishimoto just kept writing himself into corners like he did with Madara Uciha and his power escalation.\n\nThere's a lot of problems with the serie and especially part 2 and the Spin-Off Boruto.\n\nEven with Naruto being one of my top favourites it has a lot of problems, like a *LOT* of problems after the first serie Kishimoto really didn't have a direction, he knew where he wanted to go but didn't know how to get there. Writers often do this, they know where they want to go and instead of writing a road on how to get there they go backwards from where they wanted to end up.\n\nThe ending Kishimoto wanted was (Probably) Naruto Vs Sasuke, all else that happens in the series is just him creating the context for that ending to take place.",
            "author": "Dan-TAW123",
            "id": "fm8gv3x",
            "parent_id": "t1_fm8b51v",
            "score": 63,
            "created_utc": 1585849149.0,
            "replies": [
                {
                    "body": "All throughout part 2 the Akatsuki were the main villains who were hunting tailed beast for the sake of a large scale war and the plot didn’t change from that until the kaguya plot twist. Intentions were revealed and sometimes changed, but the series was always building up to the great ninja war. \n\nAnd the power escalation made perfect since given the context. Madara absorbed the power of nine beast with practically limitless destructive power. If the power scaling didn’t go up than the Akatsuki’s goal wouldn’t have made sense. And all the characters got the conclusion they deserved, it’s not like every single side character needs an arc.\n\nThe series only gets bad at the kaguya revival part. Some side characters were pretty dull but it’s bit dramatic to call them poorly written. And you can skip filler, the anime ended 3 years ago there’s even a Naruto Kai now.",
                    "author": "silkboye",
                    "id": "fm8pubc",
                    "parent_id": "t1_fm8gv3x",
                    "score": 45,
                    "created_utc": 1585853791.0,
                    "replies": [
                        {
                            "body": "The power scale got bad around Naruto and Bee vs. Revived Tailed Beasts. Rock Lee, Hinata, and a couple others either didn't have arcs that they deserved or had their arc rushed. But yeah overall the writing wasn't bad until Black Zetsu played Madara who played Obito.",
                            "author": "fang434",
                            "id": "fm9dr36",
                            "parent_id": "t1_fm8pubc",
                            "score": 13,
                            "created_utc": 1585866665.0,
                            "replies": [
                                {
                                    "body": "I don’t get what was bad about it, the series establishes very early on that tailed beast are extremely powerful. Rock Lee’s purpose was to show that he could become an elite shinobi with just Taijutsu and he already proved himself to be elite by the end of part 1 if not in his fight against gaara. Hinata’s purpose was to build courage to fight for herself and she displays her courage in the pain arc and when she fought along side naruto in the ninja war arc. All the side characters who were fighting internal battles had some time of resolution. There are no loose ends and all the side characters served their purpose. Even Shino got a conclusion and he was a gag character in part 2.",
                                    "author": "silkboye",
                                    "id": "fm9hb7m",
                                    "parent_id": "t1_fm9dr36",
                                    "score": 7,
                                    "created_utc": 1585868733.0,
                                    "replies": [
                                        {
                                            "body": "Shino being a gag character is not a good thing after how he was portrayed in part one, being creepily powerful. He hardly got a conclusion. Hinata didn't really fight alongside Naruto, she was fodder. Rock Lee was supposed to show hard work can let you achieve anything you want, yet he was still fodder and couldn't beat Sasuke or Naruto because they had crazy ninjutsu. Naruto should not be able to hold his own against 6 different tailed beasts simultaneously, and Kakashi should be destroyed by a single one but they all got power crept to be more powerful.",
                                            "author": "fang434",
                                            "id": "fm9kt2c",
                                            "parent_id": "t1_fm9hb7m",
                                            "score": 6,
                                            "created_utc": 1585870776.0,
                                            "replies": [
                                                {
                                                    "body": "Gag characters are never good tbh but his conclusion was that he found a passion in teaching. Rock lee wanted to prove he be an elite shinobi without chakra and he did that. Hinata was just meant to prove her courage and she did that. Just because they didn’t become the strongest in the series doesn’t mean they didn’t accomplish their goals. You’re expectations aren’t too high for side characters. I can’t think of many shonen series where side characters are as strong as main characters by the end. \n\nAnd in the anime it wasn’t really that much of a fight. Neither side really had a chance to go all out.",
                                                    "author": "silkboye",
                                                    "id": "fm9psbu",
                                                    "parent_id": "t1_fm9kt2c",
                                                    "score": 5,
                                                    "created_utc": 1585873837.0,
                                                    "replies": [
                                                        {
                                                            "body": "Right. No matter how good lee gets he’s a side character. How can you be mad that a side character couldn’t beat superman the main character?\n\nNobody got mad that goku can beat all the teammates in dbz. I think he’s just a hater",
                                                            "author": "Phenoxx",
                                                            "id": "fma1496",
                                                            "parent_id": "t1_fm9psbu",
                                                            "score": 0,
                                                            "created_utc": 1585881254.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "i saw naruto kai only and it waz dope",
                            "author": "Dhruv_Colossus",
                            "id": "fnv5pxf",
                            "parent_id": "t1_fm8pubc",
                            "score": 2,
                            "created_utc": 1587281151.0,
                            "replies": []
                        },
                        {
                            "body": "They abandoned a lot of the side Characters to focus on Naruto and Sasuke, also the reincarnation part was really dumb. In a world where Naruto and Sasuke were fated to fight on another their actions had no weight. Ninja Jesus and His children were horrible characters. Kaguya and Zetsu were probably the worst thing to ever come out of Naruto.\nMadara was defeated in a stupid way, they went on and on about the power of Friendship and Cooperation and then Naruto and Sasuke were the only one who's actions mattered. Both shows have their strength but Shippuden has none of the technical aspects of Ninja combats that the first serie had, Shippuden is just people throwing energy stuff at each others and seeing who can withstand it better. There were some great moments, good moments, bad moments and mostly fillers to tie it all together.\n\nEven ignoring the fillers the show, both of them (and the manga it's based upon) have many problems, Kishimoto isn't good at world building, he's good at Character writing and in Shippuden he shifted into world building, which he isn't capable of doing.\n\nIt was such a missed opportunity to make something great, if only he was a better writer.\n\nHonestly who could tell me that Naruto has some good lore and worldbuilding, compared to the character focused moments.\n\nLike all of the scene with Shikamaru after >!Asuma death's;< or Naruto and >!Jiraya's!<. The show is at its best there and not showing you this pointless world of Space Chakra and dimension bullshit.\n\nThe Kyuubi and the other tailed beasts were being changed and they did whatever the fuck they wanted with them, like they did all Characters, they have a Character with an established personality and they change it to fit whatever story they want to tell. \n\nThey have some characters who really have nothing to do, like Sakura, Ino, Tenten and Hinata, until the end they have nothing to do. (I'm sure people will want to defend their Waifus).\n\nCharacters like Neji, Lee, Shino and Kiba are abandoned, Shikamaru and Choji's development gets changed whenever they feel like it.\n\nThe Akatsuki get some development but they're also retconned every once in a while, not always good or bad.\n\nSome characters are better in Shippuden, like Itachi, he did get a lot of development in the second serie.\n\nSome Characters are completely abandoned like Orochimaru and Kabuto. They're shadows of their former selves and it's a shame because Orochimaru was one of my favs in Naruto.\n\nI could go on but I don't want to rant for too long.\n\nPeace out and bye.",
                            "author": "Dan-TAW123",
                            "id": "fm9js0n",
                            "parent_id": "t1_fm8pubc",
                            "score": 0,
                            "created_utc": 1585870172.0,
                            "replies": [
                                {
                                    "body": "You use the word “abandon” really excessively. Like we’re you expecting each and every side character to have an arc to themselves? The series is literally called naruto of course everything will revolve around him. It’s ridiculous to think that every side character is going to have some big shining moment when new side characters are introduced every arc. The purpose of a side character is to work for the plot not for the plot to work for them. And many side characters have presence throughout the whole series like Kabuto and Orochimaru, how were they abandoned? What more did you want from them? Shikamaru has MVP moments in 4 different arcs and has an entire arc to himself. \n\nThe Kaguya plot twist was properly foreshadowed before the war arc and  well explained within the series even if Madara was the better villain it doesn’t mean the plot twist made no sense. And everyone’s actions mattered, Naruto wouldn’t have gotten as far as he did without the people around him. It’s ridiculous to try to downplay everyone’s role in the series because things would’ve played out differently if it weren’t for characters like itachi and Jiraiya etc.\n\nAnd you need to provide evidence before you say stuff like “The Kyuubi and the other tailed beasts were being changed and they did whatever the fuck they wanted with them, like they did all Characters, they have a Character with an established personality and they change it to fit whatever story they want to tell.” You keep saying characters development were retconned but you provide no proof.\n\nAll the side characters concluded what ever internal struggle they had going on (example: Neji and Rock lee). It just seems like you expected them to get as much screen time as main characters which doesn’t happen in any series unless it’s slice of life.\n\nThe fights still had strategy even up to the war arc. Example: Sasuke v Deidara, Obito v Kakashi, itachi v Sasuke and Hidan v Shikamaru.\n\nAnd pretty much everything else in that rant is just a bunch of complaints with no reason or evidence attached to it. Like at least explain how Choji’s development is changed.",
                                    "author": "silkboye",
                                    "id": "fm9ocm8",
                                    "parent_id": "t1_fm9js0n",
                                    "score": 2,
                                    "created_utc": 1585872932.0,
                                    "replies": [
                                        {
                                            "body": "In the beginning they said that the beast were just forces of nature with no intelligence (paraphrasing)\n\nAlso I didn't said all fights were non strategic, I knew you'd bring up the deidara fight or the Obito one, I agree with those picks but quoting a dozen \"strategic\" fight scenes out of the hundreds that aren't doesn't mean that the majority of fights is. \n\nNeji ended up being right, the show was supposed to be about a kid who marginalized by society for different reasons, he was the underdog, yet at every fight and in every arc there's need to be an awesome revelation on how he's special and stronger than everyone, he has a god inside him, his parents were great ninjas, he was trained by other great ninjas, he kept using the fox's chakra instead of his own, he was a reincarnation of the son of Ninja Jesus, none of the things he did mattered, of everything happened because of destiny then none of the choices the character makes have an actual impact.\n\nKaguya and Zetsu were not foreshadowed at all, I don't know where the heck did you see that being foreshadowed.\n\nChoji had an entire episode dedicated to him believing in himself during the war arc and then he magically lost weight and during the madara fight he gained it all back, like wtf? And in Boruto he's far and thin whenever he wants, like, again, WTF?\n\nNeji was right in the end, during the chunin exams he said it.\n\nNaruto has declined in quality over the years, it's by far not a bad serie, it's just average.\n\nA lot of anime fall into that bad writing, they start out great and then drop like shit.\n\nI'm talking as a fan, if you can't admit that the serie has its problems then you must be blind. It's better to be out of the circlejerk and admit it, the serie has really gone downhill.",
                                            "author": "Dan-TAW123",
                                            "id": "fm9tmwf",
                                            "parent_id": "t1_fm9ocm8",
                                            "score": 3,
                                            "created_utc": 1585876306.0,
                                            "replies": [
                                                {
                                                    "body": "Neji didn’t talk about destiny in the literal sense. His point was that people can’t change their position in hierarchy/society no matter how fit or unfit they are for that position. Like Hinata was was technically destined to become the leader for the hyuga even though she was clearly unfit for it and she never did become fit for it even though it was her destiny. He believed naruto would stay a hated outcast because that’s how he was born. \n\n  Naruto was not an underdog story. By mid way of the land if waves arc it should’ve been obvious that Naruto was not an underdog because by this point it was stated that his only disadvantage to his peers was his poor chakra control and this was because he had practically infinite chakra and also he was shown to be able to tap into the chakra of the nine tailed beast that almost destroyed a village full of Shinobi, so did he really have it that bad? And throughout part 1 he was shown to be clever enough to find ways around his handicap so it’s not even like he was stupid either. In the final valley fight Sasuke literally acknowledges that Naruto is “special” so definitely by this point it’s clear that this was not meant to be an underdog story. This is the worst misconception for the series I’ve heard and it shows that you don’t know what you’re even talking about.\n\nHundreds of fights?? Really!?\n\nKaguya AKA “the rabbit goddess” was name dropped a couple times throughout the series not just in the war arc. Black zestu was a mystery all throughout the series because is objectives were never stated until the plot twist and he had presence even during part 1 so he didn’t come out of nowhere. But you would only know this if you’d pay attention.\n\nAnd choji’s transformation being inconsistent is as petty as complaining about goku’s hair turning to normal after ss3. It makes no difference either way, why be mad over something so trivial?\n\nEdit: and no one ever tried to understand the tailed beast except Naruto so of course people just thought they were mindless.",
                                                    "author": "silkboye",
                                                    "id": "fm9w9bs",
                                                    "parent_id": "t1_fm9tmwf",
                                                    "score": 2,
                                                    "created_utc": 1585877993.0,
                                                    "replies": [
                                                        {
                                                            "body": "I’d like to know when was Kaguya was mentioned during the series. The whole time it was all about the Rikudo Sennin not Kaguya. The first time she was mentioned was when Madara explained to Hashirama how chakra came to be. I am pretty certain of what I am saying, I watched the anime and I own all manga chapters.",
                                                            "author": "WrongCilantro",
                                                            "id": "fmbp13v",
                                                            "parent_id": "t1_fm9w9bs",
                                                            "score": 4,
                                                            "created_utc": 1585930589.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Sorry I don’t have a source but I just remember “rabbit goddess” being mentioned subtly by Kakashi. Even if she was foreshadowed that one time by Madara it still counts as foreshadowing anyway so it makes no difference.",
                                                                    "author": "silkboye",
                                                                    "id": "fmbxncl",
                                                                    "parent_id": "t1_fmbp13v",
                                                                    "score": 1,
                                                                    "created_utc": 1585935102.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I don’t recall Kakashi talking about the rabbit goddess, I’ll have to check it out and make my research as you could be right, my memory sucks sometimes. And yes it is foreshadowing but you have to admit it still came very very late and was a little last minute storywise.",
                                                                            "author": "WrongCilantro",
                                                                            "id": "fmbyaxz",
                                                                            "parent_id": "t1_fmbxncl",
                                                                            "score": 2,
                                                                            "created_utc": 1585935448.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "She might’ve been referenced when kimimaru’s origin story was explained. And yeah it was done in a shady kinda way but at least it’s not a total asspull. And I’ve seen many series even outside of anime get away with much cheaper writing tactics so it doesn’t bug me. The only series I can think of that always uses foreshadowing properly is one piece.",
                                                                                    "author": "silkboye",
                                                                                    "id": "fmc0g1v",
                                                                                    "parent_id": "t1_fmbyaxz",
                                                                                    "score": 1,
                                                                                    "created_utc": 1585936585.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Dude, you give too much credit to Kishimoto and his assistant and editors. You have to understand that in the process of writing a serie people change things, especially in an on-going serie like the ShonenJump series. You're trying to give this things too much sense, the story was not ready from the beginning, someone above me confirmed this as well, with no sources, that Kishimoto wanted to end the serie with Naruto Vs Sasuke, it was obvious that he had a goal in mind and just went backwards from that plot point, but going this way ruins everything else, the characters are supposed to have a natural development and in Naruto they don't really have that, some of them do, but the characters change to serve the plot and the writers, it's the lazy writer technique. I like Naruto, wether you believe this or not, but the story isn't as good, the characters were the best part of it and by the end Kishimoto and his assistants cast them aside to focus on the plot which they were incapable of writing. You can't seriously tell me it's good or they had thought about it from the beginning, Kaguya came out of nowhere to save Kishimoto after he wrote himself into a corner. Ninja Jesus was so dumb, he could've been a great character but he was just literally was a 2Dimensional boring character. The resurrection parts were so dumb, the only thing that was salvageable were the characters and Kishimoto failed at it, the last good episode was the Naruto Vs Sasuke fight, after that it was fillers all over again and a couple of movies. They milked the franchise dry, both ShonenJump and The Studio Pierrot, like they're doing with Boruto now. It's such a wasted opportunity and time. I loved this serie as a kid, I grew up with it, but it's really not as great as everyone says it is, especially Shippuden. The second part of the serie was particularly bad, especially after the Pain Arc, after that the good moments were few, Itachi had some of the best development in Shippuden (as I've said already) even other characters had, but by the war arc everything was forgotten, one of the worst arcs I've seen, ever.",
                                                            "author": "Dan-TAW123",
                                                            "id": "fm9ybv6",
                                                            "parent_id": "t1_fm9w9bs",
                                                            "score": 2,
                                                            "created_utc": 1585879347.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I couldn’t care less about what happened with Kishimoto and his editors behind the scenes. I’m not trying to make the series make sense, it’s more like you’re trying to make the series look bad by disregarding all the context and exposition the series has. That’s how you get ridiculous arguments like “Neji is right about destiny” , “Obito started a war because his crush died” or my personal favorite “Naruto’s underdog story got ruined”. \n\nKaguya’s revival itself wasn’t bad but pretty much everything that involved her made the series less enjoyable and made the series make less sense. This part took up about less than a third of the war arc and it was terrible but it didn’t ruin the war arc for me and saying that it ruined the whole series is just overdramatic.\n\nHagoromo served his purpose he was a mediocre character but that’s fine considering he had probably 8-15 minutes of screen time. And after the pain arc there were so many good moments like the waterfall of truth and the reunion of Sasuke and itachi.",
                                                                    "author": "silkboye",
                                                                    "id": "fma0lyw",
                                                                    "parent_id": "t1_fm9ybv6",
                                                                    "score": 0,
                                                                    "created_utc": 1585880905.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "thats not what i said, i never talked against obito, he was one of my favourites. also i said it myself that even after the pain arc there were good moments. i think youre misunderstanding me, im criticising the serie but you think im an hater, im not. Naruto is one of my favorites series, but just because it is doesnt make it immune to my criticism, it would be dishonest from me to just ignore all the bad writing, just as it would for you. the story was changed constantly from one thing to another, Kishimoto had no actual direction, he only had plot-points he wanted to reach, its pretty clear hes not the great writer you seem to think he is, even his new serie is being canceled after only a few months of coming out. hes not capable of writing stories, his strength is in the character writing, which he abandoned around the war arc, some characters did get a good treatment, like Itachi (as ive said 4 times already, not only him but also a few others).",
                                                                            "author": "Dan-TAW123",
                                                                            "id": "fma210a",
                                                                            "parent_id": "t1_fma0lyw",
                                                                            "score": 3,
                                                                            "created_utc": 1585881879.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I wasn’t trying to imply that you think Obito started the war for that reason, I’m just saying the series gets a lot of hate because of misconceptions due to people pulling characters and events completely out of context to bash it. \n\nWhether you think Naruto is amazing or garbage doesn’t matter to me. My point is that Naruto’s overall quality was consistent from land of waves up to the beginning of the ninja war. I understand why that arc is controversial. If you hate that arc I would understand. I was lucky enough to experience the war arc through the video game adaptation so I enjoyed it for the most part. \n\nEver since the beginning of part 2 the plot was clearly headed to some type of massive war because the Akatsuki were collecting 9 beast with practically limitless destructive power. And lack of screen time does not mean abandoned. Side characters are meant to serve the plot not the other way around. Side characters were used whenever they were necessary. People had extremely high hopes for Naruto side characters in particular which I don’t understand.",
                                                                                    "author": "silkboye",
                                                                                    "id": "fma3lio",
                                                                                    "parent_id": "t1_fma210a",
                                                                                    "score": 1,
                                                                                    "created_utc": 1585882967.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Imagine being this delusional. Naruto part 1 is the only good one, shippuden and boruto are terrible",
                            "author": "Clayman_",
                            "id": "fm92kdp",
                            "parent_id": "t1_fm8pubc",
                            "score": -19,
                            "created_utc": 1585860515.0,
                            "replies": [
                                {
                                    "body": "Nice rebuttal! Totally proved me wrong.",
                                    "author": "silkboye",
                                    "id": "fm93knx",
                                    "parent_id": "t1_fm92kdp",
                                    "score": 11,
                                    "created_utc": 1585861058.0,
                                    "replies": [
                                        {
                                            "body": "You just have no taste. There is no comparison between OG Naruto and shippuden. Shippuden has no real story and all the fights look like either DBZ or kaiju fights. And boruto is just pure garbage lol",
                                            "author": "Clayman_",
                                            "id": "fm94ewm",
                                            "parent_id": "t1_fm93knx",
                                            "score": -10,
                                            "created_utc": 1585861511.0,
                                            "replies": [
                                                {
                                                    "body": "kakashi vs obito??????",
                                                    "author": "OnePumpBoy",
                                                    "id": "fm96vwb",
                                                    "parent_id": "t1_fm94ewm",
                                                    "score": 8,
                                                    "created_utc": 1585862849.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "The crazy part is that I have the ability to defend my own opinions while all you can do is spew out lame insults. You probably get all your opinions from YouTube videos or hive leader you follow on social media.",
                                                    "author": "silkboye",
                                                    "id": "fm96hn0",
                                                    "parent_id": "t1_fm94ewm",
                                                    "score": 7,
                                                    "created_utc": 1585862634.0,
                                                    "replies": [
                                                        {
                                                            "body": "Only a person without brain can defend shippuden 🤣🤣",
                                                            "author": "Clayman_",
                                                            "id": "fm9bvla",
                                                            "parent_id": "t1_fm96hn0",
                                                            "score": -5,
                                                            "created_utc": 1585865601.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Imagine being this ignorant, believing your own unpopular opinion is the end all be all fact and that anyone who thinks otherwise is the delusional one. If you skip all of the filler and only watch the canon episodes everything makes much more sense. Not only that, Kishimoto had a clear path the entire series. Just because it wasn't clear to you, doesn't mean it isn't there. You say Boruto is trash, but that only because 90% of the anime so far is filler, in which the filler is horrendous at best. If you take out the filler Boruto is a quality anime. It's not great, but it is still exceptional. Naruto and Naruto Shippuden are on equal terms from my somewhat unbiased opinion. The main difference is you own personal preference and opinion. In fact, if it weren't for the constant nostalgic feeling I get from Naruto, then I'd likely say that Naruto Shippuden is far better than Naruto. Realistically, Shippuden has everything Naruto has, but more. More action, more characters, same/more emotion, more power, more plot twists, just more. In the end you have your opinion and everyone else has their own. So maybe try not to call someone else delusional while putting your own OPINION above theirs. Delusional and ignorant, that isnt a good combination my friend.",
                                    "author": "Alaryc_Stahl",
                                    "id": "fm94u18",
                                    "parent_id": "t1_fm92kdp",
                                    "score": 8,
                                    "created_utc": 1585861741.0,
                                    "replies": []
                                },
                                {
                                    "body": "What a load of shit. Naruto Shippuden is awesome. I'd even argue that up until the end of the Pain arc it's better than the original series.",
                                    "author": "Poobumwillyboobs",
                                    "id": "fm9beei",
                                    "parent_id": "t1_fm92kdp",
                                    "score": 4,
                                    "created_utc": 1585865330.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You are right. I think he even stated that he had already thought up the ending of Naruto and Sasuke lying side by side arm less, bleading out on statues of their ancestors while he was doing Chunnin Arc.",
                    "author": "Moonlights_Embrace",
                    "id": "fm8i41w",
                    "parent_id": "t1_fm8gv3x",
                    "score": 9,
                    "created_utc": 1585849799.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Pacing",
            "author": null,
            "id": "fm9jbs7",
            "parent_id": "t1_fm8b51v",
            "score": 4,
            "created_utc": 1585869908.0,
            "replies": []
        },
        {
            "body": "*Orochimaru climaxes*",
            "author": "IAmYoDaddyDuh",
            "id": "fm9p6e1",
            "parent_id": "t1_fm8uo2r",
            "score": 3,
            "created_utc": 1585873449.0,
            "replies": []
        },
        {
            "body": "*Cultural appropriation intensifies*",
            "author": "Phenoxx",
            "id": "fma1axs",
            "parent_id": "t1_fm8uo2r",
            "score": 2,
            "created_utc": 1585881379.0,
            "replies": []
        },
        {
            "body": "What do you think the president does?",
            "author": "persceptivepanda26",
            "id": "fm8r25m",
            "parent_id": "t1_fm8dvlo",
            "score": 9,
            "created_utc": 1585854429.0,
            "replies": [
                {
                    "body": "Teaches, inspires, and instills morals at a young age. Or at least they should",
                    "author": "RelativePerspectiv",
                    "id": "fm9bg2r",
                    "parent_id": "t1_fm8r25m",
                    "score": 3,
                    "created_utc": 1585865356.0,
                    "replies": []
                },
                {
                    "body": "Believe me\n\nOh",
                    "author": "TrueSaiyanGod",
                    "id": "fm8toyv",
                    "parent_id": "t1_fm8r25m",
                    "score": 2,
                    "created_utc": 1585855833.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This but with a good anime.",
            "author": "Beardamus",
            "id": "fm9cjns",
            "parent_id": "t1_fm8dvlo",
            "score": 0,
            "created_utc": 1585865979.0,
            "replies": [
                {
                    "body": "What would you suggest? More importantly why are you on this page then?",
                    "author": "I-like-your-pants",
                    "id": "fm9g35f",
                    "parent_id": "t1_fm9cjns",
                    "score": 1,
                    "created_utc": 1585868017.0,
                    "replies": [
                        {
                            "body": "Came from r/all. Anyway doing that is totally stupid but if it had to be done it'd be with something people can learn from like Legend of the Galactic Heroes.",
                            "author": "Beardamus",
                            "id": "fm9k6cr",
                            "parent_id": "t1_fm9g35f",
                            "score": 2,
                            "created_utc": 1585870404.0,
                            "replies": [
                                {
                                    "body": ">Anyway doing that is totally stupid\n\nOP was almost certainly joking",
                                    "author": "The96thPoet",
                                    "id": "fmamxzc",
                                    "parent_id": "t1_fm9k6cr",
                                    "score": 1,
                                    "created_utc": 1585899857.0,
                                    "replies": [
                                        {
                                            "body": "> What would you suggest? \n\nWhich is why I was more replying to that than op.",
                                            "author": "Beardamus",
                                            "id": "fmaxp95",
                                            "parent_id": "t1_fmamxzc",
                                            "score": 1,
                                            "created_utc": 1585911903.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You change them like you change a lightbulb, take off the broken one, replace with a functioning one.",
            "author": "WrongCilantro",
            "id": "fmbpmu6",
            "parent_id": "t1_fmaes84",
            "score": 1,
            "created_utc": 1585930901.0,
            "replies": []
        },
        {
            "body": ":) <3",
            "author": "quirkyemoweeb69420",
            "id": "fmbm2av",
            "parent_id": "t1_fmav3s2",
            "score": 5,
            "created_utc": 1585929016.0,
            "replies": []
        },
        {
            "body": "Is that a devil may cry reference?",
            "author": "cj-the-man",
            "id": "fma80km",
            "parent_id": "t1_fm9pazy",
            "score": 5,
            "created_utc": 1585886213.0,
            "replies": []
        },
        {
            "body": "All throughout part 2 the Akatsuki were the main villains who were hunting tailed beast for the sake of a large scale war and the plot didn’t change from that until the kaguya plot twist. Intentions were revealed and sometimes changed, but the series was always building up to the great ninja war. \n\nAnd the power escalation made perfect since given the context. Madara absorbed the power of nine beast with practically limitless destructive power. If the power scaling didn’t go up than the Akatsuki’s goal wouldn’t have made sense. And all the characters got the conclusion they deserved, it’s not like every single side character needs an arc.\n\nThe series only gets bad at the kaguya revival part. Some side characters were pretty dull but it’s bit dramatic to call them poorly written. And you can skip filler, the anime ended 3 years ago there’s even a Naruto Kai now.",
            "author": "silkboye",
            "id": "fm8pubc",
            "parent_id": "t1_fm8gv3x",
            "score": 45,
            "created_utc": 1585853791.0,
            "replies": [
                {
                    "body": "The power scale got bad around Naruto and Bee vs. Revived Tailed Beasts. Rock Lee, Hinata, and a couple others either didn't have arcs that they deserved or had their arc rushed. But yeah overall the writing wasn't bad until Black Zetsu played Madara who played Obito.",
                    "author": "fang434",
                    "id": "fm9dr36",
                    "parent_id": "t1_fm8pubc",
                    "score": 13,
                    "created_utc": 1585866665.0,
                    "replies": [
                        {
                            "body": "I don’t get what was bad about it, the series establishes very early on that tailed beast are extremely powerful. Rock Lee’s purpose was to show that he could become an elite shinobi with just Taijutsu and he already proved himself to be elite by the end of part 1 if not in his fight against gaara. Hinata’s purpose was to build courage to fight for herself and she displays her courage in the pain arc and when she fought along side naruto in the ninja war arc. All the side characters who were fighting internal battles had some time of resolution. There are no loose ends and all the side characters served their purpose. Even Shino got a conclusion and he was a gag character in part 2.",
                            "author": "silkboye",
                            "id": "fm9hb7m",
                            "parent_id": "t1_fm9dr36",
                            "score": 7,
                            "created_utc": 1585868733.0,
                            "replies": [
                                {
                                    "body": "Shino being a gag character is not a good thing after how he was portrayed in part one, being creepily powerful. He hardly got a conclusion. Hinata didn't really fight alongside Naruto, she was fodder. Rock Lee was supposed to show hard work can let you achieve anything you want, yet he was still fodder and couldn't beat Sasuke or Naruto because they had crazy ninjutsu. Naruto should not be able to hold his own against 6 different tailed beasts simultaneously, and Kakashi should be destroyed by a single one but they all got power crept to be more powerful.",
                                    "author": "fang434",
                                    "id": "fm9kt2c",
                                    "parent_id": "t1_fm9hb7m",
                                    "score": 6,
                                    "created_utc": 1585870776.0,
                                    "replies": [
                                        {
                                            "body": "Gag characters are never good tbh but his conclusion was that he found a passion in teaching. Rock lee wanted to prove he be an elite shinobi without chakra and he did that. Hinata was just meant to prove her courage and she did that. Just because they didn’t become the strongest in the series doesn’t mean they didn’t accomplish their goals. You’re expectations aren’t too high for side characters. I can’t think of many shonen series where side characters are as strong as main characters by the end. \n\nAnd in the anime it wasn’t really that much of a fight. Neither side really had a chance to go all out.",
                                            "author": "silkboye",
                                            "id": "fm9psbu",
                                            "parent_id": "t1_fm9kt2c",
                                            "score": 5,
                                            "created_utc": 1585873837.0,
                                            "replies": [
                                                {
                                                    "body": "Right. No matter how good lee gets he’s a side character. How can you be mad that a side character couldn’t beat superman the main character?\n\nNobody got mad that goku can beat all the teammates in dbz. I think he’s just a hater",
                                                    "author": "Phenoxx",
                                                    "id": "fma1496",
                                                    "parent_id": "t1_fm9psbu",
                                                    "score": 0,
                                                    "created_utc": 1585881254.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "i saw naruto kai only and it waz dope",
                    "author": "Dhruv_Colossus",
                    "id": "fnv5pxf",
                    "parent_id": "t1_fm8pubc",
                    "score": 2,
                    "created_utc": 1587281151.0,
                    "replies": []
                },
                {
                    "body": "They abandoned a lot of the side Characters to focus on Naruto and Sasuke, also the reincarnation part was really dumb. In a world where Naruto and Sasuke were fated to fight on another their actions had no weight. Ninja Jesus and His children were horrible characters. Kaguya and Zetsu were probably the worst thing to ever come out of Naruto.\nMadara was defeated in a stupid way, they went on and on about the power of Friendship and Cooperation and then Naruto and Sasuke were the only one who's actions mattered. Both shows have their strength but Shippuden has none of the technical aspects of Ninja combats that the first serie had, Shippuden is just people throwing energy stuff at each others and seeing who can withstand it better. There were some great moments, good moments, bad moments and mostly fillers to tie it all together.\n\nEven ignoring the fillers the show, both of them (and the manga it's based upon) have many problems, Kishimoto isn't good at world building, he's good at Character writing and in Shippuden he shifted into world building, which he isn't capable of doing.\n\nIt was such a missed opportunity to make something great, if only he was a better writer.\n\nHonestly who could tell me that Naruto has some good lore and worldbuilding, compared to the character focused moments.\n\nLike all of the scene with Shikamaru after >!Asuma death's;< or Naruto and >!Jiraya's!<. The show is at its best there and not showing you this pointless world of Space Chakra and dimension bullshit.\n\nThe Kyuubi and the other tailed beasts were being changed and they did whatever the fuck they wanted with them, like they did all Characters, they have a Character with an established personality and they change it to fit whatever story they want to tell. \n\nThey have some characters who really have nothing to do, like Sakura, Ino, Tenten and Hinata, until the end they have nothing to do. (I'm sure people will want to defend their Waifus).\n\nCharacters like Neji, Lee, Shino and Kiba are abandoned, Shikamaru and Choji's development gets changed whenever they feel like it.\n\nThe Akatsuki get some development but they're also retconned every once in a while, not always good or bad.\n\nSome characters are better in Shippuden, like Itachi, he did get a lot of development in the second serie.\n\nSome Characters are completely abandoned like Orochimaru and Kabuto. They're shadows of their former selves and it's a shame because Orochimaru was one of my favs in Naruto.\n\nI could go on but I don't want to rant for too long.\n\nPeace out and bye.",
                    "author": "Dan-TAW123",
                    "id": "fm9js0n",
                    "parent_id": "t1_fm8pubc",
                    "score": 0,
                    "created_utc": 1585870172.0,
                    "replies": [
                        {
                            "body": "You use the word “abandon” really excessively. Like we’re you expecting each and every side character to have an arc to themselves? The series is literally called naruto of course everything will revolve around him. It’s ridiculous to think that every side character is going to have some big shining moment when new side characters are introduced every arc. The purpose of a side character is to work for the plot not for the plot to work for them. And many side characters have presence throughout the whole series like Kabuto and Orochimaru, how were they abandoned? What more did you want from them? Shikamaru has MVP moments in 4 different arcs and has an entire arc to himself. \n\nThe Kaguya plot twist was properly foreshadowed before the war arc and  well explained within the series even if Madara was the better villain it doesn’t mean the plot twist made no sense. And everyone’s actions mattered, Naruto wouldn’t have gotten as far as he did without the people around him. It’s ridiculous to try to downplay everyone’s role in the series because things would’ve played out differently if it weren’t for characters like itachi and Jiraiya etc.\n\nAnd you need to provide evidence before you say stuff like “The Kyuubi and the other tailed beasts were being changed and they did whatever the fuck they wanted with them, like they did all Characters, they have a Character with an established personality and they change it to fit whatever story they want to tell.” You keep saying characters development were retconned but you provide no proof.\n\nAll the side characters concluded what ever internal struggle they had going on (example: Neji and Rock lee). It just seems like you expected them to get as much screen time as main characters which doesn’t happen in any series unless it’s slice of life.\n\nThe fights still had strategy even up to the war arc. Example: Sasuke v Deidara, Obito v Kakashi, itachi v Sasuke and Hidan v Shikamaru.\n\nAnd pretty much everything else in that rant is just a bunch of complaints with no reason or evidence attached to it. Like at least explain how Choji’s development is changed.",
                            "author": "silkboye",
                            "id": "fm9ocm8",
                            "parent_id": "t1_fm9js0n",
                            "score": 2,
                            "created_utc": 1585872932.0,
                            "replies": [
                                {
                                    "body": "In the beginning they said that the beast were just forces of nature with no intelligence (paraphrasing)\n\nAlso I didn't said all fights were non strategic, I knew you'd bring up the deidara fight or the Obito one, I agree with those picks but quoting a dozen \"strategic\" fight scenes out of the hundreds that aren't doesn't mean that the majority of fights is. \n\nNeji ended up being right, the show was supposed to be about a kid who marginalized by society for different reasons, he was the underdog, yet at every fight and in every arc there's need to be an awesome revelation on how he's special and stronger than everyone, he has a god inside him, his parents were great ninjas, he was trained by other great ninjas, he kept using the fox's chakra instead of his own, he was a reincarnation of the son of Ninja Jesus, none of the things he did mattered, of everything happened because of destiny then none of the choices the character makes have an actual impact.\n\nKaguya and Zetsu were not foreshadowed at all, I don't know where the heck did you see that being foreshadowed.\n\nChoji had an entire episode dedicated to him believing in himself during the war arc and then he magically lost weight and during the madara fight he gained it all back, like wtf? And in Boruto he's far and thin whenever he wants, like, again, WTF?\n\nNeji was right in the end, during the chunin exams he said it.\n\nNaruto has declined in quality over the years, it's by far not a bad serie, it's just average.\n\nA lot of anime fall into that bad writing, they start out great and then drop like shit.\n\nI'm talking as a fan, if you can't admit that the serie has its problems then you must be blind. It's better to be out of the circlejerk and admit it, the serie has really gone downhill.",
                                    "author": "Dan-TAW123",
                                    "id": "fm9tmwf",
                                    "parent_id": "t1_fm9ocm8",
                                    "score": 3,
                                    "created_utc": 1585876306.0,
                                    "replies": [
                                        {
                                            "body": "Neji didn’t talk about destiny in the literal sense. His point was that people can’t change their position in hierarchy/society no matter how fit or unfit they are for that position. Like Hinata was was technically destined to become the leader for the hyuga even though she was clearly unfit for it and she never did become fit for it even though it was her destiny. He believed naruto would stay a hated outcast because that’s how he was born. \n\n  Naruto was not an underdog story. By mid way of the land if waves arc it should’ve been obvious that Naruto was not an underdog because by this point it was stated that his only disadvantage to his peers was his poor chakra control and this was because he had practically infinite chakra and also he was shown to be able to tap into the chakra of the nine tailed beast that almost destroyed a village full of Shinobi, so did he really have it that bad? And throughout part 1 he was shown to be clever enough to find ways around his handicap so it’s not even like he was stupid either. In the final valley fight Sasuke literally acknowledges that Naruto is “special” so definitely by this point it’s clear that this was not meant to be an underdog story. This is the worst misconception for the series I’ve heard and it shows that you don’t know what you’re even talking about.\n\nHundreds of fights?? Really!?\n\nKaguya AKA “the rabbit goddess” was name dropped a couple times throughout the series not just in the war arc. Black zestu was a mystery all throughout the series because is objectives were never stated until the plot twist and he had presence even during part 1 so he didn’t come out of nowhere. But you would only know this if you’d pay attention.\n\nAnd choji’s transformation being inconsistent is as petty as complaining about goku’s hair turning to normal after ss3. It makes no difference either way, why be mad over something so trivial?\n\nEdit: and no one ever tried to understand the tailed beast except Naruto so of course people just thought they were mindless.",
                                            "author": "silkboye",
                                            "id": "fm9w9bs",
                                            "parent_id": "t1_fm9tmwf",
                                            "score": 2,
                                            "created_utc": 1585877993.0,
                                            "replies": [
                                                {
                                                    "body": "I’d like to know when was Kaguya was mentioned during the series. The whole time it was all about the Rikudo Sennin not Kaguya. The first time she was mentioned was when Madara explained to Hashirama how chakra came to be. I am pretty certain of what I am saying, I watched the anime and I own all manga chapters.",
                                                    "author": "WrongCilantro",
                                                    "id": "fmbp13v",
                                                    "parent_id": "t1_fm9w9bs",
                                                    "score": 4,
                                                    "created_utc": 1585930589.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sorry I don’t have a source but I just remember “rabbit goddess” being mentioned subtly by Kakashi. Even if she was foreshadowed that one time by Madara it still counts as foreshadowing anyway so it makes no difference.",
                                                            "author": "silkboye",
                                                            "id": "fmbxncl",
                                                            "parent_id": "t1_fmbp13v",
                                                            "score": 1,
                                                            "created_utc": 1585935102.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I don’t recall Kakashi talking about the rabbit goddess, I’ll have to check it out and make my research as you could be right, my memory sucks sometimes. And yes it is foreshadowing but you have to admit it still came very very late and was a little last minute storywise.",
                                                                    "author": "WrongCilantro",
                                                                    "id": "fmbyaxz",
                                                                    "parent_id": "t1_fmbxncl",
                                                                    "score": 2,
                                                                    "created_utc": 1585935448.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "She might’ve been referenced when kimimaru’s origin story was explained. And yeah it was done in a shady kinda way but at least it’s not a total asspull. And I’ve seen many series even outside of anime get away with much cheaper writing tactics so it doesn’t bug me. The only series I can think of that always uses foreshadowing properly is one piece.",
                                                                            "author": "silkboye",
                                                                            "id": "fmc0g1v",
                                                                            "parent_id": "t1_fmbyaxz",
                                                                            "score": 1,
                                                                            "created_utc": 1585936585.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Dude, you give too much credit to Kishimoto and his assistant and editors. You have to understand that in the process of writing a serie people change things, especially in an on-going serie like the ShonenJump series. You're trying to give this things too much sense, the story was not ready from the beginning, someone above me confirmed this as well, with no sources, that Kishimoto wanted to end the serie with Naruto Vs Sasuke, it was obvious that he had a goal in mind and just went backwards from that plot point, but going this way ruins everything else, the characters are supposed to have a natural development and in Naruto they don't really have that, some of them do, but the characters change to serve the plot and the writers, it's the lazy writer technique. I like Naruto, wether you believe this or not, but the story isn't as good, the characters were the best part of it and by the end Kishimoto and his assistants cast them aside to focus on the plot which they were incapable of writing. You can't seriously tell me it's good or they had thought about it from the beginning, Kaguya came out of nowhere to save Kishimoto after he wrote himself into a corner. Ninja Jesus was so dumb, he could've been a great character but he was just literally was a 2Dimensional boring character. The resurrection parts were so dumb, the only thing that was salvageable were the characters and Kishimoto failed at it, the last good episode was the Naruto Vs Sasuke fight, after that it was fillers all over again and a couple of movies. They milked the franchise dry, both ShonenJump and The Studio Pierrot, like they're doing with Boruto now. It's such a wasted opportunity and time. I loved this serie as a kid, I grew up with it, but it's really not as great as everyone says it is, especially Shippuden. The second part of the serie was particularly bad, especially after the Pain Arc, after that the good moments were few, Itachi had some of the best development in Shippuden (as I've said already) even other characters had, but by the war arc everything was forgotten, one of the worst arcs I've seen, ever.",
                                                    "author": "Dan-TAW123",
                                                    "id": "fm9ybv6",
                                                    "parent_id": "t1_fm9w9bs",
                                                    "score": 2,
                                                    "created_utc": 1585879347.0,
                                                    "replies": [
                                                        {
                                                            "body": "I couldn’t care less about what happened with Kishimoto and his editors behind the scenes. I’m not trying to make the series make sense, it’s more like you’re trying to make the series look bad by disregarding all the context and exposition the series has. That’s how you get ridiculous arguments like “Neji is right about destiny” , “Obito started a war because his crush died” or my personal favorite “Naruto’s underdog story got ruined”. \n\nKaguya’s revival itself wasn’t bad but pretty much everything that involved her made the series less enjoyable and made the series make less sense. This part took up about less than a third of the war arc and it was terrible but it didn’t ruin the war arc for me and saying that it ruined the whole series is just overdramatic.\n\nHagoromo served his purpose he was a mediocre character but that’s fine considering he had probably 8-15 minutes of screen time. And after the pain arc there were so many good moments like the waterfall of truth and the reunion of Sasuke and itachi.",
                                                            "author": "silkboye",
                                                            "id": "fma0lyw",
                                                            "parent_id": "t1_fm9ybv6",
                                                            "score": 0,
                                                            "created_utc": 1585880905.0,
                                                            "replies": [
                                                                {
                                                                    "body": "thats not what i said, i never talked against obito, he was one of my favourites. also i said it myself that even after the pain arc there were good moments. i think youre misunderstanding me, im criticising the serie but you think im an hater, im not. Naruto is one of my favorites series, but just because it is doesnt make it immune to my criticism, it would be dishonest from me to just ignore all the bad writing, just as it would for you. the story was changed constantly from one thing to another, Kishimoto had no actual direction, he only had plot-points he wanted to reach, its pretty clear hes not the great writer you seem to think he is, even his new serie is being canceled after only a few months of coming out. hes not capable of writing stories, his strength is in the character writing, which he abandoned around the war arc, some characters did get a good treatment, like Itachi (as ive said 4 times already, not only him but also a few others).",
                                                                    "author": "Dan-TAW123",
                                                                    "id": "fma210a",
                                                                    "parent_id": "t1_fma0lyw",
                                                                    "score": 3,
                                                                    "created_utc": 1585881879.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I wasn’t trying to imply that you think Obito started the war for that reason, I’m just saying the series gets a lot of hate because of misconceptions due to people pulling characters and events completely out of context to bash it. \n\nWhether you think Naruto is amazing or garbage doesn’t matter to me. My point is that Naruto’s overall quality was consistent from land of waves up to the beginning of the ninja war. I understand why that arc is controversial. If you hate that arc I would understand. I was lucky enough to experience the war arc through the video game adaptation so I enjoyed it for the most part. \n\nEver since the beginning of part 2 the plot was clearly headed to some type of massive war because the Akatsuki were collecting 9 beast with practically limitless destructive power. And lack of screen time does not mean abandoned. Side characters are meant to serve the plot not the other way around. Side characters were used whenever they were necessary. People had extremely high hopes for Naruto side characters in particular which I don’t understand.",
                                                                            "author": "silkboye",
                                                                            "id": "fma3lio",
                                                                            "parent_id": "t1_fma210a",
                                                                            "score": 1,
                                                                            "created_utc": 1585882967.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Imagine being this delusional. Naruto part 1 is the only good one, shippuden and boruto are terrible",
                    "author": "Clayman_",
                    "id": "fm92kdp",
                    "parent_id": "t1_fm8pubc",
                    "score": -19,
                    "created_utc": 1585860515.0,
                    "replies": [
                        {
                            "body": "Nice rebuttal! Totally proved me wrong.",
                            "author": "silkboye",
                            "id": "fm93knx",
                            "parent_id": "t1_fm92kdp",
                            "score": 11,
                            "created_utc": 1585861058.0,
                            "replies": [
                                {
                                    "body": "You just have no taste. There is no comparison between OG Naruto and shippuden. Shippuden has no real story and all the fights look like either DBZ or kaiju fights. And boruto is just pure garbage lol",
                                    "author": "Clayman_",
                                    "id": "fm94ewm",
                                    "parent_id": "t1_fm93knx",
                                    "score": -10,
                                    "created_utc": 1585861511.0,
                                    "replies": [
                                        {
                                            "body": "kakashi vs obito??????",
                                            "author": "OnePumpBoy",
                                            "id": "fm96vwb",
                                            "parent_id": "t1_fm94ewm",
                                            "score": 8,
                                            "created_utc": 1585862849.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "The crazy part is that I have the ability to defend my own opinions while all you can do is spew out lame insults. You probably get all your opinions from YouTube videos or hive leader you follow on social media.",
                                            "author": "silkboye",
                                            "id": "fm96hn0",
                                            "parent_id": "t1_fm94ewm",
                                            "score": 7,
                                            "created_utc": 1585862634.0,
                                            "replies": [
                                                {
                                                    "body": "Only a person without brain can defend shippuden 🤣🤣",
                                                    "author": "Clayman_",
                                                    "id": "fm9bvla",
                                                    "parent_id": "t1_fm96hn0",
                                                    "score": -5,
                                                    "created_utc": 1585865601.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Imagine being this ignorant, believing your own unpopular opinion is the end all be all fact and that anyone who thinks otherwise is the delusional one. If you skip all of the filler and only watch the canon episodes everything makes much more sense. Not only that, Kishimoto had a clear path the entire series. Just because it wasn't clear to you, doesn't mean it isn't there. You say Boruto is trash, but that only because 90% of the anime so far is filler, in which the filler is horrendous at best. If you take out the filler Boruto is a quality anime. It's not great, but it is still exceptional. Naruto and Naruto Shippuden are on equal terms from my somewhat unbiased opinion. The main difference is you own personal preference and opinion. In fact, if it weren't for the constant nostalgic feeling I get from Naruto, then I'd likely say that Naruto Shippuden is far better than Naruto. Realistically, Shippuden has everything Naruto has, but more. More action, more characters, same/more emotion, more power, more plot twists, just more. In the end you have your opinion and everyone else has their own. So maybe try not to call someone else delusional while putting your own OPINION above theirs. Delusional and ignorant, that isnt a good combination my friend.",
                            "author": "Alaryc_Stahl",
                            "id": "fm94u18",
                            "parent_id": "t1_fm92kdp",
                            "score": 8,
                            "created_utc": 1585861741.0,
                            "replies": []
                        },
                        {
                            "body": "What a load of shit. Naruto Shippuden is awesome. I'd even argue that up until the end of the Pain arc it's better than the original series.",
                            "author": "Poobumwillyboobs",
                            "id": "fm9beei",
                            "parent_id": "t1_fm92kdp",
                            "score": 4,
                            "created_utc": 1585865330.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are right. I think he even stated that he had already thought up the ending of Naruto and Sasuke lying side by side arm less, bleading out on statues of their ancestors while he was doing Chunnin Arc.",
            "author": "Moonlights_Embrace",
            "id": "fm8i41w",
            "parent_id": "t1_fm8gv3x",
            "score": 9,
            "created_utc": 1585849799.0,
            "replies": []
        },
        {
            "body": "Teaches, inspires, and instills morals at a young age. Or at least they should",
            "author": "RelativePerspectiv",
            "id": "fm9bg2r",
            "parent_id": "t1_fm8r25m",
            "score": 3,
            "created_utc": 1585865356.0,
            "replies": []
        },
        {
            "body": "Believe me\n\nOh",
            "author": "TrueSaiyanGod",
            "id": "fm8toyv",
            "parent_id": "t1_fm8r25m",
            "score": 2,
            "created_utc": 1585855833.0,
            "replies": []
        },
        {
            "body": "What would you suggest? More importantly why are you on this page then?",
            "author": "I-like-your-pants",
            "id": "fm9g35f",
            "parent_id": "t1_fm9cjns",
            "score": 1,
            "created_utc": 1585868017.0,
            "replies": [
                {
                    "body": "Came from r/all. Anyway doing that is totally stupid but if it had to be done it'd be with something people can learn from like Legend of the Galactic Heroes.",
                    "author": "Beardamus",
                    "id": "fm9k6cr",
                    "parent_id": "t1_fm9g35f",
                    "score": 2,
                    "created_utc": 1585870404.0,
                    "replies": [
                        {
                            "body": ">Anyway doing that is totally stupid\n\nOP was almost certainly joking",
                            "author": "The96thPoet",
                            "id": "fmamxzc",
                            "parent_id": "t1_fm9k6cr",
                            "score": 1,
                            "created_utc": 1585899857.0,
                            "replies": [
                                {
                                    "body": "> What would you suggest? \n\nWhich is why I was more replying to that than op.",
                                    "author": "Beardamus",
                                    "id": "fmaxp95",
                                    "parent_id": "t1_fmamxzc",
                                    "score": 1,
                                    "created_utc": 1585911903.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The power scale got bad around Naruto and Bee vs. Revived Tailed Beasts. Rock Lee, Hinata, and a couple others either didn't have arcs that they deserved or had their arc rushed. But yeah overall the writing wasn't bad until Black Zetsu played Madara who played Obito.",
            "author": "fang434",
            "id": "fm9dr36",
            "parent_id": "t1_fm8pubc",
            "score": 13,
            "created_utc": 1585866665.0,
            "replies": [
                {
                    "body": "I don’t get what was bad about it, the series establishes very early on that tailed beast are extremely powerful. Rock Lee’s purpose was to show that he could become an elite shinobi with just Taijutsu and he already proved himself to be elite by the end of part 1 if not in his fight against gaara. Hinata’s purpose was to build courage to fight for herself and she displays her courage in the pain arc and when she fought along side naruto in the ninja war arc. All the side characters who were fighting internal battles had some time of resolution. There are no loose ends and all the side characters served their purpose. Even Shino got a conclusion and he was a gag character in part 2.",
                    "author": "silkboye",
                    "id": "fm9hb7m",
                    "parent_id": "t1_fm9dr36",
                    "score": 7,
                    "created_utc": 1585868733.0,
                    "replies": [
                        {
                            "body": "Shino being a gag character is not a good thing after how he was portrayed in part one, being creepily powerful. He hardly got a conclusion. Hinata didn't really fight alongside Naruto, she was fodder. Rock Lee was supposed to show hard work can let you achieve anything you want, yet he was still fodder and couldn't beat Sasuke or Naruto because they had crazy ninjutsu. Naruto should not be able to hold his own against 6 different tailed beasts simultaneously, and Kakashi should be destroyed by a single one but they all got power crept to be more powerful.",
                            "author": "fang434",
                            "id": "fm9kt2c",
                            "parent_id": "t1_fm9hb7m",
                            "score": 6,
                            "created_utc": 1585870776.0,
                            "replies": [
                                {
                                    "body": "Gag characters are never good tbh but his conclusion was that he found a passion in teaching. Rock lee wanted to prove he be an elite shinobi without chakra and he did that. Hinata was just meant to prove her courage and she did that. Just because they didn’t become the strongest in the series doesn’t mean they didn’t accomplish their goals. You’re expectations aren’t too high for side characters. I can’t think of many shonen series where side characters are as strong as main characters by the end. \n\nAnd in the anime it wasn’t really that much of a fight. Neither side really had a chance to go all out.",
                                    "author": "silkboye",
                                    "id": "fm9psbu",
                                    "parent_id": "t1_fm9kt2c",
                                    "score": 5,
                                    "created_utc": 1585873837.0,
                                    "replies": [
                                        {
                                            "body": "Right. No matter how good lee gets he’s a side character. How can you be mad that a side character couldn’t beat superman the main character?\n\nNobody got mad that goku can beat all the teammates in dbz. I think he’s just a hater",
                                            "author": "Phenoxx",
                                            "id": "fma1496",
                                            "parent_id": "t1_fm9psbu",
                                            "score": 0,
                                            "created_utc": 1585881254.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "i saw naruto kai only and it waz dope",
            "author": "Dhruv_Colossus",
            "id": "fnv5pxf",
            "parent_id": "t1_fm8pubc",
            "score": 2,
            "created_utc": 1587281151.0,
            "replies": []
        },
        {
            "body": "They abandoned a lot of the side Characters to focus on Naruto and Sasuke, also the reincarnation part was really dumb. In a world where Naruto and Sasuke were fated to fight on another their actions had no weight. Ninja Jesus and His children were horrible characters. Kaguya and Zetsu were probably the worst thing to ever come out of Naruto.\nMadara was defeated in a stupid way, they went on and on about the power of Friendship and Cooperation and then Naruto and Sasuke were the only one who's actions mattered. Both shows have their strength but Shippuden has none of the technical aspects of Ninja combats that the first serie had, Shippuden is just people throwing energy stuff at each others and seeing who can withstand it better. There were some great moments, good moments, bad moments and mostly fillers to tie it all together.\n\nEven ignoring the fillers the show, both of them (and the manga it's based upon) have many problems, Kishimoto isn't good at world building, he's good at Character writing and in Shippuden he shifted into world building, which he isn't capable of doing.\n\nIt was such a missed opportunity to make something great, if only he was a better writer.\n\nHonestly who could tell me that Naruto has some good lore and worldbuilding, compared to the character focused moments.\n\nLike all of the scene with Shikamaru after >!Asuma death's;< or Naruto and >!Jiraya's!<. The show is at its best there and not showing you this pointless world of Space Chakra and dimension bullshit.\n\nThe Kyuubi and the other tailed beasts were being changed and they did whatever the fuck they wanted with them, like they did all Characters, they have a Character with an established personality and they change it to fit whatever story they want to tell. \n\nThey have some characters who really have nothing to do, like Sakura, Ino, Tenten and Hinata, until the end they have nothing to do. (I'm sure people will want to defend their Waifus).\n\nCharacters like Neji, Lee, Shino and Kiba are abandoned, Shikamaru and Choji's development gets changed whenever they feel like it.\n\nThe Akatsuki get some development but they're also retconned every once in a while, not always good or bad.\n\nSome characters are better in Shippuden, like Itachi, he did get a lot of development in the second serie.\n\nSome Characters are completely abandoned like Orochimaru and Kabuto. They're shadows of their former selves and it's a shame because Orochimaru was one of my favs in Naruto.\n\nI could go on but I don't want to rant for too long.\n\nPeace out and bye.",
            "author": "Dan-TAW123",
            "id": "fm9js0n",
            "parent_id": "t1_fm8pubc",
            "score": 0,
            "created_utc": 1585870172.0,
            "replies": [
                {
                    "body": "You use the word “abandon” really excessively. Like we’re you expecting each and every side character to have an arc to themselves? The series is literally called naruto of course everything will revolve around him. It’s ridiculous to think that every side character is going to have some big shining moment when new side characters are introduced every arc. The purpose of a side character is to work for the plot not for the plot to work for them. And many side characters have presence throughout the whole series like Kabuto and Orochimaru, how were they abandoned? What more did you want from them? Shikamaru has MVP moments in 4 different arcs and has an entire arc to himself. \n\nThe Kaguya plot twist was properly foreshadowed before the war arc and  well explained within the series even if Madara was the better villain it doesn’t mean the plot twist made no sense. And everyone’s actions mattered, Naruto wouldn’t have gotten as far as he did without the people around him. It’s ridiculous to try to downplay everyone’s role in the series because things would’ve played out differently if it weren’t for characters like itachi and Jiraiya etc.\n\nAnd you need to provide evidence before you say stuff like “The Kyuubi and the other tailed beasts were being changed and they did whatever the fuck they wanted with them, like they did all Characters, they have a Character with an established personality and they change it to fit whatever story they want to tell.” You keep saying characters development were retconned but you provide no proof.\n\nAll the side characters concluded what ever internal struggle they had going on (example: Neji and Rock lee). It just seems like you expected them to get as much screen time as main characters which doesn’t happen in any series unless it’s slice of life.\n\nThe fights still had strategy even up to the war arc. Example: Sasuke v Deidara, Obito v Kakashi, itachi v Sasuke and Hidan v Shikamaru.\n\nAnd pretty much everything else in that rant is just a bunch of complaints with no reason or evidence attached to it. Like at least explain how Choji’s development is changed.",
                    "author": "silkboye",
                    "id": "fm9ocm8",
                    "parent_id": "t1_fm9js0n",
                    "score": 2,
                    "created_utc": 1585872932.0,
                    "replies": [
                        {
                            "body": "In the beginning they said that the beast were just forces of nature with no intelligence (paraphrasing)\n\nAlso I didn't said all fights were non strategic, I knew you'd bring up the deidara fight or the Obito one, I agree with those picks but quoting a dozen \"strategic\" fight scenes out of the hundreds that aren't doesn't mean that the majority of fights is. \n\nNeji ended up being right, the show was supposed to be about a kid who marginalized by society for different reasons, he was the underdog, yet at every fight and in every arc there's need to be an awesome revelation on how he's special and stronger than everyone, he has a god inside him, his parents were great ninjas, he was trained by other great ninjas, he kept using the fox's chakra instead of his own, he was a reincarnation of the son of Ninja Jesus, none of the things he did mattered, of everything happened because of destiny then none of the choices the character makes have an actual impact.\n\nKaguya and Zetsu were not foreshadowed at all, I don't know where the heck did you see that being foreshadowed.\n\nChoji had an entire episode dedicated to him believing in himself during the war arc and then he magically lost weight and during the madara fight he gained it all back, like wtf? And in Boruto he's far and thin whenever he wants, like, again, WTF?\n\nNeji was right in the end, during the chunin exams he said it.\n\nNaruto has declined in quality over the years, it's by far not a bad serie, it's just average.\n\nA lot of anime fall into that bad writing, they start out great and then drop like shit.\n\nI'm talking as a fan, if you can't admit that the serie has its problems then you must be blind. It's better to be out of the circlejerk and admit it, the serie has really gone downhill.",
                            "author": "Dan-TAW123",
                            "id": "fm9tmwf",
                            "parent_id": "t1_fm9ocm8",
                            "score": 3,
                            "created_utc": 1585876306.0,
                            "replies": [
                                {
                                    "body": "Neji didn’t talk about destiny in the literal sense. His point was that people can’t change their position in hierarchy/society no matter how fit or unfit they are for that position. Like Hinata was was technically destined to become the leader for the hyuga even though she was clearly unfit for it and she never did become fit for it even though it was her destiny. He believed naruto would stay a hated outcast because that’s how he was born. \n\n  Naruto was not an underdog story. By mid way of the land if waves arc it should’ve been obvious that Naruto was not an underdog because by this point it was stated that his only disadvantage to his peers was his poor chakra control and this was because he had practically infinite chakra and also he was shown to be able to tap into the chakra of the nine tailed beast that almost destroyed a village full of Shinobi, so did he really have it that bad? And throughout part 1 he was shown to be clever enough to find ways around his handicap so it’s not even like he was stupid either. In the final valley fight Sasuke literally acknowledges that Naruto is “special” so definitely by this point it’s clear that this was not meant to be an underdog story. This is the worst misconception for the series I’ve heard and it shows that you don’t know what you’re even talking about.\n\nHundreds of fights?? Really!?\n\nKaguya AKA “the rabbit goddess” was name dropped a couple times throughout the series not just in the war arc. Black zestu was a mystery all throughout the series because is objectives were never stated until the plot twist and he had presence even during part 1 so he didn’t come out of nowhere. But you would only know this if you’d pay attention.\n\nAnd choji’s transformation being inconsistent is as petty as complaining about goku’s hair turning to normal after ss3. It makes no difference either way, why be mad over something so trivial?\n\nEdit: and no one ever tried to understand the tailed beast except Naruto so of course people just thought they were mindless.",
                                    "author": "silkboye",
                                    "id": "fm9w9bs",
                                    "parent_id": "t1_fm9tmwf",
                                    "score": 2,
                                    "created_utc": 1585877993.0,
                                    "replies": [
                                        {
                                            "body": "I’d like to know when was Kaguya was mentioned during the series. The whole time it was all about the Rikudo Sennin not Kaguya. The first time she was mentioned was when Madara explained to Hashirama how chakra came to be. I am pretty certain of what I am saying, I watched the anime and I own all manga chapters.",
                                            "author": "WrongCilantro",
                                            "id": "fmbp13v",
                                            "parent_id": "t1_fm9w9bs",
                                            "score": 4,
                                            "created_utc": 1585930589.0,
                                            "replies": [
                                                {
                                                    "body": "Sorry I don’t have a source but I just remember “rabbit goddess” being mentioned subtly by Kakashi. Even if she was foreshadowed that one time by Madara it still counts as foreshadowing anyway so it makes no difference.",
                                                    "author": "silkboye",
                                                    "id": "fmbxncl",
                                                    "parent_id": "t1_fmbp13v",
                                                    "score": 1,
                                                    "created_utc": 1585935102.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don’t recall Kakashi talking about the rabbit goddess, I’ll have to check it out and make my research as you could be right, my memory sucks sometimes. And yes it is foreshadowing but you have to admit it still came very very late and was a little last minute storywise.",
                                                            "author": "WrongCilantro",
                                                            "id": "fmbyaxz",
                                                            "parent_id": "t1_fmbxncl",
                                                            "score": 2,
                                                            "created_utc": 1585935448.0,
                                                            "replies": [
                                                                {
                                                                    "body": "She might’ve been referenced when kimimaru’s origin story was explained. And yeah it was done in a shady kinda way but at least it’s not a total asspull. And I’ve seen many series even outside of anime get away with much cheaper writing tactics so it doesn’t bug me. The only series I can think of that always uses foreshadowing properly is one piece.",
                                                                    "author": "silkboye",
                                                                    "id": "fmc0g1v",
                                                                    "parent_id": "t1_fmbyaxz",
                                                                    "score": 1,
                                                                    "created_utc": 1585936585.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Dude, you give too much credit to Kishimoto and his assistant and editors. You have to understand that in the process of writing a serie people change things, especially in an on-going serie like the ShonenJump series. You're trying to give this things too much sense, the story was not ready from the beginning, someone above me confirmed this as well, with no sources, that Kishimoto wanted to end the serie with Naruto Vs Sasuke, it was obvious that he had a goal in mind and just went backwards from that plot point, but going this way ruins everything else, the characters are supposed to have a natural development and in Naruto they don't really have that, some of them do, but the characters change to serve the plot and the writers, it's the lazy writer technique. I like Naruto, wether you believe this or not, but the story isn't as good, the characters were the best part of it and by the end Kishimoto and his assistants cast them aside to focus on the plot which they were incapable of writing. You can't seriously tell me it's good or they had thought about it from the beginning, Kaguya came out of nowhere to save Kishimoto after he wrote himself into a corner. Ninja Jesus was so dumb, he could've been a great character but he was just literally was a 2Dimensional boring character. The resurrection parts were so dumb, the only thing that was salvageable were the characters and Kishimoto failed at it, the last good episode was the Naruto Vs Sasuke fight, after that it was fillers all over again and a couple of movies. They milked the franchise dry, both ShonenJump and The Studio Pierrot, like they're doing with Boruto now. It's such a wasted opportunity and time. I loved this serie as a kid, I grew up with it, but it's really not as great as everyone says it is, especially Shippuden. The second part of the serie was particularly bad, especially after the Pain Arc, after that the good moments were few, Itachi had some of the best development in Shippuden (as I've said already) even other characters had, but by the war arc everything was forgotten, one of the worst arcs I've seen, ever.",
                                            "author": "Dan-TAW123",
                                            "id": "fm9ybv6",
                                            "parent_id": "t1_fm9w9bs",
                                            "score": 2,
                                            "created_utc": 1585879347.0,
                                            "replies": [
                                                {
                                                    "body": "I couldn’t care less about what happened with Kishimoto and his editors behind the scenes. I’m not trying to make the series make sense, it’s more like you’re trying to make the series look bad by disregarding all the context and exposition the series has. That’s how you get ridiculous arguments like “Neji is right about destiny” , “Obito started a war because his crush died” or my personal favorite “Naruto’s underdog story got ruined”. \n\nKaguya’s revival itself wasn’t bad but pretty much everything that involved her made the series less enjoyable and made the series make less sense. This part took up about less than a third of the war arc and it was terrible but it didn’t ruin the war arc for me and saying that it ruined the whole series is just overdramatic.\n\nHagoromo served his purpose he was a mediocre character but that’s fine considering he had probably 8-15 minutes of screen time. And after the pain arc there were so many good moments like the waterfall of truth and the reunion of Sasuke and itachi.",
                                                    "author": "silkboye",
                                                    "id": "fma0lyw",
                                                    "parent_id": "t1_fm9ybv6",
                                                    "score": 0,
                                                    "created_utc": 1585880905.0,
                                                    "replies": [
                                                        {
                                                            "body": "thats not what i said, i never talked against obito, he was one of my favourites. also i said it myself that even after the pain arc there were good moments. i think youre misunderstanding me, im criticising the serie but you think im an hater, im not. Naruto is one of my favorites series, but just because it is doesnt make it immune to my criticism, it would be dishonest from me to just ignore all the bad writing, just as it would for you. the story was changed constantly from one thing to another, Kishimoto had no actual direction, he only had plot-points he wanted to reach, its pretty clear hes not the great writer you seem to think he is, even his new serie is being canceled after only a few months of coming out. hes not capable of writing stories, his strength is in the character writing, which he abandoned around the war arc, some characters did get a good treatment, like Itachi (as ive said 4 times already, not only him but also a few others).",
                                                            "author": "Dan-TAW123",
                                                            "id": "fma210a",
                                                            "parent_id": "t1_fma0lyw",
                                                            "score": 3,
                                                            "created_utc": 1585881879.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I wasn’t trying to imply that you think Obito started the war for that reason, I’m just saying the series gets a lot of hate because of misconceptions due to people pulling characters and events completely out of context to bash it. \n\nWhether you think Naruto is amazing or garbage doesn’t matter to me. My point is that Naruto’s overall quality was consistent from land of waves up to the beginning of the ninja war. I understand why that arc is controversial. If you hate that arc I would understand. I was lucky enough to experience the war arc through the video game adaptation so I enjoyed it for the most part. \n\nEver since the beginning of part 2 the plot was clearly headed to some type of massive war because the Akatsuki were collecting 9 beast with practically limitless destructive power. And lack of screen time does not mean abandoned. Side characters are meant to serve the plot not the other way around. Side characters were used whenever they were necessary. People had extremely high hopes for Naruto side characters in particular which I don’t understand.",
                                                                    "author": "silkboye",
                                                                    "id": "fma3lio",
                                                                    "parent_id": "t1_fma210a",
                                                                    "score": 1,
                                                                    "created_utc": 1585882967.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Imagine being this delusional. Naruto part 1 is the only good one, shippuden and boruto are terrible",
            "author": "Clayman_",
            "id": "fm92kdp",
            "parent_id": "t1_fm8pubc",
            "score": -19,
            "created_utc": 1585860515.0,
            "replies": [
                {
                    "body": "Nice rebuttal! Totally proved me wrong.",
                    "author": "silkboye",
                    "id": "fm93knx",
                    "parent_id": "t1_fm92kdp",
                    "score": 11,
                    "created_utc": 1585861058.0,
                    "replies": [
                        {
                            "body": "You just have no taste. There is no comparison between OG Naruto and shippuden. Shippuden has no real story and all the fights look like either DBZ or kaiju fights. And boruto is just pure garbage lol",
                            "author": "Clayman_",
                            "id": "fm94ewm",
                            "parent_id": "t1_fm93knx",
                            "score": -10,
                            "created_utc": 1585861511.0,
                            "replies": [
                                {
                                    "body": "kakashi vs obito??????",
                                    "author": "OnePumpBoy",
                                    "id": "fm96vwb",
                                    "parent_id": "t1_fm94ewm",
                                    "score": 8,
                                    "created_utc": 1585862849.0,
                                    "replies": []
                                },
                                {
                                    "body": "The crazy part is that I have the ability to defend my own opinions while all you can do is spew out lame insults. You probably get all your opinions from YouTube videos or hive leader you follow on social media.",
                                    "author": "silkboye",
                                    "id": "fm96hn0",
                                    "parent_id": "t1_fm94ewm",
                                    "score": 7,
                                    "created_utc": 1585862634.0,
                                    "replies": [
                                        {
                                            "body": "Only a person without brain can defend shippuden 🤣🤣",
                                            "author": "Clayman_",
                                            "id": "fm9bvla",
                                            "parent_id": "t1_fm96hn0",
                                            "score": -5,
                                            "created_utc": 1585865601.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Imagine being this ignorant, believing your own unpopular opinion is the end all be all fact and that anyone who thinks otherwise is the delusional one. If you skip all of the filler and only watch the canon episodes everything makes much more sense. Not only that, Kishimoto had a clear path the entire series. Just because it wasn't clear to you, doesn't mean it isn't there. You say Boruto is trash, but that only because 90% of the anime so far is filler, in which the filler is horrendous at best. If you take out the filler Boruto is a quality anime. It's not great, but it is still exceptional. Naruto and Naruto Shippuden are on equal terms from my somewhat unbiased opinion. The main difference is you own personal preference and opinion. In fact, if it weren't for the constant nostalgic feeling I get from Naruto, then I'd likely say that Naruto Shippuden is far better than Naruto. Realistically, Shippuden has everything Naruto has, but more. More action, more characters, same/more emotion, more power, more plot twists, just more. In the end you have your opinion and everyone else has their own. So maybe try not to call someone else delusional while putting your own OPINION above theirs. Delusional and ignorant, that isnt a good combination my friend.",
                    "author": "Alaryc_Stahl",
                    "id": "fm94u18",
                    "parent_id": "t1_fm92kdp",
                    "score": 8,
                    "created_utc": 1585861741.0,
                    "replies": []
                },
                {
                    "body": "What a load of shit. Naruto Shippuden is awesome. I'd even argue that up until the end of the Pain arc it's better than the original series.",
                    "author": "Poobumwillyboobs",
                    "id": "fm9beei",
                    "parent_id": "t1_fm92kdp",
                    "score": 4,
                    "created_utc": 1585865330.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Came from r/all. Anyway doing that is totally stupid but if it had to be done it'd be with something people can learn from like Legend of the Galactic Heroes.",
            "author": "Beardamus",
            "id": "fm9k6cr",
            "parent_id": "t1_fm9g35f",
            "score": 2,
            "created_utc": 1585870404.0,
            "replies": [
                {
                    "body": ">Anyway doing that is totally stupid\n\nOP was almost certainly joking",
                    "author": "The96thPoet",
                    "id": "fmamxzc",
                    "parent_id": "t1_fm9k6cr",
                    "score": 1,
                    "created_utc": 1585899857.0,
                    "replies": [
                        {
                            "body": "> What would you suggest? \n\nWhich is why I was more replying to that than op.",
                            "author": "Beardamus",
                            "id": "fmaxp95",
                            "parent_id": "t1_fmamxzc",
                            "score": 1,
                            "created_utc": 1585911903.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t get what was bad about it, the series establishes very early on that tailed beast are extremely powerful. Rock Lee’s purpose was to show that he could become an elite shinobi with just Taijutsu and he already proved himself to be elite by the end of part 1 if not in his fight against gaara. Hinata’s purpose was to build courage to fight for herself and she displays her courage in the pain arc and when she fought along side naruto in the ninja war arc. All the side characters who were fighting internal battles had some time of resolution. There are no loose ends and all the side characters served their purpose. Even Shino got a conclusion and he was a gag character in part 2.",
            "author": "silkboye",
            "id": "fm9hb7m",
            "parent_id": "t1_fm9dr36",
            "score": 7,
            "created_utc": 1585868733.0,
            "replies": [
                {
                    "body": "Shino being a gag character is not a good thing after how he was portrayed in part one, being creepily powerful. He hardly got a conclusion. Hinata didn't really fight alongside Naruto, she was fodder. Rock Lee was supposed to show hard work can let you achieve anything you want, yet he was still fodder and couldn't beat Sasuke or Naruto because they had crazy ninjutsu. Naruto should not be able to hold his own against 6 different tailed beasts simultaneously, and Kakashi should be destroyed by a single one but they all got power crept to be more powerful.",
                    "author": "fang434",
                    "id": "fm9kt2c",
                    "parent_id": "t1_fm9hb7m",
                    "score": 6,
                    "created_utc": 1585870776.0,
                    "replies": [
                        {
                            "body": "Gag characters are never good tbh but his conclusion was that he found a passion in teaching. Rock lee wanted to prove he be an elite shinobi without chakra and he did that. Hinata was just meant to prove her courage and she did that. Just because they didn’t become the strongest in the series doesn’t mean they didn’t accomplish their goals. You’re expectations aren’t too high for side characters. I can’t think of many shonen series where side characters are as strong as main characters by the end. \n\nAnd in the anime it wasn’t really that much of a fight. Neither side really had a chance to go all out.",
                            "author": "silkboye",
                            "id": "fm9psbu",
                            "parent_id": "t1_fm9kt2c",
                            "score": 5,
                            "created_utc": 1585873837.0,
                            "replies": [
                                {
                                    "body": "Right. No matter how good lee gets he’s a side character. How can you be mad that a side character couldn’t beat superman the main character?\n\nNobody got mad that goku can beat all the teammates in dbz. I think he’s just a hater",
                                    "author": "Phenoxx",
                                    "id": "fma1496",
                                    "parent_id": "t1_fm9psbu",
                                    "score": 0,
                                    "created_utc": 1585881254.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You use the word “abandon” really excessively. Like we’re you expecting each and every side character to have an arc to themselves? The series is literally called naruto of course everything will revolve around him. It’s ridiculous to think that every side character is going to have some big shining moment when new side characters are introduced every arc. The purpose of a side character is to work for the plot not for the plot to work for them. And many side characters have presence throughout the whole series like Kabuto and Orochimaru, how were they abandoned? What more did you want from them? Shikamaru has MVP moments in 4 different arcs and has an entire arc to himself. \n\nThe Kaguya plot twist was properly foreshadowed before the war arc and  well explained within the series even if Madara was the better villain it doesn’t mean the plot twist made no sense. And everyone’s actions mattered, Naruto wouldn’t have gotten as far as he did without the people around him. It’s ridiculous to try to downplay everyone’s role in the series because things would’ve played out differently if it weren’t for characters like itachi and Jiraiya etc.\n\nAnd you need to provide evidence before you say stuff like “The Kyuubi and the other tailed beasts were being changed and they did whatever the fuck they wanted with them, like they did all Characters, they have a Character with an established personality and they change it to fit whatever story they want to tell.” You keep saying characters development were retconned but you provide no proof.\n\nAll the side characters concluded what ever internal struggle they had going on (example: Neji and Rock lee). It just seems like you expected them to get as much screen time as main characters which doesn’t happen in any series unless it’s slice of life.\n\nThe fights still had strategy even up to the war arc. Example: Sasuke v Deidara, Obito v Kakashi, itachi v Sasuke and Hidan v Shikamaru.\n\nAnd pretty much everything else in that rant is just a bunch of complaints with no reason or evidence attached to it. Like at least explain how Choji’s development is changed.",
            "author": "silkboye",
            "id": "fm9ocm8",
            "parent_id": "t1_fm9js0n",
            "score": 2,
            "created_utc": 1585872932.0,
            "replies": [
                {
                    "body": "In the beginning they said that the beast were just forces of nature with no intelligence (paraphrasing)\n\nAlso I didn't said all fights were non strategic, I knew you'd bring up the deidara fight or the Obito one, I agree with those picks but quoting a dozen \"strategic\" fight scenes out of the hundreds that aren't doesn't mean that the majority of fights is. \n\nNeji ended up being right, the show was supposed to be about a kid who marginalized by society for different reasons, he was the underdog, yet at every fight and in every arc there's need to be an awesome revelation on how he's special and stronger than everyone, he has a god inside him, his parents were great ninjas, he was trained by other great ninjas, he kept using the fox's chakra instead of his own, he was a reincarnation of the son of Ninja Jesus, none of the things he did mattered, of everything happened because of destiny then none of the choices the character makes have an actual impact.\n\nKaguya and Zetsu were not foreshadowed at all, I don't know where the heck did you see that being foreshadowed.\n\nChoji had an entire episode dedicated to him believing in himself during the war arc and then he magically lost weight and during the madara fight he gained it all back, like wtf? And in Boruto he's far and thin whenever he wants, like, again, WTF?\n\nNeji was right in the end, during the chunin exams he said it.\n\nNaruto has declined in quality over the years, it's by far not a bad serie, it's just average.\n\nA lot of anime fall into that bad writing, they start out great and then drop like shit.\n\nI'm talking as a fan, if you can't admit that the serie has its problems then you must be blind. It's better to be out of the circlejerk and admit it, the serie has really gone downhill.",
                    "author": "Dan-TAW123",
                    "id": "fm9tmwf",
                    "parent_id": "t1_fm9ocm8",
                    "score": 3,
                    "created_utc": 1585876306.0,
                    "replies": [
                        {
                            "body": "Neji didn’t talk about destiny in the literal sense. His point was that people can’t change their position in hierarchy/society no matter how fit or unfit they are for that position. Like Hinata was was technically destined to become the leader for the hyuga even though she was clearly unfit for it and she never did become fit for it even though it was her destiny. He believed naruto would stay a hated outcast because that’s how he was born. \n\n  Naruto was not an underdog story. By mid way of the land if waves arc it should’ve been obvious that Naruto was not an underdog because by this point it was stated that his only disadvantage to his peers was his poor chakra control and this was because he had practically infinite chakra and also he was shown to be able to tap into the chakra of the nine tailed beast that almost destroyed a village full of Shinobi, so did he really have it that bad? And throughout part 1 he was shown to be clever enough to find ways around his handicap so it’s not even like he was stupid either. In the final valley fight Sasuke literally acknowledges that Naruto is “special” so definitely by this point it’s clear that this was not meant to be an underdog story. This is the worst misconception for the series I’ve heard and it shows that you don’t know what you’re even talking about.\n\nHundreds of fights?? Really!?\n\nKaguya AKA “the rabbit goddess” was name dropped a couple times throughout the series not just in the war arc. Black zestu was a mystery all throughout the series because is objectives were never stated until the plot twist and he had presence even during part 1 so he didn’t come out of nowhere. But you would only know this if you’d pay attention.\n\nAnd choji’s transformation being inconsistent is as petty as complaining about goku’s hair turning to normal after ss3. It makes no difference either way, why be mad over something so trivial?\n\nEdit: and no one ever tried to understand the tailed beast except Naruto so of course people just thought they were mindless.",
                            "author": "silkboye",
                            "id": "fm9w9bs",
                            "parent_id": "t1_fm9tmwf",
                            "score": 2,
                            "created_utc": 1585877993.0,
                            "replies": [
                                {
                                    "body": "I’d like to know when was Kaguya was mentioned during the series. The whole time it was all about the Rikudo Sennin not Kaguya. The first time she was mentioned was when Madara explained to Hashirama how chakra came to be. I am pretty certain of what I am saying, I watched the anime and I own all manga chapters.",
                                    "author": "WrongCilantro",
                                    "id": "fmbp13v",
                                    "parent_id": "t1_fm9w9bs",
                                    "score": 4,
                                    "created_utc": 1585930589.0,
                                    "replies": [
                                        {
                                            "body": "Sorry I don’t have a source but I just remember “rabbit goddess” being mentioned subtly by Kakashi. Even if she was foreshadowed that one time by Madara it still counts as foreshadowing anyway so it makes no difference.",
                                            "author": "silkboye",
                                            "id": "fmbxncl",
                                            "parent_id": "t1_fmbp13v",
                                            "score": 1,
                                            "created_utc": 1585935102.0,
                                            "replies": [
                                                {
                                                    "body": "I don’t recall Kakashi talking about the rabbit goddess, I’ll have to check it out and make my research as you could be right, my memory sucks sometimes. And yes it is foreshadowing but you have to admit it still came very very late and was a little last minute storywise.",
                                                    "author": "WrongCilantro",
                                                    "id": "fmbyaxz",
                                                    "parent_id": "t1_fmbxncl",
                                                    "score": 2,
                                                    "created_utc": 1585935448.0,
                                                    "replies": [
                                                        {
                                                            "body": "She might’ve been referenced when kimimaru’s origin story was explained. And yeah it was done in a shady kinda way but at least it’s not a total asspull. And I’ve seen many series even outside of anime get away with much cheaper writing tactics so it doesn’t bug me. The only series I can think of that always uses foreshadowing properly is one piece.",
                                                            "author": "silkboye",
                                                            "id": "fmc0g1v",
                                                            "parent_id": "t1_fmbyaxz",
                                                            "score": 1,
                                                            "created_utc": 1585936585.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Dude, you give too much credit to Kishimoto and his assistant and editors. You have to understand that in the process of writing a serie people change things, especially in an on-going serie like the ShonenJump series. You're trying to give this things too much sense, the story was not ready from the beginning, someone above me confirmed this as well, with no sources, that Kishimoto wanted to end the serie with Naruto Vs Sasuke, it was obvious that he had a goal in mind and just went backwards from that plot point, but going this way ruins everything else, the characters are supposed to have a natural development and in Naruto they don't really have that, some of them do, but the characters change to serve the plot and the writers, it's the lazy writer technique. I like Naruto, wether you believe this or not, but the story isn't as good, the characters were the best part of it and by the end Kishimoto and his assistants cast them aside to focus on the plot which they were incapable of writing. You can't seriously tell me it's good or they had thought about it from the beginning, Kaguya came out of nowhere to save Kishimoto after he wrote himself into a corner. Ninja Jesus was so dumb, he could've been a great character but he was just literally was a 2Dimensional boring character. The resurrection parts were so dumb, the only thing that was salvageable were the characters and Kishimoto failed at it, the last good episode was the Naruto Vs Sasuke fight, after that it was fillers all over again and a couple of movies. They milked the franchise dry, both ShonenJump and The Studio Pierrot, like they're doing with Boruto now. It's such a wasted opportunity and time. I loved this serie as a kid, I grew up with it, but it's really not as great as everyone says it is, especially Shippuden. The second part of the serie was particularly bad, especially after the Pain Arc, after that the good moments were few, Itachi had some of the best development in Shippuden (as I've said already) even other characters had, but by the war arc everything was forgotten, one of the worst arcs I've seen, ever.",
                                    "author": "Dan-TAW123",
                                    "id": "fm9ybv6",
                                    "parent_id": "t1_fm9w9bs",
                                    "score": 2,
                                    "created_utc": 1585879347.0,
                                    "replies": [
                                        {
                                            "body": "I couldn’t care less about what happened with Kishimoto and his editors behind the scenes. I’m not trying to make the series make sense, it’s more like you’re trying to make the series look bad by disregarding all the context and exposition the series has. That’s how you get ridiculous arguments like “Neji is right about destiny” , “Obito started a war because his crush died” or my personal favorite “Naruto’s underdog story got ruined”. \n\nKaguya’s revival itself wasn’t bad but pretty much everything that involved her made the series less enjoyable and made the series make less sense. This part took up about less than a third of the war arc and it was terrible but it didn’t ruin the war arc for me and saying that it ruined the whole series is just overdramatic.\n\nHagoromo served his purpose he was a mediocre character but that’s fine considering he had probably 8-15 minutes of screen time. And after the pain arc there were so many good moments like the waterfall of truth and the reunion of Sasuke and itachi.",
                                            "author": "silkboye",
                                            "id": "fma0lyw",
                                            "parent_id": "t1_fm9ybv6",
                                            "score": 0,
                                            "created_utc": 1585880905.0,
                                            "replies": [
                                                {
                                                    "body": "thats not what i said, i never talked against obito, he was one of my favourites. also i said it myself that even after the pain arc there were good moments. i think youre misunderstanding me, im criticising the serie but you think im an hater, im not. Naruto is one of my favorites series, but just because it is doesnt make it immune to my criticism, it would be dishonest from me to just ignore all the bad writing, just as it would for you. the story was changed constantly from one thing to another, Kishimoto had no actual direction, he only had plot-points he wanted to reach, its pretty clear hes not the great writer you seem to think he is, even his new serie is being canceled after only a few months of coming out. hes not capable of writing stories, his strength is in the character writing, which he abandoned around the war arc, some characters did get a good treatment, like Itachi (as ive said 4 times already, not only him but also a few others).",
                                                    "author": "Dan-TAW123",
                                                    "id": "fma210a",
                                                    "parent_id": "t1_fma0lyw",
                                                    "score": 3,
                                                    "created_utc": 1585881879.0,
                                                    "replies": [
                                                        {
                                                            "body": "I wasn’t trying to imply that you think Obito started the war for that reason, I’m just saying the series gets a lot of hate because of misconceptions due to people pulling characters and events completely out of context to bash it. \n\nWhether you think Naruto is amazing or garbage doesn’t matter to me. My point is that Naruto’s overall quality was consistent from land of waves up to the beginning of the ninja war. I understand why that arc is controversial. If you hate that arc I would understand. I was lucky enough to experience the war arc through the video game adaptation so I enjoyed it for the most part. \n\nEver since the beginning of part 2 the plot was clearly headed to some type of massive war because the Akatsuki were collecting 9 beast with practically limitless destructive power. And lack of screen time does not mean abandoned. Side characters are meant to serve the plot not the other way around. Side characters were used whenever they were necessary. People had extremely high hopes for Naruto side characters in particular which I don’t understand.",
                                                            "author": "silkboye",
                                                            "id": "fma3lio",
                                                            "parent_id": "t1_fma210a",
                                                            "score": 1,
                                                            "created_utc": 1585882967.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nice rebuttal! Totally proved me wrong.",
            "author": "silkboye",
            "id": "fm93knx",
            "parent_id": "t1_fm92kdp",
            "score": 11,
            "created_utc": 1585861058.0,
            "replies": [
                {
                    "body": "You just have no taste. There is no comparison between OG Naruto and shippuden. Shippuden has no real story and all the fights look like either DBZ or kaiju fights. And boruto is just pure garbage lol",
                    "author": "Clayman_",
                    "id": "fm94ewm",
                    "parent_id": "t1_fm93knx",
                    "score": -10,
                    "created_utc": 1585861511.0,
                    "replies": [
                        {
                            "body": "kakashi vs obito??????",
                            "author": "OnePumpBoy",
                            "id": "fm96vwb",
                            "parent_id": "t1_fm94ewm",
                            "score": 8,
                            "created_utc": 1585862849.0,
                            "replies": []
                        },
                        {
                            "body": "The crazy part is that I have the ability to defend my own opinions while all you can do is spew out lame insults. You probably get all your opinions from YouTube videos or hive leader you follow on social media.",
                            "author": "silkboye",
                            "id": "fm96hn0",
                            "parent_id": "t1_fm94ewm",
                            "score": 7,
                            "created_utc": 1585862634.0,
                            "replies": [
                                {
                                    "body": "Only a person without brain can defend shippuden 🤣🤣",
                                    "author": "Clayman_",
                                    "id": "fm9bvla",
                                    "parent_id": "t1_fm96hn0",
                                    "score": -5,
                                    "created_utc": 1585865601.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Imagine being this ignorant, believing your own unpopular opinion is the end all be all fact and that anyone who thinks otherwise is the delusional one. If you skip all of the filler and only watch the canon episodes everything makes much more sense. Not only that, Kishimoto had a clear path the entire series. Just because it wasn't clear to you, doesn't mean it isn't there. You say Boruto is trash, but that only because 90% of the anime so far is filler, in which the filler is horrendous at best. If you take out the filler Boruto is a quality anime. It's not great, but it is still exceptional. Naruto and Naruto Shippuden are on equal terms from my somewhat unbiased opinion. The main difference is you own personal preference and opinion. In fact, if it weren't for the constant nostalgic feeling I get from Naruto, then I'd likely say that Naruto Shippuden is far better than Naruto. Realistically, Shippuden has everything Naruto has, but more. More action, more characters, same/more emotion, more power, more plot twists, just more. In the end you have your opinion and everyone else has their own. So maybe try not to call someone else delusional while putting your own OPINION above theirs. Delusional and ignorant, that isnt a good combination my friend.",
            "author": "Alaryc_Stahl",
            "id": "fm94u18",
            "parent_id": "t1_fm92kdp",
            "score": 8,
            "created_utc": 1585861741.0,
            "replies": []
        },
        {
            "body": "What a load of shit. Naruto Shippuden is awesome. I'd even argue that up until the end of the Pain arc it's better than the original series.",
            "author": "Poobumwillyboobs",
            "id": "fm9beei",
            "parent_id": "t1_fm92kdp",
            "score": 4,
            "created_utc": 1585865330.0,
            "replies": []
        },
        {
            "body": ">Anyway doing that is totally stupid\n\nOP was almost certainly joking",
            "author": "The96thPoet",
            "id": "fmamxzc",
            "parent_id": "t1_fm9k6cr",
            "score": 1,
            "created_utc": 1585899857.0,
            "replies": [
                {
                    "body": "> What would you suggest? \n\nWhich is why I was more replying to that than op.",
                    "author": "Beardamus",
                    "id": "fmaxp95",
                    "parent_id": "t1_fmamxzc",
                    "score": 1,
                    "created_utc": 1585911903.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Shino being a gag character is not a good thing after how he was portrayed in part one, being creepily powerful. He hardly got a conclusion. Hinata didn't really fight alongside Naruto, she was fodder. Rock Lee was supposed to show hard work can let you achieve anything you want, yet he was still fodder and couldn't beat Sasuke or Naruto because they had crazy ninjutsu. Naruto should not be able to hold his own against 6 different tailed beasts simultaneously, and Kakashi should be destroyed by a single one but they all got power crept to be more powerful.",
            "author": "fang434",
            "id": "fm9kt2c",
            "parent_id": "t1_fm9hb7m",
            "score": 6,
            "created_utc": 1585870776.0,
            "replies": [
                {
                    "body": "Gag characters are never good tbh but his conclusion was that he found a passion in teaching. Rock lee wanted to prove he be an elite shinobi without chakra and he did that. Hinata was just meant to prove her courage and she did that. Just because they didn’t become the strongest in the series doesn’t mean they didn’t accomplish their goals. You’re expectations aren’t too high for side characters. I can’t think of many shonen series where side characters are as strong as main characters by the end. \n\nAnd in the anime it wasn’t really that much of a fight. Neither side really had a chance to go all out.",
                    "author": "silkboye",
                    "id": "fm9psbu",
                    "parent_id": "t1_fm9kt2c",
                    "score": 5,
                    "created_utc": 1585873837.0,
                    "replies": [
                        {
                            "body": "Right. No matter how good lee gets he’s a side character. How can you be mad that a side character couldn’t beat superman the main character?\n\nNobody got mad that goku can beat all the teammates in dbz. I think he’s just a hater",
                            "author": "Phenoxx",
                            "id": "fma1496",
                            "parent_id": "t1_fm9psbu",
                            "score": 0,
                            "created_utc": 1585881254.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "In the beginning they said that the beast were just forces of nature with no intelligence (paraphrasing)\n\nAlso I didn't said all fights were non strategic, I knew you'd bring up the deidara fight or the Obito one, I agree with those picks but quoting a dozen \"strategic\" fight scenes out of the hundreds that aren't doesn't mean that the majority of fights is. \n\nNeji ended up being right, the show was supposed to be about a kid who marginalized by society for different reasons, he was the underdog, yet at every fight and in every arc there's need to be an awesome revelation on how he's special and stronger than everyone, he has a god inside him, his parents were great ninjas, he was trained by other great ninjas, he kept using the fox's chakra instead of his own, he was a reincarnation of the son of Ninja Jesus, none of the things he did mattered, of everything happened because of destiny then none of the choices the character makes have an actual impact.\n\nKaguya and Zetsu were not foreshadowed at all, I don't know where the heck did you see that being foreshadowed.\n\nChoji had an entire episode dedicated to him believing in himself during the war arc and then he magically lost weight and during the madara fight he gained it all back, like wtf? And in Boruto he's far and thin whenever he wants, like, again, WTF?\n\nNeji was right in the end, during the chunin exams he said it.\n\nNaruto has declined in quality over the years, it's by far not a bad serie, it's just average.\n\nA lot of anime fall into that bad writing, they start out great and then drop like shit.\n\nI'm talking as a fan, if you can't admit that the serie has its problems then you must be blind. It's better to be out of the circlejerk and admit it, the serie has really gone downhill.",
            "author": "Dan-TAW123",
            "id": "fm9tmwf",
            "parent_id": "t1_fm9ocm8",
            "score": 3,
            "created_utc": 1585876306.0,
            "replies": [
                {
                    "body": "Neji didn’t talk about destiny in the literal sense. His point was that people can’t change their position in hierarchy/society no matter how fit or unfit they are for that position. Like Hinata was was technically destined to become the leader for the hyuga even though she was clearly unfit for it and she never did become fit for it even though it was her destiny. He believed naruto would stay a hated outcast because that’s how he was born. \n\n  Naruto was not an underdog story. By mid way of the land if waves arc it should’ve been obvious that Naruto was not an underdog because by this point it was stated that his only disadvantage to his peers was his poor chakra control and this was because he had practically infinite chakra and also he was shown to be able to tap into the chakra of the nine tailed beast that almost destroyed a village full of Shinobi, so did he really have it that bad? And throughout part 1 he was shown to be clever enough to find ways around his handicap so it’s not even like he was stupid either. In the final valley fight Sasuke literally acknowledges that Naruto is “special” so definitely by this point it’s clear that this was not meant to be an underdog story. This is the worst misconception for the series I’ve heard and it shows that you don’t know what you’re even talking about.\n\nHundreds of fights?? Really!?\n\nKaguya AKA “the rabbit goddess” was name dropped a couple times throughout the series not just in the war arc. Black zestu was a mystery all throughout the series because is objectives were never stated until the plot twist and he had presence even during part 1 so he didn’t come out of nowhere. But you would only know this if you’d pay attention.\n\nAnd choji’s transformation being inconsistent is as petty as complaining about goku’s hair turning to normal after ss3. It makes no difference either way, why be mad over something so trivial?\n\nEdit: and no one ever tried to understand the tailed beast except Naruto so of course people just thought they were mindless.",
                    "author": "silkboye",
                    "id": "fm9w9bs",
                    "parent_id": "t1_fm9tmwf",
                    "score": 2,
                    "created_utc": 1585877993.0,
                    "replies": [
                        {
                            "body": "I’d like to know when was Kaguya was mentioned during the series. The whole time it was all about the Rikudo Sennin not Kaguya. The first time she was mentioned was when Madara explained to Hashirama how chakra came to be. I am pretty certain of what I am saying, I watched the anime and I own all manga chapters.",
                            "author": "WrongCilantro",
                            "id": "fmbp13v",
                            "parent_id": "t1_fm9w9bs",
                            "score": 4,
                            "created_utc": 1585930589.0,
                            "replies": [
                                {
                                    "body": "Sorry I don’t have a source but I just remember “rabbit goddess” being mentioned subtly by Kakashi. Even if she was foreshadowed that one time by Madara it still counts as foreshadowing anyway so it makes no difference.",
                                    "author": "silkboye",
                                    "id": "fmbxncl",
                                    "parent_id": "t1_fmbp13v",
                                    "score": 1,
                                    "created_utc": 1585935102.0,
                                    "replies": [
                                        {
                                            "body": "I don’t recall Kakashi talking about the rabbit goddess, I’ll have to check it out and make my research as you could be right, my memory sucks sometimes. And yes it is foreshadowing but you have to admit it still came very very late and was a little last minute storywise.",
                                            "author": "WrongCilantro",
                                            "id": "fmbyaxz",
                                            "parent_id": "t1_fmbxncl",
                                            "score": 2,
                                            "created_utc": 1585935448.0,
                                            "replies": [
                                                {
                                                    "body": "She might’ve been referenced when kimimaru’s origin story was explained. And yeah it was done in a shady kinda way but at least it’s not a total asspull. And I’ve seen many series even outside of anime get away with much cheaper writing tactics so it doesn’t bug me. The only series I can think of that always uses foreshadowing properly is one piece.",
                                                    "author": "silkboye",
                                                    "id": "fmc0g1v",
                                                    "parent_id": "t1_fmbyaxz",
                                                    "score": 1,
                                                    "created_utc": 1585936585.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Dude, you give too much credit to Kishimoto and his assistant and editors. You have to understand that in the process of writing a serie people change things, especially in an on-going serie like the ShonenJump series. You're trying to give this things too much sense, the story was not ready from the beginning, someone above me confirmed this as well, with no sources, that Kishimoto wanted to end the serie with Naruto Vs Sasuke, it was obvious that he had a goal in mind and just went backwards from that plot point, but going this way ruins everything else, the characters are supposed to have a natural development and in Naruto they don't really have that, some of them do, but the characters change to serve the plot and the writers, it's the lazy writer technique. I like Naruto, wether you believe this or not, but the story isn't as good, the characters were the best part of it and by the end Kishimoto and his assistants cast them aside to focus on the plot which they were incapable of writing. You can't seriously tell me it's good or they had thought about it from the beginning, Kaguya came out of nowhere to save Kishimoto after he wrote himself into a corner. Ninja Jesus was so dumb, he could've been a great character but he was just literally was a 2Dimensional boring character. The resurrection parts were so dumb, the only thing that was salvageable were the characters and Kishimoto failed at it, the last good episode was the Naruto Vs Sasuke fight, after that it was fillers all over again and a couple of movies. They milked the franchise dry, both ShonenJump and The Studio Pierrot, like they're doing with Boruto now. It's such a wasted opportunity and time. I loved this serie as a kid, I grew up with it, but it's really not as great as everyone says it is, especially Shippuden. The second part of the serie was particularly bad, especially after the Pain Arc, after that the good moments were few, Itachi had some of the best development in Shippuden (as I've said already) even other characters had, but by the war arc everything was forgotten, one of the worst arcs I've seen, ever.",
                            "author": "Dan-TAW123",
                            "id": "fm9ybv6",
                            "parent_id": "t1_fm9w9bs",
                            "score": 2,
                            "created_utc": 1585879347.0,
                            "replies": [
                                {
                                    "body": "I couldn’t care less about what happened with Kishimoto and his editors behind the scenes. I’m not trying to make the series make sense, it’s more like you’re trying to make the series look bad by disregarding all the context and exposition the series has. That’s how you get ridiculous arguments like “Neji is right about destiny” , “Obito started a war because his crush died” or my personal favorite “Naruto’s underdog story got ruined”. \n\nKaguya’s revival itself wasn’t bad but pretty much everything that involved her made the series less enjoyable and made the series make less sense. This part took up about less than a third of the war arc and it was terrible but it didn’t ruin the war arc for me and saying that it ruined the whole series is just overdramatic.\n\nHagoromo served his purpose he was a mediocre character but that’s fine considering he had probably 8-15 minutes of screen time. And after the pain arc there were so many good moments like the waterfall of truth and the reunion of Sasuke and itachi.",
                                    "author": "silkboye",
                                    "id": "fma0lyw",
                                    "parent_id": "t1_fm9ybv6",
                                    "score": 0,
                                    "created_utc": 1585880905.0,
                                    "replies": [
                                        {
                                            "body": "thats not what i said, i never talked against obito, he was one of my favourites. also i said it myself that even after the pain arc there were good moments. i think youre misunderstanding me, im criticising the serie but you think im an hater, im not. Naruto is one of my favorites series, but just because it is doesnt make it immune to my criticism, it would be dishonest from me to just ignore all the bad writing, just as it would for you. the story was changed constantly from one thing to another, Kishimoto had no actual direction, he only had plot-points he wanted to reach, its pretty clear hes not the great writer you seem to think he is, even his new serie is being canceled after only a few months of coming out. hes not capable of writing stories, his strength is in the character writing, which he abandoned around the war arc, some characters did get a good treatment, like Itachi (as ive said 4 times already, not only him but also a few others).",
                                            "author": "Dan-TAW123",
                                            "id": "fma210a",
                                            "parent_id": "t1_fma0lyw",
                                            "score": 3,
                                            "created_utc": 1585881879.0,
                                            "replies": [
                                                {
                                                    "body": "I wasn’t trying to imply that you think Obito started the war for that reason, I’m just saying the series gets a lot of hate because of misconceptions due to people pulling characters and events completely out of context to bash it. \n\nWhether you think Naruto is amazing or garbage doesn’t matter to me. My point is that Naruto’s overall quality was consistent from land of waves up to the beginning of the ninja war. I understand why that arc is controversial. If you hate that arc I would understand. I was lucky enough to experience the war arc through the video game adaptation so I enjoyed it for the most part. \n\nEver since the beginning of part 2 the plot was clearly headed to some type of massive war because the Akatsuki were collecting 9 beast with practically limitless destructive power. And lack of screen time does not mean abandoned. Side characters are meant to serve the plot not the other way around. Side characters were used whenever they were necessary. People had extremely high hopes for Naruto side characters in particular which I don’t understand.",
                                                    "author": "silkboye",
                                                    "id": "fma3lio",
                                                    "parent_id": "t1_fma210a",
                                                    "score": 1,
                                                    "created_utc": 1585882967.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You just have no taste. There is no comparison between OG Naruto and shippuden. Shippuden has no real story and all the fights look like either DBZ or kaiju fights. And boruto is just pure garbage lol",
            "author": "Clayman_",
            "id": "fm94ewm",
            "parent_id": "t1_fm93knx",
            "score": -10,
            "created_utc": 1585861511.0,
            "replies": [
                {
                    "body": "kakashi vs obito??????",
                    "author": "OnePumpBoy",
                    "id": "fm96vwb",
                    "parent_id": "t1_fm94ewm",
                    "score": 8,
                    "created_utc": 1585862849.0,
                    "replies": []
                },
                {
                    "body": "The crazy part is that I have the ability to defend my own opinions while all you can do is spew out lame insults. You probably get all your opinions from YouTube videos or hive leader you follow on social media.",
                    "author": "silkboye",
                    "id": "fm96hn0",
                    "parent_id": "t1_fm94ewm",
                    "score": 7,
                    "created_utc": 1585862634.0,
                    "replies": [
                        {
                            "body": "Only a person without brain can defend shippuden 🤣🤣",
                            "author": "Clayman_",
                            "id": "fm9bvla",
                            "parent_id": "t1_fm96hn0",
                            "score": -5,
                            "created_utc": 1585865601.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> What would you suggest? \n\nWhich is why I was more replying to that than op.",
            "author": "Beardamus",
            "id": "fmaxp95",
            "parent_id": "t1_fmamxzc",
            "score": 1,
            "created_utc": 1585911903.0,
            "replies": []
        },
        {
            "body": "Gag characters are never good tbh but his conclusion was that he found a passion in teaching. Rock lee wanted to prove he be an elite shinobi without chakra and he did that. Hinata was just meant to prove her courage and she did that. Just because they didn’t become the strongest in the series doesn’t mean they didn’t accomplish their goals. You’re expectations aren’t too high for side characters. I can’t think of many shonen series where side characters are as strong as main characters by the end. \n\nAnd in the anime it wasn’t really that much of a fight. Neither side really had a chance to go all out.",
            "author": "silkboye",
            "id": "fm9psbu",
            "parent_id": "t1_fm9kt2c",
            "score": 5,
            "created_utc": 1585873837.0,
            "replies": [
                {
                    "body": "Right. No matter how good lee gets he’s a side character. How can you be mad that a side character couldn’t beat superman the main character?\n\nNobody got mad that goku can beat all the teammates in dbz. I think he’s just a hater",
                    "author": "Phenoxx",
                    "id": "fma1496",
                    "parent_id": "t1_fm9psbu",
                    "score": 0,
                    "created_utc": 1585881254.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Neji didn’t talk about destiny in the literal sense. His point was that people can’t change their position in hierarchy/society no matter how fit or unfit they are for that position. Like Hinata was was technically destined to become the leader for the hyuga even though she was clearly unfit for it and she never did become fit for it even though it was her destiny. He believed naruto would stay a hated outcast because that’s how he was born. \n\n  Naruto was not an underdog story. By mid way of the land if waves arc it should’ve been obvious that Naruto was not an underdog because by this point it was stated that his only disadvantage to his peers was his poor chakra control and this was because he had practically infinite chakra and also he was shown to be able to tap into the chakra of the nine tailed beast that almost destroyed a village full of Shinobi, so did he really have it that bad? And throughout part 1 he was shown to be clever enough to find ways around his handicap so it’s not even like he was stupid either. In the final valley fight Sasuke literally acknowledges that Naruto is “special” so definitely by this point it’s clear that this was not meant to be an underdog story. This is the worst misconception for the series I’ve heard and it shows that you don’t know what you’re even talking about.\n\nHundreds of fights?? Really!?\n\nKaguya AKA “the rabbit goddess” was name dropped a couple times throughout the series not just in the war arc. Black zestu was a mystery all throughout the series because is objectives were never stated until the plot twist and he had presence even during part 1 so he didn’t come out of nowhere. But you would only know this if you’d pay attention.\n\nAnd choji’s transformation being inconsistent is as petty as complaining about goku’s hair turning to normal after ss3. It makes no difference either way, why be mad over something so trivial?\n\nEdit: and no one ever tried to understand the tailed beast except Naruto so of course people just thought they were mindless.",
            "author": "silkboye",
            "id": "fm9w9bs",
            "parent_id": "t1_fm9tmwf",
            "score": 2,
            "created_utc": 1585877993.0,
            "replies": [
                {
                    "body": "I’d like to know when was Kaguya was mentioned during the series. The whole time it was all about the Rikudo Sennin not Kaguya. The first time she was mentioned was when Madara explained to Hashirama how chakra came to be. I am pretty certain of what I am saying, I watched the anime and I own all manga chapters.",
                    "author": "WrongCilantro",
                    "id": "fmbp13v",
                    "parent_id": "t1_fm9w9bs",
                    "score": 4,
                    "created_utc": 1585930589.0,
                    "replies": [
                        {
                            "body": "Sorry I don’t have a source but I just remember “rabbit goddess” being mentioned subtly by Kakashi. Even if she was foreshadowed that one time by Madara it still counts as foreshadowing anyway so it makes no difference.",
                            "author": "silkboye",
                            "id": "fmbxncl",
                            "parent_id": "t1_fmbp13v",
                            "score": 1,
                            "created_utc": 1585935102.0,
                            "replies": [
                                {
                                    "body": "I don’t recall Kakashi talking about the rabbit goddess, I’ll have to check it out and make my research as you could be right, my memory sucks sometimes. And yes it is foreshadowing but you have to admit it still came very very late and was a little last minute storywise.",
                                    "author": "WrongCilantro",
                                    "id": "fmbyaxz",
                                    "parent_id": "t1_fmbxncl",
                                    "score": 2,
                                    "created_utc": 1585935448.0,
                                    "replies": [
                                        {
                                            "body": "She might’ve been referenced when kimimaru’s origin story was explained. And yeah it was done in a shady kinda way but at least it’s not a total asspull. And I’ve seen many series even outside of anime get away with much cheaper writing tactics so it doesn’t bug me. The only series I can think of that always uses foreshadowing properly is one piece.",
                                            "author": "silkboye",
                                            "id": "fmc0g1v",
                                            "parent_id": "t1_fmbyaxz",
                                            "score": 1,
                                            "created_utc": 1585936585.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Dude, you give too much credit to Kishimoto and his assistant and editors. You have to understand that in the process of writing a serie people change things, especially in an on-going serie like the ShonenJump series. You're trying to give this things too much sense, the story was not ready from the beginning, someone above me confirmed this as well, with no sources, that Kishimoto wanted to end the serie with Naruto Vs Sasuke, it was obvious that he had a goal in mind and just went backwards from that plot point, but going this way ruins everything else, the characters are supposed to have a natural development and in Naruto they don't really have that, some of them do, but the characters change to serve the plot and the writers, it's the lazy writer technique. I like Naruto, wether you believe this or not, but the story isn't as good, the characters were the best part of it and by the end Kishimoto and his assistants cast them aside to focus on the plot which they were incapable of writing. You can't seriously tell me it's good or they had thought about it from the beginning, Kaguya came out of nowhere to save Kishimoto after he wrote himself into a corner. Ninja Jesus was so dumb, he could've been a great character but he was just literally was a 2Dimensional boring character. The resurrection parts were so dumb, the only thing that was salvageable were the characters and Kishimoto failed at it, the last good episode was the Naruto Vs Sasuke fight, after that it was fillers all over again and a couple of movies. They milked the franchise dry, both ShonenJump and The Studio Pierrot, like they're doing with Boruto now. It's such a wasted opportunity and time. I loved this serie as a kid, I grew up with it, but it's really not as great as everyone says it is, especially Shippuden. The second part of the serie was particularly bad, especially after the Pain Arc, after that the good moments were few, Itachi had some of the best development in Shippuden (as I've said already) even other characters had, but by the war arc everything was forgotten, one of the worst arcs I've seen, ever.",
                    "author": "Dan-TAW123",
                    "id": "fm9ybv6",
                    "parent_id": "t1_fm9w9bs",
                    "score": 2,
                    "created_utc": 1585879347.0,
                    "replies": [
                        {
                            "body": "I couldn’t care less about what happened with Kishimoto and his editors behind the scenes. I’m not trying to make the series make sense, it’s more like you’re trying to make the series look bad by disregarding all the context and exposition the series has. That’s how you get ridiculous arguments like “Neji is right about destiny” , “Obito started a war because his crush died” or my personal favorite “Naruto’s underdog story got ruined”. \n\nKaguya’s revival itself wasn’t bad but pretty much everything that involved her made the series less enjoyable and made the series make less sense. This part took up about less than a third of the war arc and it was terrible but it didn’t ruin the war arc for me and saying that it ruined the whole series is just overdramatic.\n\nHagoromo served his purpose he was a mediocre character but that’s fine considering he had probably 8-15 minutes of screen time. And after the pain arc there were so many good moments like the waterfall of truth and the reunion of Sasuke and itachi.",
                            "author": "silkboye",
                            "id": "fma0lyw",
                            "parent_id": "t1_fm9ybv6",
                            "score": 0,
                            "created_utc": 1585880905.0,
                            "replies": [
                                {
                                    "body": "thats not what i said, i never talked against obito, he was one of my favourites. also i said it myself that even after the pain arc there were good moments. i think youre misunderstanding me, im criticising the serie but you think im an hater, im not. Naruto is one of my favorites series, but just because it is doesnt make it immune to my criticism, it would be dishonest from me to just ignore all the bad writing, just as it would for you. the story was changed constantly from one thing to another, Kishimoto had no actual direction, he only had plot-points he wanted to reach, its pretty clear hes not the great writer you seem to think he is, even his new serie is being canceled after only a few months of coming out. hes not capable of writing stories, his strength is in the character writing, which he abandoned around the war arc, some characters did get a good treatment, like Itachi (as ive said 4 times already, not only him but also a few others).",
                                    "author": "Dan-TAW123",
                                    "id": "fma210a",
                                    "parent_id": "t1_fma0lyw",
                                    "score": 3,
                                    "created_utc": 1585881879.0,
                                    "replies": [
                                        {
                                            "body": "I wasn’t trying to imply that you think Obito started the war for that reason, I’m just saying the series gets a lot of hate because of misconceptions due to people pulling characters and events completely out of context to bash it. \n\nWhether you think Naruto is amazing or garbage doesn’t matter to me. My point is that Naruto’s overall quality was consistent from land of waves up to the beginning of the ninja war. I understand why that arc is controversial. If you hate that arc I would understand. I was lucky enough to experience the war arc through the video game adaptation so I enjoyed it for the most part. \n\nEver since the beginning of part 2 the plot was clearly headed to some type of massive war because the Akatsuki were collecting 9 beast with practically limitless destructive power. And lack of screen time does not mean abandoned. Side characters are meant to serve the plot not the other way around. Side characters were used whenever they were necessary. People had extremely high hopes for Naruto side characters in particular which I don’t understand.",
                                            "author": "silkboye",
                                            "id": "fma3lio",
                                            "parent_id": "t1_fma210a",
                                            "score": 1,
                                            "created_utc": 1585882967.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "kakashi vs obito??????",
            "author": "OnePumpBoy",
            "id": "fm96vwb",
            "parent_id": "t1_fm94ewm",
            "score": 8,
            "created_utc": 1585862849.0,
            "replies": []
        },
        {
            "body": "The crazy part is that I have the ability to defend my own opinions while all you can do is spew out lame insults. You probably get all your opinions from YouTube videos or hive leader you follow on social media.",
            "author": "silkboye",
            "id": "fm96hn0",
            "parent_id": "t1_fm94ewm",
            "score": 7,
            "created_utc": 1585862634.0,
            "replies": [
                {
                    "body": "Only a person without brain can defend shippuden 🤣🤣",
                    "author": "Clayman_",
                    "id": "fm9bvla",
                    "parent_id": "t1_fm96hn0",
                    "score": -5,
                    "created_utc": 1585865601.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right. No matter how good lee gets he’s a side character. How can you be mad that a side character couldn’t beat superman the main character?\n\nNobody got mad that goku can beat all the teammates in dbz. I think he’s just a hater",
            "author": "Phenoxx",
            "id": "fma1496",
            "parent_id": "t1_fm9psbu",
            "score": 0,
            "created_utc": 1585881254.0,
            "replies": []
        },
        {
            "body": "I’d like to know when was Kaguya was mentioned during the series. The whole time it was all about the Rikudo Sennin not Kaguya. The first time she was mentioned was when Madara explained to Hashirama how chakra came to be. I am pretty certain of what I am saying, I watched the anime and I own all manga chapters.",
            "author": "WrongCilantro",
            "id": "fmbp13v",
            "parent_id": "t1_fm9w9bs",
            "score": 4,
            "created_utc": 1585930589.0,
            "replies": [
                {
                    "body": "Sorry I don’t have a source but I just remember “rabbit goddess” being mentioned subtly by Kakashi. Even if she was foreshadowed that one time by Madara it still counts as foreshadowing anyway so it makes no difference.",
                    "author": "silkboye",
                    "id": "fmbxncl",
                    "parent_id": "t1_fmbp13v",
                    "score": 1,
                    "created_utc": 1585935102.0,
                    "replies": [
                        {
                            "body": "I don’t recall Kakashi talking about the rabbit goddess, I’ll have to check it out and make my research as you could be right, my memory sucks sometimes. And yes it is foreshadowing but you have to admit it still came very very late and was a little last minute storywise.",
                            "author": "WrongCilantro",
                            "id": "fmbyaxz",
                            "parent_id": "t1_fmbxncl",
                            "score": 2,
                            "created_utc": 1585935448.0,
                            "replies": [
                                {
                                    "body": "She might’ve been referenced when kimimaru’s origin story was explained. And yeah it was done in a shady kinda way but at least it’s not a total asspull. And I’ve seen many series even outside of anime get away with much cheaper writing tactics so it doesn’t bug me. The only series I can think of that always uses foreshadowing properly is one piece.",
                                    "author": "silkboye",
                                    "id": "fmc0g1v",
                                    "parent_id": "t1_fmbyaxz",
                                    "score": 1,
                                    "created_utc": 1585936585.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dude, you give too much credit to Kishimoto and his assistant and editors. You have to understand that in the process of writing a serie people change things, especially in an on-going serie like the ShonenJump series. You're trying to give this things too much sense, the story was not ready from the beginning, someone above me confirmed this as well, with no sources, that Kishimoto wanted to end the serie with Naruto Vs Sasuke, it was obvious that he had a goal in mind and just went backwards from that plot point, but going this way ruins everything else, the characters are supposed to have a natural development and in Naruto they don't really have that, some of them do, but the characters change to serve the plot and the writers, it's the lazy writer technique. I like Naruto, wether you believe this or not, but the story isn't as good, the characters were the best part of it and by the end Kishimoto and his assistants cast them aside to focus on the plot which they were incapable of writing. You can't seriously tell me it's good or they had thought about it from the beginning, Kaguya came out of nowhere to save Kishimoto after he wrote himself into a corner. Ninja Jesus was so dumb, he could've been a great character but he was just literally was a 2Dimensional boring character. The resurrection parts were so dumb, the only thing that was salvageable were the characters and Kishimoto failed at it, the last good episode was the Naruto Vs Sasuke fight, after that it was fillers all over again and a couple of movies. They milked the franchise dry, both ShonenJump and The Studio Pierrot, like they're doing with Boruto now. It's such a wasted opportunity and time. I loved this serie as a kid, I grew up with it, but it's really not as great as everyone says it is, especially Shippuden. The second part of the serie was particularly bad, especially after the Pain Arc, after that the good moments were few, Itachi had some of the best development in Shippuden (as I've said already) even other characters had, but by the war arc everything was forgotten, one of the worst arcs I've seen, ever.",
            "author": "Dan-TAW123",
            "id": "fm9ybv6",
            "parent_id": "t1_fm9w9bs",
            "score": 2,
            "created_utc": 1585879347.0,
            "replies": [
                {
                    "body": "I couldn’t care less about what happened with Kishimoto and his editors behind the scenes. I’m not trying to make the series make sense, it’s more like you’re trying to make the series look bad by disregarding all the context and exposition the series has. That’s how you get ridiculous arguments like “Neji is right about destiny” , “Obito started a war because his crush died” or my personal favorite “Naruto’s underdog story got ruined”. \n\nKaguya’s revival itself wasn’t bad but pretty much everything that involved her made the series less enjoyable and made the series make less sense. This part took up about less than a third of the war arc and it was terrible but it didn’t ruin the war arc for me and saying that it ruined the whole series is just overdramatic.\n\nHagoromo served his purpose he was a mediocre character but that’s fine considering he had probably 8-15 minutes of screen time. And after the pain arc there were so many good moments like the waterfall of truth and the reunion of Sasuke and itachi.",
                    "author": "silkboye",
                    "id": "fma0lyw",
                    "parent_id": "t1_fm9ybv6",
                    "score": 0,
                    "created_utc": 1585880905.0,
                    "replies": [
                        {
                            "body": "thats not what i said, i never talked against obito, he was one of my favourites. also i said it myself that even after the pain arc there were good moments. i think youre misunderstanding me, im criticising the serie but you think im an hater, im not. Naruto is one of my favorites series, but just because it is doesnt make it immune to my criticism, it would be dishonest from me to just ignore all the bad writing, just as it would for you. the story was changed constantly from one thing to another, Kishimoto had no actual direction, he only had plot-points he wanted to reach, its pretty clear hes not the great writer you seem to think he is, even his new serie is being canceled after only a few months of coming out. hes not capable of writing stories, his strength is in the character writing, which he abandoned around the war arc, some characters did get a good treatment, like Itachi (as ive said 4 times already, not only him but also a few others).",
                            "author": "Dan-TAW123",
                            "id": "fma210a",
                            "parent_id": "t1_fma0lyw",
                            "score": 3,
                            "created_utc": 1585881879.0,
                            "replies": [
                                {
                                    "body": "I wasn’t trying to imply that you think Obito started the war for that reason, I’m just saying the series gets a lot of hate because of misconceptions due to people pulling characters and events completely out of context to bash it. \n\nWhether you think Naruto is amazing or garbage doesn’t matter to me. My point is that Naruto’s overall quality was consistent from land of waves up to the beginning of the ninja war. I understand why that arc is controversial. If you hate that arc I would understand. I was lucky enough to experience the war arc through the video game adaptation so I enjoyed it for the most part. \n\nEver since the beginning of part 2 the plot was clearly headed to some type of massive war because the Akatsuki were collecting 9 beast with practically limitless destructive power. And lack of screen time does not mean abandoned. Side characters are meant to serve the plot not the other way around. Side characters were used whenever they were necessary. People had extremely high hopes for Naruto side characters in particular which I don’t understand.",
                                    "author": "silkboye",
                                    "id": "fma3lio",
                                    "parent_id": "t1_fma210a",
                                    "score": 1,
                                    "created_utc": 1585882967.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Only a person without brain can defend shippuden 🤣🤣",
            "author": "Clayman_",
            "id": "fm9bvla",
            "parent_id": "t1_fm96hn0",
            "score": -5,
            "created_utc": 1585865601.0,
            "replies": []
        },
        {
            "body": "Sorry I don’t have a source but I just remember “rabbit goddess” being mentioned subtly by Kakashi. Even if she was foreshadowed that one time by Madara it still counts as foreshadowing anyway so it makes no difference.",
            "author": "silkboye",
            "id": "fmbxncl",
            "parent_id": "t1_fmbp13v",
            "score": 1,
            "created_utc": 1585935102.0,
            "replies": [
                {
                    "body": "I don’t recall Kakashi talking about the rabbit goddess, I’ll have to check it out and make my research as you could be right, my memory sucks sometimes. And yes it is foreshadowing but you have to admit it still came very very late and was a little last minute storywise.",
                    "author": "WrongCilantro",
                    "id": "fmbyaxz",
                    "parent_id": "t1_fmbxncl",
                    "score": 2,
                    "created_utc": 1585935448.0,
                    "replies": [
                        {
                            "body": "She might’ve been referenced when kimimaru’s origin story was explained. And yeah it was done in a shady kinda way but at least it’s not a total asspull. And I’ve seen many series even outside of anime get away with much cheaper writing tactics so it doesn’t bug me. The only series I can think of that always uses foreshadowing properly is one piece.",
                            "author": "silkboye",
                            "id": "fmc0g1v",
                            "parent_id": "t1_fmbyaxz",
                            "score": 1,
                            "created_utc": 1585936585.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I couldn’t care less about what happened with Kishimoto and his editors behind the scenes. I’m not trying to make the series make sense, it’s more like you’re trying to make the series look bad by disregarding all the context and exposition the series has. That’s how you get ridiculous arguments like “Neji is right about destiny” , “Obito started a war because his crush died” or my personal favorite “Naruto’s underdog story got ruined”. \n\nKaguya’s revival itself wasn’t bad but pretty much everything that involved her made the series less enjoyable and made the series make less sense. This part took up about less than a third of the war arc and it was terrible but it didn’t ruin the war arc for me and saying that it ruined the whole series is just overdramatic.\n\nHagoromo served his purpose he was a mediocre character but that’s fine considering he had probably 8-15 minutes of screen time. And after the pain arc there were so many good moments like the waterfall of truth and the reunion of Sasuke and itachi.",
            "author": "silkboye",
            "id": "fma0lyw",
            "parent_id": "t1_fm9ybv6",
            "score": 0,
            "created_utc": 1585880905.0,
            "replies": [
                {
                    "body": "thats not what i said, i never talked against obito, he was one of my favourites. also i said it myself that even after the pain arc there were good moments. i think youre misunderstanding me, im criticising the serie but you think im an hater, im not. Naruto is one of my favorites series, but just because it is doesnt make it immune to my criticism, it would be dishonest from me to just ignore all the bad writing, just as it would for you. the story was changed constantly from one thing to another, Kishimoto had no actual direction, he only had plot-points he wanted to reach, its pretty clear hes not the great writer you seem to think he is, even his new serie is being canceled after only a few months of coming out. hes not capable of writing stories, his strength is in the character writing, which he abandoned around the war arc, some characters did get a good treatment, like Itachi (as ive said 4 times already, not only him but also a few others).",
                    "author": "Dan-TAW123",
                    "id": "fma210a",
                    "parent_id": "t1_fma0lyw",
                    "score": 3,
                    "created_utc": 1585881879.0,
                    "replies": [
                        {
                            "body": "I wasn’t trying to imply that you think Obito started the war for that reason, I’m just saying the series gets a lot of hate because of misconceptions due to people pulling characters and events completely out of context to bash it. \n\nWhether you think Naruto is amazing or garbage doesn’t matter to me. My point is that Naruto’s overall quality was consistent from land of waves up to the beginning of the ninja war. I understand why that arc is controversial. If you hate that arc I would understand. I was lucky enough to experience the war arc through the video game adaptation so I enjoyed it for the most part. \n\nEver since the beginning of part 2 the plot was clearly headed to some type of massive war because the Akatsuki were collecting 9 beast with practically limitless destructive power. And lack of screen time does not mean abandoned. Side characters are meant to serve the plot not the other way around. Side characters were used whenever they were necessary. People had extremely high hopes for Naruto side characters in particular which I don’t understand.",
                            "author": "silkboye",
                            "id": "fma3lio",
                            "parent_id": "t1_fma210a",
                            "score": 1,
                            "created_utc": 1585882967.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t recall Kakashi talking about the rabbit goddess, I’ll have to check it out and make my research as you could be right, my memory sucks sometimes. And yes it is foreshadowing but you have to admit it still came very very late and was a little last minute storywise.",
            "author": "WrongCilantro",
            "id": "fmbyaxz",
            "parent_id": "t1_fmbxncl",
            "score": 2,
            "created_utc": 1585935448.0,
            "replies": [
                {
                    "body": "She might’ve been referenced when kimimaru’s origin story was explained. And yeah it was done in a shady kinda way but at least it’s not a total asspull. And I’ve seen many series even outside of anime get away with much cheaper writing tactics so it doesn’t bug me. The only series I can think of that always uses foreshadowing properly is one piece.",
                    "author": "silkboye",
                    "id": "fmc0g1v",
                    "parent_id": "t1_fmbyaxz",
                    "score": 1,
                    "created_utc": 1585936585.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "thats not what i said, i never talked against obito, he was one of my favourites. also i said it myself that even after the pain arc there were good moments. i think youre misunderstanding me, im criticising the serie but you think im an hater, im not. Naruto is one of my favorites series, but just because it is doesnt make it immune to my criticism, it would be dishonest from me to just ignore all the bad writing, just as it would for you. the story was changed constantly from one thing to another, Kishimoto had no actual direction, he only had plot-points he wanted to reach, its pretty clear hes not the great writer you seem to think he is, even his new serie is being canceled after only a few months of coming out. hes not capable of writing stories, his strength is in the character writing, which he abandoned around the war arc, some characters did get a good treatment, like Itachi (as ive said 4 times already, not only him but also a few others).",
            "author": "Dan-TAW123",
            "id": "fma210a",
            "parent_id": "t1_fma0lyw",
            "score": 3,
            "created_utc": 1585881879.0,
            "replies": [
                {
                    "body": "I wasn’t trying to imply that you think Obito started the war for that reason, I’m just saying the series gets a lot of hate because of misconceptions due to people pulling characters and events completely out of context to bash it. \n\nWhether you think Naruto is amazing or garbage doesn’t matter to me. My point is that Naruto’s overall quality was consistent from land of waves up to the beginning of the ninja war. I understand why that arc is controversial. If you hate that arc I would understand. I was lucky enough to experience the war arc through the video game adaptation so I enjoyed it for the most part. \n\nEver since the beginning of part 2 the plot was clearly headed to some type of massive war because the Akatsuki were collecting 9 beast with practically limitless destructive power. And lack of screen time does not mean abandoned. Side characters are meant to serve the plot not the other way around. Side characters were used whenever they were necessary. People had extremely high hopes for Naruto side characters in particular which I don’t understand.",
                    "author": "silkboye",
                    "id": "fma3lio",
                    "parent_id": "t1_fma210a",
                    "score": 1,
                    "created_utc": 1585882967.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She might’ve been referenced when kimimaru’s origin story was explained. And yeah it was done in a shady kinda way but at least it’s not a total asspull. And I’ve seen many series even outside of anime get away with much cheaper writing tactics so it doesn’t bug me. The only series I can think of that always uses foreshadowing properly is one piece.",
            "author": "silkboye",
            "id": "fmc0g1v",
            "parent_id": "t1_fmbyaxz",
            "score": 1,
            "created_utc": 1585936585.0,
            "replies": []
        },
        {
            "body": "I wasn’t trying to imply that you think Obito started the war for that reason, I’m just saying the series gets a lot of hate because of misconceptions due to people pulling characters and events completely out of context to bash it. \n\nWhether you think Naruto is amazing or garbage doesn’t matter to me. My point is that Naruto’s overall quality was consistent from land of waves up to the beginning of the ninja war. I understand why that arc is controversial. If you hate that arc I would understand. I was lucky enough to experience the war arc through the video game adaptation so I enjoyed it for the most part. \n\nEver since the beginning of part 2 the plot was clearly headed to some type of massive war because the Akatsuki were collecting 9 beast with practically limitless destructive power. And lack of screen time does not mean abandoned. Side characters are meant to serve the plot not the other way around. Side characters were used whenever they were necessary. People had extremely high hopes for Naruto side characters in particular which I don’t understand.",
            "author": "silkboye",
            "id": "fma3lio",
            "parent_id": "t1_fma210a",
            "score": 1,
            "created_utc": 1585882967.0,
            "replies": []
        }
    ]
}