{
    "title": "Sugar breakups are like….",
    "post_id": "11dyi50",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/11dyi50/sugar_breakups_are_like/",
    "author": "urbanhippy123",
    "body": "Sugar breaks ups are like loosing your partner and loosing your job on the same day. \n\nSD had a change in income and told me today that he needs to step back. He says he’ll see me through March. It’s been a really lovely 2.5 years and I’ve often thought what would I do without him. I guess I’m about to find out. \n\nIn the 2.5 years we’ve been together I’ve never seen this man show a single emotion lol and yet today we both just held each other and cried and cried. It was touching in a way, but doesn’t make this any easier. He’s been such a solid support human. He’s a real diamond. I’m going to miss him.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/11dyi50/sugar_breakups_are_like/",
    "score": 109,
    "upvote_ratio": 0.96,
    "created_utc": 1677564022.0,
    "num_comments": 47,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I hate breakups, it's so useless, people should just stay together forever, that way no breakups :)",
            "author": "sugardad123",
            "id": "jad1oyj",
            "parent_id": "t3_11dyi50",
            "score": 9,
            "created_utc": 1677599288.0,
            "replies": []
        },
        {
            "body": "I agree with those who say \"you cannot expect an sb who needs the money to continue...\"\nA very, VERY sweet SB I had years ago, I had to tell her that I needed to stop sugaring for some time, for a very good reason, I was giving temporary suport to a relative that was battling cancer, and there was just no room to spare while doing so. She told me \"If you want, we can still see each other until you can sugar again, I would do it just for the pleasure\"(#truth, I still have the texts from it somewhere in GV, since I do not use SC, in a joking nod to another thread). Which I found incredibly sweet, and also incredibly complimentary (by way of explanation, a sensual dominance session can be almost overwhelmingly pleasurable to the subject of it) but I told I had had to decline, as I would feel badly about it. She was not dependent on me, the sugar just gave her many extras as a student who worked as a phlebotomist. Fortunately the other situation was just during chemo, which was successful (but sadly not for always) and I recontacted her after I think 3 months, and we kept up where we had left off.",
            "author": "SDInLeather",
            "id": "jacj68o",
            "parent_id": "t3_11dyi50",
            "score": 25,
            "created_utc": 1677591239.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "jadj912",
                    "parent_id": "t1_jacj68o",
                    "score": 10,
                    "created_utc": 1677606054.0,
                    "replies": [
                        {
                            "body": "Completely agree, and lol, the #Truth thing was mainly to make fun of a \"just previous\" convo one of the posters and I had had like moments before on a different thread of why I hate snapchat so much, where he saw a benny in that it deletes your messages, to me that is one of the maddening things about it. I use text (since a lot of my conversations with an SB are via it) to roll back and use it to refresh my memory on like say her ring she wanted me to see, etc. :)",
                            "author": "SDInLeather",
                            "id": "jae5p6q",
                            "parent_id": "t1_jadj912",
                            "score": 3,
                            "created_utc": 1677614531.0,
                            "replies": [
                                {
                                    "body": "You can save the texts on snapchat. It doesnt have to disappear. Just tap on the chat itself and it highlights them and saves them",
                                    "author": "thedoctor321",
                                    "id": "jaglts8",
                                    "parent_id": "t1_jae5p6q",
                                    "score": 1,
                                    "created_utc": 1677656714.0,
                                    "replies": [
                                        {
                                            "body": "Thanks, I probably also should say that, I like using GV and have no reason to stop using it. Old dog...;)",
                                            "author": "SDInLeather",
                                            "id": "jah4o0g",
                                            "parent_id": "t1_jaglts8",
                                            "score": 2,
                                            "created_utc": 1677671972.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Being charitable, maybe he and/ or she is/are using this as an end point for the SR? \n\nBecause yeah, sounds like there is real depth of emotion there. Maybe enough to overlook his temporary, maybe permanent inability to provide as much/any of what he was providing before?\n\nI'd personally feel really bad if I was taking financial hits after supporting a SB for more than a couple of years and she heads for the exit immediately 🤷‍♂️",
            "author": "Worldly-wanderer",
            "id": "jabngx2",
            "parent_id": "t3_11dyi50",
            "score": 17,
            "created_utc": 1677567546.0,
            "replies": [
                {
                    "body": "His exact wording was that he was retiring from sugaring. It’s not that I left cause the money stopped. We will stay friends though I certainly don’t see us maintaining our current level of relationship.",
                    "author": "urbanhippy123",
                    "id": "jabo5wn",
                    "parent_id": "t1_jabngx2",
                    "score": 17,
                    "created_utc": 1677568065.0,
                    "replies": [
                        {
                            "body": "Ah ok, apologies for the negative speculation ams I'm sorry to hear that for you.. 🥺 If you've had a multi year arrangement, you are a rare SB :)\n\nMaybe when he recovers financially, he may come back out of retirement? Although you may be happily in a, let's hope, even better SR by then 😌",
                            "author": "Worldly-wanderer",
                            "id": "jaboms5",
                            "parent_id": "t1_jabo5wn",
                            "score": 4,
                            "created_utc": 1677568418.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I get how you’d feel bad but if your sb was doing this cause she needs the money would you expect her to make do without it or would you be chilled with her getting an Sd while you two remain together?",
                    "author": "Sugarintheorange",
                    "id": "jabu0w2",
                    "parent_id": "t1_jabngx2",
                    "score": 8,
                    "created_utc": 1677572775.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "jaddvn5",
                            "parent_id": "t1_jabu0w2",
                            "score": 0,
                            "created_utc": 1677604023.0,
                            "replies": [
                                {
                                    "body": "“I believe in both ways. Don't keep a SB that isn't getting you off, don't keep a SD that isn't providing” you just said this in another comment ? \n\nAlso you didn’t answer the question, should the sb not make rent while the SD lives comfortably in the name of for richer or poorer ? \n\nIt doesn’t make sense that SBs are heartless monsters for politely moving on when their SDs can’t afford them anymore and don’t see it as a real relationship but SDs are well within their rights to end the relationship for lack of meets or lack of intimacy.",
                                    "author": "Sugarintheorange",
                                    "id": "jadf7yh",
                                    "parent_id": "t1_jaddvn5",
                                    "score": 1,
                                    "created_utc": 1677604535.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "jadfiws",
                                            "parent_id": "t1_jadf7yh",
                                            "score": 0,
                                            "created_utc": 1677604653.0,
                                            "replies": [
                                                {
                                                    "body": "So what would you consider a real relationship within the sugar context ? Does it include SDs who eventually start having less sex with their SBs and SBs who don’t get allowances or assistance ?",
                                                    "author": "Sugarintheorange",
                                                    "id": "jadfuok",
                                                    "parent_id": "t1_jadfiws",
                                                    "score": 1,
                                                    "created_utc": 1677604778.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "jadg3ez",
                                                            "parent_id": "t1_jadfuok",
                                                            "score": 1,
                                                            "created_utc": 1677604868.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I mean you’re the one who said that you’d be hurt if your sb ended the relationship due to no longer receiving an allowance and implied it shows it’s not real. Why would you be hurt if the “transaction “ of an SR makes it not a real relationship? Would you stay in an SR where you stopped getting sex would you feel offended if the sb was hurt you stopped providing allowance? \n\nI’m not trying to argue I’m  just trying to understand your perspective since it seems liek one quite a few SDs share. Is it only transactional when the Sb still wants to maintain the financial arrangement or does it count for SDs who withdraw support due to lacking on the sexual side?",
                                                                    "author": "Sugarintheorange",
                                                                    "id": "jadgyg7",
                                                                    "parent_id": "t1_jadg3ez",
                                                                    "score": 1,
                                                                    "created_utc": 1677605192.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[removed]",
                                                                            "author": null,
                                                                            "id": "jadh5t1",
                                                                            "parent_id": "t1_jadgyg7",
                                                                            "score": 1,
                                                                            "created_utc": 1677605268.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Oops I thought you were the original commenter I replied to so this entire conversation is moot. Sorry .\n\nBut also I don’t see it as a job. I sugar cause it’s fun and it’s how a lot of people I know date, they just don’t call it sugaring. In countries liek the US and Germany splitting things 50/50 is becoming/ is the norm. In other cultures it’s still the norm for the man to provide. It’s just dating in the way I like",
                                                                                    "author": "Sugarintheorange",
                                                                                    "id": "jadhzad",
                                                                                    "parent_id": "t1_jadh5t1",
                                                                                    "score": 2,
                                                                                    "created_utc": 1677605573.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[removed]",
                                                                                            "author": null,
                                                                                            "id": "jadi591",
                                                                                            "parent_id": "t1_jadhzad",
                                                                                            "score": 1,
                                                                                            "created_utc": 1677605636.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Depends how you sugar date. If you think sugar dating is just going out with any man that will pay you to be around him that you and your SRs I guess. \n\nAccording to the definition of sugar dating of this sub my mom was and would sort of still be my dads SB and they’ve been married over 20 years. That’s how I sugar date, calling it sugaring doesn’t automatically make a relationship with a providing man any less of a relationship. Also I’d love to hear of jobs where you can get paid a lot to have fun for hours",
                                                                                                    "author": "Sugarintheorange",
                                                                                                    "id": "jadj2m1",
                                                                                                    "parent_id": "t1_jadi591",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1677605987.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "[removed]",
                                                                                                            "author": null,
                                                                                                            "id": "jadjvd6",
                                                                                                            "parent_id": "t1_jadj2m1",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1677606289.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "I wouldn’t go out with a guy who couldn’t afford dates vanilla or not. My friends have “gf allowances” and they’re dating guys their own age, our family friend gets a monthly allowance as a wife of over 30 years. It’s  not necessarily out of the norm. \n\nShe had 3 suitors and they all took her on holiday and she chose my dad. It’s not a moral dilemma when all your men are the same standard. Her dad also provided for her mom. It’s not exactly a new or shameful thing .\n\nAgain if that’s how your SRs are then so be it. Sugaring is a great way to ensure you don’t have to deal with bill hagglers and guys who are actually willing to provide \n\nAgain fun all has to do with what kind of person you are, interests, how you are raised etc. I consider my dates fun. If that’s how you sugar date that’s on you. I don’t need the money my parents cover everything, SRs are fun  and hot imo and there’s a level of honesty that’s difficult with vanilla sometimes moz",
                                                                                                                    "author": "Sugarintheorange",
                                                                                                                    "id": "jadnt0o",
                                                                                                                    "parent_id": "t1_jadjvd6",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1677607767.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "[removed]",
                                                                                                                            "author": null,
                                                                                                                            "id": "jadoiez",
                                                                                                                            "parent_id": "t1_jadnt0o",
                                                                                                                            "score": 1,
                                                                                                                            "created_utc": 1677608036.0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "body": "I wouldn’t say rich at all. I also wouldn’t judge SBs who “need” the money or consider their relationships fake. \n\nAlso if you’ve grown up in that situation, I don’t know your life but I’m going to assume you’ve also encountered sb situations with your own parents which possibly inspire your participation in this lifestyle?",
                                                                                                                                    "author": "Sugarintheorange",
                                                                                                                                    "id": "jadpx6y",
                                                                                                                                    "parent_id": "t1_jadoiez",
                                                                                                                                    "score": 1,
                                                                                                                                    "created_utc": 1677608568.0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "body": "[removed]",
                                                                                                                                            "author": null,
                                                                                                                                            "id": "jadrxk2",
                                                                                                                                            "parent_id": "t1_jadpx6y",
                                                                                                                                            "score": 1,
                                                                                                                                            "created_utc": 1677609328.0,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "body": "I thought you were a jaded older guy, I did not realise we were the same age. But anyway the point I was gonna make is that people can be in this lifestyle for all different reasons it doesn’t automatically make their connections fake. \n\nThere’s nothing I can argue that won’t make me sound spoiled so I’ll just drop it.",
                                                                                                                                                    "author": "Sugarintheorange",
                                                                                                                                                    "id": "jadtqbf",
                                                                                                                                                    "parent_id": "t1_jadrxk2",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "created_utc": 1677610002.0,
                                                                                                                                                    "replies": []
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You had a long, beautiful relationship and you will be imported to each other for the rest of your lives. The breakup is hard (that’s good, it shows the feelings and connection were real) but it was never intended to be a forever relationship.\n\nNow it’s time to take a little break for yourself. Then when you are ready get back out there and find the next person who will enrich your life. And who will be lucky enough to be able to get to know a SB who is obviously as open and caring as you are.",
            "author": "TwerkingAvocado",
            "id": "jacdvhi",
            "parent_id": "t3_11dyi50",
            "score": 3,
            "created_utc": 1677588364.0,
            "replies": []
        },
        {
            "body": "Apparently, he’s not THAT great. 🤪",
            "author": "garret6758",
            "id": "jabmto4",
            "parent_id": "t3_11dyi50",
            "score": 1,
            "created_utc": 1677567076.0,
            "replies": []
        },
        {
            "body": "So date him without support until he recovers?",
            "author": "storm170",
            "id": "jablfir",
            "parent_id": "t3_11dyi50",
            "score": -1,
            "created_utc": 1677566055.0,
            "replies": [
                {
                    "body": "I don't know if this is a fair ask of an SB. I personally don't think it is, especially since we don't know whether this SD has a family of his own or anything like that. They seem to plan on remaining friends, which I think is the right move. If sexual chemistry exists, they can always go there if they want later, but it certainly shouldn't be an expectation or the norm.\n\nTWSD",
                    "author": "3WaySD",
                    "id": "jabw9zk",
                    "parent_id": "t1_jablfir",
                    "score": 21,
                    "created_utc": 1677574682.0,
                    "replies": [
                        {
                            "body": "After 2.5 years I think it's not only fair to ask, it should be expected of a SB to offer. That's a ton of time to be supported and committed to someone.",
                            "author": "storm170",
                            "id": "jabws8k",
                            "parent_id": "t1_jabw9zk",
                            "score": -7,
                            "created_utc": 1677575135.0,
                            "replies": [
                                {
                                    "body": "I mean, I'd love for this to be the case, but even in a vanilla relationship, women leave if they feel they're not being provided for. I'm not knocking it, that's what women look for in a relationship and feel loved when they feel safe and cared for. I'm not sure how many SBs would stay if the sugar stopped. They'd have to be really special to do so!",
                                    "author": "3WaySD",
                                    "id": "jac42f6",
                                    "parent_id": "t1_jabws8k",
                                    "score": 15,
                                    "created_utc": 1677581471.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "jacyx33",
                            "parent_id": "t1_jabw9zk",
                            "score": -1,
                            "created_utc": 1677598193.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "jadebo0",
                                    "parent_id": "t1_jacyx33",
                                    "score": 3,
                                    "created_utc": 1677604192.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "jadhv7q",
                                            "parent_id": "t1_jadebo0",
                                            "score": 1,
                                            "created_utc": 1677605532.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I mean the advice on this sub is usually along those lines if SBs stop providing initimacy or stop making meets. It’s usually stop allowance and move to ppm again that will guarantee her not cancelling more or dump her",
                                    "author": "Sugarintheorange",
                                    "id": "jad34qw",
                                    "parent_id": "t1_jacyx33",
                                    "score": 0,
                                    "created_utc": 1677599850.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yes, why should the SD provide sugar if he's not getting any in return. He can continue seeing her platonically if he wants,  but this is why I say define an SR at the start, make sure each party is intimately aware of WHAT will constitute the SR and HOW much the SB will be provided when the SR is FULLY in place.\n\nJust my $0.02\n\nTWSD",
                                    "author": "3WaySD",
                                    "id": "jaes5vn",
                                    "parent_id": "t1_jacyx33",
                                    "score": 1,
                                    "created_utc": 1677623282.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I don't think many SD's would keep providing sugar - indefinitely - to a SB who could no longer spend time with them or be intimate, regardless of whether they've been together 2.5 years or not. That's reasonable, and it's the same the other way too.",
                    "author": "coolpink_",
                    "id": "jac8esh",
                    "parent_id": "t1_jablfir",
                    "score": 14,
                    "created_utc": 1677584840.0,
                    "replies": [
                        {
                            "body": "A couple months until he gets a new job is not out of the question though. Probably take her that long to find another SD anyway.  Sounds more like he just wants to end things though.",
                            "author": "sirthunksalot",
                            "id": "jad3aw5",
                            "parent_id": "t1_jac8esh",
                            "score": 2,
                            "created_utc": 1677599916.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Would you continue to date a SB who has gained 100lbs while she loses the weight?",
                    "author": "Mindless-Clock-2393",
                    "id": "jacryb4",
                    "parent_id": "t1_jablfir",
                    "score": 5,
                    "created_utc": 1677595298.0,
                    "replies": [
                        {
                            "body": "For a while yes. If she got it from health reasons (medication) then yes. I would be supportive of her loosing that weight as it would lead to longer term health implications.",
                            "author": "C12H22O11-EU",
                            "id": "jaf0ocz",
                            "parent_id": "t1_jacryb4",
                            "score": 1,
                            "created_utc": 1677626891.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m facing a similar situation due to a change in circumstances on the part of my SB, I see the handwriting on the wall but it doesn’t make it any easier and I know it’s going to be an emotional time when it happens :(",
            "author": "FortuneUnusual3157",
            "id": "jacd0i8",
            "parent_id": "t3_11dyi50",
            "score": 1,
            "created_utc": 1677587854.0,
            "replies": []
        },
        {
            "body": "That first line put it so perfectly 😫",
            "author": "Round_Yam_2677",
            "id": "jadcg4d",
            "parent_id": "t3_11dyi50",
            "score": 1,
            "created_utc": 1677603475.0,
            "replies": []
        },
        {
            "body": "They’re awful. Worse than conventional relationship breakups in my experience. The power dynamics throw everything out of order.",
            "author": "DCsugar",
            "id": "jcis1ff",
            "parent_id": "t3_11dyi50",
            "score": 1,
            "created_utc": 1679022429.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "jadj912",
            "parent_id": "t1_jacj68o",
            "score": 10,
            "created_utc": 1677606054.0,
            "replies": [
                {
                    "body": "Completely agree, and lol, the #Truth thing was mainly to make fun of a \"just previous\" convo one of the posters and I had had like moments before on a different thread of why I hate snapchat so much, where he saw a benny in that it deletes your messages, to me that is one of the maddening things about it. I use text (since a lot of my conversations with an SB are via it) to roll back and use it to refresh my memory on like say her ring she wanted me to see, etc. :)",
                    "author": "SDInLeather",
                    "id": "jae5p6q",
                    "parent_id": "t1_jadj912",
                    "score": 3,
                    "created_utc": 1677614531.0,
                    "replies": [
                        {
                            "body": "You can save the texts on snapchat. It doesnt have to disappear. Just tap on the chat itself and it highlights them and saves them",
                            "author": "thedoctor321",
                            "id": "jaglts8",
                            "parent_id": "t1_jae5p6q",
                            "score": 1,
                            "created_utc": 1677656714.0,
                            "replies": [
                                {
                                    "body": "Thanks, I probably also should say that, I like using GV and have no reason to stop using it. Old dog...;)",
                                    "author": "SDInLeather",
                                    "id": "jah4o0g",
                                    "parent_id": "t1_jaglts8",
                                    "score": 2,
                                    "created_utc": 1677671972.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "His exact wording was that he was retiring from sugaring. It’s not that I left cause the money stopped. We will stay friends though I certainly don’t see us maintaining our current level of relationship.",
            "author": "urbanhippy123",
            "id": "jabo5wn",
            "parent_id": "t1_jabngx2",
            "score": 17,
            "created_utc": 1677568065.0,
            "replies": [
                {
                    "body": "Ah ok, apologies for the negative speculation ams I'm sorry to hear that for you.. 🥺 If you've had a multi year arrangement, you are a rare SB :)\n\nMaybe when he recovers financially, he may come back out of retirement? Although you may be happily in a, let's hope, even better SR by then 😌",
                    "author": "Worldly-wanderer",
                    "id": "jaboms5",
                    "parent_id": "t1_jabo5wn",
                    "score": 4,
                    "created_utc": 1677568418.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I get how you’d feel bad but if your sb was doing this cause she needs the money would you expect her to make do without it or would you be chilled with her getting an Sd while you two remain together?",
            "author": "Sugarintheorange",
            "id": "jabu0w2",
            "parent_id": "t1_jabngx2",
            "score": 8,
            "created_utc": 1677572775.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "jaddvn5",
                    "parent_id": "t1_jabu0w2",
                    "score": 0,
                    "created_utc": 1677604023.0,
                    "replies": [
                        {
                            "body": "“I believe in both ways. Don't keep a SB that isn't getting you off, don't keep a SD that isn't providing” you just said this in another comment ? \n\nAlso you didn’t answer the question, should the sb not make rent while the SD lives comfortably in the name of for richer or poorer ? \n\nIt doesn’t make sense that SBs are heartless monsters for politely moving on when their SDs can’t afford them anymore and don’t see it as a real relationship but SDs are well within their rights to end the relationship for lack of meets or lack of intimacy.",
                            "author": "Sugarintheorange",
                            "id": "jadf7yh",
                            "parent_id": "t1_jaddvn5",
                            "score": 1,
                            "created_utc": 1677604535.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "jadfiws",
                                    "parent_id": "t1_jadf7yh",
                                    "score": 0,
                                    "created_utc": 1677604653.0,
                                    "replies": [
                                        {
                                            "body": "So what would you consider a real relationship within the sugar context ? Does it include SDs who eventually start having less sex with their SBs and SBs who don’t get allowances or assistance ?",
                                            "author": "Sugarintheorange",
                                            "id": "jadfuok",
                                            "parent_id": "t1_jadfiws",
                                            "score": 1,
                                            "created_utc": 1677604778.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "jadg3ez",
                                                    "parent_id": "t1_jadfuok",
                                                    "score": 1,
                                                    "created_utc": 1677604868.0,
                                                    "replies": [
                                                        {
                                                            "body": "I mean you’re the one who said that you’d be hurt if your sb ended the relationship due to no longer receiving an allowance and implied it shows it’s not real. Why would you be hurt if the “transaction “ of an SR makes it not a real relationship? Would you stay in an SR where you stopped getting sex would you feel offended if the sb was hurt you stopped providing allowance? \n\nI’m not trying to argue I’m  just trying to understand your perspective since it seems liek one quite a few SDs share. Is it only transactional when the Sb still wants to maintain the financial arrangement or does it count for SDs who withdraw support due to lacking on the sexual side?",
                                                            "author": "Sugarintheorange",
                                                            "id": "jadgyg7",
                                                            "parent_id": "t1_jadg3ez",
                                                            "score": 1,
                                                            "created_utc": 1677605192.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[removed]",
                                                                    "author": null,
                                                                    "id": "jadh5t1",
                                                                    "parent_id": "t1_jadgyg7",
                                                                    "score": 1,
                                                                    "created_utc": 1677605268.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Oops I thought you were the original commenter I replied to so this entire conversation is moot. Sorry .\n\nBut also I don’t see it as a job. I sugar cause it’s fun and it’s how a lot of people I know date, they just don’t call it sugaring. In countries liek the US and Germany splitting things 50/50 is becoming/ is the norm. In other cultures it’s still the norm for the man to provide. It’s just dating in the way I like",
                                                                            "author": "Sugarintheorange",
                                                                            "id": "jadhzad",
                                                                            "parent_id": "t1_jadh5t1",
                                                                            "score": 2,
                                                                            "created_utc": 1677605573.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[removed]",
                                                                                    "author": null,
                                                                                    "id": "jadi591",
                                                                                    "parent_id": "t1_jadhzad",
                                                                                    "score": 1,
                                                                                    "created_utc": 1677605636.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Depends how you sugar date. If you think sugar dating is just going out with any man that will pay you to be around him that you and your SRs I guess. \n\nAccording to the definition of sugar dating of this sub my mom was and would sort of still be my dads SB and they’ve been married over 20 years. That’s how I sugar date, calling it sugaring doesn’t automatically make a relationship with a providing man any less of a relationship. Also I’d love to hear of jobs where you can get paid a lot to have fun for hours",
                                                                                            "author": "Sugarintheorange",
                                                                                            "id": "jadj2m1",
                                                                                            "parent_id": "t1_jadi591",
                                                                                            "score": 1,
                                                                                            "created_utc": 1677605987.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "[removed]",
                                                                                                    "author": null,
                                                                                                    "id": "jadjvd6",
                                                                                                    "parent_id": "t1_jadj2m1",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1677606289.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "I wouldn’t go out with a guy who couldn’t afford dates vanilla or not. My friends have “gf allowances” and they’re dating guys their own age, our family friend gets a monthly allowance as a wife of over 30 years. It’s  not necessarily out of the norm. \n\nShe had 3 suitors and they all took her on holiday and she chose my dad. It’s not a moral dilemma when all your men are the same standard. Her dad also provided for her mom. It’s not exactly a new or shameful thing .\n\nAgain if that’s how your SRs are then so be it. Sugaring is a great way to ensure you don’t have to deal with bill hagglers and guys who are actually willing to provide \n\nAgain fun all has to do with what kind of person you are, interests, how you are raised etc. I consider my dates fun. If that’s how you sugar date that’s on you. I don’t need the money my parents cover everything, SRs are fun  and hot imo and there’s a level of honesty that’s difficult with vanilla sometimes moz",
                                                                                                            "author": "Sugarintheorange",
                                                                                                            "id": "jadnt0o",
                                                                                                            "parent_id": "t1_jadjvd6",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1677607767.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "[removed]",
                                                                                                                    "author": null,
                                                                                                                    "id": "jadoiez",
                                                                                                                    "parent_id": "t1_jadnt0o",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1677608036.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "I wouldn’t say rich at all. I also wouldn’t judge SBs who “need” the money or consider their relationships fake. \n\nAlso if you’ve grown up in that situation, I don’t know your life but I’m going to assume you’ve also encountered sb situations with your own parents which possibly inspire your participation in this lifestyle?",
                                                                                                                            "author": "Sugarintheorange",
                                                                                                                            "id": "jadpx6y",
                                                                                                                            "parent_id": "t1_jadoiez",
                                                                                                                            "score": 1,
                                                                                                                            "created_utc": 1677608568.0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "body": "[removed]",
                                                                                                                                    "author": null,
                                                                                                                                    "id": "jadrxk2",
                                                                                                                                    "parent_id": "t1_jadpx6y",
                                                                                                                                    "score": 1,
                                                                                                                                    "created_utc": 1677609328.0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "body": "I thought you were a jaded older guy, I did not realise we were the same age. But anyway the point I was gonna make is that people can be in this lifestyle for all different reasons it doesn’t automatically make their connections fake. \n\nThere’s nothing I can argue that won’t make me sound spoiled so I’ll just drop it.",
                                                                                                                                            "author": "Sugarintheorange",
                                                                                                                                            "id": "jadtqbf",
                                                                                                                                            "parent_id": "t1_jadrxk2",
                                                                                                                                            "score": 1,
                                                                                                                                            "created_utc": 1677610002.0,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't know if this is a fair ask of an SB. I personally don't think it is, especially since we don't know whether this SD has a family of his own or anything like that. They seem to plan on remaining friends, which I think is the right move. If sexual chemistry exists, they can always go there if they want later, but it certainly shouldn't be an expectation or the norm.\n\nTWSD",
            "author": "3WaySD",
            "id": "jabw9zk",
            "parent_id": "t1_jablfir",
            "score": 21,
            "created_utc": 1677574682.0,
            "replies": [
                {
                    "body": "After 2.5 years I think it's not only fair to ask, it should be expected of a SB to offer. That's a ton of time to be supported and committed to someone.",
                    "author": "storm170",
                    "id": "jabws8k",
                    "parent_id": "t1_jabw9zk",
                    "score": -7,
                    "created_utc": 1677575135.0,
                    "replies": [
                        {
                            "body": "I mean, I'd love for this to be the case, but even in a vanilla relationship, women leave if they feel they're not being provided for. I'm not knocking it, that's what women look for in a relationship and feel loved when they feel safe and cared for. I'm not sure how many SBs would stay if the sugar stopped. They'd have to be really special to do so!",
                            "author": "3WaySD",
                            "id": "jac42f6",
                            "parent_id": "t1_jabws8k",
                            "score": 15,
                            "created_utc": 1677581471.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "jacyx33",
                    "parent_id": "t1_jabw9zk",
                    "score": -1,
                    "created_utc": 1677598193.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "jadebo0",
                            "parent_id": "t1_jacyx33",
                            "score": 3,
                            "created_utc": 1677604192.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "jadhv7q",
                                    "parent_id": "t1_jadebo0",
                                    "score": 1,
                                    "created_utc": 1677605532.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I mean the advice on this sub is usually along those lines if SBs stop providing initimacy or stop making meets. It’s usually stop allowance and move to ppm again that will guarantee her not cancelling more or dump her",
                            "author": "Sugarintheorange",
                            "id": "jad34qw",
                            "parent_id": "t1_jacyx33",
                            "score": 0,
                            "created_utc": 1677599850.0,
                            "replies": []
                        },
                        {
                            "body": "Yes, why should the SD provide sugar if he's not getting any in return. He can continue seeing her platonically if he wants,  but this is why I say define an SR at the start, make sure each party is intimately aware of WHAT will constitute the SR and HOW much the SB will be provided when the SR is FULLY in place.\n\nJust my $0.02\n\nTWSD",
                            "author": "3WaySD",
                            "id": "jaes5vn",
                            "parent_id": "t1_jacyx33",
                            "score": 1,
                            "created_utc": 1677623282.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't think many SD's would keep providing sugar - indefinitely - to a SB who could no longer spend time with them or be intimate, regardless of whether they've been together 2.5 years or not. That's reasonable, and it's the same the other way too.",
            "author": "coolpink_",
            "id": "jac8esh",
            "parent_id": "t1_jablfir",
            "score": 14,
            "created_utc": 1677584840.0,
            "replies": [
                {
                    "body": "A couple months until he gets a new job is not out of the question though. Probably take her that long to find another SD anyway.  Sounds more like he just wants to end things though.",
                    "author": "sirthunksalot",
                    "id": "jad3aw5",
                    "parent_id": "t1_jac8esh",
                    "score": 2,
                    "created_utc": 1677599916.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Would you continue to date a SB who has gained 100lbs while she loses the weight?",
            "author": "Mindless-Clock-2393",
            "id": "jacryb4",
            "parent_id": "t1_jablfir",
            "score": 5,
            "created_utc": 1677595298.0,
            "replies": [
                {
                    "body": "For a while yes. If she got it from health reasons (medication) then yes. I would be supportive of her loosing that weight as it would lead to longer term health implications.",
                    "author": "C12H22O11-EU",
                    "id": "jaf0ocz",
                    "parent_id": "t1_jacryb4",
                    "score": 1,
                    "created_utc": 1677626891.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Completely agree, and lol, the #Truth thing was mainly to make fun of a \"just previous\" convo one of the posters and I had had like moments before on a different thread of why I hate snapchat so much, where he saw a benny in that it deletes your messages, to me that is one of the maddening things about it. I use text (since a lot of my conversations with an SB are via it) to roll back and use it to refresh my memory on like say her ring she wanted me to see, etc. :)",
            "author": "SDInLeather",
            "id": "jae5p6q",
            "parent_id": "t1_jadj912",
            "score": 3,
            "created_utc": 1677614531.0,
            "replies": [
                {
                    "body": "You can save the texts on snapchat. It doesnt have to disappear. Just tap on the chat itself and it highlights them and saves them",
                    "author": "thedoctor321",
                    "id": "jaglts8",
                    "parent_id": "t1_jae5p6q",
                    "score": 1,
                    "created_utc": 1677656714.0,
                    "replies": [
                        {
                            "body": "Thanks, I probably also should say that, I like using GV and have no reason to stop using it. Old dog...;)",
                            "author": "SDInLeather",
                            "id": "jah4o0g",
                            "parent_id": "t1_jaglts8",
                            "score": 2,
                            "created_utc": 1677671972.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ah ok, apologies for the negative speculation ams I'm sorry to hear that for you.. 🥺 If you've had a multi year arrangement, you are a rare SB :)\n\nMaybe when he recovers financially, he may come back out of retirement? Although you may be happily in a, let's hope, even better SR by then 😌",
            "author": "Worldly-wanderer",
            "id": "jaboms5",
            "parent_id": "t1_jabo5wn",
            "score": 4,
            "created_utc": 1677568418.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "jaddvn5",
            "parent_id": "t1_jabu0w2",
            "score": 0,
            "created_utc": 1677604023.0,
            "replies": [
                {
                    "body": "“I believe in both ways. Don't keep a SB that isn't getting you off, don't keep a SD that isn't providing” you just said this in another comment ? \n\nAlso you didn’t answer the question, should the sb not make rent while the SD lives comfortably in the name of for richer or poorer ? \n\nIt doesn’t make sense that SBs are heartless monsters for politely moving on when their SDs can’t afford them anymore and don’t see it as a real relationship but SDs are well within their rights to end the relationship for lack of meets or lack of intimacy.",
                    "author": "Sugarintheorange",
                    "id": "jadf7yh",
                    "parent_id": "t1_jaddvn5",
                    "score": 1,
                    "created_utc": 1677604535.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "jadfiws",
                            "parent_id": "t1_jadf7yh",
                            "score": 0,
                            "created_utc": 1677604653.0,
                            "replies": [
                                {
                                    "body": "So what would you consider a real relationship within the sugar context ? Does it include SDs who eventually start having less sex with their SBs and SBs who don’t get allowances or assistance ?",
                                    "author": "Sugarintheorange",
                                    "id": "jadfuok",
                                    "parent_id": "t1_jadfiws",
                                    "score": 1,
                                    "created_utc": 1677604778.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "jadg3ez",
                                            "parent_id": "t1_jadfuok",
                                            "score": 1,
                                            "created_utc": 1677604868.0,
                                            "replies": [
                                                {
                                                    "body": "I mean you’re the one who said that you’d be hurt if your sb ended the relationship due to no longer receiving an allowance and implied it shows it’s not real. Why would you be hurt if the “transaction “ of an SR makes it not a real relationship? Would you stay in an SR where you stopped getting sex would you feel offended if the sb was hurt you stopped providing allowance? \n\nI’m not trying to argue I’m  just trying to understand your perspective since it seems liek one quite a few SDs share. Is it only transactional when the Sb still wants to maintain the financial arrangement or does it count for SDs who withdraw support due to lacking on the sexual side?",
                                                    "author": "Sugarintheorange",
                                                    "id": "jadgyg7",
                                                    "parent_id": "t1_jadg3ez",
                                                    "score": 1,
                                                    "created_utc": 1677605192.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "jadh5t1",
                                                            "parent_id": "t1_jadgyg7",
                                                            "score": 1,
                                                            "created_utc": 1677605268.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Oops I thought you were the original commenter I replied to so this entire conversation is moot. Sorry .\n\nBut also I don’t see it as a job. I sugar cause it’s fun and it’s how a lot of people I know date, they just don’t call it sugaring. In countries liek the US and Germany splitting things 50/50 is becoming/ is the norm. In other cultures it’s still the norm for the man to provide. It’s just dating in the way I like",
                                                                    "author": "Sugarintheorange",
                                                                    "id": "jadhzad",
                                                                    "parent_id": "t1_jadh5t1",
                                                                    "score": 2,
                                                                    "created_utc": 1677605573.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[removed]",
                                                                            "author": null,
                                                                            "id": "jadi591",
                                                                            "parent_id": "t1_jadhzad",
                                                                            "score": 1,
                                                                            "created_utc": 1677605636.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Depends how you sugar date. If you think sugar dating is just going out with any man that will pay you to be around him that you and your SRs I guess. \n\nAccording to the definition of sugar dating of this sub my mom was and would sort of still be my dads SB and they’ve been married over 20 years. That’s how I sugar date, calling it sugaring doesn’t automatically make a relationship with a providing man any less of a relationship. Also I’d love to hear of jobs where you can get paid a lot to have fun for hours",
                                                                                    "author": "Sugarintheorange",
                                                                                    "id": "jadj2m1",
                                                                                    "parent_id": "t1_jadi591",
                                                                                    "score": 1,
                                                                                    "created_utc": 1677605987.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[removed]",
                                                                                            "author": null,
                                                                                            "id": "jadjvd6",
                                                                                            "parent_id": "t1_jadj2m1",
                                                                                            "score": 1,
                                                                                            "created_utc": 1677606289.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "I wouldn’t go out with a guy who couldn’t afford dates vanilla or not. My friends have “gf allowances” and they’re dating guys their own age, our family friend gets a monthly allowance as a wife of over 30 years. It’s  not necessarily out of the norm. \n\nShe had 3 suitors and they all took her on holiday and she chose my dad. It’s not a moral dilemma when all your men are the same standard. Her dad also provided for her mom. It’s not exactly a new or shameful thing .\n\nAgain if that’s how your SRs are then so be it. Sugaring is a great way to ensure you don’t have to deal with bill hagglers and guys who are actually willing to provide \n\nAgain fun all has to do with what kind of person you are, interests, how you are raised etc. I consider my dates fun. If that’s how you sugar date that’s on you. I don’t need the money my parents cover everything, SRs are fun  and hot imo and there’s a level of honesty that’s difficult with vanilla sometimes moz",
                                                                                                    "author": "Sugarintheorange",
                                                                                                    "id": "jadnt0o",
                                                                                                    "parent_id": "t1_jadjvd6",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1677607767.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "[removed]",
                                                                                                            "author": null,
                                                                                                            "id": "jadoiez",
                                                                                                            "parent_id": "t1_jadnt0o",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1677608036.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "I wouldn’t say rich at all. I also wouldn’t judge SBs who “need” the money or consider their relationships fake. \n\nAlso if you’ve grown up in that situation, I don’t know your life but I’m going to assume you’ve also encountered sb situations with your own parents which possibly inspire your participation in this lifestyle?",
                                                                                                                    "author": "Sugarintheorange",
                                                                                                                    "id": "jadpx6y",
                                                                                                                    "parent_id": "t1_jadoiez",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1677608568.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "[removed]",
                                                                                                                            "author": null,
                                                                                                                            "id": "jadrxk2",
                                                                                                                            "parent_id": "t1_jadpx6y",
                                                                                                                            "score": 1,
                                                                                                                            "created_utc": 1677609328.0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "body": "I thought you were a jaded older guy, I did not realise we were the same age. But anyway the point I was gonna make is that people can be in this lifestyle for all different reasons it doesn’t automatically make their connections fake. \n\nThere’s nothing I can argue that won’t make me sound spoiled so I’ll just drop it.",
                                                                                                                                    "author": "Sugarintheorange",
                                                                                                                                    "id": "jadtqbf",
                                                                                                                                    "parent_id": "t1_jadrxk2",
                                                                                                                                    "score": 1,
                                                                                                                                    "created_utc": 1677610002.0,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "After 2.5 years I think it's not only fair to ask, it should be expected of a SB to offer. That's a ton of time to be supported and committed to someone.",
            "author": "storm170",
            "id": "jabws8k",
            "parent_id": "t1_jabw9zk",
            "score": -7,
            "created_utc": 1677575135.0,
            "replies": [
                {
                    "body": "I mean, I'd love for this to be the case, but even in a vanilla relationship, women leave if they feel they're not being provided for. I'm not knocking it, that's what women look for in a relationship and feel loved when they feel safe and cared for. I'm not sure how many SBs would stay if the sugar stopped. They'd have to be really special to do so!",
                    "author": "3WaySD",
                    "id": "jac42f6",
                    "parent_id": "t1_jabws8k",
                    "score": 15,
                    "created_utc": 1677581471.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "jacyx33",
            "parent_id": "t1_jabw9zk",
            "score": -1,
            "created_utc": 1677598193.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "jadebo0",
                    "parent_id": "t1_jacyx33",
                    "score": 3,
                    "created_utc": 1677604192.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "jadhv7q",
                            "parent_id": "t1_jadebo0",
                            "score": 1,
                            "created_utc": 1677605532.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I mean the advice on this sub is usually along those lines if SBs stop providing initimacy or stop making meets. It’s usually stop allowance and move to ppm again that will guarantee her not cancelling more or dump her",
                    "author": "Sugarintheorange",
                    "id": "jad34qw",
                    "parent_id": "t1_jacyx33",
                    "score": 0,
                    "created_utc": 1677599850.0,
                    "replies": []
                },
                {
                    "body": "Yes, why should the SD provide sugar if he's not getting any in return. He can continue seeing her platonically if he wants,  but this is why I say define an SR at the start, make sure each party is intimately aware of WHAT will constitute the SR and HOW much the SB will be provided when the SR is FULLY in place.\n\nJust my $0.02\n\nTWSD",
                    "author": "3WaySD",
                    "id": "jaes5vn",
                    "parent_id": "t1_jacyx33",
                    "score": 1,
                    "created_utc": 1677623282.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A couple months until he gets a new job is not out of the question though. Probably take her that long to find another SD anyway.  Sounds more like he just wants to end things though.",
            "author": "sirthunksalot",
            "id": "jad3aw5",
            "parent_id": "t1_jac8esh",
            "score": 2,
            "created_utc": 1677599916.0,
            "replies": []
        },
        {
            "body": "For a while yes. If she got it from health reasons (medication) then yes. I would be supportive of her loosing that weight as it would lead to longer term health implications.",
            "author": "C12H22O11-EU",
            "id": "jaf0ocz",
            "parent_id": "t1_jacryb4",
            "score": 1,
            "created_utc": 1677626891.0,
            "replies": []
        },
        {
            "body": "You can save the texts on snapchat. It doesnt have to disappear. Just tap on the chat itself and it highlights them and saves them",
            "author": "thedoctor321",
            "id": "jaglts8",
            "parent_id": "t1_jae5p6q",
            "score": 1,
            "created_utc": 1677656714.0,
            "replies": [
                {
                    "body": "Thanks, I probably also should say that, I like using GV and have no reason to stop using it. Old dog...;)",
                    "author": "SDInLeather",
                    "id": "jah4o0g",
                    "parent_id": "t1_jaglts8",
                    "score": 2,
                    "created_utc": 1677671972.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“I believe in both ways. Don't keep a SB that isn't getting you off, don't keep a SD that isn't providing” you just said this in another comment ? \n\nAlso you didn’t answer the question, should the sb not make rent while the SD lives comfortably in the name of for richer or poorer ? \n\nIt doesn’t make sense that SBs are heartless monsters for politely moving on when their SDs can’t afford them anymore and don’t see it as a real relationship but SDs are well within their rights to end the relationship for lack of meets or lack of intimacy.",
            "author": "Sugarintheorange",
            "id": "jadf7yh",
            "parent_id": "t1_jaddvn5",
            "score": 1,
            "created_utc": 1677604535.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "jadfiws",
                    "parent_id": "t1_jadf7yh",
                    "score": 0,
                    "created_utc": 1677604653.0,
                    "replies": [
                        {
                            "body": "So what would you consider a real relationship within the sugar context ? Does it include SDs who eventually start having less sex with their SBs and SBs who don’t get allowances or assistance ?",
                            "author": "Sugarintheorange",
                            "id": "jadfuok",
                            "parent_id": "t1_jadfiws",
                            "score": 1,
                            "created_utc": 1677604778.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "jadg3ez",
                                    "parent_id": "t1_jadfuok",
                                    "score": 1,
                                    "created_utc": 1677604868.0,
                                    "replies": [
                                        {
                                            "body": "I mean you’re the one who said that you’d be hurt if your sb ended the relationship due to no longer receiving an allowance and implied it shows it’s not real. Why would you be hurt if the “transaction “ of an SR makes it not a real relationship? Would you stay in an SR where you stopped getting sex would you feel offended if the sb was hurt you stopped providing allowance? \n\nI’m not trying to argue I’m  just trying to understand your perspective since it seems liek one quite a few SDs share. Is it only transactional when the Sb still wants to maintain the financial arrangement or does it count for SDs who withdraw support due to lacking on the sexual side?",
                                            "author": "Sugarintheorange",
                                            "id": "jadgyg7",
                                            "parent_id": "t1_jadg3ez",
                                            "score": 1,
                                            "created_utc": 1677605192.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "jadh5t1",
                                                    "parent_id": "t1_jadgyg7",
                                                    "score": 1,
                                                    "created_utc": 1677605268.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oops I thought you were the original commenter I replied to so this entire conversation is moot. Sorry .\n\nBut also I don’t see it as a job. I sugar cause it’s fun and it’s how a lot of people I know date, they just don’t call it sugaring. In countries liek the US and Germany splitting things 50/50 is becoming/ is the norm. In other cultures it’s still the norm for the man to provide. It’s just dating in the way I like",
                                                            "author": "Sugarintheorange",
                                                            "id": "jadhzad",
                                                            "parent_id": "t1_jadh5t1",
                                                            "score": 2,
                                                            "created_utc": 1677605573.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[removed]",
                                                                    "author": null,
                                                                    "id": "jadi591",
                                                                    "parent_id": "t1_jadhzad",
                                                                    "score": 1,
                                                                    "created_utc": 1677605636.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Depends how you sugar date. If you think sugar dating is just going out with any man that will pay you to be around him that you and your SRs I guess. \n\nAccording to the definition of sugar dating of this sub my mom was and would sort of still be my dads SB and they’ve been married over 20 years. That’s how I sugar date, calling it sugaring doesn’t automatically make a relationship with a providing man any less of a relationship. Also I’d love to hear of jobs where you can get paid a lot to have fun for hours",
                                                                            "author": "Sugarintheorange",
                                                                            "id": "jadj2m1",
                                                                            "parent_id": "t1_jadi591",
                                                                            "score": 1,
                                                                            "created_utc": 1677605987.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[removed]",
                                                                                    "author": null,
                                                                                    "id": "jadjvd6",
                                                                                    "parent_id": "t1_jadj2m1",
                                                                                    "score": 1,
                                                                                    "created_utc": 1677606289.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I wouldn’t go out with a guy who couldn’t afford dates vanilla or not. My friends have “gf allowances” and they’re dating guys their own age, our family friend gets a monthly allowance as a wife of over 30 years. It’s  not necessarily out of the norm. \n\nShe had 3 suitors and they all took her on holiday and she chose my dad. It’s not a moral dilemma when all your men are the same standard. Her dad also provided for her mom. It’s not exactly a new or shameful thing .\n\nAgain if that’s how your SRs are then so be it. Sugaring is a great way to ensure you don’t have to deal with bill hagglers and guys who are actually willing to provide \n\nAgain fun all has to do with what kind of person you are, interests, how you are raised etc. I consider my dates fun. If that’s how you sugar date that’s on you. I don’t need the money my parents cover everything, SRs are fun  and hot imo and there’s a level of honesty that’s difficult with vanilla sometimes moz",
                                                                                            "author": "Sugarintheorange",
                                                                                            "id": "jadnt0o",
                                                                                            "parent_id": "t1_jadjvd6",
                                                                                            "score": 1,
                                                                                            "created_utc": 1677607767.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "[removed]",
                                                                                                    "author": null,
                                                                                                    "id": "jadoiez",
                                                                                                    "parent_id": "t1_jadnt0o",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1677608036.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "I wouldn’t say rich at all. I also wouldn’t judge SBs who “need” the money or consider their relationships fake. \n\nAlso if you’ve grown up in that situation, I don’t know your life but I’m going to assume you’ve also encountered sb situations with your own parents which possibly inspire your participation in this lifestyle?",
                                                                                                            "author": "Sugarintheorange",
                                                                                                            "id": "jadpx6y",
                                                                                                            "parent_id": "t1_jadoiez",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1677608568.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "[removed]",
                                                                                                                    "author": null,
                                                                                                                    "id": "jadrxk2",
                                                                                                                    "parent_id": "t1_jadpx6y",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1677609328.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "I thought you were a jaded older guy, I did not realise we were the same age. But anyway the point I was gonna make is that people can be in this lifestyle for all different reasons it doesn’t automatically make their connections fake. \n\nThere’s nothing I can argue that won’t make me sound spoiled so I’ll just drop it.",
                                                                                                                            "author": "Sugarintheorange",
                                                                                                                            "id": "jadtqbf",
                                                                                                                            "parent_id": "t1_jadrxk2",
                                                                                                                            "score": 1,
                                                                                                                            "created_utc": 1677610002.0,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean, I'd love for this to be the case, but even in a vanilla relationship, women leave if they feel they're not being provided for. I'm not knocking it, that's what women look for in a relationship and feel loved when they feel safe and cared for. I'm not sure how many SBs would stay if the sugar stopped. They'd have to be really special to do so!",
            "author": "3WaySD",
            "id": "jac42f6",
            "parent_id": "t1_jabws8k",
            "score": 15,
            "created_utc": 1677581471.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "jadebo0",
            "parent_id": "t1_jacyx33",
            "score": 3,
            "created_utc": 1677604192.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "jadhv7q",
                    "parent_id": "t1_jadebo0",
                    "score": 1,
                    "created_utc": 1677605532.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean the advice on this sub is usually along those lines if SBs stop providing initimacy or stop making meets. It’s usually stop allowance and move to ppm again that will guarantee her not cancelling more or dump her",
            "author": "Sugarintheorange",
            "id": "jad34qw",
            "parent_id": "t1_jacyx33",
            "score": 0,
            "created_utc": 1677599850.0,
            "replies": []
        },
        {
            "body": "Yes, why should the SD provide sugar if he's not getting any in return. He can continue seeing her platonically if he wants,  but this is why I say define an SR at the start, make sure each party is intimately aware of WHAT will constitute the SR and HOW much the SB will be provided when the SR is FULLY in place.\n\nJust my $0.02\n\nTWSD",
            "author": "3WaySD",
            "id": "jaes5vn",
            "parent_id": "t1_jacyx33",
            "score": 1,
            "created_utc": 1677623282.0,
            "replies": []
        },
        {
            "body": "Thanks, I probably also should say that, I like using GV and have no reason to stop using it. Old dog...;)",
            "author": "SDInLeather",
            "id": "jah4o0g",
            "parent_id": "t1_jaglts8",
            "score": 2,
            "created_utc": 1677671972.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "jadfiws",
            "parent_id": "t1_jadf7yh",
            "score": 0,
            "created_utc": 1677604653.0,
            "replies": [
                {
                    "body": "So what would you consider a real relationship within the sugar context ? Does it include SDs who eventually start having less sex with their SBs and SBs who don’t get allowances or assistance ?",
                    "author": "Sugarintheorange",
                    "id": "jadfuok",
                    "parent_id": "t1_jadfiws",
                    "score": 1,
                    "created_utc": 1677604778.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "jadg3ez",
                            "parent_id": "t1_jadfuok",
                            "score": 1,
                            "created_utc": 1677604868.0,
                            "replies": [
                                {
                                    "body": "I mean you’re the one who said that you’d be hurt if your sb ended the relationship due to no longer receiving an allowance and implied it shows it’s not real. Why would you be hurt if the “transaction “ of an SR makes it not a real relationship? Would you stay in an SR where you stopped getting sex would you feel offended if the sb was hurt you stopped providing allowance? \n\nI’m not trying to argue I’m  just trying to understand your perspective since it seems liek one quite a few SDs share. Is it only transactional when the Sb still wants to maintain the financial arrangement or does it count for SDs who withdraw support due to lacking on the sexual side?",
                                    "author": "Sugarintheorange",
                                    "id": "jadgyg7",
                                    "parent_id": "t1_jadg3ez",
                                    "score": 1,
                                    "created_utc": 1677605192.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "jadh5t1",
                                            "parent_id": "t1_jadgyg7",
                                            "score": 1,
                                            "created_utc": 1677605268.0,
                                            "replies": [
                                                {
                                                    "body": "Oops I thought you were the original commenter I replied to so this entire conversation is moot. Sorry .\n\nBut also I don’t see it as a job. I sugar cause it’s fun and it’s how a lot of people I know date, they just don’t call it sugaring. In countries liek the US and Germany splitting things 50/50 is becoming/ is the norm. In other cultures it’s still the norm for the man to provide. It’s just dating in the way I like",
                                                    "author": "Sugarintheorange",
                                                    "id": "jadhzad",
                                                    "parent_id": "t1_jadh5t1",
                                                    "score": 2,
                                                    "created_utc": 1677605573.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "jadi591",
                                                            "parent_id": "t1_jadhzad",
                                                            "score": 1,
                                                            "created_utc": 1677605636.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Depends how you sugar date. If you think sugar dating is just going out with any man that will pay you to be around him that you and your SRs I guess. \n\nAccording to the definition of sugar dating of this sub my mom was and would sort of still be my dads SB and they’ve been married over 20 years. That’s how I sugar date, calling it sugaring doesn’t automatically make a relationship with a providing man any less of a relationship. Also I’d love to hear of jobs where you can get paid a lot to have fun for hours",
                                                                    "author": "Sugarintheorange",
                                                                    "id": "jadj2m1",
                                                                    "parent_id": "t1_jadi591",
                                                                    "score": 1,
                                                                    "created_utc": 1677605987.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[removed]",
                                                                            "author": null,
                                                                            "id": "jadjvd6",
                                                                            "parent_id": "t1_jadj2m1",
                                                                            "score": 1,
                                                                            "created_utc": 1677606289.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I wouldn’t go out with a guy who couldn’t afford dates vanilla or not. My friends have “gf allowances” and they’re dating guys their own age, our family friend gets a monthly allowance as a wife of over 30 years. It’s  not necessarily out of the norm. \n\nShe had 3 suitors and they all took her on holiday and she chose my dad. It’s not a moral dilemma when all your men are the same standard. Her dad also provided for her mom. It’s not exactly a new or shameful thing .\n\nAgain if that’s how your SRs are then so be it. Sugaring is a great way to ensure you don’t have to deal with bill hagglers and guys who are actually willing to provide \n\nAgain fun all has to do with what kind of person you are, interests, how you are raised etc. I consider my dates fun. If that’s how you sugar date that’s on you. I don’t need the money my parents cover everything, SRs are fun  and hot imo and there’s a level of honesty that’s difficult with vanilla sometimes moz",
                                                                                    "author": "Sugarintheorange",
                                                                                    "id": "jadnt0o",
                                                                                    "parent_id": "t1_jadjvd6",
                                                                                    "score": 1,
                                                                                    "created_utc": 1677607767.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[removed]",
                                                                                            "author": null,
                                                                                            "id": "jadoiez",
                                                                                            "parent_id": "t1_jadnt0o",
                                                                                            "score": 1,
                                                                                            "created_utc": 1677608036.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "I wouldn’t say rich at all. I also wouldn’t judge SBs who “need” the money or consider their relationships fake. \n\nAlso if you’ve grown up in that situation, I don’t know your life but I’m going to assume you’ve also encountered sb situations with your own parents which possibly inspire your participation in this lifestyle?",
                                                                                                    "author": "Sugarintheorange",
                                                                                                    "id": "jadpx6y",
                                                                                                    "parent_id": "t1_jadoiez",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1677608568.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "[removed]",
                                                                                                            "author": null,
                                                                                                            "id": "jadrxk2",
                                                                                                            "parent_id": "t1_jadpx6y",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1677609328.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "I thought you were a jaded older guy, I did not realise we were the same age. But anyway the point I was gonna make is that people can be in this lifestyle for all different reasons it doesn’t automatically make their connections fake. \n\nThere’s nothing I can argue that won’t make me sound spoiled so I’ll just drop it.",
                                                                                                                    "author": "Sugarintheorange",
                                                                                                                    "id": "jadtqbf",
                                                                                                                    "parent_id": "t1_jadrxk2",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1677610002.0,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "jadhv7q",
            "parent_id": "t1_jadebo0",
            "score": 1,
            "created_utc": 1677605532.0,
            "replies": []
        },
        {
            "body": "So what would you consider a real relationship within the sugar context ? Does it include SDs who eventually start having less sex with their SBs and SBs who don’t get allowances or assistance ?",
            "author": "Sugarintheorange",
            "id": "jadfuok",
            "parent_id": "t1_jadfiws",
            "score": 1,
            "created_utc": 1677604778.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "jadg3ez",
                    "parent_id": "t1_jadfuok",
                    "score": 1,
                    "created_utc": 1677604868.0,
                    "replies": [
                        {
                            "body": "I mean you’re the one who said that you’d be hurt if your sb ended the relationship due to no longer receiving an allowance and implied it shows it’s not real. Why would you be hurt if the “transaction “ of an SR makes it not a real relationship? Would you stay in an SR where you stopped getting sex would you feel offended if the sb was hurt you stopped providing allowance? \n\nI’m not trying to argue I’m  just trying to understand your perspective since it seems liek one quite a few SDs share. Is it only transactional when the Sb still wants to maintain the financial arrangement or does it count for SDs who withdraw support due to lacking on the sexual side?",
                            "author": "Sugarintheorange",
                            "id": "jadgyg7",
                            "parent_id": "t1_jadg3ez",
                            "score": 1,
                            "created_utc": 1677605192.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "jadh5t1",
                                    "parent_id": "t1_jadgyg7",
                                    "score": 1,
                                    "created_utc": 1677605268.0,
                                    "replies": [
                                        {
                                            "body": "Oops I thought you were the original commenter I replied to so this entire conversation is moot. Sorry .\n\nBut also I don’t see it as a job. I sugar cause it’s fun and it’s how a lot of people I know date, they just don’t call it sugaring. In countries liek the US and Germany splitting things 50/50 is becoming/ is the norm. In other cultures it’s still the norm for the man to provide. It’s just dating in the way I like",
                                            "author": "Sugarintheorange",
                                            "id": "jadhzad",
                                            "parent_id": "t1_jadh5t1",
                                            "score": 2,
                                            "created_utc": 1677605573.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "jadi591",
                                                    "parent_id": "t1_jadhzad",
                                                    "score": 1,
                                                    "created_utc": 1677605636.0,
                                                    "replies": [
                                                        {
                                                            "body": "Depends how you sugar date. If you think sugar dating is just going out with any man that will pay you to be around him that you and your SRs I guess. \n\nAccording to the definition of sugar dating of this sub my mom was and would sort of still be my dads SB and they’ve been married over 20 years. That’s how I sugar date, calling it sugaring doesn’t automatically make a relationship with a providing man any less of a relationship. Also I’d love to hear of jobs where you can get paid a lot to have fun for hours",
                                                            "author": "Sugarintheorange",
                                                            "id": "jadj2m1",
                                                            "parent_id": "t1_jadi591",
                                                            "score": 1,
                                                            "created_utc": 1677605987.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[removed]",
                                                                    "author": null,
                                                                    "id": "jadjvd6",
                                                                    "parent_id": "t1_jadj2m1",
                                                                    "score": 1,
                                                                    "created_utc": 1677606289.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I wouldn’t go out with a guy who couldn’t afford dates vanilla or not. My friends have “gf allowances” and they’re dating guys their own age, our family friend gets a monthly allowance as a wife of over 30 years. It’s  not necessarily out of the norm. \n\nShe had 3 suitors and they all took her on holiday and she chose my dad. It’s not a moral dilemma when all your men are the same standard. Her dad also provided for her mom. It’s not exactly a new or shameful thing .\n\nAgain if that’s how your SRs are then so be it. Sugaring is a great way to ensure you don’t have to deal with bill hagglers and guys who are actually willing to provide \n\nAgain fun all has to do with what kind of person you are, interests, how you are raised etc. I consider my dates fun. If that’s how you sugar date that’s on you. I don’t need the money my parents cover everything, SRs are fun  and hot imo and there’s a level of honesty that’s difficult with vanilla sometimes moz",
                                                                            "author": "Sugarintheorange",
                                                                            "id": "jadnt0o",
                                                                            "parent_id": "t1_jadjvd6",
                                                                            "score": 1,
                                                                            "created_utc": 1677607767.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[removed]",
                                                                                    "author": null,
                                                                                    "id": "jadoiez",
                                                                                    "parent_id": "t1_jadnt0o",
                                                                                    "score": 1,
                                                                                    "created_utc": 1677608036.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I wouldn’t say rich at all. I also wouldn’t judge SBs who “need” the money or consider their relationships fake. \n\nAlso if you’ve grown up in that situation, I don’t know your life but I’m going to assume you’ve also encountered sb situations with your own parents which possibly inspire your participation in this lifestyle?",
                                                                                            "author": "Sugarintheorange",
                                                                                            "id": "jadpx6y",
                                                                                            "parent_id": "t1_jadoiez",
                                                                                            "score": 1,
                                                                                            "created_utc": 1677608568.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "[removed]",
                                                                                                    "author": null,
                                                                                                    "id": "jadrxk2",
                                                                                                    "parent_id": "t1_jadpx6y",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1677609328.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "I thought you were a jaded older guy, I did not realise we were the same age. But anyway the point I was gonna make is that people can be in this lifestyle for all different reasons it doesn’t automatically make their connections fake. \n\nThere’s nothing I can argue that won’t make me sound spoiled so I’ll just drop it.",
                                                                                                            "author": "Sugarintheorange",
                                                                                                            "id": "jadtqbf",
                                                                                                            "parent_id": "t1_jadrxk2",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1677610002.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "jadg3ez",
            "parent_id": "t1_jadfuok",
            "score": 1,
            "created_utc": 1677604868.0,
            "replies": [
                {
                    "body": "I mean you’re the one who said that you’d be hurt if your sb ended the relationship due to no longer receiving an allowance and implied it shows it’s not real. Why would you be hurt if the “transaction “ of an SR makes it not a real relationship? Would you stay in an SR where you stopped getting sex would you feel offended if the sb was hurt you stopped providing allowance? \n\nI’m not trying to argue I’m  just trying to understand your perspective since it seems liek one quite a few SDs share. Is it only transactional when the Sb still wants to maintain the financial arrangement or does it count for SDs who withdraw support due to lacking on the sexual side?",
                    "author": "Sugarintheorange",
                    "id": "jadgyg7",
                    "parent_id": "t1_jadg3ez",
                    "score": 1,
                    "created_utc": 1677605192.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "jadh5t1",
                            "parent_id": "t1_jadgyg7",
                            "score": 1,
                            "created_utc": 1677605268.0,
                            "replies": [
                                {
                                    "body": "Oops I thought you were the original commenter I replied to so this entire conversation is moot. Sorry .\n\nBut also I don’t see it as a job. I sugar cause it’s fun and it’s how a lot of people I know date, they just don’t call it sugaring. In countries liek the US and Germany splitting things 50/50 is becoming/ is the norm. In other cultures it’s still the norm for the man to provide. It’s just dating in the way I like",
                                    "author": "Sugarintheorange",
                                    "id": "jadhzad",
                                    "parent_id": "t1_jadh5t1",
                                    "score": 2,
                                    "created_utc": 1677605573.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "jadi591",
                                            "parent_id": "t1_jadhzad",
                                            "score": 1,
                                            "created_utc": 1677605636.0,
                                            "replies": [
                                                {
                                                    "body": "Depends how you sugar date. If you think sugar dating is just going out with any man that will pay you to be around him that you and your SRs I guess. \n\nAccording to the definition of sugar dating of this sub my mom was and would sort of still be my dads SB and they’ve been married over 20 years. That’s how I sugar date, calling it sugaring doesn’t automatically make a relationship with a providing man any less of a relationship. Also I’d love to hear of jobs where you can get paid a lot to have fun for hours",
                                                    "author": "Sugarintheorange",
                                                    "id": "jadj2m1",
                                                    "parent_id": "t1_jadi591",
                                                    "score": 1,
                                                    "created_utc": 1677605987.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "jadjvd6",
                                                            "parent_id": "t1_jadj2m1",
                                                            "score": 1,
                                                            "created_utc": 1677606289.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I wouldn’t go out with a guy who couldn’t afford dates vanilla or not. My friends have “gf allowances” and they’re dating guys their own age, our family friend gets a monthly allowance as a wife of over 30 years. It’s  not necessarily out of the norm. \n\nShe had 3 suitors and they all took her on holiday and she chose my dad. It’s not a moral dilemma when all your men are the same standard. Her dad also provided for her mom. It’s not exactly a new or shameful thing .\n\nAgain if that’s how your SRs are then so be it. Sugaring is a great way to ensure you don’t have to deal with bill hagglers and guys who are actually willing to provide \n\nAgain fun all has to do with what kind of person you are, interests, how you are raised etc. I consider my dates fun. If that’s how you sugar date that’s on you. I don’t need the money my parents cover everything, SRs are fun  and hot imo and there’s a level of honesty that’s difficult with vanilla sometimes moz",
                                                                    "author": "Sugarintheorange",
                                                                    "id": "jadnt0o",
                                                                    "parent_id": "t1_jadjvd6",
                                                                    "score": 1,
                                                                    "created_utc": 1677607767.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[removed]",
                                                                            "author": null,
                                                                            "id": "jadoiez",
                                                                            "parent_id": "t1_jadnt0o",
                                                                            "score": 1,
                                                                            "created_utc": 1677608036.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I wouldn’t say rich at all. I also wouldn’t judge SBs who “need” the money or consider their relationships fake. \n\nAlso if you’ve grown up in that situation, I don’t know your life but I’m going to assume you’ve also encountered sb situations with your own parents which possibly inspire your participation in this lifestyle?",
                                                                                    "author": "Sugarintheorange",
                                                                                    "id": "jadpx6y",
                                                                                    "parent_id": "t1_jadoiez",
                                                                                    "score": 1,
                                                                                    "created_utc": 1677608568.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[removed]",
                                                                                            "author": null,
                                                                                            "id": "jadrxk2",
                                                                                            "parent_id": "t1_jadpx6y",
                                                                                            "score": 1,
                                                                                            "created_utc": 1677609328.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "I thought you were a jaded older guy, I did not realise we were the same age. But anyway the point I was gonna make is that people can be in this lifestyle for all different reasons it doesn’t automatically make their connections fake. \n\nThere’s nothing I can argue that won’t make me sound spoiled so I’ll just drop it.",
                                                                                                    "author": "Sugarintheorange",
                                                                                                    "id": "jadtqbf",
                                                                                                    "parent_id": "t1_jadrxk2",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1677610002.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean you’re the one who said that you’d be hurt if your sb ended the relationship due to no longer receiving an allowance and implied it shows it’s not real. Why would you be hurt if the “transaction “ of an SR makes it not a real relationship? Would you stay in an SR where you stopped getting sex would you feel offended if the sb was hurt you stopped providing allowance? \n\nI’m not trying to argue I’m  just trying to understand your perspective since it seems liek one quite a few SDs share. Is it only transactional when the Sb still wants to maintain the financial arrangement or does it count for SDs who withdraw support due to lacking on the sexual side?",
            "author": "Sugarintheorange",
            "id": "jadgyg7",
            "parent_id": "t1_jadg3ez",
            "score": 1,
            "created_utc": 1677605192.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "jadh5t1",
                    "parent_id": "t1_jadgyg7",
                    "score": 1,
                    "created_utc": 1677605268.0,
                    "replies": [
                        {
                            "body": "Oops I thought you were the original commenter I replied to so this entire conversation is moot. Sorry .\n\nBut also I don’t see it as a job. I sugar cause it’s fun and it’s how a lot of people I know date, they just don’t call it sugaring. In countries liek the US and Germany splitting things 50/50 is becoming/ is the norm. In other cultures it’s still the norm for the man to provide. It’s just dating in the way I like",
                            "author": "Sugarintheorange",
                            "id": "jadhzad",
                            "parent_id": "t1_jadh5t1",
                            "score": 2,
                            "created_utc": 1677605573.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "jadi591",
                                    "parent_id": "t1_jadhzad",
                                    "score": 1,
                                    "created_utc": 1677605636.0,
                                    "replies": [
                                        {
                                            "body": "Depends how you sugar date. If you think sugar dating is just going out with any man that will pay you to be around him that you and your SRs I guess. \n\nAccording to the definition of sugar dating of this sub my mom was and would sort of still be my dads SB and they’ve been married over 20 years. That’s how I sugar date, calling it sugaring doesn’t automatically make a relationship with a providing man any less of a relationship. Also I’d love to hear of jobs where you can get paid a lot to have fun for hours",
                                            "author": "Sugarintheorange",
                                            "id": "jadj2m1",
                                            "parent_id": "t1_jadi591",
                                            "score": 1,
                                            "created_utc": 1677605987.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "jadjvd6",
                                                    "parent_id": "t1_jadj2m1",
                                                    "score": 1,
                                                    "created_utc": 1677606289.0,
                                                    "replies": [
                                                        {
                                                            "body": "I wouldn’t go out with a guy who couldn’t afford dates vanilla or not. My friends have “gf allowances” and they’re dating guys their own age, our family friend gets a monthly allowance as a wife of over 30 years. It’s  not necessarily out of the norm. \n\nShe had 3 suitors and they all took her on holiday and she chose my dad. It’s not a moral dilemma when all your men are the same standard. Her dad also provided for her mom. It’s not exactly a new or shameful thing .\n\nAgain if that’s how your SRs are then so be it. Sugaring is a great way to ensure you don’t have to deal with bill hagglers and guys who are actually willing to provide \n\nAgain fun all has to do with what kind of person you are, interests, how you are raised etc. I consider my dates fun. If that’s how you sugar date that’s on you. I don’t need the money my parents cover everything, SRs are fun  and hot imo and there’s a level of honesty that’s difficult with vanilla sometimes moz",
                                                            "author": "Sugarintheorange",
                                                            "id": "jadnt0o",
                                                            "parent_id": "t1_jadjvd6",
                                                            "score": 1,
                                                            "created_utc": 1677607767.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[removed]",
                                                                    "author": null,
                                                                    "id": "jadoiez",
                                                                    "parent_id": "t1_jadnt0o",
                                                                    "score": 1,
                                                                    "created_utc": 1677608036.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I wouldn’t say rich at all. I also wouldn’t judge SBs who “need” the money or consider their relationships fake. \n\nAlso if you’ve grown up in that situation, I don’t know your life but I’m going to assume you’ve also encountered sb situations with your own parents which possibly inspire your participation in this lifestyle?",
                                                                            "author": "Sugarintheorange",
                                                                            "id": "jadpx6y",
                                                                            "parent_id": "t1_jadoiez",
                                                                            "score": 1,
                                                                            "created_utc": 1677608568.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[removed]",
                                                                                    "author": null,
                                                                                    "id": "jadrxk2",
                                                                                    "parent_id": "t1_jadpx6y",
                                                                                    "score": 1,
                                                                                    "created_utc": 1677609328.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I thought you were a jaded older guy, I did not realise we were the same age. But anyway the point I was gonna make is that people can be in this lifestyle for all different reasons it doesn’t automatically make their connections fake. \n\nThere’s nothing I can argue that won’t make me sound spoiled so I’ll just drop it.",
                                                                                            "author": "Sugarintheorange",
                                                                                            "id": "jadtqbf",
                                                                                            "parent_id": "t1_jadrxk2",
                                                                                            "score": 1,
                                                                                            "created_utc": 1677610002.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "jadh5t1",
            "parent_id": "t1_jadgyg7",
            "score": 1,
            "created_utc": 1677605268.0,
            "replies": [
                {
                    "body": "Oops I thought you were the original commenter I replied to so this entire conversation is moot. Sorry .\n\nBut also I don’t see it as a job. I sugar cause it’s fun and it’s how a lot of people I know date, they just don’t call it sugaring. In countries liek the US and Germany splitting things 50/50 is becoming/ is the norm. In other cultures it’s still the norm for the man to provide. It’s just dating in the way I like",
                    "author": "Sugarintheorange",
                    "id": "jadhzad",
                    "parent_id": "t1_jadh5t1",
                    "score": 2,
                    "created_utc": 1677605573.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "jadi591",
                            "parent_id": "t1_jadhzad",
                            "score": 1,
                            "created_utc": 1677605636.0,
                            "replies": [
                                {
                                    "body": "Depends how you sugar date. If you think sugar dating is just going out with any man that will pay you to be around him that you and your SRs I guess. \n\nAccording to the definition of sugar dating of this sub my mom was and would sort of still be my dads SB and they’ve been married over 20 years. That’s how I sugar date, calling it sugaring doesn’t automatically make a relationship with a providing man any less of a relationship. Also I’d love to hear of jobs where you can get paid a lot to have fun for hours",
                                    "author": "Sugarintheorange",
                                    "id": "jadj2m1",
                                    "parent_id": "t1_jadi591",
                                    "score": 1,
                                    "created_utc": 1677605987.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "jadjvd6",
                                            "parent_id": "t1_jadj2m1",
                                            "score": 1,
                                            "created_utc": 1677606289.0,
                                            "replies": [
                                                {
                                                    "body": "I wouldn’t go out with a guy who couldn’t afford dates vanilla or not. My friends have “gf allowances” and they’re dating guys their own age, our family friend gets a monthly allowance as a wife of over 30 years. It’s  not necessarily out of the norm. \n\nShe had 3 suitors and they all took her on holiday and she chose my dad. It’s not a moral dilemma when all your men are the same standard. Her dad also provided for her mom. It’s not exactly a new or shameful thing .\n\nAgain if that’s how your SRs are then so be it. Sugaring is a great way to ensure you don’t have to deal with bill hagglers and guys who are actually willing to provide \n\nAgain fun all has to do with what kind of person you are, interests, how you are raised etc. I consider my dates fun. If that’s how you sugar date that’s on you. I don’t need the money my parents cover everything, SRs are fun  and hot imo and there’s a level of honesty that’s difficult with vanilla sometimes moz",
                                                    "author": "Sugarintheorange",
                                                    "id": "jadnt0o",
                                                    "parent_id": "t1_jadjvd6",
                                                    "score": 1,
                                                    "created_utc": 1677607767.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "jadoiez",
                                                            "parent_id": "t1_jadnt0o",
                                                            "score": 1,
                                                            "created_utc": 1677608036.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I wouldn’t say rich at all. I also wouldn’t judge SBs who “need” the money or consider their relationships fake. \n\nAlso if you’ve grown up in that situation, I don’t know your life but I’m going to assume you’ve also encountered sb situations with your own parents which possibly inspire your participation in this lifestyle?",
                                                                    "author": "Sugarintheorange",
                                                                    "id": "jadpx6y",
                                                                    "parent_id": "t1_jadoiez",
                                                                    "score": 1,
                                                                    "created_utc": 1677608568.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[removed]",
                                                                            "author": null,
                                                                            "id": "jadrxk2",
                                                                            "parent_id": "t1_jadpx6y",
                                                                            "score": 1,
                                                                            "created_utc": 1677609328.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I thought you were a jaded older guy, I did not realise we were the same age. But anyway the point I was gonna make is that people can be in this lifestyle for all different reasons it doesn’t automatically make their connections fake. \n\nThere’s nothing I can argue that won’t make me sound spoiled so I’ll just drop it.",
                                                                                    "author": "Sugarintheorange",
                                                                                    "id": "jadtqbf",
                                                                                    "parent_id": "t1_jadrxk2",
                                                                                    "score": 1,
                                                                                    "created_utc": 1677610002.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oops I thought you were the original commenter I replied to so this entire conversation is moot. Sorry .\n\nBut also I don’t see it as a job. I sugar cause it’s fun and it’s how a lot of people I know date, they just don’t call it sugaring. In countries liek the US and Germany splitting things 50/50 is becoming/ is the norm. In other cultures it’s still the norm for the man to provide. It’s just dating in the way I like",
            "author": "Sugarintheorange",
            "id": "jadhzad",
            "parent_id": "t1_jadh5t1",
            "score": 2,
            "created_utc": 1677605573.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "jadi591",
                    "parent_id": "t1_jadhzad",
                    "score": 1,
                    "created_utc": 1677605636.0,
                    "replies": [
                        {
                            "body": "Depends how you sugar date. If you think sugar dating is just going out with any man that will pay you to be around him that you and your SRs I guess. \n\nAccording to the definition of sugar dating of this sub my mom was and would sort of still be my dads SB and they’ve been married over 20 years. That’s how I sugar date, calling it sugaring doesn’t automatically make a relationship with a providing man any less of a relationship. Also I’d love to hear of jobs where you can get paid a lot to have fun for hours",
                            "author": "Sugarintheorange",
                            "id": "jadj2m1",
                            "parent_id": "t1_jadi591",
                            "score": 1,
                            "created_utc": 1677605987.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "jadjvd6",
                                    "parent_id": "t1_jadj2m1",
                                    "score": 1,
                                    "created_utc": 1677606289.0,
                                    "replies": [
                                        {
                                            "body": "I wouldn’t go out with a guy who couldn’t afford dates vanilla or not. My friends have “gf allowances” and they’re dating guys their own age, our family friend gets a monthly allowance as a wife of over 30 years. It’s  not necessarily out of the norm. \n\nShe had 3 suitors and they all took her on holiday and she chose my dad. It’s not a moral dilemma when all your men are the same standard. Her dad also provided for her mom. It’s not exactly a new or shameful thing .\n\nAgain if that’s how your SRs are then so be it. Sugaring is a great way to ensure you don’t have to deal with bill hagglers and guys who are actually willing to provide \n\nAgain fun all has to do with what kind of person you are, interests, how you are raised etc. I consider my dates fun. If that’s how you sugar date that’s on you. I don’t need the money my parents cover everything, SRs are fun  and hot imo and there’s a level of honesty that’s difficult with vanilla sometimes moz",
                                            "author": "Sugarintheorange",
                                            "id": "jadnt0o",
                                            "parent_id": "t1_jadjvd6",
                                            "score": 1,
                                            "created_utc": 1677607767.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "jadoiez",
                                                    "parent_id": "t1_jadnt0o",
                                                    "score": 1,
                                                    "created_utc": 1677608036.0,
                                                    "replies": [
                                                        {
                                                            "body": "I wouldn’t say rich at all. I also wouldn’t judge SBs who “need” the money or consider their relationships fake. \n\nAlso if you’ve grown up in that situation, I don’t know your life but I’m going to assume you’ve also encountered sb situations with your own parents which possibly inspire your participation in this lifestyle?",
                                                            "author": "Sugarintheorange",
                                                            "id": "jadpx6y",
                                                            "parent_id": "t1_jadoiez",
                                                            "score": 1,
                                                            "created_utc": 1677608568.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[removed]",
                                                                    "author": null,
                                                                    "id": "jadrxk2",
                                                                    "parent_id": "t1_jadpx6y",
                                                                    "score": 1,
                                                                    "created_utc": 1677609328.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I thought you were a jaded older guy, I did not realise we were the same age. But anyway the point I was gonna make is that people can be in this lifestyle for all different reasons it doesn’t automatically make their connections fake. \n\nThere’s nothing I can argue that won’t make me sound spoiled so I’ll just drop it.",
                                                                            "author": "Sugarintheorange",
                                                                            "id": "jadtqbf",
                                                                            "parent_id": "t1_jadrxk2",
                                                                            "score": 1,
                                                                            "created_utc": 1677610002.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "jadi591",
            "parent_id": "t1_jadhzad",
            "score": 1,
            "created_utc": 1677605636.0,
            "replies": [
                {
                    "body": "Depends how you sugar date. If you think sugar dating is just going out with any man that will pay you to be around him that you and your SRs I guess. \n\nAccording to the definition of sugar dating of this sub my mom was and would sort of still be my dads SB and they’ve been married over 20 years. That’s how I sugar date, calling it sugaring doesn’t automatically make a relationship with a providing man any less of a relationship. Also I’d love to hear of jobs where you can get paid a lot to have fun for hours",
                    "author": "Sugarintheorange",
                    "id": "jadj2m1",
                    "parent_id": "t1_jadi591",
                    "score": 1,
                    "created_utc": 1677605987.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "jadjvd6",
                            "parent_id": "t1_jadj2m1",
                            "score": 1,
                            "created_utc": 1677606289.0,
                            "replies": [
                                {
                                    "body": "I wouldn’t go out with a guy who couldn’t afford dates vanilla or not. My friends have “gf allowances” and they’re dating guys their own age, our family friend gets a monthly allowance as a wife of over 30 years. It’s  not necessarily out of the norm. \n\nShe had 3 suitors and they all took her on holiday and she chose my dad. It’s not a moral dilemma when all your men are the same standard. Her dad also provided for her mom. It’s not exactly a new or shameful thing .\n\nAgain if that’s how your SRs are then so be it. Sugaring is a great way to ensure you don’t have to deal with bill hagglers and guys who are actually willing to provide \n\nAgain fun all has to do with what kind of person you are, interests, how you are raised etc. I consider my dates fun. If that’s how you sugar date that’s on you. I don’t need the money my parents cover everything, SRs are fun  and hot imo and there’s a level of honesty that’s difficult with vanilla sometimes moz",
                                    "author": "Sugarintheorange",
                                    "id": "jadnt0o",
                                    "parent_id": "t1_jadjvd6",
                                    "score": 1,
                                    "created_utc": 1677607767.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "jadoiez",
                                            "parent_id": "t1_jadnt0o",
                                            "score": 1,
                                            "created_utc": 1677608036.0,
                                            "replies": [
                                                {
                                                    "body": "I wouldn’t say rich at all. I also wouldn’t judge SBs who “need” the money or consider their relationships fake. \n\nAlso if you’ve grown up in that situation, I don’t know your life but I’m going to assume you’ve also encountered sb situations with your own parents which possibly inspire your participation in this lifestyle?",
                                                    "author": "Sugarintheorange",
                                                    "id": "jadpx6y",
                                                    "parent_id": "t1_jadoiez",
                                                    "score": 1,
                                                    "created_utc": 1677608568.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "jadrxk2",
                                                            "parent_id": "t1_jadpx6y",
                                                            "score": 1,
                                                            "created_utc": 1677609328.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I thought you were a jaded older guy, I did not realise we were the same age. But anyway the point I was gonna make is that people can be in this lifestyle for all different reasons it doesn’t automatically make their connections fake. \n\nThere’s nothing I can argue that won’t make me sound spoiled so I’ll just drop it.",
                                                                    "author": "Sugarintheorange",
                                                                    "id": "jadtqbf",
                                                                    "parent_id": "t1_jadrxk2",
                                                                    "score": 1,
                                                                    "created_utc": 1677610002.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Depends how you sugar date. If you think sugar dating is just going out with any man that will pay you to be around him that you and your SRs I guess. \n\nAccording to the definition of sugar dating of this sub my mom was and would sort of still be my dads SB and they’ve been married over 20 years. That’s how I sugar date, calling it sugaring doesn’t automatically make a relationship with a providing man any less of a relationship. Also I’d love to hear of jobs where you can get paid a lot to have fun for hours",
            "author": "Sugarintheorange",
            "id": "jadj2m1",
            "parent_id": "t1_jadi591",
            "score": 1,
            "created_utc": 1677605987.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "jadjvd6",
                    "parent_id": "t1_jadj2m1",
                    "score": 1,
                    "created_utc": 1677606289.0,
                    "replies": [
                        {
                            "body": "I wouldn’t go out with a guy who couldn’t afford dates vanilla or not. My friends have “gf allowances” and they’re dating guys their own age, our family friend gets a monthly allowance as a wife of over 30 years. It’s  not necessarily out of the norm. \n\nShe had 3 suitors and they all took her on holiday and she chose my dad. It’s not a moral dilemma when all your men are the same standard. Her dad also provided for her mom. It’s not exactly a new or shameful thing .\n\nAgain if that’s how your SRs are then so be it. Sugaring is a great way to ensure you don’t have to deal with bill hagglers and guys who are actually willing to provide \n\nAgain fun all has to do with what kind of person you are, interests, how you are raised etc. I consider my dates fun. If that’s how you sugar date that’s on you. I don’t need the money my parents cover everything, SRs are fun  and hot imo and there’s a level of honesty that’s difficult with vanilla sometimes moz",
                            "author": "Sugarintheorange",
                            "id": "jadnt0o",
                            "parent_id": "t1_jadjvd6",
                            "score": 1,
                            "created_utc": 1677607767.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "jadoiez",
                                    "parent_id": "t1_jadnt0o",
                                    "score": 1,
                                    "created_utc": 1677608036.0,
                                    "replies": [
                                        {
                                            "body": "I wouldn’t say rich at all. I also wouldn’t judge SBs who “need” the money or consider their relationships fake. \n\nAlso if you’ve grown up in that situation, I don’t know your life but I’m going to assume you’ve also encountered sb situations with your own parents which possibly inspire your participation in this lifestyle?",
                                            "author": "Sugarintheorange",
                                            "id": "jadpx6y",
                                            "parent_id": "t1_jadoiez",
                                            "score": 1,
                                            "created_utc": 1677608568.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "jadrxk2",
                                                    "parent_id": "t1_jadpx6y",
                                                    "score": 1,
                                                    "created_utc": 1677609328.0,
                                                    "replies": [
                                                        {
                                                            "body": "I thought you were a jaded older guy, I did not realise we were the same age. But anyway the point I was gonna make is that people can be in this lifestyle for all different reasons it doesn’t automatically make their connections fake. \n\nThere’s nothing I can argue that won’t make me sound spoiled so I’ll just drop it.",
                                                            "author": "Sugarintheorange",
                                                            "id": "jadtqbf",
                                                            "parent_id": "t1_jadrxk2",
                                                            "score": 1,
                                                            "created_utc": 1677610002.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "jadjvd6",
            "parent_id": "t1_jadj2m1",
            "score": 1,
            "created_utc": 1677606289.0,
            "replies": [
                {
                    "body": "I wouldn’t go out with a guy who couldn’t afford dates vanilla or not. My friends have “gf allowances” and they’re dating guys their own age, our family friend gets a monthly allowance as a wife of over 30 years. It’s  not necessarily out of the norm. \n\nShe had 3 suitors and they all took her on holiday and she chose my dad. It’s not a moral dilemma when all your men are the same standard. Her dad also provided for her mom. It’s not exactly a new or shameful thing .\n\nAgain if that’s how your SRs are then so be it. Sugaring is a great way to ensure you don’t have to deal with bill hagglers and guys who are actually willing to provide \n\nAgain fun all has to do with what kind of person you are, interests, how you are raised etc. I consider my dates fun. If that’s how you sugar date that’s on you. I don’t need the money my parents cover everything, SRs are fun  and hot imo and there’s a level of honesty that’s difficult with vanilla sometimes moz",
                    "author": "Sugarintheorange",
                    "id": "jadnt0o",
                    "parent_id": "t1_jadjvd6",
                    "score": 1,
                    "created_utc": 1677607767.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "jadoiez",
                            "parent_id": "t1_jadnt0o",
                            "score": 1,
                            "created_utc": 1677608036.0,
                            "replies": [
                                {
                                    "body": "I wouldn’t say rich at all. I also wouldn’t judge SBs who “need” the money or consider their relationships fake. \n\nAlso if you’ve grown up in that situation, I don’t know your life but I’m going to assume you’ve also encountered sb situations with your own parents which possibly inspire your participation in this lifestyle?",
                                    "author": "Sugarintheorange",
                                    "id": "jadpx6y",
                                    "parent_id": "t1_jadoiez",
                                    "score": 1,
                                    "created_utc": 1677608568.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "jadrxk2",
                                            "parent_id": "t1_jadpx6y",
                                            "score": 1,
                                            "created_utc": 1677609328.0,
                                            "replies": [
                                                {
                                                    "body": "I thought you were a jaded older guy, I did not realise we were the same age. But anyway the point I was gonna make is that people can be in this lifestyle for all different reasons it doesn’t automatically make their connections fake. \n\nThere’s nothing I can argue that won’t make me sound spoiled so I’ll just drop it.",
                                                    "author": "Sugarintheorange",
                                                    "id": "jadtqbf",
                                                    "parent_id": "t1_jadrxk2",
                                                    "score": 1,
                                                    "created_utc": 1677610002.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wouldn’t go out with a guy who couldn’t afford dates vanilla or not. My friends have “gf allowances” and they’re dating guys their own age, our family friend gets a monthly allowance as a wife of over 30 years. It’s  not necessarily out of the norm. \n\nShe had 3 suitors and they all took her on holiday and she chose my dad. It’s not a moral dilemma when all your men are the same standard. Her dad also provided for her mom. It’s not exactly a new or shameful thing .\n\nAgain if that’s how your SRs are then so be it. Sugaring is a great way to ensure you don’t have to deal with bill hagglers and guys who are actually willing to provide \n\nAgain fun all has to do with what kind of person you are, interests, how you are raised etc. I consider my dates fun. If that’s how you sugar date that’s on you. I don’t need the money my parents cover everything, SRs are fun  and hot imo and there’s a level of honesty that’s difficult with vanilla sometimes moz",
            "author": "Sugarintheorange",
            "id": "jadnt0o",
            "parent_id": "t1_jadjvd6",
            "score": 1,
            "created_utc": 1677607767.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "jadoiez",
                    "parent_id": "t1_jadnt0o",
                    "score": 1,
                    "created_utc": 1677608036.0,
                    "replies": [
                        {
                            "body": "I wouldn’t say rich at all. I also wouldn’t judge SBs who “need” the money or consider their relationships fake. \n\nAlso if you’ve grown up in that situation, I don’t know your life but I’m going to assume you’ve also encountered sb situations with your own parents which possibly inspire your participation in this lifestyle?",
                            "author": "Sugarintheorange",
                            "id": "jadpx6y",
                            "parent_id": "t1_jadoiez",
                            "score": 1,
                            "created_utc": 1677608568.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "jadrxk2",
                                    "parent_id": "t1_jadpx6y",
                                    "score": 1,
                                    "created_utc": 1677609328.0,
                                    "replies": [
                                        {
                                            "body": "I thought you were a jaded older guy, I did not realise we were the same age. But anyway the point I was gonna make is that people can be in this lifestyle for all different reasons it doesn’t automatically make their connections fake. \n\nThere’s nothing I can argue that won’t make me sound spoiled so I’ll just drop it.",
                                            "author": "Sugarintheorange",
                                            "id": "jadtqbf",
                                            "parent_id": "t1_jadrxk2",
                                            "score": 1,
                                            "created_utc": 1677610002.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "jadoiez",
            "parent_id": "t1_jadnt0o",
            "score": 1,
            "created_utc": 1677608036.0,
            "replies": [
                {
                    "body": "I wouldn’t say rich at all. I also wouldn’t judge SBs who “need” the money or consider their relationships fake. \n\nAlso if you’ve grown up in that situation, I don’t know your life but I’m going to assume you’ve also encountered sb situations with your own parents which possibly inspire your participation in this lifestyle?",
                    "author": "Sugarintheorange",
                    "id": "jadpx6y",
                    "parent_id": "t1_jadoiez",
                    "score": 1,
                    "created_utc": 1677608568.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "jadrxk2",
                            "parent_id": "t1_jadpx6y",
                            "score": 1,
                            "created_utc": 1677609328.0,
                            "replies": [
                                {
                                    "body": "I thought you were a jaded older guy, I did not realise we were the same age. But anyway the point I was gonna make is that people can be in this lifestyle for all different reasons it doesn’t automatically make their connections fake. \n\nThere’s nothing I can argue that won’t make me sound spoiled so I’ll just drop it.",
                                    "author": "Sugarintheorange",
                                    "id": "jadtqbf",
                                    "parent_id": "t1_jadrxk2",
                                    "score": 1,
                                    "created_utc": 1677610002.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wouldn’t say rich at all. I also wouldn’t judge SBs who “need” the money or consider their relationships fake. \n\nAlso if you’ve grown up in that situation, I don’t know your life but I’m going to assume you’ve also encountered sb situations with your own parents which possibly inspire your participation in this lifestyle?",
            "author": "Sugarintheorange",
            "id": "jadpx6y",
            "parent_id": "t1_jadoiez",
            "score": 1,
            "created_utc": 1677608568.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "jadrxk2",
                    "parent_id": "t1_jadpx6y",
                    "score": 1,
                    "created_utc": 1677609328.0,
                    "replies": [
                        {
                            "body": "I thought you were a jaded older guy, I did not realise we were the same age. But anyway the point I was gonna make is that people can be in this lifestyle for all different reasons it doesn’t automatically make their connections fake. \n\nThere’s nothing I can argue that won’t make me sound spoiled so I’ll just drop it.",
                            "author": "Sugarintheorange",
                            "id": "jadtqbf",
                            "parent_id": "t1_jadrxk2",
                            "score": 1,
                            "created_utc": 1677610002.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "jadrxk2",
            "parent_id": "t1_jadpx6y",
            "score": 1,
            "created_utc": 1677609328.0,
            "replies": [
                {
                    "body": "I thought you were a jaded older guy, I did not realise we were the same age. But anyway the point I was gonna make is that people can be in this lifestyle for all different reasons it doesn’t automatically make their connections fake. \n\nThere’s nothing I can argue that won’t make me sound spoiled so I’ll just drop it.",
                    "author": "Sugarintheorange",
                    "id": "jadtqbf",
                    "parent_id": "t1_jadrxk2",
                    "score": 1,
                    "created_utc": 1677610002.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I thought you were a jaded older guy, I did not realise we were the same age. But anyway the point I was gonna make is that people can be in this lifestyle for all different reasons it doesn’t automatically make their connections fake. \n\nThere’s nothing I can argue that won’t make me sound spoiled so I’ll just drop it.",
            "author": "Sugarintheorange",
            "id": "jadtqbf",
            "parent_id": "t1_jadrxk2",
            "score": 1,
            "created_utc": 1677610002.0,
            "replies": []
        }
    ]
}